{"ratings": 65968, "userreviews": [{"userName": "Angela", "userReviewDate": "May 02, 2013", "userURL": "http://www.goodreads.com/user/show/1532972-angela", "userReview": "This book came to me in such an unusual way that it is impossible to judge its contents without noting the story. I was riding the subway to work in NYC when I was in my early twenties, when a little, old, Chinese man tapped me on the shoulder. I looked up from my book and he asked me, in broken English, if I liked to read. I was taken aback by not only being touched by a stranger on the train, a no-no for regular NYC commuters, but by his seemingly random question. I gave him a quick nod and turned back to my book. He proceeded to tap me again and this time inquired as to the kind of books that I liked to read. I stumbled through an uncomfortable, wary answer feeling more than a little creeped out about his potential motive in engaging me in this way. Again, I looked back to my book and again he tapped my shoulder. This time he told me that he had a book for me. When I refused he insisted. We did about three rounds of this before I indicated that the next stop was mine and I was going to leave the train. As I stood to leave he pushed a coverless, hardback book into my hands. I couldn't see the title and had no idea what kind of book he was giving me. I have to admit that my imagination ran immediately to the deprave and I worried that he was giving me something pornographic or just plain yucky. As it turns out the book he gave me was this lovely novel. Nothing creepy; nothing pornographic or sadistic. In my attempt to recover my karma and compensate for my untrusting and uncomfortable manner the day I received this book, when I finished reading it I gave it to someone else; a stranger on a NYC train. I will say that when I passed it on, the experience was less cryptic. I simply explained how the book had come to me and that I was passing it along in turn. I have no idea where this physical book went and what became of it, but I will always associate Tara Road with positive feelings and a warm memory."}, {"userName": "Angela", "userReviewDate": "Apr 09, 2007", "userURL": "http://www.goodreads.com/user/show/42903-angela", "userReview": "My mom and sister and I refer to this as the \"smell the milk\" book. Sometimes you open the fridge and wonder what that horrible smell is, and you open the milk bottle and nearly pass out. But it's so bad someone else HAS to experience it to, so you ask whoever's nearby to smell the milk, too.I picked this book up in a grocery store in Shannon, Ireland. I was hoping for a fun, light read during my vacation. It *was* fun and sort of light, but not in the way I expected.I've truly enjoyed some of Ms. Binchy's other novels - especially Circle of Friends - but this one? Oh, the badness. Binchy skipped right over \"cozy chicklit\" and went straight to \"soap opera drama\". The characters didn't talk or act like real people. Ridiculous characters and events were thrown in like Binchy was cleaning out her fridge and making soup with the contents.I finished it before the trip ended, so my mom decided to read the book on the flight home. She'd read passages out loud to me and we'd laugh. Later, I told my sister about how awful it was, (she loves Binchy's earlier work, too) and she had to read to see just how bad it was. Honestly, I'd give it zero stars, but I got a lot of entertainment out of this book, and it remains on my bookshelf as a testimony to fun conversations with my family. Tara Road gets two stars for making me laugh."}, {"userName": "Melindam", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/36434323-melindam", "userReview": "Ria lives in Dublin, Ireland, in a beautiful, Victorian house surrounded by loving family and friends. She has great kids and is happily married -or at least she thinks so- to hotshot estate agent, Danny Lynch. But the day comes when Danny suddenly drops a bomb onto Ria's happily-ever-after. He is leaving her for a young girl, whom he also got pregnant. Ria's world is completely shattered and she does not really know how to cope with it all, when a chance phone call from America starts her on an unexpected journey.The caller is Marilyn Vine, from New England, who wants to visit Ireland and is in need of accommodation. She is eager to escape her home where memories seems to suffocate her. Her only, teenage, son died in a motor crash and she is unable to forgive herself or even to communicate about it with anyone. On an impulse the two women agree to swap houses for the summer setting a series of events into motion that none of them can foresee and that will change their lives forever. Tara Road has been a favourite book for a long time. It has all the elements that make stories by Maeve Binchy an ultimate, heart-warming reading experience.She wrote about people to people with so much sympathy, understanding and acceptance of the human heart and mind that never ceases to amaze and delight me.She also perfectly knew -while acknowledging and writing about all that sadness and unhappiness that people cause by letting each other down all the time- that there is a need for stories that turn out well or where there is at least hope for the future. And she did write them all right. Tara Road, Circle of Friends, Scarlet Feather, The Glass Lake Evening Class or Quentins are all there to prove it.All of them are highly recommended."}, {"userName": "Michelle", "userReviewDate": "Aug 31, 2007", "userURL": "http://www.goodreads.com/user/show/279319-michelle", "userReview": "Binchy is one of my favorite authors and I think this is my favorite of her books. Great for a vacation read. She always wraps her stories up in nice little bows at the end, which may not generally be what would happen in reality, but I think that's why I like it - she's good at reminding people that things always work out in the end. Also, she has really strong female characters, or ones who start out weak but find strength, usually through other great women characters, which is always something I appreciate."}, {"userName": "Cynthia", "userReviewDate": "Oct 21, 2007", "userURL": "http://www.goodreads.com/user/show/564064-cynthia", "userReview": "The reason I like this book is very complicated, but you'll love it. This is definitely a chick lit book about a woman who lives in Dublin, runs a Bed & Breakfast with her lazy husband. She is real busy working all the time, taking care of her kids. Come to find out, her husband is having an affair with her best friend.Now for the reason I liked this book. I read it and it was ok. My mother had given me a hard cover copy. I had a best friend who was a big time athlete and not much of a reader but I thought she'd like it because it moved fast and was light weight. She never read it but returned it years later after I found out she was having an affair with my husband."}, {"userName": "Obsidian", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "I have been wanting to read this book forever since this book refers to characters that are in later Binchy novels. How I wish that I had stayed away from it. This book is 656 pages. Due to a nasty cold plus fever I had the past couple of days I wondered if perhaps I was being too harsh about this book. Then I re-read some passages and decided that no I was not. I think the biggest thing for me is that I cannot believe this was once upon a time selected as book as the month by Oprah Winfrey. I am also flabbergasted this became a movie as well. I am hoping the movie cut way down on the Ireland parts, but since there is no way I am going to sit through a movie based on this book I will just blissfully let that go.“Tara Road” though it talks about two main characters is for all intents and purposes just about one, Ria. We follow her through graduating and going to work for a real estate firm where she ends up meeting her future husband, Danny Lynch. We follow Ria through I think at least 14-15 years where she is a stay at home mom, doing what she can to make her husband and children happy. That all changes when her husband informs her that he is ready to move onto someone else. When Ria realizes that her life as she knows it is coming to an end, she decides to house swap with an American woman named Marilyn Vine. Marilyn is also looking to get away from her home due to still trying to do her best to get over a tragedy.Ria is pretty much a doormat from the beginning of this book to the end. If you expect to see any self awareness, it’s not there. Even after her husband has left her, Ria is still hoping for a reconciliation. Heck, it was maybe at the 99 percent mark she finally moved on from the guy. I initially felt sympathetic to Ria since you find out pretty soon that her husband was the worst from the very beginning. I think that is why the book doesn’t work honestly, or it didn’t work for me. You are just waiting for Ria to have her eyes opened to what her husband was getting up to. And then she does, and she still thinks he is the best thing ever. Even after all evidence points to the contrary.Marilyn felt like an afterthought to me. She definitely has more backbone than Ria. But the two women’s friendship comes out of nowhere for me and I thought it a bit much for them to behave as if they are best friends forever at the end of the book.Secondary characters (man there are a ton) were pretty shallow. Ria’s sister is jealous, Ria’s daughter is pretty much a brat, Ria’s son is clueless, Ria’s best friend is terrible, etc. I just felt like the book went on and on and you don’t see any growth at all except in the case of Ria’s daughter finally catching a clue. I really hated Ria’s best friend Rosemary and her other friend who was in an abusive marriage. The book just painted them in broad strokes and I really didn’t understand what I was supposed to take away from these two characters at all.The writing was typical Binchy, but after a while my eyes started to glaze. Way too much of this book was about Ria shopping for furniture to do up her new house, wallpaper, rugs, how rooms and kitchens looked, etc.The flow was lopsided too. Once you figure out what is going on in the book most of it was just me waiting for everyone else to catch up too.I usually love Binchy novels. However, I realize that the earlier novels are never my cup of tea. They are way too long (this one is very long) and there always seems to be a lack of development or closure to the books. This one had a very abrupt ending and I hated that a guilty party was never confronted in the way that I thought they should have been. I read “Quentins” before and I do know that Ria ends up in that book as well, and you do hear about what becomes of her. But after reading this book and knowing what happens to her in “Quentins” I felt really dissatisfied. Probably because I think her happy ending as it is shown was pretty bogus."}, {"userName": "Suzanne", "userReviewDate": "Mar 04, 2008", "userURL": "http://www.goodreads.com/user/show/888138-suzanne", "userReview": "My favorite Maeve Binchy story."}, {"userName": "Educating Drew", "userReviewDate": "Dec 17, 2011", "userURL": "http://www.goodreads.com/user/show/1020619-educating-drew", "userReview": "I agreed to read Tara Road simply because the binding of the novel looked worn. I thought to myself, \"how terrible of a book could it be if others had loved it with marked creases.\" As soon as I picked it up, part of me began regretting the decision. I could not find any redeeming qualities.The novel begins with Ria, a young Irish girl talking to her sister about love and relationships. This, I imagine is used as a backdrop to illustrate the naivete of Ria (short for Maria) in the land of love. Within a couple of pages we are joining Ria as a young adult, befriending another young Irish woman (Rosemary) and meeting the love of her life, Danny. Ria and Danny quickly marry, find a grande home, and begin having children. Their lives are intermingled with family members, co-workers, and neighbors all living on or closely to Tara Road (hence the title). This continues on for nearly (or more?) 250 pages. The conversations are painful; in fact, it was unbelievable for me to believe that they were taking place in the 1980's-1990's. Historically, I understood that Ireland's culture is vastly different than America's (i.e. divorce being introduced and accepted at the turn of the century), but the dialogue amongst the Irish characters seemed outdated.The novel only becomes slightly more interesting after Danny leaves Ria for a pregnant younger woman which results in Ria embarking on a journey across seas as she swaps houses with an American, Marilyn. Marilyn's story joins the Ria drama as she begins to acquaint herself with the members of Tara Road and we discover why she ran away from her life in the States. Unfortunately, right when my interest is slightly captivated, it dwindles again. For another hundred pages I silently shudder at Ria's petulant behavior over her life's outcome. The feminist in me seriously wants to slap her and ask, \"Are you serious?\".So why did I give it a 3 star rating? Because in spite of the characters appearing rather flat, the character tree branching so far out that I had to stop many times to recount who the person was in the story, the unrealistic dialogue (from the American even!), and the frustration at how many parts of the story meandered, I found myself carry about their lives. Caring enough that I lost a few hours of sleep on a work night to finish.Would I recommend this book to someone? I don't think so. (Although I am sure that it has been heavily read as I realize it's part of the Oprah Book Club). Somewhere between a legacy and a soap opera lies the wasteland...*shrug* or Tara Road."}, {"userName": "Debbie", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/5276322-debbie", "userReview": "Tara Rd\nI enjoyed this big fat Irish family tale.\nI have a paperback and this is a fat little book at 648 pages. I've had this book on my shelves for a good long time. I don't know if it was its compact but stout size that seemed daunting or the fact that I never could get a satisfactory understand of what this was about enough to press me into reading it. Maybe because there is so much to this book it may be hard to say it all but I hope to give enough facts myself to help prospective readers make a choice. Coming off of the disturbing read prior, this was an Ab Fab choice for next book. It's not without its own high point and low point drama. However it's more relationship fueled, so it's not overwhelming at all. Tara Road is a long street at the center of a neighborhood in Dublin, Ireland. In the beginning it sort of a has been slightly rundown type of place but through the book we see its revitalization. It even begins to thrive. By the end of the book one character even calls it \"Millionaires Row\". It's slightly a rags to riches story with this road so mainly at the heart of things the author gave the title its namesake. All of the characters live and work on or at places surrounding Tara Road. Ria and Danny Lynch met while working together at a real estate agency when they were young. Danny always had big dreams. Ria had dreams of Danny. Danny made the deal of his life helping a shystie real estate seller named Barney McCarthy and fell into some good luck. He was able to not only buy his dream fixer upper on Tara Road but also make it into a glamorous house, marry Ria and start a family. Ria stays home with the children decorating and making house beautiful. Down the street, a friend Colm, also buys into Tara Rd and opens a restaurant. Rosemary, Ria's best friend moves into some luxury apartments rebuilt and owned by Barney McCarthy and Danny Lynch. Ria's mother Nora eventually moves in to a little place near a senior citizens home she volunteers at. Gertie, Ria's troubled friend also owns a laundromat on the street. Everything is busy and bubbling on Tara Rd and Ria's door is always open to everyone. Her kitchen is the focal point of neighborhood society. She always has a something cooking and a pot of something warm to drink on the stove. She's always bustling because she believes this is the happy home the Lynch's have always dreamed of. But life is not always a happy tale. The second half of the book we find every character and some additional experiencing a type of life they never anticipated. Secrets are revealed. Some characters are taken out of their comfort zone. People realize there is more to the world beyond Tara Rd. In the end it matures them all. I really did like this book. It was a bit long. Not in a bad way. That always just makes me antsy because there are so many books I want to read. But it did keep my interest. I was glad for the reality check the author brought when things started to change from Shangri la to the real world. Tara Rd would have been a mighty boring place if it continued on in the happy happy vein. So to readers who read this and start to get bored of the sapp, trust me a stirring of the pot does come. I like that analogy of the pot of life. After the stirring, once the ingredients have melded better into the stew of pot world, they do resettle in different spaces but it's better for having been stirred. That would be my sum up of Tara Rd. What was thought to be a good stew is stirred. A few new ingredients were added. Some were taken out for the best. The stew having been better combined is allowed to continue to simmer for best results. I'll give it 4 stars. I do recommend it. If you need something good but not mentally disrupting. This is it. I'd read other books by this author. Hopefully they are not all so long."}, {"userName": "Lisa", "userReviewDate": "Nov 01, 2016", "userURL": "http://www.goodreads.com/user/show/17591646-lisa", "userReview": "4.5 stars. This book is big but I enjoyed every moment of it!There's nothing new here - Maeve's style is very distinctive and always follows the same pattern - but I love that pattern!It's an epic family drama with laughter, tears and ordinary life stuff...kids grow up and make choices and become adults. There are consequences and that's that.No twists and no subterfuge so get your jammies on, light a fire and curl up with this book...it will warm your heart.(A small shout out to all the little references to fortune tellers in Maeve's books - makes me think she had the gift! Love those bits.)"}, {"userName": "Cyndy Aleo", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/5475913-cyndy-aleo", "userReview": "My first introduction to he writing of Maeve Binchy was her novel Circle of Friends, after which I read The Glass Lake. When I saw that Tara Road was chosen as an Oprah selection, I thought it would be even better.::: Girl Meets Boy :::Ria is a pretty if unspectacular girl. She lives with her widowed mother and older sister, takes a secretarial course, and takes a position at a real estate agency, where she meets the gorgeous and ambitious Rosemary and the dashing Danny Lynch. In real life, Danny would have gone for Rosemary, but in Binchy's world, the dashing fellow always goes for the wallflower, and Ria and Danny begin dating, get pregnant, and got married. Danny's ambition leads them to purchase a run-down manse on Tara Road, which Danny believes is a steal in a neighborhood that is up-and-coming. Ria leaves the real estate agency after Danny steals a client, and aligns himself with the prominent businessman Barney McCarthy, an adulterer, risk taker, and all-around slimy character.With Barney as his role model, Danny ends up leaving Ria for his pregnant 22-year-old girlfriend, and Ria, after a spur-of-the-moment phone call, engages in a house swap with an American woman, Marilyn, who is also going through a crisis. Both women try new things and make changes in their lives over the two months they are in each other's homes, with a happy ending all tied up neatly in a bow.::: Great Writing in a Bad Novel :::The great thing about Maeve Binchy's novels is that she can make a bowl of instant pudding into a chocolate torte. Her writing style is rich, and she keeps the action moving with inter-related sub-plots, such as Ria's friend Gertie's marriage to an abusive alcoholic. Binchy also excels at keeping the reader guessing with plot swerves and twists that you never see coming. Even with a large cast of characters, the character development is so incredible that you feel you know each and every one of them, and actually find yourself interested in their stories.Of course, that makes it sound like I loved this book, and purely from a mechanical standpoint, I did. But I was amazed that Oprah picked this as a selection. Judging from my experience reading Tara Road as well as The Glass Lake and certain parts of Circle of Friends, you'd think that Binchy has some obsession with women who just can't stand up for themselves. Each and every woman in Tara Road, with the possible exception of Marilyn, is wronged by a man (or men) again and again and again, and never seems to learn from it. Gertie stays with her husband even though he beats her and terrifies her children and makes her clean houses of her friends in addition to her regular job to pay for his alcohol. Ria's mother was widowed by a man who left them no insurance and no pension to live. Ria's sister Hilary marries a man more interested in pinching pennies than anything else, and ceases to have sex with her when they don't have children.And then there is Ria. Tara Road seems as if it is supposed to be a story of triumph, of a woman who built her life around a man only to have her life demolished in front of her, then picks herself up by her bootstraps and moves on. If that was what Ria actually did, I would have been singing the praises of this novel to anyone I met. But the problem is that Ria, just like every other woman in this novel, would still take Danny back. He leaves her for a younger woman. He allows a lien on their wonderful home to finance his boss' shady business dealings. He is the most unbelievably self-centered man in the world, and even after everything he does, Ria would still take him back, and go back to the way things were, and I have a hard time accepting that as a triumph.::: If She Won't Kick Him to the Curb, I Will :::Perhaps I wanted more from Ria, and from Tara Road, than is realistic. I know that there are women out there in the same position as Gertie, getting beaten and selling their out-of-touch families on a fairy tale story of a marriage, and like Ria herself, trying hard to stand on her own and still failing because of her obsession with a man who never did love her back. The sheer excellence of Binchy's writing elevates Tara Road to a two-star rating, but that's as high as I'm willing to concede.This review originally published at Epinions: http://www.epinions.com/review/Tara_R..."}, {"userName": "Patricia Devereux", "userReviewDate": "Jun 01, 2009", "userURL": "http://www.goodreads.com/user/show/1407016-patricia-devereux", "userReview": "I have to admit, as a book snob, I kind of look down on authors who are wildly popular. But I had heard of Binchy and, hey, \"Tara Road\" was in the one-for-one paperback exchange at my library's book sale, so I picked it up. I was instantly sucked in to the characters' complex relationships, their longings, divorce and romance struggles, motivations, eforts to better themselves.The dual stories of the two divorcees on both sides of the Atlantic who exchange homes was a great plot device. I was fascinated by the contradictions in modern Irish society -- the ethics of Catholicism still reign supreme. This, of course, includes casual philandering by all of the men and the resignation of their wives.The protagonist's devotion to maintaining the perfect bubble of her placid home life and motherhood is shattered when her husband impregnates a young airhead. Her attempts to rebuild her life will resonate with many divorcees facing the same situation.The implicit punishments inflicted upon Rosemary, who chooses freedom and her career over husband and children, will strike home with any woman who has made that choice. As a \"Rosemary,\" I call myself the \"eccentric spinster.\""}, {"userName": "Swanbender2001", "userReviewDate": "Aug 05, 2009", "userURL": "http://www.goodreads.com/user/show/2580984-swanbender2001", "userReview": "This was my first Maeve Binchy and it will not be my last. The story starts with Ria, living in Dublin and married to the charismatic Danny Linch. She believes nothing could be better about her life except to have a third child until the time comes to discuss this possibility with her happily married husband. Only to discover he is having a third child with another woman! Ria’s life is turned inside out and upside down and so are the lives of her young son Brian and 15 year old Annie. Just when things look the worse for Ria she receives a phone call from Marilyn Vine in the US asking if she knows of any houses available for a month or two in the summer. Ria and Marilyn exchange houses and a little bit of their lives for the two months in the summer and Marilyn finds solace and comfort and finally is able to come to terms with the death of her 15 year old son in Ria’s home and amongst Ria’s friends. Ria, on the other hand, finds herself and branches out and learns many things about herself and finds a strength and resolve to move on without Danny."}, {"userName": "Booknblues", "userReviewDate": "Aug 30, 2012", "userURL": "http://www.goodreads.com/user/show/4280875-booknblues", "userReview": "It has been quite some time since I have read a Maeve Binchy book, but I remembered her wonderful Irish stories about human relationships and emotions and the realm of goodness and the sorrow of misunderstandings. I also remembered I should have a box of tissues close by and sure enough Tara Road proved true to form.Ria Johnson a somewhat awkward and insecure young secretary meets incredibly handsome Danny Lynch at work and they fall in love and move into their dream house on Tara Road and have two children. As Ria settles into family life she blossoms, she gathers people she loves around her and the house buzzes with energy. Danny becomes a successful real estate agent.As any reader knows anything so perfect cannot last and that is as much as I will say without revealing all. What Binchy does so well is create believable characters who we suffer with. Ria is a person who we all would want for a friend. She is loving, fun-loving and loyal. I’d love to sit around her kitchen table and have tea.Who wouldn’t want to take a journey to Tara Road and visit Ria?"}, {"userName": "Morana Mazor", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/30488471-morana-mazor", "userReview": "Ovaj puta sam išla na sigurno sa Maeve Binchy... Volim kako ona piše, tako da tu nema nekih iznenađenja..Knjiga samo može biti više ili manje dobra.. Ova je, eto više dobra.. Mislim da vas je većina upoznata sa njezinim knjigama, a tko još nije..pa, vrijeme bi bilo da se upoznate.. Kuća u Ulici Tara bila bi izvrsna za početak..."}, {"userName": "Rachel", "userReviewDate": "Nov 07, 2010", "userURL": "http://www.goodreads.com/user/show/2097698-rachel", "userReview": "This...was an absolute waste of my time. When I think of the time I could've spent studying, there's a sense of emptiness in me that Maeve Binchy has stolen a day or two of my life that I will never get back. No, no...it's more than that...it's like a sense of betrayal even. Maeve was supposed to be funny. She was supposed to be funny and witty, like she was when she wrote Aches and Pains. This is one of the reasons one should never go reading a book expecting anything. In retrospect, I thought that Tara Road would be about, I don’t know…strangers who keep meeting each other on the road and have a chat about their everyday life and maybe the story could expand to some sort of adventure/mystery thing, I don’t know. Here’s what Tara Road is actually about:Woman from poor family background meets man from poor family background. Man has a dream to buy the house he’s currently boarding and transform it. The woman is Ria and the man, Dan, known for most of the book as Danny Lynch, and right from the start Maeve wants you to be a little wary of him. Why else would she give him the name “Lynch”? It wouldn’t make sense. She made this character out to be an all-charming, handsome, sociable, loving, wily, and extremely likable man with ambition, and off she goes and names him “Lynch”. Back to the story: By some form of twisted luck and through Dan’s craftiness, they get the house, and go on to fill it with wonderful treasures blahblah. Ria is pregnant, Danny is irresistibly handsome , and because he’s helping his adulterous new boss and boss’ mistress, he’s not there for the birth of his first child. Also, at the time, some alcoholic skanky girl was trying to seduce him. Since he didn’t fall for anything, we assume he’s ever loyal. Then it goes on to say Danny has affairs. Danny ends affairs. Ria is oblivious. Ria has a friend Gertie who married an abusive alcoholic. Ria’s mother is the town gossip, and her sister is a sad scrooge. Boohoo. Ria has another friend Rosemary who nobody appears to like even though, and maybe even because, she’s successful and hot. Gertie cleans her friend's houses for her husband’s drinking money. Ria has another baby, baby grows up. Ria’s daughter accidentally sees Rosemary having sex, traumatized for life. Rosemary has funky feelings for a man named Colm (who owns a restaurant, is oddly protective of his sister, and grows his vege behind Ria’s house on Tara Road). Colm is always helpful, and that's about the only use for him in the story. Ria wants a third baby. She approaches Danny, and finds out he’s got another girl pregnant. Cries, cries, begs him to come back. Children are heartbroken. Ria spies on preggo and her mom, and finds out the dear mom is her age. Awkward. There’s some BS about a fortuneteller, but that isn’t in any way relevant to the story. In fact, a good chunk of the book is just Maeve Binchy’s way of telling trees and environmental activists that they can sod off because barring any divine intervention she’s going to ramble on and on unnecessarily about characters that I personally can’t relate to and a story that should have taken a whole lot less than 200 pages to flesh out. One consolation, Hallelujah, is that she filled the pages with whole paragraphs of words instead of the name of each passing month.And lo and behold, was I shocked when I came to chapter 4. I hadn’t realized there’d been any chapters in this never-ending jumble of words and more words, let alone reached chapter 4. So, just for this review, I flipped back and hah…there’s chapter 1, and there’s chapter 4, with nothing between or after. I’m surprised she put a pause there at all. I suppose it’s to indicate a passage of time. Either that, or she wanted to bring it to my attention I’d hit page 200, and there’d be 288 pages of fun left to go. FM.So on and on I did read, and suddenly, this American woman Marilyn is literally thrown in out of nowhere, looking to do a house exchange. And then I thought: Shit. It would’ve been so much more interesting as a book had I been introduced to Marilyn at roughly the same point as Ria. It wouldn’t have been hard to do really… to stuff her into that 200 pages and take a bit out of Ria’s story. Maeve Binchy enjoys weaving out of other characters’ lives around Ireland like a drunk driver. I expected to be ambushed with another 200-page introduction to the life of Marilyn, but fortunately, Maeve cannot stay away from Ria, sweet, weak, wonderful chef, ever loving mother, doting wife, innocent, tolerant, moral Ria. Flawless in all ways but her blindness to any living souls’ faults.Eventually, the house exchange begins, and the two women never meet. Ria is all about being around people, whereas Marilyn is a recluse. Ria finds herself a new bunch of friends, and Marilyn is set up by Ria to be ambushed by her own friends and family. Eventually as things go, they fit in, and grow in ways they never had to and heal. One can see a mile away that Marilyn is running from something, and it’s obvious to everyone, if not Ria, that Marilyn lost her son Dale. To save the trouble of having to endure 200 pages of this, the gist is:1)\tRia attracts the attention of Marilyn’s brother-in-law. Learns how to email. Learns about the true story behind Dale’s death that is totally redundant.2)\tRia’s children—Annie and Brian—help Marilyn get over the loss of her son.3)\tRia’s children stay with her in USA for the second month of her stay. Two boys rival for Annie’s attention, one of whom is Gertie’s (alcoholic’s wife) nephew.4)\tMarilyn helps Cobb’s sister (who is revealed to be a heroin addict, eventually clearing all absurd accusations that they committed incest) to break the addiction5)\tMarilyn walks in on Rosemary cheating with Danny Lynch. She uses this to blackmail Rosemary into helping Ria with her new career in the food-export business.6)\tDanny and his adulterous boss, Barney McCarthy, suffer major losses in business and nearly go bankrupt. They have to sell Tara Road7)\tDanny Lynch visits Ria in the US of A to tell her this and ends up sleeping with her. 8)\tDanny’s mistress loses the baby. Danny does not go back to Ria.9)\tBarney McCarthy’s wife saves them all from the brink of bankruptcy, on several conditions, one of which includes leaving his mistress.10)\tGertie’s abusive alcoholic of a husband dies. Everyone shows up at his funeral. Gertie rewrites history to say he was the best husband in the whole world.11)\tFortuneteller disappears. All her predictions were accurate. Whoopie for her.All in all, this is a damn gossipy book. I wasn’t bored reading it, and that’s about as high a praise that can be heaped on this colossal waste of time. I found no satisfaction at all from reading it. I wouldn’t even call it a beach-read, because it’s just too full of negativity. But perhaps I don’t enjoy it because it wasn’t intended for my age group, but that’s hardly an excuse is it? There are books people would enjoy at age 60 just as much as they would if they were 16. Oh well, if I feel like wasting another day of my life I’ll pick it up again at age 40 maybe, and perhaps then, I would appreciate the so-called “light-hearted” cynicism/realism Cow Poo. I sincerely hope not."}, {"userName": "Lizabeth", "userReviewDate": "Aug 11, 2012", "userURL": "http://www.goodreads.com/user/show/527287-lizabeth", "userReview": "If I could, I would give it a 3.5 stars. I liked some of the themes presented in this book: abuse, friendship, commitment, love, children. I did not like the soap opera type of story. My husband asked what I was reading and I told him confidently that it would fit right in as a Lifetime movie. I don't normally read that type of literature (or watch Lifetime movies, well, except perhaps at Christmastime!). I was drawn, however, to Binchy's writing. She writes very well and the story lines are complex enough to keep you reading. I enjoyed the story but didn't like the \"ignorance is bliss\" toward the end of the novel. I think she represented Ireland well and illustrated comedic and tragic irony throughout the thoughts of Ria vs. her actual life. Her writing reminds me of Anne Rivers Siddons - very good writers, good characterization, interesting stories with some thematic elements, usually wrapped in a nice, romantic bow with closure -- nothing wrong with that. There isn't much depth, though, to make one think a la E. Annie Proulx \"The Shipping News\". Good, relatively lighthearted fare."}, {"userName": "Icewineanne", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/7011157-icewineanne", "userReview": "Such a wonder heartwarming, addictive story. My favorite of all of the Maeve Binchy novels. 10 stars"}, {"userName": "Bettie☯", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Watched the film - chucked the book!"}, {"userName": "Stephanie", "userReviewDate": "May 23, 2016", "userURL": "http://www.goodreads.com/user/show/45337-stephanie", "userReview": "I wanted to read an Irish book while on an Irish vacation. Except that I only found this book on my second to last day of Irish vacation. So it spilled over into a \"back from vacation\" read. I dont know why I'm telling you this.Listen, was this book entertaining? Yeah, somewhat. It was also a terribly big bag of rotten trash. Dude, these characters are some of the most spineless, ridiculous women in the history of literature. I wanted to scream so many times, \"You've got to be kidding me!\" The women in this book are unbelievable. Will no person tell what's her face that her husband is cheating on her? And are we really supposed to believe it is partly her fault that her husband has cheated (e.g. she kept the house too busy)? For real?And dude, when you're writing an American character, you have to make her sound American! Americans don't say things like, \"Aren't we magnificent?\" I can't. I'll leave you with this gem. \"He had a purr like the engine of a small boat on the lakes of Upper New York State.\""}, {"userName": "Teeliles", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/1474246-teeliles", "userReview": "I've read this book over and over; Maeve Binchy -- who, I was distressed to learn, passed away earlier this year -- always gives this reader her money's worth. While I've enjoyed all of her novels, this remains my favorite. Definitely light reading, but her characters (new and recurring) are always so appealing, the plots always interesting, and her descriptions of Irish life, whether in the countryside or in Dublin, always compelling. Don't be surprised if you start asking people to \"mark your card\" rather than asking for advice, referring to blankets as rugs or sweaters as jumpers, and describing self-importantly people as \"jumped-up\" after reading a few of her books!"}, {"userName": "LISA", "userReviewDate": "Apr 08, 2008", "userURL": "http://www.goodreads.com/user/show/85827-lisa", "userReview": "OK maybe it was just my mood, but I was bored to tears ... I listened to more than half, all the while thinking \"I have to stop this\" but I continued hoping somehow I would even care ... I must have spent 7 hours or more listening! OMG.I am so glad I stopped & couldn't care less what happened to thet characters. However, on a positive note, if one were really interested in Ireland, it's people and such, perhaps one could enjoy One Star's Worth here !"}, {"userName": "Iluzija O. Istini", "userReviewDate": "Nov 23, 2014", "userURL": "http://www.goodreads.com/user/show/5922129-iluzija-o-istini", "userReview": "A friend left me this book after she finished it while passing through the city I was living in.About two weeks ago, since I was missing her, I decided to take it on.Amie, girl, what the hell? XD"}, {"userName": "Aashikhan", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/41482470-aashikhan", "userReview": "I hate giving bad rating BUT THIS BOOK SUCKED A BIG DEAL!!!! Sure anther's writing style was very entertaining and good (and I am giving two stars for that!) but even though book had 670+ pages, it was still rushed. TBH I hate it because 1). the main character is the one which I hate the most: woman who refused to let her man go even after knowing he is a bastard. I felt sympathetic until I read further. 2) PUBLISHER'S NOTE WAS MISLEADING!!! okay it was suppose to be the story of 2 women who accidentally discovered each other while living miles and miles away from each other. They DID discover each other but after half of the book is over. The word 'friendship' was misleading. they both are jealous of each other until they find what is going on behind the scenes which happens *spoiler alert* in the end. 3) Authors need to STOP PORTRAYING TEENS AS BRATS. sure teen years are not really parents friendly but they aren't THAT BAD!!! My mother has no sense of fashion but that doesn't mean I hate her. Its plain stupid to assume that. 4) The main character is happy because her husband *spoiler alert* losses his child and she thinks he would now come back to her. 5) Author didn't show me as promised by fortune teller, \"Entrepreneur Ria Lynch\". Ria's son and her mother and their friend who was a gardener (i forgot his name) were the only characters I loved. Everyone else was confused and messed up including Ria's very own daughter."}, {"userName": "Heather", "userReviewDate": "Oct 13, 2008", "userURL": "http://www.goodreads.com/user/show/1308011-heather", "userReview": "There was a time in my life I would have turned away from a book because of it's size. This one would have gotten passed because of this size. I'm glad I didn't pass it up.Maria (Ria) is a very unselfish woman living in Ireland on Tera Road. Her life fell into her hands by the luck of her husband, Danny, and his real estate working with Barney McCarthey. This is a tale of many lies revolving around these men, with wives who turn a cheek to their indiscretions. Ria is very social and her friends and neighbors play an important role in this well written story. Some of the friends turn to be anything but that by the end though. Through a chance phone call Ria's life takes a turn for the better. After receiving some very upsetting news from her husband, Ria has the opportunity to leave her troubles behind and spend the summer in America by swapping homes with Marilyn. Marilyn has her own share of heartaches that need to be handled and gladly accepts the house swap for 2 months to escape to a new land as well.This book was very well written, and caught my interest from the beginning. I can not wait to pick up another book by Maeve Binchy. She is a wonderful author."}, {"userName": "Donna", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/5555458-donna", "userReview": "The things that make Binchy's book so appealing were all here. Normally I hate complicated character lists but hers are tolerable. I think it's b/c she breathes such life into them. That being said I found myself getting a little bogged down in the secondary & tertiary children in the book. It might be due to them just getting a mention but not really any dedicated descriptions. I was also a little put off by having knowledge of Danny's affair, from the cover flap, but not getting to it until 170 pages in. It's like having a secret you can't tell anyone. You're about to bust a seam hoping somebody else spills the beans. Get on with it, would you? Otherwise, typical Binchy, emotional, dreamy, disastrous & hopeful."}, {"userName": "Jeanie", "userReviewDate": "Jun 11, 2008", "userURL": "http://www.goodreads.com/user/show/1106665-jeanie", "userReview": "Easy, light-hearted, Summer read. Kinda reminded me of the TV show Desperate Housewives. It's the story of women and their relationships (good & bad) with each other, the men in their lives, and the facade of the \"Cinderella life\" or \"Keeping up with the Joneses.\"This author also wrote Circle of Friends which was also a movie. Her books are consistent and good. They dive deep into the minds of women and what they're really thinking & what they really want or think they should want. :-)"}, {"userName": "Shelley", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/6592265-shelley", "userReview": "As I'm not a big fan of soap opera type shows, I found this book pretty pointless. But, I'm not one to give up easily, so I finished it just so I can get it off my 'to read' list.If you are looking for a book to take on a camping trip, that could also double for fire starter, this is the book for you."}, {"userName": "L.   (Super Easy. Barely An Inconvenience.)", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/5954350-l-super-easy-barely-an-inconvenience", "userReview": "I gave it the old 50 Pages try and that's all I'm giving this book. Nothing happened for those fifty pages. Absolutely nothing. The fortune in your cookie has more emotional impact. Donald Trump's tweets have more narrative. The list of side effects for Humira are more riveting."}, {"userName": "Pinchy", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/21960444-pinchy", "userReview": "Ne vem, kaj naj si točno mislim.http://bukla-na-buklo.blogspot.si/201..."}], "description": "Ria Lynch and Marilyn Vine have never met. Their lives have almost nothing in common. Ria lives in a big ramshackle house in Tara Road, Dublin, which is filled day and night with the family and friends on whom she depends. Marilyn lives in a college town in Connecticut, New England, absorbed in her career, an independent and private woman who is very much her own person.Two more unlikely friends would be hard to find. Yet a chance phone call brings them together and they decide to exchange homes for the summer. Ria goes to America in the hope that the change will give her space and courage to sort out the huge crisis in her life that is threatening to destroy her. Marilyn goes to Ireland to recover in peace and quiet from the tragedy which she keeps secret from the world, little realising that Tara Road will prove to be the least quiet place on earth.They borrow each other's houses, and during the course of that magical summer they find themselves borrowing something of each other's lives, until a story which began with loss and suffering grows into a story of discovery, unexpected friendship and new hope. By the time Ria and Marilyn eventually meet, they find that they have altered the course of each other's lives for ever.", "title": "Tara Road", "url": "https://www.goodreads.com/book/show/5196.Tara_Road", "average": 3.89, "cover": "https://images.gr-assets.com/books/1403194637l/5196.jpg", "reviews": 1859, "authors": [{"url": "https://www.goodreads.com/author/show/3532.Maeve_Binchy", "name": "Maeve Binchy"}], "type": ["Fiction", "Womens Fiction", "Romance", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/5196.Tara_Road", "http://www.goodreads.com/book/show/421440.Tara_Road", "http://www.goodreads.com/book/show/8134199-tara-road", "http://www.goodreads.com/book/show/3123515-tara-road", "http://www.goodreads.com/book/show/25279397-ku-a-u-ulici-tara", "http://www.goodreads.com/book/show/845782.Tara_Road", "http://www.goodreads.com/book/show/3123514-tara-road", "http://www.goodreads.com/book/show/41977.Circle_of_Friends", "http://www.goodreads.com/book/show/41967.Evening_Class", "http://www.goodreads.com/book/show/15990489-a-week-in-winter", "http://www.goodreads.com/book/show/41951.Scarlet_Feather", "http://www.goodreads.com/book/show/41950.Quentins"]}