{"ratings": 325, "userreviews": [{"userName": "chris", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/40249123-chris", "userReview": "Julia did it again, love this series and cannot wait for her next book!"}, {"userName": "Myst", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/50985428-myst", "userReview": "Always a 1 click buy by this author! Little confusing in that the book is out of publishing order due to the fact this was released as a set around halloween before coming out as a single. You do not need to understand #17   before this. Liked we hear more about Lugh's son. I hope he finds someone. The spin off series is interesting, are they the woman who we meet during the youngest brother being sick by hellhound or the ones we meet in this book?"}, {"userName": "Monica", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/40429899-monica", "userReview": "I had this in my TBR pile as owned but not read. I started to read it and I knew I read before...turns out I forgot to review it! Ha. Oopsy! This is the story of the black dragon Kyran and his mate Caitlin who is part banshee. Both were tortured by the Twins O'baoills. Both in different ways but have suffered tremendously. Kyran is so freaking stubborn though and I just never thought he'd get it together in the beginning. Caitlin never gave up on him though. They'd see it all through and mate and be happy! She was determined to save her dragon!"}, {"userName": "Rhi", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/7829692-rhi", "userReview": "Tears for her Dragon is part of Julia Mill's popular Dragon Guard series. I suggest for the highest emotional impact that you have read the previous books in the series. I have not read them all and while I enjoyed it, I'm almost certain I would have enjoyed this more had I done so. Kyran is a Black Dragon and was held prisoner by the evil hunters who tortured him. He escaped with the help of his brethren but has vowed vengeance on Eve - the head hunter and the one who has been experimenting on shifters. However, he's drawn from his cave to a secluded house where he meets Caitlyn. Caitlyn is blind, her only companion a german shepherd named Duke. Caitlyn is also his mate and another victim of the evil hunters. Together, they can take vengeance on the one responsible for their pain. There is a lot going on in this book and it is a fast book to read. If you've liked Ms. Mills other books in this series, than you will likely enjoy this. As with many of her books, I found that she moved a little too quickly for my tastes and I was often left confused as to who characters were and what their specific powers were. In fact, the pace was so quick that it seemed that events that happened that were supposed to lead to a confrontation or an issue were instead brushed aside. I didn't really feel an emotional connection to the characters and that made the climax difficult to feel anything more than indifference."}, {"userName": "Nikki Brooks", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/27612853-nikki-brooks", "userReview": "Kyran has only just managed to escape from his own person hell, courtesy of the O’Baoill’s. BUt he is drawn to a ridge overlooking the home of Caitlin Brookes. He has no clue why but he feels the overwhelming need to be near her, protect her. Unbeknownst to him, Caitlin is way more than just a passing fancy, she is his mate! Caitlin has been through trauma of her own but she has reclaimed some independence after losing her sight. She has her own supernatural secrets and she totally flips Kyran mind when she calls him out on his...otherness! They both have a right to vengeance against the O’Baoill’s. Caitlin just has to get the idiot to realise that as a Banshee she is capable to defending herself, she is not quite as fragile as he'd like to think! There are little vignettes into the past tortures endured by Kyran and that really helps to cement the level of malevolence to which the O’Baoill’s have stooped. Caitlin is a real steel magnolia, all soft and fragile looking but with an inner core of steel! There is a lot to love about this book. The only reason it's not a 5 star review is that as an actual Scot, I hate characters within books mangling the dialect! It's really disjointing trying to work through the authors attempt to portray the admittedly guttural accent we have but sometimes it just comes across as comedy highlander sadly. But if you can ignore that then the pace, plot and characters themselves are wonderfully crafted."}, {"userName": "T.M. Payne", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/16543761-t-m-payne", "userReview": "Book: Tears for Her Dragon (Dragon Guard Series Book 16)Author: Julia MillsPublication Date: 1/22/2017Reviewed by: Tammy Payne- Book Nook NutsMy Rating: 5 StarsREVIEWWe finally get Kyran' story and what a story it is. Kyran retreated after the last battle and went to live out his long life in a cave while there however something pulled him to a little cabin. In that cabin lived a beautiful woman with her German Sheppard dog. He knew immediately when he was invited in to meet her finally that she was his sun. Kyran had been tortured by the hunters for so many years. Kyran is so much more than dragon. How could the fates show such mercy by gifting him this beautiful person? Caitlin is a very strong woman who lives with demons of her own. On top of that the one woman she thought she could trust well let's just say she will get what's coming to her. What Caitlin lacks in site her other senses are stronger than anything Kyran has ever known. Can these two total opposites have a lifetime together?Well grab your copy and get reading. I absolutely loved Kyran's book he became a favorite of mine a few books back in this series. Julia Mills"}, {"userName": "**Elle**Bee**Double U**", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/29621401-elle-bee-double-u", "userReview": "I picked this book up while it was on sale, and was worried that I wouldn't be able to keep up since I haven't read any of this series since like the 8th one. However, I shouldn't have worried. This is one of the reasons I love Julia Mills' books. I can read them out of order and won't feel like I'm lost and can't follow the storyline. Ugh! Can I just say that epilogue? Makes me have to go out and buy more books because I have to find out who's next!Kyran, a black dragon, is alive and breathing, but he's not really living. After surviving the tortures at the hands of hunters he's vowed he will get his revenge. But his dragon seems to be drawn to the raven haired beauty living alone in the cottage. He never expected to discover she'd be his other half.Caitlin has had a painful past too, by the same hunters who tortured Kyran. A mixed banshee and gypsy, she knows immediately about the black dragon spying on her. After the first meeting she knows immediately who he is to her. But will the demons of their past keep them from future with each other?"}, {"userName": "Brandy Mulder", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/25687993-brandy-mulder", "userReview": "I have not read any of the other books in this series, so I was prepared for there to be things that were thought to be understood by the reader since it is pretty far in to the series. There were a couple of moments where I was like wow that happened quick but as the other dragons went with it I am guessing it is a normal part of the mating bond. I love that his lady is blind but far from helpless. She is just as fierce as he is, and just as dangerous in her own way. There is violence and adult content."}, {"userName": "Wendy Bianco", "userReviewDate": "Jun 20, 2017", "userURL": "http://www.goodreads.com/user/show/18257112-wendy-bianco", "userReview": "Kyran is a rare and powerful Black dragon. After being imprisoned and tortured for over a century, escapes to seek revenge. What he doesn't plan is finding his one true mate. Caitlin is part gypsy, part banshee and everything Kyran needs. What he hadn't counted on was that Caitlin need revenge every bit as he did.This is another great installment in the Dragon Guard series. While is does have characters from other stories, this is definitely a standalone. Can't wait for the next one."}, {"userName": "Helen Cox", "userReviewDate": "Dec 16, 2017", "userURL": "http://www.goodreads.com/user/show/64812882-helen-cox", "userReview": "A wonderful love storyThis is just so wonderful the story of Kyran and Caitlin. Finding each other and becoming each other’s savior awesome. A deep connection only they can understand and an instant love that allows her to see through his eyes is amazing. A must read for a romance reader you will not be disappointed. And the pure evil they fight is such an awful thing to experience but good fighting evil is the way it’s always been. I really enjoyed their story."}, {"userName": "Mary", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/67565139-mary", "userReview": "INTERESTING SERIES, BUT BECAME REPETITIVE AFTER A FEW BOOKSAfter reading a few of these, I decided to write one review for all of them. I found these books to be pretty good, if somewhat formulaic. If a reader is looking for a good story with some drama & where the main characters go through some terrible things, but ultimately end up together, I think they will enjoy this series of books. It is sometimes nice to read a \"happily ever after\" story."}, {"userName": "Deborah", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/26473864-deborah", "userReview": "He Can't Leave HerThis is a quick read about a black dragon who escaped being tortured. He's been hiding in a cave ever since but he has a strong pull toward a cabin with a young woman and her dog living there. This young woman has gone through agony. She saw her family killed when she was a child. She's been waiting for her dragon to finally come to her because he's her mate. Enjoy I did."}, {"userName": "Hsu Lee", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/18910402-hsu-lee", "userReview": "ARC - I voluntarily offered to review this book and my opinions are honest!I loved this book!This was really a love/romance book.I loved how Kyran was loving toward Caitlin.I love when an Alpha character is not afraid to show his tender / emotional side.Even though Caitlin was blind, she did not let it slow her down.She was determined to live her life to the fullest.I can't wait to read the next book in the series."}, {"userName": "Cheshire", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/57398726-cheshire", "userReview": "I've been following this series and love it. This book could be read alone, but is best understood in series due not only to other characters but a small yet important part of the plot which runs through the series. It did have some spelling/grammar errors along with a few formatting errors, but they were minor."}, {"userName": "Kristine (A Cozy Booknook)", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/18918861-kristine-a-cozy-booknook", "userReview": "I really enjoy this series and this book is no exception. The story quickly grabbed my attention and kept me turning the pages. I was drawn to the characters and wanted to see them both happy after so much turmoil. This book can be read as a stand-alone however, I recommend reading the series in order for greater enjoyment."}, {"userName": "Rhonda Jones", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/29054644-rhonda-jones", "userReview": "Awesome TaleNever underestimate a blind woman. Her Dragon is about to find out how much determination this woman has. After a century of torture, the Dragon is going to find out what a powerful mate he has. Because evil still threatens them both. This was an awesome story. I loved it."}, {"userName": "Vickie", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/44112002-vickie", "userReview": "OMGThis story of kyran and Caitlyn . Same as the other stories in this series, this was a book that I just didn't to put down . Love love love these dragons. I keep being grateful for the one more story!!! Each story is a stand alone story,but I have been reading 📚this series in order ,that would be my recommendation. Happy reading"}, {"userName": "Pamela Huggins", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/22394903-pamela-huggins", "userReview": "This is a good book!I enjoyed this book. So happy the black Dragon got a book. Him and Cait are great together. The only problem was the way she wrote how he talked interrupted the flow of the story. I understand why she did it, but to me I could have been pulled back some. Overall I liked it and would recommend this book and series."}, {"userName": "Ashley Martinez", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/14428981-ashley-martinez", "userReview": "Tears for Her DragonA fantastic fast paced story full of sexy strong willed characters. I loved the tension and the love flowing between the characters. I really enjoyed their adventure and meeting new characters and creatures. I look forward to seeing more and discovering what happens next!"}, {"userName": "Cary", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/14460910-cary", "userReview": "Never fails to deliverJulia's books always find the way to pull me into her spell. They deliver much more than earthshaking romance but adventures that keep you glued to the book. Every book is better than the one before"}, {"userName": "Dawn Wright", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/12598444-dawn-wright", "userReview": "I have read and re read all of Julia Mills' Dragon Guard Series. This book is just like the rest in the series. The connections between the characters and the vivid portrait Mills' paints with her words leads the reader on an unprecedented adventure. All I can say is,\"More please!\""}, {"userName": "Sandy", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/29740201-sandy", "userReview": "Dragons, banished, hellhounds oh my!All the paranormal beings you could ask for in this story. This is the first book in the series I've read. I have a lot of catching up to do!"}, {"userName": "Nikki Bao", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/27105042-nikki-bao", "userReview": "Another great book by Julia Mills and another great addition to the Dragon Guard series.Kyran O'Connor and Caitlin Brookes are mates as determined by the Universe. Both of them want revenge on the woman who caused them so much heartache and pain. Grab it to find out the rest."}, {"userName": "Diane Freeze O'Bryan", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/39764363-diane-freeze-o-bryan", "userReview": "WowJulia, you just keep whipping them out, and they just keep you wrapped up in love, compabionship, hero's and heroin's, I love me some Dragon Guardshifters!"}, {"userName": "Maggie Whitworth", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/58491300-maggie-whitworth", "userReview": "❤️❤️❤️💋💋💋A really good book and story . Loved hearing Kyran and Caitlin’s adventures. However, the way the Scottish accent is written was not authentic and very off putting"}, {"userName": "Fred", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/25121005-fred", "userReview": "His and her tears all mixed together to make one and heal two lost souls!This was a good work of art by a master storyteller and will read the next chapter in this ongoing tail!"}, {"userName": "Cathy Pulver", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/58774624-cathy-pulver", "userReview": "Love the Dragon GuardEach book just gets better. I cannot wait to read the next book in the series. Love reading about the characters from the previous books"}, {"userName": "Lori Hammons", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/26948739-lori-hammons", "userReview": "I just loved Kyran and Caitlin's story. I love how a woman with a disability is a strong, capable person. I also loved Kyran's accent as written in the story. In this story, love definitely wins!"}, {"userName": "Sandie", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/11225872-sandie", "userReview": "Oh that Gaelic accent!I love reading in an accent! It is so sexy. And this book is full of sexiness as seen thru a mate's eyes. Thanks Julia Mills for another view point."}, {"userName": "Linda Levy", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/30896044-linda-levy", "userReview": "I read this in the box set SHIFTERS HALLOWS EVE and Ms Mills kindly gifted me a copy of the new extended version.I love this series but what makes this book stand apart is this story was away from the Lair of the Blue Thunder Dragon Guards and is a slightly different set of circumstances. Made for a nice change of pace. Kyran as we know, has suffered a century of untold torment and torture at the hands of the O’Baoills. His background story started at the end of Scars of her Dragon and we learnt a lot more as it was threaded through the last book Her Mad Dragon as well.Caitlin is visually impaired due to the actions of the same evil b**ch who tortured Kryan for over a century. Caitlin is part Gypsy and part Banshee like Kyran who is also half Banshee. Like calling to like.Finding out Kyran was being poisoned by Black Magic Caitlin uses a spell to remove the dark magic which is when they find out her nurse/carer is really working for the O’Baoills.Kyran and Caitlin deal with the treacherous woman just before we have some of the Dragon Guards turn up that were tracking Kyran down. I was a bit upset Caitlin did not get all the trappings that go along with mating a Dragon Guard, the pomp and ceremony that is such a part of this series and hope Kyran keeps his word to have another ceremony at the Lair.This is where the extended version starts. Oh wow, once again Ms Mills brings us such a lot of action and suspense.Kyran being an idiot male, manages to hurt lovely Caitlin with his macho behaviour but Caitlin forgives him without the ass kicking he deserved. Our group manage to save more shifters being held by Evil Eve and deal with some dark unknown evil force Eve had imprisoned which is now on the loose.Eve gets her just rewards but does not go quietly stating there are other hunter squads around, she then throws a massive truth or lie at the Dragon Guards, only time will tell.I really felt for both Caitlin and Kryan for what they had been through and I am so glad they had a resolution against the evil to the core Eve O’Baoill. There is a special place in hell for her and her family.These two were perfect for each other and the strength and support between them was wonderful to read about.This is my honest review of this book."}], "description": "Escaped from hell on earth, lost and alone, a wail in the night calls to not only his beast but also his heart. Finding this tortured woman is all that matters. On the run, hiding in plain sight, the icy fingers of doom invade her soul. The pull of the world she fled tears at the fiber of her being. Lovers from different worlds, fighting a common enemy, thrown together by the Reaper himself, helpless but to do as he bids. Can these two souls find peace when the Devil himself is demanding his due?", "title": "Tears For Her Dragon\n      \n          (Dragon Guards #12)", "url": "http://www.goodreads.com/book/show/33980450-tears-for-her-dragon", "average": 4.58, "cover": "https://images.gr-assets.com/books/1485289523l/33980450.jpg", "reviews": 53, "authors": [{"url": "https://www.goodreads.com/author/show/7200721.Julia_Mills", "name": "Julia Mills"}], "type": ["Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/33980450-tears-for-her-dragon", "http://www.goodreads.com/book/show/33177690-tears-for-her-dragon", "http://www.goodreads.com/book/show/20601842-her-dragon-s-fire", "http://www.goodreads.com/book/show/18270740-her-dragon-to-slay", "http://www.goodreads.com/book/show/22585248-for-the-love-of-her-dragon", "http://www.goodreads.com/book/show/24698417-only-for-her-dragon", "http://www.goodreads.com/book/show/25433496-fighting-for-her-dragon"]}