{"ratings": 1057, "userreviews": [{"userName": "Trevor", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/175635-trevor", "userReview": "I’ve enjoyed all three of the books by Fine I’ve read – but particularly Delusions of Gender, which was and is one of the best books on gender I’ve ever read. This book won an award for the best science book of 2017. I’ve so far bought it for 3 people – two of which have been my daughters. Delusions of Gender is a book that considers how differences in male and female brains help to explain the all too obvious differences between the sexes. And it concludes that much of this brain science is grossly overstated or simply doesn’t prove any of these supposed differences at all. What that book does for the brain, this one does for hormones. The bottom line here is that there just isn’t all that much difference between men and women. It’s annoying, I know, but there certainly isn’t nearly enough difference between us to need us to have fundamentally different brains or bodies seething (or probably bubbling over, if I’m going to keep my metaphors consistent) with pink or blue hormones. Some of the humour in this book is a little out of place (in the sense that it isn’t all that funny) but otherwise this book is hard to put down. And I really would prefer it if this book never needed to be written – you see, it would be great to believe that science is the kind of hypothesis testing, self-regulating, rational, show-me-the-evidence type of endeavour that it loves to claim itself to be. The problem is that when it comes to gender, science seems to ignore ‘the evidence’ and to run instead with ‘common-sense’. And common-sense says that the sexes are a bit like day and night, yin and yang, or an action movie vs a romantic comedy. The problem is that as soon as you poke the black bag of common-sense about gender with the pointy stick of empirical evidence it turns out that you can’t help noticing common-sense smells decidedly iffy. A repeated theme here is the notion that testosterone makes men the world’s great risk takers. She spends much of the book showing that this is only true if we define male risk taking in ways that seem edger than the risks that women take – but that really, in many contexts women are equal to, if not greater risk takers, than men. And given the stats on men bashing or killing women, the crown for ‘world’s greatest risk-taker’ really doesn’t nearly so obviously go to men here. I’m not sure now if I read it in this book or not now, but as some guy said somewhere, when I go out on a date the worst that can happen is he has a boring conversation over a crap meal, whereas a bad date for a woman might involve being raped and murdered.That is one of the things I particularly like about Fine – she presents an example that seems to utterly confirm our biases and be supported by our experience too, and then she shows how we have in fact been affected by our stereotypical visions of the roles of the sexes or by our culture’s presumptions. When I rule the world both of her books on gender will be made compulsory reading. And not just because they help us understand how gender science is often rubbish – but also because they help us see how easy it is for otherwise intelligent people to ‘just know’ something must be right and to then fool themselves over and over again to confirm what they just know."}, {"userName": "Shannon", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/35183085-shannon", "userReview": "This has really inspired me to stop reading popular science books by random people I find under the \"feminism\" tag on Goodreads. This book is not scientific & makes a lot of unprovable assertions not backed up by studies. For example, 97% of domestic abusers are male and she literally explains this by saying it's caused by the pressure of conforming to gender stereotypes. How does she know?? There's no study; that's just an opinion. Once she cited a study showing that one time men and women did equally well on a math test. This seems obviously cherry-picky; anyone can look up statistics showing at the highest level of the math SATs boys outnumber girls 3:2; this effect is still persistent across higher-level math in different countries.She spends a lot of time talking about how we shouldn't gender-code toys for children, but that doesn't have anything to do with how 85% of people with autism are boys, or how gay men report far more sexual partners than lesbian women, or how the vast majority of violent criminals and nearly all rapists are male, and how men have more aggression in every society measured. I'm a bit disappointed because there were a lot of nice snippets in this book showing how sex differences in the research lab were rather small, but for me at least the point of science is to answer questions and make predictions about the world, so it's not helpful to tear down other people's research & then propose your own (unprovable) assertions. Our society has such massive sex differences & it felt like the author had no answers to that, just opinions that can't even be reasonably tested. One cool actual fact I learned is that your chance of getting pregnant during a random act of unprotected intercourse is, on average, 3%. (She says this shows historically this practically meant sex was a care-free endeavor for women, which strikes me as ragingly insensitive to all the women who before reliable contraception had unwanted pregnancies & historically not true. Also, you shouldn't take unprotected-sex advice from this because 59% of couples who are having unprotected sex get pregnant within 3 months.) Anyway, that fact + a resolution to avoid popular science writing makes this book worth it, I guess."}, {"userName": "Kaisha", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/5441925-kaisha", "userReview": "This is a much-needed review of the outdated scientific interpretations of the role of testosterone on behavior. From the earliest experiments, Fine shows how value-laden and culturally reinforcing many of these \"scientific\" experiments are. To sum up a wonderfully entertaining and thorough investigation of the history of sex hormone research Fine points out that the current agreed upon model is that behavior influences hormones more than hormones influence behavior. There are many studies that now show how testosterone increases when people are put in stressful situations or positions of power. And equally how testosterone decreases when people are given infants to take care of. It blows out of the water the boys-will-be-boys model where testosterone has been blamed (or praised) for making men: logical, assertive, aggressive, risk-takers and just generally better suited to high-status positions like finance, higher mathematics, and science, fighting and sports. One particularly interesting example is a testosterone test on men who had just competed in elite international athletic competitions - several of the men had levels BELOW the normal reference range. Moreover, these are TOP competing athletes. The book is extremely compelling and should be required reading for parents, teachers, politicians, religious leaders (honestly everybody) or anybody who has a role in legislating or shaping the gendered experiences of people."}, {"userName": "Peter Geyer", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/50966121-peter-geyer", "userReview": "Cordelia Fine has appeared somewhat controversial in a controversy-cluttered area, to the extent that I had avoided her work, notwithstanding it being in and around a topic of great interest, and it wasn't until I read something about her and this book in a kind of interview/review that I decided to test out what she had to say.Fine's area of interest is broadly what scientific research can tell us about makes and females, as categories, inclinations and behaviours with respect to various groups of humans and other animals. Her interest isn't descriptive, but investigative and evaluative, and so we are presented with research and opinion from a number of sources, including a comment coming from the first female jockey to ride a Melbourne Cup winner, in which she labelled the horse racing industry as patriarchal, and that they had made incorrect assessments about female capacity and physical strength.In the last week, a women's Australian Football League has been launched in which the players demonstrated a vigorous and competitive playing style and will to win, as well as a general excitement from some players interviewed beforehand that they'd been waiting all their lives for this day to come. Naturally, Fine doesn't reference this, but this event is at the core of the discussion, examples and theme of the book, which is about the kinds of myths the public at large, people in various positions of power, and researchers of all kinds appear to take for granted, which is the role testosterone plays in the kinds of attributes I've mentioned with the women playing football, particularly including risk-taking. The book critiques the above views by providing research and other evidence, demonstrating that some researchers prejudge their outcomes or report favourably on statistical differences that don't really say anything, research males and infer results to females (unresearched), don't take account of environment and social expectations, have limited pools of subjects (usually students) that are hardly representative, and so on. Economics researchers come in for some stick, for some very good reasons, as their research methods appear to be tightly bound to ideology of some kind, as well as the bewildering idea (to me anyway) that you can get meaningful data from people making decisions over a dollar or two. This lack of largesse, as Fine puts it, surely has an influence on whether participants would really be invested in the task. I remember being engaged in such a \"game\" at a university course in 1989 (not economics) in which $5 was at stake, which left the whole exercise somewhat unrealistic for the participants, all of whom were in well-paid and permanent employment.Fine is a particularly witty and fluent writer and explains these issues with clarity. Sometimes, a genuinely funny statement appears after a particular method is described, which makes you go back to what's been said, to really get the point.Where she starts, of course is with notions of hard-wired male and female brains with the theme of testosterone not far behind. We discover that a demarcation point for these categories is impossible to find and that external definitions of what masculinity and femininity are used in this case, such as a scale of masculinity, something obviously socially constructed, to this personality researcher at any rate. How males and females respond to tasks, or just daily life (more fluid categories than one might think) is astutely examined and critiqued. I must admit that this contention isn't new to me, and it's obviously more representative of what people and other beings are really like. Actually, how the latter go about things doesn't make for rigid behaviour categories. In some respects the idea presented here is that a person might be male or female (taking into account that some species change this orientation according to circumstance) but it's how they go about things, or express that orientation that's the real point, Not every male wants to be in finance or a CEO or something, some females might be so inclinedOne of the things I was most startled about in this book came towards the end, when gender-based marketing strategies were discussed, in particular the pink and blue divide, which is known to be socially constructed i.e. in the past the reverse was the case as far as boys and girls were concerned. Maybe this points to a lack of research or interest in the facts. I was startled partly because I don't venture into the toy stores Fine speaks of, and that I recall contemporaries who became parents mentioning that no toy guns came into the house, that the toys they selected were gender neutral and that one of their sons liked playing with dolls. So I was presuming progress in this area; from what is recounted here, apparently not. It also brought to mind a comment by my elderly mother a year or two ago in which she expressed her regret that she had never bought me a train set when I was a child. Friends had these things, and I could never understand their interest as once you'd gone around the track, that was that. So I explained my complete lack of interest, hoping that would assuage her guilt. But she may also be wondering what she did wrong to raise a son for whom mechanical things were of no interest. On the other hand, she did buy books for my sister and me on a kind of egalitarian basis, so who knows?This is an excellent book that worked well for me to the book by Frans de Wall that I bought at the same time. Some people apparently think Fine is a behaviourist, but I think that's far from the case."}, {"userName": "Tim", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/4397455-tim", "userReview": "This book has an agenda and the author cherry picks her data and chooses conclusions that match the way she wants the world to be. I wouldn't say the book is full of lies, but manipulating the data and omission is certainly present here. If you align yourself with her views I am sure you will enjoy this book and it will affirm your worldview, otherwise not."}, {"userName": "Luca", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/31312758-luca", "userReview": "As someone who is used to reading about this topic in scientific articles, a book directed at people with very basic knowledge about sexual selection, mate choice and evolution in general, I can say that it was a bit hard to get through.For one, I didn't like that all of the citations were in the end of the book, which meant that I needed to constantly flip pages to check the articles mentioned in the main text. But again, for someone who isn't interested in them, reading a text without citations interrupting is a lot easier, I get it.At times I felt like the author was trying to prove her point of view right just a bit too hard; so much so that sometimes I got lost attempting to follow her reasoning.However, several points were raised that I did find interesting or studies were referenced that I hadn't heard of which made it a worthwhile endeavour. What, I think, the main point of the book is, is that there's no such thing as \"men have more testosterone and that's why they are in higher positions.\" There's no direct line between hormones and your employment. And I know that this sounds utterly ludicrous, but some people seem to be of this opinion; just check the referenced publishings. As social creatures, our physical and social environment influence how our personality develops.I mean, if women were praised for being in hard sciences while men were discouraged from early ages, would the same pattern of gender inequality be observed as today when gender norms \"teach\" the exact opposite? It would probably be the other way around, more women compared to the number of men.It's all past \"boys will be boys\" because our early childhood socialisation has an enormous effect on adult behaviour, possibly the to the same scale as genes and hormones.Oh, and I totally share the author's hate for gendered toys. Let kids play with whatever they want, without those toys being \"blue for boys\" and \"pink for girls\"."}, {"userName": "Brian", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/16128970-brian", "userReview": "I had read Cordelia Fine's earlier book, \"Delusions of Gender\", a while back, enjoyed it greatly, and so I was eager to read her next book. \"Testosterone Rex\" did not disappoint. Fine has a delightful writing style, combining personal anecdote and a great deal of humor with clear arguments and large amounts of evidence supporting her views. This book was perhaps a drier topic, at least to me, with a great deal of biology, but I nonetheless found the book fascinating, and many of the key arguments were novel to me. Two in particular - that T levels might be a response to, rather than a cause of, certain physiological or behavioral changes, and that some gender differences might serve to make behavior similar despite reproductive biology differences, rather than the behavior being different because of those differences - really stood out. Correlation is not causation, and here are two huge causation arrows that can possibly be turned the other way. Fine is quite deft at dissecting the motivated reasoning and confirmation bias of various research efforts, something she does with humor and understanding rather than rancor. Human behavior, she frequently points out, is complex, and is not necessarily comparable to animal behavior in all ways. Fine also rightfully points out the folly of assuming that all human evolution traces only to the Stone age; much has happened since then that affects behavior. All in all, this was a wonderful book, and I recommend it."}, {"userName": "Inderjit Sanghera", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/900800-inderjit-sanghera", "userReview": "One-by-one Cordelia Fine upends various modern myths surrounding gender stereotypes, or, to be more specific, fables surrounding testosterone as somehow being the magic bullet which justifies all sorts if illusions; men are inherently greater risk-takers, men are hard-wired for promiscuity, men thrive in stressful scenarios. Testosterone continues to be used to justify male privilege, to justify ideas surrounding toxic masculinity, whether it be the propensity for domestic violence or for male dominance in leadership roles in the finance industry. Fine is not arguing that there additional testosterone has no impact on male behaviour, or that male and female brains are exactly the same, instead her argument is that the impacts of testosterone are exaggerated and that it is societal norms and values which define gendered behaviours rather than simply human biology.Concepts such as gender-specific toys are the rock upon which gender identities are built. Fine highlights the story of the Australian politician who linked boys toys with domestic violence; right-wing critics lampooned her links without understanding the nuances behind the argument. From a young age boys are taught that certain behaviours (aggressiveness, self-confidence, boisterousness) are masculine tendencies and therefore acceptable under the adage ‘boys will be boys’. However, it is when women seek to assert their individuality and break these stereotypes that male insecurity, which is the source of most domestic violence, crops up, as women do no fulfil the roles society places on them. Behind each Action Man toy lies a series of stereotypes which stay with children into adulthoodFine presents a convincing argument on dispensing with gender stereotypes, or even the concept of gender, which is mainly a social construct, in order to free us, especially women, who feel the constant weight of male expectations, of male privilege which not only fail to allow them to meet their potential but prevent them from making aware it ever existed. In an ever-changing world, where concepts of gender and identity are constantly being redefined, books such as Testosterone Rex are essential in allowing us to re-consider what it means to be human."}, {"userName": "Paul", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/11951948-paul", "userReview": "The gender issue is a hot topic at the moment, for decades we have been led to believe that ‘boys will be boys’, that pink and blue toys are entirely suitable for the appropriate sex and that men have evolved to take risks because of the extra testosterone swishing about and that the female brain is utterly different to the male brain.Psychologist, Cordelia Fine, is having none of it.The ‘nature versus nurture’ argument is dragged up frequently, but by using arguments from social history, psychology, neuroscience and evolutionary science, Fine takes apart all the old, entrenched evidence and goes a long way to explaining how what is between your legs doesn’t create male and female natures, but the elements that actually defines us is a complicated mix of evolution, hormones, culture and sex. Fine is not afraid to be controversial in some of her conclusions in this book, looking at the facts and assessing the evidence; pointing out the errors is not going to endear her to some readers. She has written an interesting and enlightened take on the role that testosterone has to play in both male and female bodies, and the effects that it has. She does not hold back as she obliterates the myths and cultural norms in society that still surround the gender issue. She is not afraid to get stuck into the science and statistics and evaluate the studies that have been done. It is a really good popular science, one of the few where I have actually laughed out loud at certain points of the book. Worth reading."}, {"userName": "M", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/38396339-m", "userReview": "A collection of vague attacks on human sexual dimorphism using still vaguer statistics from self-report questionnaires resulting in outlandish claims like \"Men prefer to have sex with women they are emotionally attached to\" and \"Upbringing has an impact on sexual behavior\". Take that, Patriarchy! Two stars because some of the science was good.For future reference: If you encountered someone who started every third sentence with \"As a libertarian\", \"as an existentialist\", or \"as an atheist\", you would likely think they were an unbearably pretentious douchebag and extricate yourself from the conversation as soon as possible. \"As a feminist\" works the same way, Ms. Fine. No double standards on this one."}, {"userName": "Rinstinkt", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/61447399-rinstinkt", "userReview": "There is no science in this book.The author fails miserably to demonstrate to the reader the scientific evidence behind her claims, one after another... Indeed, the only myths are those perpetuated by the author. Leaving unmentioned entire bodies of scientific findings can only be a sign of two things: ignorance or purposeful propagandizing. I think the latter is more probable since I suspect that the author thinks that by burying scientific evidence (or not mentioning it) helps the cause of fighting gender discrimination and segregation. It doesn't. The author does a decent job on reminding us of the dangers of misapplications of scientific findings into policy. But she also does a wonderful job in putting herself in the miserable position of ignoring good science."}, {"userName": "Jeremy S", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/7217123-jeremy-s", "userReview": "As a new dad, I have had frequent conversations with my wife about all of the gender-neutral discussions taking place with kids toys/clothing etc. so I was delightfully intrigued to see this book come up and I gave it a read.It is a feminist book, and already there may be men going \"oh no...\" but it was a very good read, no matter who you are (which I think is further to Fine's point on gender stereotypes)!The whole book breaks down the myth that Testosterone is what fuels erratic/impulsive behavior in men, which then leads to men taking more risks, which sees men having higher rewards, being able to sleep with more women, and generally spreading the seed. Needless to say, I found a lot of comfort in the pages of the book and here is why:- I am a straight male who works in a field that is 97% women (I am an interior designer...Not a decorator!)- I have been very active in my son's early life, and split his care more than 50/50 with my wife for the most part (some days she does more, other days I do, but there is a balance)- I grew up fascinated by the arts, music, literature and didn't like playing anything but dodgeball or floor hockey- I liked playing video games where I could blow people up, and I played with toy guns with my brother religiously while we were growing up- I love my wife dearly and made a pledge to her when we were married that she was the last person I would ever be with, and we will be together no matter the hardships and issues. I have found my one person in this world.- I am a total fashion snob and enjoy shopping.What do all these things have in common? Nothing, other than to prove that, as a male, I am not defined by testosterone, and women, should not be defined by their lack of it, as it does not guide in any way who you are as a PERSON. That was the big takeaway for me from this book: we are all unique individuals, regardless of sex. Some men will have more female tendencies, while some women will have more male tendencies. The idea is that we should understand and proport a society where respecting the person over respecting the sex is paramount.One of my favorite parts, which I will leave as a takeaway, talked about how we use the term \"Testosterone Fueled Event\" when in reality, based on numerous studies, when we find ourselves in a situation that may make us aggressive or angry, we release testosterone, not the other way around.I am doing a terrible job at simplifying the incredible amount of work that went into this book, but I would highly recommend reading it, no matter your stance on the issues of gender equality or feminism. It was a witty and enjoyable read that may change your position on a few things without you even knowing it."}, {"userName": "Michael Livingston", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/1340545-michael-livingston", "userReview": "I really loved Delusions of Gender: How Our Minds, Society, and Neurosexism Create Difference, so I had high hopes for Cordelia Fine's follow-up, Testosterone Rex. It's a well put together argument against the idea that biological sex, and particularly testosterone, determines behaviour, but it didn't impress me nearly as much as I was expecting. I found myself much more sceptical of Fine's presentation of the evidence here - wanting more meta-analyses or systematic reviews over neat and interesting individual studies. I've no doubt that the majority of Fine's arguments reflect the state of scientific play, but at times it felt like the argument was driving her choice of sources rather than the reverse. I also found some of Fine's stylistic choices a bit more grating than I expected - a few too many self-satisfied asides for my tastes. Testosterone Rex is still an important contribution of course - it's readable and clear and will convincingly drives home the point that much of what people assume are 'innate' or 'natural' differences between men and women are really profoundly social. But I think it falls well short of the standards Fine set in Delusions of Gender, a book I think everyone should read."}, {"userName": "Charlene", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/2531665-charlene", "userReview": "There is some really important information in this book that, in my opinion, could have been delivered in a more relatable manner. This is a subject that is of interest to many but the language was not really inclusive. This book was clearly aimed at academics with a background in gender studies. I felt as if I were in class- and not a class in which we were all taking part in wonderful debates or discussions, but rather a class where I felt that I had to sift through jargon to really appreciate the full impact of what was being said."}, {"userName": "Todd Martin", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/1345046-todd-martin", "userReview": "Male and Female PeacocksAs everyone knows by now human behavior is a combination of nature and nurture. However, when it comes to the differences in behaviors between the sexes, Cordelia Fine (an academic psychologist and writer) believes nature has nothing to with it. She makes her argument as to why in Testosterone Rex: Myths of Sex, Science, and Society.In other words, she’d likely take issue with Tom Bodett’s observation that “my boys used to chew their toast into the shape of a gun and then shoot at each other”, presumably because this activity is also one she believes is widely shared by little girls. First off, it’s worth mentioning (and I don’t think Fine would disagree) that the book is not simply an impartial review of the science, it has an ideological aim … Fine wants to further a more equal society based on both sexes’ full, human potential. This is a worthy goal and one to which I fully subscribe. However, I do not subscribe to misrepresenting the science to do so, and Fine gets it wrong early in the book in her description of an flawed experiment performed in the 1940’s by Angus Bateman in which he examined the mating behavior of fruit flies. Bateman concluded from his work that reproductive variance is greater in males than in females. However, it was later shown that his experimental methodology was flawed. Fine concludes from this error that sexual selection (first proposed by Charles Darwin in The Origin of Species and developed in The Descent of Man and Selection in Relation to Sex) therefore doesn’t exist. As an aside, this is a method of argumentation that she commonly returns to in the book. It’s akin to saying: rain doesn’t always follow thunder, therefore anyone who reaches for an umbrella before venturing outside while thunder is rumbling is a blithering idiot. It should be noted that Bateman’s experiment has subsequently been repeated properly in several other species, and the results have precisely supported Bateman’s original conclusion.Here’s the thing. Sexual selection is a well-established biological theory with multiple lines of supporting evidence. If it did not exist, how could sexual dimorphism between men and women (or between males and females of any species) be explained (see the photo above)? Fine needs to undermine sexual selection since it’s the mechanism that undercuts the foundation upon which her argument is based. It’s possible that biologists are busily re-writing evolutionary textbooks to comport with Fine’s conclusion (overlooking her lack of credentials in the field), but I doubt such is the case. With that out of the way, the book does have its merits. Where Fine is at her best is in demolishing the idea of rigid gender-specific character traits. The human species is highly adaptive and exhibits a broad range of behaviors to varying degrees: cooperativeness, dutifulness, obedience, goal-orientation, risk-taking, talkativeness, pragmatism etc. There is no gender-specific list that can be referred to that distinguishes behaviors exhibited by men from those exhibited by women. There is so much overlap involved in human traits that we can only speak of such characteristics statistically (and much of that statistical variance is quite modest). The U.S. is just starting to begin to acknowledge that gender behavior and gender identity are more complex than the binary form as was once thought and Fine is right to direct criticism at the ‘Men are from Mars, Women are from Venus’ proponents. There’s one exception though, and Fine is unusually silent with regards to its prevalence … aggression. I’ll let you take a blind guess as to which sex is more aggressive, but here’s a statistic: violent crime is overwhelmingly committed by just one sex (80.4 % vs. 19.6 % in the U.S.). I suppose Fine would argue that this is a culturally learned behavior … except it bears out throughout the world and throughout human history. The theory of sexual selection does an admirable job explaining why, and you can convince yourself with a web search if you’re so inclined. As to the book itself and most importantly as far as my enjoyment was concerned, Testosterone Rex really didn’t hold my interest."}, {"userName": "Anna", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/14941179-anna", "userReview": "‘Testosterone Rex’ is a follow up to Delusions of Gender: How Our Minds, Society, and Neurosexism Create Difference, both of which are excellent demolitions of sexist pseudo-scientific nonsense. The first tackled misinterpretations of neuroscience. The second deals with misinterpretations of research on hormones, specifically the oversimplification that men are risk-takers and women aren't because testosterone. Fine’s tone in both books is one of controlled sardonic rage, which I have every sympathy with. She must have dealt with a lot of mansplaining. ‘Testosterone Rex’ feels slightly briefer than her previous book, so I didn’t like it quite as much. The two hundred pages were undoubtedly very good, though. Fine captures the nuance of testosterone’s effects well. These sections particularly stood out:The complexity also helps to make the following problem less bewildering. How do humans achieve the feat of turning something rather large (average sex differences in circulating testosterone levels) into something rather small (average sex differences in behaviour)? No sex difference in basic behaviour comes close to the divergence between the sexes in circulating testosterone, for which there’s only 10 t0 15% overlap between women’s and men’s levels. Potentially, this puzzle is solved by the important principle we met in Chapter 4: that sex effects in the brain don’t always serve to create different behaviour. Sometimes instead, one sex effect counteracts or compensates for another, enabling similarity of behaviour, despite dissimilarity of biology. Combine this principle with the the considerable room for manoeuvre on the journey between T in the bloodstream and its action on the brain…[...]Not only is T neither a sufficient, nor necessary, cause of hormone-linked behaviour - sometimes it’s not even really a cause at all. Recall the purpose of hormones: to ‘adjust behaviour to circumstances and contexts’. To this end, T turns out to play ‘a key role’ in helping animals tune their social behaviour to whatever social scene they find themselves in. Although we’re used to thinking of certain kinds of behaviour as ‘testosterone fuelled’, in many cases it would make more sense to instead think of action and situations as being ‘testosterone fuelling’. Social context modulates T levels (up or down), which influences behaviour (presumably via changes in perception, motivation, and cognition), which influences social outcome, which influences T levels… and so on.I also heartily approve of Fine’s mocking economists for making the ground-breaking discovery that (GASP) people's decisions are influenced by social norms. As she puts it, ‘To a social psychologist, this is an almost comically belated revelation: a little bit as if only recently a landmark social psychology article introduced colleagues to the concept of money.’ The book wraps up with a succinct assessment of how the sexist myths of hunter-men and caregiver-women manifest in society, which is well expressed and depressing. One thing it left me thinking, though, is whether anyone has researched the effects of testosterone by surveying pre- and post-T trans men’s levels of risk-taking. Fine’s synthesis implies that such research may not have occurred due to a strong attachment to the gender binary in this field. It’s always seemed odd to me that sex differences in insects, birds, and animals are assumed to provide close analogies to humanity, despite the fact that humans are the only creatures to have the socially constructed concept of gender."}, {"userName": "Paul", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/35789244-paul", "userReview": "This is both a brilliant and hilarious book. I've always thought the only essential difference culturally between women and men was that men spit and women didn't. This book is a great refutation of patriarchal society and the studies (always by men) that confirmed their pre-existing biases. To me, it's incredible to what lengths rich white men will go to develop theories that back up their starting point, which is--the way we are is normative, and I'll prove it by going back and showing that during evolution, men always grunted, spit and were ferocious, and women were homemakers and knew their place.This book is so well-researched that 40 percent of it is notes. Fine digs up amazing studies that refute most of what is laughingly called \"evolutionary psychology\" and refutes many male-biased interpretations of evolutionary biology. We have evolved past caveman society, but no caveman--or anyone at all (I'm talking to you, King John of England, re: 1215 at Runnymede) wants to willingly give up power once they have attained it. Thus we get such ridiculous ideas as The Divine Right of Kings and Droit du seigneur. People in power will make up any outlandish scheme or philosophy they think people will buy to assure people out of power that god just ordained the people in power to be in power.Well, guess what? The world has changed radically since 1215 and continues to change at an increasingly rapid pace. Blacks are actually human beings! Women should be able to vote and inherit property! All humans are created equal! Democracy generally works better than monarchy. Fine is not the first to point out the emperor's new clothes, but she sure does it in the funniest way.I would highly recommend this book to anyone interested in the truth."}, {"userName": "Alb.krist", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/38116225-alb-krist", "userReview": "This book is full of bs."}, {"userName": "Brian Clegg", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/6100646-brian-clegg", "userReview": "It seems that books about the myth of gendered minds are somewhat like busses - wait ages for one, then two come along close together. I've already reviewed the superb Inferior by Angela Saini, so it was fascinating to be able to contrast Cordelia Fine's impressive Testosterone Rex.This is a full-on take on the whole business of the ways that men and women aren't (and are) different. You may think that there's no need to do this in today's world. After, all, we all recognise gender equality, don't we? However, not only is it taking a long time for this to percolate through to equal pay (at the time of writing this review there's been quite a fuss about this at the BBC), it's clear that acceptance that the bias still exists is often, at best, skin deep. I was fascinated to see an online argument, started with a post by a (female) physicist on the topic, only to have a string of male scientists, who really should know better, pile in with a combination of denial, excuses, and attempts to counter studies with anecdotes, somehow forgetting that anecdotes are not data.Even more so than with Saini's book, Fine's makes me feel sorry for evolutionary psychologists - these academics are really getting it in the neck with findings that suggest that at least some of their long-held views aren't based on fact. Part of the reason I particularly feel their pain here is that Fine is more full on than Saini: fiery, snarky and writing much more of a polemic than Saini's cool, careful and scientific approach. My suspicion is that the approach taken in Testosterone Rex might have the wider appeal, even though, for me, Saini's book has the edge.Luckily, though, the two titles aren't really competitors. There is a strong overlap of theme, but each has a significantly different focus. Here relationships, sex and everyday life are stressed more (down to those infuriating 'girls' and 'boys' aisles in toyshops), while Inferior came particularly from the viewpoint of the influence of gender bias on education and careers, scientific careers in particular.I found Testosterone Rex an enjoyable read (I hate the name, though in fairness, Fine does spend a lot of pages on the misunderstanding of the influence of testosterone and how, for example, trading floors are not so much testosterone-fueled as testosterone-generating). The book did sometimes feel a tad repetitive, as in the end it's a vast series of examples illustrating the same point. And, for me, there was also too much about animals. Having established early on that we are very different, even from the other primates, and that there was no point in using animal examples as 'natural' behaviour for us, there didn't seem any point continuing with the animal stories. If you enjoy a good piece of punchy, persuasive writing, but are still to be convinced that 'boys will be boys' or that 'women are naturally less inclined to jobs requiring assertiveness or aggression' this is a must read. If you are already fully committed to equality, you will also enjoy having your beliefs reinforced. Sadly, some will still see this as political correctness gone mad. It's not - it's about getting the scientific basis right, rather than rolling out the same dated and simply incorrect arguments."}, {"userName": "Richard", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/7197098-richard", "userReview": "Written by an Australian professor who challenges the idea that human sexuality is binary and fixed, I like her style of arguing, where she begins by carefully summarizing the evidence behind something, and then shows how looking at the whole story may show a different conclusion.For decades, sociobiologists have pointed out that, biologically, females are severely limited in their total number of potential descendants — you can only become pregnant so many times — but males can have a near infinite number of progeny. Supposedly, that fact makes males more prone to promiscuity — get as many genes out there as possible — while females tend to be more concerned about protecting the (relatively) few children they can personally deliver.Cordelina Fine repeats that argument, but then shows how in reality men have far fewer options than you’d think. In a band of hunter-gatherers, which typically number no more than 100-150 people, the women might each have — maximum — ten babies or something in their lifetimes, but that also means the women are pregnant most of the time and therefore off limits for reproduction. If you do all the math, you’ll find that men can realistically have only a few more babies than the women. In other words, don’t assume that men will evolve to be more risk-loving or more aggressive just because you assume they can theoretically have more babies; in fact, there is good evidence that women are often just as aggressive risk-takers.Well, I was all excited about this line of reasoning. The book continues with many other examples from neuroscience and biochemistry that show how the story about women vs. men is much more complicated than we tend to blindly accept. Page after page she runs through examples that violate this supposed rule.Unfortunately, I don’t think the author made her case. She points out exceptions to the sociobiological arguments – all interesting and worthwhile to consider –but when I think deeper I’m reminded that the most she does is show that men and women are more alike than they are different, hardly a provocative conclusion. The point remains that men and women are different in some important ways, and not all the differences are “better” for the man.She never mentions violence, for example. It’s easy to forget that, until very recently, men were often, regularly killed, in wars, in brawls, in stupidity. Even today, men are way over-represented in jails, psychiatric wards, homelessness, and many more awful situations. A good explanation of biology can’t just complain that there aren’t enough women CEOs.My biggest problem with her book, though, is that it ignores partnerships. A man or woman is not the fundamental unit of society. Families are. Successful families work together, without obsessing over how the credit or blame is allocated. If you’re on a team, the issue is whether everyone is better off as a whole, and relative to their alternatives.If evolution worked strictly at the individual organism level, then the author has some interesting new ways to see the facts. But evolution doesn't care about you or me as individuals. Do gender differences make human groups _as a whole_ more productive or less so? This book tries to make the case that gender is not relevant, but I wasn't convinced."}, {"userName": "Tadas Talaikis", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/2780292-tadas-talaikis", "userReview": "On many traits males are more variable than are females without a difference on average, what makes my belief about no real difference in advantage between males and females.Will see what this book says or not about it.Says pretty much it and this is first book I had found about it. Then it led me to more research and keeping everything short: 46 meta-analyses on \"cognitive, verbal and nonverbal communication, aggression (sic!), leadership, self-esteem, moral reasoning and motor behaviors\", risk taking, etc. - there are no big differences between sexes: SourceThat pretty says it all, but more popular would always be idiocies like Men from Mars, Women from Venus."}, {"userName": "Beth-ann", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/31950939-beth-ann", "userReview": "Although the science was abundant and the arguments interesting, I felt it became repetitive and lacked well rounded conclusions that would have helped the reader to navigate all the information. However, still an important read for those still clinging to old fashioned ideas about gender, identity and sexuality."}, {"userName": "Leonard Kim", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/17757241-leonard-kim", "userReview": "Some interesting things, but I frequently lost patience. Straw Man Rex."}, {"userName": "Lance", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/46538050-lance", "userReview": "“ Although scientific claims don’t tell us how our society ought to be, that being the job of our values, they can give us strong hints as to how to fulfil those values, and what kind of arrangements are feasible.”Cordelia Fine’s new book critiquing the objective psychology and biology behind behavioural differences between the sexes is an excellent update and expansion of her writing in Delusions of Gender, a truly gratifying and formative book in helping me understand my own gender in relation to my physiology. Fine is a skill-full, witty, insightful, and above all scientifically ruthless writer. Her greatest appeal is that she brings sharp objectivity to such an emotionally-charged discussion, and helps defend feminist and queer ideals with logic, fact, and perspective. One of the best books released this year, full of new information for me even though I read the psychology and neuroscience literature regularly. A heroic book.Fine begins with an elegant challenge to Darwin’s theory of sexual selection. This echoes the broad themes of Evolution’s Rainbow, but it des not appear in the references and the arguments are refined with greater precision and clarity. Sexual selection theory, which states that the low-investment sperm production in males mandates a competitive, aggressive, promiscuous mating strategy which cannot benefit females is supported by very little evidence. The 1945 study by Bateman with fruit flies which is often cited as the first impirical evidence of this showed “ The outcome of Bateman’s six series of matchmaking was the first scientific report of greater male variation in reproductive success. For example, 21 per cent of males failed to produce any off-spring, compared with only 4 per cent of females.” Yet Fine cites recent meta-analyses of Bateman’s own data which showed that the mutant fly lines he used to detect paternity of offspring overcounted fathers and underrepresented maternal mutations, and that his own findings showed greater offspring survival in promiscuous females. “ Proposed gains of female promiscuity include genetic benefits, healthier offspring, and the opportunity to set up sperm competitions that weed out inferior specimens.” Using statistics to explain poor analysis and biased publication of positive results, Fine show that there is just as much evidence that the traditionally “male” mating strategy is effective for females in some environments, and equally the “female” strategy can be effective for males. I particularly enjoyed the numerical analysis of the fecundity of a single man achieving more than 100 one-night-stands a year, still less likely than a monogamous man of fathering a single baby. “ (Indeed, a promiscuous man would need to have sex with more than 130 women just to have 90 per cent odds of outdoing the one baby a monogamous man might expect to father in a year.)” This simplistic view of “mating strategies” is made to seem outdated and juvenile.Fine then attacks the biology underlying these ecological assumptions, the idea that there are hard-wired genetics programmes, boulstered by hormones, which then dictate how a person will live their life. “ To confuse human (cultural) sexuality and (natural) reproduction is classically pseudo-scientific.” She dispels the idea that the most attractive men are wealthy and powerful whereas the most attractive women are merely young, by pooling data from dozens of cultures from urban China “But an analysis of actual matches made through an online dating Web site in China found that likes-attract again provided a much better explanation of the data than did potentials-attract.” to hunter-gatherer societies which demonstrated that humans are more attracted to those that they share traits in common with than there architypes. Fine shows that women underperform in laboratory tasks after being primed that these are “masculine” tasks as a form of social defence, and that ficticious male job applications are actually considered more favourably if the candidate admits to being poor at traditionally “feminine” activities. “ For many decades, researchers supposed that masculinity and femininity are polar ends of a single dimension: someone high in masculinity is therefore necessarily low in femininity, and vice versa.” Even the single traditionally masculine dimension of risk-taking is shown to be an uncorrelated mix of different psychological assessments of different situations (those who gamble are no more likely to take health or ethical risks etc.), and that findings that women are more risk averse also apply to dozens of other populations in society whom also face discrimination. “ Society seemed a significantly safer place to white males than it did to all other groups, including nonwhite men.” It is very difficult to objectively make a case that this T-Rex “hyper male” persona exists within the male population, and is not an extrapolation that blends many historical time periods and cultures into something fictional.“ These very open-ended outcomes would be more easily achieved by a developmental pathway that runs from sex to socialization to the brain (and hormones, as we’ll come to in a later chapter), rather than by an inflexible direct path from sex to brain.”Arguments for the essential, and probable, role of environment in human behaviour over hard-wired genetic determinism is skilfully and logically made. Queer identities are not the main focus of this book but are dealt with using sensitivity and intelligence. “If most of us were intersex in some way or another, the ubiquitous question, “Is it a boy or a girl?” wouldn’t be so compelling. And if the shape of our external genitalia fell on a continuum, with the majority of people in an ambiguous midrange shape, it’s an interesting question whether our sex would play such a key role in how we present ourselves to the world.” I hope to see future writing from her which might expand some of these tantalising hints.Fine’s treatment of the animal literature of sex differences is droll, thorough, and erudite. “ The development of testes from an “androgynous” gonad is an active, gene-directed process, but in the absence of the potent, male SRY gene, ovarian tissue just… happens, as the default?” She reveals amazingly underpublicized results. For example, male rats will care for young if there is no female in the cage to do it for them, showing that they have all the same innate behavioural tools as females. Also, chemically castrated macaques of high social status do not lose their power, aggression, or mating opportunities in the absence of testosterone. In many animals, including fish with whopping testicles, social status trusts blood testosterone levels and scientists are beginning to believe that hormones respond to social heirarchies, rather than a linear system the other way round. ““Social events regulate gonadal events.” Or to put it another way, just in case the significance of this sailed past unnoticed, cichlid testes are a social construction.” Even differences in hypocampal dendrites between the sexes are so condition-specific that it is impossible to even ascribe a “male” or “female” profile. “In other words, brief stress exposure reverses the “sex difference” for that particular brain characteristic.” Is being stressed more truly “male” than being relaxed, and which types of being stressed? Overall, this is a scholarly criticism of the often oversimplified debate surrounding sex/gender associated anatomy and the erroneous leap that this represents thinking. I could not fault the science or the writing. I’m just sad that it’s finished now.“Science writer and behavioural endocrinologist Richard Francis coined the term “Testosterone Rex” to poke fun at the mistaken conception of testosterone as a “super-actor”—the “plenipotent executor of selection’s demands” that simply “takes care of everything.””"}, {"userName": "Mirte", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/5275457-mirte", "userReview": "Extremely interesting book! I was drawn in by the title, which in my opinion is quite brilliantly thought up. Fine attempts to shine her light on common conceptions of gender based on outdated scientific views. While some sections were a little too sciencey (which is, of course, unsurprising!), she generally manages to use clear language to convey her argument. I felt a little more sociology might have supported the overall point even further, since gender is one of the ultimate multidisciplinary fields of this moment.I'd highly recommend this book to anyone who feels their blood boil when someone argues men are simply more likely to cheat, women are more caring because genes and 'boys will be boys'. Get your ammunition for that next conversation ;)"}, {"userName": "M.", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/31151425-m", "userReview": "More like 3.5, the content much better than the writing."}, {"userName": "Kevin Orrman-Rossiter", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/11116317-kevin-orrman-rossiter", "userReview": "Many a modern book on popular science leads with a quest story positioning the people and scientific puzzle contextually - historical and social scene setting for the story of discovery to unfold. Not so Cordelia Fine in her new book Testosterone Rex: unmaking the myths of our gendered minds. Instead Fine leads with a scene of domestic normalcy, a family dinner where a discussion on desexing the new family pet dog moves on to taxidermy and the possibility of making the said canines testicles into a key ring. This almost deadpan start sets the scene for a witty riposte to those who insist on the testosterone myth that we, modern men and women, are fixed in an ancestral past that rewarded competitive males and caring females.Winner of the 2017 Royal Society Science Book Award, Testosterone Rex brings together evolutionary science, psychology, neuroscience and social history to move beyond old ‘nature versus nurture’ debates, and to explain ‘I think you’ll find it’s more complicated than men are from Mars and women are from Venus‘ and therefore why it’s time to unmake the tyrannical myth of Testosterone Rex. The author, Cordelia Fine, is a professor of the history and philosophy of science at the University of Melbourne. Fine’s earlier two books; A mind of its own (2006) and Delusions of gender (2010) were similarly insightful, intellectually pugnacious and drolly written. I remember being annoyed reading A mind of its own, making copious margin notes as I went - for me usually a good sign that a book has a lot to say and is challenging my existing ideas and/or sparking off new ones. Like Jonathan Swift, Fine is a writer who will “vex the world rather than divert it.” A worthy recipient of the Royal Society science book award.Fine tackles many of the classic experiments that have led to our myths around testosterone, maleness and competitiveness. One such example is a chapter long denouement of A. J. Bateman’s 1940s experiments on fruit flies and its later (1960s) elaboration by biologist Robert Trivers, which resulted in the almost universally accepted “Bateman’s principle” that males would do best (pace Darwin) by competing with other males in order to spread their cheap, mass-produced sperm among as many females as possible - while females should protect their precious eggs and be as selective as possible. Fine counters these experiments and the conclusions drawn from them, canvassing a large body of contemporary research that looks not only at the conclusions drawn, sexually reluctant females and promiscuous males, in addition underlining the biases that Bateman introduced, prejudicing his own results. All this is achieved with witty referencing to Maserati-driving boyfriends and the ever popular tails of the male Peacock.Fine then moves on to dismember the arguments that airily tie together sexual selection, evolutionary biology and consumer behaviour such as a Maserati -driving male giving a pair of Bulgari sunglasses as a male flaunting their resources. Fine asserts that for humans sexuality is far more than for reproduction. Reminding us: humans routinely engage in sexual pairings and acts, that not only often don’t - but actually can’t - lead to pregnancy. There are also many human sexual activities, like touching, kissing, and oral sex that likewise have no reproductive potential.The idea that we we have only to peel away the veneer of culture, learning, habit, fantasy and the true (natural) sexual being will emerge is pseudoscience - it is profoundly mistaken.Having demolished the past Rex myths Fine then proceeds to wittily tackle the current testosterone myths. If you were wondering Why can’t a woman be more like a man? or Are males (naturally) more risk-taking? Will I become a monstrous sexual predator if I increase the testosterone in my bloodstream? or If the Lehman brothers were sisters would we have had the recent global financial crisis? then read Testosterone Rex.Fine concludes with a grand challenge. Words are nice but often deeds are better - become less polite and more disruptive. Sexual equality is more than a lovely idea in principle. The science, Fine reveals, of Testosterone Rex does not block the path to a better place - it is our complacency in ‘waiting’ patiently for an evolutionary change to occur. Thinking that men are from Mars and women are from Venus is about our values not science.This review was first posted here: http://dragonlaughing.tumblr.com/post..."}, {"userName": "Fence", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/3611893-fence", "userReview": "I read Fine's Delusions of Gender a few years ago and really enjoyed it, so when I saw she had another one coming out I knew I had to order it. It is just as good as Delusions, and I would recommend it to anyone to read.\nIn this book Fine takes a look at testosterone and asks is it really the reason behind financial crisis, risk taking, and the differences between the sexes. the short answer is no. The slightly longer, but still short version is that it has an important role to play but it is equally as important as all other hormones in the human body. For more go read the book, it is fascinating, interesting, funny and very readable. Fine has a great style. She weaves personal anecdotes in with scientific studies as well as her own speculation. She counters arguments with facts and figures, but never in a dry and boring way.It is also a most quotable book, if you follow me on tumblr you may have noticed, if not click here for a selection and if that doesn't prompt you to think about trying this book I don't know what will.One of my very favourite lines is Social events regulate gonadal events. I think it should be my new motto.But apart from the writing style what she says in the book is important. She never says that there aren't differences between men and women, but she emphasizes that we cannot accurately tell what is causing those differences. From the moment we are born we are influenced by both genes and environment, and sometimes environment has a greater influence. Never mind the fact that when you average everything out there are more differences between men (or women) than between the sexes. Also, sex is a spectrum, not an either or. Stereotypes and hardline \"men are like this\" views do nobody any good.People are people, and people are different to people in many many ways. And society and experience do a lot to shape people. If you think about the idea behind \"privilege\" for example you can see that influences how people of differing backgrounds see and act. It isn't what you were born with, it is how society around you that shapes what you were born with.I've skimmed a few of the negative reviews on Goodreads and many of them seem to say \"I don't agree with this so it is wrong\" and some say that Fine wants to proclaim that there are no differences between men and women. Well, I've read the book and she makes it perfectly clear that there are differences, both in humans and in other species, what she is looking at is how innate those differences are and can they be altered? Also across the whole species are the differences really there. And in some cases she argues that, yes, they are. In others no, the variables even out across a large sample. Fine also points to numerous studies that show that just because X has been the way for so long, it doesn't mean it can't ever be altered.Of course I came to the book on her side, so maybe I'm just agreeing with her because it supports my view of the world. I'm not a scientist and am not about to go through hundreds of studies in an attempt to prove myself wrong. However I have skimmed through some of those \"men are from mars\" type books, you know the sort that try to argue that all relationship differences exist because men are like this while women are like that, and in most cases I don't identify with the version of womanhood that they portray. So maybe I'm just an outlier, or maybe there is more to being a person than what is between your legs."}, {"userName": "Margaret Sankey", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/5861086-margaret-sankey", "userReview": "GNC is capitalizing on the current political millieu with an obnoxious add shouting at men that their testosterone is less than their father's, and his was less than grandpa's--and we're being PUSSIFIED! (and GNC is going to make America macho again). If you're tired of having gender essentialism used to explain why men can never be nurses (testosterone precludes empathy and caregiving!), or why women will never be interested enough in business to be CEOs (maybe we should make calculators pink!), this is a popular science repackaging of the actual scientific articles which demonstrate that hormones often follow behavior, that social and cultural structures are often far more to blame for the way men and women behave (women are also interested in casual sex, when the deck isn't stacked to get them killed of socially shunned) and that taking GNC Testosto-Boost is not going to fix personal insecurities."}, {"userName": "Malin Friess", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/1400585-malin-friess", "userReview": "Not a compelling read."}], "description": "Many people believe that, at its core, biological sex is a fundamental force in human development. According to this false-yet-familiar story, the divisions between men and women are in nature alone and not part of culture. Drawing on evolutionary science, psychology, neuroscience, endocrinology, and philosophy, Testosterone Rex disproves this ingrained myth and calls for a more equal society based on both sexes’ full human potential.", "title": "Testosterone Rex: Myths of Sex, Science, and Society", "url": "http://www.goodreads.com/book/show/35187176-testosterone-rex", "average": 3.73, "cover": "https://images.gr-assets.com/books/1497194077l/35187176.jpg", "reviews": 193, "authors": [{"url": "https://www.goodreads.com/author/show/204893.Cordelia_Fine", "name": "Cordelia Fine"}], "type": ["Nonfiction", "Science", "Feminism", "Psychology", "Gender"], "outlinks": ["http://www.goodreads.com/book/show/35187176-testosterone-rex", "http://www.goodreads.com/book/show/30231724-testosterone-rex", "http://www.goodreads.com/book/show/32712593-testosterone-rex", "http://www.goodreads.com/book/show/33649597-testosterone-rex", "http://www.goodreads.com/book/show/33949719-testosterone-rex", "http://www.goodreads.com/book/show/30730689-testosterone-rex", "http://www.goodreads.com/book/show/36524697-testosterone-rex", "http://www.goodreads.com/book/show/8031168-delusions-of-gender", "http://www.goodreads.com/book/show/357666.A_Mind_of_Its_Own", "http://www.goodreads.com/book/show/5778669-the-britannica-guide-to-the-brain", "http://www.goodreads.com/book/show/40492661-testosteron-rex", "http://www.goodreads.com/book/show/39301533-delusions-of-gender-testosterone-rex-a-mind-of-its-own"]}