{"ratings": 34, "userreviews": [{"userName": "Karyn Rae", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/28144189-karyn-rae", "userReview": "This story was so much fun to write! I've never been a fan of research, but I loved scouring over millions of pictures of Zurich, Nashville, and Washington, D.C. The Achilles Heart took me on a year long adventure, and I hope it takes you on one, too."}, {"userName": "Laura Worden", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/1058635-laura-worden", "userReview": "I am a huge fan of Karyn Rae and she does not disappoint in her second book in the Achilles series! A well-crafted novel, full of twists & turns, it's hard to put this book down. I can't wait to read her next book!"}, {"userName": "Courtney", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/30581370-courtney", "userReview": "Karyn Rae did a fantastic job once again. This was a great sequel to The Achilles Heel! Keeps you on your toes, I enjoyed all the twist and turns, great read."}, {"userName": "Holly Engelking rasco", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/23557130-holly-engelking-rasco", "userReview": "Absolutely LOVED this book!! Great summer read!!"}, {"userName": "KRISTEN LAWRENCE", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/30606924-kristen-lawrence", "userReview": "Nothing like the firstI really enjoyed the first took in nurseries,and although it was not as clean as I prefer, this one was down right vulgar. There really want a story and any plot was predictable. I did give 2 stars since I was able to finish it."}, {"userName": "Amy Michel", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/27559234-amy-michel", "userReview": "Great sequel!This was a great second book. I really enjoyed the new characters and I liked the conclusion. Some parts were laugh out loud funny!"}, {"userName": "Kelly Mccurdy", "userReviewDate": "Feb 08, 2016", "userURL": "http://www.goodreads.com/user/show/15355759-kelly-mccurdy", "userReview": "~~I received this in exchange for my honest opinion~~ I was super excited to see this book being published. The first book was amazing, I couldn't put it down at all. This book was no different. It picks up right where The Achilles Heel left off. Annie is caught off guard when a blast from her past comes back home. She needs to find out if she wants to be with the past or move on to the future. Karyn writes great books. She knows when to pull on your heart or make you upset and yell at the characters when they are being idiots. I loved this book. I loved the chemistry that each character has with one another. Very few mistakes and you can relate to the characters. If you read the first book, you need to read this book!!"}, {"userName": "Shelly", "userReviewDate": "Apr 03, 2015", "userURL": "http://www.goodreads.com/user/show/4890746-shelly", "userReview": "Love reading my friends novel. Great story, Karyn! Can't wait for the next book!"}, {"userName": "Brenda", "userReviewDate": "Feb 06, 2016", "userURL": "http://www.goodreads.com/user/show/1127405-brenda", "userReview": "The second book in the Achilles series is a good read. Kessler and Jack both want Annie but she has to decide which one wins her heart. Lots of action and some insight into the main characters."}, {"userName": "Pamela ", "userReviewDate": "Jan 03, 2015", "userURL": "http://www.goodreads.com/user/show/3925721-pamela", "userReview": "Just as good as the first one."}], "description": "Annie Whitman’s life has become a pendulum again, but this time, it moves toward and away from two men. One of the men has swept her off her feet, and he loves her deeply. But he is a novice with love, susceptible to beginners’ mistakes. When he messes up in a newsworthy way, Annie must determine whether he is capable of constancy, and whether love is enough. Jack Stallings is a CIA-groomed killing machine who has always operated on principles of patriotic duty. Now he is discovering what civilian life has to offer, and what it means to develop honest, unfabricated human connections. At the same time, he had gone rogue with a mission of potentially cataclysmic dimensions. Annie’s past has caught up with her; her future is unknown. What happens next is up to her—with a little help from her friends and one Southern woman as full of wisdom as she is of good cooking. Fast-paced, provocative, and global—traversing everywhere from Switzerland to the Virgin Islands to the heartland of America—The Achilles Heart unearths the moral responsibilities behind life, love, and truth.", "title": "The Achilles Heart", "url": "http://www.goodreads.com/book/show/24287377-the-achilles-heart", "average": 4.29, "cover": "https://images.gr-assets.com/books/1420360493l/24287377.jpg", "reviews": 10, "authors": [{"url": "https://www.goodreads.com/author/show/8177932.Karyn_Rae", "name": "Karyn Rae"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/24287377-the-achilles-heart", "http://www.goodreads.com/book/show/24237661-the-achilles-heart", "http://www.goodreads.com/book/show/22239234-the-achilles-heel", "http://www.goodreads.com/book/show/39914144-harlow", "http://www.goodreads.com/book/show/34997756-state-of-affairs", "http://www.goodreads.com/book/show/35100932-the-51st-state"]}