{"ratings": 8220, "userreviews": [{"userName": "Auntie  Terror", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/63716836-auntie-terror", "userReview": "[rtf]"}, {"userName": "Lowed", "userReviewDate": "Dec 26, 2010", "userURL": "http://www.goodreads.com/user/show/3100453-lowed", "userReview": "Yeah.! This was an amazing read. If you like Philip Pullman's His Dark Materials (which I did), then you definitely have to grab a copy of these precioussssss piecesss. Anyway, As I was trying to check his website for an update of Clariel: The Lost Abhorsen the fourth book in the series.. I found this instead.. Really funny Nix! Really Funny. I still do not know how to create some really cute links here, so I just copied the whole article and pasted it. EnjoY!MY NEW REALLY EPIC FANTASY SERIESby Garth NixThis is a variation on a talk I gave at Aussiecon Three and at Swancon 2000. While I'm better known for writing quite dark fantasy, I do like to let the lighter side of my writing brain take over once in a while . . .I'm going to read the prologue from my new 47 book epic fantasy series which is currently titled THE GARBELIAD. The titles of the individual books include:Book One A Time of WheelsBook Two A Throne of GamesBook Three The Dragon Who Died YoungBook Four The Sorcerer's Thirty-Seven ApprenticesBook Five The Witch Wardrobe of LyonBook Six The Dark is FallingBook Seven The Seventh BookBook Eight The Return of the Mistakenly Purchased KingTo tell the truth I'm not entirely sure about the other 40 books yet, though I'm toying with 'The Book Whose Title Must Not Be Spoken' for Book 26. You know, to keep the series sort of atmospheric and spooky.Anyway, I decided that before I write this series I'd analyse the components of successful epic fantasy. Like when to have the ultimate evil first be mentioned and so on -- should it be page 42 or page 67? And one thing I discovered pretty early on is that you need to have a prologue and preferably a prophecy as well. A birds-eye view of something is a bonus and you can add that in if you like, but it's not essential.So this is the prologue and prophecy from the first book of my new 58 book series -I just decided I'd need another eleven books to do it properly, 42 isn't enough.PrologueFrom the Secret Ledger of the AccountantHigh above the dusty plains, an eagle whose wings stretched from side to side, soared and soared and . . . soared. Its eagle-eyes focused on the ground below, seeking out tasty vihar-vihar-rabbits.Then a glitter caught its eye. Not the glitter of dull vihar-vihar-rabbits. No, this was metal, not fur.The eagle folded the wings that went from side to side and dropped like an eagle that has stopped flying. Down and down and down it plummeted, until two hundred and three feet and seven inches above the ground its wings snapped out. The eagle stopped in mid-air.When it recovered from the shock of stopping so suddenly, the great bird of prey, the raptor of the skies, the lord of the birds, saw that the glitter came from a metal badge. A metal badge that was fastened to a brim. The brim of a hat. A hat that was on a head. A head that was connected to a body. The body of a man, who was a traveller. This was not a vihar-vihar-rabbit. This was not food. Still, the eagle circled in a soaring sort of way, watching and listening. For this eagle had not always been an eagle. It had once been an egg. But even so, it had the gift of tongues and could understand human speech. It could speak it too, though badly. It had a stutter because its beak was bent.This is what the eagle heard, when the man with the metal badge on the brim of his hat began to speak to the other men who didn't have metal badges and thus didn't glitter in a way that attracted the attention of eagles that soar.WHAT THE MAN WITH THE METAL BADGE ON THE BRIM OF HIS HAT SAIDGather round, unpleasant acquaintances, and partly listen to a tale of our knuckle-dragging forebears and the battles they ran away from. Our recorded history goes back some three weeks to the time that Sogren the Extremely Drunk burnt down the Museum. But I remember tales older still . . . going back almost ten years, to the time when Amoss the Stupidly Generous gave the Midwinter Party with the ice-skating accident.Know that this is a story before even that - back to the almost legendary but still quite believable times of twenty years ago. The time when rumour reached the Lower Kingdoms of a new, dark power growing without aid of fertiliser in the north. The name of the Overlord was spoken softly for the first time in secret and troubled councils. In many dark corners, lips whispered it, and then trembled with the effort of not laughing.For the Overlord's name was 'Cecil' and he was known to have a lisp. Naturally enough, he preferred to be referred to as 'Overlord', and whenever his agents heard his true name spoken, dire retribution would swiftly follow. No one was safe. The merest innocent mention of the word 'Cecil' would result in hideous and usually magical destruction of everyone within hearing distance.Within days of the first outbreak, the town of Cecil was completely vaporised, and poor unfortunates who had been baptised Cecil were forced to change their names to 'Ardraven' or 'Belochnazar' or other wimpish monikers lacking the macho virility of their own true names.How is it that I dare to mention the word 'Cecil' to you now? I have this amulet, which magically erases the word 'Cecil' from the minds of listeners after ten minutes have passed. Instead, you will remember a conversation littered with small chiming sounds where the word 'Cecil' has been erased.But I digress. Where was I? Yes. Frantic messages from the Dwarves went unanswered as their messenger service took so long to walk over the mountains that they weren't actually received until three years after the dire warnings they contained were sent. In any case, Falanor and Eminholme were unprepared to send men to war. Instead, they offered a troop of armoured monkeys and the entire population of a reform school for small children.This elite force went into the mountains and never returned alive. However, they did come back dead, even more horrible than before and in the service of Cecil . . . I mean the Overlord.Shocked, the kingdoms ordered a massive mobilisation and the kings had extra horses harnessed to their personal escape chariots. Yet, even as they extracted the most valuable items from their treasuries, many feared it would be too late.The forces of Cecil were on the march. Slowly, it is true, for dead Dwarves march even slower than live ones. Yet it became clear to the minds of the Wise that within the next seventeen years, something must be done.But it seemed that there was no power in the South that could resist the Overlord. For he was the mightiest sorcerer in his age bracket, the winner of all the gold medals in the Games of the Seventeenth Magiad. He was also a champion shotputter, who practiced with the skulls of his enemies filled with lead. And his teams of goblin synchronised swimmers could cross any moat, could emerge at any time in private swimming pools or even infiltrate via the drains, dressed in clown suits. No one was safe.It was then that the Wise remembered the words written on the silver salad bowl they had been using for official luncheons the last hundred years. It was brought from the kitchens, and despite the scratches and dents from serving utensils, the Wise could still make out the runes that said, 'Sibyl Prophecy Plate. Made in Swychborgen-orgen-sorgen-lorgen exclusively for aeki.'The other side appeared completely blank. But when olive oil was drizzled upon it, strange runes appeared around the rim. Slowly, letter by letter, the Wise began to spell it out.'A s-a-i-l-o-r w-e-n-t t-o s-e-a s-e-a s-e-a t-o s-e-e w-h-a-t h-e c-o-u-l-d s-e-e s-e-e s-e-e.'Days went by, then weeks, then months, as you would expect. If it was the other way around it would be a sign that the Overlord had already triumphed. Finally the Wise puzzled out the entire prophecy.A sailor went to sea sea sea to see what he could see see seeBut all that he could see see seeWas the bottom of the deep blue sea sea seaThe meaning of this prophecy was immediately clear to the Wise. They knew that somewhere in the Lower Kingdoms, a boy would be born, a sailor who would use the power of the sea to defeat the Overlord. A boy with eyes as black as the bottom of the deep blue sea. A boy who might even have vestigial gills and some scales or maybe a sort of fin along his back.But the Wise also knew that the Overlord would know the prophecy too, for his spies were everywhere, particularly amongst the waiters at the Wise Club. They knew that he knew that they knew that he knew.They all knew that the Wise must find the boy with the power of the sea at his command first, and take him somewhere where he could grow up with no knowledge of his powers or his destiny. They must find him before the Overlord did, for he would try and turn the boy to the powers of darkness.But who was the boy? Where was the boy? Was there a second salad bowl, a second verse to the prophecy, long lost to the Wise but known to an aged crone in the forest of Haz-chyllen-boken-woken, close by the sea, where a small boy with eyes the colour of dark mud swam with the dolphins?Yes, there was."}, {"userName": "Ashley *Hufflepuff Kitten*", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/29787548-ashley-hufflepuff-kitten", "userReview": "Okay guys, help me decide-- should I get this omnibus edition or do I get each book of the trilogy separately so I have three pretty covers instead of one?"}, {"userName": "Connor Grummer", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/12042278-connor-grummer", "userReview": "The Abhorsen Trilogy started with Sabriel. Sabriel lives in Ancelstierre at the start of the story, a place where charter magic, Garth Nix's own form of spells, doesn't work. Sabriel is the daughter of the Abhorsen, a powerful necromancer who defends against the undead creations made by necromancers. When a shadowy creation appears and tells her that her father is missing, Sabriel goes to the old kingdom, and searches for her father amidst old enemies and older secrets. The story progresses into Lirael and the final part of the trilogy, Abhorsen. In this story, Nix tries something that a lot of other authors have tried before. He tries to create a set of wizards, in this case necromancers, whose spells are more than bolts of light flying around. They have a different world, where you have to solve a sort of puzzle and pass a type of test to continue. I really enjoyed this interpretation of necromancy, especially after reading The Necromancer by Michael Scott. It made me stop and think,which is something that I really appreciate in a book. Nix is a great author, and I love all of his books, but Sabriel, Lirael, and Abhorsen, being the first of his writing that I've read. Since they were the first books of his that I read, they've always stuck with me a little more than other titles, like Shade's Children or The Ragwitch. The full series is significantly more than 1,000 pages long, but I don't recommend reading it broken into multiple sections like a lot of other people did. You have to read all of them relatively close together or else you'll start to forget the small details which are often important. All in all, the Abhorsen Trilogy is a great read, and I'd recommend it to just about anyone, as long as you can take hefty doses of great writing. If you can't take large amounts of great writing, then you probably shouldn't be using GoodReads, but that's just my opinion. Try getting the boxed set, full book, or buying/checking them out today!Note: I just noticed that there will be a FOURTH book. It is backstory on one of the villains. Clariel will be released (according the the GoodReads page) on 2013."}, {"userName": "Marc Aplin", "userReviewDate": "Jan 03, 2011", "userURL": "http://www.goodreads.com/user/show/4624802-marc-aplin", "userReview": "Many of you may not have heard of this series… I picked it up by complete chance about 5/6 years ago when visiting a relative. I forgot the book I was currently reading (Magicians Guild) and was kinda bored over the weekend there. Still having 5 days left on my trip, I walked past a charity shop and sat in the window was a book called ‘Sabriel’. Now, to me it looked ‘fantasy-ish’ so I picked it up…The book was so amazing that by the end of the holiday I was almost finished on the third in the series (after two emergency trips to Waterstones Book Store!). It in fact went on to go to my sister who to this day swears the second in the series being the best book she ever read (Lirael) and myself having very fond memories of it and wishing, begging, pleading Garth Nix to do a follow up…The series I am talking about here is ‘The Old Kingdom Trilogy’ by Garth Nix. Also known as the ‘Abhorson Series’ in North America; it consists of three books; Sabriel, Lirael and Abhorsen. The challenge here is doing a review on three books without giving any spoilers… I’m gonna give it a shot!The first book, Sabriel follows a young girl who is in a seemingly normal(ish) school. We quickly find out that this school is ‘behind the wall’ and therefore safe from what has happened in ‘the old kingdom’. We find that the old kingdom is full of danger. Sabriel gets a message from her farther who is the Abhorsen – the man charged with following spirits into death and ensuring they get through it. This is a world where evil spirits don’t like to die. And when they do die they fight death.In the Old Kingdom, when a creature dies it enters into the River of Death. Once there, these once living spirits who have both the inclination and the ability to resist the pull of the River of Death may rise again. Though very few are powerful enough to fight the currents, if summoned by a necromancer it is a relatively quick process for them unless stopped by the Abhorsen.The fact that the Abhorsen is now missing means that anyone wanting to summon the dead can do so fairly easily. Sabriel knows why her father has given her the message – she needs to return to the Old Kingdom and rescue him even if he is already dead himself. Quickly she finds that to find the Abhorsen she is going to have to fight the dead in both the Old Kingdom and the River of Death…. Something she does not have nearly enough power for.Her journey is one of magic, betrayal, love, growth and even possessed, talking cats.—Book Two links in with book one but we are no longer following Sabriel (for reasons you will see after book 1). We are now following ‘Lirael’, living at a school for those who have ‘the sight’ – she is an outcast on the verge of suicide. ‘The Sight’ is the ability to see into the future or at least see the possibilities that the future brings and the fact she has not yet developed it is of great shame. Where as most girls develop the ability around 11, Lirael is 14 now and without it. In addition to her lack of the gift, she also differs physically from all the other girls at her school. Where as they are beautiful with blonde hair and striking blue or green eyes, she has a pale complexion, black hair and brown eyes.Upon her 14th birthday the Clayr (The name of the race that Lirael is a part of) appoint her to work at the library. Although still distressed over the lack of sight it gives her focus and a ‘role’ in the school. Through her work in the Library Lirael is able to access books that are usually ‘out of bounds’ and casts a spell, which inadvertently goes wrong and results in the summoning of the Disreputable Dog.Through the usage of the library and help of the Disreputable Dog (who can talk!), Lirael begins to unlock the keys to embarking upon an adventure of utmost importance.At the same time we meet a prince based in Ancelestierre (the good side of the wall) who is left injured by a fight with an evil necromancer (one that helps the dead rise through the River of the Dead). When Sameth is revealed to be in-line to become an Abhorsen one day, he rejects the idea due to his fear of necromancy.Their stories are interwoven, whilst Sameth must return to the Old Kingdom and learn to help counter the enormous threats that are coming, Lirael must too do her part with help from the Disreputable Dog. Both extremely young and barely able to cast their first, most basic spells – just how is it that they will steer the world away from the coming darkness and mystery that is approaching?—Book Three in the trilogy is Abhorsen. It is the linking of the previous two books and of course the conclusion. The evil powers in The Old Kingdom have been growing in strength and number and it is the job of the remaining characters to work together and overcome the threat they possess to the thriving Kingdom of Ancelestierre. I can’t say much else without spoiling the previous two books, but it is certainly a good bringing together of all the characters and story lines up until this point.——————————————————Onto my thoughts on the series… this is a very ‘different’ series. It is not a ‘huge’ or ‘epic’ fantasy. It has been marketed for those aged around 15-17, although is very, very universal. I’d say the reading age would be higher than that of Harry Potter for example so don’t think anyone should label this book as a ‘kids book’ and write it off. The ‘Old Kingdom’ is one of the most realistic worlds I have ever read about in a geographic sense. The contrast of a modern, technologically advanced Ancelestierre living in relative harmony with ‘The Old Kingdom’ being a complete wasteland full of Demonic Creatures, Magic, Death and Evil is told in a way that is so far unmatched.What really makes the books is the system of death. The fact that when an evil creature dies it is not dead… it is living in the ‘River of Death’ is terrifying and a unique way to do things. There are 9 gates of death, each with stronger and stronger currents. Therefore to ensure that something is ‘really’ dead you need to push them through all 9. Even the Aborsen can only go a certain distance into death, relying on the currents to push them the through the remaining gates. By going too far the Aborsen risks an ambush from any number of dead fighting against the currents, getting trapped against the current or even dragged through the 9th gate them-self.When we are not in death, we are primarily in either the Old Kingdom or the Clayr’s school. Both are fascinating places that are brought to life through Garth Nix’s writing style. There are various styles of magic; Charter Magic, Necromancy and Free Magic that are all used to keep battles and obstacles enjoyable. Perhaps the interaction between Sabriel and ‘Mogget’ the talking cat as well as Lirael and the ‘Disreputable Dog’ is one of the very best parts in the book. There is always the question there as to whether Mogget is trying to help or to kill Sabriel as he openly tells us when we first meet him/her that her father trapped his evil spirit into the cats form. The book moves at such a breathtaking pace that by the time you have finished you cannot believe how much has really happened. Everything is interesting in this series – there is not a dull moment and there is very little world building or background that doesn’t involve some kind of action.Perhaps my one problem with this series is that it was a trilogy. That might sound as if I am saying ‘I want more books’, but actually it is more; ‘I want more answers’. There are a few loose-ends to say the least and even a few characters who we are lead to believe will be re-introduced are not. I personally think (could be wrong) that Garth Nix intended to write more of the Old Kingdom books soon after the original trilogies release but simply didn’t have time… He has gone on to write some very popular series since that maybe he wasn’t expecting to do and I can only guess this got put on the back burner. Perhaps supporting this assumption is the fact that Garth Nix has written a number of ‘short stories’, showing he does want to re-enter this world but just doesn’t have time or inclination to commit to a full novel.According to wiki-pedia (not the most reliable of sources);“Garth Nix has announced two additions to the series: a prequel and a “sequel of sorts to Abhorsen”. While the sequel is unnamed, the prequel has the working title Clariel: The Lost Abhorsen. The books are stated to appear in 2011…” HOWEVER I looked a few years ago and it said the same thing but with ’2009′ on the end so I am waiting to see.Fantastic series that if you have not done already – you need to check out! Just be aware that it is a book that will draw you so deep into its world and characters that leaving them will be hard and leaving them without a complete resolution is even tougher. I guess the question to ask; “Is leaving a reader begging for more always a good thing?”"}, {"userName": "Squeemu", "userReviewDate": "Aug 13, 2007", "userURL": "http://www.goodreads.com/user/show/277054-squeemu", "userReview": "Technically, I started reading this trilogy about ten or so years ago. I don't really remember -- I might've been around fourth or fifth grade when I first read Sabriel. I loved the book so much. Bells, the river of death, the Wall -- there is so much originality. I wanted in the Old Kingdom so badly, and I wanted to be Sabriel so badly when I grew up.Of course, I haven't done either of those things. But what I did manage to do is read the other two books in the trilogy. They never quite hit me the same way Sabriel did -- the characters just aren't the same, and, uh, Lirael kind of got on my nerves for the first few chapters. (I stuck through it, though. Mostly by being amazed at how accurately Mr. Nix portrayed child depression for not belonging.) Having said that, I think the last two books, Lirael and Abhorsen are written better, have more depth and detail to them, and develop the characters and world better. Sabriel still wins my heart, though."}, {"userName": "Stephanie Vautour", "userReviewDate": "Jun 20, 2011", "userURL": "http://www.goodreads.com/user/show/3181022-stephanie-vautour", "userReview": "One of my all time favorite series of books. Will never forget this one. Sabriel is a one of a kind character that wouldn't fit into the new teenage novels unfortunately so many people probably won't take the time to pick these books up. Takes me back to a time when para-normal activity was supposed to elicit fear not lust :S"}, {"userName": "Jen Julian", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/2477570-jen-julian", "userReview": "There's something very *pure* about this trilogy that I can't quite put my finger on. Honestly, I think if I'd read these books as a teen, I would've been confused and bored, though that would have been the result of my own inattention. Reading them now, I can see the intense and subtle care that has gone into the crafting of Nix's world, especially in the way that magic functions, both as a structured utilitarian system (charter magic) and a natural, untempered chaotic force (free magic). There's a lot more to explain about how necromancy fits into this, how the Abhorsen stands in as a kind of one-person army, maintaining order between the living and the dead. Point of view is third person omniscient, but there is no Hagrid-like gatekeeper to guide us along and instruct us about what's what and who's who; we must instead infer the world's inner workings from how characters suss out whatever situations are going on around them. The end result is an exploratory close-to-the-ground experience viewed over the shoulders of the trilogy's protagonists, Sabriel and Lirael, two quiet but highly independent and active characters. You could even say that the triology is, at it's core, about young women setting off on their own, executing plans (however flawed), and solving seemingly insurmountable problems.There's also a talking cat, and a talking dog, and they are both very good and magical.The trilogy isn't perfect. It's villains are not as complex or as frightening as they could be; their motives are not where the narrative's interests lie. When the endgame boss's ultimate goal is the debasement and destruction of all things everywhere, there's not much doubt as to whether or not the protags will succeed in their quests. But it's still a fun ride in the meantime."}, {"userName": "Shyla", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/30441321-shyla", "userReview": "This is one of my favorite series. The world building is amazing, especially the rules of magic that exist in the Old Kingdom, from charter versus free magic to whistle-based weather magic to nine watery levels of death. All the leads, Sabriel, Lirael, Sam, and Nick, are appealing, and the mysteries--in Sabriel, the whole Old Kingdom is something of a mystery and Touchstone's past becomes a key point, and in Lirael, her parentage and true purpose--keep the story engaging. These stories have a wonderfully reflective and soulful tone that elevates them and makes them feel really worthwhile. And perhaps my favorite thing about this series is that it so effortlessly sidesteps conventions of the genre at every turn. Sure, some of the staples are there--girl with unusual magical heritage, magical animal companion, traveling and bickering with the hero--but it never goes quite how you expect it to and manages to avoid anything resembling cutesy or twee. And there are so many elements that seem completely unique to this series. Instead of self-consciously trying to subvert all the tried and often trite tropes of the fantasy genre, the distinctive nature of these stories seems natural, a product of the imaginative world they take place in.That said, the series wasn't perfect, especially Sabriel. I was hooked on Sabriel from the first chapter, but I did find that her long, solitary journey at the beginning of the story dragged a little. It gave a nice slow-burn introduction to the Old Kingdom and necromancy, but I kept wishing she had some human interaction, both to help along her character development and to show that the Old Kingdom was a real if broken-down place rather than a barren wasteland--the post-apocalyptic tone was interesting but made it a little harder to get invested in rebuilding the Kingdom.In contrast, I really liked the slow build up of Lirael's often isolated life with the Clayr. I thought the Clayr were a very interestingly drawn group, well-meaning and yet they neglect Lirael almost to the point of abuse. Even though less happens during this section than during the beginning of Sabriel's journey, it is rife with tension, Lirael's internal conflict between her desperation to finally be a true Clayr versus her desire to escape driving the story forward. Sam has similar struggles and character development.I guess I just wish Sabriel, as progenitor of this series, had been better developed. She isn't a stock character, she doesn't fall into cliches, but I kept expecting there to be a little more to her, and I never really got to see what that was. Perhaps if we had seen more of her life in at her boarding school in Ancelstierre, the world without magic, before she rushed off to the magical Old Kingdom, to give more of a sense of contrast between the worlds and increase the tension of her being out of her element...But these are just nitpicks, really. It was a great series, and one I will come back to again and again."}, {"userName": "Cate", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/11595581-cate", "userReview": "This is a huge book even by my standards, and to add to the confusion it is one of those that, by some strange reason is known under a different title depending on where in the world you live; for example in the Authors native Australia this book is entitled The Old Kingdom Chronicles. It is also a trilogy that not many fantasy readers appear to know about. As for me it took me some time to actually finish reading this, and that was not due to its size.The characters in all three of the books, in my opinion, could have benefitted from a lot more time spent in their development. None of them really gripped me and made me want to invest more of my time in getting to know them. I really was expecting to like the characters, but they were flat and very one dimensional people who seemed to enjoy a lot of walking. You would have to read the books to understand that reference. Having said this, the character of Sabriel in the first book of the three was, by far, the most interesting of any in the Chronicles; she is a determined young woman with a definite plan for her life. When curve balls are thrown at her she is able to adapt and think on her feet making her the most impressionable of all the characters in these books. What really would have helped the characters come into their own in these books would have been more background and explanation into how they learned their skills and came to be in the place they are when the books open.The world in which these books are set could have been so much more. It was a wonderful concept but I felt that the Author really did not do it justice and, like his character development, it would have benefitted from more time being spent in the descriptive aspects. At no time did I feel as if I had actually been transported into this world and was experiencing the events occurring; in a good fantasy novel a reader should feel themselves transported to the alternate world, as that is part of the pull of this genre.After buying this trilogy on the recommendation of a friend, I now wish that I had kept my money in my pocket and will be donating my copy to the local library. If long and plodding fantasy books are something you enjoy, this is probably the book series for you; if not I would recommend you give this a miss.Originally reviewed on: http://catesbooknuthut.com/2015/01/26...\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License."}, {"userName": "Althea Ann", "userReviewDate": "Jun 09, 2010", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "These were fun books.Sabriel is pretty much a stand-alone book, but the second two are really one novel - Lirael ends right smack in the middle on a cliffhanger, and Abhorsen starts right where it left off...The trilogy gives us a dual world - one which very strongly resembles Britain in the early twentieth century - and then, across the Wall, the Old Kingdom, a magical land which is currently in a dire state of anarchy and seriously plagued by the Dead - which rise as zombies and make themselves the sort of nuisance that zombies generally do.Sabriel has been raised at a girls' school in Ancelstierre (Britain), but has always been aware that her father is the Abhorsen, a powerful individual with magical influence over the Dead. But when her father disappears, and Sabriel sets out to find him, she realizes that she has never been aware of even half of her father's abilities and duties... duties which are now on her shoulders, as she realizes that more is at stake than merely her father's life...The second story (Lirael/Abhorsen) takes place around 20 years later, and deals mostly with the next generation... of course, things are even worse, plots are afoot to bring about the end of the world, necromancers are causing problems, and our young protagonists, Lirael and Sam, must both discover who they truly are, find their path/calling in life, and, oh, save the world. With the help of the snarky magical cat (?), Mogget, and the Disreputable Dog."}, {"userName": "Diliaur", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/12068007-diliaur", "userReview": "Love the story, the world, and the characters. Well-paced page turners, featuring pretty classic quest stories. Doesn't break any boundaries but the world is beautiful, with just enough information to make you want to learn more; the characters grow, both in themselves and on you; and it balances the plot with small but effective moments of comedic relief, which I find especially enjoyable because they're such quick bursts of humor they leave you wanting more -- but Nix keeps the action going.I'm currently on my third reading of the trilogy, which I end up doing about once a year when I'm home for the summer and find the box set sitting on my shelf. As someone who rarely picks up books again after I'm done with them, that's saying something for how enjoyable the books are to read. They're easy reads, and the stories just catch you up in them. I'd absolutely recommend the trilogy to anyone, not just fans of the fantasy genre."}, {"userName": "Puck", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/9064045-puck", "userReview": "Reading Clariel made me yearn to reread this wonderful series by Garth Nix, which I last read when I was in middle or high school. And I have to say, for the most part, it holds up to a reread. All the characters are wonderful and well-developed; the cosmology of Death, Free Magic, and Charter Magic is beautifully wrought; and the story pulled me in as intently as before. I could barely put the book down to interact with the people I love most.Stylistically, there's a few choices made here that I don't love -- in particular, Garth Nix is VERY FOND of dramatic sentence fragments. They're great when used sparingly, but put enough of them on a page together and I find it makes the narrative a tad choppy. That wasn't nearly enough to damp my enthusiasm for the novels, however.I recommend this series for young readers and adults alike."}, {"userName": "Kelsey", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/32852342-kelsey", "userReview": "This fantasy storyline is refreshingly original, fast-paced, darkly humorous, and will suck you into the dangerous world of the Old Kingdom. The character development is wonderful. I connected with Sabriel and Lirael, adored the Disreputable Dog, and even grew to love the snarky \"cat\" Mogget. The reader will want to whistle up a wind from a paperwing, wield the bells of the Abhorsen, and ,if they are anything like me, long to explore the great Library of the Clayr. One of my favorite series. These books were referred to me in high school by a friend. At the time, I did not read much in this genre. So, I was surprised to find that I Loved these books. I have re-read these books many times and will, I'm sure, enjoy them many more times in the future."}, {"userName": "Eric", "userReviewDate": "May 24, 2007", "userURL": "http://www.goodreads.com/user/show/76688-eric", "userReview": "This reminded me somewhat of the His Dark Materials trilogy by Philip Pullman, but not quite as good. Where His Dark Materials is about Science and Religion instead of Swords and Sorcery, the substitute here is Necromancy.My issue with this trilogy (and to a lesser extent with His Dark Materials), was how the second book started out with a new unfamiliar character. In the case of Lirael, her story was not compelling enough for me to want to read it. I wound up putting the book down for a while, and didn't pick it up for a while, finally forcing myself to trudge past the lull of Lirael's back story. Besides that one complaint about the middle of the three books, the series is good, and worth a read by any fantasy fan looking for something a little different."}, {"userName": "Rachel", "userReviewDate": "Jan 09, 2008", "userURL": "http://www.goodreads.com/user/show/622888-rachel", "userReview": "I just finished \"Abhorsen,\" the third book in the trilogy. I read \"Sabriel\" a long time ago, in high school, and \"Lirael\" several years back. I never got around to finishing the series even though I loved the books...now I finally have and the only disappointment I have is that (aside from a further book of \"related\" short stories) this wonderful story is now over, and that Nix is not a more prolific writer. Some of the most interesting and emotionally mature Young Adult fantasy I've ever come across. Also recommended: Nix's post-apocalyptic nightmare \"Shade's Children.\""}, {"userName": "Annie Fanning", "userReviewDate": "Sep 15, 2009", "userURL": "http://www.goodreads.com/user/show/1559319-annie-fanning", "userReview": "I admit that I am currently reading far below my grade level.Maybe I missed my adolescent moment to truly immerse myself in the Fantasy. Maybe I am making up for lost time. Maybe I am researching appropriate Fantasy novels for the giraffes. Maybe I require lite works with strong female characters. If you are looking for some lightweight magical fare that features girl-heroes, check out Nix's Abhorsen Trilogy. It is truly not to be missed, the first, second or third time round"}, {"userName": "Micheline", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/4845030-micheline", "userReview": "Series review to come! Instant all-time favorite and new obsession ♥"}, {"userName": "Octavia Cade", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/30079754-octavia-cade", "userReview": "I read and reviewed all three books in this trilogy separately, so this is really just for my own records. Both Sabriel and Abhorsen I rated as three stars, and for much the same reason. I liked the world building - I found the whole thing with the bells particularly interesting - but I couldn't seem to connect emotionally with either book, and that was largely because of the characters, I think. Sabriel, Touchstone, and their children do nothing for me. As far as I'm concerned, book number two, Lirael, was the absolute stand-out of the series. I really enjoyed it, and it earned four stars from me. I love Lirael, I love the Disresputable Dog, and I especially loved the Clayr library (I could read a whole book about that library! was sorry when she left it). I did not love Sam, not one bit, but even his presence didn't drag down everything that made the book so much fun.Averaging out, it's three stars for the series."}, {"userName": "Krista", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/9902269-krista", "userReview": "Hands down, one of my favorite fantasy adventure series. You wouldn't expect a series that revolves around Death to be so full of life, but when it rains in a scene, you can believe that you feel it in your skin and wade through the River of Death itself. It is a series that immerses you in its present and manages to mix elements of romance, mystery, suspense and magic. Sabriel inherits a huge task and takes it in stride but somehow manages to still seem down to earth. The characters are deep but relatable, the environments are easy to visualize and not over described. This is a rare fantasy series that doesn't mess with unnecessary filler."}, {"userName": "Jessica", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/64218993-jessica", "userReview": "If you fantasy magic mixed with darkness, this is your go to series!I haven't put it down since I first fell in love with it (in the seventh grade). Throughout my years I've re-read it time and time again because the magic and the story line is exactly what I need to be able to disappear into another world. It doesn't stop when you put the book down either. You'll find yourself compelled to keep going if not, you're going to be wondering all day!Enjoy."}, {"userName": "Tracy ", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/4556838-tracy", "userReview": "I finally bought my own copy and will be re-reading it a few more times :).If you like magic, fantasy, female heroines, and the good 'ol fight of good vs. evil....then what are you waiting for? Plus the second book has the romanticism of libraries in it, which is never a let down. I want to be magical soooooo badly!"}, {"userName": "Eleanor", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/45690646-eleanor", "userReview": "I love this series so much and have read it three times over! All of the books had so many interesting characters and plots that kept me reading into the night! However, I would recommend the books for people over 12 years old as it has advanced language and themes. If you haven't read these then you're missing out and should go and read them now!"}, {"userName": "Gus", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/72169251-gus", "userReview": "I thought that this book was very interesting and kept your attention. I liked how there were a lot of words or names of things that were part of the book it somehow made you more immersed into the text."}, {"userName": "Philip Burchett", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/51684757-philip-burchett", "userReview": "It seems that everyone has a role in the world. The cast of characters in lireal and abhorsen reminded me of both Harry Potter and the goonies. I loved lireal and the message of who she becomes despite her failed expectations."}, {"userName": "Firefly Hiddleston", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/80877599-firefly-hiddleston", "userReview": "I absolutely LOVE this series. I've read it three times and now I finally own the series. LOVE, LOVE, LOVE the books. Garth is amazing with these series.My favorite character is Mogget. I love him. Afrer him, Disreputable dog. I highly recommend these books."}, {"userName": "Jade Reads", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/68969901-jade-reads", "userReview": "My favorite book series !!!"}, {"userName": "Ivy", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/43904149-ivy", "userReview": "Amazing enchanting dark #threewordreview Definitely a new favourite!"}, {"userName": "Chris Dent", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/402723-chris-dent", "userReview": "3 stars for the written version, but if we're rating the audiobook (narrated by the inestimable Tim Curry), then my adjective renders its rating...well... inestimable."}, {"userName": "Deirdre", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/7940013-deirdre", "userReview": "Loved these books. The second book is a little whiny but the dog makes up for it. Always in my list of to-recommend books."}], "description": "To preserve life, the Abhorsen must enter Death", "title": "The Abhorsen Trilogy Box Set\n      \n          (Abhorsen #1-3)", "url": "http://www.goodreads.com/book/show/47615.The_Abhorsen_Trilogy_Box_Set", "average": 4.53, "cover": "https://images.gr-assets.com/books/1407105785l/47615.jpg", "reviews": 239, "authors": [{"url": "https://www.goodreads.com/author/show/8347.Garth_Nix", "name": "Garth Nix"}], "type": ["Fantasy", "Young Adult", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/47615.The_Abhorsen_Trilogy_Box_Set", "http://www.goodreads.com/book/show/3469474-the-abhorsen-chronicles", "http://www.goodreads.com/book/show/11563999-the-abhorsen-trilogy-box-set", "http://www.goodreads.com/book/show/18487069-the-old-kingdom-chronicles", "http://www.goodreads.com/book/show/47631.The_Abhorsen_Trilogy", "http://www.goodreads.com/book/show/26189714-garth-nix-3-books-collection-set-sabriel-trilogy-bundle-garth-nix-col", "http://www.goodreads.com/book/show/518848.Sabriel", "http://www.goodreads.com/book/show/334643.Abhorsen", "http://www.goodreads.com/book/show/47624.Lirael", "http://www.goodreads.com/book/show/47613.Mister_Monday", "http://www.goodreads.com/book/show/47619.Drowned_Wednesday"]}