{"ratings": 89197, "userreviews": [{"userName": "Jennifer", "userReviewDate": "Sep 19, 2007", "userURL": "http://www.goodreads.com/user/show/388792-jennifer", "userReview": "OK, folks, for the last time, here's the real story. 1. On 13 November 1974, a murder occurred in the home known as \"High Hopes,\" located at what was then 112 Ocean Avenue, Amityville, New York. The victims of the crime were the DeFeo family: Ronald Sr., Louise, and four of their five children; Dawn, Allison, Mark and John. 2. Ronald \"Butch\" DeFeo, Jr., eldest son of the DeFeo family, burst into a local bar in town that night around 6:30PM, asking for help. 3. Butch DeFeo was later tried for and found guilty of the murders of his family, and was sentenced to the Green Haven Penitentiary. Every attempt DeFeo has made to be granted parole has been rejected, he is serving consecutive life sentences. DeFeo turns 56 years old next week (09/26/07).4. The house was resold following the murders and probate. Among the owners since the murders were a couple named George and Kathy Lutz, who occupied the house in late 1975. The Lutzes later collaborated with an author to write this \"true account\" of their stay in the house. Mrs. Lutz has since passed away from cancer. 5. No other owner of the property has complained of psychic disturbance, hauntings, paranormal activity, or any other issues with the house. The novels which followed this one claim the house is located on a Native American burial ground. No local tribe has substantiated this claim. 6. Due to unwanted publicity, the house has been painted and the number changed to avoid onlookers. The murders happened, folks. They're real, they were tragic. There are some odd inconsistencies about them. But that is IT. There is NOTHING to substantiate any possession, haunting, demonology, incest, or anything else suggested in this book. It is a work of fiction, which the Lutz's lawyer later suggested they dreamed up after a night of drinking. If you want a book about a haunting, go find a good telling of the story of the Bell Witch (verified by a President of the United States) or read the \"Weird\" series, edited by Mark Moran. This is just nonsense. There is no basement door to hell in a quiet Long Island suburb. Sorry to disappoint everyone. :: steps off soapbox:: End of Rant. Thank you."}, {"userName": "Justin", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/2795921-justin", "userReview": "Let's pause for a minute and laugh out loud at the fact that this stupid book was in the nonfiction section of my library. HAHAHAHAHAHAHAHAHAHAHAHAAAAAA HAHAHA HA. HA. HAAAAAAOK, I think that's good. Wait....HAHAHAHAHAAAAAA OH MAN! HAHA'OK...That's not why it gets one lousy star anyway. It gets one star because I think it was written by a twelve year old. The writing was so bad that it distracted me from the absolutely ridiculous story. There was just no life in the story at all. I mean, the ghosts described in the book were more alive than this tired, boring (fake, yeah I said it) story. My God, man, at least use a few adjectives here and there. Give me some description of who these people are and why I should care. If this is supposed to be horrifying, why does it feel like you just learned how to write a paragraph?First, people moved into a house. Second, weird things happened to them. After that, they were scared to live there. Finally, you won't believe what happened next! End of chapter cliffhanger and oh my goodness can you believe what's happening? You can't? Wow! I can't either because it didn't! And even if this was in the fiction section it wouldn't be worth your time because it feels like a story a bunch of Boy Scouts tell each other around a campfire, not something to actually read.That's the gist of the story with minor embellishments. Minor. Perhaps if someone else wrote this book, I may have cared a little more. I don't know. I don't care. Happy Halloween everyone! Pick a different book to scare you this year."}, {"userName": "Justin Tate", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/23082940-justin-tate", "userReview": "Loved it. More than I should have, probably. A brilliant way to write a novel (yes, let's just admit this is a novel). The matter-of-fact, journalistic tone used to describe horrific events expertly aided the 'realism' façade, and it made for great storytelling. Toward the end the pacing went off and turned into kitchen sink horror (just throw everything out there!) but it still worked. The ending 'Afterward' was genius and is likely why this classic endures and continues to inspire a whole subgenre of horror.If you've seen one of the zillion Amityville movies but haven't read the book, you're missing out. It's a different and wholly enjoyable experience."}, {"userName": "Stepheny", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/7091879-stepheny", "userReview": "The Amityville Horror is a book whose reviews are all over the place. On my friends list I have ratings from 1 to 5 stars all across the board. I wasn't sure where I would fall in relation to my GR buddies. I listened to this one on audio as it was one of the 3 books that appealed to me and was available through OverDrive. It was a quick listen and I really enjoyed the narration. I watched the movie in my teens and there have been so many of them made I really don’t know which one I watched or how good of an interpretation it was. To be honest, I don’t remember a whole lot. I remember the basement opening up to Hell and a little girl standing on the top of the roof. Other than that? Not a whole heck of a lot. Clearly it left a lasting impression…. ;) I liked the way the narrative was broken up. You get the story from a few different sources. There is the interview with the family who experienced it. There is the view of the investigator taking their statement. And there is the view of the priest that was afflicted with flu-like symptoms after trying to rid the house of evil spirits.It was a unique story and one that has probably been called into question since it was told. The history of the house and the mystery behind what actually happened there is part of the allure of THIS book. And I could see why others might think they made it all up.Sometimes there are things that are beyond explanation. There are things that cannot be explained. There are things that make us question the higher powers of the universe ; they make us question our own beliefs. I did enjoy the book and especially the narration. I still haven't made up my own mind as to what I believe and what I don’t. But this is a book that will resonate with me. The weird part of me is that reading a book like this knowing it is a real place makes me want to go buy the house and see what happens. Jeff, what do you think? Time for a change of scenery? I hear the basement down there is something forespecial!"}, {"userName": "Becky", "userReviewDate": "Jul 29, 2008", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "This \"true\" story is about as scary as a Ke$ha/Charlie Sheen lovechild. It's terrifying... but it's not the baby's fault. It was created out of a union of glitter-vomit and Tiger Blood. Mama SLutz is an attention whore just in it for the money and notoriety, and Daddy is a talentless hack who just spouts random words emphatically and claims they make sense. It's like it was written by a 12 year old with ADD and then edited by someone who speaks English as a 2nd language... and started taking the classes just yesterday! Exclamation point! But hey, they did something right, because I just read this pile of steaming poo! Exclamation point!So let me tell you about the book, m'kay? There's this family called the sLutzes. They moved into this house on the 18th of December - no the 23rd of December - no the 18th of December because when they moved out on January 14th that was 28 days and Jay Anson can count, yayyyy! Exclamation point! So the Putzes SLutzes - Wait. Did we meet Father Frank yet? Father Frank has a BAD FEELING. And then he gets sick with the flu a lot and that makes him feel bad! So then the SLutzes move in on the 18th-23rd-18th of December and then weird stuff starts happening in their house like the windows opening and it being cold. They have money problems and can't afford their boat or their wardrobe but never go to work. Also Officer Gionfriddo is the most badass ninja policeman! Exclamation point! He can drive down the street and totally not see that guy going into the WITCHES' BREW until 50 feet after he passes him, and then recognize his beard, the way he walks, and the shape of his body! Crouching Gionfriddo, Hidden Ninja! Multiple Exclamation Points!! HIGH SCORE!Father Frank had blisters on his hands. Then there was a lion. Then George was all like \"LET MY PEOPLE GO!\" and then Gionfriddo sat quietly in his police car with the lights off watching in a non-creeper way while George acted all \"like a lunatic\" but later Gionfriddo said it was OK because they were closing the windows so he drove away with his lights off... totally not like a creeper, I said! SCARY PIG! Jodie says he's an angel but he's really a BEAST! RUN! Then there is a storm and they are TRAPPED IN THE HOUSE except for when they got in the car to go to the doctor's office for some band-aids and baby tylenol. Also, call Father Frank. Then they moved out and then the story was over except when they levitated some more and then moved to California where levitation is illegal. Congratulations. You've now read The Amityville Horror. I'm sorry."}, {"userName": "Dirk Grobbelaar", "userReviewDate": "Jan 31, 2013", "userURL": "http://www.goodreads.com/user/show/3102740-dirk-grobbelaar", "userReview": "\"Do you think it's haunted?\"\"No way, I don't believe in ghosts.”It seems the reading world is clearly divided about this book. The common question obviously being: is this actually true? I would like to add another question to the equation: does it actually matter?To some extent, it does. The extent to which this novel will scare you correlates directly to (a)whether you believe the events depicted here are true and (b) your religious orientation. Personally, I’m still reserving judgement on just how “true” everything in here may or may not be. The spine classification says “non-fiction” but we’ve long since learnt not to believe everything we read. The book did create a storm of controversy, and I’d be very surprised if it hadn’t. It’s just that kind of book.Something that did occur to me while reading this was the old adage: “Where there’s smoke…”\"I'm worried about what could happen next. Why don't you just get out of that house for a while?\"Then again: take a step back and look at the book from a different point of view. How many other similar stories have you read, which you absolutely knew was fiction, and it still scared the living daylights out of you? It needn’t be a wasted opportunity – you have an imagination, don’t you?I will say this for the subject matter: if stories like The Exorcist and Rosemary's Baby scared you, this book will too. Of that I don’t have much doubt. If the events depicted here are in fact true, this book’s creep-factor skyrockets through the roof.”There's something in our room!\"I enjoyed the book well enough. From a literary point of view, however, the writing is very workmanlike and matter-of-factual and, frankly, just a bit bland. It adds to the feeling of realism, but a few dramatic flourishes would have made the whole thing a bit more enjoyable! And let’s be honest, there are scenes that come across as a bit hokey. Still – it’s a fairly solid three stars. ”We’re trapped. It’s not going to let us go.”In closing. If you are one of those people who would normally skip the Foreword and Afterword of a book, it is important in the case of The Amityville Horror to actually read it, just to get some perspective. Yes, even if you think it’s hogwash."}, {"userName": "Coos Burton", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/21766870-coos-burton", "userReview": "Terminé este libro anoche durante una buena tormenta, y hacía bastante que no experimentaba algo tan intenso con una historia. Puedo contar con una sola mano todos los libros que alguna vez me causaron escalofríos, y me sobran tres dedos. Literalmente, \"It\" de Stephen King fue el que más miedo me dio, y actualmente sumo a la lista \"The Amityville Horror\".Tiene una lectura super ágil por el hecho de que narra puntualmente las situaciones, sin demasiado decorado, la forma en la que sucedieron, de qué manera lo vieron y vivieron los Lutz. Aproveché a leer este libro durante unos días en los que permanecí sola en casa durante la noche, y sinceramente fue de las mejores experiencias que pude tener. Me resulta muy impresionante desde un comienzo, cuando narra el trágico suceso con los DeFeo (partiendo de la base de que ese tipo de casos me ponen los pelos de punta, sin excepción), y luego la aparición de los Lutz, quienes inocentemente acceden a un ofertón, y adquieren la casona que tanto secreto hórrido encierra. Las cosas que van a pasar a partir de ese momento son terribles, y debo admitir que me sentí particularmente afectada con Jodie.El libro no me ha decepcionado en lo absoluto, si bien no logró quitarme el sueño, sí me dificultó su lectura por contener tantos momentos tenebrosos que me dejaban sin habla. Además, experimenté algunos sucesos \"extraños\" durante la lectura del mismo, pero eso lo voy a dejar para la videoreseña. Recomiendo ampliamente a cualquier amante del terror, a mi me ha dejado fascinada, y ni de cerca las películas se acercan al verdadero horror que transmite el libro."}, {"userName": "Robin Hill", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/47734324-robin-hill", "userReview": "5 stars.I don’t even know where to begin. I fear this may be a long, chaotic mess of thoughts, so please bear with me, or skim, or totally ignore. I’ve always been fascinated with the occult. The Exorcist (both the book and the movie, RIP Mr. Blatty) scared the hell out of me, pardon the pun. It still does. Every. Single. Time. And I love being scared. I love horror movies, haunted houses, Ouija boards (even though my husband forbids them), and Halloween. I love Halloween so much it’s my wedding anniversary. My freshman year of college, I was a moron. I had an English Lit class where I had to write a basic research paper on anything I wanted. I chose exorcism. Why? Moron.Fascination is one thing; belief is another. I didn’t actually believe all this stuff; I just liked reading about it. All my research during that semester long assignment pointed to one book, Hostage to the Devil: The Possession and Exorcism of Five Contemporary Americans by Malachi Martin. I was nineteen. This was before the internet and Amazon. I actually had to check books out of physical buildings called libraries. I had to find Hostage to the Devil…and I couldn’t. It had mysteriously vanished from every library within 100 miles of my college. My dad happened to find a copy in some little secondhand bookstore, and when he told the bookseller who it was for and why, the guy actually tried to convince him not to buy it. But I’m stubborn, and my dad knew, one way or another, I'd find it. He bought it anyway. At the risk of unintentionally reviewing Hostage too, I’ll just say…I kind of wish he would have listened. That book messed me up. I didn’t sleep for weeks. I was on edge. Things happened in my college apartment I couldn’t explain. I managed to turn in an incomplete paper, and my professor took pity on me. He gave me a “B” and told me to get some sleep.Why am I telling you this? I have absolutely no idea. I guess because it’s been on my mind lately, reading this book, and then yesterday with the death of William Peter Blatty and  this oddly timed report  on Father Martin. For at least a decade after that taxing English Lit class, I wouldn’t go near this stuff. But time has a way of minimizing even the most frightening memories, and looking back, I’m convinced I was just sleep deprived and hormonal. \nSo here we are. I read Amityville, finally. Not just any Amityville, but a used battered paperback that looks like it holds its own demons. Was it scary? Not particularly—at least not when compared to The Exorcist. Plus, to be able to read the faded print, I had the room lit up like noon in August. Was it good? Definitely. And for someone interested in the occult, it is, in fact, fascinating. If you look at the reviews, it seems the people who believe the Lutz's account rate it much higher than the people who don’t. I went into this thinking I'd be impartial; I’d just rate it as a work of fiction and leave it at that. Easier said than done, because the entire way through, I questioned everything. Did this stuff really happen? If they were lying, what was their motive? How do you explain the testimony of respected corroborating witnesses like Father Mancuso and the local police force? It was impossible for me to read this simply as a work of fiction, and to review it, I had to look at it from all angles. The writing, the storytelling. Fact vs. fiction. The phenomenon, the controversy, the legacy. As a whole, it's kind of brilliant.Should you read it? If you’re into this kind of stuff? Absolutely! I wanted to go big, thus the creepy looking paperback, but if you really want to be scared…read the e-book version. Alone at night. With the lights out. Oh, and sweet dreams."}, {"userName": "Nathaniel Brehmer", "userReviewDate": "Mar 20, 2009", "userURL": "http://www.goodreads.com/user/show/2135562-nathaniel-brehmer", "userReview": "Ignore the overshadowing debate about whether or not it actually happened, and you're left with one of the most finely crafted haunted house stories ever written. The narrative is so solid, so matter-of-fact, that one cannot argue with it. This is how it happened, the book says, and what happened was horrifying. The feel is perfect, the book carries an ominous feeling from the first to the last page, much like the house on Ocean Avenue itself. Forget any of the cash-in novels or films, this is a powerful, frightening masterpiece of horror. It takes a second place only to Jack Ketchum's \"The Girl Next Door\" as the scariest book I have ever read."}, {"userName": "Marvin", "userReviewDate": "Apr 11, 2009", "userURL": "http://www.goodreads.com/user/show/2160536-marvin", "userReview": "This is bad in so many ways. First, it is fiction masquerading as fact. The story of this hoax is out there enough so I don't have to repeat it but the evidence should convince all but the most ardent true believer that this \"true story\", with the exception of the original DeFeo murder, was totally fabricated. Second, it is really terrible fiction. I am convinced that Mr. Anson had some kind of encyclopedia on hauntings and as he flipped through it he said, \"Swarm of flies? I'll put that on page twenty-two. Cold spots? page eleven.\" It is so sloppily put together and badly written that I'm sure Mr. Anson realized it would be no more than a bottom shelf remainder unless there was some juicy \"real\" paranormal tie-in. Please don't waste your time with this. There are some perfectly good books out there on paranormal sightings and lots of great haunted house novels like Shirley Jackson's The Haunting of Hill House or Richard Matheson's Hell HousE that will thrill you. And just for the record, all of those Amityville movies suck too. Don't ask me why I bothered to watch them after hating the book so much. I guess I'm a masochist."}, {"userName": "Dick Baldwin", "userReviewDate": "Jul 21, 2008", "userURL": "http://www.goodreads.com/user/show/1313209-dick-baldwin", "userReview": "A family, who I shall call the Lootz family (for the sake of their privacy), moves into a house in Amityville, Long Island, where the terrible murders of the previous owners took place. Some twenty-eight days later the Lutz – er, Lootz, family flees in terror. Horrific things happened there. Blood dripped from walls; people floated about in mid air over their beds, there were flies everywhere. Worst of all, a marching band paraded through their living room at three a.m. All these horrors were orchestrated by a pig demon named Josie (name changed to protect the pig demon’s identity). In order to calm their nerves and find some closure, the family set down their true story with the help of a journalist friend. This book became a major bestseller and was turned into a popular movie starring Margot Kidder. Other Amityville Horror movies, albeit fictional, followed in a sort of Amityville feeding frenzy (do remember that the setting for “Jaws”, Amity, was based on Amityville), and the original was even remade with Melissa George playing Margot Kidder, er, Mrs. Lootz. There is probably tons of other tie-in merchandise spawned from the book that I’m not aware of. Amityville House Coffee Mugs (“Good to the very last drop … of blood”), for example. Or Jody the Pig Demon rocking chairs – oops, I mean Josie the Pig Demon rocking chairs. There must have been beach towels and beach balls, floating action figures, and T-shirts, too. I’m sure someone marketed Amityville Horror Fly Swatters and Li’l Ghoulie Marching Band toys. As a postscript: the family moved far, far away from Amityville to Arizona where, they said, the demons and ghosts followed and haunted them. Sad to say, though, the supernatural entities lost lots of their powers in the move. There was no book to bear witness to the burden these people bore, so subsequently no movies or merchandise. Josie couldn’t even get the cost of the new home returned. The poor Lootz family had to muddle through with just the licensing and residual fees off the back of the first book."}, {"userName": "Mindi", "userReviewDate": "Aug 26, 2012", "userURL": "http://www.goodreads.com/user/show/6157592-mindi", "userReview": "About 15 years ago I picked up a copy of this book and had to put it down indefinitely. It was slowly creeping me out, and when I got to the part where George Lutz sees a creepy pig behind his daughter in her bedroom window in the middle of the night I said \"nope\". However, I kept the book, because I knew one day I would finish it. Yesterday was that day, and I really wish I hadn't bothered.I was in my twenties the first time I tried to read this, and although I was reading a lot of horror, for some reason this one got to me. It takes place the year I was born, and was written in 1977. I'm going to say right now that I don't believe these things actually happened to the Lutz family. I'm super skeptical, I always have been, and anytime something paranormal says \"based on a true story\" I know that writers are just trying to sensationalize a story. People love those tag lines. The fact that something so heinous could actually happen to people in real life is something that readers eat up. I take it with a grain of salt. Should I address my problems with the writing first, or the story? Let's start with the writing.Anson has this incredibly annoying habit of ending every dramatic sentence with an exclamation point. I'm sure people have been talking about this one since the book was released, but it's really unnecessary, and it actually takes a statement that could be rather chilling with just a simple period at the end and it makes it sound ridiculous. It's like when people use all caps and it sounds like they're screaming. Every time Anson used an exclamation point, I imaged him wide eyed, and gasping at the horror of the event he had just described. It diffuses all the tension, and by the end of the book it's comical. Now, let's discuss the story. The Lutz family moves into 112 Ocean Avenue on December 18, 1975. On November 13, 1974, 23-year-old Ronald DeFeo shot and killed his parents and 4 siblings as they slept in the house at 112 Ocean Avenue. The Lutzes know the house is the site of multiple murders, but they aren't superstitious, so they dismiss any worries over living in a house where violent murders occurred, and actually end up buying a number of pieces of furniture and appliances that were left behind after there was nobody alive to claim them. Which to me is gross and morbid, but whatever.Practically from the moment they step into the house things get weird. I started reading this again at night, and the strange occurrences were actually still kinda creepy 15 years later. Things start small, so I can understand the Lutzes not feeling the need to flee in terror right away. George is constantly freezing, and spends hours feeding logs into the living room fireplace. He also wakes up every night at 3:15 on the dot and has a compulsion to check the boat house behind the home. Kathleen smells perfume in odd places, especially in the kitchen, where she begins to feel a \"presence\". Both parents are also quick to lose their tempers, and feel that their 3 children are acting out more. They were never easily angered before moving into the house. At this point, I'm invested. Things are quietly creepy, and when one night George goes out to the boat house and turns around to see his 5-year-old daughter standing in the window with a pig behind her, the creepy goes up a notch. Sadly, and I'm sure there wouldn't be a book if this never happened, the crazy things that are happening in the house begin to escalate beyond what anyone would actually stay and allow to happen, and yet the Lutz family does stay, and bad things continue to befall them. A local priest even tells them to leave the house, and they don't listen to him. It's infuriating. Both George and Kathleen know that something is horribly wrong in their house, but they continue to try to ignore it, and put their own lives and the lives of their children in danger. The front door is inexplicably torn off the hinges. Both Lutzes see eyes in a window and run outside to find hoof prints in the snow. And a creepy secret room painted completely in red suddenly reeks of human feces. And these are just a few of the things that continue to happen. At one point George wakes up to find Kathleen levitating off the bed. And still they stay. For 28 days.If the things that George and Kathleen Lutz claim happened to them at 112 Ocean Avenue really did happen, then I can't imagine any sane person who would stay in that house for 28 days. I get that the family was strapped for cash. I understand that George was having issues with his business and the IRS, but come on. If you believe that an entity or a demon is tormenting you in your home, and they did, because they repeatedly tried to get help from a priest, I have trouble believing that anyone would stay in that environment. Like I said though, I'm a skeptic, and I always look for the holes in a story like this. I said I was disappointed that I bothered to finish this one, but maybe it's a good thing that I did. It's a good concept, I just don't believe that it actually happened the way the Lutzes claim it did. And I'm no longer creeped out by Jodie the pig. So bad writing and ridiculous circumstances aside, I'm glad I was finally able to put this story to rest."}, {"userName": "Chris ", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/1956959-chris", "userReview": "This book is actually for a group challenge in April, but since I've sworn off re-reads for 2012, I decided to knock it out early.I first read this back when the movie came out. The first movie. So I was pretty young, maybe 11 or 12. I remember liking it pretty well. Unfortunately, on this re-read I suspected the author might also have been 11 or 12 when he wrote it. The story is excellent and very creepy. Whether a true story or a hoax, it's very compelling. The flaw in the story telling almost cost me an otherwise enjoyable read.The narrative is choppy and schizophrenic. Not for effect, but from what seems to be a lack of skill. The tense changes constantly and without warning, as does the point of view. I can see why the author shifted tenses and POV's as he did, but it could have been done more smoothly. It's rather jarring as it is. The dialogue is even worse - people don't talk like they do in this book. Maybe in an episode of Scooby Doo, but not in real life.Those points aside, I still rate this at 3-stars. The story itself is awesome and had to be told. I can only imagine what this story would have been like if written by a true master of the genre, say a Stephen King.ETA: I had to rethink this. I felt wrong giving something this poorly written a rating of 3-stars when I've been so harsh on several other books. I've given 1 and 2 star ratings to books that were much better written than this thing. So I'm dropping it to 2. The writing should be at a 1-star, but I'll stand by liking the story well enough to say \"it's ok\" on the final rating."}, {"userName": "Meli", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/5087694-meli", "userReview": "La verdad que muy bueno.Tiene escenas tremendas, en las que sentís que te vas a volver loco. Te mata de la ansiedad y de los nervios.Yo soy una escéptica por naturaleza, pero aún así logró impresionarme, alterarme y me hizo pensar en que yo simplemente perdería la cabeza ante un fenómeno así. Horrible.Edito: leyendo los reviews, ¿soy la única que cree que si no dejaron la casa al instante no fue por empecinamiento o estupidez, sino porque 'algo' a nivel inconsciente no se los permitía? Especialmente si consideramos que desde el momento en que se mudaron les empezó a costar salir hasta a hacer las compras y a trabajar.Edito 2: dormí 3 horas y mal por culpa de este libro. No de miedo, pero yo sufro ansiedad y sus últimas escenas me provocaron TANTA que por suerte pasé una noche de mierda, taquicardia y falta de aire incluidos. No lo puedo creer, se los juro. Pero si tenían alguna duda de que es un libro intenso, ahí tienen. Ahora a ser un manojo inútil de nervios el resto del día, ¡yay!"}, {"userName": "✰☽♥✰  Unsolved Mystery ✰♥☾✰ ", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/3303677-unsolved-mystery", "userReview": "Ahh, I'll stick with the movie. It's better and scarier. =)(The original! Not that dreadful remake.)"}, {"userName": "Martin Rondina", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/31969796-martin-rondina", "userReview": "En Aquí vive el horror apenas pasemos las primeras paginas, nos encontraremos con la aclaración de que la siguiente historia que vamos a leer es una historia que sucedió realmente y que la información de los hechos fue recolectada de los mismos protagonistas que han padecido el terror que sucedió en la casa de Amityville. Nos aclara que la familia DeFeo y la familia Lutz existen y que ellos mismos han narrado estos hechos para que luego sean publicados en este libro que tenemos aquí.En esta historia nos encontraremos con la familia Lutz, compuesta por un matrimonio y tres hijos. Ellos deciden comprar una casa y consiguen un inmueble en la 112 Ocean Avenue en Amityville por un precio muy bajo, en realidad el mas económico de todas las viviendas ofrecidas. Los Lutz quedaron fascinados por las enormes dimensiones y comodidades que ofrecía su nuevo hogar, así que sin dudarlo George Lutz compró la casa. Aqui es donde encontramos la bisagra de la historia, esta casa poseía un pasado terrorífico, sus dueños anteriores, la familia De Feo habría sufrido terribles tormenos en su estancia en la misma, desencadenándose en un sangriento asesinato donde Ronald De Feo mató a todos los miembros de su familia con su escopeta.La familia Lutz no parece sentirse intimidada por este pasado tormentoso encerrado dentro del hogar, totalmente escépticos al tema deciden continuar con su mudanza. Pero una ves establecidos allí, comenzaran a suceder cosas espantosas que perturbaran sus sueños y su actividad diaria hasta limites inimaginables. Desde apariciones fantasmagóricas, figuras detrás de las ventanas hasta golpes, ruidos por las noches y levitaciones.En mi opinión es un libro que te hace pegar unos buenos sustos, sobretodo si nos ponemos a pensar que esto puede haber sido real (depende de la creencia de cada uno). Es uno de los únicos libros que me han asustado realmente, se ha colocado en mi top de libros del género. Recomiendo si tenés la oportunidad de conseguirlo que lo leas, es algo distinto y muy atrapante. La progresión del libro es por dia, es decir a modo de crónica donde los hechos cada vez que vamos avanzando en el tiempo van siendo uno mas aterrador que el anterior"}, {"userName": "Obsidian", "userReviewDate": "Sep 18, 2016", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "[ Now onto why I only gave this book 3.5 stars. After I completed this I of course found out that it is more than likely (99 percent true) that the Lutzes in league with a defense attorney of Ronald DeFeo Jr. fabricated this whole story in order to make money. The Lutzes were in trouble with the iRS, they had spent too much on the home. At one point a brother in law comes over and his money is misplaced and the Lutzes heavily imply the spirits must have done it (yeah my bet is they stole it). The Lutzes went and sued a host of people (just Google) and the trial showed that the book was fiction. (hide spoiler)]"}, {"userName": "Melissa Chung", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/17703155-melissa-chung", "userReview": "Well....I can finally say I've read Amityville Horror. 4 stars because it was entertaining and it is supposedly a true story. I took a star off because it wasn't scary.If you are unfamiliar with the Amityville Horror, this story is about the Lutz family. On December 18, 1975, George and Kathy Lutz moved into a very large colonial house at 112 Ocean Ave. Long Island. They lived there for 28 days before they fled.Backstory, this is said to be a true story. As in, these people are real. They actually lived at Amityville house. What could be a fabrication, is their account of the 28 days they lived in their new home.George and Kathy, along with their 3 children Chris, Danny and Missy were very excited about this new and very spacious house. They knew, prior to purchasing the home, that the Dafoe family was murdered in the house. They even went as far as purchasing the dead families furniture.  ---Let's take a moment to consider this sentence. George and Kathy knew a family was murdered in the house a year before. That the family was killed in the very bedrooms they planned on sleeping in. They even went as far as buying the very beds the children died in. I don't understand. That right there is asking for paranormal backlash.Okay, so for 28 days the family experienced horrifying unexplained phenomena and continued to stay there against the advice of the mother in law, a priest, a friends girl-friend, even the realtor was iffy selling the house. After the first incident I would have fled....maybe ;)What I found interesting is that George never once became violent. He was obsessed with warming the house up. He was obsessed with checking the boat house. But he never wanted to kill his family like it's shown in the movie. I have only seen the most recent movie from 2005. Why do directors create violence when there isn't any? In the book George is a very loving man. Concerned about his family and their well being. At times he is in a trance like state, but isn't homicidal. That always irritates me, when movies change the tone or personality of a main character.Bottom line, this was a fun and entertaining book. More so, if everything is 100% true. Maybe even if it's only 50% true. Is it scary? NO. In my biased opinion, nothing is scarier than The Shining. I stand by that answer for a long time to come. Find me a scary book! To those that read this review. Help me search for a really horrifying read :D"}, {"userName": "Rebecca McNutt", "userReviewDate": "Dec 17, 2014", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "This book was definitely horrific, though kind of cheesy at some parts. What I enjoyed much more than the horror itself was the vibrant imagery, and the way that this Kodak moment family's subtle trip towards insanity is described. Definitely worth reading if you're a fan of all the nostalgia of 2oth century horror such as Audrey Rose, Magic or The Shining."}, {"userName": "Sarah Sammis", "userReviewDate": "Aug 29, 2008", "userURL": "http://www.goodreads.com/user/show/122647-sarah-sammis", "userReview": "The 1970s seems to have been the decade for the horror genre, especially ones focusing on demonic possessions. Mix horror genre with true crime and you'll end up in a gray area that includes The Amityville Horror by Jay Anson. The book reads like a novel and the Wikipedia entry calls it a novel but the Library of Congress categorizes it as non-fiction, specifically demonology (case-studies) and parapsychology (New York) and it's call number is BF1517.U6 A57.So what are facts? In December 1975 the Lutz family moved into a 1924 farm house in Amityville that had been the scene of a grisly murder. In January of 1976 they moved out the house citing demonic activity as the reason for their short stay. Over the course of the book Jay Anson lists out a number of clues that point at paranormal and perhaps even demonic activity. Except for the white hooded figure at the end which may very well have been invented to prove a point the rest of the book's events seem pretty common place.The house still exists, by the way, though the front facade has been changed as has the address. It even has it's own wiki entry.Like the Lutz's, my family and I are living in a fixer upper. We've had our own series of strange events in our home but we've managed to stay nearly five years. Since my home shares a lot of things in common, I thought I'd make a check list to see if my house is haunted.Signs your house might be haunted: 1. Fly infestation even in winter? yes 2. Strange cold spots? yes 3. Strange sounds at night? yes 4. Waking up at the same time each night? yes 5. A pet who likes to sleep all day? yes 6. A crucifix turning itself upside down? no 7. Strange hidey holes under the stairs? yes 8. The smell of excrement? (you bet... we have a diaper pail)  9. Misbehaving toilets? yes 10. A broken banister? yes 11. Random and bizarre damage to doors and windows? yes 12. Other things randomly breaking? yes 13. Other strange smells? yesTwelve out of thirteen signs, I guess my house is haunted. Or it could just be old and not well maintained. How about your house? How does it hold up against the Amityville test?"}, {"userName": "Brandon Burrup", "userReviewDate": "Sep 21, 2012", "userURL": "http://www.goodreads.com/user/show/311768-brandon-burrup", "userReview": "I read this a couple years ago during the summer. It only took a day or two. It wasn't so much scary as morbidly fascinating as I read it. However, after reading it, I simply could not get certain images out of my head. A white entity coming down the stairs, red eyes staring at me through a window in the dark, etc. I am forever scarred by that second image. I simply can not deal with open blinds at night. The other image... well, that summer was a hot one and my room downstairs doesn't get hit with cool air from our AC, so I tended to come up into our living room and sleep on the couch right under the AC fan. The problem was there is a staircase right in that room and for months when I would come up to sleep there I would close my eyes and be too terrified to open them for fear of seeing some white demon ghost thing coming to get me. So I'd lay there with my eyes closed too afraid to open them, yet too afraid to fall asleep. What misery. The scary thing about the book is how things happen so slowly and gradually that as a reader you are caught in the same delusion as the family living in the house. Thinking that things will go away or that they aren't bad enough to worry about, until all of a sudden you're smack dab in the middle of the scariest crap you've ever read/experienced, with children levitating in their beds and evil pigs named Jodie coming to get you. Needless to say, I will not be naming any of my children Jodie and they will not be allowed to have any imaginary friends.Heh funny note: seems like the only people giving this book poor reviews are either the horror enthusiasts who are too cool and unimpressed to admit they actually like ANYTHING, or people with a stick up their butts because they don't agree with this being presented as a true story."}, {"userName": "Bonnie", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "The Amityville Horror is said to be a work of non-fiction as it is the story of the Lutz family and the 28 days they spent in what was supposed to be their dream home. The house on 112 Ocean Avenue in Amityville, New York already had a bad name when the DeFeo family was murdered there by the oldest son, Ronald “Butch” DeFeo, Jr. in 1974. In his defense he claimed to have heard voices telling him to kill his family but he was instead diagnosed with antisocial personality disorder and sentenced to six consecutive life sentences. He remains in prison to this day. There was never anything mentioned about paranormal activity, just a horrifying mass murder. Whether the act of the murders is what caused the issues the Lutz’s experienced is entirely up for debate. When the Lutz’s moved into the house on Ocean Avenue in late 1975, their troubles began immediately. George Lutz constantly suffered from a chill and spent the majority of his time feeding the fire. Kathleen Lutz felt a presence in the kitchen which laid an innocuous hand on her shoulder only to feel that presence again later which squeezed the air out of her so much that she passed out. The two state that their emotions would often get the best of them for no apparent reason which led them both beating their children which had never happened before. But that was only the first few days of their stay.This is the second read for my scary book month of 2015 and I’m beginning to think the fear part of my brain is broken. Or maybe this just wasn’t that scary? Either way, this is always on the list of classic horror novels and has always been one I’ve wanted to read. But the strange occurrences that happened in the house would have been more terrifying to have actually lived it, to have felt the wrongness of the house, and that’s simply something that couldn’t have been conveyed through the page. The odd things that were actually visible (the strange, tiny red room or the weird ghosty pig) weren’t actually terrifying. Even the green goop that ran down the walls failed to horrify but what did horrify me was when George actually stuck his finger in it and proceeded to taste it. Because that’s what normal people do. Taste random shit running down their walls. For fucks sake.I did make the mistake of reading this in bed, in the middle of the night, only stopping at a part where a character woke in the middle of the night to find some ghosty child touching her foot trying to wake her up. Suffice it to say I felt little fingers touching my feet all night. Other than freaking myself out by being a dumb dumb and reading it at night, I didn’t find this terrifying. It would have helped, maybe, if Anson had eased up on his use of the exclamation points whenever something ominous happened in order to be taken more seriously. While I’m not completely sold on whether or not this is indeed factual, it was still an entertaining story that makes you wonder about the history of your home and what could have possibly taken place within its walls.Next up, I’ll be watching the classic movie. I just did this with Psycho (the Hitchcock version not the one with Aragorn) and enjoyed the hell out of it. I may even have to watch the newer Amityville as well because 1. the trailer actually does look pretty damn terrifying and 2. other, various reasons. *shrugs*"}, {"userName": "Michael", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/13181751-michael", "userReview": "I have never seen so much disdain and anger directed towards a BOOK as I do in some of these reviews for The Amityville Horror. If you in no way, shape or form believe in this event or the supernatural, why did you read this book? And I love how people that have never set foot in the house claim to KNOW it's all made up. I mean, knowing things you've never seen would mean that you have the very supernatural type powers you so vehemently claim aren't real. I'm not saying all the things in this book happened. I'm saying the only people that KNOW is the Lutz family. But as far as the book is concerned, the actual story I read? Well, I'll say this, whether it's all true, partially true or none of it's true.....it was a fun ghost story to read. Having grown up in the 70's I remember when this story was at it's peak. And all the hoopla surrounding it. So it's kinda a walk down memory lane. My only advice is, if you don't have a taste for the supernatural. Or at the least an open mind. UFOs..... Bigfoot.... Ghosts.... Possessions..... Lycanthropy...... Vampirism..... basically anything of this nature......maybe those are books you should avoid. And if you don't like a book, just say it wasn't your cup o' tea or you just don't believe it to be true. There is no reason to try to destroy it for others with a lecture in your review. Or to talk about others like they're idiots for feeling compelled to believe the story. All the hateful reviews are uncalled for. This was a very enjoyable ghost story, true or not."}, {"userName": "Oscar", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/1754850-oscar", "userReview": "En diciembre de 1975, el matrimonio Lutz y sus tres hijos se mudaron al 112 de Ocean Avenue, en Amityville, casa en la que hacia pocos meses se había cometido un atroz crimen: Ronald De Feo asesinó una noche a los seis miembros de su familia con un rifle. Pero esto a los Lutz no les importó en absoluto, ya que no eran supersticiosos. Permanecieron exactamente veintiocho días en su nueva casa. Desde el primer día empezaron a sucederles cosas inexplicables y cada vez más terroríficas, hasta que, viendo que su vida peligraba, tuvieron que huir con lo puesto.‘Aquí vive el horror: La casa maldita de Amityville’ (The Amityville Horror, 1977), de Jay Anson, expone los hechos tal y como sucedieron, sin exageraciones. La trama está narrada desde el punto de vista de los diferentes protagonistas, y el ritmo y la tensión van aumentando en intensidad hasta su final. El crimen de los De Feo es verídico, y está claro que algo les sucedió a los Lutz, aunque en principio pueda creerse que se lo inventaron todo para hacer dinero. En cuanto a la escritura de Jay Anson, es correcta sin más. Pero dejando todo esto aparte, hay momentos en que se pasa verdadero miedo leyendo este libro, sobre todo si se lee de noche."}, {"userName": "Paulo Ratz", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/31615821-paulo-ratz", "userReview": "Eta historinha tensa que me deixou com medo hein? Eu moro sozinho, gente. Eu já tinha assistido o filme e já sabia por alto como que era, confesso que muitas coisas eu não lembrava, mas a experiência de LER é mais assustadora. Além disso, quando falam que a história realmente aconteceu me deixa um pouco mais desesperado...Apesar de todo o desespero, eu tive uma dificuldade com a escrita. Acho que o Jay rebuscava muioto numas partes e depois escrevia de uma forma tão coloquial que me incomodava. Por exemplo, em várias frases aleatórias ele usava ponto de exclamação. Eu faço isso de exagerar na exclamação quando estou escrevendo um post no Facebook, sabe? Não num livro. Enfim, estranho.Eu recomendo a leitura porque é entretenimento puro, mas ainda tô na dúvida se a história que aconteceu na casa foi exatamente isso.. me soou um pouco sensacionalista. VEREMOS!"}, {"userName": "Srta Books", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/51590522-srta-books", "userReview": "No estuvo mal, me gustó leer lo que ocurrió en esa casa y conocer un poco más a fondo los detalles. 3.5/5"}, {"userName": "Clare ", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/24034373-clare", "userReview": "Listened to in audio format.The Amityville Horror is a true story about the Lutz family. In November 1975 a man called Ronald DeFeo shot and killed his Mum, Dad and Siblings at their home in Amityville, Long Island. A year later George and Kathy Lutz brought the property at a bargain price. George, Kathy and their 3 children lived in the house for 28 days before leaving the house claiming it was haunted.There has been a lot of debate about the Amityville Horror over the years. I believe in ghosts and the paranormal in general, but I don't think you should believe every story at face value. There are certain aspects of this book I believe, such as the attacks on Father Mancuso, and the red welts found on Kathy's chest but I think some events were certainly embellished for this book.I don't believe a talking pig called Jodie with red eyes, visited Missy the Lutz's young daughter. I also don't believe a trail of green slime went up the stairs when the Lutz's ran away to Kathy's mothers house.Whether you believe the story to be true or false it is certainly spine chilling."}, {"userName": "Shandra", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/23160533-shandra", "userReview": "Initial thoughts: The creepy factor here was decent. Review to come. Review:Actual rating: 3 I-Wanted-To-Be-Terrified stars. No spoilers. \nMeh. The creepiness was here. It had potential to be scary. But the execution failed to make it so to me. I've seen the movie, the original. It's one of my favorite horror movies. I love it. It scares me. Every. Single. Time. I know what's going to happen. Hell, I can probably quote at least half the movie. And it still scares me. I thought the book would too. I know what happens, but it should still have been scary. The writing was blah. The basis of the story is perfect. Is it true? I don't know and I don't even care. It doesn't matter if it's based on a true story or not, the premise is freaky. I wish the writing would've been better."}, {"userName": "Jason P", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/7208243-jason-p", "userReview": "This book was hands down AMAZING!!The Amityville Horror is not something annnnnyone would ever want to go through. EVER!For those believers out there you will definitely agree, if you go into a house and 'things' start to occur, strange things - GET OUT!I think Eddie Murphy said it best in his stand-up film Delirious:\"In the Amityville horror the ghost told them to get out of the house. White people stayed in there. Now that's a hint and a half for your ass. A ghost say get the fuck out, I would just tip the fuck out the door! Lou Walker looked in the toilet bowl, the're was blood in the toilet and said, \"That's peculiar.\"I would 've been in the house saying:\"Oh baby this is beautiful.We got a chandelier hanging up here, kids outside playing. Its a beautiful neighbourhood. We ain't got nuttin to worry, I really love it this is really nice.\"\"GET OUT !\"\"Too bad we can't stay, baby !\"-> I think that pretty much sums up what should be done regarding 112 Ocean Avenue, The Amityville house.My two cents anyway."}, {"userName": "Mike", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/3673987-mike", "userReview": "Long-ago read. Never really came away convinced that it was \"A True Story\"."}], "description": "On December 18, 1975, a young family of five moved into their new home, complete with finished basement, swimming pool, and boathouse. Twenty-eight days later, they fled in terror, leaving most of their belongings behind. — The fantastic story of their experiences was widely publicized on network television, newspapers, and national magazines. But the Lutz family never disclosed the full details to the media. Now, their own carefully-reconstructed memories -- and independent interviews with local clergy and police -- reveal their entire harrowing story.George and Kathleen Lutz were aware that the house had been the scene of a mass murder -- Ronnie DeFeo, 23, was convicted of shooting his parents, brothers, and sisters. But it seemed an ideal home for them and their three children, and the price was right. On the day they moved in, a priest invited to bless the house was told by an unseen voice to \"Get out!\" At his rectory, he began to suffer a series of inexplicable afflictions. Meanwhile, alone in their new home, the Lutz family were embarking on the most terrifying experience of their lives. It began when their five-year-old daughter boasted of her new playmate, someone -- or something -- named \"Jodie.\"THE AMITYVILLE HORROR is an unforgettable book with all the shocks and gripping suspense of THE EXORCIST, THE OMEN, or ROSEMARY'S BABY -- but with one vital difference! As the author reports, \"To the extent that I can verify them, all the events in this book are true.\"", "title": "The Amityville Horror", "url": "http://www.goodreads.com/book/show/293101.The_Amityville_Horror", "average": 3.83, "cover": "https://images.gr-assets.com/books/1306079371l/293101.jpg", "reviews": 1759, "authors": [{"url": "https://www.goodreads.com/author/show/106463.Jay_Anson", "name": "Jay Anson"}], "type": ["Horror", "Fiction", "Fantasy", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/293101.The_Amityville_Horror", "http://www.goodreads.com/book/show/182540.The_Amityville_Horror", "http://www.goodreads.com/book/show/23517522-the-amityville-horror", "http://www.goodreads.com/book/show/325534.The_Amityville_Horror", "http://www.goodreads.com/book/show/493458.The_Amityville_Horror", "http://www.goodreads.com/book/show/13518188-aqu-vive-el-horror", "http://www.goodreads.com/book/show/32029539-amityville", "http://www.goodreads.com/book/show/23475796-the-amityville-horror", "http://www.goodreads.com/book/show/555853.666", "http://www.goodreads.com/book/show/38729924-djevelens-bel-nning"]}