{"ratings": 148268, "userreviews": [{"userName": "Kristen", "userReviewDate": "Jul 05, 2011", "userURL": "http://www.goodreads.com/user/show/1856764-kristen", "userReview": "Why so many ugly one star reviews? All about as insightful as the ubiquitous one star reviews of Lolita which call Nabokov the man a child molester, raving morons who can't distinguish a character from an author and go beyond simply missing the point. And how ironic that all these reviews seem to be from women raging that this book (which they all obviously read for their 'gender theory' class) features a character who abandons her children. Ugh, women who criticize this as a feminist novel because the main character isn't a good mom and then base their ratings solely on how much they like the main character. Do these people only give high ratings to books with characters they like? Do they think women characters in fictional books shouldn't have flaws, ennui, and basically everything that makes a character good? They want the character to be human but lack any flaws, they want her to be a feminist hero but denounce her for not putting her children before herself. Is it that they would have accepted it in a male character but not from a 'wife and mother' because when I read these reviews that is what it looks like to me. Why is she in all those one star reviews held up and judged as a woman and not a human being? Is that not the essence of feminism? If so these dumb broads are the ones who are anti-woman, not Chopin, who wrote this in 1899 for fuck sake! The whole point of the book is about her discovering herself as an individual, and that even as an individual we exist in a society and as humans have to balance being an individual with the fact we are social animals. Her failure isn't that she abandoned the children but that she abandons herself. If this has a failure as a feminist novel it is the formulaic ending where she is punished for her desires. I'd like to see a story when the woman runs away and is not punished by death, as is the always the ending, now that would be progress! Not that it's a great book, my few friends who rated it gave in mostly 3 stars, and that's about right, I'm adding an extra star out of spite. Also, this is my first book read on my new kindle, so that was pretty exciting!"}, {"userName": "Samadrita", "userReviewDate": "Jan 23, 2013", "userURL": "http://www.goodreads.com/user/show/13266158-samadrita", "userReview": "[Her suicide is but a loud 'fuck you' to the patriarchal system. And I can only salute her for her act of defiance. (hide spoiler)]"}, {"userName": "Elizabeth", "userReviewDate": "Jun 11, 2007", "userURL": "http://www.goodreads.com/user/show/124957-elizabeth", "userReview": "(**SPOILERS in the comments**)One of the earliest sleep-with-whoever-you-want feminist rhetoric books. I think much of what feminists fought for and accomplished was vital for protecting women. Women have never lived with such freedom. I stand behind many of the advances. This book, however, as part of the general 60’s feminist philosophy(not the major thinking of the early feminists), I believe has had a destructive effect. Instead of promoting a philosophy that men should be more honest about the power of physical relationships - which would have helped to correct many of the true problems (and thus would have been truly progressive) they encourged women to be just as selfish. This type of thought has pulled us backwards. Their courage faltered when they didn’t set the standard that was really needed. The havoc wreaked on the souls of human beings, both those involved in sexuality that professes one thing physically but another spiritually – selfish sexuality - and the children who live in the chaos of these relationships (or non-relationships) is a step back in the progression of the individual who should be moving towards actual love and away from selfishness."}, {"userName": "Brother Odd", "userReviewDate": "May 01, 2008", "userURL": "http://www.goodreads.com/user/show/1131451-brother-odd", "userReview": "I'd like to give this book ZERO stars, but it's not an option. This is hands down the worst book that I've ever read. I will never say that again in a review, because this one wins that prize.BIG SPOILER AHEAD - Be warned.I had to read this thing twice in college, and it is a horrible story. We are supposed to feel sympathy for a selfish woman with no redeemable qualities. Just because her marriage is bad it does not give her the right to be a lousy, despicable person. Get a divorce? Yes. Find new love? Yes. Abandon your children, be completely self-absorbed, commit adultery, and drown yourself? No, no, no, and no. This is my problem with the book. Drowning oneself and leaving one's children without the guidance of their mother is a tragedy. The book would have you believe it is a triumph. This is the irredeemable flaw in the book.It is also physically impossible to die the way she did. You cannot float to the bottom of the ocean. Your body will force you to swim and fight. It is a scientific fact that you cannot drown yourself without a struggle. She would have struggled in the end. Yes you can swim out so far that you can't make it back in and would drown in the process. But no, you can't just sink to the bottom. It would be a horrible, gagging, gasping, throwing up salt water, kicking your arms and legs fight.The writing itself is nothing special. It's not bad. Chopin is not a bad writer on a technical level, but she is no expert either.I hate to be the one raining on the parade, but this is the most overrated book I have ever come across."}, {"userName": "Meredith Holley", "userReviewDate": "Mar 08, 2009", "userURL": "http://www.goodreads.com/user/show/1302775-meredith-holley", "userReview": "[And it is poignant that, clearly, the only end for a bird escaped from the cage is death. A woman defying tradition and prejudice, as Mademoiselle Riesz says, is unwelcome and must have particularly strong wings to fly away. But, all of these stories that imagine something beyond tradition have Thelma and Louise endings. Women who wake up and realize that they are unwelcome in society as they are, who realize they can’t pretend to be what society wants anymore, can only conceive of suicide as the alternative. And, in The Awakening, at least, Edna’s death is not cautionary or punishment. It is just the only conceivable alternative in a society that offers nothing for women but marriage. Interestingly, Eat Pray Love is the only story I can think of on this topic that doesn’t end in the woman’s death, so that is perversely hopeful. (hide spoiler)]"}, {"userName": "James", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Book Review\n\n4 of 5 stars to The Awakening by Kate Chopin. I read this book several years ago and wrote a paper on how society treated women during that period in literature. I cut and paste some from it below, as I think it offers more than a normal review on this one. Please keep in mind, I'm referring to women in the 19th century, i.e. the characters from the book -- not thoughts on women today! As for the book -- it's fantastic... love seeing what people thought 150 years ago, seeing some things never change and some people are just always wrong! And for the record, I loved Edna... thought she had a right to, and should have, pushed the envelope more. Question: Edna Pontellier: Does Innocence Prevail?\tSociety expects women to remain pure and chaste, to ignore the urge to engage in any type of behavior that could be construed as flirtatious, and to follow the demands of their fathers until marriage. However, women see these limitations as too restrictive, which is why they live their lives in a way that suits them and not others. Women often take control of their own lives by participating in flirtatious behaviors, ignoring parental wishes, and engaging in pre-marital sex. When women are married and still wish to live their own lives, they may have extra-marital affairs, they may leave their husbands or lovers, and they may commit suicide. These behaviors are ways of striking out against the unfair limitations placed on them. Often the “desire to be socially functional and acceptable can lead to hostility to those who appear to be unconventional or independent” (Allen 336). As a result of this hostility and striking out, whether or not women are truly innocent has pervaded the minds of American society.Since the innocence of women has always been a subject that captivates society’s mind, writers will often take advantage of this and create works that are about women’s innocence. The realistic period of literature, from the end of the Civil War to World War I- 1865-1915, contains many works that are representative of women and their level of innocence. In works such as Kate Chopin’s The Awakening (1899), there are female characters whose innocence comes into question. Edna Pontellier lives her life in such an ambiguously flirtatious way that the people from the society in which they live, all question the women’s innocence and morality. Edna is somewhat guilty, although she has an excuse. Edna is just entering her womanhood for the first time at a time when views were quite different than today. She may lose her innocence with several men, but she never knew what innocence was prior to her sexual awakening. Regardless of Edna’s actions, she is still innocent even though her flirtatious behavior implies that she isn’t. After she faces society’s wrath, she turns inwardly to find support instead of turning to the people around her. After thinking about her future, Edna meanders down the path of self-destruction and commits suicide, as a way to get out of the misery that she is in. When her innocence appears to be lost, she chooses to take her own life, rather than fight to show society that she has done nothing wrong. However, she never really loses her innocence permanently, as it was only hidden under her awakening to womanhood.In The Awakening, by Kate Chopin, Edna Pontellier, a young, married woman is also removed from her usual American home to that of the French Creole society in New Orleans, Louisiana. Even though the story still takes place in America, the French Creole society is more European than American. It expects the people that live there to follow European beliefs about women, innocence, and sexuality. Edna has been married to Leonce Pontellier for several years and they have two sons also. They spend their summer vacations on an island off the coast of Louisiana during the summers, not that far from the mainland where they usually live. Edna grew up with a father who expected her to follow his rules as perfectly as possible. He was a “hypocritical, gambling, toddy-drinking, pious-talking Presbyterian [from Kentucky]” (Skaggs 98). His interpretation of religion was to be irreconcilable during the week, and then atone for it on Sundays at worship. Edna thus became two separate souls within her own body. She wanted to be pious and good which explains why she remained married to Leonce in a loveless marriage for nearly ten years. However, she also had a passionate, wild side to her which suddenly erupted after she met Robert Lebrun on the Grand Isle. According to James H. Justus, the imbalance which haunts Edna is within the self, and the dilemma is resolved in terms of her psychic compulsions. Caught between conflicting urgencies-her need to succumb to her sensuality is countered by an equal need for a freedom that is almost anarchic” (Justus 73).Edna Pontellier is bored with her husband, her life of motherhood and housekeeping upon her return to the mainland. She also wants to be free to do whatever she chooses instead of being chained to her husband. She enjoys the attention that she gets from Robert and finds the young man quite attractive. Once started, “Edna makes no attempt to suppress her sexual desire, she does not hesitate to throw off her traditional duties towards her family. She realizes she is unable to live as the inessential adjunct to man, as the object over which man rules” (Seyersted 62). As a result, “Edna Pontellier has her first affair out of sexual hunger, without romantic furbelow. She is in love, but the young man she loves has left New Orleans” (Kauffmann, 59). Edna Pontellier is an adulterer, but one can forgive her because she was thrown into a marriage that she was not ready for after living by her father’s rule for so many years. Edna never had a chance to grow up as a woman. As a result, she is forced to suppress her sexuality, and it comes out full force during her summer vacation with the Lebruns.Nevertheless, Edna and Robert’s affair has a positive influence on Edna’s life. Carley Rees Bogarad believes that “Edna’s desire for the first time in her life is directed at someone who returns it and who has been fulfilling her emotional needs. She finally has evidence from the way Robert has been treating her and from her own emerging sense of self that she might choose to live in a more meaningful, constructive and active way. She does not lose her sense of responsibility; she redefines it” (160). However, Edna loses Robert when he leaves the country, and she is forced to return home with her husband and two children where her life becomes monotonous and dull without Robert. Later, She meets Alcee Arobin, who reminds her of Robert in some ways. Edna and Arobin also begin an affair with each other. This time, “Edna enjoys the company because [Arobin] is a charming man, attentive, amusing, a person of the world. He is a sexual partner who does not ask for, expect, or give love. Consequently, Edna need not feel that she is compromising him because she loves another. What she slowly discovers is that there is no way to separate what the body does from what the mind or heart is feeling without creating a violation of self (Bogarad 160). Edna definitely seems as though she has no morals by this time. She couldn’t care any less about her family; all Edna wants to do is explore her new found sexual awakening. She is viewed negatively for this among society; Yet, in reality, “the men in her life split her-Robert sees her as the angel, and Alcee sees her as the whore” (Bogarad 160).Edna Pontellier is a victim of fate, and cannot be faulted for that. She can’t help but be awakened sexually, which leads to her numerous affairs with Robert and Alcee. After moving out of the house and living on her own, in the way that she wants to, Edna slowly dwindles down to nothing. She loses her husband, Robert, and Alcee. Robert briefly returns and it seems as though he and Edna will reunite, but they don’t. Instead, Edna’s awakened feelings and lifeline diminish her. Spangler remarks that “in the final pages, Edna is different . . . she is no longer purposeful, merely willful: no longer liberated, merely perverse: no longer justified, merely spiteful” (Spangler 155). In the end, Edna is left barren and desolate. She wanders out to the sea, strips off her clothes, and jumps in to her death. According to Spangler, “Chopin surrounds Edna’s death with contradictory symbols of defeat and rebirth. This makes it difficult to assess the meaning of Edna’s final act and accounts for the various readings proposed. There is also the further complication that it is not clear whether Edna’s death is consciously chosen suicide or whether it, like much else in Edna’s life, is simply drifted into” (156). Edna’s tragic end leaves readers wondering what her purpose was. Edna could represent women who are “‘perversely attracted to forbidden fruit’ [and for women that] want to possess [which] forms only destructive relationships rather than those that [are] true and lasting’ (Roscher 292). All that the readers can infer is that “her actions and final suicide suggest that she is a woman whose will and determination force her ‘to go her own way’; but a closer look at Edna shows that she is not a character who rejects a society in ‘thought and act’ . . .” (Portales 431). Edna Pontellier may have had some affairs, but she still remains innocent in some ways. She never knew what love was when she married Leonce. She had been influenced by her father and assumed that she would fall in love with Leonce once they got married. Nevertheless, Edna tries unsuccessfully, so she then determines to just have a good time, but she falls for Robert and enters into a relationship with him - perhaps the first one when their is requited love between the two. Edna cannot be blamed for losing her innocence therefore, since she didn’t have it when she was married. She didn’t even know what it was to not have innocence at that time. Edna suffered at the hand so fate and her father. She rarely had control of her own life.\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by. Note: All written content is my original creation and copyrighted to me, but the graphics and images were linked from other sites and belong to them. Many thanks to their original creators."}, {"userName": "Matthew", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "This review is being posted mainly because of the awesome backstory. I actually had to read this twice in high school and didn't care for it much either time.But, here comes my great story!When I was a sophomore in high school I went out with this girl who eventually dumped me and gave the reason that she was only going out with me until the guy she really liked showed interest in her. A real downer!Fast forward to senior year . . .I was in theater and I just so happened to do shows at the all girls school where the aforementioned girl went. After a performance (I was Albert Peterson in Bye Bye Birdie), she came up to me and said that she needed to talk to me and that she was interested in me attending prom with her!?? WHAT!?? I hadn't talked to her in a couple of years . . . my mind was blown!I said yes, but I was skeptical . . .While at prom she sat me down for \"the talk\". She said that she felt terrible for what she did to me. She said that while reading The Awakening, she started to realize that I was really good to her and being the place holder for this other guy was not fair to me. *VINDICATED!* She wrote an essay about what she had done to me and how the book had opened her eyes (an awakening, perhaps???). This essay ended up winning some sort of state-wide competition. *Feeling pretty great by this point!*EpilogueShe came up to me at the end of the prom and asked me if she could leave with another guy who she has been kind of interested in for awhile . . . (you can't make this stuff up!) So, I got my vindication, but history repeated itself - at least I wasn't officially dating her this time!"}, {"userName": "Sanjina", "userReviewDate": "Feb 20, 2008", "userURL": "http://www.goodreads.com/user/show/257504-sanjina", "userReview": "I guess I can understand why The Awakening is considered so important in the development of the feminist canon. At the same time, I can understand why it was rejected so adamantly in its own time. Chopin is an okay writer. Her work, however, seethes ignorance. Her work was ignored in its time because it really was not worth the recognition. Anyway, that’s my humble, and not so intellectual, opinion. The protagonist, 29, seems to awaken into an adolescence of sorts in this book. In the guise of discovering her sexuality and moving towards some kind of self-actualization, she does little more than become the town trollop while engaging in pseudo intellectual banter and hysterics. Yes, I said hysterics. She addresses such issues as being a prisoner of marriage, society, social graces, and motherhood. At the same time, she never makes the mental baby steps towards a lifestyle that would give her the power of her own agency. She is spoiled, coddled, and does not have the courage to be a self sufficient person. When she decides to rebel, she does it by cheating on her husband, abandoning her children and responsibilities. All the time she is surrounded by servants, extravagance, and people feeding her distorted sense of entitlement. Ultimately she is humiliated when someone with a better sense of reality rejects her advances. She is left to build this new life for herself alone. Truly alone. This tremendous blow leads her to suicide. She could not handle standing on her own two feet. You can’t tell me that Chopin’s work is so juvenile and lacking because she was the first. She wasn’t. Not in Creole Louisiana. Look at Aphra Behn, Mary Wollstonecraft, even Mary Shelley. That was literature. Those were the building blocks of feminist writing. Chopin is spoiled, confused, and completely unaware of how the world around her really works."}, {"userName": "Whitney Atkinson", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "WOW probably the most beautifully written book i've ever read, plus so much feminism it makes me weak. I adore this book and I am going to be buying my own copy soon so that i can reread and reread and reread it until I die."}, {"userName": "Houston", "userReviewDate": "Nov 13, 2007", "userURL": "http://www.goodreads.com/user/show/617739-houston", "userReview": "“It sometimes entered Mr. Pontillier’s mind to wonder if his wife were not growing a little unbalanced mentally. He could see plainly that she was not herself. That is, he could not see that she was becoming herself and daily casting aside that fictitious self which we assume like a garment with which to appear before the world.”(p. 79)“What have you been doing to her, Pontillier?”“Doing! Parbleu!”“Has she,” asked the Doctor, with a smile, “has she been associating of late with a circle of pseudo-intellectual women—super-spiritual superior beings? My wife has been telling me about them.”(p. 91)“Authority, coercion are what is needed. Put your foot down good and hard; the only way to manage a wife.” (p. 99)“Conditions would someway adjust themselves, she felt; but whatever came, she had resolved never again to belong to another than herself.” (p. 110)These quotes sum up for me the difficulty Edna faced as she became herself, or discovered herself. The book is her journey, inward and then outward as well, to finding who she is and how she wants to be. I love the image of ‘daily casting aside’ her old self like a ‘garment.’ Of course, the trouble was that her husband and the men around him all thought that she was losing her mind. The Doctor even accuses the husband of being too lenient. Blame is directed not only at the husband, but also at other women, unnamed ‘pseudo-intellectual’ women. These men cannot understand or explain Edna’s behavior or change in attitude. At this time, and even now, women struggle to gain independence from the role of wife and mother. Trying to figure out where the self is within the confines of those roles, and how to manage the three successfully is still difficult. The last quote is so strong, Edna finally recognizing that she owns herself, that she is not property—not just someone’s wife, mother or even lover or friend—she is her own person and she grows stronger, finding her resolve. This resolve is what leads her to her final decision, becoming absolutely her own person to the exclusion of any other role. The end is somewhat disturbing, though poetic. The struggle between Edna and her environment, her time and those around her—her inner struggles—all seem to lead her to that final point of no return."}, {"userName": "Barry Pierce", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "Even though the entire plot of this novel can be summed up as, \"woman sits around and does nothing while having feminine thoughts\", there is a resounding beauty in its monotony. The Awakening is a quick and affecting novel (especially with  that  ending). While I do think that it may be slightly subject to over-hype, there is no contesting its importance as an early feminist work. And on that account, I would recommend it."}, {"userName": "Kelly", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/94602-kelly", "userReview": "“It may all sound very petty to complain about, but I tell you that sort of thing settles down on one like a fine dust.”-Warner, Lolly WillowesThis book is an early distillation of a particular kind of novel that was being written periodically throughout the early twentieth century. These novels are all variations on the same theme, but the basic outline is the same. This one will serve to give you a pretty good idea of the lot:Edna Pontellier is the rather well-to-do wife of a New Orleans businessman with two children, a well-appointed home, servants and a clear, clearly fulfilled place in her particular social circle. Her husband is kind to her in many conventional ways: he spares no expense on the household, takes something of an interest in the raising of the children, buys her personal and lavish presents and summer holidays, seems to offer periodic compliments and is not at all jealous or possessive. He has his faults of course- he likes his routines to be how they are and he places great importance on his wife fulfilling her “feminine” role in the household and society- dealing with the servants, ensuring high quality dinners, ministering to his needs and generally putting him first when he is home, being constantly involved with children, paying the same morning calls to the same wives of business associates that she always has. None of these expectations is particularly out-of-line for her time and place, and indeed she has never had to bear some of the extra morally horrible but legally acceptable extra burdens other wives have to shoulder without questioning. Her husband is occasionally rude and out of temper, he sometimes spends his evening out with his friends and blames her unfairly for occurrences that are blown all out of proportion. But that's about it.And yet, “It may all sound very petty to complain about, but I tell you that sort of thing settles down on one like a fine dust.”Of course, as we know, this is not the real problem. The problem is with the underlying foundations of the Patriarchal System of Various Assumptions and Ground Rules. In this case, the System manifests in her husband’s casual assumption that she sees her “occupation” as he does, to live her life as a recommendation and added enticement to her husband’s business career, or even to further it. There’s a scene where he recommends that she accept and reject calling cards and invitations on the basis of whether each woman in question has a husband that will further his career. He expects to everything at home reflect his success out of the home, including the dinner he eats (which he seems to be more upset about on the basis that it does not suit his status than anything). He conceptualizes her private life as a “public” one (since she has no “public” one to add to his), bound by all the same accommodations and professional decisions that a person in a career might make. When she deviates from her conventionally feminine choices, he assumes she may need medical treatment.Like the feminine version of Bartleby the Scrivener, the rebellion phase begins with  “I would prefer not to,” and continues until she’s figured out she would simply prefer not to live most of her life at all. Then of course, she has to decide what to do next.This is where a lot of the stories differ. In Lolly Willowes, perhaps the clearest parallel to this book, the book brings to the surface all the guilt and self-hatred that that “fine dust” can arouse in a woman used to a lifetime of its constraints. Lolly actually conceives herself to be a witch, *an actual servant of the devil*, because she finally chooses to live a life according to her desires, to ignore the claims and needs of the other people that she has spent her life tending thus far. This is encouraged by the fact that Lolly has never achieved that supposed “highest calling” for women: a husband and children. Thus, all she is supposed to have to offer is a life of selfless service to others that she is dependent on. Thus it makes sense for her to consider herself not only less than nothing, but actually actively evil for denying to further repay society what is seen as her only natural duty, given her lack of these highest blessings. All Passion Spent is another perhaps more mature parallel. In this iteration, Lady Slane actually has achieved the husband and children. What is more, they are grown and successful, with children of their own. Her husband was an eminent public servant and she fulfilled her “role” (just like Edna’s husband had requested) for all of her life. As Edna states clearly and expressively in The Awakening: \"at a very early period she had apprehended instinctively the dual life- that outward existence which conforms, the inward life which questions.\"Lady Slane has maintained this and chosen not to tell anyone for decades upon decades of marriage, so much so that even her family forgot that she was an actual person rather than a precious object, of sorts, to be taken care of much as an heirloom might be. Her Bartleby moment comes through in a meeting deciding her future, where her children have almost forgotten that she is a participant in the conversation. She decides to live out her life, like Lolly, in a house of her own. In this case it is the house itself, rather than an imaginary relationship with the devil, that becomes Lady Slane’s rebellion. A quirky, falling apart house with a sympathetic caretaker, becomes, bafflingly to her family, of greater interest to her than her children and grandchildren.The Enchanted April is a luxurious, loving and-all-too-temporary bath of the golden sunlight of the prime of this story. It’s presented as a fantasy of escape. The women involved take a house in Italy and spend charmed, perpetually-twilight-hour weeks of stillness, contemplation, repressed anger and joy escaping their obligations to their family, to their husbands or other men, their poses to the world and their need to repress their feelings. There is one woman, indeed, who sometimes barely seems to move at all, perpetually walking around with a suppressed, blissful smile on her face. There are men in the novel, but they enter what is clearly a world of women, enchanted indeed by their fantasies and repressed longings. Some women place more boundaries and limitations on letting themselves go than others, but the trend is there, and it is the opposite of what is found on the outside. Even this brief moment of suspension and stillness restores some of the women enough to go on, some couples leave transformed, more or less, and we fade out with quiet, with sheer quiet still the ultimate dream of nirvana.Mrs. Dalloway provides a different, more kaleidoscopic perspective on the same theme, perhaps even a slightly more optimistic and loving one in its own way. Clarissa Dalloway actually finds a kind of fulfillment in her duties as a housewife, in her every day errands and domestic creations. The interesting change of perspective here is that it seems like Woolf’s attempt to understand how this can be the case when she herself is so unlike this, rather than having the perspective be explaining a “different” woman to a mass of people who understand and live her opposite. Clarissa Dalloway, like Edna, understands that split between the interior and exterior life and instinctively lives it out each day. She, like these other women, has desires beyond her household, but has found reasons not to fulfill them. She has found her own way of making her life her own- even with a husband that she seems to have not much connection to, with a former lover for whom she can still have strong feelings after all these years, and with an unsatisfying daughter who is decidedly not her double in any way. She’s able to make these obligations into a kind of mission and to see the tiny beauty in the every day things that she achieves, or at least to come to see it after a daily struggle with her whole situation that mirrors some of the feelings these other women have, even if she justifies it to herself and thinks through it differently. Her slightly more optimistic conclusion (in its way) about the business of fulfilling her role as a woman and what it can lead to, at its best, does not at all lessen the struggles and doubts and reflections that we see her go through. Her success in repressing them might make her stronger in some ways, but it doesn’t mean that she, like Lady Slane, has seemingly ceased to be a person in the eyes and become only outward show. She maintains her personhood throughout, which is triumph most of these ladies desire to achieve anyway.Of course, the most obvious precursor to all this is the infamous Emma Bovary’s disastrous venture into speculation and dreams, due to her insatiable longing for something more, something higher to believe in than the calling she’s been given as a woman. Anna Karenina has its own piece to share as well, of course, in its way. But these headlong, rush-to-the-head statements, these explosions of joy and rage are screams in the night, almost in a category by themselves, one separate from the whispers, the candlelight dreams and embedded-in-the-everyday transformations that are the rest of these books. Those ladies seek to destroy, to smash, in a way, whereas these ladies seek to simply… exist in a different way. They want to find a way for themselves that is slightly different, not the expected, but not…publicly. These are still private individuals still interested in keeping their privacy and existing within most bounds. They are at most…. Slightly off, in the context of their day, or perhaps in the case of Clarissa Dalloway, not outwardly “off” at all. They are interested in delving into and acting on some specific and long cherished thoughts that are not necessarily radically out of the norm. It is the sort of “odd” that earns you sideways looks from your children and a “Well, I just never thought that you,” or “I just don’t know what you mean by…,” when you push them as to what exactly is wrong. It’s eccentricity, not revolutionary.I think the better predecessors are the more-or-less coded versions of the narrative that we find in Villette and Jane Eyre, and a wistful, painful statement of it through Dorothea in Middlemarch. Charlotte’s versions of it are covered over with the Victorian balm of marriage, of course, in the end. But both Lucy and Jane are interested in the sort of honesty, the sort of “to thine own self be true” that leads so many of the other ladies above to question what it is that they want and why. Villette, especially, offers its audience an ending that is, at best, deeply ambiguous as to whether it is marriage itself (rather than the act of it) that sets Lucy free or not. Her husband will never be any sort of ideal, and the way that he speaks to her has what would politely be called bracing honesty for a virtue. With Jane, of course, while she allows marriage to be more of an ideal achieved for her, the ideal is not achieved until they can meet as both financial and intellectual equals with something both material and spiritual to bring to the marriage, to assure anyone judging them that Jane has something worthwhile to contribute. This echoes Edna’s abandonment of her home and everything her husband ever bought her, her fixation on her husband’s money as the thing that binds her and keeps her in servitude, the same way that Jane refused the finery Rochester offered for their first wedding. Dorothea’s Saint Theresa is a more or less open presentation of a woman with more passion, intelligence and drive to achieve something than the bounds of her life will allow. Like Lolly, her dreams and thoughts of how to conceptualize these capacities inside of her are bounded by the perceptions and assumptions that are presented to her by society. Thus, she dreams of assisting a “Great Man,” of the sort of loving service that Lolly has been condemned to provide, if of a more intellectual sort. When women are encouraged to make ideals of men, to see them as the “superior sex,” those sorts of personalities that are inclined to want the best for themselves, to reach for all life has to offer, will take actions to see that they are a part of that. Her disillusionment is both expected and painful to read about. What is interesting about her is that she actually is a person who wants obligations to fulfill and to provide the sort of self-sacrificial service that women are demanded to provide. She’s begging for it- her problem is that the obligations given to her are not enough. In the end, she too finds happiness in the “better marriage,” that allows her more outlet to take on more obligations and be happy doing it. And yet, her end still leads to one of my favorite expressions of the reasons why feminism exists and is still so necessary:“Many who knew her, thought it a pity that so substantive and rare a creature should have been absorbed into the life of another, and be only known in a certain circle as a wife and mother. But no one stated exactly what else that was in her power she ought rather to have done.”It’s tossed in the middle of a paragraph in the midst of an epilogue that includes the entire main cast- coded, in its own way then and robbed of the end-of-book statement it should have enjoyed, but we still end on Saint Teresa, contemplating the great sacrifices that Dorothea was capable of, and questioning what more she might have achieved without these every day obligations pressing on her.Thus Edna Pontellier had many eloquent sisters saying, painting, singing, and subliminally messaging all the shades of this message for decades before The Awakening gained a wide, or almost any, audience. But she was one of the ones who did it both first and openly (remember again that the Brontes and George Eliot did it in more coded ways, and that Madame Bovary was, after all French and a scandal for decades.) In 1899, while not banned, the book was widely rejected and shunned by the reading public. Libraries refused to carry it. It got mixed reviews, but even the good ones who shied away from prudish or “conventional” condemnation of morality and unorthodox gender roles chose the secondary criticism of those who find it distasteful but realize that to say so would make them look backwards of bourgeois: the condescending complaint that she could have chosen a loftier, better subject for her talents rather than “entering into the overworked field of sex-fiction,” as a writer for the Chicago Times Herald put it. Of course I understand that in 1899 writing about women having any sort of sexual feeling or longing would have made this smut, automatically. But looking at the book from a modern reader’s point of view, I would be hard pressed to call this “sex fiction” of any kind. What I appreciate, and what I think other modern readers may appreciate about this particular iteration of the theme was how honest and free of…. devices, I guess would be the best word, that it was. There were minimal metaphors used to try to describe what she was trying to say, nor was the thing encased in the alternate, inner universe of thought. The book was almost… naïve, childlike, even sentimental about the way that it depicted Edna’s realization and actualization of her freedom. I thought that it was very earnest about trying to just… almost just record a series of moments that added up to Edna’s inability to deny what she had been feeling.Therefore, like these other quiet, figuring-it-out- ladies above, we get to go from her smallest feeling of “oddness” and difference through to her growing desire to act on it. The first major stand-off starts from a desire that Edna has to sleep outside on a hammock on a warm evening, rather than come inside. It is a small thing that increasingly becomes important the harder her husband pushes her on it. Eventually, he joins her outside to smoke his cigar and pretend to anyone watching that this was a communal desire. Slowly, this crushes out any magic her rebellion has until she slowly slips inside. We see her little by little move from stand-offs to the simple refusal to do ever larger things, withdrawing herself by choice from her life, from every thing that does not matter in itself, but, when added up, constitutes the life that she has been living in its entire. I think that this method of doing it was quite powerful, since we get to see all the little things that prick her and needle her into, after years of repetition, making the huge change that she does.Eventually, Edna has a frank conversation with one of her closest friends, trying to explain the essential difference between this woman’s priorities and her own. She finally tells her: “I would give up the unessential; I would give up my money, I would give my life for my children; but I wouldn’t give myself. I can’t make it more clear; it’s only something which I am beginning to comprehend, which is revealing itself to me.”The woman doesn’t understand, and says so, but the important part is that we see Edna trying to think through this and express her own new limits and boundaries and define them as different than others. Which is of course, as we saw above, the real work of becoming a person on your own, rather than an accessory, or someone acting out a defined role for themselves that does not require them to think out their own feelings or desires.This was my favorite part about what Edna’s journey tries to show us. That, sexuality and all, one of the major essences of feminism is, as someone said, that women are people. All Edna is doing in this book is testing out her likes and dislikes, finding friends that she herself enjoys, finding an occupation that fulfills her, and rooting out those things from her life which she does not like or need.I mean, that sounds like college to me. High school, college, my twenties. Edna is twenty-eight and has had really, none of that experience except brief infatuations, conquered quickly. She’s missed out on it all, and this is about her realizing that she has missed out on something. Which, as Chopin eloquently tells us, is more than most women of her class and status get the chance to realize, given the confines, expectations, obligations and, frankly, apparent rewards and the something-like-happiness endings that many are able to achieve, at least according to the script they’ve had since they were little girls: “A certain light was beginning to dawn dimly within her- the light which, showing the way, forbids [her realization of why she was doing what she was doing]. At that early period it served but to bewilder her. It moved her to dreams, to thoughtfulness, to the shadowy anguish which had overcome her the midnight when she had abandoned herself to tears.In short, Mrs. Pontellier was beginning to realize her position in the universe as a human being and to recognize her relations as an individual to the world within and about her. This may seem like a ponderous weight of wisdom to descend upon the soul of a young woman of twenty-eight- perhaps more wisdom than the Holy Ghost is usually vouchsafed to any woman.But the beginning of things, of a world especially, is necessarily vague, tangled, chaotic, and exceedingly disturbing. How few of us ever emerge from such a beginning! How many souls perish in its tumult!”Do you see what I mean by how straightforward it is?(... continued in the comments)."}, {"userName": "Lynne King", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/15736557-lynne-king", "userReview": "This is a work about a rather unusual woman, Edna Montpellier who lives in New Orleans with her husband Léonce, a rather successful businessman, and their two children, Etienne and Raoul. Part of the book is also based on their vacation in Grand Isle on the Gulf of Mexico.The scene is soon set as Edna is beginning to feel unsettled after six years of a rather bland marriage to an older man and feels that there is something lacking in her life. An incident then occurs that soon sets her on a course that cannot be changed. She doesn’t know what it is but she’s determined to find out.Now this doesn’t sound a very interesting book you may ask, and perhaps somewhat pedestrian, but this is where you will be proved wrong. The reason being, it was published in 1899, a period when a woman was meant to believe and to maintain that her place was purely in the home, having children and taking care of her husband. As was the case with Edna but one day she went unexpectedly completely against the establishment when to her own amazement friendship, love and desire plunged into the arena. Her whole personality changed but I believe this really came about when she learned to swim for she discovered a strength within herself that she had never known existed. I’m not a feminist as such but I could indeed empathize with Edna when she casts off some of her shackles and leaps with élan into the unknown, without a thought for whatever the outcome.I also began to sense the similarities of behavior with Emma Bovary.Set for the majority of the time by the sea, water will turn out to be the catalyst in this remarkable work. Edna discovered water and then she…. But it’s up to you to read this little literary gem!"}, {"userName": "Perry", "userReviewDate": "Feb 01, 2014", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "Sexual Satiation & Independence vs. Satisfaction of Repressing Demands of a Southern Society Patterned on Culture of Victorian EnglandSensate, if you will, Grand Isle, Louisiana, USA, 1899:Salty, muggy air creeping off a windless and glittering gulf, white wooden chairs posing in the antique, misty elegance of a large veranda, blinds half-drawn at sundown to corrugated silhouettes, and a laced corset honeycombed by dimming sunlight.Edna Pontellier was raised a Protestant in rural Kentucky then marries into a Catholic French Creole family in New Orleans. She is completely unprepared for the constraining societal demands upon first going to the Pontellier summer house on Grand Isle in south Louisiana. Nor was she ready to deal with 1899 Southern belles who sashay from house to summer house stifling the stuffy air as they swelter over sweaty glasses of iced tea. As Pat Conroy wrote, \"the sweetness of Southern women often conceals the deadliness of snakes.\" So true. Donna Tartt probably best explains the pain of being raised and living among this coquettish set, in writing that, \"many Southern ladies are fierce, dignified ex-belles who changed their ways before they went crazy or killed somebody.\"The voluptuary Edna is sexually awakened by the young single Creole, Robert LeBrun, thereafter commences an affair with a bad cad named Alcee Arobin, and ultimately moves out of her house to start her new \"independent\" life. In the end, she cannot handle the societal demands of New Orleans and goes for a long swim. In some ways, it reminds me of Madame Bovary published 43 years earlier (1856). Besides the geographic differences, Edna was more driven to seek independence by her circumstances and society, to rebel against sexual repression in a place that was more chauvinistic and puritanical than France half a century earlier; whereas Bovary dreamed of romance and free love like that in the books she read.The writing was commendable and tantalizing. Certainly, it was forward-thinking from the female point of view in the U.S. at the precipice of the 20th century. From what I've read, this short novel shocked American readers in 1899 with its uninhibited look at infidelity and female sexuality, and did not sell well until re-discovered in the 1960s by feminists in academia who saw and still see it as significant and liberating."}, {"userName": "Frona", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/58118625-frona", "userReview": "Sea, sun, bathing and loose summer rules form a recipe for a respite. Warm and welcoming environment, shaped by people with different predispositions gathered under the same soothing conditions, lighten the protagonist's manners. Her senses, before entangled beyond recognition, suddenly soften and let the melodies, smells and shapes in. Adjustments within her, long having been guided by society's calls, now slowly, but steadily, change course. In awakening to the stimulants and novelties the protagonist quietly, but firmly, demands her right to feel her own feelings.If in the works of similar stature the nuances of emotions are often but subtly implied and hidden behind the excessive behavior, they are here stated openly and affectionately. Although we are given free access to her thoughts, it is with less spectacle than any implication could leave us to imagine. It's a silent, straightforward strength; she doesn't lose herself in a love affair, but gains vigor from it. Similarly, her decline is more connected with a realization of the eternal gap between human nature and natural laws than it is with love itself. When summer ends, autumn comes and interrupts the immediacy of her bond with nature. Being enclosed between the walls of human invention, she knows no way out, for her awaking progresses linearly and is not attuned with the nature's cyclic seasons."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "For starters, I did not enjoy this story, and I did not see why Edna's life was utterly miserable. I didn't care about her, really. And her plight didn't speak to me at all. Everything is subjective, however, Edna has many more options and choices than some women ever have. More than anything she has safety and the ability to protect herself and her children. That in itself is more than many women have, even today. I can understand feeling restricted, but I think Edna was a very selfish woman. If anything, she should have thought of her children. I am not here to say that women don't have existences outside of their marriages, their children. I disagree strongly with that. But a woman has a choice to make. When she brings children into the world, it changes the decisions that she can make. She can be happy and she can have joy, but she has to make sure that her children are loved and cared for. Edna was a pampered woman with an indulgent husband, and she had the means to go on a nice vacation every year. She had servants, and friends. A lot of women don't even have those things, but manage to get up out of bed everyday and live their lives. Yes, she felt that she was denying her inner self, and had to marry, although maybe she didn't want to. I cannot deny that must have caused some emotional angst, but there is no either/or. There is: Okay this is what I have, let's see what I can do with it. Make the best of what you have. Edna continually made bad choices. She made a mistake and had an extramarital affair. Not the end of the world. I believe her husband would have forgiven her. Or she could have even lived apart from him and hopefully still be a mother to her children. (Maybe I'm being naive about this for the time period, maybe not). She could have stayed with her husband and had a friendship marriage with no physical involvement and painted. Even carried on her affairs as long as she was discreet. She had some choices. A lot of women, a lot of people don't. I just didn't buy the option that she took. I think she was a drama queen. Sorry, I just didn't have much sympathy for this woman. I can see how this must have been an important work at the time it was written. However, it fails to speak to me of female empowerment in a world that allows women less power, choices, and equality. My rating is based moreso on this novella's failure to demonstrate what it set out to accomplish than my dislike of the story. I would read more Chopin, and I intend to do so."}, {"userName": "Alison", "userReviewDate": "Jun 17, 2007", "userURL": "http://www.goodreads.com/user/show/124482-alison", "userReview": "\"But they need not thought that they could possess her, body and soul.\"If there ever was a Feminist Manifesto, it truly is Kate Chopin's \"The Awakening.\" Edna Pontellier is a 28-year-old wife and mother in New Orleans, 1900. Her husband is well-off, and Edna's days consist of watching the nanny take care of her two young boys, scolding the cook over bad soup, giving and attending champagne-filled dinner parties, and receiving formal calls from high society New Orleans ladies on Tuesdays. Also, the Pontelliers spend every summer on the coast of Louisianna, in a beach house. (The nanny goes with, while Edna is free to spend her days as she likes--which happens to be boating and swimming with the unmarried son of the beach home's proprietor--Robert). But there's an anguish growing within Mrs. P. Her inability to connect with her husband and her children leaves her feeling oppressed. Gradually, and with the aid of young Robert, however, a spark is lit. \"In short, Mrs. Pontellier was beginning to realize her position in the universe as a human being, and to recognize her relations as an individual to the world within and about her.\" In other words, after seven years of marriage, Edna's finally getting \"schooled\" on what it really means to be a wife and mom. And she's not feeling super cut-out for the job.Mrs. Pontellier is at a crossroads. Reminded of walking aimlessly through a meadow as a child, Edna yearns for the time (pre-loveless marriage, pre-kids) when she didn't have to calculate every step. She longs to be lifted from the weight of her \"blindly assumed\" responsibilities and to be allowed to wander purposelessly. Edna aches for solitude, but fears she doesn't possess the courage to defy social constraint and become a free entity--free to leave behind her husband, home, and children and follow her heart.Edna's duality and transformation reminded me of several in fiction--from Frankenstein's monster to Kafka's cockroach. The new, sexy Edna recognizes herself as different from her former self--a new creation. Like the monster, she is a \"newly awakened being.\" The old world is now \"alien\" and \"antagonistic.\" She has cast aside the mask that she has been wearing for the world. New Edna is bold and frisky, like \"an animal waking in the sun.\"Big sigh, because here's where I try to fit myself into Edna's way of thinking. I guess somewhere on the feminist spectrum, like all theoretical spectrums, I fall somewhere in the middle. Yes, I can see how Edna might feel trapped and oppressed. Domestic life can surely be repetitious, mundane, and exasperating. I can imagine yearning for something to happen to break the monotony. I can imagine how it would feel to a woman to be regarded as a piece of property--hand picked to run a household and bear children, with no hope of variation, peering out on the rest of her life and seeing very few choices ahead--outside of what will be next for dinner.But toward the other end, I can see things that Edna failed to see--the gratification that comes from growing a family...what you get when you give...the inner peace that comes from never doubting your purpose and the course of your life. Edna felt her children were robbing her of her soul, I give mine away freely, every day.Although I don't 100% identify with Edna, I can still appreciate works like this. Because women like Chopin were bold enough to write characters like Edna, the way women were perceived was drastically changed. Books like The Awakening paved the way for modern women to choose where we fall on the spectrum (the CHOICE is the key), to chart our own course, to soar and not sink."}, {"userName": "Adina", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "I do not feel like reviewing this novel/novella, whatever it is... I will just say that these kind of books made me have problems with my literature course and run away from most of the \"classics\". Although the books were written by Romanian authors I recognize the type. I came to my senses after joining GR and I now try to gain the lost time by reading the books that I should have covered earlier in my life. Until now the results were satisfying as I am on my way of becoming a big fan of Victorian literature. However, this book was so, so slow and i could not feel anything. I understand the power of the novel but it wasn't enough to make me like it. Also, I wish there were other endings to women having affairs than suicide."}, {"userName": "Scarlet", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/3839903-scarlet", "userReview": "That moment when you read a book so good, you want to lie awake all night and ruminate on it.Review to come for sure, but it might take a few days - there are too many thoughts somersaulting in my head and I don't think they'll settle anytime soon."}, {"userName": "Dolly", "userReviewDate": "Jul 11, 2007", "userURL": "http://www.goodreads.com/user/show/180347-dolly", "userReview": "Kate Chopin wrote this story of female self-actualization back in the late 19th century, but it's as applicable today as it was then. I think we all feel trapped by decisions we've made capriciously, and we all consider, even briefly, escape. The main character in this novel not only realizes that she has trapped herself, but she actively seeks to free herself. Her action, rather than just emotion and despair (a la Goethe), is what separates her from the herd.Here's the low-down: Edna is a woman, probably in her 30s or so, married to a successful financier and mother to two charming children. She summers on an island, probably to escape summer diseases in the city, New Orleans. One summer she acquires a friend, Robert. Although married women in this society frequently have male friends, Edna is an outsider, and she takes Robert's attentions far too seriously. Apparently, he is similarly infatuated. Basking in Robert's attention, Edna understands at last that she has discarded her youthful dreams and hopes and that her current life is unfulfilling. She takes small steps toward freeing herself, and Robert seems a willing accomplice for a while.But Robert sees the hopelessness of such an infatuation: Edna is married, after all. Abruptly, Robert leaves the island and heads off to Mexico, presumably to seek his fortune. Edna is devastated. Even after she returns to town, her emotions are in turmoil. But loneliness actually proves helpful. She relearns who she is, reclaims the dreams of her youth, and abandons her husband and children. The author is careful with this last, making it seem tragic and irresponsible, yet ultimately unavoidable. By the last 20 pages, Edna is free.And then Robert returns. Edna says that she does not feel obligated by their mutual love; she says that she is an independent woman now who is not the property of any other person. But she's lying. Her actions show that she is dependent on Robert, needy for his love and attention. I still can't decide if the author created this break between words and behavior on purpose, or if she really intended us to believe that Edna was wholly independent.In fact, the only weak part of the story, in my opinion, is that Edna does not take responsibility for her own awakening. She claims that Robert \"awoke\" her.Edna does in the end devise a solution that proves her ultimate freedom and independence, and it is the only solution that works. But I won't spoil it by writing it here.The thing that makes this book so lovely is that it isn't preachy. So many modern girl-power novels just sort of slam you over the head with the girls-first-and-men-suck mantra. This book is about Edna; it doesn't purport to be about all women. It's a very personal work, and the narrative hand is light. It leaves us, the readers, free to recognize the little bits of Edna in us all, and although the rest of us may not ultimately choose Edna's course, it gives us hope that such freedom is possible, even after the fact."}, {"userName": "Connie", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "Published in 1899, \"The Awakening\" is a story revolving around personal and sexual freedom for women. The book was set in New Orleans and nearby coastal areas where women--and any property they accumulated after marriage--were considered the property of their husbands. Divorce was almost non-existent in that Catholic area.Edna and Leonce Pontellier are vacationing at a coastal resort with their two little sons. Leonce is a generous husband in material ways, but does not connect well emotionally with his wife. Edna falls in love with Robert Lebrun, a young man at the resort. Robert leaves for Mexico since he realizes that the relationship would not have a good outcome.Edna befriends two women with contrasting lifestyles. Madame Ratignolle is a perfect wife and mother, but Mademoiselle Reisz, a pianist, has a very independent life. Edna is unhappy in her life as a wife and mother, even though she has servants to do most of the work in the home. She has the opportunity to rebel when her husband goes on a long business trip and their children are sent to their grandmother's house for an extended stay. She begins a dalliance with Alcee Arobin, a man with a reputation of chasing married women. She asserts her independence by moving out of her large house into a smaller abode, dabbling in art, and is awakened as a sexual woman. When Robert returns later, she says, \"I am no longer one of Mr Pontellier's possessions to dispose of or not. I give myself where I choose.\"The book was very controversial because Edna left her husband and children for her own freedom, a move that would be socially shocking at the turn of the century. Even today, society looks down severely on women who abandon their children. Early in the book, it was stated, \"Mrs Pontellier was not a mother-woman.\" Near the end of the book, it said, \"Despondency had come upon her there in the wakeful night and never lifted....The children appeared before her like antagonists who had overcome her; who had overpowered and sought to drag her into the soul's slavery for the rest of her days. But she knew a way to elude them.\"The book has wonderful imagery of hunger and food, the draw of the sea, birds in flight, sleeping and awakening. Edna was a fascinating character. She seemed to be a woman who was unable to count her blessings, could only see the problems which were certainly genuine, and probably suffered from depression. She moved so much into a fantasy world that a solution seemed hopeless. Finally she hears the call of the sea, \"The voice of the sea is seductive, never ceasing, whispering, clamoring, murmuring, inviting the soul to wander in abysses of solitude. All along the white beach, up and down, there was no living thing in sight. A bird with a broken wing was beating the air above, reeling, fluttering, circling disabled down, down to the water.\""}, {"userName": "Sherwood Smith", "userReviewDate": "May 05, 2009", "userURL": "http://www.goodreads.com/user/show/162084-sherwood-smith", "userReview": "It's interesting to read an end-of-the-century novel from the opposite side of the intervening twentieth century, for though there is in Chopin's novel no preoccupation with the remorseless cycle of measured time, the intervening hundred years--and all their evolutions, both cultural and literary--are going to be part of the modern reader's context. Be aware: this is somewhat spoilery.As the novel unfolds, it is very difficult to like Edna Pontellier. In these days of two paychecks being required just to survive, on top of the endless drudgery of housework, car maintenance, and children's needs, Edna's dissatisfaction with a life of social engagements, fine dinners that she did not have to prepare or clean up after, and congenial hours of just sitting about on porches chatting idly, make it very hard for a modern reader to sympathize with her. While she is obsessed with her perceived bonds of slavery, she spares not one thought to the nameless women of color who labor unceasingly in the background doing the drudge work that is an inescapable part of daily existence. The woman who appears to be the primary caretaker of Edna's two boys is not even vouchsafed a name; she is dismissed as \"the quadroon,\" a racial epithet that relegates her to an importance somewhere beneath parlor furnishings, which are at least noticed by callers. Chopin's evocative depiction of life in Louisiana a hundred years ago is fascinating both for the differences and for the moments that resonate with our own experience. Adele Ratignole's childbirth scene, with its pain and emotional intensity. The ability of children then, as now, to invent games on the dusty ground. Sitting through an amateur theatrical. The sensory details, and the emotional dynamics resultant all transmit that spark of verisimilitude--the scents of flowers. The stickiness of clothing in hot weather. How musical artistry stabs through our primal emotions like a hiltless knife. The moment of realization when the warmth of friendship kindles into lust. The novel's overarcing theme appears to be self-discovery, but it reads to me more like self-involvement. Restless, emotionally stifled Edna is \"awakened\" first by Madamoiselle Reisz's music, and then by a midnight swim when she dares, for the first time, not to wade, but to strike out into the dark waters and test that elusive nexus between heightened physical endeavor and death. Her desire to free herself from all her perceived shackles of wifedom and motherhood veer when she discovers, belatedly, her lust for Robert Lebrun, and again when she forsakes the serene, generous, but ambitionless friendship of Adele Ratignolle. She tells Robert that she loves him; he responds in kind; in a desperate act of martyred honor Robert leaves, and Edna shrugs off the world and takes another swim, this one toward the eternal darkness. It is interesting that Edna's very last images are not of any of her putative loved ones, but of vivid and unconnected sensory details--The spurs of the cavalry officer clanged as he walked across the porch. There was the hum of bees, and the musky odor of pinks filled the air. Throughout the novel the presence of solitary lives wink in and out like fireflies: the parrot, the quadroon, Madamoiselle Reisz; even the lovers, who are never named, nor do they interact with anyone else in their total mutual absorption. Edna connects with four different people, two men and two women, however ephemerally. Each of the four is connected to the rest of their community through a different thread of the lacework of life: Adele and Robert as mother and gentleman, respectively, of society; Madamoiselle Reisz as the artist, and Arabin as the sensualist. All four live the lives they want to live, the latter two as singles, Robert as a son and brother, and Adele as wife and mother. It is Robert and Adele who, as members of the community, each make sacrificial acts: Robert in leaving to save his and Edna's reputations (he leaves twice) and Adele through childbirth. Each act is painful, each is a necessity to sustain the implied greater good of the community. Madame Reisz leads an independent existence, having everything she wants except (it is implied) sex. It is she who encourages Edna to \"take flight\" and though she speaks in terms of art, one wonders if in fact the spinster is encouraging Edna to give her the vicarious thrill of passion that she, old and ugly, desires. She certainly knows what it is that Edna wants--as does Adele, who tries to save Edna from cutting herself off from all the other presumed connections of her life in order to satisfy this illicit desire. And of course Arabin represents the life of illicit desire, never responsible, mostly shunned, with no permanent connections outside of the endless quest for gratification. It appears that the illicit aspect of Edna's desires is the driving force behind her quest. She tries one thing after another, from wandering about the streets as long as she likes to gluttonous eating and adultery, and then abandons them all. She can't be bothered with anything that requires self discipline--not in watching over her children, or communicating with her husband, or even painting. From the perspective of one who was young during the sixties and seventies, it is not surprising that this novel experienced a rebirth of interest during that period. It seems, looking back, that alienation and self-absorbed behavior were idealized during that time; novels and movies featured young singles who rejected everything but the pursuit of pleasure, and found that meaningless as well.Existentialist angst seemed the raison-d'etre of all art, because life was meaningless, and females felt the shackles of fifties expectations: we were supposed to be Doris Day, conforming to a cheerful dedication of our lives to a male, who would in turn provide house, car, and children. Nowadays we would call her behavior dysfunctional, and Edna certainly is a vivid portrayal of a dysfunctional woman. Despite Chopin's mendaciously casual dismissal of her heroine in her response to the novel's critical rejection as \"working out her own damnation\" one suspects that Chopin really did admire her heroine. All those reminders of how attractive she was in others' eyes; the firm auctorial intrusion not permitting the reader any sympathy with Mr. Pontellier and his \"worship of his household gods\"--though it is he who spends the most energy in trying to understand his wife, to communicate with her, and to make her happy. It is he who has the strongest bond with the children, though the culture by that time had already disengaged fathers from active parenting--except in punishment and economic control. The culminating moment of the book is Edna's dinner party, where she is perceived as Aphrodite, the goddess of love--an ironic observation about a woman who doesn't seem to have been capable of real love. This is not to say that the novel doesn't work. In fact, it is so well written that it functions on numerous levels, as a slice-of-regional life historical piece, and as an exercise is stylistic brilliance. As a cautionary tale during the early part of this century, when the nascent women's movement was beginning to build up enough speed to cause cultural resistance. As a tale of alienation and self-absorption for the young adult reader, who is often alienated and self-absorbed, as it was for a period in our own recent history when such tales enjoyed their literary eclat. As a tale of dysfunction for contemporary readers, who are engaged in examing the literature of the past so as to find a way to redefine our own roles--gender roles, family roles, community roles--for the future."}, {"userName": "Carol", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "A loveless marriage + two children + a life of leisure = a bored woman who no longer wants to be a submissive wife. Throbbing with an uncontrollable desire for the handsome Robert, 29 year old Edna decides to change her life.....resulting in an unfortunate outcome.Beautifully written and first published in 1899 this short classic tale of a woman's independence and unorthodox decisions caused a stir with the critics and people of the time causing the novel to be banished for decades afterward......times sure have changed."}, {"userName": "Chrissie", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "Here is another book that surprised me. I did not like the writing style at the beginning, but by the end I liked exactly that, the writing, very much. The writing is descriptive, right from the beginning, but when it starts not only the places and scenes are described, but also we are told the personality traits of the involved characters. Here is the classical problem of being \"told rather than shown\". After the initial presentation of the characters, only then do we begin to observe them. At the same time the tone becomes sensual, beautiful and moving. It starts out choppy. Maybe this is not a bad technique, to first introduce the disparate characters and then to add depth to each one? You begin to watch them and to understand their emotions. It is Edna, and the other female characters you watch, more so than the male figures. But what I liked about the book was the writing.This is a book of early feminism, published first in 1899. The constricts are those placed upon women during the Victorian era – husband, social standing, children and “what will people say”! We watch the \"awakening\" of a woman; she becomes aware of her own identity, and her right to have her own identity. The setting is New Orleans and the Southern Louisiana coast.This was my first Librivox audiobook. I want to thank Leslie and Sandy for their help in learning how to download it and for their lists of good Librivox narrators. Elizabeth Klett, narrates this. To tell you the truth, I didn't like the narration at first. I found it too rapid, I had to learn who was who and so I had a terrible time with the rapid speed. But then, just as I grew to like the writing style, I grew to like the narration too. Sometimes you have to acclimatize yourself to a narrator, and sometimes the narrator has to get into the feel of the story. I will not shy away from this narrator. She is very good, albeit a bit fast for me. I need time to think when I listen to a book.Then there is the ending...... I am not so sure I like it, but you will be surprised. I guarantee that. Again, it is not the plot that makes me like this book, but rather the feeling the writing conjures. I felt Edna's awakening. A good book, and I recommend it."}, {"userName": "Ivana Books Are Magic", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/56173179-ivana-books-are-magic", "userReview": "The Awakening is certainly an important novel. Published in 1899, this novel was a forerunner in many ways. Undoubtedly, Chopin crafted one of the early works of feminism, when she wrote the story of Edna, a young woman experiencing ‘awakening’. By creating a literary heroine who is undergoing spiritual, psychological, emotional and sexual awakening, Chopin challenged not only the social views of her time, but social identity as such. Moreover, I do believe that The Awakening is neither reserved for one (female) gender, nor a strictly feminist book, for it can be read as an individual search for personal identity and freedom. It is a novel that has aged well and still holds many valuable lessons. I’m not disputing its rightful place in the early feminist cannon, I’m just saying that I think there is something quite timeless about it. The writing as such is quite beautiful. From the very start, Chopin does a great job of creating the tone and the atmosphere. The novel opens up with Edna who is vacationing on Grand Isle with her kids. The feeling of summer is very much present in the writing. At Grand Isle, Edna falls in love with Robert. Their ‘falling in love’ is well written and credible. Once Edna returns to her home, she is a changed woman. Chopin depicts different settings with precision. Her portrayal of characters is attentive and well rounded. It is not as intimate and in-depth as I would have perhaps liked, but Chopin does do a great job with the characterization. She portrays the inner struggles of Edna Pontellier with care. Edna, a young woman trapped in a loveless marriage, is showed to us, not just as a woman but even more importantly as a human being. What I liked most about this novel is how human Edna felt. Edna is not idolized, she never feels like a victim. I loved Edna even when she seemed selfish, perhaps at those times most of all. There is little doubt that Edna’s awakening happens as a result of searching for her own identity within herself and not within her family role. His refusal to take part in social activities is surprisingly modernist. Edna prefers not to entertains, she refuses to receive guests, and once she is ‘awaken’ she actually prefers to spend time by herself. I would say that in the course of this novel the life story of Edna Pontellier, a young woman searching for her identity (as it is often case with great stories) grows into something universal. When I first learned about this novel, I wasn’t very enthusiastic about it, but I was proved wrong. Edna got under my skin. It is not only Edna, though. This novel has a unique taste and flavour. Take that passage about Edna’s experience to listening to classical music for example. After her awakening, Edna can experience music fully. Still, her awakening comes with a price. I felt like Edna was becoming almost an artist, had a potential to become one at least, just by the virtue of daring to search for her identity within herself. Nevertheless, can a woman live her life only for herself? This book raises many interesting questions. Edna’s eventual separation of sexuality and love for instance, could be interpreted as something quite modernist.The plot may resemble Tolstoy’s Anna Karenina, but only on the surface. Both women are married unhappily, both of them fall in love and decide to pursue a love affair outside of their marriage. Both of them defy the society. However, I didn’t see The Awakening as a copy of Tolstoy’s Anna Karenina. The plot of these two novels may be strikingly similar, but the writing style is quite different. I feel like Chopin’s writing style owes more to French writer Maupassant, then it does to Tolstoy. In other words, Chopin is more a naturalistic than a realistic writer. Her portrayal of characters does have an occasional note of animalism. There is also something pessimistic about the way Chopin views society, something makes me think of Maupassant. Moreover, despite many similarities between Anna’s and Edna’s upper class life, one can’t dispute that Chopin has created a unique character. Edna is a great character in her own right."}, {"userName": "Erin", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "In short, Mrs. Pontellier was not a mother-woman. The mother-women seemed to prevail that summer at Grand Isle. It was easy to know them, fluttering about with extended, protecting wings when any harm, real or imaginary, threatened their precious brood. They were women who idolized their children, worshiped their husbands, and esteemed it a holy privilege to efface themselves as individuals and grow wings as ministering angels. Wait, isn't this something that we would read in O magazine these days? When are we \"mom\" enough? Can we really have it all? Gosh, haven't we heard all those questions before? What makes The Awakening really interesting( and perhaps ageless) is Kate Chopin was talking about a wife and mother living in 19th century Louisiana. How can it be possible that we're in the 21st century( with better conditions) and we are still asking ourselves these questions? What married woman would enter into an adulterous affair? What drives women to embark on that path? Another friend of mine from university was OBSESSED with this question and as a married woman herself, enjoyed asking the other women in her class, myself included. I wonder all these years later if she ever found the answer. In The Awakening, our main female protagonist, wife and mother of two, Edna Pontellier, draws closer to a local man and although the relationship ends before it can be consummated, forbidden love hangs in the air. But that summer sets Edna on a course of \"awakening\" that rocks the foundation of her marriage and the society that surrounds her.  Mrs. Pontellier was beginning to realize her position in the universe as a human being, and to recognize her relations as an individual to the world within and about her. This may seem like a ponderous weight of wisdom to descend upon the soul of a young woman of twenty-eight—perhaps more wisdom than the Holy Ghost is usually pleased to vouchsafe to any woman.Can you just imagine the scandal when this book was released? Even now, just as Anna Karenina and Madame Bovary ( just to name two) managed to set readers apart, Kate Chopin certainly had 'tongues wagging' over things that would have seen completely unforgivable for a woman.There were days when she was very happy without knowing why. She was happy to be alive and breathing, when her whole being seemed to be one with the sunlight, the color, the odors, the luxuriant warmth of some perfect Southern day. She liked then to wander alone into strange and unfamiliar places. She discovered many a sunny, sleepy corner, fashioned to dream in. And she found it good to dream and to be alone and unmolested.There were days when she was unhappy, she did not know why,—when it did not seem worth while to be glad or sorry, to be alive or dead; when life appeared to her like a grotesque pandemonium and humanity like worms struggling blindly toward inevitable annihilation. She could not work on such a day, nor weave fancies to stir her pulses and warm her blood.As a reader, when I was a 19 year old university student and today as 35 year old high school teacher, the scene in this story that I will never forget is that of Edna's husband and the doctor. The doctor decides to give the husband some \" sound medical advice.\" let your wife alone for a while. Don’t bother her, and don’t let her bother you. Woman, my dear friend, is a very peculiar and delicate organism—a sensitive and highly organized woman, such as I know Mrs. Pontellier to be, is especially peculiar. It would require an inspired psychologist to deal successfully with them. And when ordinary fellows like you and me attempt to cope with their idiosyncrasies the result is bungling. Most women are moody and whimsical. This is some passing whim of your wife, due to some cause or causes which you and I needn’t try to fathom. Moody and whimsical? Indeed! The Awakening certainly reminds me of the beautifully written The Yellow Wallpaper as both highlight the opinions of what a \"woman ought to be.\" The ending bears a striking similarity to Chopin'sThe Story of an Hour in that beautiful hint of irony that delivers sadness with it as well.  So many readers have stated it so much better than I, but The Awakening certainly still deserves our attention."}, {"userName": "Liz Janet", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/5114433-liz-janet", "userReview": "“The voice of the sea is seductive; never ceasing, whispering, clamoring, murmuring, inviting the soul to wander for a spell in abysses of solitude; to lose itself in mazes of inward contemplation. The voice of the sea speaks to the soul. The touch of the sea is sensuous, enfolding the body in its soft, close embrace.” I read this book during my senior year of high school, and I am grateful for that, because without all the analyzing and discussion, I would not have been able to understand it and appreciate it as much as I did.It follows Edna Pontellier, during a holiday on the Gulf of Mexico, as she has an “awakening” of ideas and self, amidst the constriction of Louisiana society. This novel has many themes, impulse, freedom, search for identity, the role of women and sex, marriage, and rejection of tradition; making it into a Bildungsroman novel, as it focuses on the changes that contributed to the main character growth, rather than relaying on past accounts.Edna is a dis-likable character, but at the same time interesting, most people hate her, and I am one of them, however she is such an interesting narrator, she begins from a housewife to a “free-woman.” What I have seen is that she is mostly disliked for her relationship with her children. “I would give up the unessential; I would give up my money, I would give up my life for my children; but I wouldn't give myself. I can't make it more clear; it's only something I am beginning to comprehend, which is revealing itself to me.” She is seen as a bad mother because she is not constantly coddling them, she does not sugar coat anything, when her children get injured, they know that crying to mummy is not a solution, they must get up and over it, instead of acting like babies and crying about it like all other children in this tale. Just because they are our parents does not mean that they must give themselves up for our pleasure, that seems rather selfish.“He could see plainly that she was not herself. That is, he could not see that she was becoming herself and daily casting aside that fictitious self which we assume like a garment with which to appear before the world.” There is big debate over whether this novel should be categorized as feminist or not, and whatever your opinion might be we must look at it from a non-linear point of view; it is a tale of self discovery of the oppressed, and if the mind cannot process such a thing, then picture yourself as her, and not just say what you would have done in her position, but truly analyze it, because everything is easier said than done.P.S.: If you don’t want to read this book, then at least only read chapter 6, it is less than a page long, and truly brilliant."}, {"userName": "Crystal", "userReviewDate": "Jan 15, 2008", "userURL": "http://www.goodreads.com/user/show/182835-crystal", "userReview": "I hated this book. I didn't necessarily enjoy it throughout, but when I got to the end, and saw how she ended it all, I was so mad! there is nothing likable about this woman. She is spoiled and selfish--her children may have grieved her loss, but they were better off without a self-absorbed trollop like herself in their lives. the way to self-realization, as this book seems to imply she's finding, is NOT to break every vow you've made, betray every relationship, abandon your children, and kill yourself in the end because you just can't deal with it anymore. This reminds me of two other books I hated--the Wuthering Heights and Catcher in the Rye. if you want to read a much better book about a woman actualizing herself and making a new life for herself, despite those around her, read the Blue Castle by L.M. Montgomery. Not this drivel."}, {"userName": "Heather", "userReviewDate": "Mar 05, 2007", "userURL": "http://www.goodreads.com/user/show/18056-heather", "userReview": "A few of my all time favorite excerpts are from this book ...When Mlle Reisz asks Edna why she loves him, when she shouldn't and she says:\"...Because his hair is brown and grows away from his temples; because he opens and shuts his eyes, and his nose is a little out of drawing; because he has two lips and a square chin, and a little finger which he can't straighten from having played baseball too energetically in his youth. Because '\"\"Because you do, in short.\"And ... \"...when I left her today, she put her arms around me and felt my shoulder blades, to see if my wings were storng, she said. \"The bird that would soar above the level plain of tradition and prejudice much have strong wings.\""}, {"userName": "Fiona MacDonald", "userReviewDate": "May 03, 2017", "userURL": "http://www.goodreads.com/user/show/2417021-fiona-macdonald", "userReview": "After finishing this book I can finally say I understand the premise, it seemed to all come together in the last handful of pages and was exceedingly sad and tragic. Now I look back over the book I think Kate Chopin actually did a very good job of portraying a stifled and unhappy women caught in the shackles of Victorian society and a marriage that doesn't make her happy. It was worth it."}], "description": "Edna Pontellier is a young woman living comfortably in the beautiful city of New Orleans. She is fond of her husband and proud of her sons but finds it impossible to accept that for women it is a holy privilege to efface themselves as individuals. She fights back in the only manner she knows.", "title": "The Awakening", "url": "http://www.goodreads.com/book/show/7578.The_Awakening", "average": 3.63, "cover": "https://images.gr-assets.com/books/1356474219l/7578.jpg", "reviews": 6147, "authors": [{"url": "https://www.goodreads.com/author/show/5132.Kate_Chopin", "name": "Kate Chopin"}, {"url": "https://www.goodreads.com/author/show/16811.Helen_Taylor", "name": "Helen Taylor"}], "type": ["Classics", "Fiction", "Feminism", "Academic", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/7578.The_Awakening", "http://www.goodreads.com/book/show/5075677-the-awakening", "http://www.goodreads.com/book/show/8701363-the-awakening", "http://www.goodreads.com/book/show/52277.The_Awakening", "http://www.goodreads.com/book/show/58345.The_Awakening", "http://www.goodreads.com/book/show/3088558-the-awakening", "http://www.goodreads.com/book/show/343196.The_Awakening", "http://www.goodreads.com/book/show/17724.The_Awakening", "http://www.goodreads.com/book/show/1967357.The_Awakening", "http://www.goodreads.com/book/show/11837081-the-awakening", "http://www.goodreads.com/book/show/7473697-the-awakening", "http://www.goodreads.com/book/show/10048963-the-awakening", "http://www.goodreads.com/book/show/21944816-the-awakening", "http://www.goodreads.com/book/show/2267195.The_Story_of_an_Hour", "http://www.goodreads.com/book/show/16076.The_Awakening_and_Selected_Stories", "http://www.goodreads.com/book/show/3088548-desiree-s-baby", "http://www.goodreads.com/book/show/13722759-the-storm", "http://www.goodreads.com/book/show/39726881-the-awakening-and-selected-short-stories"]}