{"ratings": 1463, "userreviews": [{"userName": "Kathleen", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/13954899-kathleen", "userReview": "This is the prequel to The Good Dream (great book, comprehensible as a stand-alone). Nice to see so much of Henry Walker and his wife Loretta, favorite characters in The Good Dream, but why didn't we see more of his sister, Sarah Ivorie Walker? Compared to The Good Dream, there is slightly more romance woven into this plot, but nonetheless this is primarily a post-war historical about a few white families uniting to help an orphaned homeless black boy (little Milo). It's a heartwarming, heartbreaking, and fairly credible portrayal of racial segregation and intolerance in small-town Tennessee. There is a slight religious message, too. The story is set in 1947, seven years before the Supreme Court ruling on Brown vs Board of Education. So, in 1947, each state could decide for itself how it would handle school segregation. In Tennessee, the state law required \"separate but equal\" schools -- blacks and whites could not attend the same school. I liked the scenes that led to an avalanche for change, but the legal requirement was too easily pushed aside and the conflict too easily resolved. At least the principal kept some documentation to show the courts, if it comes to that.I didn't predict the plot twist regarding the poisoned animal -- didn't expect that person to be the villain, and not sure I buy it (but okay). There was plenty of tension across the book as I feared for Milo, a black boy adopted into a white family (the widow Fran Gable and her children, Jane and John). Tension also came from the three thugs, Beef (Jeff), Clyde, and Eddy. Eddy had his evil eye on the pretty widow. Then there was the tension about Joe Cannon, hoping he'd not go back to Atlanta. Hoping he'd stay for Fran and her children.Quibbles: On the down side, some key areas were not developed enough to move me. For example, I couldn't \"feel\" the bond of friendship between Fran and Addy -- she died too soon. Also, I couldn't really feel the love between Fran and Joe -- they needed to spend more time together. If these areas were more thoroughly developed, it could be a 4 or 5 star story.Again, as occurred in The Good Dream (excellent book!) the villains got away with too much. Does this author think punishment fitting the crime is inconsistent with inspirational fiction?Excellent writing. I love the metaphors, the analogies, the dialogue. Some groan-worthy jokes, too. Henry, discussing the heat and the drought: \"How dry is it? So dry the tree is bribing the dog for it.\"Great narration by the author herself. Superb performance!"}, {"userName": "Rebecca", "userReviewDate": "Mar 09, 2012", "userURL": "http://www.goodreads.com/user/show/6352428-rebecca", "userReview": "I have seen this book so many times on Goodreads that I decided that I needed to read it. I laughed, I cried and I loved it. There are some very sad parts of the book, and I don't recommend it to readers under 14 because of the subject matter, unless they are very emotionally mature readers. The characters are very real and it tells a story that could have very well happened. I didn't want to put it down once I started reading it. It's good to the very end - and there's a nice little surprise at the end, too. The main character is Jane Gable and the year is 1947 and the location is Morgan Hill, Tennessee. I love books that are written about the south because I lived there and loved it. I can to relate to these stories. I also like stories in which the main character looks back on a significant place in their life and reflects on what happened and what they learned. This is exactly the type of book that this is and the reflections are real."}, {"userName": "Glenda L", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/1660712-glenda-l", "userReview": "This was a very good book ... takes place during the summer of 1947. Jane Gable meets a sharecropper family by the name of Turner ... who by the way are the first black people to setting in Morgan Hill, Tennessee. Then an incident happens that upsets everyone's lives and Jane's family has to make a decision how to handle it ... they do with the help of the \"angels\" of Morgan Hill. This is a feel good book full of warmth, humor and family unity. VanLiere did a wonderful job writing this."}, {"userName": "Sharon", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/2297626-sharon", "userReview": "My daughter, Christa called and told me I could download this book on my nook. She had previouly suggested I purchase Donna VanLiere Christmas books for my library. They have always circulated well, so I quickly downloaded this novel. It did not disappoint!Jane Gable thinks 1947 will be like every other year in Morgan Hill. However, her normal consists of an abusive, alcoholic father, a precocious brother (John) and a pregnant mother (Fran), who is resigned to their less than pleasant life. Jane meets her first African American when a sharecropper family arrives in Morgan Hill, coinciding with her father’s funeral. Although her father’s death dispels a suffocating darkness, it also creates additional financial woes. Despite the disapproval of many in her small Tennessee town, Fran befriends sharecropper wife, Addy Turner. When a suspicious fire takes the lives of Addy’s family, Fran garners her inner strength, taking in, and finally adopting the only survivor, young Milo. Family friends step up to help Fran and her children battle bigotry, poverty, and some dangerous situations. The characters and circumstances are authentic. The storyline is unadulterated for the time, with a forceful lesson on tolerance and true courage. Truly an addictive read!"}, {"userName": "Nandi Crawford", "userReviewDate": "May 14, 2010", "userURL": "http://www.goodreads.com/user/show/661091-nandi-crawford", "userReview": "I have read one other of Donna VanLiere's works, and though this is most definitely a fiction tale, I couldn't help but wonder how things would turn out for this young fella Milo. Best start in the beginning; It starts when Jane and her brother is burying their father (who died at age 29 from alcohol related diabetes) sadly none of the members are sad that he is gone since he was more trouble than he was worth; It also happens to be the same day that Milo and his family, the Turners come to town to help farm the tobacco crop for the Crandles, making them the first Negro family to move into town; Considering the time this happened, 1947, a lot of folks are not happy on that. Yet, Fran and her kids welcome them along with others but some do have something to say on things no matter what. And in time, tragedy hits the Turners doorstep one night with all but Milo perishing; Addy hung in there a bit but asked Fran to take her son, and though she has her own load with another to come, she takes him in in spite of others feeling she shouldn't and the community is forced to take a stand as to whether they let tradition stand or help a little boy who lost his own? lovely novel."}, {"userName": "Marion Marchetto", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/5943898-marion-marchetto", "userReview": "I picked up this book because of the word Angels in the title, knowing nothing about the author or her other works. After the opening paragraph, however, I was hooked. Set in Tennessee during the 1950s, Jane Gable (the 9-year old narrator) tells the story of the day her daddy was buried and how she and her younger brother saw their first black family. Through humorous anecdotes of life in the South, we learn of the contempt of some for the 'colored' sharecroppers and how far these folks would go to get rid of them. When Milo (the young black child) loses his family in a fire, it is Jane's pregnant mother who takes him in as she tries to keep a deathbed promise to Milo's mother. Through trials and tribulation, Jane's mother stands firm in her resolve but it is Jane herself that pushes the town to action when she refuses to attend school because Milo isn't allowed into an all-white school. What happens after that is purely heartwrenching and heartwarming at the same time. A captivating read that will have some reaching for the tissue box."}, {"userName": "Linda", "userReviewDate": "May 23, 2008", "userURL": "http://www.goodreads.com/user/show/797373-linda", "userReview": "This is a great book about race relations. It was a very heartwarming and sweet story where the goodness of humankind triumphs!"}, {"userName": "Natalie", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/1802409-natalie", "userReview": "If you like southern writers, and stories of the Jim Crow era you might like this book about a little boy trying to fit into a poor, fatherless white family who's adopted him and the struggles the family deals with regarding poverty and racism.There are heart-touching moments with the mother and Milo, the little boy, and with Fran and Joe, some lovely writing regarding Henry, quite possibly the biggest saint in Morgan Hill.But there was also some editing that needed to be done prior to publication, for example, the friendship isn't built up long enough between her and Addy in the beginning before Addy dies, so we don't feel the loss of Addy as much as we need to feel to carry the gravity of Fran's decision whether or not to keep Milo. The plotting drags midway--too much emphasis is put on the \"Will Milo stay or go?\" when another plot point OR speeding that segment of the novel up would have kept it from dragging.Also, I would have liked to see the love relationship between Joe and Fran develop more. By chapter 8, the pacing was dragging so badly that I skipped to the end and read the last 10 pages and epilogue.The characters were sweet, and the storyline compelling. But I wonder what the editor at St. Martins was thinking. Sometimes, I think editors are too hard on first novels, then once an author has made them some money, they sort of abandon their job, which is to help authors speed up the pacing when it's dragging. Not that all novels need speeding up or heavy editing--but this one did. Just my two cents."}, {"userName": "Shauna", "userReviewDate": "Aug 17, 2009", "userURL": "http://www.goodreads.com/user/show/1512524-shauna", "userReview": "A good story. As I predicted, I cried throughout the whole thing. I can't stop myself from crying for children put in such sad circumstances with good people who just can't catch a break. It's hard to know what some people mean by a clean read. This story had a truly sweet romance element. But it also had despicable people in it, one of which made a despicable attempt. Not terribly graphic in details, but enough to get my heart pumping in concern for the female character. (Just a warning that you might want to read it for yourself before you decide to let your kids read it.)"}, {"userName": "Ronda  Tutt", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/2216375-ronda-tutt", "userReview": "A very touching story that takes place in Tennessee back in 1947 - A nine year old's story of how her family (white) and another family (black) get through the madness and meanness surrounding them that try keep them from being friends and at last trying to be family when a tragedy occurs. Donna VanLiere once again delivers a great story just like she did with her other book \"The Christmas Shoes\"."}, {"userName": "Heidi", "userReviewDate": "May 10, 2010", "userURL": "http://www.goodreads.com/user/show/3310022-heidi", "userReview": "so glad I read this, and I am so happy that people are if not less judgemental a little less openly judgemental. It was hard to read parts of it because it hurt so much to read about how horribly people will treat others, but then It ended very nice and happy, maybe almost too well depending on the type of reader you are.Great book, I really enjoyed it."}, {"userName": "Abdullah Khalid", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/39041933-abdullah-khalid", "userReview": "Received this book as a gift many years ago but never thought of reading it until now. It's a nice book to read for children, set in post-world war 2 era . The story circles around the theme of racism, care, kindness and most of all the angels in our society. The people who are sent into this world to make it nothing but a better place . A better place for themselves and for others."}, {"userName": "Pamela", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "Delightedly, this is my second Donna VanLiere novel/novella. I'm growing quite fond of her simple, yet humanly perceptive, uplifting stories. This one in particular played upon my emotions and gave me pause. Quite the bittersweet, satisfying read - historically, culturally, and spiritually. \"I can't recall how long we stayed at the creek and listened to Henry's stories, but I remember the laughter and the deep feeling of happiness I had on that afternoon. Maybe that's our way of wanting to remember things - gloss over the bad and replace it with the good - but it never works out that way. Not in real life. In real life you have to take both. There's no way around it.\" Joy and Sorrow. Life and all its crazy ups and downs. More important than how we come into this world or pass from it, is the little dash between birth and death. Feisty nine-year-old Jane Gable comes to understand just how true this is. Life is what we make it. A person doesn't have a say in the circumstances they're born into. Nor can anyone control life's conundrums. From a relatively young age onward, however, we can choose our actions, reactions, emotions and perceptions. And we can choose our friends.\"Sometimes it's just nice to be with somebody and not fill up every space with a whole lot of talk.\"Jane's mother is strong, kind, and resilient. Being a young widow with children, weakness isn't an option. It's a hardscrabble life, living in a small, tobacco-farming town in eastern Tennessee; despite being nineteen-forty-seven, electricity and indoor plumbing are luxuries. But with the kindness of friends and family, they make do. And for the most part, life is good and relatively peaceful. Until tragedy rocks their small town. Then peace goes up in flames. Jane's mother fans the flames by choosing to keep a controversial promise to a dying friend. Some people hail her choice as neighborly and noble. Other people, are tight-lipped and cold-shouldered. Sadly though, others react viciously from ignorance, prejudice, hatefulness, and orneriness. It will be a summer Jane will never forget. A defining period on the 'dash.' Family - Friendship - Love - Compassion - Culture - Honesty - Faith. A bittersweet, beautiful story. You might need a box of tissue with this one. It's not a tearjerker in the extreme. There are moments of snickers and snorts. Little miss Jane is quite a spunky character.If you enjoyed reading Fireflies in December and/or Velva Jean Learns to Drive and/or novels by Susan Meissner, you'll probably enjoy this book also. A quick, uplifting read of substance. Perfect for the holiday season. Four **** Quick, Quaint, Purposeful **** Stars"}, {"userName": "Buddybearr", "userReviewDate": "Oct 18, 2013", "userURL": "http://www.goodreads.com/user/show/23437129-buddybearr", "userReview": "I have read most or all of Donna VanLiere's Christmas books. This is not one of them. Donna really dealt with the issue of racism back in the 40's and 50'sDonna has a wonderful way of making her story characters so real, three dimensional, flawed but hearts that can be filled with courage, caring, compassion and willing at all costs to stand up what they believe. From the first page of the story, I was in love, in awe, connected to each character. Small town, poor in things, but rich in the good friendships, love and care that a tight community can provide. With that smallness sometime comes minds that are set in their ways, even if in the wrong ways, what has always been is the rule, or is it? With this story, the rules are tested, stretched, when a black family moves in. Fran is a woman of no means, abused by her husband, struggling to be the mom she wants to be to her two children, and then tragedy strikes, and she is given the opportunity to grow beyond what even she believes herself capable of. That is where the story completely captured my heart, as we see a mom, a wife, a true friend persevere to do the right thing. Life is not an easy journey, but this book shows that we can accomplish things that are incredible, we can bear through the pain, and change people's lives, as these characters do, for a lost little boy named Milo. It is an inspirational story that should not be missed. Wisdom, perseverance, inspiration, all lie within the story of survival in a small Tennessee town named Morgan Hill."}, {"userName": "Dawn", "userReviewDate": "Jan 19, 2016", "userURL": "http://www.goodreads.com/user/show/1383959-dawn", "userReview": "OMG! I loved this book! I really enjoyed all of VanLiere's Christmas themed books, but this book has moved up to the top of my list as my favorite by this author. Sometimes when I read a book that has moved me emotionally, I become confused that a book like this has gotten so little attention. A sweet and moving story like this would make a wonderful movie. This is also a book that would be a good recommendation for students to read. If you loved \"The Help\", \"Mudbound\" or \"Calling Me Home\", then this similar themed story (race relations in the South) should be on your TBR list.It was not far into the story (Chapter 3) before tragedy struck. I was shocked and heartbroken by the quick turn of events. This tragedy ended up bringing out the best in some of the residents of Morgan Hill. These residents were the true Angels of Morgan Hill. You will be moved by the struggles and tenacity of the Gable family. Fran Gable is a strong character that I had sympathy and admiration for. The decisions she had to make for her family and others must have been hard choices for a woman in 1947, but she was strong even when she seemed to be at her weakest moments. Also, the Epilogue was one of the best I have ever read in a book. The ending jumped over 40 years into the future, but it wrapped up the story in a way that gave a fitting ending to all the characters. I highly recommend this book!"}, {"userName": "Katrina Burchett", "userReviewDate": "Aug 03, 2008", "userURL": "http://www.goodreads.com/user/show/1393133-katrina-burchett", "userReview": "It's 1947 and the Turners (Willie Dean, his wife, Addy and their children, Milo and Rose) are the first black family to move to Morgan Hill. The Gables (Fran and her children, Jane and John) are kind, hard-working people who don't have much. Despite the disapproval of her friend, Margaret, Fran becomes friends with Addy Turner. Tragedy strikes and Fran makes a promise to Addy that she intends to keep no matter what Margaret and other narrow-minded, prejudiced people in town have to say about it. Difficult circumstances cause Fran to question her choice for a time, but she knows that although change isn't always easy, God and His angels are always around. To have to read the words \"nigger boy\" numerous times was bothersome, but it wasn't unexpected. I'm just glad there were parts in the story that made me giggle. As a whole, The Angels of Morgan Hill was a good read, and the epilogue was touching."}, {"userName": "gurpreet kaur", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/1391376-gurpreet-kaur", "userReview": "My first by Donna Vanliere, more shall definitely follow. I like her style, quite like some other writers from the Southern part of the US. It reminds one of 'To Kill a mocking bird' and 'The Help' and yet is distinctive and interesting in its own way. Touching .... moves one to tears many times. The righteousness and innocence of children, the struggle and triumph of goodness and humanity are heart warming indeed. One is hooked on to the book right from the beginning and then it stays and lingers on in ones mind even after it ends. I believe there is a sequel to it and It does go up on my 'to read' list."}, {"userName": "Julianne", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/797803-julianne", "userReview": "This is a wonderful book! It was hard. But this is a wonderful book!The setting is the small southern town of Morgan Hill, Tennessee. It’s 1947, “the year everything changes”. A black family moves in. Everyone in town has to decide how to deal with this fact.The book ends with a funeral. I believe that was my favorite part.Here’s a quote to remember. It was posted on the side of the cash register in Henry’s general store. “Character is found in how you treat people who can’t do anything for you.”This is a wonderful book! Fairly short, and I highly recommend it."}, {"userName": "Susan Coster", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/6332139-susan-coster", "userReview": "This short little book moved me to tears at the end. Set in rural East Tennessee, 1947, Jane Gable's life is changed forever when a young black family moves to town. Tragically, they are lost in a suspicious fire, and only, six-year old Milo lives. Fran Gable then has to make a decision whether to keep her deathbed promise to Milo's mother or let him move in with a black family. Milo decides. Read this book in (2) nights. Pick it up!"}, {"userName": "Cheryl", "userReviewDate": "Dec 27, 2009", "userURL": "http://www.goodreads.com/user/show/1116186-cheryl", "userReview": "A very gripping story told through the eyes of a girl, starting in 1947 when she was nine years old. The day her abusive alcoholic father was buried she sees her first black person. Her world is full of strong wonderful characters, and neighbors who look out for each other. This master story teller has hit the bulls eye, showing us that even in our darkest hours, we are never truly alone."}, {"userName": "Vickie Fetterman", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/28430840-vickie-fetterman", "userReview": "Beauty in wordsEverything about this book spoke to my heart. I am almost 60 and am an avid reader. One week ago I discovered this author and have read two of her books. The writing is simply beauty in words. The toils, the friendships the strong women who have to make difficult choices. I have enjoyed every line and am blessed by the stories!"}, {"userName": "Sarah", "userReviewDate": "Dec 12, 2017", "userURL": "http://www.goodreads.com/user/show/11531941-sarah", "userReview": "Angels within reach in Morgan Hill. 1947 was the year that forever changed a life of a family. A black family moved to their Tennessee town. The only family of color in the town. Racism at the start. A horrific tragedy that lead to an act of compassion. That also lead to fear and faith. Another outstanding book by Donna VanLiere that I just couldn't put down."}, {"userName": "Stacy ", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/45226510-stacy", "userReview": "This was a very good read. An AA boy is raised by white people because his mother/father /baby sister where burned in a house fire because the a certain white man in town did not want them there. The story tells how he came to live with a white women and her child."}, {"userName": "Joe Keefhaver", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/64611762-joe-keefhaver", "userReview": "I found this book very readable. The setting is rural Tennessee in the years immediately after World War II, and I could relate to the way of life in many respects. The evil of racial prejudice is addressed in a compelling manner."}, {"userName": "Judy-Sug", "userReviewDate": "Jan 17, 2009", "userURL": "http://www.goodreads.com/user/show/1863543-judy-sug", "userReview": "This is a story that takes place in the late 40's about a family in a white southern town. A black family moves in but a fire wipes out all but one young boy. The Gable family takes him in. The story tells about the trials and tribulations of this family decision."}, {"userName": "Olivia Sparlng", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/20107366-olivia-sparlng", "userReview": "When a book can make you feel emotion and tears come you know it's a good book! I can't fully say everything I want without spoiling it. All I can say is WOW! I love this book and is on my \"read again\" list. I haven't felt like this about a book in a very very long time!"}, {"userName": "Mitch Cardella Trudel Du Mond", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/10117135-mitch-cardella-trudel-du-mond", "userReview": "very good book"}, {"userName": "8WittkopAlexis", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/61616235-8wittkopalexis", "userReview": "This is very emotional book that will leave you feeling shocked, sad, scared and most of all happy."}, {"userName": "Jordan Theune", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/11711785-jordan-theune", "userReview": "When I read \"The Good Dream,\" I thought it was an incredibly touching story. Naturally I decided that I wanted to see more of what Donna VanLiere was writing, so I chose \"The Angels of Morgan Hill,\" since it was a sort of prequel to the book I loved so much. Though I enjoyed seeing familiar characters from \"The Good Dream\" and delving more into who they were, \"Angels\" did not deliver in the way I had hoped.\"The Angels of Morgan Hill,\" like \"The Good Dream,\" is a story about finding happiness after tragic circumstances. In this novel, a young black boy loses his family and is taken in my a widowed white woman, Fran, and her children. As to be expected in a small-town state of mind like Morgan Hill, the rest of the white community is in complete opposition with the boy, Milo, living with a white family. Poor Milo broke my heart. It was so difficult to see the way that he was treated because of the color of his skin. So many people in Morgan Hill didn't think it would be possible for a black child to fit in with a white family, but Fran--burdened by a deathbed promise--was determined to do what she could for Milo. Occasionally this book reminded me of \"To Kill a Mockingbird.\" It very much held the vibe of, \"Hey, we're good white people, and of course we aren't actually racist............... but a BLACK person involved with white people? Oh, the scandal! It's wrong, just wrong, and God says so too!\" That's the kind of thing that disgusted me with TKAM, and it gave me similar feelings here too. Though, I do think that VanLiere was trying to show her readers that that was NOT the way to treat people.Though I did like the characters, I didn't feel like I ever really got to know them the way I anticipated I would. They didn't appear fully fleshed out, and I didn't think the relationships between key characters (ex. Milo with anyone; Fran with Milo's mom) were believable. There wasn't enough depth or story buildup for me to feel attached to anyone or any relationship.All things being said, however, I liked \"Angels\" well enough. It was a laid-back read, easy read, and I enjoyed being able to read something that revolved around a heavy topic like race relations. While this by no means is on the level of \"The Good Dream,\" it was a decent book, and I certainly didn't hate it."}, {"userName": "Tracy", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/1263610-tracy", "userReview": "A glimpse into how one small town in the South handles the arrival of a black family. The characters all had their struggles, but most of them managed to become better because of them. There were many moments where I cried because of the events in this book. Its messages of love and overcoming tragedy will stay with me for a long time."}], "description": "The Angels of Morgan Hill (Women of Faith Fiction)", "title": "The Angels of Morgan Hill (Women of Faith Fiction)", "url": "http://www.goodreads.com/book/show/279557.The_Angels_of_Morgan_Hill", "average": 3.98, "cover": "https://images.gr-assets.com/books/1440975231l/279557.jpg", "reviews": 271, "authors": [{"url": "https://www.goodreads.com/author/show/23722.Donna_VanLiere", "name": "Donna VanLiere"}], "type": ["Fiction", "Christian Fiction", "Historical", "Holiday", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/279557.The_Angels_of_Morgan_Hill", "http://www.goodreads.com/book/show/8817168-the-angels-of-morgan-hill", "http://www.goodreads.com/book/show/5944675-the-angels-of-morgan-hill", "http://www.goodreads.com/book/show/1098437.The_Angels_of_Morgan_Hill", "http://www.goodreads.com/book/show/42172.The_Christmas_Shoes", "http://www.goodreads.com/book/show/307109.The_Christmas_Blessing", "http://www.goodreads.com/book/show/13033665-the-good-dream", "http://www.goodreads.com/book/show/307143.The_Christmas_Hope", "http://www.goodreads.com/book/show/6649185-the-christmas-secret"]}