{"ratings": 1573714, "userreviews": [{"userName": "Christopher", "userReviewDate": "Aug 13, 2007", "userURL": "http://www.goodreads.com/user/show/277180-christopher", "userReview": "I really disliked this book. I dislike it in the way that I dislike a great deal of modern self help books. Their basic message is that if you want something to happen, you need to want it as hard as you can, without caring about anything else, not allowing yourself to doubt it, or let criticisms will get in the way then it will happen.I disagree with this notion, not only because it is false, but because it is bad.Just because we desire something, does not make it good. This idea of 'following your heart' is often wrong. Who are we to be the arbiters of truth? Why should our hearts be sources of information that go beyond logic, doubt and reasoning? Haven't we all desired things that have turned out to not be in our best interest, or to be harmful to others? Andrew Jackson was a man known to have a lot of integrity. He was always 'true' to himself and followed his heart. Andrew Jackson is the man who initiated the 'Trail of Tears'. Moving Native Americans from their homes and into reservations. Next, this idea of not letting ourselves doubt or consider doubts. This is a terrible and dishonest way to live. If we don't consider doubts, and entertain them often, then we are deliberately blinding ourselves. Deliberately making ourselves ignorant. If someone doesn't give serious consideration to the idea that they may be wrong. Give serious thought to why they believe what they do, and that perhaps those who doubt them may be correct, then they are behaving in a dangerous and dishonest way.Not giving heed to the concerns doubts and criticisms of others is something I believe is a major fault in modern society. Often, people fail to recognize the needs of the group and the community. We place so much emphasis on the needs and rights of the individual. This causes people to focus so much on themselves to the detriment of others around them. At times, it can be beneficial to go against the group, but one should first give serious consideration to the groups concerns.According to Ideas like the Alchemist, groups like, the Westboro Baptist Church,(godhatesfags.com) should be seen as American heroes. These are people who take a totally irrational stance, and stick to it as hard as they can in complete defiance to the views of everyone around them."}, {"userName": "Bill  Kerwin", "userReviewDate": "Jan 08, 2015", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "A good parable--like \"The Prodigal Son\"--should comfort the afflicted and afflict the comfortable. The problem with this little book is that it does precisely the opposite.Coelho's message--and, boy, is this a book with a message--is that each of us has his own Personal Legend, and that if we recognize that legend and pursue it sincerely, everything in the Universe (which is after all made up--wind, stone, trees--of the same stuff we are) will conspire to help us achieve it. Corollaries: 1) people who don't recognize their legends are never happy, 2) people who fail to realize their legends are afraid, and 3) people who refuse to pursue their legends, even when they know what they are, are both unhappy and afraid. (I admit I've left out a nuance or two here and there, but not many. There aren't more than three or four nuances in the book.)I fear that the result of taking such a message seriously will be to make the successful even more self-satisfied, the narcissistic more self-absorbed, and the affluent more self-congratulatory. At the same time, those who are unfortunate will blame themselves for their bad fortune, those who lack self-esteem will lose what little they have, and the poor will see--no, not God, as the beatitude says, but--the poor will see they have only themselves to blame.Perhaps I am being too harsh. I can see how a few individual young persons, hemmed in by parental expectations and seeking their own paths, may find enough hope and courage here to help them venture forth. But I am convinced the damage done by books like this--like The Secret, The Celestine Prophecy, and anything ever written by the late Dr. Wayne Dyer (or, for that matter, anything he may ever choose to channel from beyond the grave)--is far greater than the little good they may achieve.If you like parables, don't read this book. Go read a book of Hasidic tales collected by Martin Buber, a book of Sufi stories collected by Idries Shah, or a book of parables and sayings by Anthony de Mello instead.Or then again, you could just try Jesus. Jesus is always good."}, {"userName": "Sarah", "userReviewDate": "Aug 22, 2007", "userURL": "http://www.goodreads.com/user/show/80444-sarah", "userReview": "I feel like everyone LOVES this book, but I was kind of underwhelmed. I know that translation affects the quality of writing, but I could not get into this writing style. At all. I felt like it was totally affected and contrived. He was going for this \"fable/parable\" style, but it seemed to fail miserably. The parable-like quality was totally contrived, and I thought the \"moral\" was pretty stupid. Moral: everything you want and need is close to home. Take chances. Follow your \"personal legacy.\"Then....there was a supernatural element which was just plain dumb. Granted, I am not religious. I think god-fearing people get more out of this bc they can take that leap of faith, excuse the phrase. If this was supposed to be a story of magic, I may have been into it. But it was supposed to be a simple story of knowing yourself. And I think, philosophically speaking, when you truly know yourself that is when you truly realize your destiny. Why do you need supernatural forces to convey that message? This was about realizing your destiny, or \"personal legacy.\" It could have been done without the hocus pocus, and, yes, the cheese. In short, the book attempted to be deep and failed. \"Speaking with the wind and the sun\" and \"being a shepherd\" and getting over \"personal hardship\" all as part of a transparent \"higher plan\" (read: personal legacy) doesn't make a plot deep. A character simply called \"boy\" and short sentences doesn't make a story a fable. Learning from your flocks and from nature doesn't make a character inexplicably wise. I really got nothing out of this book.It is short though. The book came very highly recommended. Read it to judge the hype for yourself. After all, a whole nation, including Bill Clinton (who I'm into), thought it was a touching account that personally changed them. Then again, this is the same country who thought The Celestine Prophesy was worthwhile. Gag."}, {"userName": "Lujayn Alyamani", "userReviewDate": "Aug 01, 2009", "userURL": "http://www.goodreads.com/user/show/2391622-lujayn-alyamani", "userReview": "كلّ شيء مكتوب !ما إن انتهيت من قراءة هذه الرواية حتى أحسستُ أن الدنيا سكتت ، و العالم سكت و أنني أريدُ أن أسكتُ باقي عمري .. أتأمل الحياة .. لعل روح العالم تغمرني فأفلسف الحياة كما شاء لي قلبي مليئة هذه الرواية بالرموز و الحكم و التراث و الأخلاق بل وحتى الآيات الإسلاميةتحسّ و أنت تقرؤها برياح أندلسية تلفح فكرك ، تجعلكَ تبتسم بين حكمة و أخرى ببساطة القدر ، و تعقيد البشر .. بعمق المعاني ، و سطحية الفهم هذه الرواية تجسّد القدر و الحكمة في أسمى معانيها ، كما نؤمن بها تمامًاأحببتُ حكمها جدًا \" كيف يتحدّث الكون لغة واحدة هي الحب ، العمل ، متعة الهدف و كيف نتعلّم تقديس الحياة من حولنا على بساطتها، والتفكّر في كلّ أحداثها على أنّها منحٌ و إشارات يلقيها الله في طريقنا لتقودنا نحو ذواتناو مجدنا و كيف أن الكنز قريب جدًا جدًا من أحدنا كما كان قريبًا عند شجرة الجميز التي نام تحتها سانتياغو أو الفتى - كما يسميه الكاتب - إلا أن العمل من أجل الحصول و الجهد المبذول و التعب المضني في سبيل الوصول.. كان هو الغاية .. و هو سرّ الوجود و \" الإنجاز العظيم \" فما معنى الكنز إن لم تستحقّ الحصول عليه !! أحسستُ بالقرب الشديد من جوّها ، صورة الراعي ، و الخيميائي .. إكسير الحياة والإنجاز العظيم ..روح العالم و الأسطورة الشخصيةحقًا ، لقد خلق كلّ منا لـ يحقق أسطورةو الحياة لا تمنحُ الفرص إلا للراغبين"}, {"userName": "Marte Patel", "userReviewDate": "Sep 22, 2007", "userURL": "http://www.goodreads.com/user/show/24126-marte-patel", "userReview": "Utter drivel. The book was badly written, righteous, condescending, preachy, and worst of all, the ending was morally questionable. All the fables and stories are stolen from elsewhere, religious ideas and spirituality are badly mixed, and everything is so obvious.The book harps on about tapping into the Soul of the World, the Language of the World, about your one true path and other nonsense. The basic idea is that if you really want something and \"listen to your heart\", the whole universe will help you achieve it if you only look for omens. A questionable idea in a world where people no longer want to work hard and achieve independently.It reads like a really bad self-help book written for 8 year old children and disguised as a symbolic parable. I read a lot of books and I can safely say this is the worst book I have ever read. It's only saving grace was that it was mercifully short."}, {"userName": "Clint", "userReviewDate": "Aug 20, 2007", "userURL": "http://www.goodreads.com/user/show/138926-clint", "userReview": "I hate this book so much. I used to work at a hippie vegetarian restaurant where everyone raved about it, so I should have known what a disaster it would be. Writing in the style of a fable does not convince me that what the author says is true or profound, this just sucks all around, and people who describe it as magical or inspirational are probably dudes I will not be having a beer with anytime soon. This guy, he's probably going to get a Nobel one day, too."}, {"userName": "Warwick", "userReviewDate": "Dec 20, 2012", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "The problem with this book is not just that it's bad, which it certainly is, but that there are so many people out there who want to corner you at parties and tell you how it's totally changed their lives. In a way you might as well read it just so you can see how feeble-minded they must be to get any kind of philosophical nourishment out of this inexhaustible stream of clichés. The profound lessons you'll learn from this book amount to nothing more than several variations on the theme of \"only the very ugly is truly beautiful, only the very stupid are really intelligent, only black is white, only up is down\" etc etc.The writing is too simple to be really bad, but it's the content that gets you. By the end of the book you'll want to track down the philosopher's stone yourself and carefully beat Coelho to death with it."}, {"userName": "Lamski Kikita", "userReviewDate": "Aug 19, 2008", "userURL": "http://www.goodreads.com/user/show/1439240-lamski-kikita", "userReview": "\"when you really want something, the whole universe conspires in helping you to achieve it\"This book has crossed the boundaries of books, and has taken a life of its own, creating a movement all around the globe.Santiago's journey and spiritual quest, the people he meets, the dreams he has, the omens he encounters, and the nature he speaks to, are all things that we can relate to..things that we've either forgotten about or simply dismissed as childhood fantasies. It is all about finding your Personal Legend and pursuing your dream regardless of any hurdles, and about being spiritually connected to the universe, which is part of us, and part of God. we are all one.Reading this book always sets me back on the right path towards achieving the dreams I have put on hold. We always try to do what everyone expects of us like pursuing a career that you hate just because that is what everyone does. Recognizing my personal legend, being able to talk to the trees, sky, ants, the core of the earth, the air particles, and to my heart, feeling a deeper spiritual connection with everything/everyone that is around me, feeling God inside me, and not being afraid of failing or facing challenges are just some of the few things this book has given me.It is maktub that Coelho writes this book, shares it with the world, and affect so many lives. This masterwork is a legend and a precious treasure."}, {"userName": "Sithara", "userReviewDate": "Dec 22, 2007", "userURL": "http://www.goodreads.com/user/show/551316-sithara", "userReview": "I need to start this review by stating 1) I can't stand self-help books and 2) I'm a feminist (no, I don't hate men- some men are quite awesome, but I am very conscious of women and our place in the world.)Short summary (mild spoilers): A boy named Santiago follows his 'Personal Legend' in traveling from Spain to the Pyramids in Egypt searching for treasure. Along the way, he learns 'the Language of the World' the 'Soul of the World' and discovers that the 'Soul of God' is 'his own soul.'If the statements in quotes above ('personal legend', etc) fascinate you, then you'll enjoy this book. If you think they are hokey and silly, then you'll think this is a terrible book. If you think statements such as \"When you want something, all the universe conspires you to achieve it\" and \"All things are one\" are moving and life-changing, you'll love this book. If such statements have you rolling your eyes, then this isn't your cup of tea.Its not that I find anything wrong with these messages. They are important, but must be balanced with responsibility. In my experience, 'following your dreams' (or personal legend) is not the only way toward wisdom and strength. Is the person who struggles to put food on the table every day for his or her family, consciously realizing that he or she may not be following his or her 'personal legend' any less heroic than some traveler who leaves everything and everyone he or she is responsible for to go on a spiritual quest? Coelho comes close to labeling such people, as losers in life, which I find completely off the mark as some of these people have the most to offer in terms of wisdom.The issue of responsibility is also part of this book's sexism. The main male characters in the novel have 'Personal Legends' - they are either seeking them, or have achieved them, or have failed to achieve them. But Coelho never mentions 'Personal Legend' with regard to women, other than to say that Fatima, Santiago's fiance, is 'a part of Santiago's Personal Legend.\" Thats fine, but what about her own Personal Legend? Instead of traveling to find her dreams, she is content to sit around, do chores, and stare everyday at the desert to wait for his return. This is her 'fate' as a desert women. The fact that women don't have Personal Legends is even more galling considering the fact that according to Coelho, even minerals such as lead and copper have Personal Legends, allowing them to 'evolve' to something better (ie, gold).In the ideal world presented in THE ALCHEMIST, it seems that the job of men is to seek out their personal legends, leaving aside thoughts of family and responsibility, and its the job of women to let them, and pine for their return. Of course, someone has to do the unheroic, inconvenient work of taking care of the children, the animals, the elderly, the ill...If everyone simply goes off on spiritual quests, deciding they have no responsibility other than to seek their Personal Legends, no one would be taking responsibility for the unglamorous work that simply has to take place for the world to run.On the other hand, what if both men and women are allowed to struggle towards their 'Personal Legends,' and help each other as best as they can towards them, but recognize that their responsibilities may force them to defer, compromise, or even 'sacrifice' their dreams? This may seem depressing, but it isn't necessarily. Coelho seems to think that Personal Legends are fixed at childhood (or at birth, or even before) and are not changeable: they have to be followed through to the end, no matter how silly. But in my experience, many people have chosen to adjust, compromise, and even 'give up' on their dreams, only to find that life grants them something better, or they have a new, better dream to follow, a path providing greater wisdom. For me, these people have a more realistic, more humble, more fair, and less cliched vision of the world than Paulo Coelho's vision in THE ALCHEMIST."}, {"userName": "asma Qadah", "userReviewDate": "Mar 15, 2009", "userURL": "http://www.goodreads.com/user/show/2123165-asma-qadah", "userReview": "عرفته أوّل مرة من روايته إحدى عشر دقيقة.. كانت المرة الأولى التي أقرأ فيها قصة أو رواية مترجمة؛ نظراً لعدم وثوقي غالباً في الأدبيّات المترجمة فيما سبق..أنهيت قبل أيام قراءة الخيميائي، شدّني الاسم؛ خاصة أنها في الانجليزية تسمى The Alchemist ولا أدري هل كانت الكيمياء فيما سبق تسمى خيمياء؟تدور الرواية حول راعٍ أندلسي ترك مهنته ليحقق حلماً تكرر مرّتين، زار من بعدها غجرية أوّلت له حلمه ووثقت به حين لم تأخذ منه ثمن تأويل الحلم أو تفسيره إلا بعد تحقق تأويلها حيث عليه أن يسافر من (طيفا) الأندلس إلى الأهرامات عبوراً بالبحر ثم التنقل من مدينة عربية إلى أخرى انتهاءً بالصحراء ثم الواحات..كـ راعٍ؛ كان عليه تعلّم الكثير من الأمور و اكتساب صفاتٍ أخرى لم تعلمه إياها رعاية الأغنام، بدءاً من الصبر و إتقان اللغة العربية و الاعتياد على أجواء الصحراء و السير وِفق أنظمة أخرى..إصرار سانتياغو على تحقيق حلمه رغم تعرّضه للسرقة في إحدى الحانات مما دفعه العمل في محل بلّوريات لمدة عامٍ كامل يمكّنه فيما بعد لشراء عدد كبير من الخرفان، لكنه تنازل عن ذلك في مقابل تحقيق حلمه و هو الحصول على الكنز المدفون عند الأهرامات.. المضحِك في القصة أنه كان على الراعي العَودة إلى حيث كان، إلى طيفا ليجد الكنز مخبّأً في نفس الدير الذي نام فيه يوماً و راوده الحلم!تدور كذلك القصة حول علاقة الإنسان بربه و مدى إيمانه و يقينه بـ”ذاته هو” و يقينه بالله و بالإشارات التي يرسلها للعبد.. جعلتني الأحداث التي دارت في القصة على مراجعة حياتي و الرياح التي هبّت عليها.. لوهلة؛ شعرت كم أنا ساخطة على حياتي فيما سبق! تساءلت عن معنى الصبر، الإيمان بالقضاء و القدر، التسليم الكامل لله!.. كلها معانٍ كانت خافية عني في الشهور الماضية، هذا إذا ما اعتبرت نفسي كثيرة الشكوى و التذمر سواء من وظيفتي أو الحياة أو أطفالي.. المرة الوحيدة التي شعرت فيها براحة نفسية عميقة حينما كنت في محنةٍ كادت أن توقف قلبي خلال شهر فبراير، لم أكن أعرف ماذا عليّ أن أفعل حينها و لم أجد أمامي سوى الاستسلام لقضاء الله، أذكر أنني دعَوْت حينها “اللهم سلّمت أمري لك أنت وحدك العالِم مابي و لا مُعين لي سواك اقضِ لي بالخير و رضّني بقضائك” كان (و ما يزال) من المهم بالنسبة لي الرضا بالقضاء و الحكم ذاته..باولو كويلو الرائع جداً احتفل ذات عامٍ ببيع روايته للسنة العشرين و هي النسخة الموجودة لدي، له أقف احتراماً لكاتب استمرّ الآخرون في قراءة كتابه كل هذه الأعوام!!"}, {"userName": "Jennifer (aka EM)", "userReviewDate": "Dec 06, 2008", "userURL": "http://www.goodreads.com/user/show/1393336-jennifer-aka-em", "userReview": "My heart and I chatted, and we agreed, this book was short. My heart thinks it was also stupid, and after spending some time talking to the wind, I came to agree with my heart. Yet, after beginning the journey with this book and despite the words of my heart, something impelled me to continue. Surely it had something to teach me? The book had a lovely cover made of nicely textured stock that felt good in my hands. It offered the added efficiency of a fold-over flap--something that more publishers should make an effort to do, as it makes the use of a bookmark superfluous. But I suppose you need the collateral of winning the Guinness World Record for most translated book by a living author, and selling more than 65 million copies in more than 150 countries as one of the best-selling books in history,* to get that treatment. * my heart cries In my country, we have an expression: one should not judge a book by its cover. In this case, this is especially true. The prose turned out to be not nearly as nicely textured. That is irony. This book knows not of irony. Still, though, I needed to complete my journey. My heart tugged on my sleeve.As I continued my journey, I found that the text inside was set in a pleasing font. I could find no typos, which are always a portent of doom. So I kept going. I found the words that the font expressed were simple and easy to read. As I read them before falling to sleep each night, they neither challenged me nor troubled my dreams. Many people, I believe, enjoy this in a book, in the same way that they enjoy Hostess Twinkies. They are filled up with calories, which causes their bodies to believe that they have been fed a nutritious meal, when in fact their brains are lulled into sheep-like somnambulism. They grow fat and stupid(er) under the illusion that they have received nutrition without ever experiencing the pain of having to cook, and possibly work up a sweat or burn one's fingers.I wondered if this book was possibly dangerous. I wondered what kind of people would be deluded into thinking, within the guise of a poorly written but deviously well-conceived parable, that this book's philosophy was, in fact, Deep and Meaningful Truth. This book, I felt, was perhaps insidiously evil, a force with which I needed to do battle. I did not know which weapon to use, as irony appears to be rendered completely ineffective within a 3-metre radius of this book. Still, irony and a love of absurdity hovered around me as I searched for the true meaning in this book, and why it appears to offer a powerful message to so many.I consulted the Oracle, known across all the lands by many names. She appeared to me in the form of Wikipedia, Queen of All The People's Knowledge. Now, there's an alchemist for you: Queen Wiki can turn knowledge into nonsense and then back again before your very eyes. The perfect Oracle for this book.Queen Wiki turned out to be very entertaining and illuminating in this case. I learned that Joe Jonas and Russell Crowe loved this book. I glommed on to this as an omen that absurdity was lurking close. I interpreted it as a sign that I must continue. Again, I was struck by the irony of that, but turning back to the book, this fleeting insight that might have had a grain of real value was immediately squelched. I sipped some sweet tea from a crystal goblet, and plodded on through the desert of thought that is this book.This, I felt, was the lesson to be learned: in the Middle of the Centre of the Soul of the World, where blank-eyed acolytes are led (like sheep? hmmm) to unquestioningly accept and proclaim as truth the vacuous platitudes spouted by crystal-wearing, self-appointed mystics, psychics, tarot card readers, numerologists, motivational speakers and this author, irony is dead. Absurdity goes unrecognized. Skepticism is turned back at the gates by ill-formed philosophies based on the unwavering power of evangelical groupthink and our species' rather fascinating susceptibility to cognitive bias, or errors in thinking, that cause us to believe as truth that which can actually be scientifically validated as false.This book makes a mockery of spirituality and the search for truth and meaning, under the guise of the easy, anxiety-quelling New Age philosophies that spoon-feed the stupid with Twitter-sized bites of nonsense. Beliefs like, \"good things happen to good people.\" \"All is right in the end. If it's not right, it's not the end.\" \"God doesn't give you anything you can't handle.\" To be shelved between \nthis\n and \nthis\n to gather dust and never to be read again. Do not trade or give away--you'll just be spreading the bullshit.My heart will go on."}, {"userName": "Amanda", "userReviewDate": "Jun 07, 2008", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "***spoilers and bitterness ahead--be forewarned**I'm not sure that I can capture my utter disdain for this book in words, but I'll give it a shot. I read this book about three years ago and just had to re-read it for book club. It was a steaming pile of crap then and, guess what?, it's a steaming pile of crap now. The main reason I hate this book: it's trite inspirational literature dressed up as an adventure quest. You go into it thinking that it's going to be about a boy's quest for treasure. If you read the back, there are words like \"Pyramids,\" \"Gypsy,\" \"alchemist.\" Turns out, this is just The Purpose Driven Life dressed up with a little fable. It's Hallmark Hall of Fame territory set in an exotic locale. Which pisses me off to no end as I normally try to dodge that sort of thing, but here it is masquerading as the type of book I normally like. It's cliche, didactic, and poorly written. Just as with Aesop's Fables, there's a moral to the story. And Coelho keeps backing up and running over it just to make sure that we get it (and he capitalizes important key words necessary to understanding it, lest we overlook their significance). If there's one thing Paulo Coelho can do, it's flog a dead horse. Essentially, boy thinks he's happy in life. He's a shepherd who gets to travel the world, has all of his needs met, and owns a book which he can always trade for another book when he goes to market. What more can a boy need? Boy is then told by a mysterious stranger that he's not happy at all. Why not? He has failed to recognize his Personal Legend. Everyone has a Personal Legend, which is life's plan for you. However, most of us give up on our Personal Legend in childhood. If you are fortunate enough to hang onto and pursue your Personal Legend, then The Soul of the World will help you obtain it. All of nature conspires to bring you luck and good fortune so that you can fulfill your destiny, whether it's to be a shepherd on a quest for treasure at the pyramids, a butcher, a baker, a candlestick maker, or, one would assume, a prostitute, drug dealer, or porn star. Hey, we're all fate's bitch in The Alchemist. But I digress. Boy seeks out his Personal Legend and finds it's a long, hard road to obtaining what you want in life. But with faith, perseverance, and just a little goshdarnit good luck, the boy learns to speak the Language of the World and tap into The Soul of the World and fulfills his Personal Legend. And what does he learn? That what he sought was back home, the place he started from. Oh, silly boy. So, in summation, here is what you should learn from The Alchemist:1) Dream. And, while you're at it, dream BIG2) Follow your bliss3) Don't be surprised if you find obstacles in your way, but you will overcome4) It's good to travel and encounter people from other cultures5) What we most often seek is right in front of us, but sometimes we have to leave home to realize itTo all of these important life lessons, I can only say, \"Well, no shit, Sherlock.\" If Coelho knew anything about alchemy, he would have been able to transform this crap into gold. Alas, it's still crap. Cross posted at This Insignificant Cinder"}, {"userName": "Mohammed Arabey", "userReviewDate": "Oct 27, 2012", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "~~~ T h e ~ A l c h e m i s t ~~ الـخـيـــميائـــي ~~~Half-full Cauldron of Clever Story قدر به قصة محكية ببراعة2 Measures of Legends of Wisdom مقدار من أساطير حكيمة1 Bundle of Self-Help Motivations حزمة من دوافع تنمية ذاتية1 Measure of Spiritual Experiences مقدار من التجارب الروحيةSome Drops of Love ~~~ قطرات من الحـــــبA Bunch of Magic ~~~ حفنة من الســـحر½ Cub of Philosophy ~~~ مقدار من الفلسفة¼ Scoop of Thriller ~~~ ربع مغرفه من الأثارةMix it all together in the Cauldron..أخلطهم جميعا في القدرWith Drops of an Oasis' Springs Water مع ماء من ينابيع واحة صحراويةAnd Bunch of Golden Desert's Sands و حفنة من رمال الصحراء الذهبيةLet it all Stir by The Desert's Winds دع الخليط يقلبه رياح الصحراء ِAnd Heat up by the Heat of the Sun rays ويسخنه حرارة أشعة الشمسِAnd Then you'll got the Treasure... وستحصل عندها علي الكنزA Gold,even the Philosopher's Stone ذهــب، بل حجر الفيلسوفA Great Charming Story, A brilliant literature قصة ساحرة، أدب لامعThe Alchemist --------- الـخيميــائـيBy the Master --------- للاستــاذPaulo Coelho --------- باولو كويللومحمد العربيفي 24 اكتوبر 2013قراءه من 25 اغسطس 2012الي 2 سبتمبر 2012©The Cauldron picture from http://www.pottermore.com"}, {"userName": "Jayson", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/22106879-jayson", "userReview": "(B+) 78% | GoodNotes: Written simply and scripture-like, its reads at times too much like a children’s fable, but picks up steam near the end."}, {"userName": "Nayra.Hassan", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/44531801-nayra-hassan", "userReview": "افق !!استيقظ ..انتبه..يفوتك الكثير رواية قصيرة وفاتنة .. تحثك على عيش حياتك هنا والان...تذكرك مرارا : ان الرحلة هي الهدف و ليست مجرد وسيلة..هناك من يفضلون قضاء الرحلة نائمين. .و هناك من يفهمون مبكرا..دائما ينبهنا باولو برفق ..ان سر الحياة في القطار و ليس المحطات..على عكس ما هو شائع. ..قراتها بالانجليزية و كنت اود لو تعلمت البرتغالية من اجلها ..هناك شيء من المباشرة و البساطة..و لكنها صارت من الكلاسيكيات ..ففي مرحلة من حياتك سنجد نفسك تقرأها حتما  ..و لكن ..ساظل دائما اتذكر ملعقة الزيت التي تجول بها في القصر ..فلا تشغلك الملعقة عن مراقبة ما حولك من روائع و لاتذهلك الروائع عن مراقبة الملعقة ...وتلخصه لغتنا الراقية في عبارة \"لا افراط ولاتفريط\".."}, {"userName": "Mohammed  Ali", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/48402276-mohammed-ali", "userReview": "الرواية التّي سبّبت .. ظاهرة الإحتباس الحراري :\nقد يبدوا العنوان غريبا نوعا ما .. ولكن صراحة أحبّ العناوين الغريبة \" الرجل الذّي حسب زوجته قبعة \" ، \" انتحار حمار \" و عناوين أخرى غريبة يزخر بها عالم التأليف والكتب، ولكن ما سبب اختياري لهذا العنوان ؟حسب وكيبيديا هذه الرواية تمّت ترجمتها إلى حوالي 67 لغة .. وبيع منها 65 مليون نسخة في 150 بلد، وفي مقال آخر .. يقولون أنّه لصناعة طن من الورق نحتاج إلى قطع 17 شجرة طول كل واحدة منها هو 11 متر .. هذا بالإضافة إلى عمليات التصنيع والنقل وما يصاحبها من انبعاثات غازية . سيقوم محبّوا الرياضيات والإحصائيات بحساب عدد الكتب في الطن الواحد ثم عملية ضرب هذه الأطنان في عدد الأشجار اللازمة لصناعتها .. ويضيف إليها تقديرا نسبيا لكمية الإنبعاثات الغازية أثناء عملية النقل والصناعة .. ثم يقوم بتقسيم الناتج على عدد البلدان التّي تمّ فيها طبع أو بيع هذه النسخ . لنجد أنّ هذه الرواية بشكل ما أو بآخر كانت سببا في ارتفاع درجة حرارة الأرض مسبّبة ظاهرة الإحتباس الحراري . في النّهاية .. ماذا عسانا نقول يا كويلهو .. لقد غيّرت حياة البشر بسبب روايتك .. ملايين البشر تغيرت حياتهم بسبب ظاهرة الإحتباس الحراري .. ذوبان القطبين الشمالي والجنوبي بسبب ارتفاع درجة الحرارة أنت السبب فيه .. تغيير الفصول وتداخلها أنت السبب فيه .. الأعاصير القويّة والعواصف المتقلبة أنت السبب فيها .. ثقب طبقة الأوزون أنت السبب فيه .. اجتثاث أشجار غابة الأمازون ( وأنت من البرازيل وتعرف قيمة هذه الغابة ) أنت السبب فيه .. لقد قتلتنا يا كويلهو بروايتك هذه . أخيراا :من الروايات القليلة جدا التّي قرأتها بسقف توقعات مرتفع .. ولكن للأسف خاب ظنّي والسبب فيّ أنا وليس في الرواية طبعا \nعن المراجعة :\n\" I did it my way \" - Frank Sinatra ."}, {"userName": "Lyn", "userReviewDate": "Aug 29, 2016", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "This is either a beautifully written and fable-like illustration of simple and universal truths or a load of crap.I have a bad feeling it’s the later, but then I consider that there could also be a third option.I read once that Sting, when he wrote the classic Police song Every Breath You Take, mixed up a series of banal clichés about love and loss and just put them all together, and so this cool tune has some satire about it. Similarly, the Credence Clearwater Revival song Looking Out My Backdoor, a clunky but loveable country western tune, was actually begun as a facetious parody of slide guitar yokel lyricism. I also think of the comedy / performance art of Andy Kaufman and the constant, uncomfortable tension about what he was doing and why. Was it really so bad it was funny? If it was so obviously corny and insincere, was that not funny? Or was it? Was he really wrestling women and then getting beaten up by Jerry Lawler? That was a joke right?So ...Was Paulo Coelho’s 1988 fantasy / magical realism parable of truths found in nature and subtle messages from God told straight or was there a wink and a nod told with some fun?Now … think about it for a second. The whole “lost gold” theme and the discussions with the alchemist about a supposed elixir of life and “follow your heart” rhetoric. Was Coelho telling this straight or pulling our leg?I have to say that I doubt it, but I did laugh a few times and the over the top syrupy delivery made me wonder, and maybe I liked it better considering this twinkle of a third possibility.I will say that this could go either way. I can absolutely see where someone could find hidden treasure and deeply meaningful messages in the short novel. And I can see someone rolling their eyes and sticking their finger down their throat in a gag gesture.I’ll cast a Cheshire cat smirk and like for another reason."}, {"userName": "Amit", "userReviewDate": "Jun 07, 2008", "userURL": "http://www.goodreads.com/user/show/1214974-amit", "userReview": "There are too many things one can learn from “The Alchemist”. Its all about following your dream and about taking the risk of following your dreams, which is actually so difficult to do and there are very few people in this world who actually do, I mean risk it all, just to follow your heart and your dream. Beauty is, the author is so right in saying that when u decide to follow your dreams the entire universe conspires in your favour which he called as the “beginners luck” and we all have been witness to this beginners luck at one or other point in our lives. Also, he talks about a stage in our journey towards realizing our dreams, where everything just goes haywire and there is everything working against us and it almost takes us to the brink of abandoning everything and just getting back to what was so familiar and comfortable (i.e. our usual daily life which we get used to) this is actually the time when we are being tested for one last time and it means also that we are really close to our objective. The example given was really great and yes nothing new but we forget simple things in our life like \"the darkest hour of the night is just before the dawn\". It is actually true that so many of us just leave the struggle when it gets really tough and the chips are really low, whereas actually we were so close to the objective, if only we would have had a little more patience we would have been there. In one of the episodes he talks about death, yes the fact we always forget, the only reality about our life, it is a constant which is not going to change rest everything is uncertain. There are a lot of us who either think that it happens to others and then there are others, who are so busy running after the materials that they don’t have time to think about anything, leave alone death. Yes, and those who do think about death, mostly fear it, some fear death because of the physical pain attached to it (such people actually fear the pain rather than the death, I am one of them) and there are some who think they do not want to die because its not time yet for them to go. Ironically but true, this decision about timings has thankfully not been left to us. So, how do we get over the fear of death or make it our friend, a companion? And not waste our beautiful life worrying about dying all the time. One of the possible solutions lies in this book, it reads \"if i have to fight, it will be just as good a day to die as any other\". Yes very much right, one would never know when he or she wakes up in the morning that if it was the last day of his or her life and in fact, that day would not be any different from all the other days already spent. So, why not take everyday as the last day of our lives and live it up. Frankly speaking i really know what i am talking about, because I am in a profession which involves a lot of risk and death doesn’t have to look for reasons, it can just spring up from any bush in form of a small little piece of metal called a bullet coming out of the darkness of the night or just a deafening sound from under a culvert that I cross everyday. Here, everyday can be the last day of my life, every meal can be my last, every call to my wife can be the last time I would hear her sweet and loving voice and the kids… Anyways, so what I personally follow is, everyday when I wake up or every time when I move out on an operation, I say to myself \"what a beautiful day to die\" and there on, I just do what I have to and what I have been taught in all these years in the army and go through all the motions and concentrate on the job at hand rather than worrying about my death and I am really at peace with the fear of death. Another beautiful thought which I came across about death was in the novel by the author called \"Confessions of a pilgrim\". I derived from it that death can be visualized as a beautiful person who is always sitting besides us, so close to us that it travels with us wherever we go and it also accompanies us to our bed. Its a beautiful companion, a faithful companion, the only one who will never be unfaithful to us, rest all the companions are just lesser mortals and have been unfaithful at one point or other. Death always stays with us and actually speaking that’s the only companion who would accompany us all through our lives right from the moment we acquired some shape in our mother’s womb to the moment when we would get the vision of that white light and that feeling of lightness when we would finally leave this body also sometimes expressed as \"VASTRA\" (clothes) in the Indian mythology. As per the Indian mythology, the soul never dies, it is indestructible, it only changes a body just like we change clothes. Our soul is a part of God and it goes back to him. We can find the mention of the mighty soul of ours around the last portion of 'The Alchemist' where the shepherd realizes that ultimately it his own soul which is the “hand that wrote all” and his own soul was the part of soul of God. I firmly believe that there is no fiction involved in this story of the shepherd, but this is a true expression of mysteries and realities of our life, which we never pause to discover. There is message that this book wants to convey to us!!! I have never been into writing anything ever in my life, yes not even a personal dairy, but since the time I actually started writing which was just a month back, I realized that if we just write our thoughts as they occur, the resultant has a touch of mystery, because what we wrote with all our heart and soul, sometimes tends to surprise us. We tend to learn from what we ourselves wrote. We never realized that we had so much inside us and we don’t know from where, it all came. “The hand that wrote all”, yes I think its our soul that speaks out, the soul we never recognized, the one we never knew, the one which is part of soul of God…. …All religions have over all the years have preached a man “Know thyself, you will find God”, “look within yourself u will find all the answers”, these words are so common but how many of us actually are ready to pause and give it a try. It may sound crazy, may be the book has a effect that may appear really crazy but I am sure there are some people who would identify with me. May be when Paulo Coelho wrote this book his soul was revealing itself and that’s why some of us can identify with it because our souls are the part of same soul of God, just like his is. May be these lines of his novel were written by the “Hand that wrote all……………”"}, {"userName": "أحمد", "userReviewDate": "Dec 06, 2008", "userURL": "http://www.goodreads.com/user/show/1775679", "userReview": "رواية غيّرت روحي. جربت بعدها قراءة شيء آخر لباولو كويليو فتأكدت أن هذه الرواية هي الوحيدة تقريبا التي تستحق القراءة. أنصح بترجمة بهاء طاهر الصادرة عن دار الهلال بعنوان: ساحر الصحراء.أحمد الديب2007"}, {"userName": "Patrick", "userReviewDate": "Aug 26, 2008", "userURL": "http://www.goodreads.com/user/show/692475-patrick", "userReview": "Timing is everything. If I'd read 'The Alchemist' four years ago, I'm sure I would have loved it. It deals in big, bold pronouncements of 'follow your dreams' et cetera et cetera, and it certainly makes you think about your own life and the pursuit of your own \"Personal Legend\" if you will. But maybe I'm older and more cynical now, or maybe it's not cynicism so much as just seeing a reality that isn't so mystical and black and white as Paulo Coelho's, but in any event, I just wasn't buying what 'The Alchemist' was selling.It's a good, quick read, I'll give it that. I enjoyed myself, and I definitely thought a little bit about my own life in the process, which I appreciate from my literature. And while I was more or less with it for a while, I just couldn't stay on board with an ending that left me saying, \"that's it? Really?\" \nBe forewarned, there will be spoilers after this point\n. The whole book Santiago is in pursuit of his \"Personal Legend\", which he is told is a great treasure found in the pyramids of Egypt. Along the way he befriends many people and makes a great sum of money, while also meeting a beautiful young woman who agrees to more or less be his life-partner, Romeo and Juliet-style (which is stupid in and of itself, but more on that later). It is at this point that he determines he has achieved a greater treasure than any he had ever dreamed of, and would go no further. Beautiful. Cue the music and themes of recognizing treasure in all its forms. Santiago has a wonderful, fulfilling life laid out before him, and would most likely die a happy man by the side of his lovely wife and adoring children, all while living comfortably as village counselor of a beautiful desert oasis. Sounds pretty nice, no?Well, that's where the book lost it's footing. Santiago is urged, coerced even, into continuing to follow his \"Personal Legend\", leaving behind his \"love\" (who, it should be mentioned is a \"woman of the desert\" and so is completely fine being abandoned by her \"love\" and will simply wait and wait and wait for him, whether he ever returns or not) traversing the desert and (bizarrely) evading a hostile army along the way by turning himself into the wind (it makes about as much sense as it sounds). In the end though, Coelho reveals to us that Santiago does, indeed, reach his \"Personal Legend\" in a two and a half page epilogue, where it is shoddily revealed that Santiago's long-sought after treasure is...treasure. Literally. Buried treasure. A box in the sand filled with gold coins and diamonds and jewelry and crowns, and all the other cliche treasure images you can think up. What the hell?So what message are we supposed to take from this book then? Money is the most important thing in the world? Women are objects meant to be seen and valued for their beauty, there to serve you and wait around forever while you go on wild goose chases across continents in search of money? Obviously I'm being facetious, and Coelho intended to say that one should follow their dreams no matter what, even if it transcends a nice, content life, so long as you are in pursuit of a life that would be even greater than you can ever imagine, sacrificing what is good now for what can be great later. But he did so in an extremely simplistic way, and the revelation of the Santiago's treasure being literally treasure was a major disappointment.The thing was, despite his simplicity, the book had a nice message going for a while. If Fatima was Santiago's treasure, that I could have gotten behind, even if it shows a good deal of contempt for the role of women in relationships (beauty being the most important factor in deciding on a mate, as Santiago is struck by her beauty and immediately professes his love; Fatima more or less acquiesces immediately and pledges herself to Santiago no matter what, even if he must travel the desert forever in selfish pursuit of his own dreams, with no regard for her), because that is something intangible that is meaningful and fulfilling, regardless of financial standing. But then Coelho basically goes on to say that that is just a roadblock in the way of real achievement, and that one should selfishly pursue their own dreams with no regard for those closest to them.How a book can go on and on talking about seeing the everyday symbols and omens in life and taking heed of them, presumably leaving metaphors for life all along the way, and then have what was presumably the biggest metaphor of them all, Santiago's treasure, turn out not to be a metaphor at all, but just money? To me, that summed up everything. I suppose Coelho realizes this, as he begins the book with a brief fable about Narcissus falling into the river because he loved staring at his reflection, and the river's disappointment in this, as the river loved gazing into Narcissus's eyes and seeing the reflection of itself. This is a horrible little story implying that everyone is obsessed only with themselves, a sad, empty little thought that Coelho spends 167 pages endorsing wholeheartedly, under the guise of following your dreams.I understand that other people love this book and find it inspiring, and I think I would have felt the same way years ago, when I was just out of college and it appeared I had my whole life ahead of me and a lifetime to live it. I'm older now, and I've found someone who I consider to be a real treasure, and while I still have dreams, I'm not willing to sacrifice the happiness that this life brings me every day in a single-minded pursuit of something that I want for selfish reasons (fame, fortune, etc.). If I was Santiago, I would have never left Fatima in the first place if she truly made me happy, as Santiago claimed she did. Perhaps that makes me a coward in Coelho's eyes, not unlike the Crystal merchant from the story. But it'd also make me not the sad Englishman, whose single-minded pursuit of his \"personal legend\" had cost him all his money, friends, and family and left him alone in an oasis burning lead in a tent in the vain hopes it will turn to gold.I guess what I'm trying to say in this long-winded review, is that this book is all about being selfish and doing what you think will make you happy, regardless of everything else. I can see why that appeals to people, especially those who want to show the doubters and find their own treasure beneath a sycamore tree, but it's sad, in a way. We live in a culture where everyone wants selfish things like fame or money or power, just to satisfy some gaping hole in their own souls, ignoring the real problems that lead to these compulsions in the first place. To me, this book feeds and even encourages that misplaced ideal, and that's a shame."}, {"userName": "Jibran", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/5407952-jibran", "userReview": "If books were pills, Alchemist would be a sugarcoated placebo with no real effect. Let's call it a feel-good homily. I have never read a book as meretricious as this one. Many reviewers have pointed out the problems with this 'celebrated' novel so I'd rather not expend any more words. Suffice it so say that this is a good example of portentous writing that is best avoided if your benchmark is quality literature."}, {"userName": "Lola  Reviewer", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "Preachy, pretentious, and awful portrayal of women."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 02, 2009", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "O Alquimista = The alchemist‬, Paulo Coelhoتاریخ نخستین خوانش: در ماه ژوئن سال 1996 میلادیعنوان: کیمیاگر؛ نویسنده: پائولو کوئیلو؛ مترجم: حسین نعیمی؛ تهران، نشر روایت، 1374؛ چاپ دیگر: تهران، ثالث، 1377؛ در 283 ص؛ شابک: 9646404465؛ چاپ ششم 1379؛ هفتم 1380؛ هشتم 1381؛ نهم 1386؛ شابک: 9789646404465؛ موضوع: داستانهای نویسندگان برزیلی - قرن 20 مترجمه های دیگر از: آرش حجازی؛ دل آرا قهرمان؛ میترا میرشکار؛ سوسن اردکانی؛ مرتضی سعیدی؛ ایلیا حریری؛ ندا نویدنیا؛ هرمینه شبانی؛ بهرام جعفری؛ مریم امیری؛ فرزانه فرزاد؛ مینا حیدری و عاطفه زینلی؛ اسماعیل غفوری ثانی و رضا ابوعطا؛ فریبا ریاضی مظلومی؛ گیسو پارسای؛ شهرزاد فتوحی؛ علی نادری؛ ماکان کیان؛ ناهید ایران نژاد؛ در هزار و یکشب داستانی هست که مردی در بغداد همان خوابی را میبیند که در داستان کوئیلو چوپان اسپانیایی دیده است. در مثنوی معنوی مولانا نیز داستان با شعر آمده است. اما داستان این کتاب: چوپانی اسپانیایی به نام «سانتیاگو» در رؤیای خود، محل گنجی مدفون را در حوالی اهرام مصر، به خواب می‌بیند؛ و به قصد آن رؤیا که آن را افسانه ی شخصی خود می‌خواند، موطنش را در آندلس، رها، و رهسپار شمال آفریقا می‌شود. در آن سفر پرخطر، با مردی که خود را ملک صدق پادشاه سالم می‌داند، و یک کیمیاگر، آشنا و به فاطمه دختر صحرا، دل می‌بندد. همگان سانتیاگو را در مسیر جستجویش یاری، و او را به ادامه ی راه، تشویق می‌کنند. در پایان، سانتیاگو پس از سالها سفر طاقت فرسا، گنج را نه در فرسنگها دورتر، بلکه در همان آغل گوسفندان خویش، در سرزمین خود می‌یابد؛ گنجی بزرگتر که آن را فقط می‌توان در درون جست. دریاچه پرسید: مگر نرگس زیبا بود؟ پریا شگفت زده پرسیدند: چه کسی بهتر از تو این را میداند؟ او هر روز در ساحل تو مینشست، و به روی تو خم میشد. دریاچه لحظه ای ساکت ماند، و سپس گفت: من برای نرگس گریه میکنم، اما هرگز متوجه زیبائی او نشده بودم، من برای نرگس گریه میکنم، زیرا هر بار که به روی من خم میشد، میتوانستم در ژرفای چشمانش، بازتاب زیبایی خویش را، ببینم. ا. شربیانی"}, {"userName": "Saud Omar", "userReviewDate": "May 27, 2009", "userURL": "http://www.goodreads.com/user/show/2317734-saud-omar", "userReview": "تنبيه :في مراجعة الرواية هذه لا يوجد حرق للرواية. في هذه المراجعة يتم استعراض عقدة الرواية الأساسية. كل ما كٌتب هنا بدا لي أنه سوف يجعلك تقرأ الرواية بشكل أفضل. هذه المراجعة كٌتبت خصيصاً لأولئك الذين لم يقرءوا الرواية بعد.***من مدونتي: ثمانون كتابا بحثا عن مخرجhttps://saudomar.wordpress.com***“الخيميائي” رواية عن راعي أندلسي يسافر طلباً لكنز مدفون في مكان قريب من الأهرامات الفرعونية. يقابل الراعي العديد من الأشخاص الذين يساعدونه, أو يلهمونه, أو يقفون ضده, في طريقه للكنز. ويواجه الراعي أيضاً الكثير من المواقف الصعبة, والأفكار المحيرة, واللحظات التي تتطلب شجاعة, واللحظات التي تتطلب بصيرة.رواية مغرقة في البساطة والحكمة .. كعادة كل روايات باولو كويلو ..باولو كويلو أديب برازيلي ولِد في مدينة ريّّو دي جانيرو عام 1947, له روايات عديدة ناجحة, وقبل أن يكون روائياً, كان مخرجاً مسرحياً, وممثلاً, وكاتب أغاني, وكاتب صحفي؛ لكنه قرر في النهاية أن يكرّس حياته للأدب.واجهت رواية “الخيميائي” فشلاً في البداية؛ فلم يوزع منها في أول الأمر سوى 900 نسخة, بل إن الناشر اعتبرها عملاً فاشلاً لدرجة أنه أعاد لكويلو حقوق النشر, بعد ذلك نشر كويلو الرواية عند ناشر أخر لتصبح الرواية حينها الرواية الأكثر مبيعاً في الأدب البرازيلي في القرن العشرين, وتتصدر قائمة الأكثر مبيعات في ثمانية عشرة دولة, ويباع منها فوق الأربعين مليون نسخة في مئة وخمسون دولة, وتترجم لأكثر من ست وخمسون لغة, حتى أنه في عام 2003 ( بعد خمسة عشر عام من نشر الرواية ) كان ترتيب الرواية السادس على العالم في مستوى المبيعات.ورغم أنه عادة يشار لرواية “الخيميائي” بأنها ثاني أعمال باولو كويلو بعد “حاج كومبوستيلا”, إلا أنها في الحقيقة رابع عمل له؛ فالعمل الأول له كان (أرشيف الجحيم)؛ وهو العمل الذي نفذت طبعته الأولى ولم تعاد طباعته حتى الآن, وقد قال كويلو في أحد المقابلات أنه فخور جداً بهذا العمل, وسوف يعيد طباعته في الوقت المناسب. أما بالنسبة للعمل الثاني ( الدليل العملي للفامبيرية ) فقد سُحب لأنه بدا لكويلو أن العمل لم ينجح في إيصال الفكرة المنشودة.المكان الذي تبدأ منه رواية “الخيميائي” هو في جنوب أسبانيا, في سهول الأندلس, بالقرب من مدينة “طريفا” الواقعة عند مضيق جبل طارق, والتي لا يفصلها عن مدينة “طنجة” المغربية سوى 14 كيلو متر, والوقت, الذي تأخذ الرواية فيه مجراها, هو في أوائل القرن العشرين, أو أواخر القرن التاسع عشر؛ ورغم أن زمن رواية, عموماً, غير واضح فيها, إلا أننا نستطيع القطع بهذا الوقت؛ لأننا في بداية الرواية نرى خيميائياً يقرأ قصة ” التابع” ( The Disciple ) للأديب الأيرلندي “أوسكار وايلد”.وقصة وايلد هذه عبارة عن تعديل على أسطورة نرسيس (نرجس) الشهيرة؛ فالأسطورة تقول أن نرسيس أٌخذ بجماله, وكان يتأمل نفسه في البحيرة كل يوم, حتى سقط في البحيرة ومات غرقا. لكن أوسكار وايلد يستطرد بعد هذه النهاية, ويقول بأنه بعد وفاة نرسيس تنزل ربات الغابات لتسأل البحيرة عن جماله, لكن البحيرة تقول أنها لا تعلم عن جماله شيئاً؛ فهي كانت تنظر لجمالها هي في عينيه. في الحقيقة أنه اقتباس رائع جداً من كويلو, وقد ألقى هذا الاقتباس بظلاله على فكرة الرواية, حتى أن أحد دور النشر قد جعلت لوحة “نرسيس” للرسام الإيطالي “كارافاغو” غلافاً لرواية الخيميائي.وفكرة الرواية هي كالتالي:فكرة الرواية تقوم على مبدأ ( الوحدانية ), فكل الأشياء هي تجليات لشيء واحد؛ وكل الكون خلقته ذات الذات, وبالمثل, فإن كل ما نقوم به في حياتنا هو للقيام بشيء واحد, ولإنجاز مهمة واحدة, وتضيف الرواية, أن أيضاً ما نتمناه ونرغب به هو جزء أصيل من هذا الكون ووحدته.الكون كائن حي, له روح, وفيه حياة, هذه الروح تتغذى على سعادة البشر ( وأحياناً على تعاستهم ), ومن ( روح الكون ) يتولّد ما تسميه الرواية ( ألأسطورة الشخصية ).الأسطورة الشخصية هي الواجب الوحيد المفروض على كل شخص, أي مهمته في الحياة, ودائما ما تصير هذه المهمة هي حلم وطموح الإنسان, ودائما ما تراود الإنسان رغبة عارمة وقوية لتأدية هذه المهمة التي جاء من اجلها, وعندما تتملك الإنسان رغبة قوية لتحقيق هذه الأسطورة الشخصية فإن الكون كله يطاوعه لتحقيقها؛ ذلك لأن الكون يتغذى على سعادة البشر, وأيضاً لأن هذه المهمة هي جزء أساسي من الكون, انبعثت من روحه.ومن أهم أشكال مطاوعة الكون للإنسان في تحقيقه أسطورته الشخصية هي ( المبدأ الملائم)؛ فلأن الكون يريدنا أن نحقق أسطورتنا الشخصية فهو يعمد لأن يجعل (الحظ) بجانبنا في أول الأمر.كي نعرف ما هي المهمة التي جئنا من أجلها, وكيف نؤديها, يجب أن نصغي للغة الكون, والكون يتحدث بالإشارات, والإشارات هذه تحدث أمامنا على هيئة ما اعتدنا أن نسميه (حظ) أو ( مصادفة), هذه الإشارات هي طريقة الله – حسب وصف الرواية – في إخبارنا بالطريق الذي يجب أن نسلكه, حتى تتعلم لغة الإشارات الكونية يجب أن تتطور حدسك وتثق فيه, وكي تتطور حدسك يجب أن لا تخاف من ارتكاب الأخطاء, ويجب أن تعرف أن لكل شيء معنى ومقصد.أيضا تقدم الرواية بعض الأفكار الخيميائية القريبة من الأفكار السابقة, ففي علم الخيمياء هناك مصطلح ( روح العالم ), ويقصد به المبدأ الذي يحرك كل شيء, وهو قائم على تحول الأشياء وتغيرها من شكل لأخر, وهو دائماً ما يعمل لصالح الإنسان, ويقترب الإنسان من روح العالم كلما تزايدت رغبته بشيء ما, ونستطيع إدراك روح العالم من خلال لغة الإشارات أيضاً, وهي هنا تسمى (لغة العالم), اكتشاف مبدأ (روح العالم) سمي بــ ( الإنجاز العظيم ) وهو اكتشاف خيميائي مكون من جزأين, أحدهم سائل وهو ( إكسير الحياة), والأخر صلب وهو ( حجر الفلاسفة).دائما ما نجد نزعة روحية, وصوفية, وأحيانا باراسيكولوجية, في روايات كويلو, وهذا هو طبع كتابات كويلو, وهذا أحد أسرار نجاحه, فأحيانا يحتاج القراء من يعيد المعنى لوجودهم, ويخبرهم أن لحياتهم هدف, وأن عبثية وبرود الحضارة الحالية ليست نهاية المطاف. أيضاً يشتهر كويلو ببساطة أسلوبه الشديدة وببساطة مفرداته, تلك البساطة التي يرافقها دائماً عمق غير عادي في الطرح, ومن ما يتصف به أسلوب كويلو, هو انه لا يصف كثيراً البيئة البرازيلية, وربما يعود ذلك لكونه رجل يحب السفر؛ لذلك يهتم بوصف المكان الذي ذهب إليه أكثر من اهتمامه بوصف المكان الذي جاء منه, ويذكر أنه من أهم أسباب شهرة رواية “الخيميائي” عالميا هو سحر الشرق الموجود في الرواية, وعزز كويلو هذا السحر باستعراضه بعض أوجه التراث العربي والثقافة الإسلامية في الرواية.من الشخصيات التي جاءت في الرواية هي شخصية “ملكي صادق” وهو رجل عجوز يقول أنه ملك منطقة أسمها “سالم”, يتضح من الأحداث أنه كائن فوق طبيعي, فهو يعرف الأسرار والسرائر, لكن كينونته لا تتضح تماما في الرواية, مهمة “ملكي صادق” هي مساعدة الناس الذين يكونون على وشك العدول عن الجِد خلف أسطورتهم الشخصية, وهو يظهر للكل في هيئات وصور مختلفة. في الحقيقة “ملكي صادق” هو اسم ملك ورد ذكره في التوراة وذكر أيضاً بأنه ” ملك سالم “, و”سالم” اسم قديم للقدس, وقد كان “ملكي صادق” ملك لها في عهد النبي إبراهيم عليه السلام. في الحقيقة لم أجد أي ارتباط بين الشخصية التاريخية والشخصية الموجودة في الرواية.أن أكثر ما يميز رواية “الخيميائي” هو بساطة المواقف التي ترافقها دلالات عميقة, وهو ما يجعلني أبالغ نوعا ما, وأعتقد أن رواية “الخيميائي” كتبت بفكرتها, أعنى أن الرواية نفسها التي قدمت فكرة الإشارات الكونية, تحمل نفسها إشارات – تظهر في مواقف أو شخصيات أو جُمّّل – قد تبدو للبعض هامشية, وطفولية, وبلا أي معنى, وقد تبدو للبعض الأخر أنها دلالات مهمة, ومعاني عميقة, وإضاءات ضرورية, تماماً مثل الإشارات الكونية التي تحدثت عنها الرواية, وكأن باولو كويلو مبرمج قرر أن يكتب كتاب عن التشفير فكتب الكتاب مشفراً؛ فيكون الكتاب بهذه الطريقة كتب بفكرته."}, {"userName": "Kali", "userReviewDate": "Mar 23, 2007", "userURL": "http://www.goodreads.com/user/show/32541-kali", "userReview": "Everyone (save one guy) said I would love this book. Three of my four roommates have their own copies. That one guy was right. Now this may be because he planted that seed of discontent, or it may be because this was the least creative and most redundant book I've read in a while. It answered the question, what happens when you put The Hero With a Thousand Faces, The Bible and 1001 Arabian Nights in a blender? That said, I didn't hate it. Two of the central themes (which were hammered in over and over again) are two of my favorite world views - ones I hold very dear to my heart. I understand that everyone has their own path and if it takes this silly little book to realize these two important messages, I'm just happy the reader finally discovered these truths. A) As the far more prolific writer Joseph Campbell says, Follow Your Bliss and B) As the far more prolific writer Ralph Waldo Emerson says, Once you make a decision, the universe conspires to make it happen. (See the pattern.) To explain my aversion to the third nail in the coffin of stolen redundancy, I will tell you story. I have a small collection of fortunes from fortune cookies. (I have always been in the habit of collecting good omens.) To make the list, a fortune must convey a good message when applied to life and even better when the requisite \"Dirty Fortune Cookie Ending\" is added. During my freshman year of college, I got the fortune \"Where your treasure is, there will your heart be also . . . . . between the sheets.\" Hilarious, right?! Sex, love, treasure, oh the glorious metaphors. Fast forward two years, when I discover that my hilarious fortune is actually A BIBLICAL QUOTE! Straight out the OT. Well, I was shocked and appalled. I was being proselytized to by a cookie! Now, I realize that this is my own issue, but I don't want a bible-thumping cookie or 200 year old Alchemist ramming the OT down my throat. To anyone thinking about reading this book, I have given you the two things that need be learned from it. Now go read some Joseph Campbell."}, {"userName": "Nandakishore Varma", "userReviewDate": "Sep 08, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "SUCKS."}, {"userName": "Lisa", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "For my dear friends Matt and Jean-Paul! Homework for \"Introductory Course For Irony Disposal And Sarcasm Removal (ICFIDASR)\", lesson one, re-submission number 47.I once read a book that inspired me to change my whole attitude towards reading. It was a medicine of universal, cosmic impact. Before, I had thought that books existed to enrich me, giving me knowledge, pleasure and understanding. After reading the introductory pages of this \"enchanting novel\" however, I learned that more wisdom can be gained from the companionship of sheep than from books, as stated by the wise young protagonist, a shepherd who uses books for a pillow and sheep for dialogue partners (it is a one-way road, with the sheep as teachers, for the sheep don't learn anything from him). In simple, unsophisticated prose, which seems to be carefully following the rubric of a Grade 6 descriptive writing assignment, I read:\"The only things that concerned the sheep were food and water. As long as the boy knew how to find the best pastures in Andalusia, they would be his friends. Yes, their days were all the same, with the seemingly endless hours between sunrise and dusk; and they had never read a book in their young lives, and didn't understand when the boy told them about the sights of the cities. They were content with just food and water, and, in exchange, they generously gave of their wool, their company, and - once in a while - their meat.\"Learning to take everything literally is part of my course, so I try not to see a metaphor in the fact that the boy learns more from sheep than from books. But I do have a question or two:If the sheep are only his\"friends\" as long as he brings them food, do they really count as friends? Are they not just following their needs?Is it not quite self-evident that they have not read any books in their young lives - they are sheep after all, and won't read in their old age either, I assume?Do they really \"generously offer their wool, their company, and -ONCE IN A WHILE - their meat? At least as far as the meat is concerned, I am sure they offer it once, and not again, and not by free choice, and generously?As this book is to be taken seriously, I beg to accept my apology if my questions sound like sarcasm. That is not my intention. I am really just asking \"all universe to conspire to help me achieve my goal\" (another piece of wisdom the book offers) - of understanding how anyone can take this seriously! I just wonder how all universe deals with opposing wishes, which must occasionally occur, even in a small place like our earth. If I for example wish to have my neighbour's garden chair, and my neighbour wishes to keep it, who does \"all universe\" side with, and how does it conspire to help me get it, and at the same time to help my neighbour to keep it?Things that happen once can never happen again, I also learn. Before I can even ask why, I get another piece of information: Things that happen twice will always happen again. How does that go together? If things have happened once (which is a prerequisite for happening twice in my world) they won't happen again?!? Whatever is meant, things can NEVER happen twice, that is sure. I can't travel to Italy twice. If I do it anyway (which is not possible) I will definitively do it again. That is nice!When I do travel to Italy (once, or three times), my life and my path will always provide me with enough omens. That is interesting, and I do not know why I all of a sudden associate this with the sheepish followers in Life Of Brian, who found omens in sandals.Call me literal-minded, but I do have some issues with the idea of omen provision. Can I order them online nowadays? What do they cost? To close my reflection on learning more from sheep than books, I have to say: In some cases, that is very true! What a bitter medicine!As with all medicines, there are some side effects, and it is very important to read the warning before you take this drug:Please do not read this book if you are in danger of thinking too rationally. When you read this Grade 6 essay, be careful to check if you show behaviours that you would define as out of character, as they might be symptoms of acute drivel reading allergy. Symptoms include: anger, frustration, ridicule, frowning, nausea, meaningless giggling, dreams about book burning, urge to throw the book in the bin or out the window. Symptoms may vary, but in all cases, it is recommended to suspend reading until the brain is reset in adequate sheep mode again. If symptoms do not diminish after enjoying a couple of good, real books, please see your librarian for memory removal surgery or therapy."}, {"userName": "Ahmed", "userReviewDate": "May 10, 2014", "userURL": "http://www.goodreads.com/user/show/11260920-ahmed", "userReview": "عندما تسمع عن روايه ترجمت لاكثر من 60 لغه وبيع منها اكثر من 70 مليون نسخه ينسج خيالك عليها انها روايه عظيمه وتتوقع منها اشياء مهمههذا العمل يقبع فى مكتبتى منذ اكثر من عام ولا ادرى ما سبب اهمالها كل هذا الوقت ولا ادرى سبب معين لقرائتى لها ولكن المهم انى قرأتها : احسست بضحاله شديده وانا اقرأها وجدتها سطحيه ومبتذله لا ادرى هل رأيت انها مبالغ فى قيمتها الادبيه ام ان المشكله توجد فى انها خذلت طموحى الشخصى فى فحواهالا ادرى . حقا لا ادرىاهو مبالغه شديده من الكاتب لكى يوهم القارئ بانه جاء مخلصا له وناصحا له على طريقة معينه فى حياته (من قرأ فى التنميه البشريه سوف يفهم قصدى) وهو غالبا ما وجدت الابتذال فيهواحقاقا للحق انا متفهم جدا مبيعاتها المهوله لانها ببساطه قدمت للقارئ ما يريده بالضبط من نصائح وووو"}, {"userName": "Don", "userReviewDate": "Dec 26, 2007", "userURL": "http://www.goodreads.com/user/show/87493-don", "userReview": "I simply could not finish this book. I got halfway through it only to wind up on goodreads.com to see what others thought. I simply felt guilty panning a book that has received such global acclaim; more than that, I felt lame and inadequate.Well, it turns out that my sentiments were echoed. I basically felt I was reading an overblown parable and that the same lessons were being spelled out again and again. It was like the 16th verse of a hymn. Throughout my life I have periodically reflected to get a sense of who I am, where I am going and whether I want to end up there. I am an extremely introspective person and I am constantly evaluating and re-evaluating my person; sometimes for the better, sometimes out of necessity. To put a fine point on it, I regularly do that which is, for lack of a better word, preached in this book. The problem I had with The Alchemist is that instead of feeling reinforced and validated, I felt uncomfortable and nagged."}, {"userName": "Sanjay Gautam", "userReviewDate": "Dec 22, 2012", "userURL": "http://www.goodreads.com/user/show/10179929-sanjay-gautam", "userReview": "The book is full of messages and symbolizes our life actions interwoven in a very complex yet in elementary patterns which can be deciphered if one persists and have longing in his heart. It is not just following the heart blindly; but never ignoring what it says. Its important message is to keep accord with your heart no matter where it takes you. Because the treasure is where there is heart. Now, that was the gist of the book. But my reading experience with this book was horrible and most importantly - boring. It was a let down except for its insights (which were rather scattered but were impactful). It was more like a new age book, with some elements of prophetic vision, aimed at opening a new dimension of spiritual values within. However, it didn't struck a chord."}], "description": "Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams.", "title": "The Alchemist", "url": "https://www.goodreads.com/book/show/865.The_Alchemist", "average": 3.83, "cover": "https://images.gr-assets.com/books/1483412266l/865.jpg", "reviews": 61364, "authors": [{"url": "https://www.goodreads.com/author/show/566.Paulo_Coelho", "name": "Paulo Coelho"}, {"url": "https://www.goodreads.com/author/show/488758.Alan_R_Clarke", "name": "Alan R. Clarke"}], "type": ["Fiction", "Classics", "Fantasy", "Philosophy", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/865.The_Alchemist", "http://www.goodreads.com/book/show/492286.The_Alchemist", "http://www.goodreads.com/book/show/6388432", "http://www.goodreads.com/book/show/864.The_Alchemist", "http://www.goodreads.com/book/show/6010848", "http://www.goodreads.com/book/show/6369436", "http://www.goodreads.com/book/show/1431.Veronika_Decides_to_Die", "http://www.goodreads.com/book/show/1430.Eleven_Minutes", "http://www.goodreads.com/book/show/1428.By_the_River_Piedra_I_Sat_Down_and_Wept", "http://www.goodreads.com/book/show/1427.The_Zahir", "http://www.goodreads.com/book/show/816720.The_Witch_of_Portobello"]}