{"ratings": 10752, "userreviews": [{"userName": "Lawyer", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "The Autobiography of Miss Jane Pittman: Ernest J. Gaines' novel of the long journey to freedom\nThe Autobiography of Miss Jane Pittman by Ernest J. Gaineswas a selection chosen by members of On the Southern Literary Trail as a group read for January, 2016. Special thanks to Trail member  Jane for nominating this work.\n\nA Note from the incomplete reader\nThe Autobiography of Miss Jane Pittman was originally published by Ernest J. Gainesthrough the Dial Press in 1971. A second printing followed in 1972. \nThe Second PrintingWhen Gaine's novel was filmed as a television movie in 1974 sales mushroomed with the issue of the mass-market Bantam Paperback tie-in edition. Cicely Tyson played the title role from approximately age 23 to 110. The production garnered nine Emmy Awards, including Best Actress for Ms. Tyson.\n\nCicely Tyson portrayed a century of the life of Miss Jane PittmanI was a first year law student when \"The Autobiography of Miss Jane Pittman\" first aired. I was twenty-two years old. But it was thirty-eight years later, as a sixty year old man, before I read the novel. It was the Bantam movie tie-in edition I read, after checking it out of my local public library.Now that check-outs and check-ins are digitized, it is no longer possible to see how often a book has been checked out, or when it was read. But you can still tell from the condition of a book when it has passed through generations of hands. The spine was loose, bowed from having been placed down many times, and the cover had a distinct curl indicating one or readers had been cover and page benders, turning what had been read to the back of the volume. Previous readers had dog-eared the pages. Others had underlined passages, some times in pencil, some times in ink. Inevitably the same passages had been marked more than once, starred, underscored in different colors, but clearly having some impact on many readers.But I was not one of them. I was born and raised in Alabama. No book by an African-American author appeared as a part of my curriculum through high school. While I was raised by my mother and family to \"Sir\" and \"Ma'am\" any person, no matter the color of their skin, neither had they ever been exposed to African American literature of any sort. It was only in college that I was introduced to Charles W. Chestnutt,briefly, by my favorite literature professor O.B. Emerson, during his Southern Literature Course which I took in 1973.I knew of the injustice suffered by Tom Robinson in To Kill a Mockingbird and idolized Atticus Finch because he fought for justice for an innocent man. I read The Confessions of Nat Turner, was furious at the thought of slavery, but wondered why the story was written by a white man, William Styron. It occurred to me to ask if I were a literary racist.It was during my work as an Assistant District Attorney working child abuse and domestic violence cases that Alice Walkerbegan a literary awakening for me with The Color Purple. Then came Toni Morrison, Maya Angelou, and Natasha Trethewey. I began to assuage my guilt over my ignorance of an entire culture's literature. But I wondered where were the male writers? Surely there was someone other than Chestnutt. Oh, I could read Booker T. Washington, and Frederick Douglass. I have their books. But I wanted someone more contemporary. And then, thanks to a member of our goodreads group On the Southern Literary Trail there he was. Ernest J. Gaines. \nErnest J. Gaines, an author I'm grateful to have discoveredMy reading of Gaines has not followed my usual practice. I've read him as I've found him. First came A Lesson Before Dying, then A Gathering of Old Men, and now The Autobiography of Miss Jane Pittman. Each has affected me deeply, but I chose to share my thoughts regarding Jane Pittman because of the magnificent voice of the protagonist and the sweep of history seen through the eyes of one person, with the assistance of those who shared parts of their lives with her and lived around her.Gaines structures his novel as a series of interviews of Jane Pittman conducted by an unseen and unnamed teacher of history. The \"Teacher\" emerges much as Homer does in The Odyssey, calling on Jane Pittman to tell of her personal odyssey to freedom from the final days of her life as a slave during the American Civil War up to the Civil Rights Movement of the early 1960s.\nA Note From The Teacher\n\n\"I had been trying to get Miss Jane Pittman to tell me her story of her life for several years now, but each time I asked her she told me there was no story to tell. I told her she was over a hundred years old, she had been a slave in this country so there had to be a story...\"\n\n\nFrom the Interviews of Miss Jane Pittman\nThe Teacher told me he wouldn't take no for an answer. So I asked him when he wanted to get started. He had one of those recorders. One thing led to something else. Sometimes I wasn't able to remember. But there were all those of my people around me who were my memory when it was gone. The Teacher said it was all our story. I guess it was.When you are born a slave like I was you don't own anything. Not even your ma'am and Pap get to name you. The Mistress named me Ticey. I didn't start out as Jane Pittman.It was near the end of the war. The Secesh come through. Mistress told me to take water out to them. One boy said if it was up to him, he would let the niggers go, but it wasn't up to him.Then the Yankees came on following the Secesh. It was a Yankee soldier gave me his daughter's own name, Jane Brown. He told me after the war to come see him in Ohio. When Mistress called me Ticey, I told her I wasn't Ticey anymore, I was Jane Brown. She had Master hold me down and she beat me with a cat-o-nine tales an' put me to work in the fields.I don't even know what happened to my Pap. I barely remember my Ma'am. They killed her when I was bout five.It was more than a year after the war Master told us we was emancipated. We could stay but he couldn't pay us nothin'. But we could work on shares. It was slavery all over again. About half of us left. Big Laura you'd call the leader. She carried her baby daughter. I watched after her boy Ned. We didn't know where we was goin' or how we was goin' to live. We only knew we were free at last.Then one day the Patrollers found us. They was like the Ku Klux. They killed ever one of us except me n' Ned. I had been able to keep him quiet. I found big Laura. Them men had even killed Laura's girl child.\nThe Patrollers I made up my mind I was gonna get to Ohio no matter what. Ned, he took two stones, flint stones from his Ma'am. He carried them with him wherever he went. I guess it was his way of remembering his Ma'am. But I think ever time he struck them rocks together what he was makin' was the spark of freedom Laura had wanted for him n' ever body else.Each day we walked. But we was still in Luzanna. I hung on to finding freedom in Ohio until one night we came up on the house of an old white man. He had been a sailor at one point in his life. He had maps ever where in his house. He told me I'd have to cross Mississippi or up through Arkansas n' I might take my whole life gettin' to Ohio. He told me he could be Secesh or he could be a friend of my people. You know I think he was a friend of my people. He could jus' as easy told me sure you take on off for Ohio.So I decided to stay in Luzanna n' find my freedom there some day. I took work on a plantation. Ned was in a school. I never looked on Ned as mine until his teacher had him read his lesson to me n' I was so proud of him I loved him as if he were my own.The only good that come to my people after the war was when the Beero showed up. We were freed men and women. But it didn't last. The North made up with the South, and those northern businessmen came down South to make money with the white businessmen. It was slavery all over again.\nA Branch of the Freedmen's BureauThe years went on n' Ned went off to Kansas to find an education. I took Joe Pittman, the horse breaker on the plantation as my husband. I couldn't have chilren of my own. The doctor said I had been beat so bad when I was still a slave I had been hurt inside.There was no horse Joe couldn't break. A big rancher hired him to come out to Texas n' made Joe, a black man, his head horse man. But there's always a horse a man can't break. I lost Joe. N' from then on I was just Miss Jane Pittman.I went back to Luzanna. My Ned came home from Kansas. He was full of ideas. He had been down to Cuba in that Spanish American War. He talked about not holdin' with the Booker T. Washington sayin' that the black people needed to stay off from the white folks, work hard and stand on there on. He took after the ideas of Frederick Douglas n' said that this world was for all folks black n' white. He was a teacher. I still remember hearin' him talkin' to the chilren on the plantation. He said, \"This earth is yours and don’t let that man out there take it from you.\"\nBooker T. Washington\nFrederick DouglassNow there was a Cajun named Albert Cluveau. He would sit on my porch n' talk. He'd drink tea with me, n' we'd go fishin together' sometimes. Albert would talk about killin' like it was nuthin'. Albert told me if Ned didn't stop his teachin' n' leave, he'd been told to kill him. N' he said he'd do what he was told to do.Ned wouldn't leave. Even knowin' he was going to die. One night Albert Cluveau met my Ned on the road n' shot him through the chest with a shot gun. Black people have had to fight for whatever they ever got. Ned would never quit. But I sure miss him.There was more wars. There's always wars. I thought after all our young men fought the Germans n' Japanese things might be changin'. There was even a black man played baseball for the Dodgers. I never missed Jackie Robinson when he was playin' for the Dodgers. But things hadn't really changed.\nMiss Jane's favorite ball player, Jackie RobinsonWe had a young man named Jimmy. He was the son of sharecroppers on the plantation. We all thought he might be The One, who would grow up n' make a difference for our people. We wanted him to make a preacher or a teacher.Jimmy went off to school. He got in with young Fred Shuttlesworth and that young preacher Martin Luther King, Jr. They sent him back home to us. He told us we hadn't even begun to fight in Luzanna. \nFred Shuttlesworth\nMartin Luther King, Jr.Jimmy asked us all to meet him at the Courthouse the next mornin', gonna get us some civil rights. I plan on goin'. He reminds me a lot of my Ned. But Albert Cluveau's been long dead. I'm not sure if I'm 110 or I'm a 111, but freedom's been a long time comin'.\nMiss Jane at the Courthouse\nThe Incomplete Reader Wraps Up\nErnest J. Gaines filled The Autobiography of Miss Jane Pittman with so much historical content, and the voice of Jane Pittman carried such a sense of truth, that upon its original publication, many people thought the novel was non-fiction. Gaines said,\"Some people have asked me whether or not The Autobiography of Miss Jane Pittman is fiction or nonfiction. It is fiction. When Dial Press first sent it out, they did not put \"a novel\" on the galleys or on the dustjacket, so a lot of people had the feeling that it could have been real. ...I did a lot of research in books to give some facts to what Miss Jane could talk about, but these are my creations. I read quite a few interviews performed with former slaves by the WPA during the thirties and I got their rhythm and how they said certain things. But I never interviewed anybody.\"\nWell, he could have fooled me. Ironically, as I finish this review, \"The Autobiography of Miss Jane Pittman\" is on the television. I am watching it thirty-eight years after I first saw it. It is good. However, it cannot match the power of the seamless narrative of Gaines' powerful novel.As for that battered paperback I checked out of our library, I've bought a new trade edition to go on the shelves. It will be a clean slate for others to begin underlining the passages they love and to make their own notes. Periodically, I'll check on that book and see how things are coming along. There's still a lot of life left in the story of Jane Pittman. For us all. Thank you, Mr. Gaines. \nA New Book For the LibraryOctober 31, 2014I met Ernest J. Gaines at the Louisiana Festival of the Book. He smiled at the first editions I handed him. \"It's been a long time since I've seen one of these,\" he said as he opened my first edition of The Autobiography of Miss Jane Pittman. He smiled, looking at the original editions of his novels. I offered him my fountain pen. He carefully signed each copy, nodding, as he looked at each one. His signature was sure and strong. Gaines was a gracious man, thanking me for sharing my books with him. \"No. Professor Gaines, thank you.\"He handed me my pen. He extended his hand. I took his in mine. His grip was sure and steady. We shook on our exchange.I asked if he minded if we could be photographed during our meeting. \"Why, no,\" he said. A young woman behind me took my camera, and clicked away.It was a very memorable day. Read Ernest J. Gaines. This book, and every one you come across. You will find, as I did, Gaines is one of America's true literary icons.\nMeeting Ernest J. Gaines. A Good Day"}, {"userName": "Connie", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "Miss Jane Pittman is a spunky survivor, a strong black woman over 100 years old. She narrates the story of her life from her days as a slave, after emancipation, and during the 1960s Civil Rights Movement. In a Missouri Review interview in 1999, Ernest J. Gaines said that he grew up on a plantation in Louisiana around his handicapped aunt and other older people who visited her. Jane is a fictional character based on the kinds of experiences those people might have gone through, using their vocabulary and the dialects he could remember from his childhood. He also used slave narratives in researching her story.The role of the strong black man also comes through in the book. Jane's husband, Joe Pittman, proves his manhood by breaking the toughest horses. Jane acts as a mother figure to both Ned and Jimmy, strong men who take huge personal risks in protesting against the discrimination of blacks.As a slave Jane never learned to read and write, so the premise is that a teacher is taping her oral narrative. Jane is spirited and witty in spite of having faced many challenges and losing people she loved. The author is a master of dialogue with a warm conversational style. The reader feels like they are spending an afternoon in Louisiana talking with the wonderful Miss Jane Pittman.Interesting interview with Ernest J. Gaines about writing his early books and teaching creative writing: http://www.missourireview.com/archive..."}, {"userName": "Diane Barnes", "userReviewDate": "Dec 25, 2015", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "Ernest J. Gaines has given us a fictional autobiography of a woman who has attained legendary status in literature, and in film history as well. Miss Jane lived through black history, first as a slave in Louisiana, then as a strong, courageous woman trying to maintain her sense of worth and dignity while being treated as less than human by white southerners. The journey took her from being set free as a slave at 10 years old through 100 years, from reconstruction to the Civil Rights era, at which time she set herself free by deciding to march in a protest rally.This is just the second Gaines book I have read. I intend to get to them all because he makes me see a side of race relations that has escaped me by forcing me to confront the reality of the issues instead of the myths. That's quite an accomplishment for an author.I have to mention one passage that drew goosebumps. Miss Jane is describing the floods of 1927, the levees that failed because white men thought they could control the rivers by force, and the lasting damage that was done. \"Now he's built his concrete spillways to control the water. But one day the water will break down his spillways just like it broke through the levee. That little Frenchman was long dead when the water broke his levee in '27, and these that built the spillways will be long dead, too, but the water will never die. That same water the Indians used to believe in will run free again. You just wait and see.\"This book was written in 1971, almost 35 years before Hurricane Katrina. But Miss Jane knew, she surely did."}, {"userName": "Tom Mathews", "userReviewDate": "Dec 14, 2015", "userURL": "http://www.goodreads.com/user/show/22063432-tom-mathews", "userReview": "How does one write a novel that encompasses the entire black experience from slavery to the Civil Rights Era? Well, if the author is Ernest J. Gaines then you tell it through the eyes of someone who lived through it all. begins with Ticey, a ten or eleven year-old slave girl who assumes a new name, Jane, at the advice of a Yankee soldier. It ends almost 100 years later when Jane, now Miss Jane Pittman, becomes witness to the birth of a new era of freedom. This is a story that one thinks one knows, even if they haven’t read it. I had it in the back of my mind for years that I had read this book or at least seen the movie but the truth is I had not. Maybe I had seen or read similar stories but more likely I just thought I knew how such a story would go. While this may be so, Miss Jane’s narration provided quite a few insights that I had never considered before and offered a unique point of view. It is a challenge to tell 100 years of history in under 300 pages and there are places where the pace gets a little choppy but this is to be expected considering the plot device put forth in the introduction. Gaines, as the editor has compiled and put together from many hours of recordings of interviews with Jane and her friends. 4.5 stars"}, {"userName": "Camie", "userReviewDate": "Dec 31, 2015", "userURL": "http://www.goodreads.com/user/show/7399266-camie", "userReview": "The author using the guise of an autobiography, has Miss Jane Pittman, who lives to be around 110, telling her story and it's quite an interesting one as she lived through being a slave, to emancipation, and on through to the civil rights era. I think I read this first in Junior High-school , that's probably why it reminded me of a school assignment. It has it's dramatic moments but overall Jane comes across as a bit unemotional and the book generally lacked the detail I wanted more of. I also didn't like the 10 year skips in the dialogue. I've read lots of interesting books about this time period. This was good, but not great for me. 3 stars"}, {"userName": "Laura", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/7555122-laura", "userReview": "I love Gaines easy writing style. One the best protagonist in southern literature. Excellent!"}, {"userName": "Emily", "userReviewDate": "Feb 17, 2012", "userURL": "http://www.goodreads.com/user/show/2362183-emily", "userReview": "I am kind of stingy with my ratings -- I would make it a 2 1/2 if I could, because it was better than \"okay\" but I didn't quite \"like\" it. I didn't DISlike it, either. After reading \"The Help,\" I wanted to read some more historical fiction taking place during the Civil Rights Movement. This biography was suggested to me by the librarian, and it was a pretty easy read. It followed the life of Jane Pittman from her childhood as a slave through emancipation, trying to get out of Louisiana, then as an adult working on a plantation (still in Louisiana,) and ended up with her over 100 years old (still in Louisiana) becoming a civil rights activist. Jane was a \"sassy\" lady, and although I never fell in love with her, I do admire her ability to carry on and survive so many hardships that I can only imagine (by reading books like these.) I wish there had been a little more emotion in this biography. There were plenty of heart-wrenching stories told (mothers being murdered, babies being murdered, sons being murdered, suicide, etc.) but yet my heart never wrenched. I'm left wondering if Jane was really devoid of too much emotion (surely a blessing) or if the writing just couldn't carry it through."}, {"userName": "Dee's Book Corner", "userReviewDate": "Feb 08, 2013", "userURL": "http://www.goodreads.com/user/show/5618268-dee-s-book-corner", "userReview": "This powerful autobiography was the catalyst that lead me to reading more slave narrative in the late 90's."}, {"userName": "Chrissie", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "This is fiction, you guys! It is written in \"the guise of tape-recorded recollections of a woman born as a slave in the 1850s.\" This line is taken directly from the book.The book description here at GR goes on to say:\"In this woman Ernest Gaines has created a legendary figure, a woman equipped to stand beside William Faulkner's Dilsey in The Sound And The Fury.\"There is one huge difference. Faulkner's writing skills are so very much better than Gaines'. The two are incomparable. Even if Faulkner purposefully confuses the reader, which annoyed me to no end, one cannot help but marvel at his creative ability and beautifully descriptive lines. Gaines writing is simplistic. There is no lyricism here. The story told is that of one the black woman in America. It does not in detail cover the history of all Blacks in America. Such cannot be found in a fictional book of this length. It covers a very small portion of the Cvil War, the Restoration and the Civil Rights Movement. It takes a turn at the end toward religious proselyting. This did not work for me at all. The audiobook narration by Lynne Thigpenn was fine. Good speed and clear dialogs. The Southern dialect was not hard to follow.I wanted more historical content, better writing and more in-depth character analysis. Large swaths of time are covered summarily; other sections dragged out tediously."}, {"userName": "kisha", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/10773892-kisha", "userReview": "Every since I was a little girl I have had a strange obsession with the past. 19th century black slavery is my favorite era, than 1940's, than 1960's. I love the Harlem Renaissance, I love all things civil rights, but it's something about 19th century slavery. Cabins, white women dresses with the petticoat underneath, dirt roads, the \"big house,\" horse and buggies for cars, the dialect, the stories, and most importantly the messages. My mother's ex-boyfriend forced me to watch the entire miniseries of Roots as a punishment for something I did that I can't recollet when I was nine years old. The joke was on him when I looked forward to the next episode refusing to go outside and play with the other kids because I wanted to rewatch the whole series. I don't know what my fascination was with Roots and slavery at such a young age. It was the very first slave film I'd ever watched. It may have been the first show that wasn't a cartoon that I'd ever watched! But that began my 20 year obsession with the past. Eager to find more films like Roots, I checked The Autobiography of Miss Jane Pittman out at the library on vhs. I loved it just as much as roots. Extremely fascinated, I think I may have been the only nine year old girl watching slave movies because I wanted to and not as a punishment or class assignment in February. So here it is 20 years later and I finally read the book. So disappointing. Firstly, at nine years old I knew that the word 'autobiography' meant a true story narrated by the actual person i.e Miss Jane Pittman. I accepted for years that this was a true story. How missleading of Gaines. Probably a sales tactic. Anyway, it wasn't until I read the back of the book in the synopsis and seen it refers to the story as fiction is when I felt as devestated as a child who learned the easter bunny isn't real and Mommy and Daddy has been lying to you for years! (yes, I know I was way too attached to Miss Jane Pittman).What else I didn't like about this story, she wasn't relateable. Gaines did an awful job with developing Miss Jane Pittman's character. There was no plot line (which would be acceptable in the storytelling of a REAL autobioghrapy but not in a FICTION novel)! The writing style was so elementary and mundane. How did such a mediocre book become so famous is beyond me, even for the early 70's! This was epic fail. I couldn't even get past 100 pages once I realized I didn't really care what happened to Miss Jane or even Ned for that matter."}, {"userName": "Lulu", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/8427052-lulu", "userReview": "I enjoyed this story from beginning to end."}, {"userName": "Jean", "userReviewDate": "Feb 10, 2015", "userURL": "http://www.goodreads.com/user/show/23100707-jean", "userReview": "February is Black History Month. I usually attempt to read a book about black history or read a book written by a black author or both. This year I decided to read a novel I read back in 1971 when the book first came out. Since then the book has become a classic. A movie was made in 1974 starring Cicely Tyson. I sort of remember the movie was good. I think I shall check to see if Amazon has the movie and will watch it after I finish the book.The book is fiction but is written in the style of oral history. The author’s brilliantly crafted book interweaves historical references and recollections into an overall framework of the life of a woman born into slavery who survived to the point of the beginning of the civil rights movement of the 1960s. The story is told as seen through the eyes of a 110 year old woman who had lived though it all; with simplicity and immense dignity Jane Pittman speaks of the Reconstruction period in the deep South, with its struggles for black self determination and betterment. The constant terror of the Ku Klux Klan to thwart those efforts, and the legacy of racism that white Americans use right up to the present day.Gaines’s description of the plantation is authentic and spellbinding. The story gripped my attention right from the beginning and kept it throughout the story. This is a book that I enjoyed the first time I read it and have enjoyed it even more on the second reading. Gaines was born on a Louisiana Plantation but was educated at San Francisco State and Stanford University. This is a must read book for everyone. Lynne Thigpen did an excellent job narrating the story."}, {"userName": "Ivannah", "userReviewDate": "Sep 24, 2007", "userURL": "http://www.goodreads.com/user/show/223056-ivannah", "userReview": "I read this book in two sittings. It wasn't easy at first, but once you got introduced to Miss Jane Pittman the rest was easy. How could you not love a character, a woman, so enduring? How could you not weep at the loss of her only \"son\". This story is written richly, and with so much emotion that you can't help but to pull for her. Though, the subject matter was dark, the book itself wasn't dark. There were times when you heart ached because of all the suffering, and despair. When they were hopeful, you were hopeful. When Miss Pittman was hurt, you too, were hurt somewhere deep in your soul. It was such a great read, This review simply cannot do this book justice. It was like a cold drink of lemonade after a sweltering hot day - satisfying in every way."}, {"userName": "Chandler Alexander", "userReviewDate": "Jul 04, 2016", "userURL": "http://www.goodreads.com/user/show/50896933-chandler-alexander", "userReview": "My favorite Ernest J. Gaines novel!"}, {"userName": "E", "userReviewDate": "Oct 05, 2007", "userURL": "http://www.goodreads.com/user/show/472694-e", "userReview": "This is a very impressive epic adorned with humor and founded in the lessons of overcoming tragedy either through battle or sheer resilience. As a novel itself it is wonderfully written in a lyrical prose with great, revealing dialogue. It is, however, much more than a novel.I had to read it over ten years ago in eighth grade history class, yet I can still recall the many different stories comprising the biography, nearly chronicling all the various manifestations of race relations throughout American history. In America, as young people we seem to learn in school about the atrocity of slavery and the inhumanity of Jim Crow, and we consummate those lessons with, \"Isn't it nice that's all over?\" Rarely are we taught to question or recognize the remnants of those horrible institutions in today's society, just as we learn that racists are \"bad guys\" and therefore couldn't possibly be anyone we know personally. Four years after having read the book together in eighth grade history, a classmate in twelfth grade history asked, \"Can black people vote? Seriously?\" I can only imagine if that we were required to discuss such books in light of their relevance to today rather than as tokens of the long-gone past, racism - be it in the form of aggression or sheer ignorance - would have a lesser chance of survival."}, {"userName": "Mya Sunshine", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/15163554-mya-sunshine", "userReview": "Ernest Gaines has been trying for so long to get in interview with the legendary Miss.Jane Pittman. This book practically covers her whole life story going from her childhood when she was still in slavery to when the war was going to her sons life to where she is now.I have read the book so many times but i always feel that I am learning something new every time I read it again.As of my response to this story I feel like he did a really good job putting it together and making sure that he got all the information. This is actually a unique story because you do not find a lot of novels that are about blacks in the south like Miss Pittman.I would recommend this book to a friend. I loved and i think others would enjoy cause it teaches you things in life that you might not understand now."}, {"userName": "Wayne", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/15558119-wayne", "userReview": "Ernest Gaines creates a legendary character in Miss Jane Pittman, a woman of 110 whose tape-recorded recollections and heroic experiences manage to carry the reader through American history and race relations from the Civil War through the beginnings of the Civil Rights Movement. I was reminded of 'The Odyssey', 'Little Big Man', 'Oldest Living Confederate Widow Tells All', and other novels that use this form, but Miss Jane Pittman's voice might be the most memorable of them all. Quick paced, poetic, and beautifully written. Highly recommended."}, {"userName": "Adira", "userReviewDate": "May 25, 2013", "userURL": "http://www.goodreads.com/user/show/17890950-adira", "userReview": "I'm a little salty about that ending! Miss Jane Pittman was a hoot though."}, {"userName": "Lesley", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/3430178-lesley", "userReview": "I read this and saw the movie a long time ago, but it was well worth the second read! A century through the eyes of a woman who experienced it. As much as freedom from slavery was well deserved and needed, the African-Americans had to go through such horrors (KKK) and though this book goes to the civil rights movement, the hardships many suffer by white privilege still happen today."}, {"userName": "Serena W. Sorrell", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/31709335-serena-w-sorrell", "userReview": "A rough read about what it was like for those freed by the emancipation proclamation and what life after included. The narrator is a falsified persona, Jane Pittman, who recollects and narrates her 110 years of hardship, loss, love, and bravery.It was just really raw, full of hardship, and unfortunately so much of it still exists for PoC in today's society."}, {"userName": "Anneta Susan", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/9739462-anneta-susan", "userReview": "The voice this author had impressed me and was the first thing that made this book a true classic. His writing was declamatory and very clear. I respected how the author could tell the stories of other characters through the narrative of Miss. Jane Pittman and make each one, from the teachers to her son unforgettable. At first when Jane Pittman didn't achive arriving in Colorado I was concerned with what the author was going to do next and how he could make her into a heroine. She was a strong protagonist that was determined and what made her a heroine was the very thing that she did in her society.This novel was written simply, the character's story wasn't something that was boosted by the author, the mind of the woman was plain but solid and yet this book was a big, beautiful and important novel. The very things and the very truthfullness and the down to earth style that made it simple made it a majestic and touching book."}, {"userName": "Angela", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/5083527-angela", "userReview": "Overall this is a great book. I'm wondering why it took me so long to read it. Seems like everyone around me had this as required reading in high school. I haven't even seen the movie yet (which I will be doing soon). This book focused on Miss Jane Pittman, who through her narrative, described what happened through different time periods, including slavery up until the Civil Rights period. While it kept my interest for the first half of the book, near the end I started to lose interest. Maybe it was because much of the story revolved around the church and religion. Not that I'm a staunch disbeliever - but for some reason I don't like reading about religion. But I understand why this is such a big deal - most people during this period relied on religion to get them through the tough times.As mentioned before, this is a very good book. I encourage all to read it if you haven't."}, {"userName": "Lori", "userReviewDate": "Mar 13, 2012", "userURL": "http://www.goodreads.com/user/show/7950608-lori", "userReview": "I remember watching the movie \"The Autobiography of Miss Jane Pittman\" with Cicely Tyson. I remember reading this years ago. I read it on my kindle this time. A very good historical novel. a young man goes to the house of Jane Pittman. she is over 100 years old. the current time is the early 1960s. it is during the civil rights time. Miss Jane Pittman is being interviewed since she was about 11 when the civil war ended and she was a slave at the time. This book takes Miss Jane from that time to the early 60s she recalls her life during this time, the ups and downs. tragedies and other. a pretty good read. Glad I got the chance to read again."}, {"userName": "Deb", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/29830109-deb", "userReview": "Jane Pittman's storytelling begins just before the emancipation of slaves, following the Civil War. When she finds out she is free, she immediately sets out for the state of Ohio, thinking she will reunite with Yankee Corporel Brown. Corporel Brown gives her the first taste of freedom she ever enjoys, when he changes her name from her slave name, Ticey to Jane. After Jane receives her freedom, she walks for days, but still finds herself in \"Luzana.\" It is in the Deep South that Jane continues to live out her years. Her entire story spans from the Civil War till the Civil Rights movement."}, {"userName": "Lisa James", "userReviewDate": "May 29, 2013", "userURL": "http://www.goodreads.com/user/show/4867814-lisa-james", "userReview": "This is an EXCEPTIONAL historical fiction book written in an autobiographical style. Miss Jane is an unforgettable, vibrant character. To live to the age of 110 or more, & having known what slavery was, & her travels & life, is fascinating. I literally almost couldn't put it down. When the book ends, in the 1960's, abruptly, I was left gasping, thinking, WHY???? It's a powerful read..... anyone that has a heart for history, etc will love this. I RARELY rate a book as a 5 star read, but this one well deserves it."}, {"userName": "John", "userReviewDate": "Feb 26, 2009", "userURL": "http://www.goodreads.com/user/show/1152135-john", "userReview": "Gaines is a master with voices. I came away from the book feeling sad, because I wanted to spend more time with Miss Jane. I also learned some surprising things about history-- from slavery and the civil war, to the civil rights period--details I haven't seen elsewhere.It's hard to say which I like more-- A Lesson Before Dying or this book. I think Lesson is probably richer on more levels, but like I said, Miss Jane it just someone you really want to know. I can't wait to read more of Gaines' books."}, {"userName": "Caroline", "userReviewDate": "Feb 26, 2008", "userURL": "http://www.goodreads.com/user/show/35781-caroline", "userReview": "I adored this book. Its sensitivity in discussing relations among southerners of all ages and colors during a time when the courts were legalizing Jim Crow segregation was rich and provocative. Frankly, I thought the book did a better job of explaining life in the Jim Crow South than half the history books I read.I'm sure it had a great ending, too, but unfortunately some a$$hole stole it, along with my car. And now the library wants $94 to replace. Ay yay yay."}, {"userName": "Samantha Wing", "userReviewDate": "Jan 21, 2014", "userURL": "http://www.goodreads.com/user/show/23634732-samantha-wing", "userReview": "I makes me feel really sorry for Jane she started as a slave going to freedom and then getting turned back into a slave. It's really hard for me to imagine what life was for a African American, but it sounds like that they hard super hard time. I really hate when when people get killed and for a reason. Miss Lily is kinda harsh on the kids. I still can't get the book. There are way to many facts. So many fact that I can't keep track of."}, {"userName": "Sydney R", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/46311818-sydney-r", "userReview": "The book is about Jane Pitman and her journey to Ohio. The book took place when Jane was 11-12yrs old girl who was in slavery. One day the said she was free to go. As the group of free slaves left to find a place to stay.. This story is based on Jane and Neds adventure.I thought this book was a little bit boring at the begening but then was quite instersting at the end."}, {"userName": "Maya B", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/8154161-maya-b", "userReview": "I thoroughly enjoyed this read. This was also the first book I have ever read by this author. this was an easy book to read. the author's writing style pulled me in from the very first page. I'm glad I finally took the time to read the book after seeing the movie so many times throughout my childhood"}], "description": "", "title": "The Autobiography of Miss Jane Pittman", "url": "http://www.goodreads.com/book/show/764061.The_Autobiography_of_Miss_Jane_Pittman", "average": 4.18, "cover": "https://images.gr-assets.com/books/1320429946l/764061.jpg", "reviews": 311, "authors": [{"url": "https://www.goodreads.com/author/show/3533.Ernest_J_Gaines", "name": "Ernest J. Gaines"}], "type": ["Historical", "Fiction", "Classics", "Cultural", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/764061.The_Autobiography_of_Miss_Jane_Pittman", "http://www.goodreads.com/book/show/6285936-the-autobiography-of-miss-jane-pittman", "http://www.goodreads.com/book/show/19224713-the-autobiography-of-miss-jane-pittman", "http://www.goodreads.com/book/show/1131493.Autobiography_of_Miss_Jane_Pitman", "http://www.goodreads.com/book/show/140155.The_Autobiography_of_Miss_Jane_Pittman", "http://www.goodreads.com/book/show/5197.A_Lesson_Before_Dying", "http://www.goodreads.com/book/show/542953.A_Gathering_of_Old_Men", "http://www.goodreads.com/book/show/97712.Of_Love_and_Dust", "http://www.goodreads.com/book/show/97713.In_My_Father_s_House", "http://www.goodreads.com/book/show/97715.Bloodline", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}