{"ratings": 5209, "userreviews": [{"userName": "Cheryl", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/11255849-cheryl", "userReview": "But where are you? If one stripped you of your exhibitionism, if one took your technique away from you, if one peeled you as one peels an onion of skin after skin of pretence and insincerity, of tags of old parts and shreds of faked emotions, would one come upon a soul at last?\nOh Julia, you who live on a stage and we live there with you and your fleeting love (lovers); your complicated, yet undisturbed marriage; your disdain of boredom; your glorious moments in the limelight. All the world revolves around you and we only partake. If life is indeed a stage, some are better actresses. How do you see yourself when you don't have a title that the job or society gives you? Who are you without them? Do you like what you see at night, in the mirror? Do you love life or desire something more of it? There are many more questions this book asks, but most importantly, it lays bare the theme of desire and the toll desire takes on the human mind. I haven't seen the movie to this book (Being Julia), but I've heard from someone who saw me reading this, that Lord Charles is said to be Julia's lover in the movie? Well, with an emphatic, bold statement that excludes any spoiler tags, I'll say this: no he was not, not in the true sense of the word. Sorry, I've gone and said it, for I'm usually perturbed when a movie tries to veer away from the facts of the novel on which it is written. But I'll get off my anal horse now. (Note to self: must see movie).I loved the references to Shakespeare and Keats, the explorations of tension and conflict that occurred alongside this giant theatre. Lust is the leading woman and love her gentleman. Everyone else sees themselves through her. This is my third Maugham and my least favorite so far, although I can see most readers liking this better than Cakes and Ale. The prose I didn't find affecting as I usually find with Maugham's careful prose, and yet the story is a bit appealing, with a female protagonist empowered by her work. The novel leans on dialogue and inner thought that occurs through white spaces of dialogue, but it almost feels bare, as if one is reading a play that was filled into a novel. Some of the intricacies are missing and although Julia has layers, there is a certain quality missing in her experiences. But this is a book you read for its exploring moments: of reality and illusion, of self and perceptions of self."}, {"userName": "Marica", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/4549490-marica", "userReview": "Uccelli canteriniStoria piuttosto umoristica di una diva del teatro inglese. Julia è un'attrice molto dotata e con il suo fascino e la sua capacità di entrare nel personaggio che vuole interpretare seduce il suo pubblico, i lettori, il marito, i suoceri e il giovane amante. E' divertente seguire il suo modo di manipolare marito e amante, blandendo il primo nella vanità (\"sei l'uomo più bello d'Inghilterra\") e assecondando l'amante nelle sue debolezze di snob squattrinato. Il suo punto debole è che desidera essere adorata, quindi quando si rende conto che inequivocabimente l'amante le preferisce un'attricetta senza arte nè parte, la sua ira è grande. Ma poichè la vendetta è un piatto da gustare freddo, fa finta di niente e si organizza, perfida, in modo da dimostrare sul palco la sua statura di artista, a confronto con l' inespressiva attricetta. Questa lettura mi ha ricordato una cena con un'amica e un gruppo di giovani attori coi quali lavorava: era come stare dentro una grande voliera in mezzo a tanti uccelli canterini: usignoli, merli, passeri, fringuelli, ciascuno cantava la sua melodia mentre io, come un uccello muto, guardavo queste esibizioni da spettatrice. La serata fu piacevole ma l'impressione era di essere stati in platea invece che a cena. Temo che vivere con un attore o un'attrice sia cosa piuttosto faticosa, difficile ottenere attenzione e difficile convincersi che il dialogo sia proprio con te e non con un pubblico silenzioso alle tue spalle."}, {"userName": "Sketchbook", "userReviewDate": "Feb 07, 2011", "userURL": "http://www.goodreads.com/user/show/4708498-sketchbook", "userReview": "Middle-brows like to put down Maugham, but smarties know you can't put him down. As the author of hit plays, he knew Ethel Barrymore, Gladys Cooper, among others. The stage is an effective prop as he warmly scopes the psyche of a plummy star (her set: asexual husby and priggy son, lesby backer, shopboy lover and his thespy sweetie -- ah, theatuuh). A sublime 'recognition' scene missing from 2 film versions: bored to hell, star decides to 'give' herself to Devoted Friend. Imagine her shock when she realizes he isn't interested in sex, probably was  never  interested.The finale is also cherce. After whammy premiere, she flees by herself to a restaurant and celebrates with verboten steak and fried potatoes. What greater pleasure, at times, can top being left alone? Maugham writes from the bowels of compassion."}, {"userName": "Roberto", "userReviewDate": "Sep 07, 2016", "userURL": "http://www.goodreads.com/user/show/15956368-roberto", "userReview": "Sotto il vestito, nienteJulia è una attrice, una diva. E' bravissima, è capace di piangere a comando, è in grado di strappare da un copione tutto quello che c'è di più bello, ha una presenza scenica perfetta, sa imparare a memoria un copione in 24 ore. E ricorda alla perfezione citazioni da quasi tutti i brani teatrali che ha interpretato.Ma...\"La gente credeva che lei recitasse soltanto nelle due o tre ore che era in scena; non sapevano che il personaggio che interpretava la abitava di continuo: quando sembrava conversare animatamente con qualcuno o in qualunque occupazione fosse impegnata.\"Non c'è una donna chiamata Julia. Quella che tutti vedono alla fine non è altro che il frutto di una recitazione perfetta.\"Pronti a andare in scena. Quelle parole le davano ancora un brivido. Stava per lasciare il mondo della finzione per entrare nel mondo della realtà.\"Solo il figlio, alla fine, la smaschera:\"Quando ti vedevo entrare in una stanza vuota, certe volte volevo aprire la porta d’improvviso, ma temevo di non trovarci nessuno\"Curioso che per Julia tutte le persone che la circondano siano deboli, vanesie e stupide. E che alla fine del romanzo invece quasi tutti i personaggi appaiano migliori di lei, che risulta evanescente, cinica, perfida, sola, invidiosa, vendicativa. E cattiva.La sua tecnica, il suo controllo dei nervi le consentono di governare con freddezza ogni situazione, per evitare figuracce, per evitare di esporsi al ridicolo, per evitare di soffrire, per evitare di mostrarsi deboli.Ma chi è più debole, quella persona che mostra sinceramente le sue insicurezze, la sua sofferenza, i suoi sentimenti oppure una persona che crea una corazza intorno a sé ostentando sicurezza?Cosa rimane comportandosi come Julia? La soddisfazione di recitare bene una parte e la sensazione di essere apprezzati; ma anche la certezza di non avere mai vissuto veramente e soprattutto di non avere mai amato.Quante persone, nel nostro mondo, sono più attente all'immagine esteriore piuttosto che a come sono veramente? Cosa è più importante l'apparenza o il contenuto? Magistrale la scrittura di Somerset Maugham, interessante, efficace, lucida, ironica, elegante; e fantastici anche gli incisi tra parentesi che differenziano ciò che il personaggio pensa da ciò che dice."}, {"userName": "piperitapitta", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/35550351-piperitapitta", "userReview": "E brava Julia!Non avevo letto mai niente prima di Maugham, avevo solo visto la riduzione cinematografica con Edward Norton e Naomi Watts di Il velo dipinto, e sono tuttavia convinta di non aver letto \"il vero\" Maugham.A questo proposito, la scorsa domenica, mi ero portata in spiaggia Schiavo d'amore, intenzionata a leggere uno dei suoi romanzi più famosi: peccato però che trattandosi di un'edizione in due volumi io abbia incautamente portato con me il numero due anziché il numero uno e che me ne sia accorta solo dopo la lettura del primo capitolo (in realtà il numero sessantaquattro) e che poi abbia proseguito, indispettita, leggendone altri tre; incredibile a dirsi non sembrava affatto un romanzo preso a metà: chissà come sarebbe andata se avessi proseguito con questa lettura in corso d'opera!Ma torniamo alla Diva Julia.Maugham, come spiega nell'introduzione, attinge largamente alla sua esperienza di commediografo e da grande conoscitore di teatro qual era diventato - l'opera in originale si intitola, appunto, Theatre - riassume nella figura di Julia Lambert, «la più grande attrice d'Inghilterra», tutte le grandi dive incontrate sulla scena.Lo stile è brioso e attraverso l'espediente di alcune vecchie fotografie, che l'attrice si trova a guardare in un momento di malinconia per i tempi andati, ripercorre la sua storia sin dall'inizio, quando giovane e bella iniziava a calcare i palcoscenici della provincia inglese rivelando il proprio innato talento, fino all'incontro con l'attore Michael Gosselyn - bello e vanitoso e invariabilmente tirchio - che ne sarebbe poi diventato il marito.La Julia del presente è una bellissima quarantenne, idolatrata dal pubblico, che conduce un ormai consolidato ménage coniugale con Michael che regala ormai poche emozioni a entrambi, ma anche un più che soddisfacente rapporto professionale che è culminato nell'acquisto di un teatro londinese e nella costituzione di una compagnia propria.Julia e Michael hanno anche un figlio adolescente, Roger, che studia senza particolari successi in college.La quotidianità di Julia, scandita dalle rappresentazioni, dai riposini pomeridiani, dai massaggi, e soprattutto dai grandi successi, viene stravolta come un fulmine ciel sereno, dall'entrata in scena di Tom, un giovane impiegato del marito, che nonostante abbia poco più dell'età del figlio, la trascina in una passionale relazione.È abilissimo Maugham a narrare la storia dal punto di vista di Julia che è attrice, anzi \"diva\", a tutto tondo. Julia è vanitosa, ironica, melodrammatica, presuntuosa, manipolatrice,arrendevole, gelosa, passionale, insicura, vendicativae, soprattutto, non smette mai, nemmeno per un attimo, di recitare.Maugham ce la presenta in una doppia e irriverente versione, perché non solo vedremo (leggeremo) quello che dice, ma anche quello che realmente pensa mentre lo dice, mostrando anche a noi le sue eccelse qualità di attrice.Alla fine della storia, che volendo ricondurre al teatro si potrebbe definire in tre atti, forse solo Roger mostrerà di aver capito fino in fondo la vera natura della madre, lasciando anche noi lettori in preda, oltre che all'euforia per l'eccellente esibizione, ad un dubbio di natura marzulliana: ma il teatro è vita o tutta la vita è teatro?Nota - Secondo me Zia Mame voleva essere la Diva Julia! :-)"}, {"userName": "Chrissie", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "In the preface to this book and in the audiobook, W. Somerset Maugham tells us that over the thirty years between the production of his first play and his last he came to know “a great number of distinguished actresses. Julia Lambert, the heroine of Theatre, is a portrait of none of them. I have taken a trait here and a trait there and sought to create a living person. Because I was not much affected by the glamour of the brilliant creatures I had known in the flesh I drew the creature of my fancy, I dare say, with a certain coolness. I think Julia is true to life.... I feel a great affection for her; I am not shocked by her naughtiness, not scandalized by her absurdities.”This quote tells us the author’s intentions and hints at what lies in store. Julia, the novel’s central protagonist, is the author’s creation, a composite figure of many. In my view, by taking traits from an assortment of different people, Julia fails to become real, fails to become the living person Maugham sought to create. We are given a figure made up of a conglomeration of traits found in successful actresses, but not a creature that lives and breathes. I did not come to understand her choices or why she did what she did. Her relationships with her husband, son and lovers did not ring true to me. She loves her husband and then she doesn’t, but we never come to understand why her perception of him has so radically changed. She is an actress, only an actress albeit in all that she says, thinks and does, but not a full person.The book focuses on drawing a “born actress” rather than drawing one realistically drawn woman who happens to be a successful actress. Do you see the difference? Am I clear? The book does ask:What makes an actor or actress tick?What drives them?How do they see themselves?How do they react to the world around them? And can a born actor or actress ever stop acting? Julia’s son Roger says to his mother:“You don't know the difference between truth and make-believe. You never stop acting. It's second nature to you. You act when there's a party here. You act to the servants, you act to father, you act to me. To me you act the part of the fond, indulgent, celebrated mother. You don't exist, you're only the innumerable parts you've played. I've often wondered if there was ever a you or if you were never anything more than a vehicle for all these other people that you've pretended to be. When I've seen you go into an empty room I've sometimes wanted to open the door suddenly, but I've been afraid to in case I found nobody there.” Look at the quote in the preface for a second time. Maugham tells us that he drew Julia with a “certain coolness”. This coolness, this detachment, is evident in the writing. I didn’t like this.The setting of the book is primarily England before and after the First World War. There are excursions to France.The audiobook is well narrated by Lucy Scott, although the preface is read way too fast, like she was saying to us, “Let’s just skip this and get to the story!” Afterwards, the narration is easier to follow. She captures different accents well.This is certainly not my favorite book by the author, but I do not regret reading it. It’s OK. I know little about the personality traits of actors and actresses. As a playwright, Maugham did. In this respect I found it mildly interesting to hear what he had to say about those in the acting profession. I cannot say I am attracted by such people. Viewed simply as a book about a fictional character, I was not sufficiently drawn in.My ratings of Maugham’s books:Mrs Craddock 4 starsCakes and Ale 4 starsThe Painted Veil 4 starsThe Razor's Edge 3 starsChristmas Holiday 3 starsTheatre 2 starsThe Moon and Sixpence 2 starsOf Human Bondage 2 stars"}, {"userName": "Mikela", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/4405952-mikela", "userReview": "[Despite the difference in their ages, his attention is flattering and they begin an affair, so passionate that Julia finds herself looking and feeling 20 years younger until the time he rejects her, leaving Julia hurt, humiliated and at a loss. (hide spoiler)]"}, {"userName": "Efka", "userReviewDate": "Jun 25, 2015", "userURL": "http://www.goodreads.com/user/show/22832688-efka", "userReview": "W. Somerset'as Maugham'as, nors lyg ir labai pakankamai nemažai žinomas ir populiarus, man ilgą laiką buvo visiška paslaptis, apie kurį žinojau tik tiek, kad turi gan keistą vardą ir, kaip galvojau, yra zanūda - nes aš by default taip galvoju apie visus, kurie save vadina pirmo vardo pirma raide ir antruoju vardu, pvz., J. Edgar Hoover ir...ir... Ai, nesvarbu, ok, užtenka ir Hooverio, kuris buvo zanūdų zanūda ir šiaip nemalonus žmogus. Bet kuriuo atveju, šita knyga man buvo žiauriai malonus atradimas. Tikėjausi tokio nuobodoko skystalėlio, pilstymo iš tuščio į kiaurą, ilgų, nuobodžių, niekam neįdomių peizažų aprašymų ir kitokio panašaus šlamšto, būdingo neretam klasikiniam autoriui. Vietoj to gi gavau smagią, puikiu stilium parašytą, gyvą ir įtraukiančią istoriją. O personažai!! Labai mėgstu, kai autoriai, užuot patys pasakoję apie savo kuriamus personažus tuo tradiciniu būdu - \"Petras buvo atstumtas Marytės, todėl turėjo nepilnavertiškumo kompleksą ir dar nepasitikėjo savim dėl didelių ausų\" - tiesiog kuria veiksmą, kuriame dalyvaujant minėtiems herojams be jokių papildomų aprašymų ir pastabų skaitytojui paaiškėja, kokio medžio paukščiai šie besą. Pats siužetas gal kiek ir banalokas, bet puikiai, meistriškai kuriamas, nenaudojamas nei vienas nereikalingas žodis, nėra jokio gražbyliavimo ar bereikalingo filosofavimo, visaks gaunasi paprastai ir natūraliai, autoriaus pamąstymai labai trumpi, konkretūs, ir labai vietoje, labai gerai atskleidžiamos pagrindinės herojės vidinės dilemos ir ypač baimės - pasenti, būti nebepatraukliai scenoje ir gyvenime - tad skaitėsi puikiai, greitai ir labai maloniai. Neabejoju, kad su šiuo autorium mano pažintis dar prasitęs. Labai gera knyga. P.s. - papildomas honorable mention skiriamas leidyklai (maketuotojai?) už pasirinktą šriftą, kuriuo knyga buvo atspausdinta. Ai laikt it!! :)"}, {"userName": "Susan", "userReviewDate": "Dec 21, 2013", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "This wonderful novel was published in 1937, when W. Somerset Maugham was already an extremely successful writer – both as a novelist and in the theatre. In fact, much of Maugham’s early success was in the theatre and it was a world he knew extremely well. The heroine of this book is Julia Lambert, an ageing actress whose husband, Michael Gosselyn, manages the Siddons Theatre and her career. They have one son, Roger, and a marriage which is respectable, but passionless. Julia is flattered when her husband brings a young man to lunch; an accountant who obviously admires her. Neither Julia, nor Michael, even know the young man’s name, but she sets out to be charming. Julia is certainly not without admirers, including the wealthy Charles Tamerley, but she uses her abilities as an actress to control and manipulate men. However, the young man in question, Tom Fennell, turns out to be a surprise – as before long she becomes besotted with him. Maugham writes of the situation that Julia finds herself in with exquisite sensitivity. You feel for her, as events spiral out of her control – and as for the ending.... Well, I have no wish to give anything away, but it is brilliantly written. This is Maugham at his most self assured and confident, in his prime and writing of a world he loved and understood. It is one of his lesser known novels, which is a shame, as it is an utter joy to read."}, {"userName": "SCARABOOKS", "userReviewDate": "May 18, 2013", "userURL": "http://www.goodreads.com/user/show/19291574-scarabooks", "userReview": "Per chi non lo sapesse, Somerset Maugham è un autore assolutamente delizioso (deliziante, mi verrebbe). Lo è per il tono confidenziale, per l’ironia rarefatta, da alta quota, con cui aggancia il lettore. Poi ha uno stile piano, apparentemente semplice nella costruzione della frase, che è poi la semplicità dell'arte. Nella scelta degli aggettivi non è mai caricaturale, ma nemmeno sbiadito e banale . E’ accurato fino alla pignoleria quando sceglie e arreda il set del racconto.Dove però dà il massimo è nel rapporto che costruisce tra narratore e personaggio. In particolare, nel rapporto con le figure femminili puoi rintracciarci sentori diversissimi che dovrebbero essere inconciliabili: complicità, perfidia, ammirazione, esecrazione, immedesimazione, simpatia. Viene da pensare a certe amicizie tra donne che si nutrono di intime confidenze e feroci invidie, ad atmosfere tipo “arsenico e vecchi merletti”. Si potrebbe pensare, ricordando la sua peraltro discreta omosessualità, al fiele misogino di una “vecchia checca” o al contrario al bisturi della verità, che si applica neutro sulle donne come su tutto il resto. Una sottigliezza chirurgica che gronda empatico cinismo come se fosse sangue.In questo romanzo al centro c’è un’attrice e dunque più che mai la recitazione come professione della vita. Non solo in teatro, non solo per chi fa l’attore: “'Tutto il mondo è teatro, e uomini e donne solo commedianti. Ma l'illusione sono loro, oltre quegli archi; la realtà siamo noi, gli attori”. Ne viene fuori una affollata storia d’amore, originale piuttosto che nella trama, nel modo di viverla della protagonista (che è una figura spettacolare, in tutti i sensi). E nella lezione che se ne trae: “Cos'è l'amore in confronto a una bistecca con le cipolle?” (con birra e patate fritte, però).Ho ammirato \"a bocca aperta\" la precisione geometrica che usa nel descrivere il momento esatto in cui nella mente della sua Diva l'amore si allinea al disincanto (nella percezione di essere sola a provare davvero un sentimento); la passione convive con la disistima (e quindi con la consapevolezza della sua arbitraria gratuità); la generosità con la sfiducia; la presunzione nei propri mezzi con la sensazione di rischiare le cose della vita che contano davvero e per di più di sprecare il rischio in un’opera vana, in un gioco che non vale la candela. Equilibrismi della mente e del cuore che solo un sofisticato equilibrista della narrazione può rendere.Chiudo, ma non senza segnalare il modo in cui Maugham usa le parentesi: come una confidenza sussurrata all’orecchio, come un perfido controcanto, come la verità dal sen fuggita, come la voce della coscienza, come l'espressione del distacco, della giusta distanza. Un’arte a sé (saper usare le parentesi, dico. Anche nella vita)."}, {"userName": "Nona", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/22041268-nona", "userReview": "ჯულია არის ქალი,რომელსაც ნაკლებად ადარდებს თუ რას ფიქრობენ მასზე,როგორც პიროვნებაზე.საკუთარი რეპუტაცია არ აღელვებდა. თუმცა ტკივილს აყენებდა,როცა ჯულია ლამბერტს -  მსახიობს შეურაცხყოფდნენ.თეატრი იყო მისი ცხოვრება. სხვა ცხოვრება მას არ გააჩნდა.ნელ-ნელა მზიზღდებოდა ეს პერსონაჟი,თუმცა შეუძლებელია სიბრალული არ მეგრძნო.მისი ისტორიის გაგრძელებას კი სიამოვნებით წავიკითხავდი.მოემის წერის სტილი ძალიან მომეწონა,მარტივი და სასიამოვნოა.როჯერის სიტყვებს გავიმეორებ: \"They say acting is only make-believe. That make-believe is the only reality.\"\"The tragedy of life is that sometimes we get what we want\""}, {"userName": "Mickey", "userReviewDate": "Dec 02, 2008", "userURL": "http://www.goodreads.com/user/show/15631-mickey", "userReview": "It's funny how life works out -- I was at the local library, trying to find a book to cheer myself up when lo, I encounter the one author that has never failed me. Like all the other Maugham novels, I had no trouble with the style, voice, plot, characters, or reflections of this story. I don't agree with his take on love, but I understand what he means. I love that reading Maugham's novels is like reading something that I would write for myself. (Somerset Maugham; 300)"}, {"userName": "Jamie", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/51089-jamie", "userReview": "“The tragedy of life is that sometimes we get what we want.”(This is a good one, about real-life and make-believe and which one is which. Which one is which? And there you have it, Maugham does it again.)"}, {"userName": "C.S. Burrough", "userReviewDate": "Sep 26, 2015", "userURL": "http://www.goodreads.com/user/show/29928450-c-s-burrough", "userReview": "After relishing Of Human Bondage, penned 22 years before this and adapted into a career-defining Bette Davis movie, I was surprised on several levels by Theatre, whose 2004 screen adaption scored Annette Bening a Best Actress Golden Globe and an Oscar nomination for Being Julia.Firstly, I was surprised by its great readability, of the kind that defies conventional analysis; that literary X-factor distinguishing great writers from good ones, their material striking an artful balance between adequacy and audacity. Secondly, I was surprised that Theatre's magic is not in its delivery, which is clunky for such a successful wordsmith (he had this published in 1937, forty years after his breakthrough novel, Liza of Lambeth). Nor is his command of vocabulary so apparent here, as was noted by contemporary critics, several of whom were unimpressed by this novel.Thirdly, I was surprised to see that word economy was not one of Theatre's notable stylistic features. Maugham's evolved indifference to narrative refinement suggests publication teams had become shy of engaging with this giant. Nor is the style, conversely, so flamboyant. Perhaps he had simply come to hold less concern for form than his less prolific contemporaries, more confidence in the purity of his storytelling. This is strangely reassuring. Those first three questions collectively begged the fourth and ultimate one for me: how did he get away with being so blasé?I believe the answer is that, like so many prolific masters of the era, Maugham had relaxed into his art sufficiently not to need to prove much anymore. This piece might never have kick started his career, decades before; his vast readership had simply, by 1937, developed a steady appetite for whatever he wrote.The essence of this fiction lies in its bare substance, rather than its presentation. As such, Theatre defies the discerning reader's better judgement by refusing to be put down despite conspicuous imperfections. Its key strength lies in the authentic characterisation, most notably that of protagonist Julia Lambert. Perhaps a crucial ingredient is its triggering of the reader's speculation as to which of this novelist-playwright's countless actress friends Julia Lambert parodies – not that she is a mere parody; on the contrary, here is a finely nuanced and compellingly original heroine. Maugham was famously friends with the likes of Gladys Cooper and Ethel Barrymore, to name but a couple, which lures the inquisitive mind down intriguing paths.I devoured this roughly crafted gem like a famished hyena and shan't hesitate rereading it down the track."}, {"userName": "Grazia", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/29190640-grazia", "userReview": "\"La finzione è la tua verità\"Julia è una attrice. Non un'attrice qualunque, una diva, come la Duse. La più grande attrice del Regno Britannico.Julia è l'indiscussa protagonista del romanzo, primadonna com'è come potrebbe essere altrimenti?Tutti scompaiono al suo cospetto, perché lei, la diva, interpreta con genio e recita non solo sul palco... la vita si confonde col palco. Ciò che dice, le situazioni e le emozioni che vive, sono echi delle piece che ha interpretato. Non pensa... replica battute ed aforismi di scena.Julia si sostanzia di finzione. Esiste solo in quanto finzione. E chi le sta intorno (figlio escluso) la vuole solo per il suo ruolo, per la sua verve, per il suo indiscusso talento, per il suo successo, per la sua popolarità ... poco importa scoprire chi sia Julia. Non importa a nessuno sapere se sotto il cerone ci sia una persona, non importa neanche alla stessa Julia....\"Tu non esisti, sei solo le parti innumerevoli che hai interpretato. Mi sono chiesto spesso se esistesse un ‘tu’ o se tu non fossi altro che un veicolo per tutte queste altre persone che fingevi di essere. Quando ti vedevo entrare in una stanza vuota, certe volte volevo aprire la porta d’improvviso, ma temevo di non trovarci nessuno”.Forse troppo spessa la scorza che si è dovuta costruire per evitare di essere ferita o forse son solo io che la voglio leggere così.Julia è cinica, falsa, vendicativa... Julia trova tutti gli uomini noiosi, nessuno pare essere alla sua altezza, Julia disprezza tutti, si fa beffe di tutti, si bea della facilità con cui recitando, riesce a manovrare le persone che le stanno intorno...In Julia vedo una donna profondamente disillusa e sola... che non ha affetti reali, che per nessuno conta in quanto persona.E d'altra parte per vivere occorre svelarsi, mettersi in gioco, ammettere la possibilità di soffrire... e siccome per la diva questo non è possibile, l'unica forma di felicità che si può concedere è una bistecca con cipolle accompagnato da birra, in amara compagnia di sé stessi... .[unico appunto: descrivi Julia come una donna che per calcolo agisce in un certo modo. Disdicevole, ma potrebbe essere confusa per \"furba\", con accezione italiana positiva. Secondo me Julia è NEGATIVA, non c'è, non esiste. Esiste solo la sua immagine. Ma sono solo punti di vista lievemente diversi....]Un romanzo affilato, ironico e scritto con gran classe. Julia esce dalle pagine: a fine lettura ti sembra di averne fatto la conoscenza. Magistrale l'uso degli incisi che fa Maugham per rappresentarne i pensieri.Davvero un gran bel romanzo!"}, {"userName": "Lee Anne", "userReviewDate": "Aug 19, 2010", "userURL": "http://www.goodreads.com/user/show/966521-lee-anne", "userReview": "\"When I've seen you go into an empty room I've sometimes wanted to open the door suddenly, but I've been afraid to in case I found nobody there.\"That's what Julia Lambert's teenage son tells her. The greatest actress on the London stage, but fast approaching late middle age, her entire life is one grand performance, and she seems to always know what the role calls for. She's the adoring, faithful wife in a sexless marriage to Michael, her stage manager/director husband, who's a former actor of mild talent and extraordinary beauty. She manages, mostly, to conceal her true feelings for Tom, the oversexed, social-climbing, poor and very young accountant with whom she has her first and only serious affair. She makes many dramatic scenes for Charles, the older wealthy man who's loved her for twenty years--lots of lip biting and tears for their love that can never be, although Julia would never dream of leaving Michael, even if she actually wanted to. And for Roger, her son, she plays the devoted mother, although he eventually sees through that, to the performance it really is. This is a great little melodrama, and a fast read. Maugham is the best."}, {"userName": "Lucrezia", "userReviewDate": "Nov 07, 2012", "userURL": "http://www.goodreads.com/user/show/9859921-lucrezia", "userReview": "Maugham non si smentisce mai e questa volta mi ha tenuta incollata alle pagine più che mai.Non adorare Julia Lambert? Praticamente impossibile...Non potrete sfuggirle metterà nel sacco anche voi, ha qualche bel trucco appositamente studiato per conquistarvi, provare per credere. ;)"}, {"userName": "Tatevik", "userReviewDate": "May 11, 2012", "userURL": "http://www.goodreads.com/user/show/7377638-tatevik", "userReview": "I think the only male author who can create a really strong woman character!!! Definitely needs a reread."}, {"userName": "Tittirossa", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/4445484-tittirossa", "userReview": "Un sublime egoismo salva Julia dalla noia e dalla disperazione. A 40 anni, miglior attrice inglese con l’inglesissimo marito Michael che l’ama a tal punto da preferirla a una partita a golf, conosce l’adorazione di Tom, giovane contabile arrivista con solo l’ardore della gioventù. Per noia ha una relazione con lui che finisce appena Julia si rende conto che Tom in realtà è innamorato di una ben più giovane e sciapa attricetta. I momenti più esilaranti sono quelli in cui Julia è amabilmente ipocrita a parole, mentre dentro di sé si anima di spirito corrosivo e sincero che non può mai emergere, ma che l’ha sorretta in tanti anni di finzione. Perché la sua immagine di “attrice” deve combaciare con quella “reale”. Julia molla Tom dopo uno strepitoso successo teatrale (in cui si è pure tolta lo sfizio di uccidere per sempre la carriera dell’attricetta) e si butta tra le braccia di Charles, l’ultra ventennale spasimante quotato erroneamente da tutti come suo amante. Salvo comprendere – un secondo prima del disastro - che Charles è innamorato dell’idea di essere innamorato di lei ed è semplicemente atterrito dal pensiero di un incontro carnale. Gli uomini fin qui sono tutti inetti di contorno: Michael col suo imbattibile fiuto per i successi di critica e pubblico e la sua frigidità tutta anglosassone; Tom che si avvicina al suo cuore senza minimamente comprenderla; Charles che la usa forse più di tutti. L’unica speranza è il futuro, Roger, il figlio. Ma anche lui è solo un brioso ragazzetto che crede di aver compreso tutto di sua madre senza aver capito nulla: per lui è solo una vuota maschera teatrale perché in lei il recitare è così spontaneo che ha sostituito la vita. Ma in realtà nessuno di loro ha capito che Julia recita in ogni istante per difendersi da loro, e dalla loro abissale stupidità. Ps: leggere WSM è piacere puro."}, {"userName": "თინათინო მიქელა", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/32310197", "userReview": "<3"}, {"userName": "Olga", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/7654876-olga", "userReview": "Театр для меня - священное место, где отдают дань Его Величеству Искусству. Он меня манит, прельщает своими радостями и горестями, которым веришь, и одновременно понимаешь, что это все всего лишь игра, но как актеры это делают, выворачивая души зрителей наизнанку!Я не подозревала этого раньше, но оказывается я всегда мечтала прочитать Настоящую книгу о теарте и актерах. Только эта книга должна быть очень качественной, в противном случае это будет как плохая игра актера - приторно и безвкусно. И наконец-то я нашла книгу, которая окунула меня с головой в Театр. 3 дня я жила этим миром. 3 дня я думала только о главной герионе и ее жизни.\"- Не делай паузы, если в этом нет крайней необходимости, - гремела старая актриса, колотя кулаком по столу, - но уж если сделала, тяни её, сколько сможешь.\" Будешь ли ты любить или презирать Джулию, но не уважать ее просто невозможно. Я думаю, именно такой и должна быть великая актирса, которая стирает границы между реальностью и театром, игрой и жизнью. Кто-то скажет она велика, кто-то скажет что ее, как таковой, не существует за призмой ее ролей...Полный восторг! Открыла для себя Сомерсета Моэма с его потрясающим языком, однозначно буду читать его еще."}, {"userName": "Sara", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/4930019-sara", "userReview": "LOVED this book. It was such a delicious read. And Julia Lambert is a completely unforgettable character. I could have continued reading her story for another 1000 pages. The story follows the rise of a theatre (stage) star - Julia - and is told from her point of view and it's so fun to watch her 'perform' her way through life, through affairs, through motherhood, and watch (sometimes with shock, sometimes with awe) as she manipulates those around her, and the entire time you have this uneasy feeling that it is those around her who are the true manipulators. Is she so delusional as to truly believe that she is in charge of her life as she thinks? Or is she? I'm not sure. This book will leave you examining your own life and wondering which parts of it you act, and which parts are not a performance...truly this book was fascinating."}, {"userName": "Katya", "userReviewDate": "Feb 25, 2011", "userURL": "http://www.goodreads.com/user/show/4529580-katya", "userReview": "Хороший роман, но не цепляет. Обычно в книге сопереживаешь героям, ставишь себя на их место. А тут - просматриваешь события со стороны, но не погружаешься полностью в книгу. Может быть это потому, что книга не о людях - книга о театре, об актерской игре. Для главной героини театр, игра - это вся ее жизнь, точнее даже то, что жизнь заменяет. Импонирует мне в ней то, что она действительно умная женщина, она умеет побеждать свои эмоции и добиваться того, чего хочет. Больше всего мне понравился диалог Джулии с сыном - он проявляет не по годам взрослую рассудительность, и глубину рассуждений, а Джулия хоть и понимает то, о чем говорит сын, пугается тех вещей, которых нет в ее уютном мирке, вещей, которые не описываются в пьесах и она не знает как с ними быть. И концовка мне кажется, очень хороша - когда человек наконец-то находит гармонию с собой. Это всегда прекрасно!"}, {"userName": "Lala Məmmədova", "userReviewDate": "May 29, 2015", "userURL": "http://www.goodreads.com/user/show/16928960-lala-m-mm-dova", "userReview": "... и я тебя :)"}, {"userName": "Tsvetelina Mareva", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/38037688-tsvetelina-mareva", "userReview": "Сега Джулия разбираше защо през пролетта беше играла толкова лошо, че Майкъл бе предпочел да свали пиесата и да закрие театъра. Това бе станало, защото тя изпитваше чувствата, които би трябвало да изобразява. Ето кое беше лошо. Трябва да си изпитал тези чувства, но да ги изразиш на сцената, можеш само когато вече си ги преодолял. Спомни си думите на Чарлс, че поезията се ражда от емоция, която си припомняш в спокойно състояние на духа. Тя нищо не разбираш от поезия, но в театъра нещата стояха точно така."}, {"userName": "Domenico Fina", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/69926492-domenico-fina", "userReview": "Maugham rientra in quel gruppo di scrittori che sanno narrare con piacevolezza, un artigiano che non trascura nulla."}, {"userName": "Beka Adamashvili", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/35301611-beka-adamashvili", "userReview": "შეიძლება მთელი სამყარო იყოს თეატრი, მაგრამ \"თეატრი\" ნამდვილად არ არის მთელი სამყარო."}, {"userName": "(P)Ila", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/43836143-p-ila", "userReview": "Probabilmente è, tra quelli da me letti fino ad ora, il romanzo di Maugham che più stenta ad ingranare. Per tutta la prima metà del libro mi sono chiesta dove volesse andare a parare l'autore, lo stile che amo era sempre lì ma c'era qualcosa che non mi convinceva del tutto.La vicenda ci è narrata dalla stessa protagonista: Julia è di quelle bellezze particolari, che affascinano un uomo per il portamento elegante e per la personalità stuzzicante piuttosto che per il semplice gusto estetico, ad inizio romanzo la vediamo giovane attrice che si innamora perdutamente di Michael, un uomo invece il cui aspetto esteriore l'ha aiutato in campo artistico e non solo, non ha molto talento per la recitazione ed è incapace di immedesimarsi in personaggi che non siano freddi e distanti perchè lui stesso è proprio così anche nella vita reale, un uomo distante per cui le effusioni non hanno nessun significato.Ammaliata dall'uomo bello e impossibile, dopo pochi anni di matrimonio, Julia capisce di aver commesso un errore, il matrimonio che tanto agognava e l'uomo che tanto desiderava si rivelano essere più una farsa che una realtà ma lei, da Diva che conquista qualunque pubblico, continua a calcare le scene, anche dietro le quinte. Sarrà l'arrivo di un contabile tutt'altro che sfuggente a mettere a dura prova l'interpretazione della favolosa Julia.Il lato che mi ha colpita di Julia è la sua costanza nel non voler vedere il fallimento, il costante bisogno di recitare anche fuori dal palcoscenico, la sua personalità ambigua. E' una figura che, lasciati da parte per un secondo i ruoli che interpreta, agisce secondo le contraddizioni e i pensieri contorti di noi semplici donne che vengono abilmente svelati dalla mano elegante di un certo signor Maugham, il quale si conferma un grande conoscitore dell'animo femminile. (E poi si dice che gli uomini non riescono a capire la donna eh?!Dovevate chiederlo a lui!)E' una protagonista che ho faticato ad amare proprio per la sua \"arte recitativa\", per i suoi finti sentimenti e per i suoi ambigui rapporti con amici e parenti; nemmeno nel momento in cui intraprende una relazione con il contabile, Tom, riesco a immedesimarmi nelle sue scelte, la consapevolezza di essere usata dal giovane ragazzo come trampolino per entrare nella società che conta e stare comunque al gioco non posso accettarla, come non posso accettare i suoi cambi di umore e di piano per riconquistare le persone che ad un certo punto sembrano aver capito l'antifona.Nonostante questo rimane sempre una donna, complicata sì ma come lo siamo un po' tutte noi, che in certi momenti ci svela la sua vera identità ma la cui farsa verrà svelata incredibilmente dall'unica persona che le sta accanto senza un secondo fine, il figlio Roger, le cui parole non posso che condividere:\"Tu non distingui tra verità e finzione. Non smetti mai di recitare, per te è una seconda natura. Reciti quando ci sono degli ospiti. Reciti con i domestici, reciti con papà, reciti con me. Con me reciti la parte della madre amorosa e indulgente, e celebre. Tu non esisti, sei solo le parti innumerevoli che hai interpretato. Mi sono chiesto spesso se esistesse un \"tu\" o se tu non fossi altro che un veicolo per tutte queste altre persone che fingevi di essere. Quando ti vedevo entrare in una stanza vuota, certe vole volevo aprire la porta d'improvviso, ma temevo di non trovarci nessuno.\"Sono parole dure certo, che spiazzano l'attrice, ma che trovano conferma nella sua realtà.La diva Julia è praticamente una lunga analisi della protagonista, una figura che viene quasi eviscerata dall'abile penna di Maugham con ironia e pungente verità; è un romanzo che, nonostante sia partito leggermente in sordina per poi scatenare tutto il suo potere nella seconda metà del libro con l'arrivo di Tom, è scorrevole e a tratti l'ho trovato di una naturalezza malinconica ma non c'è un solo momento di banalità; lo stile di Maugham del resto è sempre raffinato ed ironico.Julia, a dispetto di ogni opinione personale, è la padrona indiscussa del romanzo, i personaggi maschili non sono minimamente all'altezza della sua complessità e neanche del suo talento....provateci voi a resistere mentre vi stanno facendo a pezzi."}, {"userName": "Sergey Tomson", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/26669513-sergey-tomson", "userReview": "на самом деле (\"Бедный ягнёночек!\") рассчитывал, что там будет больше театра. Конкретно в этом случае граница храма с притвором оказалась слишком размытой в силу профессиональной деформации героини. Что до театра, так это чистой воды утопия в масштабах отдельно взятой актрисы, у которой вообще-то всё прекрасно, она чувствовала себя способной создавать драматургов из ничего, жонглируя. При ближайшем же рассмотрении, под маской овцы срывался волк, под маской волка – олень и так далее до дюжины чертей на помеле… Существует ли такая зверушка в дикой природе я не знаю, но в современном мире она могла бы стать успешным коучером. Как вертеть мужиками: многоходовочка. В книжных соц. сетях не устают восхищаться характером героини, её блестящей ироничностью и готовы носить её на воздусях. Однако не стоит упрощать, это ведь и её драма, которую стоит попробовать на соль, чтобы на склоне зим: \"Что такое любовь по сравнению с бифштексом?\" – не стало коронной фразой. Что ха-ха? Поминая Шекспира, книга может стать неслабой обличительной проповедью любому из нас 👆🏼"}, {"userName": "VeeDawn", "userReviewDate": "Aug 17, 2014", "userURL": "http://www.goodreads.com/user/show/2627519-veedawn", "userReview": "I always love how Somerset Maugham tells a story, and his characters; and being a play write himself this subject matter is his area of expertise. Here Maugham writes the story of Julia Lambert, a woman with so much talent she is one of the greatest actresses England–-she is so good, in fact, that perhaps she never stops acting.Her teenage son tells her, “You see, I’ve lived all my life in an atmosphere of make-believe. … You never stop acting. It’s second nature to you. You act when there’s a party here. You act to the servants, you act to Father, you act to me. To me you act the part of the fond, indulgent, celebrated mother. You don’t exist, you’re only the innumerable parts you’ve played. I’ve often wondered if there was ever a you or if you were never anything more than a vehicle for all these other people that you’ve pretended to be. When I’ve seen you go into an empty room I’ve sometimes wanted to open the door suddenly, but I’ve been afraid to in case I found nobody there.”This book will leave you examining your own life and wondering which parts of it you act, and which parts are not a performance…"}], "description": "In Theatre, W. Somerset Maugham–the author of the classic novels Of Human Bondage and Up at the Villa–introduces us to Julia Lambert, a woman of breathtaking poise and talent whose looks have stood by her forty-six years. She is one of the greatest actresses England–so good, in fact, that perhaps she never stops acting.It seems that noting can ruffle her satin feathers, until a quiet stranger who challenges Julia's very sense of self. As a result, she will endure rejection for the first time, her capacity as a mother will be affronted, and her ability to put on whatever face she desired for her public will prove limited. In Theatre, Maugham subtly exposes the tensions and triumphs that occur when acting and reality blend together, and–for Julia–ultimately reverse.", "title": "Theatre", "url": "https://www.goodreads.com/book/show/31326.Theatre", "average": 4.14, "cover": "https://images.gr-assets.com/books/1403185921l/31326.jpg", "reviews": 214, "authors": [{"url": "https://www.goodreads.com/author/show/4176632.W_Somerset_Maugham", "name": "W. Somerset Maugham"}], "type": ["Classics", "Fiction", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/31326.Theatre", "http://www.goodreads.com/book/show/9697814-la-diva-julia", "http://www.goodreads.com/book/show/25015852-teatras", "http://www.goodreads.com/book/show/1077363.Theatre", "http://www.goodreads.com/book/show/33617846", "http://www.goodreads.com/book/show/6393572-theatre", "http://www.goodreads.com/book/show/17208732", "http://www.goodreads.com/book/show/13075487", "http://www.goodreads.com/book/show/31548.Of_Human_Bondage", "http://www.goodreads.com/book/show/31196.The_Razor_s_Edge", "http://www.goodreads.com/book/show/99664.The_Painted_Veil", "http://www.goodreads.com/book/show/44796.The_Moon_and_Sixpence", "http://www.goodreads.com/book/show/191793.Cakes_and_Ale"]}