{"ratings": 360, "userreviews": [{"userName": "Margitte", "userReviewDate": "Aug 31, 2016", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "The story centers around an adopted daughter of a loving Bengali family who finds herself lost between worlds. Zubaidah Haque experiences a liberated life at Harvard where she becomes a paleontologist, participates in a dig at Baluchistan, Pakistan, to search for the walking whale,Ambulocetus, and then move back to Bangladesh to get married to her childhood friend, Rashid. She leaves behind the love of her life. The book is an epistle to Elijah Strong in which the explains her decisions to him. She struggles to find her footing in life as a result of her history as an adopted child, the country's political upheavals, and the cultural anomalies between her adopted country and her motherland.The text is atmospheric, rich, intense, captivating, spicy, strong, lyrical, written with a melancholic elegance. The narrative is fundamentally beautiful. Historical fiction reigns supreme. The love story pulls all the events and issues together, instead of being a mainstream diluted untruth for love-addicts. Hardships, tragedy, resilience, pride, loyalty, family values, social inequalities, and cultural treasures vividly fill up the pages with colorful vistas. British novelist, Tahmima Anam, concludes the Bengal trilogy with this book covering the history of Bangladesh's freedom struggle and revolution. I accidentally started out with this book, instead of the first book, A Golden Age. The second book in the series is titled The Good Muslim. The series addresses the history of a grandmother, a daughter and then the adopted granddaughter in the ever changing political arena of the country. In this respect it reminds me of Wild Swans - Three daughters of China by Jung Chang.  I am a bit between a rock and a hard place with this book. I really enjoyed the experience, however ...... it left me exhausted instead of inspired. Somewhere along the road, it lost me in too much word dumping, too many characters and an overall messiness in texture and scope. Although it was highly informative, it also tried to cover too many issues, turning the drama into mediocre overkill. Even the ending became one long unnecessary explanation of the obvious. That's a personal opinion. It could have been a powerful tour de force. However, someone killed the possibility and it was not the reader. Instead of 'WOW!' at the last concluding sentence, it ended with 'Thank You Universe it's finally over!' - for me, at least. Someone should have told the protagonist to just stop talking. A good editor, for instance. But that's just me.However, curiosity will not only kill a few cats. Somewhere along the line, I want to read the other two books in this series as well. Yes, figure that one out!"}, {"userName": "Emma", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "This book is beautiful and lyrical, it feels like someone is reading you the secrets of their soul. Each sentence is musical, yet thoroughly conversational, so that it reads as a halting, emotional confession, full of additions and qualifications. It's so personal that I followed the story with a tightness in my chest and sometimes tears in my eyes. Tahmima Anam is a real talent, not just in style but in her creation of character. So rarely do I leave a book believing that I know a person so thoroughly, that I understand their choices so well. She addresses the tensions in individual identity; how someone can be pulled in opposing directions by love, culture, science, history. I didn't realise that this was the last part of a trilogy. As powerful as this was alone, I'm looking forward to reading the others and adding an even richer sense of the past to this generational story. Many thanks to Tahmima Anam, Canongate Books, and Netgalley for this copy in exchange for an honest review."}, {"userName": "Paromjit", "userReviewDate": "Apr 24, 2016", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "To be honest, I read this book some time ago but in the midst of the chaos that is my life, forgot to write the review. This is a beautifully and lyrically written novel about a woman's search for who she really is given that she is adopted and caught between two cultures. She is based in the US and is a paleontologist looking to understand who she is. In a compelling narrative, the tale penetrates what are the deepest parts of a human being. Inevitably, that touches on love and family. She wants to get in touch on her Bangladeshi connections. So we encounter issues of class and culture whilst coming to terms with the past and the present. The characterisation is done well and invested with emotional intensity and insights. A book to savour! Many thanks to Canongate for an ARC."}, {"userName": "Marianne", "userReviewDate": "May 07, 2016", "userURL": "http://www.goodreads.com/user/show/5067228-marianne", "userReview": "“You realise, don’t you, Elijah, that this is the way you worked your way into my heart? Not just in those days together in Cambridge, but in the aftermath, when I couldn’t stop talking about you, when every turn of my story included a footnote of conversation as I pictured how you might respond, the way the desert light would catch your hair, the effect of the parched, history-heavy air on your voice. What would you have made of all this, the green flags of our tents on the lunar surface of this ancient place, our little argument with time”The Bones of Grace is the final book in the loosely connected Bengal trilogy by British Bangladeshi writer, novelist and columnist, Tahmima Anam. Zubaida Haque is writing to the man she fell in love with one Cambridge afternoon at a Shostakovich Preludes concert. Elijah Strong is not the man she married, but Zubaida is writing to explain what led to her the actions that she knows broke his heart. The story she tells, parts of which he of course knows well, details their first meeting, just days before she departed for an archaeological dig in Pakistan. As a palaeontologist, Zubaida has been selected to help unearth the bones of the “walking whale”, Ambulocetus, near a remote village. But events conspire to put her back in her hometown, Dhaka, much sooner than expected, and she finds the pressure to enter into the expected marriage, too much to resist. Anam’s extensive research into many topics is apparent on every page and she manages to include a myriad of interesting subjects in her narrative: as well as the evolution of the whale and archaeology digs, she explores the industry of ship-breaking, the plight of ex-pat construction workers in Dubai, undocumented adoption and the search for a birth mother, and for a long-lost lover. She weaves a wealth of curious facts into a plot that itself is mesmerising, and does so with some gorgeous descriptive prose. “The light came in as we waited, and then there it was, a sliver on the horizon. We watched as it grew. More of the men arrived, wiping the sleep from their eyes. The curve of the ship began to appear, and now we could see the gleam of the hull, a poem of curves rising out of the remnants of dark, and suddenly it was before us, as if it had turned a sharp corner, white, immense, violent” and “She is a person with guilt at the very core of her being, and she spends her days compensating others for the fortune that brought her a life, a marriage, me. She is a moral economy all to herself, painted in tiny strokes of the past” are examples.Anam’s characters are multifaceted, all have flaws, and the reader cannot help but care about their fate. While this novel is part of a trilogy, it can easily be read as a stand-alone, but readers are likely to want to seek out the earlier books by this talented author. A brilliant read."}, {"userName": "Book Riot Community", "userReviewDate": "Jun 29, 2016", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "Zubaida is a student in Cambridge when she falls for Elijah, but the stars are not aligned for the star-crossed lovers, and she returns to her country to follow her family’s plans for her future. Disheartened and stifled by her decision, she moves to the beaches of Chittagong to work on a documentary and seek the remains of “the walking whale.” The Bones of Grace is a deeply moving novel of love, immigration, and loss, moving from Boston to India and back again, that will sweep you away with its beautiful language and sad, lovely story.Backlist bump: A Golden Age by Tahmima AnamTune in to our weekly podcast dedicated to all things new books, All The Books: http://bookriot.com/listen/shows/allt..."}, {"userName": "Andrea", "userReviewDate": "Jun 03, 2016", "userURL": "http://www.goodreads.com/user/show/9582364-andrea", "userReview": "3.5★The third part of the Bangla Desh trilogy brings us the story of the third generation of the Haque family; Rehana's granddaughter and Maya's daughter, Zubaida. We originally met Zubaida very briefly during the epilogue of The Good Muslim, so that's where I started, re-reading that part to recalibrate my familiarity with the characters.As this story begins, PhD candidate Zubaida is preparing to leave Harvard to join an expedition in Pakistan to dig up a whale fossil; the skeleton of Ambulocetus natans, the walking whale. In her final week she meets Elijah Strong, a drop-out from the university's Philosophy doctoral program. Despite Zee's departure hanging over them, and her admission that she is promised to someone else, the two fall a bit in love and vow to keep in touch. The excavation in Pakistan is unexpectedly cut short, and Zee returns to her family in Dhaka, rudderless. There she decides to move ahead with the marriage to her childhood friend, Rashid, and put her feelings for Elijah behind her. Early on in the marriage, tragedy strikes, and this is the catalyst for Zee relocating to Chittagong without Rashid. Within a short time she finds herself with an unexpected job opportunity - helping a foreign crew making a documentary about the labourers working in the ship-breaking industry along the coast. There Zee meets Mo and Anwar, and through circumstances of her own making, once again comes into Elijah's orbit.There is another storyline about Zee being adopted that is equally as important as the Elijah thread, but it's difficult for me to explain how this fits in without spoilers. Suffice to say, Zee was told she was adopted on her 9th birthday and then it was never mentioned again. As she struggles to reconcile her feelings for Rashid and Elijah, she almost tries to distract herself with a growing desire to find out where she came from and who her mother is.For me, this book was not as good as #1, but distinctly more enjoyable than #2. I would have rated it higher but for the fact that I just wasn't convinced by the depth of feeling that Zubaida supposedly had for Elijah and also for her need to understand her background. For example, she called it her 'quest' at a point where all she had really done was ask a few questions of her parents and in-laws. It seemed more like a curiosity than a quest to me. And with Elijah, there was tenderness and affection but none of the hallmarks of a grand passion that disrupts lives. However, while it looked to be heading towards a solid 3★ read, what redeemed it and earned the extra half★ was the ending. So much happened in the last 10% of the book!But now I'm having mixed feelings because after I'd settled on a rating, another reviewer brought to my attention a book named The Geometry of God, written by a Pakistani writer and published in 2008 (7 or 8 years before The Bones of Grace). Anam hasn't acknowledged either the book or the author, and I find I'm thinking less of her for it."}, {"userName": "Roman Clodia", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/56111743-roman-clodia", "userReview": "Written in luminous prose and suffused with an air of yearning and melancholy, this follows Zubaida from a PhD at Harvard via an aborted archeological dig in Pakistan to her home in Bangladesh. Anam weaves a complex story of journeying and search: for history, for a sense of self, for acceptance and for homecoming. Along the way we have a glorious portrait of a love affair, of various marriages, and of Bangladesh: its hierarchical social structures, its past struggle for independence, its abuses and its beauties.What makes this book so impressive is Anam's narrative control and her ability to view the world and characters with complexity rather than reductively. It's a mark of her sophisticated vision that the place of greatest human abuse is also where Zubaida experiences her greatest happiness; that the haunting image of the skeleton of a prehistoric whale is matched by the vision of a ship being stripped back to its bare timbers beached on the sand. It can be difficult to create empathy for a protagonist who is inclined to passivity but here, too, Anam pulls it off: Zubaida's motivations are sometimes opaque but its precisely this quality which makes her feel so real. A gorgeous, graceful piece of writing that confirms Anam as a writer to watch.Thanks to the publisher for an ARC via NetGalley"}, {"userName": "Text Publishing", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/11635439-text-publishing", "userReview": "‘A major new talent.’Observer‘Anam’s prose is glowing and graceful.’Guardian‘Anam has a knack for making you care so desperately for her characters that you admire their failings as much as their strengths.’Daily Mail‘Anam deftly weaves the personal and the political, giving the terrors of war spare, powerful treatment.’New Yorker‘Fierce and intimate, lyrical and expansive, The Bones of Grace offers what a great novel does: symphonic movements, historical landscapes that shape our private landscapes of love and life, mysteries and enchantments, the unforgettable and the unforgotten. Tahmima Anam is a mesmerizer.’Yiyun Li, author of A Thousand Years of Good Prayers‘Expansive yet intimate, weighty yet incisively funny, The Bones of Grace is a powerful examination of what it means to live in a world of collapsing boundaries and conflicting values. Few people write about identity and culture with such elegance and intelligence as Tahmima Anam.’Tash Aw, author of Five Star Billionaire‘A novel of heart, brain, and muscle – the competing pulls of history and love are evoked here with a rare honesty, and great skill.’Kamila Shamsie, author of A God in Every Stone‘Intricately structured, [The Bones of Grace] attempts to reassemble all its floating clues and end at its starting point, with its heroine reconstructing an elliptical past and searching for an elusive future…the story is speckled with anecdotes from the history of a country both young and very old.’Guardian‘[Anam] weaves a wealth of curious facts into a plot that itself is mesmerising, and does so with some gorgeous descriptive prose…[Her] characters are multifaceted, all have flaws, and the reader cannot help but care about their fate…A brilliant read.’BookMooch‘A novel of unusual, uneven beauty, heart-wrenching sadness and rare imaginative power.’Daily Star‘A twisting, fantastical tale of fate, chance and opportunities missed…Anam’s chief strength as a novelist is her knack for richly detailed and peopled worlds…We are taken on a meandering carpet ride through some exotic and surprising places, and there’s much to be enjoyed in that.’Australian‘The Bones of Grace has at its heart not war but the shattering effects of conflicted love…Zubaida's choice between love and duty is reminiscent of Anna Karenina’ Financial Times‘A novel of heart, brain, and muscle – the competing pulls of history and love are evoked here with a rare honesty, and great skill.’Kamila Shamsie‘Restrained and powerful.’Observer‘Seemingly disparate stories slowly coming together one by one, until the moment a last piece clicks sweetly into place to give us the revelation of a perfect, satisfying whole.’Spectator‘Few people write about identity and culture with such elegance and intelligence as Tahmima Anam.’Tash Aw, author of Five Star Billionaire‘Anam has created a novel that looks honestly at cultural history, family ties, religion, honour, and secrets, it is both intimate and expansive, achingly sad yet insightfully witty. Literature at its best opens doors and with The Bones of Grace Tahmima Anam does just that.’Hair Past a Freckle"}, {"userName": "Becky", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/16542153-becky", "userReview": "I slowed down my reading of this book in the last few pages because I didn't want it to end. From the moment you start reading you know there can be no happy ending - there is just too much 'human' in this book for any convenient, Hollywood resolution. Seemingly about a long distance love between a wholesome American and a Bangladeshi palaeontologist (stick with me here..) this book traverses the world and through time to conjure Bangladesh in colourful yet brutal beauty. I think this book is actually about the conflicts of identity experienced by everyone, but especially by those who leave behind their country to embrace cultures elsewhere. It's also about the idea that some people have 'dreams that are too big for their life'. Aspiration and ambition are concepts which many of us see as positive, but for those who have absolutely no chance or hope of changing their situation they simply lead to unhappiness, dissatisfaction, or worse. By no means fast paced, there are enough unexpected twists and heart stopping moments to make this much more than the love story it seems to have been billed as in the publishers blurb. Along with some brilliant writing, unusual elements such as the exploration of ship breaking, an industry I literally had no idea existed, and some palaeontology science make this a satisfying and wholly unique novel.Thanks to netgalley for providing me with an arc copy in return for an honest review."}, {"userName": "Momina Masood", "userReviewDate": "Jul 03, 2016", "userURL": "http://www.goodreads.com/user/show/17262906-momina-masood", "userReview": "Despite my ratings, I will recommend Anam's trilogy on several accounts -- (1) it uses the trope of home and belonging as a subsequent reality of colonialism and warfare very well (though I am a bit sick of it), (2) good introduction to contemporary Bangladeshi fiction, (3) occasional bursts of lyricism (especially in this third book) which makes it simultaneously an easy and harder read than the previous two books (okay wait, that's not exactly a good point?)Find a more detailed (albeit misleadingly flattering) review here: http://openroadreview.com/tahmima-anam/"}, {"userName": "Pooja T", "userReviewDate": "Aug 08, 2016", "userURL": "http://www.goodreads.com/user/show/9983863-pooja-t", "userReview": "So disappointed about this! I have loved the previous two books in this series and I had sky high hopes for this one, but this was so chaotic and convoluted and not good! The writing was great and honestly the only saving grace of this book. I couldn't stand Zubaida! I disliked her immensely and by the end of the book I want to get inside the story and slap her! Ugh! No!!! This was a train wreck!"}, {"userName": "Harvee", "userReviewDate": "May 13, 2016", "userURL": "http://www.goodreads.com/user/show/2185693-harvee", "userReview": "A wonderful love story about cultural clashes, family responsibilities and duty, and a woman finding her own way. I gave this five stars!"}, {"userName": "D.K. Powell", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/14779621-d-k-powell", "userReview": "I was long looking forward to Anam's third book in this 'trilogy' but though I enjoyed the book from the beginning - she is a masterful storyteller, of that there is no doubt - I was, nonetheless, a little disappointed.Firstly, the book really didn't seem to be part of the trilogy at all. I could see no connection between this and her 'A Golden Age' and 'The Good Muslim'.Secondly, it felt very much as if this was a series of longer short stories masquerading as a single novel. One moment we're involved in the love life of the main character and narrator, Zubaida. Then we're on an adventure looking for the bones of a long dead whale. Then suddenly we're ship-breaking on the beaches of Cox's Bazaar, Bangladesh. Along the way we seem to randomly learn the story of Anwar - of whom I expected there to be an obvious sting in the tale, but it wasn't to be. These all felt like good ideas which ran out of steam and were then discarded by the author.Nevertheless, I loved the storytelling and Anam's usual easy style which weaves you into the lives of the characters so gracefully. So I carried on, setting aside my hopes for the book in the wake of her first two excellent novels.If, in reading this book, you feel the same disappointments then I must say: Keep going!As the book neared the end, the threads pulled together and, instead of separate pictures roughly sown together as I expected, it turned out that everything made one larger picture - and that picture was beautiful.For me, the test of a good novel is this: Do I care what happens to the characters in the future? Do I feel I don't want the story to end? Anam's book passes this test with flying colours. I was heartbroken when the story had to end and I have found it hard to extract myself from the lives of the players within ever since.If truth be told, I would probably rate this 4.5 rather than a full 5/5 as it is not absolutely perfect. There are one or two messy bits, one or two parts which I didn't feel tied up completely or added to the novel. But then, in one sense, that's just what Anam is writing about here. An imperfect world, with imperfect people and imperfect love. Nothing has to add up completely to make a perfect sum. Indeed, a refreshing change is the complete absence of genuine 'bad guys' in this story. There are less flawed characters and more flawed characters - each with their own good and bad points. This was especially true of the narrator herself who readily admits to being a coward and breaking the heart of Elijah, who deserved so much better (although he himself is flawed, revealing a selfish youth just a little at one point). While many novels today are taking the 'flawed hero' line, Anam's book succeeds with me because usually I find myself unsympathetic to such characters, but not here. Zubaida's plight and her thoughts and reactions I could understand and appreciate. She is not entirely unlike me, I thought throughout the story. Perhaps that is why I loved her so much.In short, this is a beautiful book full of Bangladeshi life, full of the reality of what that means yet also so full of hope, peace and love. The enigma of Bangladesh is that it is both a beautiful place and a terrible one; born of a history which is both tragic and inspiring. Anam manages to capture this dual, split-personality of the country and people absolutely perfectly. For that, she demands my highest praise and my deepest thanks."}, {"userName": "Julia Thomas-Singh", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/32906981-julia-thomas-singh", "userReview": "THis book is so much like The Geometry of God by Uzma Aslam Khan that I am shocked. I confess to not having finished it because of the similiarities. In The Geometry of God,which came out in 2008, a young girl Amal finds the fossil of an ancient whale, the 'dog-whale,' that evoloved on land, with legs. She finds it on a dig in Pakistan with her grandfather, a paleontologist whose name is Zahoor, whose names means 'becoming', evolving, in-between. Amal wants to be a paleontologist like her grandfather but is told to stay home to look after her blind sister. But she does end up becoming the first woman paleontologist in Pakistan, working with men, despite society and family pressure. Tell me if this doesn't sound familiar. The Geometry of God was a Kirkus Reviews best book of 2009 but it seems not many people here have heard of it or the 'coincidence' would have been noted. I will give you that their writing styles aren't the same, but, ironically, Khan wrote this on pp 212 of the US edition of The Geometry of God \"Suppose I reassemble the bones wrong and the copy in no way resembles the original? Thousands of people will carry an image in their head of a prototype that never was.\"The prototype for a book about a South Asian woman paleontologist who studes ancienct whales and the wider themes of how her interest in this in-between creature is because it is like her, and like others in the book, and like young nation-states of South Asia themselves, is The Geometry of God. It just has to be said. :("}, {"userName": "Jo", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/1740824-jo", "userReview": "I won this through the publisher's Facebook page in exchange for an honest review. The novel follows a young woman from Bangladesh as she falls in love, fights against tradition and searches for the bones of a whale dinosaur. I wanted to love this because the writing was so beautiful but I found it a chore to read. It was lovely but I just couldn't engage with it."}, {"userName": "Shreya Vaid", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/27443174-shreya-vaid", "userReview": "The third book of the Bangladesh series, The Bones of Grace by Tahmima Anam stands out as a roller coaster ride of emotions, spread over the background of the new Bangladesh and a small shipping yard in Chittagong. And in between this beautiful mess, Anam’s protagonist, Zubaida narrates how her life completely changed when she fell in love with Elijah Strong.Most of the June I was busy with Tahmima Anam’s Bangladesh series, and the books have totally swept me off my feet. They have kept me engaged and longing for more knowledge about the country and its people which is across the border. While the first two books focus on the Bangladesh Liberation war and footsteps of Islamism in the newly liberated country, The Bones of Grace follows the life of Zubaida Haque aka Zee, who is Maya’s adopted daughter. Both Maya and her husband inform Zubaida on her 9th birthday that she is adopted, but they never knew that this knowledge would be embedded so deep into Zubaida’s heart that she will start spinning her life around it.In The Bones of Grace, Zubaida is writing a letter to Elijah Strong, the blue-eyed boy whom she met in a darkened concert hall in Boston, day before she was planning to go on a digging expedition to Tethys Sea in Pakistan to find the bones of a walking whale, which she had given the name of “Diana”. Elijah and Zubaida form an instant connection, something that Zubaida has never felt with anyone else. She sets on solving this evolutionary puzzle to settle her mind that is churning a thousand questions about her future after the dig in Dhaka. The dig also gives her solace from the fact she will give back something to the society, just like her parents have been doing, replenishing society after the Bangladesh War.The dig doesn’t go as planned as a local team member falls into the grip of Balochistan Insurgency. And at the end of the day, they had to leave “Diana” half uncovered and half buried in the sand and go back to their home. As soon as she returns, life takes a full swing. She is married off to Rashid, her long time family friend and boyfriend, settles down eventually only to realize the pain of loss yet again when she suffers a miscarriage.To find the true self and remove the scars of life, she leaves for Chittagong, the family resort, and from there to a shipping yard, where world’s many ships are taken down piece by piece, to be sold off. In Chittagong, Zubaida comes across Grace, recently arrived to be sold, and she has to cover the life of workers of the ship who will take her down. She also meets Anwar, a shipbreaker whose story holds a key that unlocks the past of Zubaida’s life, and a chance for a new life as well. In the shadow of the ship being torn down to its bones, Zubaida will make some decisions from which she can never turn back.When I started reading The Bones of Grace, I didn’t know that I have to be very patient with the story. But then after a few pages, I came across this line “Don’t blame me for parsing out the story slowly, Elijah. These things take time.”And that is when I understood that the story is much bigger than I am thinking. And my, it truly is. When you read The Bones of Grace, you will relate to the confusion and feelings of Zubaida Haque. You will come across a new little world of Chittagong, where ships are stripped down to be sold off. And the feeling by which Chittagong is described, you won’t be able to keep the book down. From Diana to those of ships that land up to be pulled apart in this highly exploitative ecosystem, an amazing relationship of evolution has been shown between a living and a non-living. Though I would have really liked if the story could have been a little fast paced and not so extra descriptive, The Bones of Grace will definitely take a place in your heart. And do not rush with the story, let it work it’s magic on you. Some of you might feel like giving up on The Bones of Grace, but then you will loose out on a story which is magnificent. Zubaida’s character is someone who has been marred young by the fact of her adoption. Since then, she always looks around for a purpose, or for someone whom she could relate to. She finds her purpose first in the dig of Diana, but then that is taken away from her. She relates herself to Elijah when she comes to back to Dhaka, texting their feelings using song titles. Zubaida may appear confused and disoriented to many readers, but if you carefully decipher her feelings, she is one of those many people trying to find their roots. She is strong, yet she is vulnerable at the core. And she is something that will always be etched in your memory.I have spent my half June with Tahmima Anam, and I simply love her stories. Make sure to pick up your copies and devour into the roller coaster ride of love, lost and found. Now I am off to sipping my tea, patiently waiting for her next book."}, {"userName": "Lila", "userReviewDate": "Aug 28, 2016", "userURL": "http://www.goodreads.com/user/show/4656570-lila", "userReview": "The Bones of Grace is the third novel of the Bangla Desh Trilogy by Tahmima Anam and tells the story of Zubaida, the adopted daughter of a wealthy Bangladeshi family in Dhaka. Zubaidah Haque is a Harvard educated marine palaeontologist engaged to her childhood friend Rashid. At a concertina Boston, shortly before her departure for Pakistan to work on a dig for bones of \"Diana\" an Ambulocetus, or \"walking whale\", she encounters a young man named Elijah Strong. The Bones of Grace is basically a long letter to Elijah explaining her actions. After working on the dig several months, the project is discontinued because of conflicts involving the local tribesmen and Pakistani police. Dejected, Zubaidah returns to Bangladesh. Under pressure of her family and against her better judgement, she marries Rashid. Unsatisfied with what to her feels like the superficial lifestyle of the Bangladeshi elite, along with the realization that Elijah is the love of her life, she moves to Chittagong to work on a documentary film about the beaches where ships are destroyed and workers or \" shipbreakers\" are inhumanly exploited. While working there Zubaidah meets someone who will help her solve the mystery of her parentage. All these aspects make this novel so much more than a simple love story.In fact for me, the love story was actually my least favourite aspect of the novel. I cared either for Elijah or Rashid and was often annoyed by Zubaidah's behaviour. Had there not been of all the drama of the love triangle, I would have given this book 5 stars. I guess I just don't have the nerves and patience for this kind of thing anymore! Fortunately there are so many other elements that made the novel interesting. By the end I did not want it to finish! What this complex novel is really about is a person finding their own identity and place in this world. It is about being caught between two cultures. Finally Anam also addresses the topic of exploitation of workers in developing countries and how the exploitation is often overlooked, even supported in the West. Although it is the third book in the trilogy, I noticed that many of the reviewers had not read the first two books. While The Good Muslim is definitely a continuation of the story in A Golden Age and should be read in order, The Bones of Grace is really a story on to its own and could actually be read before the first two books.Tahmima Anam's writing is atmospheric, compelling and deeply moving.I highly recommend all her books!"}, {"userName": "Anato", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/55272890-anato", "userReview": "Written like a letter, if a novel can ever be a letter, this book was stylistically very different from Anam's previous books. Sometimes that worked very well - especially the adversarial tone resulting from addressing the reader as \"you\". But at other times it didn't work so well - it was hard to tell how much time had passed, and more worryingly experiences and character growth got lost amid too many highbrow cultural references and overwrought language. A few details bothered me - Mo for example is not a believable nickname in Bangladesh. But it is common in the west, is this why the author chose it, to relate to that audience? A highlight of the book for me was Anwar's tale: the voice of a poorer Bangladeshi (or anyone from the global south) is so rarely heard in English writing. I also loved the way the author manipulates the English language to represent Anwar's speech - a lot of it will make sense if you speak Bangla yourself. I also loved to hate the main character - a rich brat, indecisive, insecure, and worried she isn't good enough for the white man - she's an amalgamation of actual people I know. The book does rely greatly on Bangla cinema style cliches of adoption, identity crisis and love at first sight - these are transparent plot devices the author uses to tell the story, and the story itself is worth reading (in this regard I do feel that comparisons to Rushdie are warranted). I could relate to a lot in the book so I'll fully admit that I'm positively biased."}, {"userName": "Lisa", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/1758411-lisa", "userReview": "I very nearly abandoned this book, more than once. Only the fact that I had been so impressed by its predecessor The Good Muslim stayed my hand. And now that I’m finished it, all 407 pages of it, I remain unconvinced that reading it was a good investment of my time.The Bones of Grace is third in a trilogy, but in shifting the focus away from the post-war impact of the 1971 war of independence in Bangladesh, author Tahmina Anam seems to have lost her way and succumbed to writing an overwrought romance. The book begins with a tedious rehash of a Boston love affair between a half-hearted palaeontologist called Zubaida Haque (who is adopted) and an American called Elijah Strong. The narration is made even more irritating by the form chosen: almost all of this novel is Zubaida’s ‘older-and-wiser’ letter to this Elijah and she keeps addressing him by name.Anyway, Zubaida goes off to a dig to find the fossils of a prehistoric whale (which she refers to incongruously as Diana). This whale, the Latin name of which now escapes me, is supposed to prove a back-to-front evolution, i.e. that there were creatures in the fossil record that were land animals which then adapted to the sea. This quest is, – yes, you guessed it – symbolic of Zubaida’s fossicking around on a quest to find herself, with the post-war identity of Bangladesh thrown in for good measure.To read the rest of my review please visit https://anzlitlovers.com/2016/07/19/t..."}, {"userName": "Michelle", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/6334044-michelle", "userReview": "How did this happen? Ms. Anam's first novel \"A Golden Age\" was a surprise 5* read. I hadn't heard anything about the book or the author at that time, just picked it up at the library and was thrilled. I was so excited when her 2nd book \"The Good Muslim\" appeared on the scene. I didn't like it that much because I'm pretty disgusted by religious zealotry, most certainly when it is used as an excuse to control women, but gave it a 4* because, well it seemed unfair to rate it lower than that. But \"The Bones of Grace\"? The main character was the most privileged, spoiled, selfish woman who had so many pretensions that she was above the shallow, materialistic, pampered class that she was adopted into. The premise of the novel, a story written for a love lost by the protagonist's cowardice and indecision: yuck, maudlin, boring, who cares! By the last tenth of the book, I just wanted a bomb or plane crash to kill off this woman and end it, already. If you like to read fantasies about the sad, self-inflicted psycho-dramas of the 1% , this is the book for you."}, {"userName": "Bren", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/3334669-bren", "userReview": "I loved this book. The narrator, Zubaida, tells the tale of her thoughts and actions to Elijah, and you are carried along. You don't know Elijah's reactions, you only know what Zubaida thinks. I was a child in India when the war started in East Pakistan/Bangladesh. Much of Zubaida's life is influenced by the freedom war and the roles her parents played in it and its aftermath. I was easily caught up in all the Zubaida observed and felt, her failings and her strengths. I found myself a bit lost at the end of the book, especially since it wasn't the end of Zubaida's work or relationships or life. I wanted one more chapter - a long one - to settle the future of her life, her work, the people in her life, and of Diana. One more chapter...."}, {"userName": "Monica", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/6642541-monica", "userReview": "Love her lyrical prose, richly developed characters and window in Bangladesh but the storyline wandered like it's indecisive main character"}, {"userName": "Bonnie", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/1602827-bonnie", "userReview": "The Bones of Grace is a modern love story that explores the problems of having to choose between an arranged marriage and a marriage for love. Grace is studying the species of the walking whale, the fossil that provides a missing link in our evolution. Zubaida Haque falls in love with Elijah Strong, a man she meets in a darkened concert hall in Boston. Their connection is immediate and intense despite the many differences between them. Elijah belongs to an American family while Zubaids is the ado[ted daughter of a wealthy Bangladeshi family in Dhaka. She is forced to marry to marry her childhood best friend and settles into a traditional Bangladeshi life. Although her family is pleased with her conformity, Zubaida seethes with discontent. She moves to Chittagong to work as a documentary film about the infamous beeches where decommissioned ships are destroyed and their remains are scavenged by locals who depend on the goods for their survival. Among them is Anwar, a ship breaker whose story holds a key that will unlock the mysteries of Zubsida's past and the possibility of a new life. As she watches the ship being ripped apart, this woman torn between the social mores of her two homes, Bagladesh and America, will be forced to strip away the remains of her own life and make a choice she can never turn back."}, {"userName": "Veronique", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/7841372-veronique", "userReview": "3 1/2 stars.This book is very well written, easy to read and mostly interesting.I am always attracted by stories that help me discover and understand other cultures.There is a lot I loved in this book, the breaking and selling business of decommissioned ships was fascinating, the exploitation and suffering of the poor, the huge gap between classes, the condition of women were very well depicted.But I had a serious issue with the main character who was simply a selfish, privileged, sheltered young woman. I could not find any empathy for her, on the contrary, the more I advanced in the reading the more I despised her. It seemed to me that there were two styles confronting each other in this book. One smartly described about shipbreaking (and all the suffering behind it, the distress of the lower class), and another about a love story cheapened by drama I could not care about."}, {"userName": "Dana", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/5461669-dana", "userReview": "Mixed feelings. Some beautiful passages but felt like the sub plots never quite tied together. (And a few seemed to disappear without mention...) Highlight was probably the exploration of exploitative labor practices in Dubai construction. (Tiny thing, but there was one passage where they describe going South to Sitakunda and then stopping at Patenga. This irked me; Sitakunda is north of Chittagong and Patenga. I don't know where her house could have been in Chittagong that driving south would end up at Patenga on the way to Sitakunda. Have never been a stickler about details in books but I guess Chittagong brings it out of me.)"}, {"userName": "Agnieszka Higney", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/28138032-agnieszka-higney", "userReview": "Sadly,i'm glad I finished it,as it was quite slow and hard-going.Yes,the final chapter gives more of a purpose and clarity to the story,but the way it is written-a letter to a lover about finding out identity of birth parents is so mundane.There are definitely moments of interest-and most of them don't concern Zubaida,the main character,but Anwar,poor Bangladeshi trying to make a living.The stream of consciousness coming from Zubaida is quite annoying,as literally very little happens in the book that could amount to something.The setting,for me was unusual,and learning about a new culture is always a bonus.It is not a gripping read,or an easy read."}, {"userName": "Louisa", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/6076854-louisa", "userReview": "There’s three different books in here, two of which are pretty interesting (prehistoric ambulatory whales! shipbreaking yards in Bangladesh!), and one extremely dull love story which unfortunately is the scaffolding for the novel, which makes it difficult to ignore. Some of the writing is lovely, but the whole thing doesn’t hang together very well."}, {"userName": "Doug", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/8670740-doug", "userReview": "The first installment of the Bangladesh trilogy was good. The second was very good. This, the third, was outstanding.Several seemingly disparate strands are deftly woven into a larger story at the last minute. The writing is beautiful, and the protagonist is a well developed, deep character.I loved this book. Will look forward to this authors future work."}, {"userName": "Aninha", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/14448886-aninha", "userReview": "Prachtig boek. De vorm is buitengewoon origineel, gaandeweg kom je erachter dat het hele boek een excuus is aan een verloren liefde. De hoofdpersoon is sympathiek maar menselijk, iemand die verkeerde keuzes heeft gemaakt in het leven. Het verhaal speelt zich af in Bangladesh en dan ook nog voor een groot deel op de scheepssloperij daar. De stijl is bijna poëtisch. Mooi."}, {"userName": "Anna B", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/4732242-anna-b", "userReview": "I really enjoyed the story once I separated it from the first two books in the series, as the connection wasn't obvious for a while. Still a beautiful and heart wrenching story of Bangladesh and the complications of family."}], "description": "The much-anticipated new novel by the Granta 'Best of Young British' Novelist'Anwar told me that it wasn't until he almost died that he realised he needed to find the woman he had once loved. I've thought about that a lot in the last few years, that if Anwar hadn't worked on that building site, he might never have gone looking for Megna, and if he hadn't done that, I might still be in the dark about my past. I've only ever been a hair away from being utterly alone in the world, Elijah, and it was Anwar who shone a light where once there was only darkness.'The Bones of Grace. It is the story of Zubaida, and her search for herself. It is a story she tells for Elijah, the love of her life. It tells the story of Anwar, the link in Zubaida's broken chain. Woven within these tales are the stories of a whale and a ship; a piano and a lost boy. This is the story of love itself.", "title": "The Bones of Grace\n      \n          (Bangla Desh #3)", "url": "https://www.goodreads.com/book/show/29217381-the-bones-of-grace", "average": 3.82, "cover": "https://images.gr-assets.com/books/1455798693l/29217381.jpg", "reviews": 97, "authors": [{"url": "https://www.goodreads.com/author/show/429519.Tahmima_Anam", "name": "Tahmima Anam"}], "type": ["Fiction", "Cultural", "Historical", "Contemporary", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/29217381-the-bones-of-grace", "http://www.goodreads.com/book/show/29906905-the-bones-of-grace", "http://www.goodreads.com/book/show/27868372-the-bones-of-grace", "http://www.goodreads.com/book/show/30230890-the-bones-of-grace", "http://www.goodreads.com/book/show/27161035-the-bones-of-grace", "http://www.goodreads.com/book/show/30224973-the-bones-of-grace", "http://www.goodreads.com/book/show/31365526-the-bones-of-grace", "http://www.goodreads.com/book/show/27177110-the-bones-of-grace", "http://www.goodreads.com/book/show/823815.A_Golden_Age", "http://www.goodreads.com/book/show/11331177-the-good-muslim", "http://www.goodreads.com/book/show/20947700-six-shorts-2014", "http://www.goodreads.com/book/show/32188691-garments", "http://www.goodreads.com/book/show/32198538-bbc-national-short-story-award-2016", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}