{"ratings": 10388, "userreviews": [{"userName": "karen", "userReviewDate": "Mar 25, 2017", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "oooh, goodreads choice awards semifinalist for best horror! what will happen?the bleak philosophy of the post-apocalyptic world:…he doesn’t see what’s so great about leaving your mark on things. You have a life and then it ends and you’re dead. Living it is the point, not proving to other people that you were there. The whole thing is really just water pouring down a plughole, but that’s absolutely fine. Standing water gets stagnant.i’m sure this is something i knew and just forgot in the period between when i first heard about this book and when i got my hands on an arc, but this book is a prequel to The Girl with All the Gifts. got that?? a PREQUEL. so don’t be like me, spending the first 2/3 of the book in a state of panic, fretting that you’ve forgotten characters’ relationships to each other during the three/four years' worth of books you've read since then, struggling to even remember what happened in The Girl with All the Gifts beyond the very memorable stuff, because for the most part, none of that matters. there’s an exciting little blip of an event at the end that ties the two books together, and no doubt there are smaller connections that will be noticed by readers who have read these closer together, but i can personally reassure you that they are seasoning only, and forgetting details from the first book will not hinder your appreciation of this one. phew.all the stuff that made the first book so much fun is back - the nom nom of the zombies, or ‘hungries,’ and the specific traits and mode-of-contagion that make them stand out from other literary nom noms. however, like all the best books in this particular genre, the zombies aren’t the main focus here. they’re certainly present, as obstacles to maneuver around, as threats that will infect or eat you, as constant reminders of “this is what happens to our dead now,” but they are far from the only threat in a world where humans have been thrust into survival mode, caught in the transition between the social codes that worked back when the world was more civilized and the newly brutal necessities of surviving. the scope is small - it focuses upon the passengers of the rosalind franklin, a tricked-out, armored motor home known affectionately as “rosie.” in her claustrophobic quarters, five scientists, six military personnel, and a fifteen-year-old boy named stephen are in the middle of a fifteen-month mission, departing from the english town of beacon (nod to gwatg) into scotland, collecting data left in caches by previous expeditions along the way, and gathering fresh specimens of their own in order to understand the phenomenon and hopefully find a cure. stephen is a young genius with severe social anxiety, the inventor of e-blocker gel; the goop that prevents zombies from smelling tasty human prey, but he is still seen as a liability by the soldiers on board the rosie, as he has a tendency to wander off, single-mindedly pursuing his own research, keeping his findings to himself. he’s a part of the science team while being completely independent, his only viable relationship is with dr. samrina khan; the woman who rescued him after both his parents died, and the only one allowed to touch him, if only with the tip of her finger. she loves stephen and feels responsible for him, but she’s somewhat distracted by an unexpected pregnancy, unsure what will happen when her baby comes, and the state of the world she is bringing new life into. well-armed and -trained men and women, brilliant scientists, and a teenage savant heading out into the wastes to save the world. seems pretty promising. however, people are people, and even with one goal to unite them, there’s plenty to divide them - the strain of close quarters, sexual dalliances, power plays, resentment, questionable reputations, the threat of aggressive bands of junkers, the choice between following orders vs. making informed decisions, the pressure of saving the human race from inevitable destruction, and one person in secret communication with beacon, being issued orders that might not have the team’s best interests in mind.and then the game changes.in carey’s imagining, the undead are mindless, static until they sense a warm meal.…a few hungries stand at street corners as though they’re waiting for someone to come and lead them back into the lives they lost.They will stand like this until their body’s systems fail, barring occasional headlong sprints in pursuit of local fauna. It’s an afterlife that not even the grimmest and least user-friendly of the old world’s religions ever imagined.on one of stephen’s unsanctioned journeys, he discovers a band of feral children who display the inhuman speed and predatory characteristics of the hungries, but the communication, strategy and mental acuity of humans. which discovery he, naturally, keeps to himself for his own investigations.and that’s when things get really messy. i’m pretty sure this would be satisfying as a standalone, but it would be doing yourself a disservice to miss out on gwatg, since that one is SO MUCH FUN, and more action-y overall. this one takes its time to get going; developing characters, supplying backstory, setting the scene, which for me was slow going because half my brain was preoccupied with \"am i supposed to remember these people? because i so don't remember these people!\" but there's plenty of payoff, and i am hoping there's still more to come!"}, {"userName": "Pouting Always", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "Set in the same world as  The Girl With All The Gifts , this one follows a group of soldiers and scientists traveling out from London to find anything they can that will help create a cure to the plague. The story is taking place before  The Girl With All The Gifts  and so a lot of the information that we have on the plague hasn't been found out yet. The team is traveling on the Rosalind Franklin, Rosie for short, and tracking down cache's made by an earlier expedition to see if any of the environments proved inhospitable to the cordyceps as well as collecting tissue samples from Hungries, people who have been infected and changed. The story specifically revolves around Dr. Khan and Stephen more so than the rest of the team because Dr. Khan is pregnant and Stephen is the first to observe that children are different than adults infected by the virus. I enjoyed this one slightly less than the other one but only because I think that it dragged out in some places. There were parts of the book, especially towards the end where I started getting super anxious about having to keep reading because it felt like it wouldn't end. It might just be a personal thing but I just felt that some of the scenes could've been cut for the sake of pacing. That was my only complaint though, I really loved the writing and I think it's an excellent addition to the rest of the story. I read another book a few days ago about a zombie virus outbreak and the whole time I was reading this I couldn't help but notice how this was so much better. Carey clearly put a lot of time and thought into the story line and it really pays off, it comes of as being real and I got pulled into this one completely just as I did with  The Girl With All The Gifts ."}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "This is the prequel to The Girl with All the Gifts and takes place about 20 years before. It involves the crew (military and scientists) of the Rosalind Franklin, AKA Rosie. They leave one of the only known survivor camps called Beacon to investigate the hungries and search for a cure or any knowledge that will help them understand the disease. Unbeknownst to the crew, there are some political actions taking place. The crew has a spy/traitor. Two of the crew members have fraternized and one is pregnant. One of the military leaders despises his superior officer. There is a teenager on board due to demands from one of the scientists who is a sort of savant (and I'm guessing has Asperger's). There are ALL kinds of trickery and secrets going on, which provides a momentum that builds and builds to a crazy conclusion. I found this a very good read, but there weren't really any likable characters in this book. I found so many of them infuriating. I even wanted to punch Steven Greaves, the genius teenaged boy a few times and I guess he couldn't really help himself.So many secrets - and this is NOT an environment for people to have separate agendas, when everyone's life is on the line. The female scientist, Khan, was aggravating too. Everyone was so single-minded and short-sighted. Everything was bound to go FUBAR.I kind of wish I had re-read the first book because I didn't really remember anyone or anything outside of Caldwell and Melanie. But apparently, Rosie is the tank they come upon in book one. There are some interesting parts and it really ended up being quite the bloodbath. I didn't like it as much as TGWATG, but it's still definitely a solid four read.My review for The Girl with All the Gifts. ★★★★★Original post:I. Want. This. So. Bad."}, {"userName": "بهنام حاجی‌زاده", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/25050426", "userReview": "As the translator of the Persian edition, it was an honor to be able to read the proof copy and I enjoyed every word of it. Well, to be honest I was disappointed that I couldn't read more about Melanie, but the cast of characters, if not as diverse as the Girl with All the Gifts (though with more characters), was amazingly put. The main character, Stephen, an autistic but brilliant boy; a bunch of soldiers (remember poor Gallagher and Parks!); and the science team. As always, I relished the character development as much as the story itself. The way Mr. Carey justifies their behaviour (at least in their own eyes) is simply amazing, showing the author's depth of human understanding.As with its predecessor, the Girl with All the Gifts, in this book, too, we are faced with a post-apocalyptic Britain, suffering from the Breakdown and, of course, a bunch of flesh-hungry hungeries. Story unfolds smoothly and then with a bunch of fateful decisions, it steps into a new realm of crescendo. The Boy on the Bridge has more of human-human conflict than tGwAtG, making reading it somehow more intense as the conflicts build up and explosive oppositions follow. Once again we face with a story devoid of (or at the very least with the minimum of) classic protagonists, in that regard that each character, with his/her wish for survival, is the protagonist of his/her microcosm.Last but not least, The Boy on the Bridge may not have that much of intense excitement unlike many other books in the bookstores (like, for example, Red Rising. Hell! That was fervorous!), but it's a pleasant descent from all those bloody battlegrounds to a battle fought within human's consciousness.Oh! And by the way, the way it ends... the way it ends...!***بعد از پایان ترجمه نظرم رو به فارسی هم خواهم نوشت."}, {"userName": "Miranda Reads", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "The beginning and end - simply stunning. The middle - a giant cesspool of infected matterThank goodness that the plot holes from the first book (The Girl with All the Gifts) were patched and filled in. And I was delighted that the hopeless-ending from the first book was wrapped up beautifully in this book's epilogue. For that alone, the book gets 3-stars but that middle? Completely ruined the novel.\nWhy?\nIt was the same as the first novel. Between the similar narration and the overlapping plot,  I would actually forget which novel I was in. This happened like four or five times. Just like the first novel, we end up with a team of scientists with soldier guards running around in Rosie (the tank-like portable medical unit) being pursued by the hungry-children. The soldiers and scientists spend so much time backstabbing and squabbling that I wanted them all to die. Painfully. The soldiers were stereotypical jarheads - shooting up situations that clearly did not call for it. The scientists had no street-sense - running headlong into danger at the slightest chance of an interesting specimen. I physically couldn't stomach all how in the face-of-death it was more important for them to argue and yell at each other than to ACTUALLY RUN FROM DANGER.That's not to say there wasn't redeeming qualities. The cast was diverse and we didn't have to listen (too many times) to comparisons between skin tones and food (caramel, chocolate) or eyes and snacks/art supplies (almond, charcoal). There's gay characters but their sexuality is more of an aside than plot device. Which made the treatment of the autistic fifteen-year-old  (Steven) all the more frustrating.Khan and her protege, Steven, were wonderfully fleshed out characters and I will never forgive M. R. Carey for what he did to them. Steven is an autistic savant and Khan took him under her wing. They have such an amazing job showing their parent-adopted child relationship. The author did an amazing job of bringing the audience to Steven's level.Then there's the one-dimensional hatred of the rest of team for Steven. Why? Because he was smart, sweet and was their best chance at surviving the zombie apocalypse? Oh wait, it's because he's autistic and had a few quirks. You'd think, in a world where humans are in such short supply they could see past that. Apparently not. Whenever Steven discovers something essential to the zombie apocalypse and the rest of the team would deliberately antagonize him into silence.  It was maddening. That being said, the ending was superb and saved the book.The Finer Books Club - 2018 Reading Challenge: A book set in the futureAudiobook CommentsVery well-read but I had an issue with the author's voice. It was the same tone and inflections as the same novel. Considering the plot was so similar between the two books, I kept forgetting that I was in the prequel and would subsequently get confused."}, {"userName": "Carol. ", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "[ military conflict and sabotage-type behavior  (hide spoiler)]"}, {"userName": "Liz Barnsley", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "So I’ve been waiting for this one in that way that I do, really patiently and without bugging anyone at ALL about it. Just sat here patiently waiting. No seriously!ANYWAY The Boy on the Bridge is tagged as The Girl with all the Gifts book 2 but it is not that, it is a brilliant companion novel set in the same world, you can read this perfectly easily as a standalone book, although there are some lovely little gifts (yes I did that) for you if you have read Girl first. You should do that anyway simply because it is brilliant. I’m reading it again right now in fact…Is “The Boy on the Bridge” as brilliant? Yes. You’ll get no argument from me, although it is brilliant in very different ways and for a whole host of new reasons. This is where I will struggle – because much like TGWATG I don’t want to give anything away. What the rather talented Mr Carey has done here is expand the entire sense of the world he built, given it form and function, with the help of some inspired characters and a kind of post apocalyptic road trip of highly charged emotional doom. Or redemption. You decide.I was so involved all the way through this book – I felt all the feelings and clutched my hair quite a lot, growled at the actions of a few, clung onto the edge of the actions of at least one and from the moment I started it I lost my grip on this reality and lived in that one. Mr Carey has a way of writing with such totally immersive prose that you do live every moment, sinking into it and travelling along with it. By the end I was wrung out and blimey what an end I got too, first the last few cliff hanging chapters that brought everything from before to an emotive and heart wrenching finish then if that wasn’t enough there’s a beautifully placed little aftershock.These really are the books I read for, the ones that for whatever reason, totally subjectively, grip you to the point that you know you’ll never forget them and will return to them to recapture that emotional tug they gave you the first time. The ones that will give that over and over no matter how many times you read them.The Girl with all the Gifts and The Boy on the Bridge are such books for me – whether they would be for you or not I cannot tell but what I can do is recommend that you at least give it a try. Really. What’s the worst that could happen?Just a fantastic fascinating beautifully formed reading experience. All the love for this one. Both the boy and the girl hit me right in the reading soul.Highly Recommended. HIGHLY."}, {"userName": "Andrew Smith", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/5885760-andrew-smith", "userReview": "I really enjoyed  The Girl with All the Gifts, I thought it a well thought out and credible ‘end of the world’ yarn. Moreover, it was written in such a way that (if you weren't already aware what it was) the true nature of the story crept up on the reader; at first I didn't know what was going on and by the time I discovered the hidden narrative I was completely hooked. And to add to this there were interesting characters whose fate I became invested in. It was also a novel that didn't leave you guessing at the end – an explosive reveal made it absolutely clear how what the fate of any survivors was to play out.So, this prequel novel was always going to face a number of, possibly insurmountable, problems: most significantly, the fact that the big story had already been told. And what, therefore, was left to tell? Well the author does a pretty good job of picking off some loose ends from the earlier tale and using these to knit together a further adventure. Yes, anybody who has read the first book (and you really do have to read ‘Girl’ first) will find few surprises here, but it does flesh out some background and… and this is where I'm struggling, because I'm not sure it does much else. The structure, in terms of the book’s cast, is actually quite similar. There's a young person (a boy this time, who is possibly somewhere on the autistic spectrum), a mother figure in the guise of a senior scientist and a bunch of soldiers/scientists who are largely dispensable and who are overseen by a conniving and bullying leader. In consequence, the tale starts to have a very similar feel to the first book – but unfortunately without the surprises. In truth I drifted through much of it, barely engaged.However, I don't want to be too down on it because I did appreciate the additional insight I got from reading this background piece and there is one surprise stored up in the form of an epilogue to the tale. In summary, it's ok - but not a patch on the first book."}, {"userName": "Francesca", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/31502192-francesca", "userReview": "My actual rating is 3.5. There were a lot of things I liked. The exploration of the hungries, certain sequences were really good, there was some good action, the ways it tied into TGWATG, and I really liked the ending, but I found the characters severely lacking. Most of them were indistinguishable from each other and the ones that were more heavily featured or had slightly more personality still felt fairly lifeless (pun unintended),flat, and one dimensional. My lack of interest in any of the characters meant that I didn't care about what happened to any of them which isn't good in a story like this.Full review to come."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Boy on the Bridge, M.R. CareyOnce upon a time, in a land blighted by terror, there was a very clever boy. The people thought the boy could save them, so they opened their gates and sent him out into the world. To where the monsters lived.عنوان: پسری روی پل؛ نویسنده: مایک کری؛ مترجم: بهنام حاجی زاده؛ ویراستار: نازنین نخعی؛ بازبین و تصحیح نهایی: رضا قلندری؛ مشخصات نشر: تهران؛ باژ؛ چاپ نخست زمستان 1396؛ در 512 ص؛ تصویرگر: پویا ظریف؛ مدیر هنری: خسر خسروی؛ دبیر مجموعه: نیما کهندانی؛ شابک: 9786008941255؛ موضوع: داستانهای نویسندگان انگلیسی - قرن 21 مخلاصه: روزی روزگاری، در سرزمینی که ترس آفت آن شده بود، پسرک خیلی باهوشی زندگی می‌کرد. مردم فکر کردند پسرک می‌تواند نجات‌شان بدهد، برای همین هم دروازه‌ ها را گشودند و او را بیرون فرستادند. فرستادند جایی که هیولاها زندگی می‌کردند..؛ ا. شربیانی"}, {"userName": "Mogsy (MMOGC)", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/4379514-mogsy-mmogc", "userReview": "4.5 of 5 stars at The BiblioSanctum https://bibliosanctum.com/2017/05/15/...Well, the question of whether M.R. Carey could catch lightning in a bottle twice has been answered. Not that I had doubted it much, but while The Girl with All the Gifts was met with much acclaim, I’d made sure to temper my expectations for its follow-up companion novel in the months up to its release. Given the infuriatingly vague publisher description, and with the newness of the whole idea, there were just way too many unknowns.Thankfully, The Boy on the Bridge came through with flying colors. It might not have been quite as fresh as the original, simply because we know so much more about the world now, but the book still had plenty of surprises in store. Here’s what I can tell you: The Boy on the Bridge is something of a prequel to The Girl with All the Gifts but it can be read as a standalone (though I still highly recommend reading the books in their publication order). The world has been ravaged by the Cordyceps plague, turning much of its population into “Hungries” — effectively just another term for the walking dead. And yet, humanity still has hope that it will find a cure, sending scientists and other brilliant minds into the wild to see if they can bring back any helpful information.The story follows one such expedition, made up of the scientists and soldiers of the Rosalind Franklin. Affectionately nicknamed Rosie, the armored tank/motor home/mobile laboratory is specifically built for many months of travel through the Hungries-infested wasteland that Britain has become. The key characters include Dr. Samrina Khan, the team epidemiologist, as well as an autistic boy named Stephen Greaves who is ostensibly accompanying her as her assistant. Though Stephen’s presence is unorthodox to say the least, none of the other scientists are about to question Dr. Khan’s insistence that the young man is special or that he can bring invaluable insights to their mission. Six soldiers are also along for the ride, charged with protecting the Rosie and her precious cargo of civilians, scientific equipment, and biological samples.However, just a few weeks after their departure, Dr. Khan receives some life-changing news. But it’s too late to turn back now; she and her colleagues have a job to do, and the future of everyone—including the next generation—rests upon any useful data they can bring back.If you were like me and found yourself completely in awe of the world in The Girl with All the Gifts, then you’re in for a treat. This prequel explores many aspects that were only lightly touched upon in the original book, and with the Breakdown still fresh enough on people’s minds, there’s a noticeable difference in the overall attitudes of the characters. While it would be a stretch to call this a happier book, the prevailing mood at the beginning is arguably still one of hope and measured optimism, and that despite the horrors the world has seen, humanity believes it can save itself and make everything right again. After all, this is what the Rosie was meant for, and in a strange way, the armored vehicle almost becomes a character in its own right, symbolizing that conviction.Gradually though, the hope fades, followed by a stifling sense of desperation. Confine a group of scientists and a group of military personnel into the same claustrophobic small space for months on end, and you’re guaranteed to get some kind of friction. Throw in the pressures of their mission and the threat of Hungries and junkers, it’s a wonder that the team has survived together this long at all. While Dr. Samrina Khan and Stephen Greaves may have gotten the most attention simply based on amount of page-time, the ten other characters on board the Rosie also have their own personal background stories and fleshed-out personalities, leading to a lot of interesting dynamics. This aspect sets The Boy on the Bridge apart, enhancing the story with side-plots dealing with complicated friendships and enmities and details of secret alliances and betrayals.Keeping in mind that all the events in The Girl with All the Gifts are still in the future, there’s also a lot the world doesn’t know yet, so the fears of the Rosie crew are understandable. If you’ve read the first book, this is where the mystery loses a bit of its grip, but it’s still easy to see how the stresses caused by the strange happenings can start to take their toll, once you put yourself in the characters’ shoes. The real shockers are all left for the end, because even though we already know that the Rosie will bring home no cure to save the world, it’s the whys and the hows of it that will ultimately be the most revealing. In fact, in some ways this makes the ending feel even darker and more unsettling, especially once the realization hits that everything we know about this world had rested on the outcome of this novel.Whether you’re picking up The Boy on the Bridge as a newcomer or because you’re a fan of The Girl with All the Gifts, this one will be a fascinating tale guaranteed to pull you in. Highly recommended."}, {"userName": "LeAnne", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "Trust me when I say that it takes one heck of an incredible writer to wrap a dystopian story around me so that it feels like a welcome comfort. I do not like dystopian books! Despite the intense suspense and strangeness here, there is humanity and nobleness in this story and its characters.If you've read the previous book by this author called The Girl With All the Gifts, you'll know that - yup - zombies are on the prowl. I picked that book up having absolutely no idea that it was dystopian, yet alone with face-biters featured. Normally, Id bail out. But incredibly, I was hypnotized by the story line and could not stop from racing to the end. This story acts as a bit of a prequel, and its epilogue wraps up both timelines. It is not necessary for one to read The Girl book first. This one was better. Here, the \"hungries\" are still on the hunt, and the home base of Beacon continues to send out sorties of scientists and soldiers in fat, rolling laboratories. The armored RVs are mobile units which presumably can keep their inhabitants safe while the personnel scour the field looking for environments or materials which might help inoculate what's left of mankind. The goal is a cure for the \"hungry\" virus or a preventative or a method to exterminate the mindless cannibals that have taken over the world.In the previous book, a single girl was the focus of the story, and here we meet a teenaged boy who is an orphaned savant. He was found years before this book takes place, covered by the dead bodies of his parents, stabbed and bitten but protectively wrapped around his little body like a pair of parentheses. Stephen is housed in an orphanage-type setting in Beacon, but because he has autism, the volunteers trying to teach him are at a loss.The young boy is taken under the wing of a microbiologist who becomes a surrogate mother and tutor to the boy. When years later she is sent into the field on one of the traveling laboratories, she argues that he - a brilliant but socially disabled savant - must come along. Stephen is a true genius beyond his years and has proven his skills in biochemistry, but his presence on the months long foray has repercussions.If you've loved a child that others might not understand, so much the better for your enjoyment of this highly suspenseful and technically brilliant story. Coincidentally, I have a teenaged son with significant autism and I am a geoscientist. My boy cannot so much as tie his shoelaces or solve a 25 piece jigsaw puzzle, but unlike the boy in the story, mine can easily express his love for me, my husband, and our younger son. The description of the character Stephen's feelings seemed beautifully spot on, but...when you know one kid with autism, you know ONE (and only one) kid with autism. I'm not entirely certain that the autistic traits in the story would bear out in actuality - but they were well rendered. He deeply loves his adoptive mother - the only person in the world who cares for him - but is unable to show it or speak it or barely think it. A few seconds of a fingertip’s touch is the only way we readers know she is his cherished mommy. This was very moving.Beyond my obvious connection there, this story examines what it means to be part of humanity. Yeah, there are still face-biters running around, so it's not like this is high literature. But when the boy on the bridge, Stephen, is able to allow another to look deeply into his eyes and feel comfort for the first time, the deeper meaning wrapped around me too. 4.5 rounded up"}, {"userName": "Char", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "3.5 stars! The Boy on the Bridge is the, (at least for me), eagerly awaited prequel to The Girl With All the Gifts. This book tells the story of how the abandoned tank/lab they found in TGWAtG, the Rosalind Franklin, got to be where she was and what happened to her crew. It also tells the story of a special boy on board, (who was possibly autistic?), along with the crew consisting of both military and civilian/scientific contingents. They are ordered out to reconnoiter and to collect lab samples. That's all I'll say about the plot.In a way, this book is like TGWAtG, except instead of a special girl, we have a special boy. There is also the fact that we know the ending from the get-go, and I think that took away from the suspense a little bit. Lastly, I'm not sure all the science-y bits actually made sense, but even if they did I wasn't much interested in that aspect of the story. I'm more interested in the characters and whether or not they survive. Perhaps some sort of explanation was required, but I think it slowed the story down. I wanted to know more about Stephen and if what he had was actually autism or something else entirely.The ending here scored BIG with me, though, and it made up for the times I thought the story was slow. Overall, I did enjoy the heck out of this story and I'm wondering if there will be another? If there is, sign me up now!You can get your copy here: The Boy on the Bridge*Thanks to NetGalley and Orbit for the e-ARC in exchange for my honest review. This is it!*"}, {"userName": "Jennifer", "userReviewDate": "May 02, 2017", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "“The Boy on the Bridge is very much its own thing, not a continuation of Melanie’s story but a new journey with a new cast of characters. But it answers a lot of questions that The Girl With All the Gifts implicitly asked.” -M.R. Carey\n\n The Boy on the Bridge might be marketed as the sequel to The Girl with All the Gifts or the second installment in a series by the same name, but please know that if it has to be classified as anything, it should really be a prequel. The Boy on the Bridge is set ten years prior to the events and characters in The Girl with All the Gifts and can absolutely be read on its own. It's an open and closed story, but fans of The Girl with All the Gifts will certainly get a little extra out of it since it takes you into that same [but earlier] postapocalyptic world, you might recognize a name or two (no cameos), and the ending reveals some interesting things about its predecessor. Admittedly, I was thoroughly confused when I started reading this book because of all the new characters (and my lack of knowledge about the sequel versus prequel thing). But after googling some trustworthy reviewers and interviews, I got myself situated and became easily engaged. All of the characters in this one have their own unique set of circumstances or even more unique personality and it was so, so easy to find investment in each of them. I didn't love this one quite as much as the first, maybe because of my initial confusion, but I did thoroughly enjoy it and will likely re-read at which point I am hopeful my rating will match the shining 5 stars I gave Melanie. If you are familiar with this world or if you aren't, this bit of zombie hungries horror is for everyone. Check it out! My favorite quote:\"All journeys are the same journey whether you know it or not. Whether you're moving or not. And the things that look like endings are all just stations on the way.\""}, {"userName": "Shaikha", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/55334362-shaikha", "userReview": "DNF @ 26%I bought this as soon as it was released, I was really excited to read it since I absolutely LOVE The Girl with All the Gifts but this is just a huge disappointment.It's completely dull and just, boring.I might pick it up later to finish it so I can give it a more proper rating. (I really don't like DNFing books no matter how bad they are)"}, {"userName": "Karl", "userReviewDate": "Apr 28, 2017", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "This is an Advance Reading Copy"}, {"userName": "Lonna | FLYLēF", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/42319420-lonna-flyl-f", "userReview": "Original Post: \nThe Boy on the Bridge\n at FLYLēF (www.flylef.com)ONE OF MY proudest book recommendation moments was on the day of my supervisor’s retirement, when I wished him well and handed him a wrapped, blue gem named \nFellside\n. It was my last ditched attempt to prove that I could make a good book recommendation especially having failed in my previous attempt. Yes, I was on a mission. That mission ended (sigh of relief) weeks later when I received an e-mail from him expressing nothing but love for the book. Truth be told, I think I could have wrapped up any book by M.R. Carey and would have been equally successful, especially his latest masterpiece and the star of this review The Boy on the Bridge (The Girl With All The Gifts 2).Though The Boy on the Bridge is the second installment in the series, it could be read as a standalone, consisting of a completely new cast of characters. However, I highly recommend starting from the beginning because the characters from both books do intersect. The Boy on the Bridge takes place a year after The Girl With All The Gifts. Global civilization has collapsed and the human species are at a near-extinction. The Cordyceps pathogen has metastasized to produce an entirely new pattern of symptoms, possibly resulting in more dangerous hungries (zombies). In the last remaining civilization of London, a team of 6 scientists and 6 soldiers sets a course to find a cure to save humankind.With perfect pace and pitch, Mr. Carey builds insurmountable tensions between the crew and their improbable mission. These characters are morally complex, with questionable intentions and integrity. Mr. Carey is able to present these flawed characters in a way that somehow make me root for (most of) them. A growing sense of chill permeates through every page as the characters’ intentions are unraveled, leading to stunning twists that take the story to a fever-pitch.On a deeper level, Mr. Carey’s talent lies in writing memorable and profound characters. He takes readers into the heart of friendship between 15-year-old Stephen Greaves, questionably autistic and possibly a genius; and Dr. Samrina Khan, an epidemiologist with an indomitable spirit. The acts of sacrifices demanded of them are absolutely haunting and beautiful.The ending left me a bit heartbroken, but in a good and satisfying way that a thought-provoking story does. The characters linger in my soul and leaves me to ponder what happens next for them. Mr. Carey takes a terrifying, post-apocalyptic world that is full of despair, and plants a seed of hope—a hope that germinates in the harshest of conditions to become something that is both rare and magical. You won’t want to miss this phenomenal story, and neither will my retired supervisor!"}, {"userName": "G.H. Eckel", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/31787045-g-h-eckel", "userReview": "A fungus (that really does exist) has crossed species into humanity. It seizes the central nervous system and takes over the body; the host becomes a zombie. After 10 years of infection, there are precious few humans left. A team of scientists in a tank-like laboratory have been in the field 7 months searching for an antidote to save the human race. The alternative is to slip into unconsciousness and become a Hungry, which are zombies, called Hungries because they stand still like a tree until they detect prey and then they pursue it until they run it down and eat it. The book takes place when an autistic savant teen, a member of the science team in the tank laboratory, discovers that second generation Hungries retain part of their humanity. He tries to create a cure from dead ones. It's a story of survival. It's also a story of people sabotaging one another. This is not your typical zombie book. It's the literary gold of zombie stories. Carey is a terrific writer when it comes to description and inner dialog. The only negatives for me in the novel are the glacially slow pace of the plot in the first 60% of the novel and the fact that I didn't really fall in love with any of the characters. Things do happen in the first part of the book. Someone does get killed and there's an interesting, autistic-like savant who figures out more than anyone else has. But the plot is slow going until 60% through the novel when there's an attack. I think the plot is slow because Carey is such a master at inner dialog and description. He gets better over the course of the novel; the second half being better written than the first. This book isn't as good as the sequel, The Girl With All the Gifts, but it's worth reading, especially if you run quickly through the first half of the novel. So, I recommend it. I'd start with the sequel first, however, because it's a better book."}, {"userName": "Rita", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/22264452-rita", "userReview": "I decided that this book was worth another try at a real review and take my chances that Goodreads software won't lose it again. The Boy on a Bridge is worth another chance at a decent review. It's one of the best books I've read in a long time. M R Carey seems to be on a roll with this one coming on the heels of The Girl With All the Gifts.The Cordyceps fungus has wiped out most of the world's population. How it started no one really knows but they do know that one bite from a person who has it is enough to spread it very rapidly.One bite is all it takes to turn normal people into \"hungries\". They are called hungries because their sole purpose is to eat whatever warm blooded creature they sense. They stand dormant, head and arms hanging until something edible comes across their radar causing them to spring into motion to rapidly bring down and eat whatever has awakened them.This story takes place in Great Britain but I'm sure it could be repeated across the globe. All that remains of the population has gathered in Southern England at a location called the Beacon. It is from there that our little gang of characters set out to study what remains between Southern England and Scotland, and maybe, just maybe, find a cure for the Cordyceps fungus.Onboard the heavily armed and armoured travel trailer called the Rosalind Franklin or Rosie, is a crew of 12, 6 scientists and 6 military. Dr Alan Fournier, a worthless excuse of a human being, leads the science team which consists of Samrina Kahn, Lucien Akimwe, John Sealey, Elaine Penny and the hero of the book, a 15 year old autistic boy, Stephen Greaves. Stephen has a special bond with Samrina Kahn or Rina, as he calls her. Samrina Kahn has just discovered that she is pregnant by John Sealey, after they have started their journey. This certainly adds a new wrinkle into expedition.The military contingent is under the command of Colonel Isaac Carlisle, a very well respected leader and also the only other person on board that shares a mutual respect with Stephen Greaves. Serving under him are Lt Daniel McQueen, Lance Bombardier Kat Foss, Private Brendan Lutes, Private Gary Phillips and Private Paula Sixsmith. There is no love lost between Lt McQueen and Colonel Carlisle.The crew wears something called e-block to hide their presence from the hungries. It falls to the military escort to shoot several of the hungries for the scientists to gather samples.While the other scientists are doing their thing, Stephen wanders off on his own, looking for anything that differs from what has come to be considered the norm. And he certainly finds it. He spots movement and discovers the \"children\". They are not hungries nor would they be classified as human. They are a new part of the puzzle and he wants to study them, but keep them secret from other crew members. His study of the \"children\" leads him to a potential cure for the Cordyceps fungus, but at a cost that would be so monstrous that he knows that he can't tell anyone else. But here his autism becomes a problem. He cannot lie if asked a direct question.\"I'll have to tell\" he moans \"I'll have to tell if they ask\".So Stephen finds a way to make sure that they can't ask.If I could give The Boy on a Bridge more than 5 stars I would. For those of you that don't like dystopian novels, this is one with a lot of hope. This is a book I intend to read again.I received this book as an Amazon Kindle giveaway in exchange for an honest review.Posted to Goodreads and Amazon 12/03/2017"}, {"userName": "Althea Ann", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "I saw there was a new MR Carey book coming out and requested it from my library without reading anything at all about it. So I was delighted to find out when it arrived that it's a direct companion to \"The Girl With All The Gifts.\"In this post-apocalyptic future, humans are losing ground against the \"Hungries.\" Fortified pockets of uninfected humans are falling to the zombie plague. In a last-ditch, desperate effort to find a cure - or any strand of hope to cling to - a mission has been sent out: an armored vehicle, containing the best remaining scientists, and a contingent of muscle to guard and protect the brains. However, as so often happens in this kind of scenario, humans can be their own worst enemies, even in the face of a dire external threat. Back at home base, politics and plots may be the downfall of the only safe haven they have to return to. And even aboard the \"Rosie\" (the armored tank/mobile lab) the mission is split into two groups that fail to respect each others' strengths. One of the bones of contention is Stephen Greaves - the 'boy' of the title. He's part of the mission at Dr. Samrina Khan's insistence. As the only epidemiologist they've got, her wishes have got some weight behind them. But no one else really believes that Stephen is a genius who invented the beta-blocker lotion that allows them to 'hide' from the Hungries. From his behavior, he comes across as closer to retarded than to brilliant. As readers, privileged to be given insight into Stephen's perspective, we realize that a scientific breakthrough by the boy is probably humanity's only hope. But will his teammates recognize his value before it's too late?While I really liked the book, I also thought that Stephen - the main character - was unfortunately the story's main weakness. It's really, really hard to pull off an \"autistic genius\" character, and rather than feeling like an accurate glimpse into the mind of a brilliant but neuroatypical individual, it ended up kind of feeling like Stephen was \"magic\" - more of a pending deus-ex-machina than a real person. That said, the book is wonderfully written, with plenty of tension, thought-provoking content, a good mix of cynicism and hope - and some great surprises along the way.Fans of 'The Girl Will All the Gifts' may enjoy the parallels between the two stories."}, {"userName": "Figgy", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/5056662-figgy", "userReview": "The Girl With All The Gifts has been on my best of the year list for two years running, for the physical book and the audiobook respectively, so words are incapable of describing how much I was anticipating this new book.It does not disappoint.The Boy on the Bridge is actually a prequel, and it follows the events that led to the Rosalind Franklin, the mobile, armoured lab, being left where the crew of The Girl With All The Gifts would discover it a couple of decades later, but you should read The Girl With All The Gifts first, if you haven’t already!Until now readers, along with the cast of The Girl With All The Gifts, could only speculate as to what happened, and none of it was good. Now we’re finally privy to what went on decades before the story that has captured the attention of readers and now moviegoers the world over (so long as they don’t live in Australia, for some reason. Why no movie in Australia, you guys?!).The team assembled here is a lot more structured than the one that escaped a nightmare situation in the previous book. Rosie is able to carry twelve, and within those chosen are six scientists and six military personnel, but within the group there are certain tensions, bound to make the journey rocky enough to be felt by all, even within the protected, armoured safety of the Rosalind Franklin. Perhaps especially in these tight quarters.The rest of this review can be found HERE!----------- Pre-read - ----------OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ, OMZ.I NEED THIS. NOWWWWWWWW!"}, {"userName": "Kate", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/5737182-kate", "userReview": "This is one of those books that, when you finish, you sit still, your mind whirring over, and reflect on what a fantastic reading experience that was. It's different from The Girl with all the Gifts but in one way it's the same - in its excellence."}, {"userName": "Obsidian", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "Well I am glad that I waited for my library to release the hold on this one. I have to say that from beginning to end this book was not worth the wait and my anticipation of it at all. \"The Boy on the Bridge\" moves so slow that I found myself bored out of my mind. The epilogue is the only reason why I gave this thing 3 stars. And even that is me being generous since Carey does not do a very good job of setting things up and takes away from the really shocker of an ending in \"The Girl With All the Gifts\" with his needs to make things into a HEA situation. \"The Boy on the Bridge\" seriously is just \"The Girl With All the Gifts\" with new characters and names. We have a special girl (boy in this one). A scientist (teacher) who has maternal feelinfs for the girl (boy). A couple of shoot and ask later soldiers. A scientist who is secretly up to no good and the rest of the crew is in the dark. I was very disappointed that Carey didn't really try to do something new with this world that he created that enthralled so many readers in the first book.\"The Boy on the Bridge\" follows multiple points of view (just like \"The Girl With All the Gifts\" did) but unlike with that book, I didn't read with breathless anticipation. There is no reveal since we already know the world that these characters inhabit. I just found myself getting very irritated due to the jumping around of the POVs. And it felt like Carey through the rules that he had established in this new universe out of the window when it came to this group finding a \"cure\". It just didn't even make any sense and I tried to ask one of my friends who is a biology major and me running through information to her made her metaphorically tear her hair out. She just rolled her eyes at me. So for me the science didn't ring true and I just finally gave up to just get to the end of the book.\"The Boy on the Bridge\" follows a science/soldier crew of the Rosalind Franklin. For readers who didn't read \"The Girl With All the Gifts\" I suggest you go back and read that book first. This book is essence both a sequel and prequel. The events described in this book occur before \"The Girl With All the Gifts.\" The crew consists of 12 people. The most important people to this story in my opinion is a 15 year old boy named Stephen Graves, scientist Samrina (Rina) Khan, Dr. Fouriner, Lieutenant McQueen, and Colonel Carlisle. Stephen it appears suffers from autism. I honestly don't know if that is accurate or not, and I hate making sweeping generalizations about characters, but I think that is what Carey is going for here due to how he describes Stephen unable to look people in the eye, not liking to be touched, etc. Stephen is part of this expedition due to many people planning hopes on him to find some sort of cure for the zombie infection that has wiped out most of the world at this point. Stephen is also responsible for creating the e-blocker we heard about in the last book so we get why he is part of this expedition. Maternal figure scientist Rina is concerned about Stephen to the detriment of everyone else around here. Unlike with Miss Justineau, Rina just doesn't do a thing for me. Probably because there are other circumstances happening to Rina that I just took with a huge grain of salt. What befalls her by the end of the book just aggravated me to no end. I just didn't get the feeling Carey knew what to do with her at all. Dr. Fournier was a waste of time in my opinion. None of his actions make sense and I was bored with him. Lieutenant McQueen was another character I just didn't believe for a second his motivations (he blames Carlisle for the state of things since he didn't take over things in Beacon and let others do damage) and he proceeds to do a series of dumb things that you would think someone at his level would have better sense about.Colonel Carlisle was another figure who seemed to sleepwalk through this whole book til almost the end. I honestly didn't believe his ignoring what was happening around him because he is so coded to taking orders from those in authority. I think that the writing was not as great as the previous book. This book plods along til you get to the 80 percent point. I could not believe how slow things were. And Stephen and his whole shtick for me ran very thin by the time we get to the end. I just didn't believe there was not another solution out there and that Stephen was very short sighted about things.This once again takes place in an Britain that is forever changed by the hungries and what survivors have had to do to stop the coming infections. We hear some references to the junkers in this one, but they are not as present as they were in the last book. The ending didn't really make a lot of sense to me at all. I can't even get into it without spoiling. But even though I found it terribly implausible, it just worked better for me than the majority of the book."}, {"userName": "Lisa", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/9595345-lisa", "userReview": "Review from Tenacious Reader: http://www.tenaciousreader.com/2017/0...I am going to start with talking a bit about reading order, I think both of The Boy on the Bridge and The Girl with All the Gifts can easily be read as stand-alones. The descriptions from the publishers are incredibly vague for both, which I tend to enjoy. That said, there is something about the world I had no idea of before reading The Girl With All the Gifts that gave an additional level of mystery and suspense that I think I could miss if I had known ahead of time. That has most likely been spoiled for most readers by this point, particularly with the movie and reading The Boy on the Bridge first will certainly take that bit of mystery away as well. But with that in mind, I would recommend reading The Girl With All the Gifts first if you plan to read both (and maybe skip this review and read my review for that book instead)While I was reading this one, I was asked a couple of times if knowing the outcome of The Girl With All the Gifts (which is set after this) ruined my reading experience at all. I really don’t think it did. This is a new set of characters and circumstances that have a story of their own to tell and I never felt like having some knowledge of upcoming events lessened my level of interest for this story. And like I said earlier, I think if I had read this first, it might have slightly lessened the intrigue in The Girl with All the Gifts, so I am happy I read them in this order.The Boy on the Bridge is centered mainly around a crew in a mobile lab. It is staffed with both military and scientists with a mission of understanding and hopefully curing this new plague that is overtaking the people. Once infected, people become what they call “hungries”. It’s basically just another name for zombies. Unthinking bodies that used to be human, but now think about nothing but feeding. And they have an overwhelming urge to feed on other people (and in turn infecting them). Their sole purpose becomes feeding, hence the name hungries.The crew for Rosie (the nickname they have given their armored mobile lab) is quite diverse in personalities, which always makes for a more entertaining read. Dr. Rina Kahn is accompanied by her assistant Stephen Greaves. I don’t think Stephen is ever labeled autistic, but he clearly exhibits many of the traits often associated with autism, and other crew members refer to him as The Robot at times. But I enjoyed his perspective which gave insight into his thinking and really humanized him in way that may not be as evident from another person’s perspective. Stephen is also incredibly intelligent, developing the e-blocker that prevents hungries from smelling humans, giving the scientists a much needed layer of protection while doing their work.And I hate to go into the plot too much with this one, particularly with as vague as the publisher kept their info on it. I will just say I enjoyed the blend of science and crew dynamics as well as the excitement and terror of the threats facing the team. I also enjoyed the level of hope they had that they could turn things around and find a cure. Did I love it quite as much as The Girl with All the Gifts? Well, maybe not, but that was an incredibly high bar for a book and when it comes down to it, I think the discoveries about the world in The Girl with All the Gifts is one aspect that edges that book a bit higher. That’s hard to replicate within the same world, so I can’t fault the second book. When it comes down to it, this was another fun and exciting book from Carey"}, {"userName": "Debra", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "\"Once upon a time, in a land blighted by terror, there was a very clever boy.\"Stephen was very clever but even he could not make this book great for me. Let me start by saying that I LOVED \"The Girl with all the Gifts\" I thought it was AMAZING and I loved the POV chapters and of course, Melanie. Stephen is a 15-year-old autistic teen who has discovered that the \"hungries\" have maintained some of their humanity. He finds this interesting and compelling as he observes and ultimately interacts with them.A team of scientists and military personnel are on-board, Rosie, which is basically an armored RV/motor home/lab, looking for a cure for the fungus that turns people into zombies/hungries. Rosie is where they do research, have sexual dalliances, stab each other in the back, make power plays, have resentments - you get the picture. Basically, the joys of living in extremely close quarters for months on end. There are several characters in this book, but the main ones are Stephen and Dr. Samrina Khan. Khan and Stephen have a unique relationship. She rescued him when he was younger, and she is the only one allowed to touch him. Khan loves Stephen and feels responsible for him and his safety. Stephen is a unique 15-year-old and he is dedicated with finding the \"cure\". Both of these characters are \"troublemakers\". Dr. Khan is pregnant, and Stephen goes off on his own and conducts his research. He puts himself in danger to observe and interact with the hungries. There were parts of this book that were just \"blah\" for me and parts that were really great - the great parts were mainly at the end. The story dragged in the beginning and did pick up stream. I liked that this book was not only about the hungries and finding the cure but also about humans trying to survive and the things they did for and against each other. I did not find that any of the characters in this book shined or stood out as they did in \"The girl with all the gifts\". I rooted for and wanted more of the characters in this first book, and although; I liked Stephen and Khan, they did not wow me. For most of \"The Boy on the Bridge” I was hoping for the story to get better and even when things did pick up at that point, I was left feeling meh. Perhaps, part of this was me having such high expectations as I loved the previous book. I wanted this one to WOW just as much. I'm sad to say that it did not. Good not great.Thank you to Orbit books and NetGalley who provided me with a copy of this book in exchange for an honest review. See more of my reviews at www.openbookpost.com"}, {"userName": "Terri Wino", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/28305082-terri-wino", "userReview": "This was closer to 3-1/2 stars for me, but I'm going to round it up to 4. The only reason it's lacking that 1/2 star is because in comparison to The Girl With All the Gifts, I didn't have quite the emotional connection to the characters in this book that I did its predecessor. This book also took a little longer to get me wrapped up and invested in the story, but once I got over that hump I didn't want to stop reading. The last 50 or so pages, especially, were so engrossing! I also couldn't have asked for a better ending to the way this story played out.So while The Girl With All the Gifts tops this one for me, The Boy on the Bridge was definitely worth another foray into the world M.R. Carey has created with the aftermath of Cordyceps and his hungries."}, {"userName": "☙ percy ❧", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/19742661-percy", "userReview": "when i heard about this book, i was excited and apprehensive in equal measure. its predecessor, THE GIRL WITH ALL THE GIFTS, is one of my favourite books of all time and it was wonderfully self contained. so what, i thought, could this bring? what if it wasn't as good? I NEEDN'T TO HAVE WORRIED.oh, GR lists this as the first book (only in some editions, it's gone a bit funky idek), but you DEFINITELY SHOULD READ THE GIRL FIRST. it's very misleading numbering; should have been #0.5 for this and #1 for THE GIRL. so there's a fair warning for you. this book is set a few years or so before THE GIRL, and it follows rosalind franklin's original crew; the scientists and soldiers who set out from beacon on an expedition. the pacing and tension was absolutely perfect all the way through, and i genuinely don't think i've been as nervous or as emotionally invested in a book in a LONG WHILE, so i was really glad about that. i don't want to say too much, because i don't want to spoil anything. but if you loved THE GIRL WITH ALL THE GIFTS, then you need this - especially with that utterly exquisite epilogue. this duology truly is the best, greatest take on zombies i've ever seen or read, and i will be highly surprised if anything can surpass it. ever."}, {"userName": "Bill Kupersmith", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/12460952-bill-kupersmith", "userReview": "The Boy at the Bridge was set as a precursor to Carey’s The Girl with All the Gifts, which I expect that many of us already had read. And my hopes to experience again the spiritual world of GWATG were disappointed. GWATG was superficially SciFi, but with lots of spiritual & emotional qualities. Superficially this book is set in the same world, with ‘Hungries’ & ‘Junkers’ & an Odyssey through Britain in a combination APC/Lab/RV with a crew of soldiers, scientists, & a child who isn’t quite human, tho’ in Stephen’s case his alien pecularities are mental rather than physical like Melanie’s. He is also much less endearing & his relationship with Dr Khan less affecting than Melanie’s with her schoolmistress. I concede that as an ex-literature teacher that I identified much more with Miss J. than I could with Dr Khan (whose relationship with another crew member who gets written out of the script seemed in the story only to get her pregnant as required by the plot). I could understand how Asperger’s syndrome would make Stephen unable to tell a lie, but not how it would compel him to answer questions posed by a villain. Why couldn’t he say, ‘I know but I won’t tell you’? That would be perfectly truthful.Besides the boring Stephen being so inferior a character to the lovable Melanie, entirely too much of this book simply goes over (sometimes literally) ground we’ve traversed in GWATG. Tho’ it was heartening to have a cameo role for Melanie in the epilogue, Carey ought not to continue the series. I had the same experience with his earlier Felix Castor novels: loved the 1st but by the 3rd was thoroughly bored with the same characters & settings. Reading this one after Fellside was especially unsatisfying. Fellside featured moving paranormal & spiritual realities. The one, unfortunately, is mostly standard garden-variety SciFi. Good SciFi - hence the 4 stars - but artistically and spiritually lifeless. Should M. R. Carey send Rosie out again, I shan’t go along for the ride."}, {"userName": "Lea", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/14174872-lea", "userReview": "This was pretty bad!!I enjoyed The Girl With All the Gifts immensely - I thought it was creepy, clever and original. I also thought it did NOT need a sequel (or a prequel, for that matter). I was, however, taken in by the glowing reviews on The Boy on the Bridge's Goodreads page.The Boy on the Bridge is like the Dollar Tree TGWATG. It features basically the same characters, only less engaging (a strange but gifted child; the nurturing female figure the child looks up to; an amoral woman in a position of power; a harsh male soldier; a young, naïve male soldier; and so on and so forth). I never cared for any of them, they weren't developed enough to feel like real people. It also didn't help matters that literally every single character, at all times, behaved in the most idiotic, illogical way possible. For a group of soldiers and scientists on a supposedly life-and-death mission 10 years into the zombie apocalypse, everyone behaved more or less like petty Big Brother housemates, instead of actually working together to achieve whatever it was they were there to achieve.The story is basically a rehash from Girl as well, except, this being the second time we are in that universe, the element of surprise is completely gone from the story (oh, how strange, there seem to be children among the zombies! what could it mean! etc). There wasn't even a moment that was really creepy or scary."}, {"userName": "Kirsty &#x1f4da;&#x1f4d6;❤️", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/5390112-kirsty-x1f4da-x1f4d6", "userReview": "Another good book by Carey with the hungrys and dystopian future. This book though is more than the synopsis. As much as it's about the boy, Greaves, it's about Dr Khan and her pregnancy in a very uncertain word and the journey to try and discover a cure. I've been trying to work out a timescale against Girl with all the Gifts. In this one they haven't yet discovered the second generation children but the basis of the plot is that here they do but do't understand at first what is going on. Greaves is the one to realise, form a  weird bond with the leader of these children. There's an epilogue at the end with a grown up Melanie that is only 20 years after the events in this book. It seems such a short space of time. The epilogue opens up 2 new avenues for future books (to me anyway) of how we bridge that gap between book 1 and the epilogue and also what comes next because that seems quite an interesting idea too.Back to this book though I found it dragged a bit more than the first one. If felt a bit harder to read and there were some parts I think could have been cut out. A bit more science in here that I like but overall I really enjoyed it. It was a good prequel to the first book. Free arc from netgalley"}], "description": "Once upon a time, in a land blighted by terror, there was a very clever boy.The people thought the boy could save them, so they opened their gates and sent him out into the world.To where the monsters lived.", "title": "The Boy on the Bridge\n      \n          (The Girl With All the Gifts #2)", "url": "https://www.goodreads.com/book/show/31554413-the-boy-on-the-bridge", "average": 4.01, "cover": "https://images.gr-assets.com/books/1484593600l/31554413.jpg", "reviews": 1629, "authors": [{"url": "https://www.goodreads.com/author/show/7177350.M_R_Carey", "name": "M.R. Carey"}], "type": ["Horror", "Fiction", "Science Fiction", "Horror", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/31554413-the-boy-on-the-bridge", "http://www.goodreads.com/book/show/32785092-the-boy-on-the-bridge", "http://www.goodreads.com/book/show/35072307-the-boy-on-the-bridge", "http://www.goodreads.com/book/show/38232174", "http://www.goodreads.com/book/show/35007282-the-boy-on-the-bridge", "http://www.goodreads.com/book/show/17235026-the-girl-with-all-the-gifts", "http://www.goodreads.com/book/show/26030697-fellside", "http://www.goodreads.com/book/show/19418277-the-girl-with-all-the-gifts", "http://www.goodreads.com/book/show/34452568-the-boy-on-the-bridge", "http://www.goodreads.com/book/show/37975580-someone-like-me", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}