{"ratings": 6537, "userreviews": [{"userName": "Rowena", "userReviewDate": "Sep 01, 2012", "userURL": "http://www.goodreads.com/user/show/2990642-rowena", "userReview": "Updated review (November 8, 2015) \"Every negro walk in a circle. Take that and make of it what you will. A circle like the sun, a circle like the moon, a circle like bad tidings that seem gone but always, always come back.”- Marlon James, The Book of Night WomenWhen I first read this book in 2012, I didn’t think I would ever read it again. The depictions of violence were really hard to read, mainly because I knew that although they were fictional, they were probably very representative of what had taken place to people who looked like me. However, I decided to bite the bullet and read it again, mainly because Marlon James was going to be at one of the events I attended a fortnight ago, and also to see how differently I read it the second time around.I’m so glad I did reread it. There was a lot to take in during the first read and in retrospect I don’t think I could have seen enough the first time around. Also, with additional knowledge of slavery, and also with being familiar with the story from my first read, I was able to understand the story at a much deeper level. I was even able to look more closely at the other stories I had “missed.” For example, the “romance” of sorts between the main character, slave Lilith, and the Irish overseer, Quinn, a romance that came about due to two lonely people, lonely for different reasons. When we may often see homogeneity in whiteness, it was clear from this book that that was not the case in the colonies, and there was a rigid hierarchy of race, even within whiteness. A book that was recommended by my favourite professor is “How The Irish Became White”, and in this book it was interesting to see how the Irish man was treated by the English, French etc.To me, this has been a lesson in the benefits of rereading. My first read left a very visceral reaction; I felt indignant and angry, almost nauseous at times. I felt things weren’t fair and that the atrocities that happened to slaves were never atoned for. I know I’m a sensitive reader and reading this gave me a helpless feeling. The pain was too real, the lack of support that these people received, mainly because they were black and not considered capable of worthy thought, subhuman in fact, was always at the back of my mind:“You tried to use the mind, the brain, but you silly girl, those things are lost to the negro. What you have is a back that won’t break, a skin that won’t crack, legs like an ox and teeth like a horse.”During my second reading, I was also struck by the cognitive dissonance of the slave-owners; the fact that the black were the ones who were considered uncivilized and subhuman, yet it was the so-called “civilized” Europeans who came up with so many inhumane ways to shame, humiliate, hurt and destroy these people, was something that made me wonder how could they could see their cruel actions as acceptable. I would not want to live in their heads.In spite of the harsh and graphic content in this book, I would highly recommend it. There were moments of triumph, in spite of the situation the characters find themselves in, and Marlon James is a great storyteller. Original review from 2012 This book is about slavery in 19th Century Jamaica. It took me a while to get into this book because it is written entirely in Jamaican dialect (including the narration). Once you get used to that fact, the writing is quite charming. This book brought out lots of emotions in me, mainly disgust and anger. It is extremely graphic in its imagery so definitely not a light read. It made me absolutely sick to my stomach reading about how the British colonialists treated slaves of African descent. It was hard to read about the lynchings, the rapes, the murders for making \"mistakes\" like serving tea that was too hot, the racism, the stealing of babies from their mothers, the depiction of blacks as lazy, dirty, stupid.....*sigh* Despite the difficult subject matter, I gave this book 5-stars for a few reasons. Firstly, a book that's able to elicit such emotions from me but makes me want to finish it is obviously written well. Secondly, the historical explanations helped make the story seem more real. Thirdly, the writer's gift at using different styles of writing (British, Irish, Black etc) and his injections of humour and wit at the most unlikely places made the story more entertaining and believable,in my opinion.I don't think I can read this book more than once, it was honestly too painful. I'm really glad I read it though."}, {"userName": "Petra X", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "[I finished this last night. It is one of the best books I have ever read and I can't get it out of my head. All day I've been thinking about it. The book finished, the characters had their stories told, but I'm still thinking of them, I want to know what they did afterwards. I want to write a proper review but it's going to take a few days to digest. I want to recommend it to everyone, but as an audio. Then the Jamaican patois really comes to life rather than being very unfamiliar on the printed page. Also the narration itself is wonderful, it really makes the book come alive. I am learning history. I am learning the Maroons, the escaped slaves community in Jamaica was as vicious to other escaped slaves after a treaty with the whites, if not more so. I am learning that a slave's lot was worse than anything I had read. This is fiction. Of the history I believe every word. Knowing what one's ancestors went through it must be hard for the uneducated and untravelled to let go of racial suspicion. (hide spoiler)]"}, {"userName": "karen", "userReviewDate": "Mar 29, 2009", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this book hurts. in so many ways. initially, it hurts to get acclimated to the narrator's voice. whenever i read books written in dialect it always takes me at least 40 pages to start to get the hang of it (i curse you, irvine welsh!!) and then it hurts because it's such a raw and bloody depiction of the physical and emotional bullshit of slavery. and then after it's all done, it hurts that it's so well written, you just want more of it. so i'm awfully glad i broke my promise about \"not buying any more hardcover books\". this one is worth hardcover price."}, {"userName": "Richard", "userReviewDate": "Mar 16, 2014", "userURL": "http://www.goodreads.com/user/show/4677640-richard", "userReview": "\"We not getting free, we taking free.\"\n\nOUT. FUCKING. STANDING.This book floored me. Seriously. I was so stunned by the time I finished that I couldn't sleep for a while, even though I had to be to work on set at 6am the following day! The Book of Night Women is the best coming of age novel I've encountered; it really is unlike anything I've read before. Night Women, Marlon James's second novel, follows a mulatto girl named Lilith, who is born into slavery in late 18th-century Jamaica, and the eventful year after she turns 15 at the Montpelier Estate. Lilith catches the eye of Homer, the strong-willed head house slave, who recruits her to join a quorum of five other women, who are plotting an island-wide slave rebellion. One of the things that's so impressive about this novel is how fascinating this coming of age concept is, illuminating the horrifying effects of slavery in a unique way that we've never seen before. It's commonly known how difficult it is being a teenage girl, dealing with the growing pains of puberty, sexual awakening, mood swings, self-discovery, and the need to assert independence and be seen as a woman. Now imagine all of this happening while the only world you know is one of complete oppression and total lack of freedom or positive influence. This idea is ripe for exploration and Marlon James leaves no stone unturned. How would a young girl handle being touched with kindness when all she knows is being touched with violence? How do you handle the already confusing matter of being mixed race during a time when skin color defines everything? It's unsettling, frustrating, and ultimately engaging to watch the process of Lilith growing from a girl to a self-aware woman throughout the book. And this concept of coming of age as a slave is something that I feel no one else has ever done (\nSomeone Knows My Name\n might be the closest), at least not this powerfully, showing the horrifying effect of slavery in a unique way that we've never seen before.I was also pleasantly surprised to see how hyper feminist the story is. There are only a couple main male characters and almost no primary male slave characters. It's kind of a breath of fresh air as there are hardly any strong female characters in classic slave narratives and here, the entire revolt plot is planned by strong women all over the colony. They don't involve men because they don't believe that men have enough rational brainpower to really handle this! Here, it's the women that are totally badass, calling the shots, packing muskets and machetes and Obeah spells, and it always feels genuine. The cherry on top is of course the author's skillful writing. He's a natural and the prose is epic, poetic, and probably the most challenging of all his novels. While both \nJohn Crow's Devil\n and even the dense \nA Brief History of Seven Killings\n (which I'll be rereading soon) have heavy loads of Jamaican patois, Night Women is COMPLETELY told in patois and I could imagine it no other way. It helps to provide a totally original voice. Although I had no problem with it as I grew up in the Caribbean, I expect many readers to have a difficult time. But, I think the plot and the amazing characters are easier to grasp and more accessible than either of those other books. And for anyone that has a problem with the vernacular, I highly recommend listening to the audiobook as well. I jumped back and forth between the paperback and the audio and Robin Miles's narration is the best audiobook performance I've heard. She's a complete chameleon with accents and really accentuated the drama!So as you can tell I adored this book and I immediately added it to my list of favorites. It's a total masterpiece from the beginning all the way to it's extraordinary ending that James NAILS like a master conductor! This is a powerful piece of work and I believe (and sincerely hope) that this book will ultimately be considered a literary classic in years to come. Bravo Marlon James! Bravo! A+\n\nSome fire don't go out, they go quiet under the ash, waiting for one little dry stick to feed. So the white man sleep with one eye open, waiting for the fire next time. That fire coming."}, {"userName": "Hannah Greendale", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend."}, {"userName": "brian   ", "userReviewDate": "Feb 13, 2010", "userURL": "http://www.goodreads.com/user/show/193310-brian", "userReview": "well, the 'question of evil' has plagued philosophers thinkers and all the rest of us ordinary folk since, i'd imagine, we were first capable of thought: how can god allow such horrible shit to go down? is the horribleness of humanity proof that god doesn't exist? as a wee lad in hebrew school i was told that we simply cannot understand what god is up to, that the whole enterprise of trying to figure god's motives was corrupted with inferior - that is, 'human' - logic... \"so don't even bother trying, gottlieb. siddown, and sheket bavakasha.\" (that's hebrew for 'shut the fuck up') um... that is some whackass logic that only religion would dare perpetrate. anyone else try and unload that particular brand of bullshit and they'd be laughed right outta the room. so sitting pretty, a decade into the 21st century, let's take stock. much of the world today lives below the poverty line. a good number of awful & preventable diseases rip through much of our poorer nations. and, of course, genocide. war. famine. plague. and all those horrible repressive dictatorships. sierra leone, saudi arabia, democratic republic of congo, sudan, rwanda, n. korea, the list goes on. haiti after the earthquake. indonesia after the tsunami. new orleans after the hurricane. and the animals? ha. given 'dominion' by god over the earth's non-human inhabitants... we've done quite the fine job, eh? but let's face it - today's world is a pretty great place. despite all the ethnic cleansings and clitorectomies and talibans and 'enhanced interrogation techniques' and factory farms... if you were born in the 20th or 21st century you really hit the time/space powerball lottery. because, friends, life way back when was considerably worse. hobbes's 'nasty, brutish, and short' sums it up nicely.it'd be fun to create some kind of misery aggregate or wretchedness index, and apply it to every single person who ever lived since man first existed. i'm willing to bet over 97% of all of mankind would fall into the red. deep deep deep into the red. sorry, god, if i apply my own logic and see something slightly problematic there. and we're desensitized to it all, yeah? it's too much. human beings have a built in defense mechanism. we know all this horrible shit has gone down. we know that, even now, our own country tortures. but what're we gonna do? we know animals are tortured but we eat their tortured flesh. and we know that everyone we know and have ever known and will ever know will, one day, and very soon, be dead. and a very short time after we die, there will be no one alive who had any idea that we ever existed. and a very short time after that there will be no one alive at all. no. the human mind cannot handle this. so we thrive on illusion. and occasionally something - if for only a very brief flash - breaks through the illusion mechanism. we hear a particular news story. see footage of a refugee camp, a factory farm, or a naked terrorist pyramid. or we read a piece of fiction which illuminates 'truth' better than reality itself. but then, of course, we step away from the television or newspaper or book or movie and it's over. and that's not meant as more anti-human criticism. while we do have a tendency toward the shallow and callow, we must do this. we must walk away. the burden of existence - even here in 2010 america in which life is just so fucking incredibly amazingly wildly great compared to any other possible human reality - is just too much. so here we have marlon james's the book of night women. oh man. a goddamn grand piano of 'burden of existence' on the reader's shoulders. too, too horrible. threw the book against the wall twice, wept like a little girl thrice. here goes my thought process while reading it: 'fuck white people, fuck white people, fuck white people, fuck black people, fuck black people, fuck black people, fuck all people, fuck all people, fuck all people' but what makes this a great book and not one that simply throws down a list of human cruelty or one that merely carves a compelling narrative outta the human carnival of depravity: redemption. and i kinda hate using that word b/c it seems a safe way to tie together and attach significance to a tale about the-evil-that-men-do; i hate to reduce or distill this powerhouse of a book and that black-as-death/red-as-blood ending to one word; to use 'redemption' as the linguistic silver-lining or one-word signifier toward the meaning of life... but yeah. we're horrible and cruel and we kill one another. and the animals. and the earth. but... can we be redeemed? james attempts to bring us closer to this unknowable answer. but he won't make it so easy. much redemption in the book of night women is found through violence. killing babies. women. men. chopping, hacking, burning, shooting, drowning, stabbing. these are our protagonists. and it's troubling. and you think of john brown. y'know, the abolitionist who was sick of the movement's slowmoving bullshit ways and walked door to door bludgeoning slave-owners to death. on one level, i support brown. i do. slavery had to end. by any means necessary. on the other, isn't this exactly what the nutso pro-lifers are doing when they take out abortion doctors? complex stuff. another reason why james is a badass: we have a kind of coming-of-age story, but it ain't baseball and awkward sexual fumblings and a family's dark secrets... what we have is a young girl entering into and growing up in an adult world of rape and beatings and pitch-black despair. a girl who cannot read. who is never taught to think critically. who can't conceive of anything other than what is. and while richard wright's black boy or ralph ellison's invisible man have exposure to an outside world from which to draw -- while their internal transformation happens, in part, b/c of the injustice they see -- james's lilith has a wholly internal transformation. she has no point of reference -- it's not just that she has no understanding, say, of psychology, philosophy, politics, or any other system of thought -- it's that she doesn't even know that such systems exist. she doesn't know that she doesn't know. and james is rigorous in his treatment: he never succumbs to the temptation to enliven a passage with an anachronistic bit of insight. as lilith transforms, so does the book, so does the reader. further proof of james's badassness: the relationship b/t lilith and robert quinn. one of the most troubling, complex, beautiful, and heartbreaking i've ever read about. and for the creation of homer. and for the final scene in which we see homer. ugh.so yes. this is human existence. this is what we've been doing forever. but things are better. less global slavery than ever before. less people die of starvation. or inadequate medical treatment. much disease has been eradicated. and there is decidedly less derby-dosing in 2010 than in 1810. (you ask: what's the derby dose? well. if a slave did something real real bad like spill soup on the master's lap or walk in on the mistress nude or some other such infraction, here's what they'd do: another slave would be forced to shit in the offender's mouth. and then the shiteater's mouth would be wired shut for a few hours. so... you either hold that shit in your mouth for the few hours or you swallow it and hope you don't vomit it up. because if you do vomit you risk drowning yourself. yay! god is great!)so, the 'question of evil'. yeah, call me a jackass for applying man's logic to god. whatever. if god exists, he's the fucker who set all this shit in motion, so i'll say man's demented logic is miles above god's... and if god exists, he is an asshole of such colossal proportions he makes thomas thistlewood (inventor of the derby dose) seem quite the affable gent. man can seek redemption. fuck god."}, {"userName": "Petra X", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "I dnf'd this book because I swapped to audio (proper review there). I wanted to read this book because of this review which made me laugh:\"I have spent the last week or so with words going through my brain that one cannot use in the real world. There was not only the oft-repeated word for a black person that was common in the 18th century, but there was constant use of the c-word and the p-word for female genitalia and the c-word for mail genitalia and the f-word for what the f-word really means.\"Why can't she just say cunt, pussy, cock and fuck? It didn't kill the author. What is she so worried about, that she might fall off her moral high pedestal if she utters them?Since she listened to the book she can't use a black marker in the book that another reviewer I read does (I hope they aren't library books). It makes you laugh, doesn't it?So I'm going to read it."}, {"userName": "Agnieszka", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "Truly powerful stuff. And harrowing report of human misery. The novel is literally dripping with abuse and violence both verbal and physical. Directed at slaves. But there is a slave and slave.  The book of night women is about inhuman, barbarous treatment and punishing system, it’s about cruelty and humiliation delivered not only by masters but also by slaves to themselves, men to women, women to women. The story told here is a spiral of terror and brutality. It’s nothing like saccharine pictures you may remember from  Gone with the wind. There is no trace of good missy and her faithful maid. Men, no matter of colour of their skin, seem to think only about one thing. No wonder it were women who had to take the bit in their hands.Language is extremely rude, salacious and vulgar at times, primitive even, additionally Marlon James uses Jamaican patois what at times may be a bit trying but after some pages you rather don't mind it at all. I haven’t read much novels concerning slavery but only this year I read two books dealing with the theme. This very one and generally praised  The Underground Railroad. It’s hard to avoid comparisons now. But it was the novel by Marlon James that won me over, that truly moved me, that shook me to the core. Some images and words still haunt me and I can’t get rid of them now. The brutality and atrocity feels so painfully real and tangible that almost knock you down. That choke you. I thought it was bloody brilliant. I mean that. It was bloody. It was brilliant. And I believe that the plunge into that heart of darkness won't leave anyone indifferent.4,5/5"}, {"userName": "kisha", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/10773892-kisha", "userReview": "UPDATEI just finished rereading this and some of my thoughts have shifted a bit. I had last given this book 5 stars. This time I'm giving it 4 stars. The author has a weird obsession with lady parts. He must have implemented his obsession with lady parts in at least every other page of this novel and almost every time it brought nothing to the plot. I will do a new review later but for now my old one is below.\"Every negro walk in a circle. Take that and make of it what you will.\"To call this book amazing would be an understatement. This is the kind of book that you read and already see the movie and visualize what actor/actress will play what character. This book immediately comes to life from the first sentence. I read the first paragraph on Amazon and knew that I had to read this novel. Marlon James's use of the color red was brilliant, especially in the first paragraph. I believe that the hidden and forbidden truth about slavery was revealed in The Book of Night Women. This story was told like no other slavery story I had ever read or watched. What we got was the harsh truth. I loved the language which is something most people who gave it few stars didn't like. But the Patois dialect is what gave the book a real feel of not only slavery but Jamaica. It wasn't very hard to catch on to even for someone who isn't familiar with Jamaican patois. The many themes of this novel are impressive; slavery, love, hate, slave/master relationship, rape, oppression, independence, strength, womanhood (black and white), sisterhood, survival...I could go on and on. Amazing!Never have I read a book that brought out so much emotion. One minute I was angry at not only the characters but the author. How dare he write such a dark, sedistic, and cruel book. Then there was the crazy and animalistic life that the slaves were forced to call their own. Then next moment I'd laugh at the sarcasm and pride and personality of these women especially Lilith. But most intriguing, this book was mind-provoking. It will challenge every thought and every lesson you were taught about slave history, Jamaican, and even American history. And some parts in the book you'd find yourself even sympathizing for the villian of the 19th century (white slavers). Character development was so complete on each and every character. When you finish this novel you feel as though you've known each character personally. That amazes me too because so many authors fail in the development of characters. What I also liked about this book is that in my opinion, none of the characters were very likeable. Not a single one! You have to be a genius of a writer to successfully write a novel taking place in the 19th century filled with all distasteful characters and yet the characters are still relatable. But it was okay because the characters were so well developed that you understood why they were who they were. And most had redeeming qualities. My warning to anyone reading this and not knowing much about it; this is a very emotional read. It's very raw, indecent at times, vulgar, and descriptive. If you don't like reading swear words or the N word than this book isn't for you because it is a bit overbearing in those areas. Overall, the (main) message I received from this cruel historical Jamaican slavery reality, is that the world was designed to keep black people oppressed dating all the way back to the 18th century, by doing that in a way to teach self-hatred amongst the individual as well as each other. It makes me think of the stigma of black on black crime that has stuck with our people for so long. How so many young black men don't even know that it all results from slavery and how they are keeping themselves oppressed. Which is why education is so important. Which brings me to the beginning of I believe three of his chapters, \"Every negro walk in a circle. Take that and make of it what you will.\" We are still walking in that circle today. I think it's no suprise there was a message and reason he kept repeating that phrase. They don't understand that knowing your history can make a world of a difference. Education is so important. It's life changing. When you know better, you do better. I think all young adults especially African American's should read this. James did a wonderful depiction of Jamaican slavery that easily translated to American history. I absolutely loved this book. I wonder if he knew just how powerful this book would be when he wrote it. Now thanks to Marlon James, every book I have tried to pick up has been epic fail because nothing compares."}, {"userName": "Greg", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "This song was running through my head for most of the second half of the book.But no one ever changed the church by pulling down a steepleAnd you'll never change the system by bombing number tenSystems just aren't made of bricks they're mostly made of peopleYou may send them into hiding, but they'll be back againMovements are systems and systems kill(some ramblings about politics has been excised here)Following the general theories of Marx, and discounting Rousseau's mythology about the noble savage, a fairly standard leftist response to a slave revolt is that it is bound to fail, in a revolutionary sense. Historically this may not be true, but the general idea is that slaves wouldn't be in a position to really grab control of the means of production and create a self-sufficent society while still having to exist in the European world that they had been unwillingly thrust in to. In the teleology of Marxist type thought there is no going back, history is a forward progression, even if there was a noble savage there is no going back to it, there is only forward through the 'Western' way of bourgeois capitalism and eventually to the pie in the sky communal eden. At the barrel of a gun people can be forced quickly through the historical stages by some oppressive regime that is just looking out for the revolutionary interests of all, but for the Marxist utopia to happen certain historical stages needed to have gone through, this is where a certain degree of personal freedom comes in to play. Obviously, this book isn't deal with any kind of revolutionary Marxist sort of uprising, the events in the book taking place about forty two years before the Communist Manifesto was written and forty six years before the Paris Commune, but as the book unfolded I started to read this book not so much as a historical novel about slavery but a novel about the (im)possibilities of revolutionary violence. The Night Women are a Nechayev styled vanguard cell among other cells spread out through other Jamaican plantations planning for the overthrow and killing of the White population. For the first part of the novel there is something noble about them, they are women who are planning on throwing off the tyranny of slavery by any means necessary (which means killing the white population and the black 'johnny jumpers', slaves who work for them and work as third rate slave drivers). Slavery is something most people would agree is awful and something that needs to be ended by extreme means. The barbaric and inhumane treatment that is described in this book I doubt would leave anyone thinking that the people responsible for the cruelties inflicted on the slave population deserve any kind of leniency. For the first half of the book or so the progression is fairly straight forward. The reader is presented with the awfulness of the slaves lives and the rage boiling up and being planned by the women who have taken it on themselves to be brains behind the upcoming insurrection. Then things start to get very fuzzy in the book. And I mean this in the best possible way. The lines between the good oppressed people and the evil oppressors is blurred. Not in a way that makes the one's heart go out for the oppressors and think, gee maybe these white people are actually doing the right thing, or maybe it would be good if the slavery continued or anything like that, but in the fashion that every (or just about ever, I should qualify that universal statement, even though I can't think of an example off the top of my head that would disprove it) self-styled vanguard of revolutionary ideas has ever winded up being oppressors in their own right the Night Women begin to be painted as being an evil themselves, although a lesser evil. The reader starts to see that the way the Night Women view the other slaves is that they are just about as expendable as the White masters see them. People are killed by the orders of the women and the excuse given is that they are more beneficial to the cause by being dead than being alive. And the entire insurrections goals come into question with the idea of what happens after, which is answered with hazy answers of a perfect world once the whites are gone that are in contrast to the very vivid plans for killing real and supposed enemies of the self-appointed organizers of the uprising. I'm going on and on about something that I could just be reading into the book, but I started to see this as on the surface a story about slavery, but also about something more; sort of in the same way Animal Farm is on the surface a story about some talking animals (that might have come out wrong, slavery is much more important of a topic than talking animals). But, when there was the repeated conversation between the leader of the Night Women, Homer, and Lilith the books protagonist, where Lilith would say, something like, \"You know, it take me a long time to see that all you have is a goddam mouth and two Obeah trick.\" and Homer respond, \"Myal.\" (note, Obeah and Myal are both dark magic voodoo type things that practitioners of either one would say theirs is the right one and would praise their form over the other, but to outsiders they both look like the same dark and evil thing). These exchanges could have been Lilith calling Homer a Trotskyist and Homer responding, no I'm a Stalinist. Ugh, I wrote everything above here about two weeks ago. And then I got lost in the review, and abandoned it. I failed to articulate what I was thinking so I spent the rest of the night trying to remember some song I heard a few months ago and who it was by. I failed at that task, too. But I did remember it finally the next day. It was \"Weird on the Avenue\" by The Frogs in case you were wondering and it isn't available on spotify. Where was I going with the review? Slavery is a system and systems dehumanize and kill. Anti-Slavery, slave revolts are also systems, another us versus them, and those kill too, just with an inverted set of values plugged into the algorithm of stupid fucking violence. Another system, maybe one with a slightly more ethical backing of 'justice' working for it, but another basically blind, brutal, dehumanizing and murderous system. But is that to say that the violence of a system of slavery shouldn't be met with some greater form of violence to destroy it? But is it possible to contain that violence only in the cause of righteousness? Um maybe, but most likely not in history is remembered. It's this uncomfortable clashing of two opposing systems of dehumanizing violences clashing at at the narrator of the story is the really remarkable part of this novel to me. I like my books to have unanswerable conflicts and questions. This one has a great big fucking one. This is a great book, even if my incoherent attempt at grappling with the problems of violence have been tedious and painful to read, I would recommend reading this book."}, {"userName": "Elena", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/50678504-elena", "userReview": "3.5-4*Jamaica, finales del siglo XVIII.El comercio y explotación de esclavos para trabajar en las plantaciones de azúcar son el eje de la economía de esta colonia Británica.El nacimiento de Lilith (la protagonista), una esclava fruto de las múltiples violaciones que sufrían las mujeres africanas y jamaicanas ya nos pone en aviso de que este va a ser un libro difícil y crudo.En medio de esta ambientación, un grupo de mujeres se reúnen por las noches para planear una revuelta de esclavos que les de por fin la libertad.En general ha sido una novela muy distinta a todo lo que había leído, que me ha gustado leer y de la que he aprendido muchísimo. Los ligeros toques de realismo mágico y las pinceladas de folklore propio y rituales han sido geniales. Algo que me ha encantado también es el hecho de que la historia está totalmente conducida por personajes femeninos: ellas planean la revuelta y no piensan involucrar a los hombres hasta el momento oportuno \"because men are no good\".Quizá lo que ha podido fallarme un poco en general es ver algunas situaciones y personajes poco aprovechados o no explotados lo suficiente, haciendo que el ritmo de la historia sea algo lento.Aunque lo recomendaría a todo el mundo porque creo que cuenta una historia muy importante y necesaria de conocer, no creo que sea un libro que vaya a gustar a todos. Marlon James ha hecho bien su trabajo de documentación, y no peca de dotar de defectos a los colonos y de virtudes a los esclavos. Todos los personajes tienen sus claros pero sobretodo sus oscuros.Una de las características distintivas de este libro es el dialecto en que está escrito, el Patois, un dialecto Jamaicano (es inglés con influencias africanas). Esto puede ser un arma de doble filo, ya que puede costar acostumbrarse y hacerse tedioso hasta que te familiarizas con los términos. Aún así, y aunque a mi al principio me costó cogerle el ritmo, yo creo que dota de una voz muy personal a la historia, haciendo que el lector viva la historia des del punto de vista de los esclavos, leyendo todo lo que ocurre a través de su forma de ver el mundo y dándoles una voz, en vez de usar el inglés de sus entonces opresores."}, {"userName": "Chris", "userReviewDate": "Dec 10, 2009", "userURL": "http://www.goodreads.com/user/show/91373-chris", "userReview": "Until lions have their historians, tales of the hunt will always glorify the hunter. -- African proverbIn 1750 or thereabouts, a British man named Thomas Thistlewood became restless after failing to establish himself as a farmer (would you expect a genius to take to farming?), boarded a ship headed for Jamaica, arrived to find a land quite welcoming to white folks (despite the fact that 95% of the countryside population was black), and settled in for the life he so richly deserved. Thistlewood’s diary details all of the great fun his thistlewood had upon arrival – 13 women on 59 occasions in his first year on the island; hundreds over the course of his thirty plus years. Did you know that Jamaican women love the white man’s penis? He even took some time away from poking the natives with his thistly prick to invent stuff. Maybe you’ve heard of Derby’s dose? No? It’s an ingenious form of punishment designed to keep the slave population subdued. Here’s what you do: you find a slave who needs to poop (Thistlewood found a slave named Derby who famously loved prunes), you force that slave to poop into the mouth of a slave you want punished, then you wire that slave’s poop-filled mouth shut for a few hours. You don’t want them contemplating an uprising, do you? Of course not. You may also have to chop off a few heads here and there and display them in the slave quarters. Branding their tits, pussies, balls, and cocks and sticking hot pokers up their asses also gets the job done. Nothing’s off limits when it comes to keeping these people in check, folks. Public school teachers should consider similar tactics. The heathens may outnumber you, but they can’t outthink you. _____That made me feel dirty._____As I reached the end of Marlon James’ brilliant novel, The Book of Night Women, I found myself thinking that Quentin Tarantino would love this book. The book is so drenched in violence that the reader can do nothing but stomach it if she has any hopes of understanding the story. She can’t skim pages until it’s over because it’s never over. Similarly, if you attempted to cover your eyes and ears during every violent scene in a Tarantino film, you’d miss half the film and most of the point.Once I had Quentin Tarantino on the brain, I realized that he would also love this book because it is a lot like his latest film, Inglourious Basterds. Without spoiling the movie for those who haven’t seen it or the book for those who haven’t read it, I’ll just say that Tarantino attempts to use the power of cinema to rewrite the past and James uses the power of the novel to take history to task. In his acknowledgments at the end of the book, James gives thanks to the history he learned and the history he had to unlearn. I don’t want to imply that this book completely rewrites the history of Jamaican slavery. I'm confident that it is more historically accurate than Inglourious Basterds, but it’s the idea of turning the tables, of reappropriating the past, that I’m trying to get at. Don't just listen to me, though. In a brief discussion that can be found here on Goodreads, Marlon James says that he is obsessed with the past, specifically with the stories that haven't been told yet, and that this novel is a reckoning with history. James says that he's interested in the lion's point of view. If James keeps writing books like this one, I do believe the lion would be honored to have him as its historian."}, {"userName": "Aubrey", "userReviewDate": "Dec 11, 2013", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "4.5/5\nWho is there when we recall great womens? My name write in blood and me don't answer to it much.\n1785 was the year of the birth of Grimm and De Quincey and a character named Lilith, apparently. Some of that can be taught in grade school and some of it cannot, although that barrier evaporates soon enough judging by the conniptions people are throwing over the concept of trigger warnings. Rape. Murder. Systematic savagery. The stuff of modern day dystopias and zombie adventures except it already happened, white people. Your whiteness attests to that. Skin your body and call yourself European all you like, the wheels turned with every iteration of this Jamaican plantation long enough for consumers of the 21st to long for the 17th and the 18th, and the turning's winning for you still. What? Aren't you pleased? Everyone loves to be on top.Canon, right? The heritage Europe owes to Ancient Greece? What's in a name when Homer's a slave and Gorgon's a slave and Atlas and Pallas and Circe are gods and monsters and sorcerers and slaves, slaves, slaves. Slaves to the whip and slaves to the derby-dose and slaves to whatever the whites can conjure up in matters of piercing and flaying and burning. What do you get when the power of imagination corrupts its fountain of youth and whatever crimes that long ago Hellenistic Age was guilty of are revitalized, reborn, reincarnated onto a larger spread of geography and a more thorough wing of Thanatos. Demeter lived six months in Hades, but she still lived. Andromeda was chained to a rock, but she was saved. Iphigenia was sacrificed in some and rescued by divine intervention in others, but we still remember her name.Story arc? Character development? Will that prevent the likes of this narrative from ever happening again? It's been two centuries. What is it about truth that scares you so fucking much.In 1801, I have Belinda. Others may have Lyrical Ballads, or Atala, or even The Magus. If any of these works contain a mention of the likes of Lilith that fuels them, rest assured academia will have obfuscated the evidence to a tolerable level. Holism does not get a paper published. Politics do not put food on a table. If you're inherently political for belonging to a demographic with a heritage of being said food on the table, well. If you belong to more than one, there's very little you owe anyone. White male philosophers cry out the death of the world and the novel and whatnot entire at the end of the 20th and the beginning of the 21st. Some would prefer to kill it all rather than watch their socially indoctrinated narcissism choke on its own blood.I didn't give this five stars cause I read underrepresented demographics to give myself a larger field of evaluation, not to praise a single work to the hills and assume that meant I didn't need to read Beloved and God's Bits of Wood and I, Tituba, Black Witch of Salem  and Omeros  and forever more. I would've probably been rattled more into the full five territory had I not already read those four, but so it goes. If you haven't read any of those or this or perhaps another work that speaks of bildungsromans the Powers That Be would do anything to bury that you've been too uncomfortable to crack open as of yet, I'd advise you get on that. Don't you want to know what your civil conduct is made of?\nNo woman can afford to feel anything for a man in 1801.White man sleep with one eye open, but black man can never sleep.Rumour start to spread that it is woman who plan the whole thing, which make white man and niggerman, slave man and free man perplex, cause such devious and nefarious thinking was beyond the capabilities of the fairer sex, much less a bunch of goat-rutting savage womens.\nIn 1819, we had the publications of Shelley and Keats and Byron. None of them tell us much about how they came out on top, or what the bottom was made of."}, {"userName": "Perry", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "Night Women Awaken Jamaican Slave Revolt4.5 starsSet against the backdrop of a lush Jamaican sugar plantation in the early 19th Century, the novel follows the life of Lilith born to a slave mother, sired by a white master, who seems to have powers of darkness. After fending off a rape, she is sent from her adoptive slave mother in the fields to slave in the plantation house. Despite being warned by the mother-figure slave in the house not to try to ingratiate herself to the new master newly arrived from England, she does so and after making a mistake in accidentally spilling hot liquid on the master's Creole lady friend at a social event, she is whipped mercilessly at the same time every day for weeks. Eventually she is taken in by the master's best friend, an Irishman named Quinn, to serve at his home on the plantation. Around the same time, the mother-figure slave and several of her half-sisters (all sired by the former master) begin meeting in the early, early morning hours, the Night Women, to plan a slave revolt on the plantation as retribution and retaliation for the atrocities brought upon them. Lilith is conflicted because Quinn begins to treat her like a lady and protects her from harm. Lilith is falling in love with Quinn as the slave revolt quickly approaches, but trying to maintain her animosity for how she has been treated. This is \"the human heart in conflict with itself\" that Faulkner described as the stuff about which great novels are written. Any further description of the story would be considered a spoiler.The book is written in the Jamaican slave dialect, which is not that hard to follow once the reader gets accustomed to it.The Book of Night Women is an intense, unsettling tale full of detail on the vicious, relentless torture and torment which the master and his henchmen inflicted upon the slaves. At points throughout, I could feel my blood begin to boil from some of the resentment the slaves must have felt for their pain and loss and the unmitigated inhumanity to which they were subjected. The novel strikes sparks of vengeance in the soul."}, {"userName": "Chrissie", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "The Jamaican patois, narrated by Robin Miles, is remarkable. I was able to find this audiobook at Downpour!If you choose to read this book, you simply must read this version narrated by Robin Miles, but you must pay close attention. The Jamaican patois isn't the easiest to follow, but it is worth the effort. The narration adds to the value of the book. You are a slave and you HATE the English estate owners, particularly Miss Isabelle. I do at least. I want to slap her and ..... The different character intonations make each one come alive, be that an uppity English woman, a crazy old mistress, a Johnny-Jumper, a field nigger, a house nigger. Lilith is an uppity teenager; most of us know what that means. Skin color hasn't a thing to do with that, at least not in the beginning. Then it gets more complicated. This book is an immersion into another culture and time and place: a Jamaican plantation in the late 1700s / early 1800s. History is interwoven, but it is the atmosphere that swallows you up. A comfort read? No!Humor? It is here, but sardonic. Black in more ways than one.I have covered half. A little less than 8 hours remain.***************Now, having completed it, all I can add is that if you dare to tackle the subject and if you think you are up to total immersion in the horrors of black life on a Jamaican sugar plantation, I cannot name a better book. Don't read it; listen to Robin Miles narration. I will definitely have my eye out for other audiobooks narrated by Robin Miles. Her performance definitely improved the book. I have thought a lot about if the plot line is believable. Yeah, it is. Teenage girls and their emotions: are they stable, predictable, reasonable, logical? No."}, {"userName": "Christina", "userReviewDate": "Feb 17, 2009", "userURL": "http://www.goodreads.com/user/show/140443-christina", "userReview": "Jesus, what a book. This book is absolutely unflinching in its portrayal of slavery in 18th century Jamaica. Vicious prose, and in-your-face, no-holds-barred detail. It's also completely dedicated to voice and perspective, and the choices James made here are exquisitely laudable. It also weaves a beautiful story amid tragic characters, with enough sensory language to make you cringe. This is, absolutely, a book about what it means to make choices.There are three things I'll say about this book:1) This is not a book I will recommend to my mother.2) This is a book I will recommend to readers my age who aren't offended by coarse language and gory detail.3) This book should be required reading for college-level colonial slavery classes.Okay, four things.4) This book was amazing."}, {"userName": "Laila (BigReadingLife)", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/117593-laila-bigreadinglife", "userReview": "This book was amazing.Utterly devastating, but amazing.Now I need to read and own everything else Marlon James has written or will ever write."}, {"userName": "Britt", "userReviewDate": "Oct 21, 2015", "userURL": "http://www.goodreads.com/user/show/11622704-britt", "userReview": "This book was amazing. I often get caught on an idea about what makes a good book and then books like The Book of Night Women comes along and basically says \"No, THIS is what makes a good book\". I appreciate how deliberate James was with his character development. I was concerned throughout the book that Homer would be some magical Negro that would be there to perform her superhero magic and save the day, but then we get into her flaws and I loved her complexity more and more as the book progressed. Lilith, poor Lilith, I think is so many of the little black girls we know and love today. She struggles to maintain control of her mind, body, and spirit while in an environment that is constantly trying to deface her beauty. I really loved the ending and that James didn’t necessarily leave the story on a redemptive note, because the pain, the fire is still there and as far as the ending is concerned in my eyes there are still debts to be paid. Loved this book!!! It was like the movie Rosewood, but the black anger is turned up to level 10."}, {"userName": "Kathy", "userReviewDate": "Mar 15, 2009", "userURL": "http://www.goodreads.com/user/show/866393-kathy", "userReview": "This book was AMAZING!!!! It was one of the few books I never wanted to put down and I even finished it in my designated book loan time period.Warning this book is very graphic, language and imagery. What was the most powerful part of the book and of James' narrative was he described perfectly a system of oppression that you still see in today's society. The destruction of communities, pitting one person against another, the internalized oppression, you still see that today. I also really liked the internal conflict within Lilith. She was always struggling about the hate she felt for the white people, if she should feel hate, if she doesn't hate them then is she black, her conflict of being black and white and what that really means for her. James did an amazing job conveying Lilith's internal struggle. I highly recommend this book to everyone!"}, {"userName": "Carol", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/3845138-carol", "userReview": "Truly an astonishing piece of work. Mesmerizing. Horrifying.Review to follow...."}, {"userName": "Hannah", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/6940509-hannah", "userReview": "2 Stars - OkayI know I’m in the minuscule minority with this rating, but this book was just okay for me. I think my expectations were quite high (too high) and that set me up for failure from the beginning.The writing is fantastic and the story is great but there was a disconnect - something I can’t quite put my finger on. There is no logical reason why I should give this book 2 stars. It seems utterly perfect on paper and I recognize that. However, I missed something. I completely take the blame for this one falling flat. Maybe I wasn’t in the right mindset?"}, {"userName": "Daren", "userReviewDate": "Apr 05, 2016", "userURL": "http://www.goodreads.com/user/show/11995655-daren", "userReview": "OK, close enough to the end of 2017 for me to determine my favourite reads. The Book of Night Women is my 2017 BEST FICTION.This book gets a lot of literary praise - and it is hard to argue with that. It is exceptionally well crafted, with an intricately woven story, with very realistic events, and graphic violence. I really enjoyed the written dialect, which was consistent and easy to pick up on, but lent a truer voice to the narrator.The brutal life of a slave, almost impossible to survive, is the focus of the novel, along with examining the interactions of slave with master, slave hierarchy and hierarchy within the white characters. Set on the Montpelier Estate in the late the century and early 19th century, the events follow a recent uprising on the nearby island of Saint Domingue, which had resulted in the slaves taking control of the island.Maybe a few minor spoilers below...The slave characters are almost all female, with the exception of a lunatic who remains chained up for the most part. It is the head house slave Homer who takes in Lilith, the damaged mulatto orphan girl, and brings her into a circle of women who are plotting an island wide slave uprising & rebellion. The author plays on what happens to a girl so brutally treated who is also treated with kindness. As the Lilith develops from a girl to a woman, she is tested by each relationship she establishes especially Homer and Robert Quinn, the Irish overseer who she eventually makes home with.The depictions of violence were brutal and detailed, and although the book is fictional, it seems that they were probably very representative of what had taken place. If you are not a fan of horrific treatment, and plenty of swearing, this one may not be for you.Five Stars."}, {"userName": "Judy", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "This was quite some book. The Book of Night Women takes the reader to turn-of-the-19th-Century Jamaica, rife with sugar plantations, racial unrest and the height of slavery. The account is well-written, allowing the reader to see the good and evil of all races. James drops a love story in the midst of all the darkness and turmoil of the historical background. The character of Lilith is excellent and James excels as showing her growth as a person, confusion and strength.Dialect: The entire book is written in the Jamaican dialect, so I opted to listen to the book. This turned out to be a good choice as the narrator was excellent. I wondered if I would get tired of listening to 15 hours of Jamaican dialect, but came to the conclusion that the book wouldn't have been half as powerful without it. Brutality: This is not a book for the faint of heart. It is loaded with violence and hatred. However, I felt it was necessary in order for the reader to grasp the gravity of how despicable slavery is. The white man brutalized the black man, who in turn hated the white man and brutalized him when given the opportunity. A very sad, repeating cycle in Jamaica.4.5 stars"}, {"userName": "Bryn Greenwood", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/911794-bryn-greenwood", "userReview": "How did this book not win eleventy literary prizes? I am still trying to formulate ways to verbalize how powerful this story and its telling are. Most importantly to me, it's a book that centers its female characters and imbues them with incredible depths of feeling. It tears open the glossy narrative of the noble slave and reminds us that enslaved people are above all, below all, people. With the possibility of greatness and pettiness and kindness and cruelty. And it strips bare any attempts to paint slavery as anything other than the dehumanizing monstrosity that it is. As for the writing, James illustrates the skill required to elevate from \"dialect\" to simply \"this is the narrative voice\" in a way that should serve as a caution to anybody even thinking of writing in dialect."}, {"userName": "Kima", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/6025687-kima", "userReview": "This is the worst book I've ever read in my life.I cannot discuss it without giving \"spoilers,\" but I will say this: slave narratives are not the place to be fucking around.James' language is crude, vile and lends nothing to the narrative. The narrative is hinged on over romanticized relationships between slaves and slave masters. In a very trite attempt to trouble the discourse or spark a nuanced discussion, Marlon James has successfully belittled the politics of enslaved black women of this time by reducing them to little more than catty, foul-mouthed and concerned with bedroom politics over all else-- even in times of upheaval and insurrection."}, {"userName": "Emma", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "'Every negro walk in a circle. Take that and make of it what you will.'This book will stay with me for a long time."}, {"userName": "Chris", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "There is something about a Marlon James book. It takes me around 100 pages but then I don’t want to put down the book. That was true about a Brief History of Seven Killings and this one. \tThe Book of Night Woman chronicles the story of Lilith, a black woman who is enslaved at the Montpelier Plantation. She is tied to the Night Women, a group of women who are planning a mass slave revolt.\tIn part, the story is harsher, and truer, riff on works such Joseph Andrews and Pamela. But Jones also draws on the gothic and the story of Troy. There are so many literary allusions in this novel that discussing them could be a review itself.\tBecause the story is about slavery and the treatment of women, it is a harsh read. But it so powerful and wonderful. It’s bloody brilliant."}, {"userName": "Ifeyinwa", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/5587447-ifeyinwa", "userReview": "Still processing..."}, {"userName": "Sandi", "userReviewDate": "May 13, 2010", "userURL": "http://www.goodreads.com/user/show/811687-sandi", "userReview": "I'm going to comment first on the audio production of this book. Wow. I was sucked in by Robin Miles' voice from the first sentence. She narrates everything except the dialogue in a Caribbean accent that is absolutely hypnotic. Her voicing of the various characters' dialogue is impeccable. The book is full of extremely graphic imagery and vulgar language, but Ms. Miles makes it sound so musical. I would give the audio a five-star rating.Now, on to the text. The Book of Night Women is absolutely brutal. It's full of graphic violence, sexuality and violent sex. I have spent the last week or so with words going through my brain that one cannot use in the real world. There was not only the oft-repeated word for a black person that was common in the 18th century, but there was constant use of the c-word and the p-word for female genitalia and the c-word for mail genitalia and the f-word for what the f-word really means. About halfway through, I got curious as to the gender of the author and looked him up. As I suspected, it was a man. I was wondering because the women in the story seemed as focused on their genitalia as men. Frankly, I just don't think about my parts that much and I don't know many women who discuss their girl bits quite that much. There was a lot of rape and torture involving female genitalia as well. Sometimes, it seemed like some sort of extreme sadistic sexual fantasy. There was a lot of torture also that wasn't sexually related, and that was brutal too. Now, I do know that slavery was a horrible institution. In fact, my primary criticism of Alex Haley's Roots is that it made slavery seem almost nice. The Book of Night Women seems to go to the opposite extreme. I found it really hard to believe that people, both white and black, could maintain that level of sadism constantly. I also didn't find the change in Lilith's character to be very plausible. I don't think the way she ended up fit with the person she was through most of the story. It was kind of a fairy-tale transformation brought on by true love that just didn't ring true in the context of the rest of the novel.Yet, I do give this book four stars. It aroused some very strong feelings in me, albeit negative ones. I felt as if I had been tortured and beaten. James' prose is so poetic. The tempo and repetition in this novel has a kind of magic about it. It's a powerful book. I feel like I should cheer myself up with a re-read of Beloved."}, {"userName": "Missy J", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/7406091-missy-j", "userReview": "Now I've read all of Marlon James' 3 novels and this one is my favorite, followed closely by A Brief History of Seven Killings. What I appreciate the most about The Book of Night Women is the complexity James captures of a horrific time - slavery. The slaves in this book are not depicted as helpless victims. Even after harm has been done to them, they still think about revenge. Also not all the blacks are united against the whites. There are fights between the black and the white, but also between the black and the black (for the favor of the white). Finally, the Maroons (runaway slaves in the interior of Jamaica) would return the newly runaway slaves back to the white folks for financial gain. I never heard of this before, but it makes sense. Them Maroons make me feel like no nigger deserve freedom. No nigger must be man or woman. They think they free but they base and wicked...  Another aspect that was brilliantly written about was Lilith's \"coming of age\" story and how she makes sense of the world around her. Slaves didn't have a normal upbringing in any way. Children were torn away from parents and simply raised to do labour and live in fear. So it took a really long time for Lilith to understand her own feelings, understand what's the relationship between man and woman that isn't in the context of slave master and slave. I highly recommend this book. Often I'm very suspicious of slave narratives that were written by authors born after slavery. How can they capture such a horrible time in history without coming off as fake? How can they capture what's in the mind of a slave if they have never experienced these horrors? I think James' novel is the closest I'll ever get to finding the answers. And this is also one heck of a novel about a slave rebellion!"}], "description": "The Book of Night Women is a sweeping, startling novel, a true tour de force of both voice and storytelling. It is the story of Lilith, born into slavery on a Jamaican sugar plantation at the end of the eighteenth century. Even at her birth, the slave women around her recognize a dark power that they and she will come to both revere and fear. The Night Women, as they call themselves, have long been plotting a slave revolt, and as Lilith comes of age and reveals the extent of her power, they see her as the key to their plans. But when she begins to understand her own feelings and desires and identity, Lilith starts to push at the edges of what is imaginable for the life of a slave woman in Jamaica, and risks becoming the conspiracy's weak link. Lilith's story overflows with high drama and heartbreak, and life on the plantation is rife with dangerous secrets, unspoken jealousies, inhuman violence, and very human emotion between slave and master, between slave and overseer, and among the slaves themselves. Lilith finds herself at the heart of it all. And all of it told in one of the boldest literary voices to grace the page recently--and the secret of that voice is one of the book's most intriguing mysteries.", "title": "The Book of Night Women", "url": "http://www.goodreads.com/book/show/4682558-the-book-of-night-women", "average": 4.33, "cover": "https://images.gr-assets.com/books/1442717381l/4682558.jpg", "reviews": 1068, "authors": [{"url": "https://www.goodreads.com/author/show/56064.Marlon_James", "name": "Marlon James"}], "type": ["Historical", "Fiction", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/4682558-the-book-of-night-women", "http://www.goodreads.com/book/show/7627833-the-book-of-night-women", "http://www.goodreads.com/book/show/8201100-the-book-of-night-women", "http://www.goodreads.com/book/show/25143682-the-book-of-night-women", "http://www.goodreads.com/book/show/6123063-the-book-of-night-women", "http://www.goodreads.com/book/show/20893314-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/97566.John_Crow_s_Devil", "http://www.goodreads.com/book/show/29427714-marlon-james-collection-3-books-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/28191591-black-leopard-red-wolf", "http://www.goodreads.com/book/show/40204932-der-kult", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}