{"ratings": 4041, "userreviews": [{"userName": "Drucilla", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/5476796-drucilla", "userReview": "[I loved the introduction of Fear street at the end! (hide spoiler)]"}, {"userName": "Donna", "userReviewDate": "Dec 26, 2011", "userURL": "http://www.goodreads.com/user/show/2465264-donna", "userReview": "At this point you’d think someone would be like JUST MARRY ALREADY because we’re creeping up on 250 years of bad luck and dead bodies and it’s about time to let this shit go instead of keeping the home fires burning, you know?Nora is our storyteller throughout the series and now, in this last book, we finally get to her story that was introduced at the beginning of the first. Like all the others it involves two lovebirds wanting to marry after a few hours of knowing each other but shenanigans ensue and people burn to death. You know, the usual.Except Nora does end up locked in an attic by her father, Rapunzel-style but Daniel just busts down the door and rescues her. The good thing about Nora is that her crazy is a little more sedate. Stine had a bad habit of showing the lady folk and their brain squishees completely disintegrating in the face of calamity. Whether they screamed constantly or repeated names until the end of time or became entirely catatonic, the men survived a little better in Stine’s world. Although one of the original Fiers from book one did get a rather epic death in that he laughed himself into insanity and bricked him and his wife into a single room in their house and was left to rot.Another bonus for Stine, he certainly has some creative deaths at his finger tips. I was constantly entertained by the way people died in this series. My favorite was the little Beetlejuice head in book two that replaced a normal head by popping it. Love. It.I didn’t see the small twist at the end of this book coming, although maybe if I paid a little more attention to the details I would have but that’s me for you. It’s not a surprise, really, but it was probably the safest route for Nora because the Fears and the Goodes are just a shitbag combination and shouldn’t be trusted in the same room together.Ultimately this series saturates the land in blood and sets the stage for the whole of Fear Street to come along (albeit having been written after the start of Fear Street, prequels, yay!) and get more people killed. So many deaths and in such interesting ways. God, I love my cheese."}, {"userName": "Lindsay Heller", "userReviewDate": "May 29, 2012", "userURL": "http://www.goodreads.com/user/show/5692992-lindsay-heller", "userReview": "I remember when I was little waiting, very impatiently, for this book to be published. It November of 1993 and this was the third, concluding, book of the Fear Street Saga, the historical horror trilogy that explained why Fear Street, in R.L. Stine's Fear Street series of books, was so haunted. I got it for my birthday, immediately tore in, and was not disappointed. This book continues the story of the Fears (who have now changed the spelling from Fier) and the Goodes, two feuding families not opposed to using the \"dark arts\" to exact revenge upon each other. This book mostly deals with Simon Fear and his immediate family. In the previous book, 'The Secret', Simon's two sisters both fell in love with the same Goode and paid the price, now Simon's heart is hardened. When he meets Angelica Pierce in New Orleans he knows she's for him, he just doesn't realize how much. But the curse follows them, even when they settle into the notorious Fear mansion in Shadyside. So, I mean, was this written in, probably, a month and then released only in mass backs for a bunch of thirteen year olds to pour over? Yes. Is it good? I'm going to go ahead and say yes. This whole series is good. It's creative. And to a kid who liked ghost stories, I couldn't have asked for better."}, {"userName": "Estrella", "userReviewDate": "Sep 24, 2009", "userURL": "http://www.goodreads.com/user/show/2721136-estrella", "userReview": "That was one of the first books i ever read from R.L. Stine and it's still my favorite till this day. You cant really explain what this book is about because it has so many twists and turns that it leaves you stunned at the end. When i read this book it was like a movie in my head because i could see exactly what she was describing. She made The Burning with so many vivid details that I actually thought i was watching it and forgot to close the turn of the T.V when i finished.I think this was one of her most greatest books i have ever read and it did make me love the genre mystery thanks to this book I love reading mysteries. I think everyone should read this book i loved it and it's and its a 5 star rating for me!"}, {"userName": "Sakura Koneko", "userReviewDate": "Aug 12, 2007", "userURL": "http://www.goodreads.com/user/show/272005-sakura-koneko", "userReview": "The final book in this series, I ended up picking it up after reading the other two, wanting to see how these horrible series of events would end (though knowing it couldn't be very well, because otherwise we wouldn't have the Fear Street series of books)."}, {"userName": "Kristine (The Writer's Inkwell)", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/8123570-kristine-the-writer-s-inkwell", "userReview": "Posted originally on my blog: The Writer's InkwellIn the final installment of the Fear Street Saga, Nora begins to tell the tale of Simon Fear and how the Fear mansion mysteriously burned down one evening. This is my least favorite of the three books. It claims Simon’s story is the evilest of all, but in truth, you get only samplings of his life. To be honest, I wish Stine had a companion series of the Goodes during these same years. It would be extremely interesting to discover how the timelines converge the way they do throughout the books and what happened to the Goode family during the years away from the Fiers/Fears.Also, in looking back on the stories, there are only two instances in all of the tales, in which the Goodes actually did any harm to the Fier/Fear family. The first is in book one, when Susannah Goode’s father used magic to look like a young man and worm his way into the Fier’s household. He tricked Mary Fier into loving him and murdered two members of the family. The second takes place at the end of book two, in which Simon’s family takes in a stranger, who says he’s the last remaining Goode and he proceeds to murder most of the family. Truth be told, most of what happens to the Fiers is of their own making.In this particular book, one of Simon’s daughters sets out to murder the other. When she fails and her sister believes she’s accidentally killed her in self defense, she’s buried alive. All of this is blamed on the young maid who happened to be a Goode, but she didn’t actually do anything wrong. Also, how was she a Goode if Simon killed the last one decades earlier?This is why a companion to this series is needed. There are a ton of holes in this story and it would be that much better if you could fill in the blanks."}, {"userName": "Manda", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/21443134-manda", "userReview": "Nomadic SA Chick's Book Reviews\nReview\nI loved this series as a teenager. I probably read the trilogy a hundred times in my teens. I don't know what it was about these books, but I was hooked. Reading them 10 years later as an adult I gave myself a migraine from all the eye rolling I did. I couldn't believe all the cheesy romance lines and easy swooning these ladies did. I mean good lord, a man said hi to these ladies and they wet their knickers with the excitement of wedding planning. It's laughable, but I can see how teen Manda was swept up in this, because what teenage girl doesn't want to believe in love at first sight. While grown up Manda is bitter and critical of love and laughs in its face. Stine has always been one of my favorite authors, and while I don't read much of his works these days, I've kind of aged out of them, I still appreciate everything he's written and all the joy he brought me as a child, starting with my very first Goosebumps book.These books aren't something I will probably ever pick up again, but they will always have a special place in my library, and I would encourage every young girl to read this series. While the ladies in this book fall foolhardy in love like it's going out of style, Stine also manages to write some very strong and fierce women in this book that will help bring courage to the young woman reading it.\nRatings (based on a 10 point scale)\nQuality of Writing - 6Pace - 6Plot Development - 5Characters - 6Enjoyability - 5Insightfulness - 5Ease of Reading - 8Photos/Illustrations - N/AOverall Rating - 3 out of 5 stars"}, {"userName": "Mary", "userReviewDate": "Nov 20, 2008", "userURL": "http://www.goodreads.com/user/show/1535483-mary", "userReview": "This is an amazing great book because it had a lot of colonial times events.It was during the time period which made it very non-fictional because stories like this happened during those time periods!!!!!"}, {"userName": "Lilith Rayne", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/5724349-lilith-rayne", "userReview": "It was a good read but not as interesting as the previous two. Sometimes it felt like more of the same. The conclusion was not very satisfying for me, either. I would recommend it as a light read and if you want to find out what finally happens to the families involved. I give it 3.5/5."}, {"userName": "Alexis", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/20357391-alexis", "userReview": "A great beginning to Fear street! I loved reading about the Goode and Fier family feud. It has been so long since I read any of the Fear Street books, and I'm glad I was able to get my hands on them again! I truly missed reading them."}, {"userName": "Brekke", "userReviewDate": "Dec 05, 2011", "userURL": "http://www.goodreads.com/user/show/7093693-brekke", "userReview": "I used to love the fear street series when I was a kid. I think that anyone who likes a good mystery story and being young at heart should give them a try."}, {"userName": "Alex", "userReviewDate": "Sep 09, 2012", "userURL": "http://www.goodreads.com/user/show/1630945-alex", "userReview": "This is my favorite trilogy in the Fear Street series, but this last one just isn't as good as the first two."}, {"userName": "Ronni Lea", "userReviewDate": "Aug 10, 2012", "userURL": "http://www.goodreads.com/user/show/11624542-ronni-lea", "userReview": "wow! fear street! my fave as a young in! I wonder if I'd like them as much now as I used to. I think I still have em all somewhere. :-)"}, {"userName": "Samantha", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/5484555-samantha", "userReview": "I never cared much for the Fear Street Saga. They were interesting I guess, but just generally never my favorites. Re-reading them was intriguing, since I didn't remember a lot about them, but it's nothing I'd feel compelled to go back and read a third time. They just aren't quite as good as some of the other Fear Street books, which is sad since they tell the history of the place."}, {"userName": "Irham Nurrahman", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/42178678-irham-nurrahman", "userReview": "Saga ini ditutup dengan sangat baik,Saya sangat menyukai cerita tentang awal cerita kota Fear Street,saya sadar gara2 tiga buku ini-lah yang menyebabkan buku Fear Street jadi banyak :)"}, {"userName": "Jennifer Lynn", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/11799546-jennifer-lynn", "userReview": "I should never have re-read these...."}, {"userName": "Tanner", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/8051051-tanner", "userReview": "“...do you know what they’re going to call the new road.” “What?” Nora asked weakly.“They’re going to call it Fear Street.”Ahh that how was it!"}, {"userName": "Melissa", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/3452754-melissa", "userReview": "Not great, but it was an entertaining read in my teens and luckily I found myself just as entertained as an adult."}, {"userName": "Andrés", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/1389623-andr-s", "userReview": "This is a classic of my childhood. I read this series instead of Goosebumps. I still have my old copy!"}, {"userName": "Lauren", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/3424653-lauren", "userReview": "Over a hundred years ago Benjamin Fier framed an innocent girl for witchcraft and burned her at the stake. Over a hundred years since his brother Matthew robbed the girl’s grieving father. Over a hundred years since everything began, but just two since the curse was reawakened and Frank Goode murdered the Fier family in cold blood. Only two years since Simon Fear changed his family name and forswore good. The chain is completed, the end is beginning.The Burning is the third and final book in the original Fear Street Saga by R. L. Stine; it’s also the first of the three to give us a villain protagonist. That’s actually a thing that I appreciate about the book. Having Simon as both our starting protagonist and, ultimately, the antagonist of the book ties things up nicely in a way that the previous two books didn’t. The reader has known that the Fear Mansion was going to burn down at the end, leaving Nora Goode all alone; it’s just been a matter of getting there. The big down side here is that I feel like the first half of the book was really rushed. Pacing has been a problem throughout the trilogy, so it isn’t a huge out of nowhere thing. It’s more another example of needing to get things in place for what comes next and not having the room for much build up. There’s some out of nowhere stuff that I would have liked to have seen more support for, but it’s par for the course at this point.I can’t say that The Burning is the strongest of the three books, which probably still goes to The Betrayal, but it does pretty well for itself. While rushed in a lot of ways, I feel like a lot of the things that are rushed could or would probably be hand waved with the curse if the extra space had been taken to go further in.There’s really not a lot for me to say here. The Burning has its points that work, and work well, but it also shares the same weak points that the rest of the series has. It also has an unfortunate side effect, since the reader knows about how it ends and that Fear Street is ultimately still cursed, of not having a really satisfying ending. It’s just kind of done. So, at the end of the day I think it earned a three out of five. If any single part of it had been a touch better it would have been a four."}, {"userName": "Shannon", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/5485579-shannon", "userReview": "[the bodies of Simon and Angelica’s two daughters were found in the woods with their bones missing— all that was left of them being their skins (hide spoiler)]"}, {"userName": "Indira", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/5952174-indira", "userReview": "This review is for the whole series. I was reading Fear Street books way before I reached the age that I should have been reading those. Goosebumps was child's play and this Fear Street Saga books are my absolute favorites from the dozens of books R.L. Stine wrote. I loved the feud, the gruesomeness of each murder, the time periods and the creepiness of every single story. The other day I was hit with some serious nostalgia and decided I had to read these books again (how gorgeous are the women on books #1 & #2 btw!?) . I wasn't disappointed, I enjoyed these books immensely again although I was shocked to realize how short these books actually were. When I was young they really seemed huge and were a big accomplishment to finish. I actually owned these books but lent them to someone, forgot who it was and these books were lost forever. Thank goodness for the internet!"}, {"userName": "Ash †Reviews of a FearStreetZombie†", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/28576491-ash-reviews-of-a-fearstreetzombie", "userReview": "Such a amazing ending to a awesome start!I honestly didn't expect this book to end the way it did... Actually, I didn't expect anything in this book. It all caught me off guard leaving me with a \"that's new\" thought and O_O look on my face.All in all, this book was AMAZING!"}, {"userName": "T", "userReviewDate": "Apr 17, 2014", "userURL": "http://www.goodreads.com/user/show/26991609-t", "userReview": "Over 17 years later and I still remember how awesome this saga (series) was. He very exquisitely captured the essence of the days of 'olde' and I felt like I was being transported in time. Obviously some of the details of the story have slipped away with time, but the emotions and feelings that Stein’s tales elicited have steadfastly remained throughout the years and I struggle to recall another novel that has so markedly “transported me through and to another time!” Of course there’s the possibility that I was an impressionable teenager, never-the-less the story has stuck with me throughout the years, and that says a whole lot."}, {"userName": "Jan", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/3566496-jan", "userReview": "3 1/2 stars. This last book in the Fear Street Saga which tells the story of the curse that plagues Fear Street rounds out what happened to the Fier (Fear) family although the fate of the Goode's is left up in the air. It is not as creepy as the first two books but goes about the business of winding up the story. I did enjoy finding out about the families although there is a sense of hopelessness toward the end. No one seems to have learned any lessons about the futility of seeking revenge. No one learns to be forgiving. I kept waiting for a ray of hope. Well, I guess if that had happened we wouldn't have Fear Street."}, {"userName": "Alexis Jade", "userReviewDate": "Feb 27, 2010", "userURL": "http://www.goodreads.com/user/show/2873574-alexis-jade", "userReview": "I love the plot and twists & turns with the Fear Family. I like these kind of Fear Street books because they tell us how Fear Street came to be and what we need to know. The book was a little boring and not my favorite, but the year it was in and everything pulled me in.By the way, I only read this one because I was interested in finding out how Fear Street came to be. I like how R.L. Stine put it and the Fear Mansion seems pretty creepy to me. But I prefer the other Fear Street books such as the Cheerleader Series."}, {"userName": "Caidyn (BW Book Reviews; he/him/his)", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/13614926-caidyn-bw-book-reviews-he-him-his", "userReview": "Angelica and Simon were such a great couple. Their story is the only one I remembered from the reread of the trilogy, mainly because of the twist it brought. Each book had about the same formula. Either the Fiers or the Goodes would move and try to settle, then something awful would happen to reawaken the curse for one side. Then, a daughter of one would fall for the son of the other and terrible things ensued. The formula worked, but it is presictable. Still, I really enjoyed these books because it just took me back to what I enjoyed reading as a child."}, {"userName": "Charity", "userReviewDate": "Apr 04, 2016", "userURL": "http://www.goodreads.com/user/show/32360392-charity", "userReview": "I love this story!! Simon thought that he could escape the curse but it found him in the worst way imaginable. Then theirs Daniel and Nora, and it seems that their story will end happily and that the curse is finally over but the outcome broke my heart. Poor Nora!! Very well written. Well done Mr. Stine!! Horror fans should check this one out!"}, {"userName": "Selvianty Selvianty", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/1675370-selvianty-selvianty", "userReview": "Apakah kutukan keluarga fear akan berakhir disini? Cukup mengherankan sebenernya, nampak konservatif (ya iya sih kan ceritanya dr abad 17 sampe abad 20), semua anak gadis keluarga Fear kalo bukan gila ya mati. Selalu tersisa satu anak lelaki keluarga Fear untuk meneruskan nama keluarga. Takdir yang berbelit-belit hanya karena dendam."}, {"userName": "Syahira Sharif", "userReviewDate": "May 25, 2011", "userURL": "http://www.goodreads.com/user/show/4247818-syahira-sharif", "userReview": "The book was the end of a trilogy. This is also the first book I read in my first highschool library that sparks my obsessiveness with paranormal fiction. My sister had the book earlier than this series about a girl who had the Fear medallion which was stolen by one of the Fear who left her to die. But the entire series was out of print. Can't seem to find it anywhere since 2003."}], "description": "The end…and the beginningSimon Fear thought changing his name would stop the evil. He was wrong—dead wrong.After generations of unspeakable horror, it is up to Daniel and Nora, brought together by their fateful love, to unite the feuding families. But is their forbidden love strong enough to withstand such awesome evil?Poor Nora—desperate to tell the truth and bury the family curse…before it buries her.", "title": "The Burning\n      \n          (The Fear Street Saga Trilogy #3)", "url": "http://www.goodreads.com/book/show/176253.The_Burning", "average": 3.94, "cover": "https://images.gr-assets.com/books/1348827395l/176253.jpg", "reviews": 111, "authors": [{"url": "https://www.goodreads.com/author/show/13730.R_L_Stine", "name": "R.L. Stine"}], "type": ["Horror", "Young Adult", "Childrens", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/176253.The_Burning", "http://www.goodreads.com/book/show/125553.Welcome_to_Dead_House", "http://www.goodreads.com/book/show/125564.Night_of_the_Living_Dummy", "http://www.goodreads.com/book/show/125662.Say_Cheese_and_Die_", "http://www.goodreads.com/book/show/308540.The_Haunted_Mask", "http://www.goodreads.com/book/show/125540.One_Day_at_Horrorland"]}