{"ratings": 15827, "userreviews": [{"userName": "Jonathan Ashleigh", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/33737465-jonathan-ashleigh", "userReview": "This is Where I Leave You is wonderful and if you liked it enough - you will probably read this book (also by Jonathan Tropper), but you probably won't like it as much. I wish it would have stuck with it's original title - Bush Falls. I like that a lot more, as it is the book which the main character writes that makes everybody hate him. I did like this book but only because it was sort of like This Is Where I Leave You. The characters were good but did not have the dimensions I was looking for. The ending was kind of morbid in a way that was also trying to be cute; I can take morbid but please refrain from also making it cute."}, {"userName": "matteo", "userReviewDate": "Mar 08, 2007", "userURL": "http://www.goodreads.com/user/show/20493-matteo", "userReview": "An absolutely incredible book. It made me laugh, it made me cry, it made me think. I read a lot of books, but I rarely respond to them like I did to this. Upon finishing it, I immediately called several of my friends and told them to go get it RIGHT NOW, because it felt like Tropper was writing exactly what we had been through. Tropper writes as though he is in the minds of his readers: you can feel the love, hatred, hurt, joy, confusion. The story might not always be fantastic, but his ability to connect is."}, {"userName": "Kelli", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/4146551-kelli", "userReview": "\"God,\" I say. \"Remember high school?\"“Full of promise, full of dreams, full of shit. Mostly just full of yourself. So full you’re bursting. And then you get out into the world, and people empty you out, little by little, like air from a balloon.” Jonathon Tropper is my age. I know this because I looked it up somewhere in the midst of listening to this book. I had to look it up and yet I think I knew the answer long before I saw it. How else could it be? How else could he get everything so right? This story opens a door that most of us closed a long time ago. The story is funny...at times laugh-out-loud funny...but it is also sad and relatable and real. That is Tropper's gift. His characters are so honest that they embody people you know, people you knew, people you wanted to know. His presentment of high school is spot on. Didn't we all think we were so grown up? This is a middle aged man's look back at the glory days that maybe weren't as great or as bad as they seemed. There is a little bit of everything in this and I just loved it all. It is amazing how four short years can shape us so much. I have always said that there is no love like high school love. It is the perfect mix of hopefulness, naivety and hormones.\"Everyone always wants to know how you can tell when it's true love, and the answer is this: when the pain doesn't fade and the scars don't heal, and it's too damned late.” Amen, Jonathon. Amen. *I have a hard time believing this was written over ten years ago. The writing is at times overwrought, the characters a bit cliche but this is still fantastic. 4.5 stars"}, {"userName": "Dashka", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/1199629-dashka", "userReview": "I wanted to like this book. I had every reason to -- not only was it the only book I had with me on vacation, but it had been recommended by someone whose opinions I trust and the author had been compared to Michael Chabon and Richard Russo, writers I love. But no matter how much I tried, I could not ignore the absolute awfulness of the writing. Tropper piles on adjectives randomly, giving ridiculously elaborate and yet banal descriptions of mundane things like drinking a soda (\"long, thirsty sips\") or smoking a joint (\"one long, meaningful drag\" -- which makes you wonder what the meaning of a meaningful drag might be) while at the same time falling back on the most trite and obvious cliches when describing important things -- like his characters. The love (or really sex) interests are invariably described using words like \"perfect,\" \"flawless,\" and \"hairless\" (really!) -- there's not a single, fond conjuring of a woman's physical quirks other than a brief mention that one woman's imperfections \"only serve as foils to her perfection.\" Instead, we're treated to descriptions that seem to have been ripped out of a Penthouse Forum letter -- \"her full, impossibly red lips\" and \"her breasts straining against the dark fabric of her sweater\" and so on. Meanwhile, the characters are mostly one-dimensional cliches -- the dim-witted bully, the sadistic coach, the pursed-lipped sanctimonious Christian mother of the gay athlete, the tragic homosexual, and, of course, the high school sweetheart who remains true and sensible in the face of the hero's self-destructive imbecility, biting her lip on page after page whenever Tropper wants to convey that a thought has entered her pretty head. As much as I tried to soldier on, I ended up defeated at page 226 by the book's overwhelming awfulness."}, {"userName": "Reese", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/2624836-reese", "userReview": "A psychiatrist friend once told me that the psyche knows no greater pain than shame, that shame is so painful that, within a nanosecond, it is experienced as anger. The word \"angry\" clearly falls short of capturing the intensity of feelings about Jonathan Tropper's Joe Goffman, who had the chutzpah to make the name of his hometown the title of a novel -- one that would become a best-selling book and then a movie. The fact that Joe's work is fiction does not diminish the embarrassment felt by the \"real people\" who recognize themselves in his characters. So in Bush Falls, Joe Goffman is despised -- of course -- he pressed almost every shame button in the cockpit. When Joe ends a seventeen-year absence from the town where he was born and raised (Dad is dying), he is essentially signing up for Angry Manifestations of Shame 101. We, Tropper's readers, get to audit the course. The Book of Joe heightens our awareness of the connections between the cause(s) of \"major\" anger and both what it produces and for how long. And Tropper has done more than create action figures for a showcase of angry responses. Well-crafted, impactful lines and once-beautiful relationships made more beautiful by repairs allow me to call The Book of Joe a beautiful work. But as Tropper's protagonist-narrator beautifully notes,\"One of the liabilities of. . .beauty is the ease with which the slightest gracelessness shows, like muddy footprints on white carpeting\" (262-63). The novel is not free of blemishes. During a scene in which Joe learns how close to death Wayne, his longtime friend, is, Tropper's narrator tells us: \"I let out an audible sigh, wishing that I were by nature a more expressive person, and Wayne sighs as well, probably wishing he didn't have AIDS at all\"(87). Probably? Really? Really stupid. Not \"muddy footprints on white carpeting\" -- perhaps horseshit on white carpeting? Speaking of shit, Jared (Joe's nephew) uses the expression \"a real big bite out of the shit sandwich\"(259) when Wayne reveals his age: 34. Seeing Jared's comment, I could hear my late brother saying, \"Life is a shit sandwich without the bread.\" But what we would be wise to come away from this novel with is a deeply felt understanding of the importance of unselfish (not selfless) relationships. They are the bread that allows us to swallow the shit, to eliminate the shit, and to \"keep our shit together.\"The Book of Joe speaks, I believe, to a broader audience than Tropper's This Is Where I Leave You and transmits more valuable messages than readers are likely to find in This Is Where I Leave You, so why only 4 stars from me? This Is Where I Leave You has \"crazy\" characters whose behavior is quite often outrageous; it's too funny to read in a place where people want/need quiet. Such books get to have wacky people doing the unbelievable. If The Book of Joe contains funny material, I missed it; and for me to be willing \"to suspend my disbelief,\" the outrageous has to make me laugh. In addition to important relationships, laughter is what enables me to \"keep my shit together,\" what lets me see more stars than are probably there, and what stops me from wanting to say, \"This is where I leave you.\""}, {"userName": "Jake", "userReviewDate": "Sep 22, 2009", "userURL": "http://www.goodreads.com/user/show/50823-jake", "userReview": "So the story is this:Smartass non-athlete kid grows up in a shitty sports town, moves away at 18 and writes a book savaging everyone he grew up with. After 15 years, the now-successful writer has to return to town because his father (who he hated) is sick.There's potential there. Despite being a blatant rip-off of Elizabethtown (maybe not the best thing to swipe from, BTW), this could work if one could avoid all the typical 'prodigal son' cliches. Such as:Former jock turns out to be gay.Former antagonist grows up to be the po-leece.Former antagonist turns out to be 'not that bad'.The gay character has AIDS, and just don't take no crap no more!I'm sure there's more, but frankly, I couldn't get past 100 pages. If you're gonna have an unoriginal idea (and really, most are at this point), you have to make it your own. Tropper tried early, but fell way short.He could have pulled it off with a little more edge, a little straight-up 'fuck you' from the main character. Instead, the guy just comes off as whiny and annoying. With a little bit of the Bateman brothers injected into Joe, this could have been quite readable. Instead, it made me throw up into my own eyes."}, {"userName": "Sean Kennedy", "userReviewDate": "Mar 01, 2011", "userURL": "http://www.goodreads.com/user/show/2535186-sean-kennedy", "userReview": "I really enjoyed This Is Where I Leave You despite its at times-overbearing resemblance to a feelgood independent script aiming to be Oscarbait, so I decided to check out Jonathan Tropper's back catalogue.The Book of Joe is very similar - awash in cinematic cliches such as the estranged son returning home due to illness in the family, reacquainting with an old girlfriend he never got over, etc etc. It actually pulled together in TIWILY, but not here.I think what annoyed me the most was the use of the gay characters. This book seemed like it was written in the 1960s, as they both died tragically - one from suicide, and the other from AIDS - but along the way they both teach VERY IMPORTANT LIFE LESSONS to the heterosexual characters so they can have their happy ending.I mean, come on.By the time I got to the end, where the happy heterosexual couple dance and kiss in a shower of their dead gay friend's ashes, I almost threw the book against the wall. Damn those dead tragic magical gays who only live and die to make their straight friends happy."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Joe Goffman is a self-described asshole. He’s such an asshole that he wrote a scathing “fictitious” novel about his hometown where he completed lambasted nearly everything and everyone contained there. He never dreamed the book would become not only a national sensation, but also an A-List movie starring Leonardo DiCaprio and Kirsten Dunst. He REALLY never dreamed he’d have to go back to said hometown and face the subjects of his novel. However, when his father suffers a stroke, that’s exactly what he has to do.Boy am I regretting my decision to keep requesting Tropper’s books from the library. I was like a junkie and just couldn’t get enough . . . and now I’ve read them all. “Joe” was Tropper’s sophomore novel, and it is where he came into his own. He hit the mark with the self-deprecating “asshole” lead and his merry band of friends/family. He found that magical balance of quick wit and heart-stabbing emotion and has used it in every novel written from “Joe” on. HURRY UP AND MAKE THESE MOVIES!!!!!"}, {"userName": "Jennifer Tatroe", "userReviewDate": "Sep 18, 2008", "userURL": "http://www.goodreads.com/user/show/1327581-jennifer-tatroe", "userReview": "Jonathan Tropper's The Book of Joe reminds me a lot of Michael Chabon's early work stirred up with a bit of Nick Hornby. Echoing so much of two of my favorite contemporary male authors, it's no surprise that, by the end, I really fell in love with this book and can't wait to read more from the author who wrote it.Joe Goffman is a lapsed Jew from a small town in Connecticut. After leaving home as a bitter and estranged teenager, he wrote a scathing (and bestselling) novel about his experiences growing up in Bush Falls, brimming with caricatures of the people he encountered there. Seventeen years later, he finds himself back in the town, face to face with the ghosts of his past.Tropper could have easily written a book full of caricatures, himself. Certainly, a small town setting lends itself to that. Instead, he endows every character, from Joe's shark of an agent, to the town's celebrity basketball coach, with a soft underbelly. Everyone in Bush Falls is undeniably complex and human. By the end, I knew these people as if I'd grown up with them, myself.In the end, it's a book about coming to terms with the past, about rediscovering one's self, and about re-evaluating truths we once thought to be self-evident. The solid story and fleshed-out characters are woven together with some amazingly beautiful writing. At one point, Tropper writes, \"The rain beats manically against the window and I feel the urge to run outside and dissolve.\" I feel it too. The Book of Joe absolutely swept me away."}, {"userName": "Rachel", "userReviewDate": "Dec 23, 2010", "userURL": "http://www.goodreads.com/user/show/2499261-rachel", "userReview": "Granted, I only read about forty pages of this one before deciding it wasn't my thing. But I was struck by how right Jennifer Weiner and Jodi Picoult were when they said that men's fiction that has the plot tropes of \"chick lit\" is always just called \"literary fiction,\" and I would hold this book up first as an argument for that. There are points in the first 40 pages when, in my opinion, it approaches saccharine. Despite being a person who cries practically on command at every viewing of Watership Down, I am really not a fan of reading this gushing feeling. Whether it's written by a man OR a woman."}, {"userName": "Elyse", "userReviewDate": "Aug 06, 2010", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Loved it!When I want a book with heart that I can count on being hilarious--an author I turn to is \"Jonathan Tropper\".After having read the most awful book of my life recently ---(a book which actually made me angry on so many levels--a book which calls itself \"NOTHING\"), --- I wanted a moving, funny, compulsively readable book ----\"The Book of Joe\" was the perfect fit ----ending 2012 ---starting 2013!"}, {"userName": "treehugger", "userReviewDate": "Nov 21, 2007", "userURL": "http://www.goodreads.com/user/show/123501-treehugger", "userReview": "So, I really, really enjoyed this book. It's about a man who, upon realizing he is inhabiting an empty, souless life and hearing about his estranged father's life-threatening stroke, returns to his small hometown in Connecticut. There are some really predictable things that happen from here, but the study of human relationships, the resiliency of the human heart, and final note of home on which the novel ends really did it for me. There was big emotion packed into this book, and it dealt with some of the really big issues that face our generation (not giving up too much of the plot!)And, in reading this book I realized we're ALL assholes..and as Joe says, \"you can really learn a lot from an asshole..\" It's in not taking our lives for granted and in focusing on what is important that I think Joe (and all of us) can find a way out of asshole-dom.Lemme know what you all think!!!"}, {"userName": "Michael", "userReviewDate": "Jul 14, 2008", "userURL": "http://www.goodreads.com/user/show/1177534-michael", "userReview": "When his father suffers a stroke, Joe Guffman returns to the hometown he left behind 17 years before to confront his past and ponder his future. The biggest complication--Joe wrote a fictional book based on his life growing up in the town that didn't exactly sit well with some of those who depicted in his novel.Upon his return, Joe is involved in a bar fight, has a drink thrown in his face and finds copies of his book thrown onto the front lawn. But Joe is having other issues--his second book isn't working, he's estranged from his brother and his father is dying. In the midst of all this, Joe seeks to reconnect and make peace with his past, get back with his high school girlfriend who he never really got over and figure out what the future holds for him.Jonathan Tropper writers about fundamentally flawed males in each of his books and you'll find no more flawed character than Joe. Told from the first-person persepctive, we see and hear things from Joe's eyes, as well as getting bits and pieces of the book thrown in. Both work together to create a portrait of Joe who is seeking approval and acceptance by his family and friends all while trying to be his own man and stand on his own two feet, not defined by what others say or the expectations they have of him. With The Book of Joe, Tropper makes some interesting comments on the nature of relationships guys have not only with other guys but with the women around them.Along the way, you'll get to know Joe and while you may not always agree with what he's doing, you'll still come to like the guy. It'd be easy to say that Tropper is the next Nick Hornby. While Tropper does have some influences from Hornby, it's clear that he's an emerging writing just waiting to burst on the scene to a wider audience. Maybe, like Joe, he needs to have one of his books made into a wildly successful film."}, {"userName": "Eric_W", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/1711431-eric-w", "userReview": "BEWARE: This book was originally published under the title of Bush Falls.He's a prodigy of alienation. Now a successful writer, having written a book about his home town, Bush Falls, that savaged the place, Joe receives a call from his sister-in-law that his father has had a stroke (he was at the top of the key, had just released the ball, and came down unconscious. Basketball aficionados present noted the ball swished.) Joe's brother, Brad, ex-sports star, and their father never had much time for Joe. His mother had committed suicide, a manic depressive, for whom the piles of pills didn't work, so Joe wrote a book about his town, never dreaming it would be published which has made him personna non grata, but it made him rich. Now finds he is obligated to go back home for his father's illness.So as with Tropper's other books, in the first few pages a similar scene is set: death, sex, familial dysfunction, alienation. Tropper's books all have similar themes and characters: a stepson/nephew/child. dying parent, dead parent, sibling, a main character alienated from his family. That does not mean they are redundant; each is different in its own way and each equally appealing and often funny and poignant. I like them all. Note, however, that this book is much darker than the others.Listened to the audiobook read by Scott Brick who provides excellent narration."}, {"userName": "Amy", "userReviewDate": "Jun 17, 2011", "userURL": "http://www.goodreads.com/user/show/727334-amy", "userReview": "I just love Jonathan Tropper ... something about his writing and characters just speaks to me. Although this particular novel wasn't quite as good as This Is Where I Leave You, it's a really good novel that was a joy to read. I laughed, I cried and everything in between. Tropper just has a way of making you FEEL as you read - the good, the bad and the ugly. This book definitely reminded me of the TV show October Road (which was one of my favs before it was cancelled way too early).I wouldn't say the plot is mind blowingly original but I think it was well done and kept my interest throughout. It's really the characters that make this book stand out for me. This entire novel is essentially a study of human relationships and emotional growth. I really liked this one and definitely recommend it to anyone interested in a novel that has warmth, humor, and interesting characters. It's a fairly quick and easy read ... but one that is definitely worth the time."}, {"userName": "Maida", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/5808311-maida", "userReview": "Remarkable. I laughed, I cried, I shrieked, I cringed, I pondered... and then I laughed some more!!! Witty & beautifully crafted, this book inspires tolerance, openness, vulnerability, resilience, & an affection for human idiosyncrasies & imperfections. Thank you, Jonathan Tropper, for taking me on such a glorious journey!!!\"I find that most people worth knowing are f*cked up in some way or another.”\"We make mistakes. They don't make us. If they did, we'd all be royally f*cked, especially a couple of assholes like us.\" “To err, as they say, is human. To forgive is divine. To err by withholding your forgiveness until it’s too late is to become divinely f*cked up.” “Full of promise, full of dreams, full of shit. Mostly just full of yourself. So full you’re bursting. And then you get out into the world, and people empty you out, little by little, like air from a balloon.” ~ Jonathan Tropper, The Book of Joe*5/5 stars*"}, {"userName": "Melissa", "userReviewDate": "Jun 29, 2008", "userURL": "http://www.goodreads.com/user/show/1283808-melissa", "userReview": "Really good book.After a horrible senior year in high school, Joe moves away from his home town. Once Joe is on his own he rights a sort of tell all book about his home town, and his home town is not happy. Actually, a lot of people hate him in his home town. His mother passes away, but his father, brother, high school sweet heart, and his old best friend are home waiting for him when he returns.I read somewhere that this book is being made into a movie. I have never seen the T.V. show, but October Road from the commercials looks a lot like the book.MUST READ."}, {"userName": "Carol", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "This is my third JT novel and like the others, it drew me in from the beginning and kept me interested until the end. The story Is entertaining, packed with emotion, interesting characters and wit. I truly enjoy Jonathan Tropper's writing style and highly recommend this sentimental page-turner."}, {"userName": "Rick", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/1019632-rick", "userReview": "First off, this was a difficult book to rate. On the plus side, it made me laugh; it made me cry. I was caught up in the character's lives and cared about them. The author has a winning and simple way with prose. The negatives are what made me downrate it so much. Aside from the main character's intense self-pity that we're hammered over the head with, I had trouble suspending my disbelief for his best friend, Wayne, who deserved a much fresher and more thoughtful approach. Wayne is one of two gay characters in the book; the other dies as a teenage suicide. And, of course, Wayne himself is dying of AIDS, KS, wasting, the whole nine yards. The problem with this, and the place where the author loses credibility for me, is that Wayne's full-blown AIDS occurs in 2004. In 2004, a whole array of live-saving and health-maintaining drug cocktails were on the market to treat HIV. As someone very familiar with the HIV/AIDS landscape, I had trouble believing Wayne. His character would have been more believable in the early 90s, when such cases were much more common. In 2004, it was much rarer to find someone with full-blown AIDS, especially in a relatively affluent part of the US. I'm not saying people still don't die from AIDS (or didn't in 2004), I'm just saying it's rarer. The author, at the very least, should have had a conversation wherein Wayne laments that none of the cocktails worked for him. It happens. But the way it is now, I just think the author was ignorant about gay people and the disease and that made it hard for me to enjoy what otherwise was an enjoyable book. Even better, though, would have been not to saddle the gay main character with something as stereotypical as AIDS, but something like Stage 4 cancer. The same results could have been achieved without resorting to the cliche."}, {"userName": "Kamryn (GreyZone)", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/34520197-kamryn-greyzone", "userReview": "The Book of Joe by Jonathan Tropper is The Perks of Being a Wallflower plus  Winger for adults. It's the type of hilarious that earns actual laughs rather than exhales, it's the type of insightful that makes you want to look at the people in your life differently. It's profound because it's about life rather than made-up magic and romantic ideals. Joe Goffman wrote a best-selling book absolutely slandering his hometown. Upon his return, he has to face everyone and their dog who was made into a disgusting caricature - all the while dealing with his own lack-luster life as a rich, self-proclaimed jerk. Tropper is magical in the way that he can make unrelatable events universal. Using nothing but good writing, he affected me using basketball. I passionately hate sports, not to mention I haven't rode any of the highs and lows of these main characters. It's a unique, undeniable talent that made this novel so fresh and engaging. The reflection on death, life, fathers and sons, and teenage lust alike are done in a way that's straight-forward, but remarkably lacking pretension. It's a solid, concise read that hit me in a way realistic fiction usually doesn't. Plain and simple, it's a basic idea made extraordinary by a fantastic author. I recommend this to anyone who loved the two popular YA books I mentioned at the top. It's funny, smart, a bit smutty, tear-jerking, and insightful. It's one story about real, ordinary life that is strikingly remarkable."}, {"userName": "Larry H", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "Sometimes it's not that you can't go home again, it's that you shouldn't. Take Joe Goffman, for example. He left his hometown of Bush Falls shortly after high school and then years later wrote a fictionalized account of life there which left his former friends and neighbors feeling a little, well, angry. The book became a bestseller and was adapted into a movie, so the whole world got to see what Joe had to say.Joe returns to Bush Falls 15 years later, after his father has a stroke. Needless to say, he isn't welcomed with open arms by anyone. As he relives his glory days and tries to come to terms with his adult life, he starts to realize why he wrote the book and how he can move on to a new chapter with his friends and loved ones.When The Book of Joe came out a few years ago, I remember not wanting to read it because I usually shy away from books labeled by critics as \"funny,\" \"heartwarming\" or \"life-affirming,\" because they're usually not. But after reading—and loving—Jonathan Tropper's newest book, This is Where I Leave You, I decided to read some of his previous novels as well. And I'm glad I did, because honestly, this book is funny, a little heartwarming and even slightly life-affirming. Sure, it's a little predictable, but Tropper's characters are so interesting and intriguing it doesn't matter. And besides, who hasn't wanted to write a book about where they grew up, getting revenge on those who did them wrong? I know it's not just me..."}, {"userName": "Snotchocheez", "userReviewDate": "Jul 20, 2009", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "\"The Book of Joe\" reminded me much of my own life as it has progressed from high school to present (I am 42 at this writing). The plot centers on a novelist (with only one book, although it's a successful Peyton Place-esque novel based on his former home town) and his return back to his home town after his father suffers a near-fatal stroke. While I'm not a writer, I found myself identifying with much Tropper had to say about the protagonist's not being able to fit in with the mainstream, which really struck a chord with me. I recommend this book to anyone who feels or who has felt out of touch with the rest of the world...which (if we'd just admit it) would be just about all of us."}, {"userName": "Abbie", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/5557816-abbie", "userReview": "I love this book. The writing is outstanding.Joe has so many issues:Mommy issues. His mother killed herself when he was a child.Daddy issues. His father always favored his older, athletic brother.Commitment issues. He hasn't grown up - at 34 - and he isn't over his High School girlfriend.And he wrote a book about everyone in his hometown and it wasn't very nice.Joe has one more problem: His father has had a stroke and he has to go back home and face the music."}, {"userName": "Marcia", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/1926094-marcia", "userReview": "Kept me up crying in my bed reading until 1am. Woke up my husband, who was terrified re: my crying. This hasn't happened since out honeymoon in Paris, where I stayed up until 3 finishing and sobbing to The Time Traveller's Wife and Matt awoke so confused as to why his new bride was crying in Paris. This book was nothing like that book except in the fact that I liked it and it made me cry."}, {"userName": "Sassacaia", "userReviewDate": "Jan 06, 2008", "userURL": "http://www.goodreads.com/user/show/20839-sassacaia", "userReview": "It's been a long time since I read a book that I couldn't put down. This is one of those books, where it doesn't leave your head and you find yourself back in Bush Falls, wondering what kind of trouble Joe is going to get into now, even when you're at Casa Grande in Arizona. It's sweet and funny and engaging and just a pleasure to read."}, {"userName": "Nina", "userReviewDate": "Nov 02, 2012", "userURL": "http://www.goodreads.com/user/show/4790136-nina", "userReview": "I've been reading a lot of YA/NA novels lately so I decided to go for an adult one this day. So I picked this up. Little did I know that it was like a YA/NA novel inside an adult novel. I like Jonathan Tropper's This Is Where I Leave You. Despite its many vulgar words, it's a good one. Yes, many vulgar words, sexual content. A lot of profanities. So I wasn't surprised when The Book of Joe also contains those things. Honestly speaking, I found a LOT of similarities between the two. But the thing that made The Book of Joe more appealing to me is the fact that it's not an adult book at all. Why? Because Joe, the main character grew old. But he didn't grow up. It was like he was stuck in his 17-year-old soul as time passed by. So even though he was a good 34-year-old man, I didn't find it hard to feel for him. Joe came from Bush Falls. A small town wherein everything that happens to everyone obviously scatter around the town faster than the speed of light! I know. That sounds absurd. But that's true to their life and even to the real world. See? This one is so realistic! He had two best friends, Wayne and Sammy. He had a not-so-healthy family relationship with his father and brother. He had an amazing girlfriend. So it was kind of a good shot but not right. Fast forward, he became a novelist. What he did for his first novel is really disturbing for me. Yeah, it sounds like fiction but it wasn't. And he knew it and everyone who were involved in the book knew too. I know how bad the people in his town had been when he lived there. But was it enough for him to write it in a novel for all the world to see? And though it was fiction as he said it was, still, everyone in that town knew it was utterly true. They got mad, obviously for the fact that they knew what he had written was true anyway. And I got so mad back at them because really, they're just so stupid, insensitive and seriously lacking a soul and a heart. Things got bad. He had to come back to the town and he received a lot of not-so-good things. Father's stroke, Wayne's disease, Brad's family affairs, Carly's cold welcome, and the town's wrath. He had a lot of unresolved issues. I felt every emotion there probably was. And hey! He's a 34-year-old man. Yet I felt his pain because I just can't imagine going through that. It's just so realistic you know? As I've said, there are a lot of profanities and I didn't care because I always want to look past every novel that I read for me to see its beauty. I'm not saying its profanities are beautiful, it's just that, it was written beautifully and in a realistic way that you wouldn't even care for it. Yes, this was depressing for me. And I cried too! Sometimes I think I'm such a weird person for crying ever so easily but it's just so sad and depressing that I can't help but cry.Alright, enough. The Book of Joe is such an amazing book. It's gonna make you realize that people can grow old all too well and yet, they're gonna remain to be the 17-year-old they wish they'd always be. You'll realize how cruel the world can be may it be on your youth or your adulthood."}, {"userName": "Dani Peloquin", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/6101841-dani-peloquin", "userReview": "The Book of Joe is described by one reviewer as \"a coming of year 34 year old tale\" and I have to agree. However, this is not a bad thing! The story is about a man named Joe who writes a scathing book about the town in which he was raised. In his novel, he addresses how poorly everyone treated him and his friends. He also chronicles how the basketball team and its coach run the town while preaching conformity and intolerance. When Joe's father falls into a coma during a basketball alumni game, Joe is forced to return to this town that he left 17 years ago. Upon his return to Bush Falls, he suffers from various humiliating situations at the hands of the town including having milk shakes thrown in his face, copies of his book thrown on his front lawn, and is beaten up by the former captain of the basketball team. Yet none of these attacks hurt Joe as much as finding that his childhood best friend is suffering from a terminal disease and Joe's ex-girlfriend has had a troubled and violent past 17 years.Though this novel had the potential to be cliched, it took the high and less jaded road. In fact, Tropper was able to take some previous lackluster plot turns and make them new again by tweaking certain outcomes. Still, the book is a bit of a tear-jerker but it is peppered with fantastic comic relief. The mixture created a novel that is sentimental and moving without being a sappy weep-fest; while also being humorous without making a mockery of the subject. The issues addressed in the book are heavy and deep but with enough wit to lighten the load and make the novel and exceptional read!! www.iamliteraryaddicted.blogspot.com"}, {"userName": "Todd Carper", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/10405728-todd-carper", "userReview": "Jonathan Tropper is my new favorite author. I have also read \"This is Where I Leave You\" and I thought it was outstanding and \"The Book of Joe\" is even better. It is basically a coming of age story of a 34 year old man. Tropper really does a good job of writing stories that seem true to the male psyche. I have read a lot of reviews on this book and they are almost all positive, but they miss the biggest point of the book. It is a hilarious book with some heart breaking moments that will lead you to tears...if you have a heart. Joe's best friends in high school are gay and I think the depiction of what it must have been like in the 80's in high school as a gay youth is right on. The story of these friends' life is painful to read at times, thankfully Tropper finds a way to add humor in a respectful way. Basically, the plot is Joe Goffman leaves his small town and writes a best selling \"fiction\" novel about his town and his senior year in high school where basketball is king. He is brutally honest about the people, the basketball program, his friends, his girlfriend, his family, etc....never thinking he would go back, but when his dad has a stoke, he has to go back. The book leaves you wondering about the future of Joe, but leaves you with hope...which seems to be the montra of Tropper books. If you can handle the language and sex in the book, you will love this book. If you are a man, you will see yourself in a lot of this book, unless somehow you've lived the perfect life with no issues...if you are a woman, you will get a little better understanding of what is going on in a man's mind...unless you only like the goody goody guys...."}, {"userName": "Elizabeth A", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/3123067-elizabeth-a", "userReview": "I participated in the BOTNS Secret Santa game last December, and this is one of the books I got from my elf (aka Lil). This was one of her fave books for the year, and I can see why. I was hooked the moment I started reading it. So imagine that you are a teenage boy growing up in small town America, and not only do you have no friends, let alone a way to get laid, but your mother kills herself, and you cannot find common ground with your father or older brother. Your final year of high school things look up, but you knew it was too good to last. When you shake off that small town dust, you write a scathing \"novel\" about the characters you grew up with, and not only is the book a success, but it gets adapted for the big screen. Your home town is so upset, they try to sue you for libel. Not a problem since you have not been home for 17 years or so, let alone kept in touch with anyone back there. When you suddenly need to return for family reasons, you come face to face with all the demons you thought you had left behind. The writing is funny, witty and snarky - the way some of the best conversations you have can be. The story explores themes of love, loss, sex, community, glory days, and friendship. My only complaint with the book is that while the boys/men are flushed out nicely, the women are all rather one dimensional. My first time reading the author, and I will be adding his other works to my TBR pile."}, {"userName": "Rachelle", "userReviewDate": "Oct 26, 2011", "userURL": "http://www.goodreads.com/user/show/1799882-rachelle", "userReview": "Joe Goffman is coming to terms with the fact that he just might be an asshole. He is forced to return to his hometown of Bush Falls, when his father has a stroke. His homecoming is slightly complicated by the fact that during his 17 year absence, he wrote a bestselling novel bashing the town and everyone in it. Oh yeah and then the book was turned into a movie… Needless to say the town isn’t too happy to see him. On the upside, Joe’s return home reconnects him with his best friend from high school and his ex girlfriend.Throughout the story, we learn the events that made Joe hate this town. However more importantly, we see Joe start to fight his asshole tendencies and connect with people again. I love Jonathan Tropper. He creates these great antiheros who are flawed and damaged and loveable. You root for Joe. You want things to work out for him. Also, Tropper crafts great stories from normal events. Nothing seems improbable or too large. Even the slightly overly dramatic moments come off as touching and vital to the story. Although this book deals with some heavy material, its approached with levity and a sense of humor. I both laughed out loud and tried to hide tears from the other people sitting in Barnes and Noble. I still like This Is Where I Leave You better, but this is still a great read."}], "description": "Right after high school, Joe Goffman left sleepy Bush Falls, Connecticut and never looked back. Then he wrote a novel savaging everything in town, a novel that became a national bestseller and a huge hit movie. Fifteen years later, Joe is struggling to avoid the sophomore slump with his next novel when he gets a call: his father's had a stroke, so it's back to Bush Falls for the town's most famous pariah. His brother avoids him, his former classmates beat him up, and the members of the book club just hurl their copies of Bush Falls at his house. But with the help of some old friends, Joe discovers that coming home isn't all bad—and that maybe the best things in life are second chances.", "title": "The Book of Joe", "url": "http://www.goodreads.com/book/show/13432049-the-book-of-joe", "average": 3.95, "cover": "https://images.gr-assets.com/books/1327703744l/13432049.jpg", "reviews": 1488, "authors": [{"url": "https://www.goodreads.com/author/show/26163.Jonathan_Tropper", "name": "Jonathan Tropper"}], "type": ["Fiction", "Humor", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/13432049-the-book-of-joe", "http://www.goodreads.com/book/show/46661.The_Book_of_Joe", "http://www.goodreads.com/book/show/1623232.The_Book_of_Joe", "http://www.goodreads.com/book/show/12860049-the-book-of-joe", "http://www.goodreads.com/book/show/2216899.The_Book_of_Joe", "http://www.goodreads.com/book/show/5072820-the-book-of-joe", "http://www.goodreads.com/book/show/7001237-the-book-of-joe", "http://www.goodreads.com/book/show/6224935-this-is-where-i-leave-you", "http://www.goodreads.com/book/show/13586743-one-last-thing-before-i-go", "http://www.goodreads.com/book/show/242157.How_to_Talk_to_a_Widower", "http://www.goodreads.com/book/show/242159.Everything_Changes", "http://www.goodreads.com/book/show/53849.Plan_B"]}