{"ratings": 831, "userreviews": [{"userName": "Create With Joy", "userReviewDate": "May 26, 2013", "userURL": "http://www.goodreads.com/user/show/13599031-create-with-joy", "userReview": "The Beloved Daughter tells the tale of Chung-Cha, a 12-year old North Korean girl who is imprisoned in Camp 22 – one of the most notorious political prison camps in the world – because her family is Christian, and her father refuses to renounce his faith.As a young prisoner, she sees and endures things that no one should. She suffers betrayals from friends and is separated from those closest to her. In the midst of her surroundings, she struggles to reconcile her life with her faith.The story is harsh. The story is heartbreaking. The story is riveting. The story is real.From the first chapter, I was hooked, and I found that as the book went on, the story grew on me. This is good, because as difficult as the story can be to read in places, this story needs to be told, and deserves to be read.What I liked most about this story was that, even though it spoke of difficult things, the story also had its beautiful moments, and its redemptive ones. For all of the inhumanity that is portrayed in this book, we see how even in life’s darkest moments, God has a plan and a purpose for our lives and is ultimately working all things for good.The Beloved Daughter won second place in the 2012 Women Of Faith Writing Contest.Disclosure: I received a copy of this book from the author to review. I was not compensated or required to write a positive review. The opinions expressed in this review are entirely my own."}, {"userName": "Ruth Hill", "userReviewDate": "Jul 20, 2013", "userURL": "http://www.goodreads.com/user/show/2299424-ruth-hill", "userReview": "It is books like this that humble me and remind me of how blessed I am to live where I do. All too often, American Christians (like me) forget how much Christians suffer for their faith in other parts of the world for practicing their faith. This book was extremely well-written, but it was immeasurably difficult to read at times. And I'm sure the author wrote a happier story than many Christians in North Korea experience. I was pleased with the stark honesty and pathos that enveloped the pages of this story. My heart was broken at so many points for the characters in the story, and I can only hope that the prophecy in the book is true (no spoilers--you need to read that for yourself).Even though this is a Christian book, it never came across as preachy. The salvation message is beautifully woven into the fabric of the story, and the spiritual journey of our heroine is told with astonishing candor. There is no profanity within the book, and all sex scenes are implied and not detailed. The ending of the story makes me hope for a sequel, but it also made me question if I would have (could have) done that. Again, no spoilers--read the book yourself!When I read the author's note at the end of the book, I was so pleased to see that five dollars of each book sale go to \"Voice of the Martyrs.\" This makes me want to recommend the book to everyone! If you don't know of the organization, it puts the Word of the God in the hands of Christian nationals all over the world who have no access to the Bible. Yes, there are places in this world where the gospel is still restricted. May these restrictions end in the near future!I was sent a copy of this book in exchange for my honest review. I was not financially compensated, and all opinions are 100 percent mine."}, {"userName": "Nancee", "userReviewDate": "Aug 30, 2013", "userURL": "http://www.goodreads.com/user/show/5786956-nancee", "userReview": "This fictitious memoir is written in the first person by a young North Korean woman named Chung-Cha (righteous daughter) to her daughter, Ae-Cha (beloved daughter). Each entry in this painful journal begins with related scripture, and follows with the details of Chung-Cha's life, arrest and imprisonment in one of the world's most notorious prison camps. Her journal begins in a village in North Korea in 1998 where Chung-Cha is the 12-year-old daughter of a Christian father whose faith endangered her entire family. Barely surviving in poverty is only the beginning of Chung-Cha's detailed description of her life after her arrest, imprisonment and persecution as the daughter of a Christian. The atrocities that were inflicted upon this young girl include lies, lack of food, abuse, torture, and being forced to live in her own filth amidst countless other prisoners. Life (if one can perceive it in that respect) under these conditions inflicted overwhelming physical, emotional and psychological effects. This is a very difficult book to read, and difficult to find appropriate words to review. The content in this book is overwhelming to one who has never lived outside of freedom. My lack of understanding regarding the strength and courage it took for Chung Cha to survive the atrocities she suffered throughout her years of imprisonment restricts me. I cannot imagine the torture and horrifying conditions. Alana Terry's insight into the life of her characters is outstanding and meritorious! She has written a novel of epic proportions with tremendous impact, and without the use of graphic violence, language or description. An in-depth amount of research regarding the subject matter had to take place in order to create this intense and unforgettable memoir. This is an exceptionally well written narrative, one that I highly recommend and would award 5-plus stars!Disclaimer: I received a copy of this book from the author in exchange for my honest review. All opinions expressed are my own, and no monetary compensation was received for this review."}, {"userName": "Tia Bach", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/4197216-tia-bach", "userReview": "Rating: 4.5 starsWorthy of rounding upCould you proclaim your faith in a country where such a proclamation meant death?Chung-Cha's upbringing was steeped in Christian faith. Her father refused to deny his beliefs. As a result, Chung-Cha ended up alone in a prison camp and faced many forms of abuse, not the least of which was betrayal.One day she ends up sharing a cell with an old woman of tremendous faith, one even the guards are afraid of. A woman who holds the keys to Chung-Cha's survival. That is, if she can survive the atrocities of prison life.One of the hardest parts about writing reviews is trying to convey how touching and memorable a story is without giving away too much. There's so much I'd like to say about this novel, but I don't want to spoil it for the reader. What I can share... it is heartbreaking. Chung-Cha's journey will touch you in many ways. The story is told with an intense honesty, and the author never shies away from her character's faults and failings.I highly recommend this novel to readers who appreciate a flawed, but strong, female character. Chung-Cha's journey is one you won't soon forget. Note: I received a complimentary copy for review purposes. A positive review was not guaranteed or requested; the opinions expressed are my own."}, {"userName": "Kate", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/8715443-kate", "userReview": "Confession: I gave up on Christian fiction years ago. I read a lot of speculative fiction and love it-- I even find it believable, if it's done well. But Christian fiction usually seemed fake to me. Contrived. Filled with deus ex machina (literally... loving Jesus is all anyone needs to have the perfect life, gettin' saved SAVES THE DAY!). I'm a Christian, and I know very well that this is not how life works. I got sick of predictable messages and \"everything will be fine if you just BELIEVE\" messages.I'm glad my biases didn't make me skip this book.The Beloved Daughter is a story about faith. It's also a story about doubt, and fear, and love, and sacrifice. It's both beautiful and heartbreaking, and horrifyingly real. People get hurt. People make mistakes. People do vile, evil things, and even Christian characters make horrible judgements against one another, as they do in real life. This is a story about what's happening in North Korea, and it's an eye-opening one. It's also the story of one woman, and never gets preachy or comes off as a story that's pushing a message. Chung-Cha's story truly is inspirational. (I received a copy of this book... I don't remember how. If it was for review, I owe the author an apology for the delay. Might have been a prize. I need to make notes on these things.)"}, {"userName": "Pauline Creeden", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/5698184-pauline-creeden", "userReview": "Quick Thoughts - Beautiful and Tragic. Highly Recommended (longer review on the way)"}, {"userName": "Larik", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/17533959-larik", "userReview": "Some stories - make you think of fairy-tales, some even though are real - make you believe are fiction, and some are written so horribly you are thankful they are just a product of someone’s imagination. This story on the other hand keeps such a balance that even though I was told it’s a fiction my mind still has it registered as truth. I know there are horrors in life; I know people’s inhumanity has overpassed our creative imagination. I have listened to too many testimonies of concentrating camps and Holocaust to disregard the harsh reality.Righteous Daughter’s descriptive letter to her Beloved Daughter (which is the format in which this story is told) is so heart-breaking at some chapter’s and so hopeful in others. I was so angry at the situation and at God for the plight he allowed upon those poor innocent people when here we treat with civility the very cruel prisoners. This story shows that no matter how bleak our situation at the moment there is a bigger picture to it and an explanation that only God sees and some of us get the blessing to look back and realize what a beautiful result God carried out from all the pain they were inflicted. Yesterday while listening to this book, it put me to mind that we are so, so spoiled we never really had any inconveniences in life. We complain about the wrong toppings on our pizza, we complain about tenderness of our steak while there are poor girls who stoop themselves into prostitution just to get another meal and by meal I mean a spoonful or two of some distasteful grab. We are blessed to live in US and we have become so comfortable with this blessing that we don’t even see it as a blessing anymore our ungratefulness if dangerous. How will we stand next to those that have gone through so much suffering and still try and claim our reward at the throne of God?? This story is written very well and clean. Even though it give you the insight to what is going on behind those prison walls there no detailed descriptions that would make you stop reading it. I hope it has the same effect it had on me. And instead of making you bitter at the harshness of life, I hope it will make you grateful for all the blessings you are given in life. And if you ever fall prey to the pain I hope after reading this book it will be a comfort to you knowing there is always hope in the One who is above all.Disclaimer: I received a free copy of this audio book from Book Club at www.bookfun.org, in exchange for my honest opinion."}, {"userName": "Temujin Hu", "userReviewDate": "Jun 22, 2013", "userURL": "http://www.goodreads.com/user/show/14436420-temujin-hu", "userReview": "I loved this novel! I read it in two sittings, didn't want to put it down. I was drawn to the characters and pulled along by the plot, eager to see where the conflict took Song Chung-Cha. The story is the history of Song Chung-Cha as recorded by her for her daughter. It begins with her at twelve years old as her North Korean family is torn apart after they are arrested for their Christian faith. It follows her through the death of her parents, torture, captivity, and escape. She spends her freedom helping others escaping North Korea until she is married, and her family is again torn apart. This is the most compelling Christian novel I have read yet. Alana Terry does a masterful job of telling a beautiful story of pain and triumph while weaving Scriptural explanation into the conflict that makes sense, and exposing some of the hardships of Christians living in North Korea (as well as the hardships of *everyone* in North Korea). This was great, I look forward to reading more of Alana Terry's work."}, {"userName": "Tom", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/3305037-tom", "userReview": "Alana Terry has written a novel that inspires and shocks at the same time. I wasn't going to read it at first. I did not have any idea what the novel would entail. I was truly amazed and touched by the essence of the story, its characters, and its message.Unbelievable would be a word I would use to described this story. The question: \"Do these camps and confinement centers really exist?\" A little research from Alana Terry's web page will take you to many prisons around the world where real people suffer for their religious and political beliefs.I highly recommend this novel and give it a 5 star review.This book was received free from the author for my honest review.My review can be also found at Amazon and DeeperShopping."}, {"userName": "Rebekah Rodda", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/4123340-rebekah-rodda", "userReview": "This is a harrowing account of a young girl in North Korea. When she is twelve years old Chung-Cha is tortured and placed in a concentration camp because of her father's open proclamation of his Christian faith. After being tortured for several weeks, Chung-Cha turns away from the God who seems so powerless to help her. What I liked about this book was the attention is draws to the horrible conditions of people and Christians in North Korea. It is important not to forget them despite the media blackout. The descriptions of life seemed authentic.I also appreciated that while brutality was described it was done in a measured way and some details were mercifully withheld making it far more readable.The aspect that I found more difficult was the way a number of the Christians in this had open resentment and were unforgiving. Also that the Moses character seemed to be trying to earn his salvation and had no conception of the grace of God or any assurance of salvation. Thus the Christian characters seemed very far from God, even the ones who were risking their necks to save others. Otherwise this is worth reading."}, {"userName": "Sarah", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/5887927-sarah", "userReview": "I decided not to finish. If I am going to read a book that talks about such horrors, I pretty much want it to be real. This seemed like it was going to be well done and not overly described."}, {"userName": "Reet Champion", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/23889801-reet-champion", "userReview": "Chung-Cha adored her father and was enthralled with the Gospel of which he was a follower...until the North Korean government swooped in and carried the family off to a prison camp. After her mother renounces Jesus Christ and her father is thrown into solitary confinement to endure torture, Chung-Cha must also endure torture at the hands of her captors. When she is finally released from the detention center several years later, she learns her father has finally cracked. He recanted his Christian faith thereby allowing Chung-Cha to be released from detention. But freedom comes at a price and Chung-Cha is fatherless after her father hangs himself. She never got to tell him goodbye and the unhappy turn of events wipe out any shred of hope she had in God.Chung-Cha goes to work in Camp 22 where she is a prisoner. Although reunited with her mother Chung-Cha might as well be an orphan. Her mother is a changed person after they are taken prisoner. She never talks and her eyes are vacant. Before long she has given up entirely and dies. Tennaged Chung-Cha must fend for herself in the world as she learns the hard facts of prison life. Is there any hope behind the barbed wire?How often do you read a book that you just can't let go of? Days after you've turned the last page your mind wanders back to a certain story and you can't help but mentally go over it again and again? For me it's a very rare occurrence but that's the way it has been with The Beloved Daughter. It's been ages since I read so moving or thrilling a fictional tale. I was able to complete the book in one sitting and was feeling completely bummed out that there weren't more pages to read. Alana Terry has certainly outdone herself as well as restored faith in self-published works; you will now believe the excellent writing style and talent for weaving a story this author has. This is by far the most outstanding self-published work I have ever read. (Some readers will be acquainted with my previous moanings to swear off self-published stories). The host of characters were strong and flawed. As in life, no one was perfect. Beware the story can get a little gritty as Ms. Terry does not sugar coat the facts (but at the same time she doesn't go for the inappropriately graphic). There are things that go on in the prison camps that are unfathomable. This allows for a very unique look into the camps and what the prisoners are going through, whether they be Christians or not. Chung-Cha's struggles were well-portrayed. She was far from being faultless but she was very believable as she confronted with all the sin and godlessness around her and how it affected her life. And then that twist(s) at the end of the story? Totally unexpected, but nevertheless welcomed. This is a must read that I can't recommend enough. I don't think I stopped to breathe while reading it!\nDISCLAIMER: In accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising” we would like to note that we received an electronic copy of \"The Beloved Daughter\" from the author in exchange for our honest review.\nreetchampionbookreviews.wordpress.com"}, {"userName": "Annette", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/5714509-annette", "userReview": "Source: pdf provided for free from Pump Up Your Book for purpose of review. My Thoughts:I loved this book and read the entire story in 24 hours. I could not lay aside the story because I had to know what would happen to Chung-Cha. To say I was absorbed in the story is an understatement. My list of reasons for giving this story a 5 star review: The characters, descriptions, mood, dialogue, plot, drew me in so that I felt a strong emotional investment. I had to stay with the story from start to finish.  When the story begins Chung-Cha is age twelve. Her home-life was part Christian and part communist belief-which is no belief. Would young Chung-Cha's Christian foundation be strong enough to help her during life in Camp-22? This was a question that I asked through most of the book, which is a big reason why I continued to read it.  Chung-Cha is a dimensional character. She is not depicted as good and perfect, nor as flawed and imperfect. I saw all angles of her character and appreciated her humanity. Through the story there were events that brought out her best, and others where she failed. I felt this was an example of all of us, no matter our culture or race.  Chung-Cha evolves and grows in age, personality, emotion, independence and spirit life.  I thought I knew about communist North Korea before reading this story, I was wrong. I've been given an education about the plight and horrors of the people that live there. It is especially fearful for the Christian. The story focused on a family where one parent is an outspoken Christian, the other parent does not have a belief. The North Korean government uses division in a family to their advantage. The government will use any means to: coerce, lie, blackmail, kidnap, torture, abuse, murder, in order to find out information.  The story made me face what I would do in the same circumstance. If I were persecuted to the extent that a North Korean Christian was punished, would I stay strong in my faith, or would I give-up and fall-away?  The author had a goal of bringing to light what life is like in North Korea, and further the persecution that exists for a Christian in North Korea. I feel her goal was accomplished. This story has left a deep impact in my life. The Beloved Daughter is a story I'll not forget."}, {"userName": "Shannon", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/11804319-shannon", "userReview": "The Beloved Daughter was an awesome read, enticing me to read from beginning to end in a sitting. There was something for everyone, and as I read couldn't help but asking myself often, \"What would I do? Could I stand up for my faith when faced with death, or torture to other family members? \"We are so spoiled here in North America that I for one am guilty of taking my Bible, my faith, too lightly sometimes. There are countries where, as in this story, stating your faith, owning a Bible are causes for death. But does that stop them? No, many have committed to heart not only Bible verses but full chapters. Wow!Three people in one family and each one so different, and so many things not as they seem. A reminder that things are not always as they seem and not to make assumptions.One of the big things that hit me was the hate Song Chung-Cha felt for her father and his God, and the shame and anger towards her mother, while feeling sorry for her boss and young friend whom lied and gave her up as scapegoat. For too many years this young girl-12 when first taken away, faced horrors we could never fathom: 12 hour work days, 300 calorie a day diet, solitary confinement, tormented daily verbally and physically, and so much more.When all seems lost, God does what God does best....and you must read on to know the full story. But be prepared for action, intrigue, and so much more.I love how each chapter begins with a Scripture verse, and makes the way for the story. And love how faith, prayer and following God will always bring us to exactly where He needs us to be. Don't wait, pick up this wonderful book today and be forewarned, you will not be able to put it down.Although this is a book, these kinds of atrocities are happening in too many prisons around the world. May this book be a reminder for us to lift up in prayer our brothers and sisters, whom we may not know this side of heaven, as well as their families. Thank you to bookfun.org and Alana Terry for offering this book in exchange for an honest review. What a blessing, challenge and call to prayer!"}, {"userName": "Jalynn Patterson", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/8725733-jalynn-patterson", "userReview": "About the Book:In a small North Korean village, a young girl struggles to survive. But it is her father's faith, not the famine of North Hamyong Province, that most threatens Chung-Cha's well-being. Is Chung-Cha's father right to be such a vocal believer? Or is he a fool to bring danger on the head of his only daughter? Chung-Cha is only a girl of twelve and is too young to answer such questions. Yet she is not too young to face a life of imprisonment and forced labor. Her crime? Being the daughter of a political traitor. The Beloved Daughter follows Chung-Cha into one of the most notorious prison camps of the contemporary free world. Will Chung-Cha survive the horrors of Camp 22? And if she does survive, will her faith remain intact? \"The Beloved Daughter\" is Alana Terry's debut Christian novel and was a winner in the Women of Faith writing contest.About the Author:Alana is a homeschooling mother of three who loves to write, hates to cook, and enjoys reading a good book almost as much as she enjoys writing one.My Review: What would you do if you knew that you or your loved ones could be killed for spreading the gospel? Is that why in the Bible we are told to keep the word of God hidden in our hearts, because at some point it may very well come to that and we may be called to renounce our faith to the Almighty? Famine begins to strike the Hasambong village and then not too soon after inspectors are sent door to door looking for traitors. Families were being ripped apart and separated and then sent to prison camps where eventually death would come upon them. Follow along in the story of The Beloved Daughter as you will soon learn of a young girl Chung-Cha and the future her life holds. The author did an amazing job! The characters are very thorough and convincing with an extremely strong storyline. You will immediately be drawn in to this girls plight and will be silently cheering her on. Definitely a must read!**Disclosure** This book was sent to me free of charge for my honest review from bookfun.org."}, {"userName": "Emerald Barnes", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/2582314-emerald-barnes", "userReview": "I had so many mixed emotions while reading this story. I felt sadness at Chung-Cha's situation, happiness when she was finally allowed that, and then sadness again. I couldn't imagine being in the situation that Chung-Cha had to endure, and all in the name of \"authority\" and because her Dad was a Christian. I was provoked to thing about my stand with God. Would I deny Him for an easier existence? Would I die for Him? What would I do to protect my family if faced with that difficult decision. It also made me thankful that I live in a land of freedom to serve God without having to go to an underground church or being shot for my faith. I think we take that for granted at times, and this novel, it forces you to come to terms with that. And that's a good thing.So when I say I had mixed feelings. I mean that I had to sit down and thank God for my freedom and pray for those who don't have such freedom.Chung-Cha's story will make you cry. Will make you pray. And will make you thankful. But it will also pose the question, what can I do to help others who are going through this? I heartily recommend reading this novel. It's not an easy read, but it's a worthwhile read. All Christians should read this book."}, {"userName": "Lou", "userReviewDate": "Apr 01, 2014", "userURL": "http://www.goodreads.com/user/show/19770032-lou", "userReview": "Reseña en españolNow that I have a clear mind and free of tears, I can just make this review as it should.This is a book like no other. It's one of those that move you so much that make you cry. I had to contain the urge to mourn because I didn't want to miss a word of the story of Chung -Cha .It's an enthralling , dramatic and heartfelt story. Chung- Cha's life is a reflection of a small portion of people who have suffered persecution because of their faith. Her words give us a new vision of the martyrs, that are humans and as we all, have strengths and weaknesses.I really enjoyed reading this story . Each page was revealing and had a good pace. But ... I have been left with a bitter taste because the end didn't convince me at all... However , it is a book which I highly recommend because it opens the perspective of what is true Christianity.I guess with Alana Terry's new book: \n\"Slave again\"\n I'll finally understand the side of the history of Mee-Kyong.Thanks to the author for providing This Copy . This fact did not Influence the review."}, {"userName": "Brittany", "userReviewDate": "Aug 30, 2013", "userURL": "http://www.goodreads.com/user/show/18727044-brittany", "userReview": "I need to start by saying that The Beloved Daughter is not the typical story that I normally read. However, when I was contacted by Alana Terry to participate in her blog tour, I happily signed up. I have heard many great things about her book and decided that I wanted to read it for myself. I am glad that I did. It is so well written! This is a very serious book on the very serious topic of the persecution of Christians in North Korea. Through the book we follow the life of a girl who is imprisoned because of her father’s strong Christian faith. The author writes in such a way that the story flows easily. I recommend this book to readers who want to explore the dark world of religious persecution. (4 stars)I received a copy of The Beloved Daughter from the author in exchange for an honest review, which I have given.To read this review on my blog and enter the Book Launch giveaways, go to http://brittreadsfiction.wordpress.co..."}, {"userName": "Diane", "userReviewDate": "Dec 10, 2013", "userURL": "http://www.goodreads.com/user/show/768010-diane", "userReview": "I just finished the book \"The Beloved Daughter by Alana Terry. I found this well written and the characters are so real that you feel you are their with them.All I can say is what a book this was. I could not put it down and there was times I felt like my breath was taken away by what this young girl went through. We are told the price it cost some for their faith and confections, and us how lucky we are to live in a land offreedom.The story is about a young girl and the price she pays for her father's faith as a christian. He will not give up his faith, even when his daughter pays by being tortured and beaten. In the end he looses his live. We learn of the fear and horrible suffering people pay in many countries for their faith. This story will tear your heart out and make you cry at times as we watch this young girl try to stay a live and what it cost her as a human at the hands of others. Everyone should read this book. It will give you a better understand of what many people suffer for their believes, and make us appreciate the country we live in"}, {"userName": "Kate Frost", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/20663079-kate-frost", "userReview": "For 12 year-old Chung-Cha it's her father's Christian faith that rips her family apart when, in the middle of the night, her family are taken from their home and are subjected to humiliation and torture in a North Korean prison camp. And so begins an epic journey for Chung-Cha with the novel being surprising, uplifting and at times so very sad.The Beloved Daughter has the feel of being set in a time long past and it's shocking to realise that this is a story about modern day North Koreans. The author gives just enough details of the harsh and horrifying conditions that Chung-Cha and the other prisoners are subjected to in Camp 22 without being shocking for the sake of it. That's a difficult thing to get right and Terry manages it superbly.The Beloved Daughter is in turn heartbreaking and moving. It's an important story about faith, love, hope, courage and survival. Terry writes in an engaging way and beautifully depicts the character of Chung-Cha and the journey she travels throughout the book. I highly recommend it."}, {"userName": "Margaret Tidwell", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/7037554-margaret-tidwell", "userReview": "The Beloved Daughter by Alana Terry was one of the best books I have read in a long time. When I was first contacted by the author I thought it sound like it would be a good book to read but I never expect to be touched so deeply by the book. I took me about a chapter to get into the story and after that I was hooked and literally read the whole book while I was at work one day because I had to know how it ended. I felt so bad for all the characters and yet at the same time I was so proud of most of the characters. I do have say that some of the characters did shock me and weren't who I thought they were but I love when that happens because it so rarely happens anymore with the amount of books I read. I can't say more because I refuse to give the ending away but I recommend this book to everyone because it is amazing and so thought provoking at the same time."}, {"userName": "Rhonda Gayle", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/7769722-rhonda-gayle", "userReview": "I am shocked to learn that this is Alana Terry's debut novel as it is so incredibly well-written. This is a very emotional, compelling story. I have never read an account of anyone who had been imprisoned in Korea. I could feel the fear and anger in Chung-Cha. She had every right to feel afraid and certainly angry also. I also experienced my first audiobook with this story and I would rush through daily chores and duties to get back to the kindle to listen some more. I am pleased to give a 5 Star Rating to The Beloved Daughter and will happily recommend it to my friends. I received a copy of this book from The Book Club Network (bookfun.org) in exchange for my honest review."}, {"userName": "Cynthia Willow", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/11675314-cynthia-willow", "userReview": "This book had me from the first page. It was hard to read in parts because of the suffering, but that's the type of book it is. I'm so thankful that the author was able to explain what happens to the characters without getting too graphic. I don't need details of torture to know how bad it is, and the author did a wonderful job of describing without overdoing it. There were some surprises in the book that made me smile and cry at the same time! This book would make an awesome movie! Faith, struggle, suffering, rewards; it's all there wrapped up into one masterpiece of a story! Kudos and 5 stars to Alana Terry! I'd love to read more by this author!"}, {"userName": "Mary Findley", "userReviewDate": "Dec 26, 2013", "userURL": "http://www.goodreads.com/user/show/6279424-mary-findley", "userReview": "“I Want to Know More About Moses!”Alana Terry presents such a gripping and realistic picture of life in North Korea. The mentality of the Korean prison system becomes chillingly clear. Overtones of George Orwell’s 1984 ripple through this book. The determination to break spirits, destroy loyalties and humanity, and snuff out hope is everywhere. But faith is really the only answer, the only hope, in this visionary work, no matter what goes wrong, no matter how flawed or pressured God’s servants may be. God will do His work and prepare His servants."}, {"userName": "Marion", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/26667589-marion", "userReview": "Chung-cha's story is a tearjerker that made me question how true is my faith? The author gave a picture of North Korean persecution, and Chung-cha's struggle to trust her Heavenly Father after struggling with her earthly father. It's written in first person as we meet her friends and enemies. The book can get graphic at parts but thankfully, some is left to the reader's interpretation. Religious liberty is being threatened, in my opinion, here in America, and I look forward to more by Alana Terry to help me remember life outside the American bubble."}, {"userName": "CathyLynn Bryant", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/18775763-cathylynn-bryant", "userReview": "This is such a relevant book to our time. There isn't a day that we don't hear of Christian persecution taking place somewhere in the world. Alana does a marvelous job of bringing this issue to light. I highly recommend The Beloved Daughter."}, {"userName": "Nora St Laurent", "userReviewDate": "Aug 26, 2014", "userURL": "http://www.goodreads.com/user/show/1100689-nora-st-laurent", "userReview": "I’m thankful for the review copy of a book that introduced me to Alana Terry and her compelling novel that read like a non-fiction book. The style format of a memoir to a beloved daughter was engaging. Since it was written in a first person perspective I felt as if I were standing by Chung-Cha’s side as she was tortured by guards in Camp 22. I couldn’t put this book down.Chung-cha’s world changed the instant the soldiers showed up at her house. Her only crime was being the daughter of a Christian. Here’s a peek at what the soldiers said to her father, “Answer me now, you filthy Christian pig.” Pock-Marks was wheezing even as he sneered at father. “Will you let your daughter suffer for the sake of this precious religion?”“Out of the corner of my eye, I saw father set his jaw. “My daughter and I do not cower in fear of those who can harm the body but can not kill the soul,” he proclaimed.“For a moment, my fear was replaced by anger toward father and toward the God he served so faithfully, but of who seemed so powerless at the moment to intervene on my behalf…I was about to be murdered.”This was difficult eye opening, meaningful read; as it gives readers a glimpse into the life of a persecuted Christian; specifically the horrifying plight of the North Korean people. This author paints a sobering look at flawed characters walking out their faith in terrifying circumstances. Main character Chun-cha was too young to understand all her father did for the underground church. She didn’t share her father’s faith. She wondered what the purpose was of all this suffering for your faith? Can the unspeakable be forgive? Will faith sustain even when it seems God has forsaken his people?“Chung-cha recalls, “When I was 12, you see, my father’s faith was strong that it seemed completely unattainable. I could never be as steadfast as my father…. I’m not God! I clenched my fists…just because my life in Sanhe is hard and dangerous doesn’t mean God doesn’t want me here.”“If your truly where God wants you to be, then you could at least try to be joyful.” Kwan retorted.”This novel is not for the faint of heart. This author delivers gritty details of life in North Korean prison camps thru Chung-cha’s young eyes. They are heart wrenching vivid images of the terror, deprivation and humiliation prisoners endured day after day.These characters and their situation will stir your soul, break your heart, challenge your faith and show you that God moves in all situations in spite of what the evil one is doing. God is still in the miracle business even in prison (it reminded me of the things (told in the bible) that happened to the Apostles in prison).The underground church is flourishing in spite of the enemy’s attempts to wipe out Christians. It’s a word picture of how faith triumphs in the most hellish conditions. This made me think of how precious \"Freedom\" is. I don’t often Thank God enough for this precious gift. I never have to worry about being imprisoned and/or shot for reading my bible, going to church or having a bible study in my home.The Beloved Daughter is a thought-provoking read that will stir your spirit, give you a deeper understanding of North Korea’s current situation and make you want to pray for them more. This is a story of faith, loss, God’s redemption, sacrifice and miracles. I highly recommend this novel for book clubs. There will be lively discussions guaranteed. It’s a book that will leave you changed.Disclosure of Material Connection: #AD Sponsored by publisher.I received a complimentary copy of this book from the publisher. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255 “Guides Concerning the Use of Endorsements and Testimonials in Advertising”Nora St LaurentTBCN Where Book Fun Begins www.bookfun.org Book Fun Magazine www.bookfunmagazine.com The Book Club Network Blog www.psalm516.blogspot.com"}, {"userName": "Beth", "userReviewDate": "Mar 15, 2014", "userURL": "http://www.goodreads.com/user/show/11255379-beth", "userReview": "I received this book from the author, Alana Terry, for no charge in exchange for my honest review of this book. The opinions expressed here are my own.Book Description: In a small North Korean village, a young girl struggles to survive. It is her father's faith, not the famine of North Hamyong Province, that most threatens Chung-Cha's well-being.\"The Beloved Daughter\" follows Chung-Cha into one of the most notorious prison camps the contemporary free world has known. Her crime? Being the daughter of a Christian.\"The Beloved Daughter\" is Alana Terry's debut Christian novel and has won multiple awards, including the Women of Faith writing contest and the Book of the Month award from The Book Club NetworkMy Thoughts: The Beloved Daughter is Alana Terry's debut novel and its amazing. Chung-Cha's family are Christians in North Korea, one night her family is taken to prison camp and expected to renounce their faith. Chung-Cha endures unthinkable abuse and cruelty at the hands of the soldiers in the camp. Eventually she finds herself in a cell with an old woman who the guards are afraid of. She is a Christian woman who has demonstrated her faith publicly. Chung-Cha finds herself safe and loved with the old woman. She teaches Chung-Cha much in the time they are together. One night a soldier comes asking for prayers of healing for his daughter. As events unfold Chung Cha finds herself escaping from the prison camp with an unlikely helper. She crossed borders and finds herself in a safe house. Now she has to figure out what life will be.The Beloved Daughter is written in a diary like format by a mother(Chung Cha) to her beloved daughter(Ae Cha) that shares her life and family history. This book is very well written and very well researched. Alana Terry writes with authority about North/Sought Korea and China, the politics of these places, the history, the prison camps, religions of the region, and life after prison camp. I learned a lot about these things while reading this book. The story is heart wrenching, the abuse and cruelty that the people endured in this prison camp was just horrible. This is a deep story that really touches your heart about Religious persecution that has happened and still does in places. I really enjoyed most of the characters in this book but my favorite was The Old Woman, Grandmother who took care of Chung Cha during part of her time at the prison camp. She was a strong, steadfast woman who loved God and didn't hide that. She did what she could to help Chung Cha see things and gave her love, something she desperately needed. I had a hard time putting this book down once I picked it up. As I read this story, I felt like I was there watching the events unfold from the descriptions and details. I definitely found myself crying in parts of this book. Very emotional read. I enjoyed the book tremendously and highly recommend it to anyone who reads Christian Fiction. You will not be disappointed. I look forward to reading more from Alana Terry! She is a must read author on my list. I give this book 5 STARS."}, {"userName": "Daliso Ngoma", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/22746088-daliso-ngoma", "userReview": "As with any review, there is a good level of bias. And yes, I'm giving this two stars. I honestly didn't feel connected emotionally with the memoir, and I think that's what made it worse in finishing this book.It's the story of one Korean woman who got the bad end of the stick in North Korea and just got lucky to escape to China (and later South Korea) and throughout the story puts her devotion towards God, which was very doubtful through out the whole story. Unless she was supposed to be the female Peter in this writing (God accepting an honest skeptic, or God accepting a skeptical believer,? You choose).When relating to Khaled Hossein who himself talks of Islam in his books and the persecution within Afghanistan, it keeps you wanting flip through each page and not wanting to put down his books down till the last page. But with this book I felt Christianity was splashed unnecessarily throughout the story being told and plagued with bible verses to start off each chapter and the constant moaning and groaning. It was quite obvious as to what the end of the book would play out to be about. Also the punting of atheism seems to be the rational behind what the North Korean and China were doing rather than the philosophical view of communism and political power that the leaders like holding, which can be seen as being mutually exclusive to atheism.It was a tragic story, and I do wish it doesn't befall anybody but it is life, and we should move on.Suppose it can teach a thing or two about being grateful for the opportunities one has in life, everybody lies to save their own skin, that bad things happen to good people (which is mutually inclusive to bad people as well), and that one should follow their passion no matter what the risks may be.Just on a side note, you're never born into [Insert Your Religion Here], you're born to parents of [Insert Your Religion Here]. Thus all I'm saying is that children are vulnerable, and should given an early start in reading in terms of sciences and religion (not just one or the other), and shouldn't be stopped in questioning everything."}, {"userName": "Beckie Burnham", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/2952739-beckie-burnham", "userReview": "From the opening scenes of The Beloved Daughter, Alana Terry had my full attention. Gripping and convicting, horrifying and affirming, The Beloved Daughter is a must read novel for those who want to see just what is happening in North Korea. I knew that it was an evil regime, but Alana’s debut novel opened my eyes to the truth of its brutality and the need for intercession for the church that refuses to give up in spite of persecution.The Beloved Daughter is the story of Chung-Cha, a young woman raised by a devout Christian in the hostile country of North Korea. Following a raid, she is plunged into a living nightmare of torture, degradation and physical and emotional deprivation. Chung-Cha learns quickly that she can depend only on herself for survival, causing her to harden her heart to others and to God. But though she has turned her back on God, He never forgets her, working through the very trials and temptations that Chung-Cha faces.The Beloved Daughter will have you on the edge of your seat and gasping at the treatment Chung-cha faces. A truly godless nation, North Korea treats its citizens more harshly than animals. If nothing else, the novel will open your eyes to the atrocities being perpetrated on its people, especially Christians. But The Beloved Daughter also has scenes of hope and peace amidst the terror and betrayal. God’s peace and hope and healing grace shine through. The Beloved Daughter is beautifully written, with complex characters and well-imagined settings — good literature with a dramatic and moving subject matter. I highly recommend this novel and look forward to Alana’s newest book, Slave Again.Highly Recommended.Great for book discussion groups.(Thanks to the author for my ebook copy. The opinions expressed are mine alone.)"}], "description": "In a small North Korean village, a young girl struggles to survive. But it is her father's faith, not the famine of North Hamyong Province, that most threatens Chung-Cha's well-being. Is Chung-Cha's father right to be such a vocal believer? Or is he a fool to bring danger on the head of his only daughter?\tChung-Cha is only a girl of twelve and is too young to answer such questions. Yet she is not too young to face a life of imprisonment and forced labor. Her crime? Being the daughter of a political traitor. The Beloved Daughter follows Chung-Cha into one of the most notorious prison camps of the contemporary free world. Will Chung-Cha survive the horrors of Camp 22? And if she does survive, will her faith remain intact? \"The Beloved Daughter\" is Alana Terry's debut Christian novel and was a winner in the Women of Faith writing contest.", "title": "The Beloved Daughter\n      \n          (Whispers of Refuge  #1)", "url": "http://www.goodreads.com/book/show/17798886-the-beloved-daughter", "average": 4.18, "cover": "https://images.gr-assets.com/books/1365989786l/17798886.jpg", "reviews": 194, "authors": [{"url": "https://www.goodreads.com/author/show/7048073.Alana_Terry", "name": "Alana Terry"}], "type": ["Christian Fiction", "Christian", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/17798886-the-beloved-daughter", "http://www.goodreads.com/book/show/18457096-the-beloved-daughter", "http://www.goodreads.com/book/show/25335376-unplanned", "http://www.goodreads.com/book/show/27423786-paralyzed", "http://www.goodreads.com/book/show/23202955-slave-again", "http://www.goodreads.com/book/show/30296610-policed", "http://www.goodreads.com/book/show/36242150-what-dreams-may-come"]}