{"ratings": 54214, "userreviews": [{"userName": "Felicia", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/666892-felicia", "userReview": "This is kind of a deceptive book. It seems like it could be young adult in tone at first but it is NOT young adult. It's an adult urban fantasy starring a child. Very cool and immersive, and a bit dark. Hell, a LOT dark sometimes, haha. The lore is very cool, you can tell that the author really loves folklore and all the elements of the world are interesting and believable. Worth checking out if you like magical realism and a lot of bite to your fairy tales."}, {"userName": "Stephen", "userReviewDate": "Jan 30, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "Rumpelstiltskin…aka “the Crooked Man” is one seriously scary and diabolical CREEPSTER. \nTrust me, after reading this book, the above image of a sadistic, powerful, child-slaughtering MOFO will forever displace your previous perception of old Rumpy being nothing more than a half pint, mischievous prankster with ethical deficiencies…\n…a Disney tale this is not. …a light, comforting “happily ever after” children’s story this is not. However, what this story is….is beautifully written, richly characterized and brilliantly executed. Put simply…it’s wheel barrow full of WONDERFUL. My feelings for this book surprised me after my intensely passionate, torrid love affair with The Child Thief. I sort of felt bad for this book as I really thought it had no shot of being anything more than a diversionary “get my head back together” rebound novel. I certainly didn’t imagine it had any chance of sweeping me up off my feet and carrying me way into its narrative. …but it did. The story made me love it despite myself. PLOT SUMMARY:Set in England at the outbreak of WWII, young David loves books and stories. We meet David as he is watches his mother slowly die from illness. When she finally succumbs to death, David is devastated (I told you book this wasn’t a bright box of sunshine). Eventually, David’s dad gets remarried to a woman named Rose and the three of them move to Rose’s country home where David’s half brother, Georgie, is soon born. David is given the room of Rose’s uncle, Jonathan Tulvey, who shared David’s love of books and stories. Jonathan vanished as a young boy and has never been seen since. The books in Jonathan’s room are old and full of ancient stories and many contain odd notes written by Jonathan. While Rose is nice and tries to form a bond with David, he finds himself increasingly angry at her and his new half-brother. He spends more and more time among the old books which begin to whisper to him and David starts to witness strange occurrences, including the appearance of a “crooked man” watching him. Eventually David finds himself in another world where dark, grim versions of classic fairy tale characters exist but are nothing like the way they are normally portrayed. The depictions of these characters are outstanding and it often takes a while to identify who they are because they are so stripped of the normal fluffy accoutrements. While, most of the tone is serious and even bleak, there are some great moments of comedy. For example, in one of my favorite scenes, David encounters the Seven Dwarfs who turn out to be communist revolutionaries and political activists straight out of Monty Python’s Holy Grail:\nTheir relationship with Snow White is anything but pleasant. However, it is very, very funny. David soon discovers that he must make it to the King of this new world who might have the power to send him back home. However, David’s journey is dark and perilous and he is constantly hunted by the “crooked man” who has his own need of David. THOUGHTS:The beginning of the story takes its time to develop, but this leisurely pace didn’t bother because Connolly does an amazing job with it. He keeps us engaged as he introduces us to the characters and slowly allows the fantasy elements to creep and and crawl and bleed into the narrative. This makes the transition from our world into the fantasy world feel authentic and seamless. In addition, the early events of the story turn out to be critical to the central plot and final resolution of the story and so form important threads in the overall tapestry. As alluded to above, I was quite surprised at how much I enjoyed this novel given how emotionally spent I was after reading The Child Thief. It's a credit to how marvelous a job Connolly did with this work that he was able to hold me enthralled to the narrative throughout. The characters are well drawn, with details and shadings to their personalities that make them come alive. I bonded with David very early on making the dangers that he faced all the more gripping. Finally, the plot itself was compelling and page-turningly addictive and Connolly’s prose and descriptive talents were both excellent. Overall, a sensational book that over came great odds to pleasantly surprise me. If you get the chance to pick this book up...take it. 4.5 stars. HIGHLY RECOMMENDED!!"}, {"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Sep 04, 2015", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "Στον μεγάλο και ανείπωτο πόνο,μπροστά στο αναποδραστο, η ψυχή και όλη αυτη η ενεργεια που την περιβαλει,πριν αφανιστεί οριστικά απο θλίψη και σπαραγμό, πριν χαθεί για πάντα στην κοιλάδα των δακρύων,πριν την τελειωτική συντριβή της κανει κατι μαγικά λυτρωτικό: ΑΠΟΔΡΑΣΗ απο το έρεβος του θανάτου και ΑΠΕΛΕΥΘΕΡΩΣΗ μεσα απο ονειρικά φτιαγμένα ΠΑΡΑΜΥΘΙΑ.Εννοείται πως τα παραμύθια ειναι για παιδικές ψυχές τρυφερές αγνές και μεγαλειώδεις και ίσως όλες οι υπάρξεις πανω στη γη να γινονται ίδιες μπροστά στον μοιραίο πόνο,επομένως σε οποια ψυχή ανακατευτούν όνειρα και παραμύθια δημιουργώντας προστασία και απαντοχή,αυτομάτως αυτη η ψυχή συγκαταλέγεται στις παιδικές...και τα όνειρα που κανει γινονται ο προσωπικός ΠΑΡΑΔΕΙΣΟΣ!Το βιβλίο των χαμένων πραγμάτων ειναι μεταφορικά και ουσιαστικά η τρομακτικά πραγματική στιγμή της ανθρώπινης υπόστασης που χάνεται σε άλλους κόσμους προκειμένου να σωθεί απο την παράνοια και ταυτόχρονα ωριμάζει και διαχειρίζεται γεγονότα και καταστάσεις με σοφία και λογική!!Συστήνεται ανεπιφύλακτα στους εραστές των ονείρων και των παραμυθιών,σε όσους παλεύουν να μη χαθούν στην θλίψη της απουσίας,σε αυτούς που πιστεύουν στην δύναμη της θέλησης, της αφοσίωσης,της αγάπης και της ανιδιοτέλειας!! Σε όλες τις αιρετικές ψυχές που έχουν τα εισιτήρια για το ανέφικτο μεσα στο τσεπάκι τους και ειναι ειναι έτοιμοι ανά πάσα στιγμή να μείνουν κόντρα στο κακό ή να φύγουν παρέα με το καλό!! ΚΑΛΗ ΑΝΑΓΝΩΣΗ!!Πολλούς ασπασμούς!!"}, {"userName": "Lisa Vegan", "userReviewDate": "Jan 08, 2008", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "Part fairy tale and part psychological study, I found this to be an engrossing and powerful book. Recommend to everybody, particularly those who have used reading and books to get themselves through difficult times, especially in childhood.I don't look at this book the way some readers apparently have: as sci-fi or fantasy, but instead see it as showing the redemptive power of books and stories in children's and adults' lives. And as an account of one boy's inner life and imagination.I'm not sure which way the author intended it, but it’s a wonderful coming of age story."}, {"userName": "Kai", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "[I just have to talk about Roland here, for a minute. We are introduced to this strong and tall knight in shining armour, who takes the main character under his wing for a while. After a time we get to know him a little better and find out that he is looking for someone, another knight, whose picture he keeps hidden in a locket around his neck. I could smell the gay from far away. His was such a beautiful and tragic story, and I really wanted to know more about him, he deserved a happy ending, but I knew, and he knew, that there was no such thing in his future. Which made my heart ache a little more. Enough rambling.  (hide spoiler)]"}, {"userName": "Annet", "userReviewDate": "Aug 06, 2008", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "Extraordinary book, really special.Story about the seven dwarves made me laugh :-)Magical book! I have my eyes on Nocturnes now of Connolly."}, {"userName": "Rosh", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/67389060-rosh", "userReview": "*Didn't like this book as much but it did motivate me to sketch*Take all your favourite fairy tales from your childhood(from odd mixture of Wizard of Oz to Labyrinth to The Never Ending Story to the most sadistic part of Grimm's Fairy Tales), now throw in some well known poems and mix together with a story of a child coming to terms with the death of a parent. And you've pretty much got this. But did it work? This books is rather dichotomous. There were some really wonderful bits, and there were parts that were just poorly executed. But my biggest grouch was with the predictable and stiff writing. I almost laughed aloud when I read sentences along the lines of:\n 'And that was when David truly transitioned from boyhood to manhood.' \nWhatever happened to the old-fashioned ‘show, don't tell’ rule of writing? Overall it was an Okay and forgettable read."}, {"userName": "mark monday", "userReviewDate": "Oct 23, 2011", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "Fugue state, formally Dissociative Fugue... usually involves unplanned travel or wandering, and is sometimes accompanied by the establishment of a new identity. Fugues are usually precipitated by a stressful episode.in world war 2-era england, young David loses his mother after a lingering illness and begins to experience strange dissociative episodes, often involving the sounds of books whispering to him and usually ending with him falling into unconsciousness. soon enough, his father finds a new wife named Rose - a nurse at his mother's hospice - and David finds himself with a stepmother and an infant half-brother. David is deeply unhappy with this development. after the new family moves out of london to Rose's country home in order to escape german bombers, David realizes a shadowy, crooked figure has sinister designs on him and his brother. one night, after a particularly bad argument with his folks, David hears his mother's voice calling him. following that voice, he crawls into a hole within a sunken garden - just as a german bomber also falls from the sky and crashes into that garden. he emerges into a sinister fantasyland. his quest: Find and Rescue His Mother. his nemesis: The Crooked Man.John Connolly is best known as a respected writer of an excellent detective series. his strengths have been widely reported: gorgeously dark and lush descriptive skills, a sensitive portrayal of private eye Charlie Parker - an unusually tormented protagonist (tragic even for a genre noted for its sad, sad heroes), and a unsettling ability to mix the prosaic with the supernatural to startling effect. in this book, Connolly takes each of those gifts and streamlines them in a way that is appropriate for the reader of young adult or even children's literature - although this novel is very clearly an Adult Fairy Tale. the result is pleasingly distinctive. there are many scenes that are striking in their psychosocial nuance, their foreboding atmosphere, their ability to evoke that wonderfully shivery feeling of fearful anticipation. my favorite passage happens early on: David's daunting entry into the strange fantasy world... an eerie vignette that is a model of careful, suspenseful writing, featuring unearthly quiet, child-like flowers, a a taciturn Woodsman, the smoking remains of the german bomber, bleeding trees, a house in the woods with a Giger-like exterior, and a gathering of evil wolfish beings.Dionysian imitatio, a literary method of imitation conceived as the practice of emulating, adaptating, reworking and enriching a source text by an earlier author.Book of Lost Things is a book of mythopoeic templates - revisited, revised, regurgitated, remixed, and reimagined. we have an entire company of Big Bad Wolves, reconfigured as ambitious wolf-men, born of a grotesquely slutty Little Red Hood and sprung from the nightmares of a juvenile king... a perhaps not-so-Wicked Stepmother... a malevolent and terrifying Sleeping Beauty... Childe Roland, transformed as a brave gay soldier in search of his long-lost lover... trolls and harpies and a savage, hungry Beast... a young girl's spirit in a glass jar... and our villain, a gleeful child-thief, a striker of dark bargains, a Rumpelstiltskin, an old old devil: The Crooked Man.the use of revisionism is, sadly, not always successful. a comic interlude with the socialist Seven Dwarves and an obese, monstrous Snow White is depressingly unfunny and a little desperate (at least to this reader). and a long part near the end, depicting various torture chambers and examples of The Crooked Man's terrible villainy seems to be merely an excuse for Connolly to indulge himself with a gloatingly vicious array of sadistic tableau. both sequences were eye-rolling and sigh-inducing.but those are aberrations; despite them, Connolly more than succeeds in creating delightful and intriguing reinterprations of figures from fairy and folk tale. even better, David's character is a slow-burning but dynamic one, changing in bits and starts from boy to man with each new encounter. he is a realistically flawed protagonist as well as a brave and endearing little hero.Memento mori, a Latin phrase translated as \"Remember your mortality\", \"Remember you must die\" or \"Remember you will die\"... it names a genre of artistic work which varies widely, but which all share the same purpose: to remind people of their own mortality.the novel's extended endings were a brilliant surprise. to avoid spoilers, i'll just say that i was entirely taken aback by the meaning of The Book of Lost Things itself. and - even more memorably, more intensely - the closing pages' no-nonsense illustration of the potential and/or inherent tragedy of human life in general... and the idea of that tragedy - no matter how intimate - somehow not really being that tragic at all - just simply a part of the greater cycle of life, death, and rebirth. i hate to end a review with a tv show reference... but if you have ever seen the last 10 minutes or so of Six Feet Under's final episode - a wondrously sad, wistful, yet somehow uplifting experience - you will know exactly what i mean. the ending of this rather fantastic book is equally moving."}, {"userName": "Mith", "userReviewDate": "Nov 14, 2011", "userURL": "http://www.goodreads.com/user/show/3620424-mith", "userReview": "[, extremely downtrodden (hide spoiler)]"}, {"userName": "Robotkarateman", "userReviewDate": "Mar 09, 2008", "userURL": "http://www.goodreads.com/user/show/979246-robotkarateman", "userReview": "NOTICE (Please read this first): I'm happy to discuss my opinion of this book with you if you had a different take, but if your intent is merely to attack my opinion, I'm not interested. Since I posted this way back in 2008, a (very) small minority of this book's fans have taken my review personally and have written some very long, very insulting responses telling me why I'm wrong. So please allow me to clarify something - This is my opinion of the book. It will undoubtedly differ from yours because we are not the same person. You are welcome to refute me by giving the book a much higher rating and more glowing review ... on your own account. You are also welcome to tell me you disagree below, but if you can't do it in a less-than-essay-long format, I will delete your comment. If you need to get nasty and personal with your remarks, I'll probably be reporting and blocking you as well.  Connolly's \"Book of Lost Things\" came highly recommended as a modern take on the fantasy genre. What I found instead was a completely unlikeable main character, an array of interchangeable father figures, and a disappointing rehash of the usual fairy tale parodies. \"Lost Things\" centers on David, a boy whose mother dies and whose father remarries and has a second child, leaving David to bicker bitterly with his new stepmother while trying to avoid anxiety attacks that leave him blacked out and feverish. And that groundwork occurs in one of the most poorly paced info-dumps I've had the misfortune to read. The first chapter focuses on David and his mother, leading you to believe this will be the crux of the story - but alas, she dies. The second chapter focuses on the father's remarriage and David's anxiety attacks leading the reader to believe, perhaps, this is the focus of the story - it is not. The third and fourth chapters center on David's mostly absent father whose work is \"top secret\" and David's fights with his step-mother and we, the audience, raise our index fingers and say, \"Ah-ha! Top secret Dad! Conflict with the new parental figure! This, surely, is the story!\" But, alas, those are red-herrings as well. In fact, after the sixth chapter, neither of those characters appears again until the (two chapters long!) epilogue. The real story ends up being David's abduction into the land of fairy tales by the Crooked Man, a Rumpelstiltskin who makes vicious bargains with emotional children to feed his magical slave house. David starts off his true adventure by following the voice of his dead mother - but don't assume that the story somehow involves David's mother's spirit wandering painfully in the fantasy realm awaiting rescue, this too, in Connolly fashion, is completely irrelevant to the story. Instead, David wanders the fantasy realm accompanied by a series of nearly identical substitute fathers who end up betraying David's trust in one way or another - by being gay in one case (Roland), by being fallible in another (the generic Woodsman). In the end, David finds another potential father figure in Jonathon, and quickly realizes that not only is Jonathon a liar and a murderer, but also that he, David, no longer needs a father figure because he's now become a man of his own right. He then stares down Jonathon, the Crooked Man, and the vicious wolf monsters, who until that point only appeared in the story when Connolly felt the need to remind us that David was in danger because wolf monsters were chasing him; they never catch up to him except at the end and, as I said, David simply stares them down and wins by virtue of his newfound manhood.In all, \"Lost Things\" is a plodding, thinly veiled paean to a baby-boomer-era view of \"manhood\" as stoic resolution and resistance to all hurts, including mental and emotional. Perhaps this story plays better, and I don't wish to be insulting, with a female audience, one that's never had to grapple with questions of \"manliness\" or had to decide on an appropriate level of attachment to an older male. As for me, I was insulted that David begins the story emotionally wounded by what he views as a betrayal by his father and, instead of finding closure, he learns to just get over it and \"be a man\" about it. But a bigger insult, in my eyes, was the closing of the book - Connolly is so in love with his work that he follows up the main story with almost 150 pages of notes and commentary on his story: everything from the origins of the fairy tales he parodies to his woeful recollections of scenes that were cut from the final draft (murder your darlings, Connolly!). It's as jarring as it would be had Stephen King ended Christine with detailed descriptions of a Plymouth Belvedere and ten pages of him crying about the Arnie/Christine tailpipe sex scene that his editors excised from the final publication. This was my first experience with Connolly, and as it's his most highly recommended book, I'll probably pass on his work in the future."}, {"userName": "Carol. ", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "[The Loups born from Red Riding Hood's sex. The harpies. The grossly fat, selfish Snow White. The Evil Huntress obsessed with finding the perfect prey. The Evil Enchantress asleep behind the wall of thorns. The girl in a jar, about as close as one comes to a refrigerator in a non-refrigerator world. (hide spoiler)]"}, {"userName": "Chesca", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/35614518-chesca", "userReview": "“For in every adult there dwells the child that was, and in every child there lies the adult that will be.”\n\nJohn Connolly’s \nThe Book of Lost Things\n is a tale that reflects everyone’s story of growing up. Some would say that it’s a story of losing one’s innocence, but are we ever really innocent? Through time we have come to develop feelings of grief, rage, hatred, and jealousy. These are some of the things that eat the pure off of us. At some point, we have all become the things we feared the most. We have turned into our very own monsters, destroying the good that is ahead of us. This is the story of how David overcame his monsters.As a young boy, David lost his mother, and his only means of coping up with his grief was reading, an interest he got from her. The books started whispering to him and only he could hear them. Months after his beloved mother’s death, his father remarried. Rose, his father’s new love got pregnant with Georgie, David’s new half-brother. As a part of starting a new life with his step-mother and half-brother, David and his father moved out of their London home and into Rose’s which was located out of the city. There, in the old house, he was given a room that was used to be of a boy named Jonathan Tulvey. It was filled with old books that David tried to read for himself although some he could not understand thoroughly.In his dreams and around the house, David began seeing a figure of a man with distinct, odd features. Drawing closer and closer to him, waiting in the shadows, was the Crooked Man.I borrowed a copy of this from my cousin and it had been sitting on my shelf for months. At first, I was not too thrilled to start reading it due to the synopsis at the back of the book. It was not very attractive to me. I decided to read it just so I could return it to her sooner. I was so wrong to judge this book by the few words written on its back cover. I was not expecting it to fascinate me, to touch my heart, and to show me what it means to live and to be alive, but it did. It was an extraordinary experience that was beyond my anticipation for it. The synopsis didn’t do it justice. It was a dark, strange, tragic, and bloody adventure that every child in us would fear, but the adult in us would come to understand the truth beneath its surface. In it are very familiar tales that were distorted to suit the book’s eeriness, constructing a twisted realm parallel to David’s reality.David was a child at the beginning of the story, and you could really visualize how his character developed. He became more mature as he learned to decide what’s right and what’s wrong. In time, he also became more selfless, learning that love could cause a terrible ache, and living, sometimes, could hurt. His journey in the world beyond the sunken garden emblematized a lot of things that he was battling in his heart. They were struggles he had to face to help him cope with the pain of losing his mother and adjust to his new life.The world that the author wrote into being was quite disturbing. It was stripped off of peace, innocence, and hope. In every corner of it lurked danger that a child like David, realistically, might not be able to endure. I don’t even think adults could come out alive of the situations David found himself in. There were beasts, creatures that could kill or mangle you. There was also a bit of sexual content implied in it that I was not expecting. It was not graphic, but it would be perturbing if a very young child would mistaken this as a children’s book and read it. He could either be very curious to try those things out or be afraid of them.A hundred pages on the origin stories and source materials were included in the latter part of the book, explaining further how each distorted tale woven into The Book of Lost Things represented something significant in David’s life. It gave me a clearer insight of what David was going through, reminding me more that, somehow, I have been there too. It was quite amusing to reread those fairytales and to read some of them for the first time. They felt familiar but at the same time strange because after all these years of not reading them and then revisiting them now, it seemed to me that they were telling a different story that exhibited deeper reason than how I perceived them when I was just a child. There were also explanations on how each of the characters represented an archetype or a persona that contributed greatly not only to the development of this story, but also to those that inspired it.This is a really cleverly-written adventure and I highly recommend it. I hope you guys would give it a try. Surely, I will be reading more books written by this author in the future."}, {"userName": "James", "userReviewDate": "Nov 29, 2015", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "4 stars to John Connolly's The Book of Lost Things. I added this to my \"To Read\" list sometime in 2015 as it reminded me a little bit of the \"Once Upon a Time\" TV series which I love. And it didn't disappoint!\nStory\nA young adult novel focusing on a young boy's quest to fit in his earthly world and survive in his fantasy world in 1940's England. Young David (around 10) has suffered a lot as a boy. His mother dies early, his father remarries quickly. He is shy and doesn't venture much out of his room. When he's forced to accept his new stepmother and then his young half-brother, David mysteriously disappears into his books through a realm in secret sunken garden where he's immediately thrown into fairy tale land. He must find a way out but quickly learns the fairy tales all have a dark side in this universe, and he's not the first to be transported to the new world from his old world. He's faced with the be-all, end-all question of selfish vs. selfless behavior. What will he choose and what are the impacts?\nStrengths\n1. John Connolly has a vivid imagination with brilliant characters and creates a fun re-appropriation of beloved fairy tales.2. You see a lot of yourself in David and know what he's doing wrong all the time -- makes you realize the commonality among all of us.\nWeaknesses\n1. Not enough of the fairy tales are included to truly feel like you've shown us the full picture of this world. We need more!2. I don't know enough about David's family and real world experiences to understand how/why he was chosen to enter the new world - so I'm a bit doubtful of the premise and how children are chosen by the Crooked Man.\nFinal Thoughts\nIt's still a great read. I think it's appropriate for pre-teens across the curriculum. It will speak volumes to different types of kids -- those who love to read, those who have problems at home, those who just love fantasy, those who like history... need to compare novels like this to others in its genre to provoke true literary analytics, e.g. this vs. \"Harry Potter,\" this vs. \"Life as We Knew It\" and this vs. \"Chronicles of Narnia.\" I think it's a great \"survival of the fittest\" read to help young adults learn how to mature.\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world! And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Thanks for stopping by!"}, {"userName": "Kawther (TheVillainLibrary)", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/31821483-kawther-thevillainlibrary", "userReview": "“For in every adult there dwells the child that was, and in every child there lies the adult that will be.” ― John Connolly, \nI love the cover of this book, isn't it so gorgeous ??This book is my favorite book of all time. I love getting back to it every once in a while and reread few passages, i feel it pulling me back in, tempting me to dive in its beautiful world of adventures once again. so finally i decided to post my thoughts about it.One thing you should know about me, is that I LOVE fairy-tales, especially the ones that contain a dark twist. and oh my .. this book gave me everything.World Building :The world that the author created was absolutely mesmerizing, the world building was impeccable and so well thought of, the writing style is easy to get lost into, I actually felt like i was there, you could feel the magic around you, the air of that forest, and the howling of the wolves, it was detailed enough that you can see the place clearly but not too much that it became boring. ( using too much details can ruin the book for me )This is not a young adult book like I expected. it was very dark, and some parts are just so twisted but very well written. the pacing of the story was also good, it took me a few pages to get into it, especially at first, but once i did, it was impossible not to continue and not want more, so i would say that this is definitely a page turner. The characters  : I loved all the characters in this book, they seemed so real. and i absolutely ADORED David, all his flaws made him more relatable and more human, in this story I believe we follow him in a journey of finding himself rather than finding his mother . The crooked man  what a clever idea ! i guess this story is about him in a way, he is the weaver of the events and the world of the story, he's the mastermind . I didn't have any problem or inconvenience regarding this book, everything is so well done and brilliant, which made the experience of reading this book so vivid. i also enjoyed the dark fairy-tales included in this book, it's something different, in a good way of course.The ending of this book tore me to pieces, it's the most perfectly written ending that i have ever encountered in a book. i cried so much. it is the kind of book that stays in your head even after you finish it.I would recommend it to everyone, because i feel like it's something that must be read at least once in our lives.John  , THANK you for this masterpiece, i can't imagine not reading this book as it's such a big part of my life"}, {"userName": "Hannah", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/41788446-hannah", "userReview": "I am as surprised as anyone about my rating - I genuinely thought I would adore this book. So much in fact that I kept putting off reading it to ensure I'd get the most of it. On the surface, this book is perfect for me as it combines many of my favourite things: fairy tales, hidden worlds, adult books with children as the lenses through which to see these hidden worlds, re-tellings, a sibling relationship that feels real, imaginative world building and and and.Don't get me wrong, this book was perfectly alright; it is very readable and well-plotted. The characters and their relationships make sense, the world created is interesting, and the fairy tales are well integrated. I am still dissappointed because it could have been SO much better. We follow David who is mourning his mother and feels betrayed that his father has found a new wife and had a child with her. He starts having seizures and seeing and hearing strange things until he finds himself in a new world - a world so very strange but still familiar, one where he has to fear for his life and will have to be braver than he has ever been.See, that sounds just like my type of book. Maybe my expecation just were too high and I was hoping for it to be more like \"Pan's Labyrinth\" - one of my all-time favourite movies. I thought the atmosphere could have been developed better to more work with the world detailed. I found the language to be too simplistic or not simplistic enough, I am not sure - if you are going to use different fairy tales to weave your tapestry your language needs to mirror those very closely or not at all. I reckon I caught most allusions to different fairy tales - I did grow up reading fairy tales, again and again and again - and this might actually have been one of my problems. The world felt very familiar to me and as such never completely original (I know that originality wasn't the point, I still think it could have been fresher).So yeah, kind of dissappointed but still a very readable book.First sentence: Once upon a time - for that is how all stories should begin - there was a boy who lost his mother."}, {"userName": "Bill Khaemba", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/41380936-bill-khaemba", "userReview": "Coming off from reading Lord of The Flies, I can definitely see some underlining similarities in both of them in the sense that both authors chose to use children to get their points across in a dark deeply disturbing way. Both backgrounds were hostile and unnerving and some imagery will stay with me for a while.\n“For in every adult there dwells the child that was, and in every child there lies the adult that will be.”\nThe book follows David a young boy who is trying to cope with a family tragedy by diving into stories and escaping in them but soon he is thrown into this dark version of familiar fairy tales and as he tries to find a way back to his world he comes across challenges that will redefine his belief in happily ever afterAs always I had fun reading this book and discussing it with \nThe Eclectic Club\n  I expected a light-hearted story with a fun little adventure but instead, I got something deliciously dark. The twist on the normal fairy tales was an edgy and disturbing and I f*cking loved it.The writing paired well with the pacing of the plot and each chapter felt like its own adventure which made the book unputdownable."}, {"userName": "Nikoleta", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/13362307-nikoleta", "userReview": "Καταπληκτικό! Τελικά... αυτό το \"ζωή σαν παραμύθι\", ίσως να μην είναι τόσο υπέροχο όσο νομίζουμε!"}, {"userName": "Ron", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/43881851-ron", "userReview": "Held within this book are not the fairy tales I heard as a child. They surely would have messed me up if I had. Connolly creates something wholly fresh by weaving a new fantasy with old tales placed in the mix – with a twist that is twisted mind you. It is the story of David lost in another land, and his journey to find a way home.4 stars for scaring the child in me…for making me wonder, cringe and also laugh as an adult reader…for the adventure of it, and the heartfelt story inside all of this. Pretty much loved reading this story, and the lesson for us humans that it represented.Buddy read with some good friends. Pick by Bill.PS. Yep, it’s a recommend."}, {"userName": "Karina", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/8933844-karina", "userReview": "A fairytale turned nightmare. I loved this! First off, let me tell you that this is not something for the faint of heart. Some passages were definitely scary or just plain twisted and gross (think bad witch cutting off children's heads and putting them on animals to then hunt them..). I want to get that out of the way because the word fairytale can be misleading. Those elements in the story were used sparingly though and never took over the story to the point were it turned into the horror genre. David, the main character, is a young boy who has just lost his mother. That event triggered something in him and he experiences seizures and is suddenly able to hear his books whisper and talk. The angrier he gets at his father for starting to live and marry again the more he experiences the real world and the world of stories blurring... until he becomes a part of one. He completely disappears into a world next to our own and has to find his way back. Of course, evil powers are trying to prevent him from doing so. It's a fairytale itself after all. The overall atmosphere is dark and scary. I was not expecting it to be for an older audience, but that is how it read for me. Looking at the cover I was expecting it to almost lean towards the middle grade genre. The twisted and scary parts of the story are not something I would recommend to someone of that age though. There are plenty of well-known fairytales mentioned that make it fun for someone who has been exposed to them over the years, but they have been turned into their nightmare version. The little red riding hood, for example, lays with a wolf she had followed through the woods and through their encounter an evil wold-human hybrid comes into existence. On the other hand, the chapter about Snow White and the 7 Dwarfs is plain hilarious. She is an arrogant, awful and high maintenance young woman and the dwarfs feel so oppressed that they have turned into communists. You have to read in order to really appreciate this crazy storyline hahaI enjoyed a lot and highly recommend this to people who are in for a dark, twisted, and edgy version of a fairytale retelling."}, {"userName": "Liz", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/20625013-liz", "userReview": "I loved this story. Fantastical adventures, battles, castles, monsters, magicians, heroes, and foes. There was so much more than I expected in this book -- which is billed as YA, yet of which I remain unconvinced -- but none of those things are even the best part. What moved me the most was the story of David himself, and the evolution of his character. David is a twelve year old boy who is grieving the loss of his mother and struggling to accept the upheaval of his life. And he’s angry… who wouldn’t be? His love of books, instilled in him early on by his mother, leads him to an adventure both wondrous and terrifying, during which he will learn to face his fears, find his strength, and finally come to terms with how he really feels. I was initially reminded of another beautiful book, A Monster Calls, which also reflects on how we as humans, whether child or adult, often simply don’t know what to do with such intense feelings of grief and anger, feelings that can manifest themselves in ways we don’t expect. There are some super creepy, skeevy, scary moments here that make me wonder how a twelve year old would feel reading it, but perhaps I am underestimating today’s young readers. After all, I was reading Stephen King when I was still in grade school! I have not been through what David has been through, nor seen what he’s seen, but I connected with him and I cared about him. To me, that is the single most important thing that an author can accomplish. Thank you Mr. Connolly. Five shiny stars."}, {"userName": "Carlos", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/1701553-carlos", "userReview": "Oh wow , what can I say? This book destroyed me, this book surpassed my expectations for it , I picked this up thinking it was going to be just a vapid book but boy this it's so much more that it's blurb would let you to believe. Think Grimm brothers, Disney , folk and fairy tales , ya modern literature (I'll compare it to a monster calls) and you will get a glimpse at the work that went behind this book. Then ending would make you feel all the feelings ..... I will not soon forget this book!!!"}, {"userName": "Lori", "userReviewDate": "Oct 29, 2007", "userURL": "http://www.goodreads.com/user/show/369169-lori", "userReview": "Read this book without really knowing too much about it. Just that other reviewers were impressed and it centered around a little boy and some dark versions of fairy tales that I had grown up on.Wow.Wow.wow.wow.That is what I have to say when I got to the last page.It was a really really great story. 10 year old boy who loves to read, loses his mother, hates his new stepmother and stepbrother.... gets pulled into this fairy tale world where things are familiar yet somewhat strange. Evil lurks around every corner.....If you havent bought this book and read it yet, you really must. Its a timeless tale, written for grownups, but can be read aloud to your childern as well. Loved it. loved it. loved it."}, {"userName": "karen", "userReviewDate": "Apr 06, 2009", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this was fine. i think i expected it to be a little more grown-up than it was. in many ways i am a huge infant, but not so much in my reading, unless its reeeally young reader picture books. but this had some nice reimaginings of traditional fairy tales, and it certainly doesnt take long to read, so i recommend to those adults that are already reading the harry potters and twilights. you babies!"}, {"userName": "pink (not just another shade of red)", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/30212137-pink-not-just-another-shade-of-red", "userReview": "According to Alice Hoffman, every fairy tale had a bloody lining. Everyone had teeth and claws.This one got fangs. And razor-sharp claws.It will lure you in with promises of magical books and mysterious flowers. Then, when it has you firmly in it's grasp, it will suck you in deeper into the dark. And won't let you go until it has its way with you.In Book of Lost Things, John Conolly collected fragments of my beloved bed time stories,twisted them so crookedly,and made them ornaments to a dark,beautiful world of his own. A world of betrayal and charming witches. Of wars and different forms of love. Of friendship and sacrifices. Of death. Of second chances. Of trees that bleed and lost children never found again. Of stories that end in death. Of our worst nightmares given life. And of the crooked man that haunts the shadowy parts of our imagination, the one we know but not really. What's his name again? Rumple-Right. Don't say it now. You know he doesn't like it when you do.In a prose that is both rich and cunning, Conolly indulgently and unhurriedly tells the story of young, grudge-holding, selfish,and book-obsessed David who entered a crack in the wall of a sunken garden in hopes of gaining back everything that he's lost. He took his time, making sure to catch his readers unaware time and time again by dropping these little bombs one by one.Some stories do not get happy endings.Princes and Princesses aren't perfect.There's but a very thin line separating bravery from foolishness.Even kings don't know everything.Sometimes you could rely on others for help. But mostly there's only really you.The smallest of hearts could be incubating the greatest of evil.The smallest of hearts have endless,cavernous rooms.Most of these most of us already know of course. But still we are a bit startled to encounter them here,in The Book of Lost Things and the little fairy stories in it. Because what are these facts doing here? In fantasy? Among tales that are supposed to tell us white knights shall be riding to our rescue, convince us little girls outwit big,hungry bears, and reassure us that all will come to a happy end. But just like the stories that I love best,this one gives you choices.A. David,a disturbed boy who got worse after his mother's death was lodged into a crack in the wall of a sunken garden after an explosion and had a really vivid,long dream- a dream that he returned to moments before his death.B. David entered the crack in the wall into Elsewhere,a world very different from ours but just as real.Or C. Elsewhere exists only in our imaginations but that doesn't necessarily mean it's not real.There. Take your pick."}, {"userName": "Anna", "userReviewDate": "Feb 04, 2016", "userURL": "http://www.goodreads.com/user/show/18202588-anna", "userReview": "Ένα πολύ ιδιαίτερο βιβλίο, με το τέλος του να \"παίζει\" με τα συναισθήματα του αναγνώστη και να το ανεβάζει κατηγορία. Ο μοναδικός λόγος που δεν του έβαλα 5 αστεράκια, αλλά παρέμεινα στα 4 που είχα αποφασίσει να βάλω όταν πλησίαζα προς το τέλος του βιβλίου, είναι πως παραθέτει με περισσότερο \"διδακτικό\" τρόπο τα μηνύματά του από αυτό που θα ήθελα, και ίσως αρκετά ξεκάθαρα, ενώ εγώ θα ήθελα να τα αφήσει να αιωρούνται ώστε ο καθένας να τα ερμηνεύσει με διάφορους τρόπους. Θα ήθελα δηλαδή το τέλος να είναι περισσότερο σημειολογικό για το τι σημαίνει η λογοτεχνία για τον καθένα και πώς οι ιστορίες εισέρχονται στον κόσμο μας. Φυσικά το βιβλίο είναι εκπληκτικό και όσοι αγαπούν τα βιβλία και την ανάγνωση νομίζω ότι θα το αγαπήσουν. Πρόκειται για ένα βιβλίο που έχει σχέση με τις ιστορίες και πώς αυτές μπορούν να μας βοηθήσουν να ξεπεράσουμε καταστάσεις και να ωριμάσουμε. Εξάλλου, η ωριμότητα δεν έρχεται αποκλειστικά με την πάροδο των χρόνων και την αύξηση της σωματικής μας ηλικίας: διάφορες καταστάσεις μπορεί να μας οδηγήσουν να ενηλικιωθούμε νωρίτερα ή αργότερα. Ο καθένας αντιμετωπίζει τις δυσκολίες της ζωής του με διάφορους τρόπους, κάποιοι επιλέγουν να κλείνονται στον εαυτό τους και στα βιβλία τους. Για τον Ντέιβιντ, τον 12χρονο πρωταγωνιστή μας, οι ιστορίες τον περικυκλώνουν και καταλήγει να ζει μέσα σε αυτές. Στην αναζήτηση του Βασιλιά που θα τον βοηθήσει να γυρίσει πίσω στο σπίτι του, αντιμετωπίζει τους κακούς ήρωες των παραμυθιών, βρίσκει συμπαραστάτες και συμπολεμιστές ιππότες και ξυλοκόπους, τα βάζει με λύκους, με τρολ και κακές μάγισσες, ενώ θα δείτε σε \"φιλική συμμετοχή\" πολλούς αγαπημένους ήρωες, λίγο διαφορετικούς από τον τρόπο που τους είχατε συνηθίσει. Ο Ντέιβιντ ξεφεύγει συχνά από το μονοπάτι που θα τον βγάλει από το δάσος και θα τον οδηγήσει με ασφάλεια στο βασιλιά, και ως συνέπεια ζει πολλές περιπέτειες, που στο τέλος θα τον οδηγήσουν στην κάθαρση και την ενηλικίωση. Αγαπημένο μου σημείο ήταν όταν μετά τις πολλές ομοιότητες με τη Χώρα του Οζ ο Ντέιβιντ αναφωνεί \"Ελπίζω ο Βασιλιάς να μην είναι απάτη σαν τον Οζ\", ενώ ένας ιππότης με το όνομα Ρόλαντ (!) οδηγεί τον Ντέιβιντ σε μια περιπέτεια σε έναν πύργο!!! Μου θύμισε επίσης σε κάποιες στιγμές τον Κλέφτη του Πάντοτε του Barker και την Coraline του Gaiman (αλήθεια, αυτοί στοίχημα είχαν βάλει να γράψουν μια ιστορία με παρόμοια θεματολογία;)Για όσους νιώθουν ότι αγαπούν τα παραμύθια, διαβάστε το! Δεν νομίζω ότι θα σας ενθουσιάσει, αλλά θα περάσετε παραπάνω από ευχάριστα την ώρα σας!!!"}, {"userName": "Mark", "userReviewDate": "Apr 18, 2012", "userURL": "http://www.goodreads.com/user/show/3470857-mark", "userReview": "This was me after finishing this novel, my first read from John Connolly:It was so gut-wrenchingly emotional. Every bit of it. From the harrowing beginning, to the Labyrinth-on-acid fantasy world in which the main character soon finds himself. There's so much going on in this novel. It seems like a children's fairy tale, but if I had read this as a young'un, I would probably be in an insane asylum to this day. I know Connolly typically writes crime fiction and this being my first, I'm unable to compare it to his other work. But from this reading, I know that Connolly is a man of deep thoughtfulness and emotion, and one who can perfectly transfer that emotion and philosophy to the written page. The way the beginning is written, in which the main character, David, is dealing with his mother's slow death, I have no doubt that Connolly is writing from his own experiences. The minute details he chooses to include are just spot on. One thing to know before going in, this book will twist your head in knots. I've read a lot of horror fiction through the years, but many scenes in this book, partly because of their juxtaposition of childlike fairy tales and real-world, grown-up horrors, make this, on the whole, easily the most horrific collection of scenes I've read in my life. And I see no other novel containing scenes that come close to their power. For that reason, it did take me a little longer to get through this novel. I would read a few chapters and become so overwhelmed by what was going on, I needed a break: sometimes hours, sometimes a day. There is a LOT of weight to this book, even with its deceptively simple prose and presentation. I can easily say this is a book I will never forget. It will haunt me. And I think David Bowie would approve:"}, {"userName": "Έλσα", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/63862566", "userReview": "ΥΠΕΡΟΧΟ, ΚΑΤΑΠΛΗΚΤΙΚΟ, ΣΥΓΚΛΟΝΙΣΤΙΚΟ!!!"}, {"userName": "Kim", "userReviewDate": "Jan 21, 2008", "userURL": "http://www.goodreads.com/user/show/520753-kim", "userReview": "This is why I don't read the front jacket of books. I get sucked in thinking 'wow--this makes a good story'. Hmphf.Okay, it's not a bad story. It had its moments. But, it lost me when it started twisting fairy tales to be all sorts of clever. Snow White as a hefty, insult laden uber wench? yeah. whatever.The story outside of these sidebars is actually quite interesting, a boy's journey in a strange land, grieving over his dead mom, etc... but I still found myself wondering what those dudes that did the Narnia films could make out of it. Maybe using that kid that Johnny Depp is so fond of. Because I spent a chunk of the book thinking like this, and not being consumed by the writing, I'll go with 2 stars."}, {"userName": "Rachel", "userReviewDate": "Dec 21, 2007", "userURL": "http://www.goodreads.com/user/show/324861-rachel", "userReview": "I picked this up blindly and bought it from the description on the book jacket alone. I wish I'd liked it more; rather, I wish it'd been better-executed. My main trouble was with the telling-not-showing style of writing. In the words of Twain, \"Don’t say 'the old lady screamed.' Bring her on and let her scream.\" The turbulence of David's inner life ends up muffled by the flat and dispassionate narrative (\"He experienced a wave of pity for the dead man...\", \"He was still angry at God for what had happened to his mother, and for bringing Rose and Georgie into his life\"). Connolly may have been trying for \"once-upon-a-time\" fairy-tale remove, but only undercuts what could've been a really heartbreaking and harrowing journey.The twisted fairy tale elements of the book are indeed pretty clever -- the seven dwarfs as Marxist proletarians, hee -- but did we need the massive and pretentious index at the end? Sure, I was interested to (re-)read the source material, but the prefatory paragraphs, overexplaining how the material is incorporated into the narrative, are insufferable -- worse than those headsets you can clap on at art museums. Again, don't tell me how adept you are. Show me. And shut up."}, {"userName": "Crystal Craig", "userReviewDate": "Sep 29, 2015", "userURL": "http://www.goodreads.com/user/show/4729956-crystal-craig", "userReview": "I've owned a paper copy of The Book of Lost Things for a very long time. I obtained a copy - probably at a yard sale or some used bookstore - long before I first joined Goodreads back in 2008. I don't understand why I never got to reading this book; I'm punching myself in the face because I waited so long to discover such a fantastic book. The writer, John Connolly quickly pulls the reader into the make believe place he created. I felt an immediate connection to the main character, 12-year-old, David. This book is pure fantasy and reads like a fairy tale, so if you don't enjoy fantasy, it's probably not the novel for you. The writing is well done, and, therefore, one of many reasons I recommend it."}], "description": "High in his attic bedroom, twelve-year-old David mourns the death of his mother, with only the books on his shelf for company. But those books have begun to whisper to him in the darkness. Angry and alone, he takes refuge in his imagination and soon finds that reality and fantasy have begun to meld. While his family falls apart around him, David is violently propelled into a world that is a strange reflection of his own -- populated by heroes and monsters and ruled by a faded king who keeps his secrets in a mysterious book, The Book of Lost Things.Taking readers on a vivid journey through the loss of innocence into adulthood and beyond, New York Times bestselling author John Connolly tells a dark and compelling tale that reminds us of the enduring power of stories in our lives.", "title": "The Book of Lost Things", "url": "https://www.goodreads.com/book/show/69136.The_Book_of_Lost_Things", "average": 3.99, "cover": "https://images.gr-assets.com/books/1388253367l/69136.jpg", "reviews": 6918, "authors": [{"url": "https://www.goodreads.com/author/show/38951.John_Connolly", "name": "John Connolly"}], "type": ["Fantasy", "Fiction", "Young Adult", "Horror", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/69136.The_Book_of_Lost_Things", "http://www.goodreads.com/book/show/16114143", "http://www.goodreads.com/book/show/494610.The_Book_of_Lost_Things", "http://www.goodreads.com/book/show/10291890-the-book-of-lost-things", "http://www.goodreads.com/book/show/905559.The_Book_of_Lost_Things", "http://www.goodreads.com/book/show/175242.Every_Dead_Thing", "http://www.goodreads.com/book/show/175246.The_Killing_Kind", "http://www.goodreads.com/book/show/6411440-the-gates", "http://www.goodreads.com/book/show/175243.Dark_Hollow", "http://www.goodreads.com/book/show/175247.The_Unquiet", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}