{"ratings": 1319, "userreviews": [{"userName": "Teresa in Ohio ", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/2182384-teresa-in-ohio", "userReview": "somewhere between 3.5 and 4. This is very much chic lit, a fast fluffy read or a book to take to occupy a couple of hours. This book probably won't remain in memory for long or hit the top ten lists but it is a good read anyways. Amy and Linnie are sisters, but there is all they have in common. Linnie was declared a genius at age 6 and quickly left childhood behind while Amy was the popular fun sister. Years go by and they grow further away from each other. That is until Grammy decides they need to make up, so with a little meddling from her they enter a baking contest. Only problem is they don't know how to bake and don't forget they don't get along. There are some LOL moments along the way, some heart breaking moments and good pie at the end of the book"}, {"userName": "BJ", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/4690460-bj", "userReview": "\"The Bake-Off\" was a fun read, as are most by this author. This is the story of 2 sisters, Linnie and Amy. Linnie was a child prodigy gone \"bad\" and Amy is a dental hygienist, wife, and mother of twins. They have been long estranged for many reasons, but they have a sneaky grandma who tricks them into doing a pie-baking contest together to try to make them into BFFs. The problem, in addition to the fact that they don't get along is that neither one can bake! Its a comedy of errors with some maturing and growing up in the background. It's a story of family, especially sisters, baking, and a little romance. Enjoyable read."}, {"userName": "Amy Hayes", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/2619922-amy-hayes", "userReview": "Loved all the characters in this story. They were flawed and realistic. Loved Grammy Syl’s treachery and how she manipulated the situations to further her plans. Loved the baking part too and the competition, which is so relevant in today’s world of culinary competitions."}, {"userName": "Christy", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/3924412-christy", "userReview": "Cute & fun. Liked the sister chemistry & looooved the baking aspect. (Obsessed w baking shows). Did not care about the romance at all oop. Also I imagined Ty & Tai as Alison Brie & Rich Sommer HA."}, {"userName": "Brian", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/854699-brian", "userReview": "This book started off good and got progressively more predictable and chick lit like. THe premise is two sisters who havent' talked. One sister was married, the other was a former childhood genius and is socially awkward and therefore single. Both were likeable characters. When the smart one loses her grandmother's brooch in a mishap, she and her estranged sister enter a bake off (hence the title). My issue with the book was the predictability, as well as the trashyness of it. THis was a very very quick, very light read that leaves you feeling light and wasted afterward. I do however want to say that the recipes sound yummy."}, {"userName": "Scottsdale Public Library", "userReviewDate": "Jun 20, 2011", "userURL": "http://www.goodreads.com/user/show/4332892-scottsdale-public-library", "userReview": "After just a few minutes of listening to Beth Kendrick speak, I knew I had to read this book. The dialogue in The Bake-Off is as biting and witty as Kendrick is in person. Meet Linnie and Amy, two estranged sisters who both need cash for very different reasons. Their wise and all knowing grandmother cons them into entering a baking competition where the prize is $100,000. The only complication, neither sister knows how to bake. This is a fun and funny light read, perfect for that beach vacation! Bonus: Recipes!--Lindsay A.--"}, {"userName": "Alexandra", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/5607149-alexandra", "userReview": "This novel is a fast read including two sisters with a rift between them. At first glance they appear as polar opposites. But with their scheming grandmother, a famous baking competition, and a steamy stranger, these sisters find out they are more alike than they thought."}, {"userName": "Liz", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/4668740-liz", "userReview": "A light and enjoyable read. As this is a short book there's not a lot of time for development of side characters, but despite that the characters are engaging and the story entertaining. I enjoyed it and would suggest it as a nice, quick, and fun summer beach read."}, {"userName": "Anji Beane", "userReviewDate": "Mar 09, 2011", "userURL": "http://www.goodreads.com/user/show/3999795-anji-beane", "userReview": "Won as a GoodReads first read... Can't wait to read it!"}, {"userName": "Ann", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/3119697-ann", "userReview": "Run-of-the-mill chick lit about two sisters, one an outgoing wife-and-mother, the other a socially awkward former prodigy, who are tricked by their grandmother into joining a baking competition. The two young women squabble, go to social events (one with gusto, the other dragging her feet) and bake (one by instinct, the other with scientific precision) and get to know their competitors. And of course the socially awkward sister meets a man.Standard fare, nothing original ."}, {"userName": "Kristy Oman", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/43558234-kristy-oman", "userReview": "This is a prime book to be made into a Hallmark movie. Not a bad thing, just a buyer beware caveat. I started reading it on my lunch break at work and finished it before bedtime the same day in two sittings. Something light and quick to pick up for a flight or maybe a beach vacation."}, {"userName": "Kate  Maxwell", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/4442123-kate-maxwell", "userReview": "Interesting start to a book - one that I hadn't seen before. This cute book about a meddling grandmother, trying to get her granddaughters together by forcing them to participate in a baking contest. Outlandish characters abound."}, {"userName": "Rachel Rogers", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/299912-rachel-rogers", "userReview": "Honestly couldn't get through this. Too chick-litty for me. I have enjoyed the Black Dog Bay series books but this one delved into awkward family situations and I wasn't enjoying it. Really too bad since I was looking forward to reading it, on loan through the library system."}, {"userName": "Deb", "userReviewDate": "Apr 23, 2015", "userURL": "http://www.goodreads.com/user/show/21045303-deb", "userReview": "You know, there are times I want to read a book that is just 'fun'. One that I'm not supposed to get a lesson from or learn how to do anything. Just a good time. This was one of those books for me. I read it and enjoyed it thoroughly."}, {"userName": "Cyndi", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/6933423-cyndi", "userReview": "It was a good book but started off very very slow."}, {"userName": "Haley Hartley", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/6444712-haley-hartley", "userReview": "It was a cute, light, fluff of a read."}, {"userName": "Bree White", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/2822033-bree-white", "userReview": "Fun and quick read. Didn't want to put it down."}, {"userName": "Julie", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/52755647-julie", "userReview": "Book"}, {"userName": "Michelle", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/30730530-michelle", "userReview": "3.5Fun, Fast read."}, {"userName": "Danielle", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/2637089-danielle", "userReview": "Two sisters, one a genius from birth and the other a social diva, brought together after years apart to pull of the baking competition of a life-time but can they win? In an effort to reclaim stolen property Linnie will do just about anything, including reconcile her past and set aside her differences with Amy. Unfortunately for Linnie her social awkwardness is almost more than her sister Amy can deal with. Throw in conniving competition, a time-honored family pie, a gorgeous wealthy hotel owner and you’ve got the recipe for a perfect disaster or perhaps a spectacular story.This truly was such a fun read. It had all the enjoyable elements that make a great Chick Lit book fantastic. From a sisterhood rivalry to a romantic rendezvous with a gorgeous but very intelligent leading man to a wonderful variety of locations, the entire book was the perfect read for a great getaway afternoon. One of the things I absolutely adore is when a book can make a food theme work and Beth Kendrick truly does. It’s not because it’s the focal point, but more of a setting or feeling that runs through the pages of the book. As if you could smell the baking pies coming from the pages of the book much the way you do when you smell a baking pie in your home, you know it’s there baking away but you’re not mixing the ingredients together. Perfectly done!In addition to the food related aspects of the book being well done, I thought the relationship between Amy and Linnie was just the right mix of believable. Linnie grew up a tested genius and was driven from competition to competition until she entered college at fourteen. After the abrupt end to her college career only one year later she decides to quite the “genius role” and ends up dealing blackjack in Vegas until she’s nearly 30. Amy on the other hand has lived a relatively normal life with the exception of performing in a rock band in college, is now married with two children and is a dental hygienist. Obviously, I related a bit more to Amy being that she’s a mom and still has trouble playing the balancing act that comes with that territory, but still loved both characters. Linnie’s neurotic behavior though is what really propels the story and the dynamic between the two. Her constant checking of logistics and weighing of statistical probabilities is a constant thorn in Amy’s side, but proves to pay off in the end not only for the baking competition but the sister’s relationship as well.Though I related to Amy much better, it was Linnie’s story that remained the primary focal point of the story which in a way is kind of ironic. Amy always hated the focus that was placed on Linnie because of her genius abilities, but Linnie resented her sister’s freedom. In the end it was Linnie who needed to break away and become the person she had been stifling herself against for years. Much of this was aided through her complex relationship with Cam, the handsome hotel owner who unexpectedly sweeps her off her feet. I loved their interaction and how it helped Linnie to let down her guard, becoming a more relaxed version of herself.The Bake-Off by Beth Kendrick is the perfect summer read! If you’re a Chick Lit fan who may also indulge in the occasional baking competition show on TLC, loves a great sister story or just simply loves to be swept off your feet than you need to pick up The Bake-Off. It’s not necessarily a book that’s going to have you rethinking your life or making major changes, but it was certainly the perfect getaway read. Knowing now that I loved this story so much and also being aware that Kendrick has written several other novels, I’m making my way to my bookstore to pick up a few of her other books for just the right time.Originally reviewed and copyrighted at Chick Lit Reviews."}, {"userName": "Moonshadow1900", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/44242761-moonshadow1900", "userReview": "I like her work. This was a little sad."}, {"userName": "Meg", "userReviewDate": "Mar 15, 2011", "userURL": "http://www.goodreads.com/user/show/3423663-meg", "userReview": "Beth Kendrick’s The Bake-Off is a sweet, fun and entertaining look at family, love and the perfect pastry. Kendrick immediately drew me into the Bialeks’ world with tales of Linnie’s unfulfilling life in Vegas and Amy’s frazzled days in Connecticut. Each woman was sympathetic, colorful, interesting — a fully fleshed-out and compelling character. I could sense the discord between them — anyone could, of course — but there was something tangible beneath the surface: love. And a sense that they wanted to repair what was broken between them . . . but didn’t know how.Enter Grammy Syl. What a lovable, hilarious woman — and a devoted matriarch of their family. Syl’s undying hope that her granddaughters would reunite is endearing even when it seems ill-advised, and I could definitely imagine a determined grandmother scheming to bring her family back together in just this way. It seems like the tension between Amy and Linnie is insurmountable, but is it? I didn’t want to think so. Kendrick does a wonderful job of making the issues real without overwhelming us with drama.In fact, for a novel about a baking competition, the drama was anything but cheesy; it was fun. After the sisters arrive to make with the famous szarlotka, their competition is willing to do anything for a cut of the $100,000 grand prize. Tai and Ty Tottenham are The Bake-Off’s villains — a husband and wife duo not averse to sabotage. Watching Linnie and Amy navigate around them was very amusing.At the heart of the story, though, is the apple pie that brings the girls together — and my mouth was watering at descriptions of the perfect crust and tart filling. Amy and Linnie’s relationship progressed beautifully and left me feeling tender and warmhearted for my own sibling, and I think that’s what Kendrick would want. Though I wasn’t a huge fan of the love story that developed partway through, it didn’t bother me much. My eye was on that pie.Fans of women’s fiction, foodie fiction and novels about sisters will delight in Kendrick’s descriptions, vivid characters and fast-paced, hilarious dialogue. A book that often had me laughing aloud — and wiping away a tear at points. Recommended."}, {"userName": "Jlaurenmc", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/2766565-jlaurenmc", "userReview": "Beth Kendrick's The Bake-Off is the novel equivalent of the show Food Network Challenge. However, instead of only seeing food contestants in the midst of a food challenge, Kendrick brings us up close and personal inside the lives of two contestants: estranged sisters Amy and Linnie.When their Grammy Syl cooks up a plot to get the two of them in the same city for the first time in years, both sisters hesitate. After all, anything they do together ends up terribly. Linnie, once a child prodigy who entered college at 16, threw it all away after one semester. Amy, a dental hygienist at her husband's dental practice and mother of twin toddlers, lost herself long ago to diapers and laundry. Linnie has never even met Amy's children; they organize family get-togethers around one another's schedules to avoid being in the same place at the same time.Szarlotka, via FlickrBut Linnie needs money, and Amy needs excitement. So the two end up as partners in the Delicious Duet baking contest, a dessert challenge in which the winners receive $100,000. Initially, neither sister can bake. In fact, they are somewhat of a disaster in the kitchen. But armed with Grammy's szarlotka recipe (and after several days of baking boot camp thanks to Grammy), they actually begin to stand a chance at winning.The Bake-Off is a fast and fun read, especially if you are both a reader and a foodie. I could watch Food Network 24 hours a day, and you know how much I love to read. So the two combined together is a nice treat. The characters are likeable, the plot fun, and Kendrick even includes recipes! Read an excerpt of The Bake-Off on Kendrick's website.Kendrick is also the author of several other novels, including My Favorite Mistake, Exes and Ohs, and Second Time Around. She also contributed to the nonfiction book Everything I Need to Know About Being a Girl I Learned From Judy Blume, which makes her a girl after my own heart. I grew up reading Blume, and I love everything she's ever written."}, {"userName": "Jenn O'Brien", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/2054052-jenn-o-brien", "userReview": "For as many flaws as there are with this story, I really did like it. It was really funny and I loved the quirkiness of the two sisters. The genius, brainy sister reminded me a lot of the Temperance Brennan character from the TV show “Bones\". She is so busy being analytical and taking things literally that she doesn’t see when she is socially inept.I liked how the author delved into the completely different personalities and lifestyles of the two sisters. We learn early on that there was a huge rift between the two of them and hadn’t talked or interacted in years. I had a little bit of a hard that time that almost immediately after being thrown into the baking competition they bonded and started getting along and never discussed what had happened. One thing I couldn’t figure out is that the brainy sister had lost all her money in a poker game and had entered the competition to win the prize money. And yet she flew from Las Vegas to New York twice before the competition, and then once for the competition, the sisters are sleeping in a luxury suite that is a couple thousand dollars a night, the sisters take a last minute flight roundtrip flight to Vegas (super pricey) and she buys an expensive gift -- where the heck is all this money coming from??I wished the story told more about the contestants in the baking competition. We are introduced to several other characters through the books but then they fall through the sifter and you never find out anything than a surface knowledge. I thought it would be fun to find out that the “villains” were actually misunderstood and it was another contestant all along that was setting them up to take the fall."}, {"userName": "Kristy", "userReviewDate": "Apr 10, 2011", "userURL": "http://www.goodreads.com/user/show/2450583-kristy", "userReview": "I was skeptical of the book at first, and then about midway through the book, I could not put it down! I loved how Kendrick started off with setting the plot and then sucked you in, wanting more. This book was comparable to a soap opera you just didn't want to end! I loved the relationship between Linnie and Amy, how they went from being the sisters who were more rivals then friends; to being two women who resolved their issues, and more importantly their bond that they once had. In many ways it reminded me of that special attachment that I have with my own sister, and how when we are together there is never a dull moment. Linnie and Amy reminded me of us in many ways. It made the story even better when the author threw the crazy old grandmother, and the casanova boyfriend into the picture. I hope at some point there will be a sequel! Here are a couple of the quotes that I liked:\" When Linnie arrived at Cam McMillan's pent house she had two uncomfortable realizations\". 1. \" The sales tag was still attached to her underwear and digging into her hip\".2. \" She had no idea what she was going to say when he opened the door\" p.207 (I think everyone goes through those moments when they first like a guy)\"We stick together and get things done. If anyone has a problem with that then let them eat cake\" (that is a very infamous tag line and it seemed appropriate considering the title of the novel)"}, {"userName": "Michelle", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/5861493-michelle", "userReview": "Two sisters with a great deal of past resentments are brought together through the scheming of their grandmother and their own separate agendas. Linnie is the analytical one and is a former child prodigy who is now working a casino table in Vegas. When the antique broach of her grandmother is stolen and pawned, she must come up with the money to get it back without her grandmother knowing. Amy was a former wild girl, now settled in the suburbs with husband and children. She longs for the artistic recognition that she never had. Their grandmother Syl brings them together with the lure of a baking competition that she has entered with her friend for many years that has a $100,000 prize and television coverage. She offers her secret apple pie (szarlotka) recipe in order to cement the deal and connives to make the sisters take on the competition. We follow the sisters as they try to figure out how to bake and present and see the seamy underbelly of the cooking competition world as well as some of the more positive aspects. An unanticipated romance and some downright evil competition help the sisters move closer together. The end has some unexpected twists, but comes together well, like the sister's complementary talents bring to their version of the apple pie."}, {"userName": "Brenda", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/1251264-brenda", "userReview": "I love to cook and bake and I also love to read! So when I read the summary for The Bake-Off I was anxious to get my hands on a copy. I’ve enjoyed several culinary-related mysteries but this one was a bit different as there’s no real mystery involved (well, there is a side story with some rival contestants). The story is about two sisters who are tricked by their grandmother into entering a baking competition with hopes that it will end their long-standing rivalry. Both are reluctant to go as neither knows how to bake, however the need for the prize money by one sister and the desire by the other to escape her life with two young children for a few days, means they both end up together where they face the truth about who they were and who they have become and eventually, the issues surrounding the cause of their rivalry decades before. While parts of the story are somewhat predictable, this is a very enjoyable, light read that will have you cheering for both sisters in the end! Beth Kendrick's style is easy to read and humorous at times. She's found a new fan in me. And the extra bonus? The recipe for their baked entry, The Secret Sisterhood Szarlotka (apple pie) is included in the book. Great summer (or anytime) read!"}, {"userName": "Margaret", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/10549695-margaret", "userReview": "Two sisters estranged. Linnie, the younger sister is both the pretty one and the smart one. Amy, used to being second-best, is just the cute one. Although Amy adored her baby sister when she first arrived, it became apparent that Linnie was the special child. At two years of age, Linnie was reading on her own and her academic achievements just kept going. By the time she was 14, she was enrolling in college to become a medical doctor; but she needs her sister's help and commits an act of betrayal that has strained their relationship over the years. A much-loved, but conniving grandmother has grown tired of the feud between her granddaughters and devises a plan to settle things once and for all. When the girls find themselves as a duo in a baking contest, they either have to get along or go their separate ways. The fun begins. I enjoyed this light, fun read even though the plot was pretty predictable. The characters were funny and likeable and I could certainly relate to their lack of baking talent! Laugh out loud fun is good."}, {"userName": "Beth Peninger", "userReviewDate": "Feb 19, 2012", "userURL": "http://www.goodreads.com/user/show/4850999-beth-peninger", "userReview": "The Bake-Off caught eye on the shelf because of it's cover art and the premise of the book - I love me some baking!Amy and Linnie are estranged sisters in all the ways you can be estranged - physically (distance), mentally, and emotionally. Linnie's genius IQ has interferred too much in Amy's life and Linnie's IQ keeps her at arm's length from everyone. In this book Linnie is in desperate need of money and Amy can't say \"no\" to her Grandma so the two sisters are thrown together in Grandma's attempt to reconcile them before she passes on - enter the Bake-Off. It's a totally unrealistic plot, stuff like this would never happen - like the sisters success in the baking world, etc. Without spoiling the story I can't say much more. While completely unrealistic the story still held my attention enough for me to breeze right through the book - as a friend would say the book falls into the catagory of \"junk food for the mind.\" It's a pleasant enough read that will distract you from anything heavy weighing you down."}, {"userName": "Julia ", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/363451-julia", "userReview": "Sisters Amy and Linnie are brought together by their crafty Grammy Syl, in an attempt on her part for them to bury the hatchet and be a part of each others' lives. Sounds easy enough, but neither sister is a baker and Grammy has entered them in a National Baking Contest, using her Polish Apple Pie recipe. Linnie needs the prize money and Amy's time away from her family may help her see a new career path. Their situation grew from differences in their childhood and it's great to see them begin to appreciate each other as adults. What I really liked, however, was Kendrick's handling of the Baking Contest itself. From the descriptions of the rules, runners to the pantry and the mock cooking areas set up for each set of contestants, I felt I was learning a lot about this cutthroat world. The baking world is not without its' own rivalries, multi-year participants and scandals, and these made for some interesting parts of the story."}], "description": "Suburban soccer mom Amy has always wanted to stand out from the crowd. Former child prodigy Linnie just wants to fit in. The two sisters have been estranged for years, but thanks to a series of personal crises and their wily grandmother, they've teamed up to enter a national bake-off in the hopes of winning some serious cash. Armed with the top-secret recipe for Grammy's apple pie, they should be unstoppable. Sure, neither one of them has ever baked anything more complicated than brownie mix, but it's just pie-how hard could it be?", "title": "The Bake-Off", "url": "https://www.goodreads.com/book/show/9742309-the-bake-off", "average": 3.62, "cover": "https://images.gr-assets.com/books/1436733879l/9742309.jpg", "reviews": 171, "authors": [{"url": "https://www.goodreads.com/author/show/21197.Beth_Kendrick", "name": "Beth Kendrick"}], "type": ["Womens Fiction", "Fiction", "Romance", "Contemporary", "Food and Drink"], "outlinks": ["http://www.goodreads.com/book/show/9742309-the-bake-off", "http://www.goodreads.com/book/show/11330693-the-bake-off", "http://www.goodreads.com/book/show/7056660-second-time-around", "http://www.goodreads.com/book/show/18667977-cure-for-the-common-breakup", "http://www.goodreads.com/book/show/317159.Nearlyweds", "http://www.goodreads.com/book/show/1132997.Exes_and_Ohs", "http://www.goodreads.com/book/show/12196871-the-lucky-dog-matchmaking-service", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}