{"ratings": 316, "userreviews": [{"userName": "Mentai", "userReviewDate": "Oct 31, 2015", "userURL": "http://www.goodreads.com/user/show/22613597-mentai", "userReview": "I'm giving this five stars for its commitment to justice for the Roma in central and eastern Europe, for LeBor's incredibly well researched content (from history of Nazi money to Euro politics), and for its intrigue, which kept me reading. The blurb says it's set in Nazi-occupied Budapest, and while that era continues to haunt the protagonist and the city (not to mention the racism present in Hungary today), the vast majority of the book is set in the present and revolves around a set of journalists at an English language newspaper who are trying to report on a powerful rightwing upsurge in European Union politics. I will not make any further connections but if you have an interest in Europe this is a very interesting book that is not just fiction. (there's a bibliography at the back and I fact checked many of the things mentioned and they do unfortunately exist. LeBor was an investigative journalist.)There's a love interest back story that could have been worse than it was and although I don't think writing women is his strength, even so-called resilient, strong women who are active in the story, I'm willing to forgive him this flaw."}, {"userName": "Ian Brydon", "userReviewDate": "Aug 21, 2015", "userURL": "http://www.goodreads.com/user/show/28014642-ian-brydon", "userReview": "This was one of those serendipitous discoveries. I had never heard of this novel, or its author Adam LeBor, and came across it entirely by chance, spotting it in the middle of a list of recommendations thrown up by Amazon. Being a reckless sort of chap at heart I threw caution to the wind and stumped up the necessary 99 pence with scarcely a moment's hesitation, and found myself reaping heavy dividends.The encomia cited in the publisher's blurb compared it to le Carre at his finest. I am not sure that is really true. That is not a judgement on its quality but it operates in a wholly different milieu to le Carre. To my mind it was more like Charles Cumming or with shades of upper-end Alistair MacLean thrown in.Alex Farkas is a British journalist living in Budapest, where his family had originally come from, and working on an English language weekly newspaper. As the novel opens Budapest is the scene of the first stage of campaigning for elections for the European Presidency, and the two leading candidates are in Hungary to outline their respective manifestos. One of the candidates is an Austrian academic, known for his right wings views and in particular some injudicious comments about the numbers of immigrants seeking entry into the European Union, and dismissive remarks about the Gypsy and Roma communities located around the eastern fringes of the EU.While the candidates are pursuing their respective campaigns, the fragile coalition in Hungary teeters beyond sustainability, and a bloodless constitutional coup sees a new, far right government taking over. Meanwhile, Alex and his colleagues hear alarming stories about strange goings-on among Hungary's own Roma community.LeBor (himself a journalist) manages all the threads of the story adroitly, with fascinating insight into the workings of a foreign news agency. All in all, a very enjoyable and engaging read."}, {"userName": "Btetlow", "userReviewDate": "Feb 05, 2011", "userURL": "http://www.goodreads.com/user/show/4930856-btetlow", "userReview": "A well written and engaging book. Biased maybe because I loved Budapest.A great and very realistic tale that is so relevant to the workings of todays world. A great reminder of our duties as citizens and that just because we have democracy doesn't mean we can sit back and trust everything will be OK.Journalists cum writers always have a unique perspective of world events, and Adam LeBor has captured the tale of a realistic alternative future."}, {"userName": "Chris Ioannou", "userReviewDate": "Jul 30, 2014", "userURL": "http://www.goodreads.com/user/show/33475186-chris-ioannou", "userReview": "Although it took me a few tries to get in to this due to other commitments, as soon as I had the time to read this I struggled to put the damn book down! Liked the idea and concept of the story. Even if perhaps a little predictable, still had me on the edge of my seat at the climax!I think something like this could make a great TV series."}, {"userName": "Marcia Ditter", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/67117384-marcia-ditter", "userReview": "I came across this book one day while looking for books on my Nook.It is about Budapest during WWII and the persecution of the Jews and it is about current time and the persecution of the Romas.Instead of taking over by war, a group of people have a plan to take over financially, by use of the internet, sterilization of people they consider to be inferior."}, {"userName": "Ben Marshall", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/57734130-ben-marshall", "userReview": "I found this book quite a struggle due to the nature of the writing. The story itself was very predictable and I found the writing very boring. Everything every character says is just so cliched and has been done a thousand times before. Its a pity as the subject matter is rather interesting."}, {"userName": "Ric Parks", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/23517082-ric-parks", "userReview": "If you're visiting Budapest, this is a good read to get a feel for cultural and political forces and some good suggestions for food and coffee. Otherwise there are probably better thrillers to spend your time with."}, {"userName": "Annemiek Smedinga", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/66347960-annemiek-smedinga", "userReview": "Spannend tot het eind.goed verhaal."}, {"userName": "Donald Schopflocher", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/9911544-donald-schopflocher", "userReview": "Timely but very clunky thriller partially redeemed by detailed Budapest settings and history."}, {"userName": "Giuseppe", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/25792056-giuseppe", "userReview": "The premisses are interesting, but the book is poorly written with characters that aren't intriguing and unable to make the reader to be interested in them. The only thing worth is the accurate description of how Fascism has widespread in Central-East Europe post Communism and the corruption in those countries. Also the discrimination of Roma minorities is credible, but the EU as a Nazi creation is typical of the worst Brexiters propaganda. Germany has generate antibodies to nazi-fascism, that have contributed to the creation of the European Union."}, {"userName": "Andrew Brown", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/21906246-andrew-brown", "userReview": "I think the idea of this story is devastating, especially if true!..however it doesn't really work as a fictional recounting of what might be real history.There are too many coincidences along the way to get the hero to the hotel...and coincidences are a weak story hook.The main problem I have though is that if this is real history, how are we ever going to be free again? I voted against us staying in the Common Market back in 1975 and to think now that it is the '4th Reich' makes me realize that those of us who voted 'No' in that Referendum were right.I've only given it 1 star because of the writing, but really this story is the most important of our times.. the giving up of our freedom to the unelected bureaucrats of a corrupt system dedicated over the last 70 years to getting rid of democracy and creating a very subtle system of slave labour based on the 'free movement of peoples' within the EU, which means a lowering of living standards in all the countries of the EU and only enriches the organization itself, hiding behind it's opaque glass walls; it's unaccountable officials enriching themselves with their enormous pensions and expense account living, like the Gauleiters of old.Adam Lebor should write the real history of this loathsome organisation."}, {"userName": "Tony Calder", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/7348006-tony-calder", "userReview": "Adam LeBor has a keen interest in the financial side of the Third Reich - he has written some history books on the subject - and that interest is clearly on show in this novel. The novel is generally well-written, and the characters are believable. For the first two thirds of the book. The final third, however, is a different story. The plot starts to require more suspension of disbelief than I could give, and several of the characters start making decisions that are highly unlikely. And the final resolution is a pretty big deus ex machina. The appendices provided are quite interesting."}, {"userName": "Mark", "userReviewDate": "Jul 17, 2015", "userURL": "http://www.goodreads.com/user/show/10948030-mark", "userReview": "Part Dan Brown style thriller, part financial history of the Third Reich, The Budapest Protocol fell between the cracks of both. It dragged a bit too much to be a gripping thriller, and muddied the waters too much between fact and fiction to be a solid study of Nazi politics and resurrection. Worth a read but could have been better."}, {"userName": "Olivia", "userReviewDate": "Jun 17, 2014", "userURL": "http://www.goodreads.com/user/show/2445786-olivia", "userReview": "From the first sentence on it's clear that this author usually writes non fiction. The style is dry and factual and doesn't read like a novel. This bothered me and made it unable for me to really get into the story. The story is simple: there's a nazi plot to control Europe financially even after they've lost the war."}, {"userName": "Stephen", "userReviewDate": "Oct 21, 2011", "userURL": "http://www.goodreads.com/user/show/4412069-stephen", "userReview": "dark political thriller based in modern day hungary and based around a nazi plot to control europe by financial means after losing ww2 and this plan was devised in Budapest and when alex finds his grandfather has been murdered this is the journey in to the dark side of politics and people's hatred well worth reading"}, {"userName": "Judie", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/11974453-judie", "userReview": "A good read from a non-fiction writer. The book was very interesting as it is a combination of fact and fiction which I always enjoy. The locale, being Hungary, is different and immigration policies as well as the Roma populations are presently in the news throughout the EU. I'll definitely read more by Adam LeBor."}, {"userName": "Jörn Dinkla", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/21675687-j-rn-dinkla", "userReview": "Germans are too stupid to found a company with an international name in a county other than germany? they can't. bribe a hungarian politician with a hungarian name, instead they bribe a guy called Sanzlerman? This book is so far from reality ..."}, {"userName": "Glenn Altman", "userReviewDate": "Jul 03, 2016", "userURL": "http://www.goodreads.com/user/show/23079051-glenn-altman", "userReview": "A frightening story\"If you can imagine it, someone is out there trying to do it.\"That is what makes this book so scary. Taking the basic rights of citizens away for the purpose of increased power for the benefit of the few is hair raising."}, {"userName": "Ola", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/11205726-ola", "userReview": "I didn't like \"The Budapest Protocol\" at all. I found it very naive and predictable, with \"twists\" that were far too obvious. Characters are not well developed, conversations between them are unnatural. The book is just one big, boring cliche."}, {"userName": "Tânia Girão", "userReviewDate": "Sep 07, 2016", "userURL": "http://www.goodreads.com/user/show/6549655-t-nia-gir-o", "userReview": "Amazing story, that take us to a 1944 Budapest and Budapest from today, a political thriller that Almost make us want to believe in conspiracy theories, mostly because it's somehow based in real facts."}, {"userName": "Boris Feldman", "userReviewDate": "Apr 29, 2013", "userURL": "http://www.goodreads.com/user/show/6370810-boris-feldman", "userReview": "Couldn't finish it.He is a successful non-fiction author who does not possess the literary skills necessary to write a novel."}, {"userName": "Lucy", "userReviewDate": "Aug 31, 2014", "userURL": "http://www.goodreads.com/user/show/10533809-lucy", "userReview": "A compelling political thriller with a diabolical conspiracy. Loved it."}, {"userName": "Grahambootle", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/3981808-grahambootle", "userReview": "plodding and predictable. major plot holes. awful dialogue. motorcycles being reversed into things! not read a book this bad for a long time"}, {"userName": "Vítor Gomes", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/8647176-v-tor-gomes", "userReview": "Uma ficção política aterradoramente credível e a jogar às escondidas com a Europa que temos. Recomendo"}, {"userName": "Graeme Thomson", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/41255694-graeme-thomson", "userReview": "based on an interesting premise and fairly readable but my interest seemed to have begun and ended with the settings."}, {"userName": "Donna Irwin", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/4026997-donna-irwin", "userReview": "A well plotted suspense novel that was a bit too realistic in aces!"}], "description": "\"If this novel was a handbag, it would be a black Chanel--beautifully made, perfect for every occasion and just a little old-fashioned (in a good way).\"--\"The Times\" (London)\"A first class political thriller.\"--Alan FurstSet in Nazi-occupied Hungary in the winter of 1944 and present-day Budapest as the election campaign for the new president of Europe begins, Adam LeBor reveals a deadly web of intrigue and power play, a game played for the highest stakes: the very future of Europe. Based on genuine US Intelligence documents, this powerful, controversial, and thought-provoking thriller journeys into Europe's hidden heart of darkness.", "title": "The Budapest Protocol", "url": "https://www.goodreads.com/book/show/6628682-the-budapest-protocol", "average": 3.46, "cover": "https://images.gr-assets.com/books/1328692758l/6628682.jpg", "reviews": 28, "authors": [{"url": "https://www.goodreads.com/author/show/33151.Adam_LeBor", "name": "Adam LeBor"}], "type": ["Fiction", "Historical", "War", "War", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/6628682-the-budapest-protocol", "http://www.goodreads.com/book/show/20572351-the-budapest-protocol", "http://www.goodreads.com/book/show/16017960-het-boedapest-protocol", "http://www.goodreads.com/book/show/12132696-budapest-protocol", "http://www.goodreads.com/book/show/801248.City_of_Oranges", "http://www.goodreads.com/book/show/15843114-tower-of-basel", "http://www.goodreads.com/book/show/16248180-the-geneva-option", "http://www.goodreads.com/book/show/801247.Milosevic", "http://www.goodreads.com/book/show/138223.Complicity_with_Evil", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}