{"ratings": 191, "userreviews": [{"userName": "Daniel Swensen", "userReviewDate": "Jan 23, 2012", "userURL": "http://www.goodreads.com/user/show/679746-daniel-swensen", "userReview": "Liked it, didn't love it. I think it's competently written. The plot is solid and the characters fairly well-realized -- but it felt to me like a romance novel with some steampunk elements shoehorned in. Granted, those steampunk elements are finely detailed and fun, but they were few and far between compared to the protagonist mooning over the boy she loves, but does she love her? And oh, he's from a wealthy family and they could never be together because she's a mere shopgirl, and his family are all classist snobs, but wait... There's nothing wrong with that story, but it's just not my thing. Based on the jacket copy, I was hoping for a bit more conspiracy and mystery. In truth, it really felt like a footnote to Petra's romantic angst. To be fair, the ending did set up a lot of promise for the next volume, so I may give the sequel a shot."}, {"userName": "Eoghann Irving", "userReviewDate": "Dec 21, 2014", "userURL": "http://www.goodreads.com/user/show/1135979-eoghann-irving", "userReview": "Okay so this is a slightly unusual situation. I'm reviewing a book that won't be published until 2015, but it was published when I bought it. That's because the author self-published and then subsequently sold the book and a sequel to a major publisher.That explanation out of the way let's talk about The Clockwork Giant by Brooke Johnson. It's a Young Adult novel with a steampunk setting and a heavy emphasis on romance. So this isn't going to be to everyone's tastes. But I think you should judge stories based on what they are aiming to be, not some universal constant ideal.Tick TockWhile the genre is steampunk the real emphasis in this story is on clockwork. There are other technologies certainly but the central character Petra loves clockwork and the author does a great job both of showing that fascination and of making a rather dry and technical subject matter interesting to the reader.That's not easy to do when you consider that the vast majority of those readers won't know most of the terms that the characters use when talking about building or fixing clockwork items. There's a real danger with scenes of that sort that people will just zone out or lose interest completely.Johnson finds a good balance here, giving the technical details necessary both for plot and atmosphere while not actually bogging the story down with them.When And Where?We're never explicitly told when The Clockwork Giant is set. Though we do know that it is in Britain and if you combine the various references to Luddites and a number of historical figures you could probably narrow it down fairly well. We are told enough though to have a good feeling for where in the timestream this all happens.By chosing to set this in the fictional Chroniker City, Johnson avoids some of the issues that writers can get bogged down in when using real locations. On the other hand, she can't rely on anyone's familiarity in order to set the feel of the place.And that does hurt the story a bit I think. After reading it, I really can't tell you what the place was supposed to be like. In my head it really just consists of a small handful of locations that I can't quite connect together.Looking To The Future From The PastSteampunk is a strange sub-genre. It's a branch of science fiction that usually (though not exclusively) makes use of alternate history to give us a world full of giant steam powered machines and other Victorian era stylings.Like much science fiction steampunk is generally quite interested in technology, but this is not technology that we are likely to ever see invented, being as it usually is made of metal and powered by steam. So one of the appeals is clearly a mythical past. The Victorian era is visually and mentally quite appealing so long as you don't actually have to live there.Because the other side of this setting that authors usually struggle with is that socially it is pretty backwards (by the standards of the 21st century). So we do tend to get a lot of plucky heroines who refuse to fit into society's rigid codes. Done right you can get some insightful commentary on todays society. Done wrong you just get bludgeoned over the head with how horrible people were to women.I'm not sure that The Clockwork Giant really gives us much in the way of social commentary. But I'm also fairly sure it wasn't trying to. Petra's social limitations are definitely a driver for the plot, but they aren't allowed to dominate it. And indeed her interest in becoming an engineer is essentially a selfish one of the sort you might expect a young person to have. She shows no real interest in reforming anything.Plucky, Petulant, PetraWhich brings me quite nicely to our heroine. She is the sole viewpoint character for the story so her attitude very much colors everything we see. And I must say I found her a quite believable if at times annoying protagonist. Again, keep in mind this is aimed at the Young Adult audience and I am clearly outside the core demographic.Petra is brave, impulsive and clever but also a bit willful and self-obsessed. All fairly normal characteristics for a young protagonist really. There were a few places where I found her sulking and flouncing rather annoying, but most of the time it was easy enough to root for her.Ewww Kissing!There is a lot of romance in this novel. It's easily the dominant mode. Petra spends most of her time either irritated by, mooning over or kissing Emmerich. I would personally probably have enjoyed it more if the ratio of action to romance was a little more even. But that is just personal preference.The romance as presented is solidly done. Emmerich comes across as the sort of person Petra could easily fall for so it is reasonably believable. Or as much as one of these \"romance across social boundaries\" type of plots can be.Where I think the romance element really hurt things though was that Emmerich is really the only other character in the book to get developed. The rest of the supporting cast are in truth little more than ciphers. Even the jealous suitor/childhood friend comes across as a collection of plot necessary characteristics. So much time is spent building the romance that the rest get very short shrift.Which is a shame because I think developing them further would have given the world considerably more depth to it, at least in my head. And there are little hints that the characters have more going on in their lives. They just never get the chance to share any of it.Young Adult RomanceSo assuming you can enjoy Young Adult Romance, this book would be worth your time. If you could buy it, which you can't right now but will be able to again next year. While steampunk flavors it heavily that probably wouldn't be enough on its own for people who don't enjoy romance stories.However if you look at what the book is trying to do and who its (presumably) intended audience is, this is solid to good. It's considerably better in fact than a significant portion of published YA material."}, {"userName": "Louise", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/2450538-louise", "userReview": "Juvenile writing and plotting. You'd think a book about a woman engineer trying to infiltrate an all-male engineering Guild would appeal to me, but while the premise was good, the dialog read like fan fiction and the plot was both predictable and unbelievable. For how smart Petra is supposed to be, she makes a bunch of stupid decisions."}, {"userName": "Maria", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/2745176-maria", "userReview": "I received a complimentary copy of this book as a part of a book tour for a fair and honest review. I rated this 4 out of 5 Stars.A steampunk novel set in the early 1860’s, The Brass Giant by Brooke Johnson is an enjoyable mid length story with colorful characters, sharp dialogue, a bit of mystery and a touch of romance. While a book dealing with mechanics and machinery, Ms. Johnson creates a world that is fairly easy to understand, even for those of us not mechanically inclined. In addition Ms. Johnson tackles some of society’s issues of the time: poverty, the lack of women’s rights and quality education being denied to the poor. If you’re looking for something a little different in your historical reading, you’re going to want to give this book a try.Naturally intelligent and mechanically gifted, Petra Wade wants nothing more than to be an engineer and become a member of “The Guild”, something denied to her due to the misfortune of being born a girl. Donning a disguise, dressed as a man and using her brother’s first name, Petra attempts to bluff her way into the university but is unable to enroll due to a lack of money and lack of a transcript. Continuing to work as a shop girl, Petra works on any machine she can get her hands on and refuses to give up on her dream. Especially after she meets Emmerich Goss, a new member of “The Guild” who recognizes her from her attempt to gain entrance into the university, who needs help designing a new clockwork for a top-secret automaton and turns to Petra for help. Ms. Johnson does a good job developing both Petra and Emmerich’s characters right from the start. I was able to connect with both characters and understood Petra’s anger at the injustice of being denied an education and “career” as an engineer due to her gender. Ms. Johnson also does a good job showing how the class separation and financial struggles of the day kept many gifted people from being able to pursue their dreams. The friendship and mutual respect that grows between Petra and Emmerich is based on their shared interests and a desire for self-improvement. They in essence fell for each other’s brain first.The secondary characters are well developed and made some very interesting contributions to the story. I especially liked Mr. Sticket, Petra’s boss at the shop, who was also her secret teacher and who believed in Petra’s talent. While “The Guild” was originally presented as the villain, as it were, of the story, it turns out that there are several different factions at play and most of them don’t have good intentions.Will Petra be able to help Emmerich design the clockwork required for the new automaton? Will their budding romance get in the way of Petra realizing her dreams? You’ll have to read The Brass Giant to find out. I enjoyed it and look forward to reading the next book in this series."}, {"userName": "Fred Hughes", "userReviewDate": "Mar 01, 2012", "userURL": "http://www.goodreads.com/user/show/7119280-fred-hughes", "userReview": "Not much steampunk in this steampunk story.Lots of girl power and romance, sort of.It didn't hold my attention so I gave up."}, {"userName": "Darby Karchut", "userReviewDate": "Nov 28, 2011", "userURL": "http://www.goodreads.com/user/show/4359524-darby-karchut", "userReview": "A solid debut novel - this author knows how to write, let me tell you. Full review coming soon!"}, {"userName": "C.J. Milbrandt", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/25866638-c-j-milbrandt", "userReview": "Petra wants nothing more than to join the Guild and become a full-fledged engineer. But girls aren't welcome. Even so, she's learned from a kindly shopkeeper. And there's no doubt she has a knack for machinery, especially the delicacy of clockwork. Then she meets a Guild student who's willing to work with her. But will Emmerich simply take her designs and claim them as his own? Beautiful world-building. I found Petra's work with timepieces and music boxes fascinating, and the steam and grime of the under-city captured my imagination. But then things got much too swoony for my tastes. Lots of stuttering hearts, tingling lips, lingering touches, and earnest declarations. None of which really contributed to either the plot or any kind of character development. Not bad storytelling, but the romance leans too heavily on cliches."}, {"userName": "Marlene", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/7001837-marlene", "userReview": "Originally published at Reading RealityThe story outline is a familiar one, but the steampunk setting changes up some of the elements in some very interesting ways.The plot is simple – underprivileged girl with big dreams meets highly privileged guy who will help her realize her dreams, but only if she helps him with super-secret project. This is a society where no one believes that women have intelligence or capability, so no one important will suspect she is really helping him. And of course they fall in love, and get caught, not necessarily in that order, and discover that the entire enterprise is much more serious, and much, much more dangerous, than they ever imagined.Add in one final element – that underprivileged girl is an orphan, who turns out to be the heir of someone very, very special.The steampunk setting gives us somewhat of a time and place reference. Chroniker City is definitely in England (that turns out to be important later) and it is a university town like Oxford or Cambridge. It isn’t London, because London is referred to as the capitol far away.As steampunk, The Brass Giant is set in a quasi-Victorian era. There is a queen on the throne, and some of the historical worthies who have their portraits in the great hall are familiar, most notably Charles Babbage, inventor of the difference engine that evolved into computers in our world.In the late Victorian era, England was playing what has been called “The Great Game”, an undercover war of diplomacy and proxies. In the Chroniker City world, their main rival seems to be France instead of Russia. But then again, Britain and France were perpetual rivals, from the point where Henry II and his wife Eleanor of Aquitaine ruled England in 1154 until well after the end of the Napoleonic Wars of the early 1800s. This was a conflict that never seemed to end.Petra Wade is an orphan. She works as a shop girl in a pawnshop, and has learned how to be a fantastically good practical engineer with the help of the clockmaker who co-owns the shop. More than anything else, she wants to become a Guild Engineer, but that dream is forbidden. Guild Engineers must graduate from the University, and women are allowed in neither the University nor the Guild.But Petra wants more than her life is mapped out to be. In spite of constant humiliation, she pursues her dream, even attempting to enter the University pretending to be male. All she faces is more and more embarrassment.Until one young Guild Engineer, Emmerich Goss, discovers her talent. He needs her help to build a giant automaton. It’s a top secret project for the Guild, and he can’t enlist the aid of anyone they might suspect. The project is so secret that it is treason for Emmerich to reveal it. So of course he does.Petra is good at clockworks, and Emmerich has invented a remote control mechanism. Together, they create a marvel. Only to discover that someone plans to use their great invention to start a war. And that Emmerich is forced to save Petra’s life by condemning her as a traitor.They say you always hurt the one you love. Emmerich finds that true in more ways than one.Escape Rating B: This is fun steampunk. While there is a romance between Petra and Emmerich, it is very sweet and almost innocent for most of the book. Petra falls in love for the first time because Emmerich both shares her interests and treats her as an equal. Emmerich loves her brilliance and her dedication. They are good together.One of the plot twists in the story is that the orphaned Petra is the daughter of the city’s founder and first engineer, Lady Adelaide Chroniker. Which both makes Petra kind of a secret princess and puts the lie to the current Guild malarkey that only men can become engineers.The way that Petra and Emmerich find each other, and all the political secrets they get stuck dealing with, along with Petra’s lineage, reminded me more than a bit of Marissa Meyer’s Cinder. (The original version of The Brass Giant came out before Cinder was published, so this is an interesting coincidence that just shows that great plots can come out of the same seed with no knowledge of each other).While I like Petra as the heroine a lot, she is also an example of the plucky heroine who always “knows” that she doesn’t belong in the place where tragedy has dropped her.On that other hand, one of the characters who seemed a bit too bad to be true was her childhood friend Tolly. Although they were clearly playmates as little children, when they grew up Tolly became an overbearing bully who spouted the same filth and degradation about women as his father, and then blamed Petra for not choosing him over Emmerich. The scene where Tolly attempts to beat and rape Petra into compliance, blaming her for his thuggery, came out a bit too much like a modern-day Men’s Rights Activist. He’ll give Petra everything she ought to want if she’ll just give in, and he’ll beat her until she admits that he’s right and it’s all her fault he has to beat her.The plot that Petra and Emmerich find themselves caught in the middle of is suitably politically underhanded. Someone wants to start a war, and is looking for plausible causes and convenient scapegoats. The way that Petra and Emmerich try to either escape the evil clutches or foil the plot has many hair-raising moments, but is ultimately unsuccessful in the main. The small victories give Petra and Emmerich (and their readers) hope for the future..They will live to fight another day. I’m looking forward to reading their further adventures."}, {"userName": "Jo  (Mixed Book Bag)", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/1372248-jo-mixed-book-bag", "userReview": "Brooke Johnson lives where I do and I met her when she was doing a signing at our local Barnes and Nobel. That lead to a invitation to our Science Fiction book club. We had a great visit. It was such fun hearing about how she got the publishing contract (It was an open invitation with over 4000 submissions and she was one of 12 selected). It was also great having our question answered. Since this story features teens we wondered why it was not marketed as YA. Publishers choice was the answer. We did talk a lot about the story with the women liking the romance part more than the men. It was a great one on one. There is second book out with a third in progress so maybe we can get Brooke back again."}, {"userName": "Meagan Myhren-bennett", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/5477348-meagan-myhren-bennett", "userReview": "The Brass GiantA Chroniker City StoryBy Brooke JohnsonPetra Wade wants to be a engineer with the Guild. But she is a girl and as such is not allowed to enter the Guild. But Petra knows that she belongs in the Guild, she feels it in her very being. If only she could convince the members of the Guild that she has the skills needed to earn her a place within its walls.But Petra doesn't know who she is, she's one of the victims of the Guild fire, she lost her family and her heritage. Her days are spent working as a shop girl cleaning and tinkering with damaged clocks and similar small machines.But when she sees a young engineer showing off his automaton, she can't help pointing out its flaws. Her knowledge and critique convince Emmerich Goss that he needs Petra's assistance if he is to perfect his automaton within the time frame he has been given. But accepting Emmerich's offered chance will put them both in danger. And if caught the charge is treason with a possible sentence of execution. But something about Emmerich and the chance to create an automaton is worth the risk. More than her life is at stake if she's not careful, she could lose her heart. But there is a faction that is determined to change the world forever and Petra's work with Emmerich is about to become the catalyst that will decide the fate of the world. Who can be trusted? And who is manipulating the Guild? Discovering the truth may be Petra and Emmerich's only hope.The Brass Giant is an exciting and entertaining story. Fans of Steampunk, Romance, Alternate Histories, Mysteries, or just Fiction in general will find much to love in this book.I was provided a digital loan of this book in exchange for my honest review, but I enjoyed this book so much I purchased a copy so that I could read it again at a later date. I, for one, hope to read more Chroniker City stories in the not too distant future."}, {"userName": "Beverly McClure", "userReviewDate": "Jan 07, 2012", "userURL": "http://www.goodreads.com/user/show/1725962-beverly-mcclure", "userReview": "Are you fascinated with machinery? Do gears intrigue you? Or are you like me, and your eyes glaze over when anyone talks about mechanics because you don’t understand how they work? Whichever category describes you, you’ll learn a lot about machinery from Author Brooke Johnson’s debut novel The Clockwork Giant. Ms. Johnson explains in simple language that even I can understand the details of the project that our heroine, Petra Wade, and the university student and boy she comes to like, Emmerich Goss, are building. We travel back in time to 1860s England, a time when girls had few rights and Petra’s dream of being an engineer was just that - only a dream. She’s an orphan and lives in the slums. She sweeps the pawn shop, until one day, she meets Emmerich, and her life changes forever. They team up to build an automaton that might possibly save the world, or else destroy it. If she is discovered working with him, Emmerich will be marked for treason and Petra for death. The Clockwork Giant is a story of mystery, determination, and love between a boy and girl from different backgrounds. Will they succeed in making the world a better place in which to live, or will The Guild stop them?It took me awhile to get into the story, but once I did, I couldn’t stop reading. The Clockwork Giant introduced me to a period in history that I wasn’t familiar with. The ending left me wanting to know more. The good news is that Petra and Emmerich‘s story will continue. The next book in The Chroniker City Series will be out in the winter of 2012. I’m looking forward to learning what happens next. Can our heroine overcome the obstacles that await her and Emmerich? Ms. Johnson’s book would make a good addition to high school libraries where students could experience a time in history quite different from the one they live in. EBook courtesy of the author###"}, {"userName": "Carrie Mansfield ", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/4883725-carrie-mansfield", "userReview": "Provided by publisher in exchange for fair review. Review will be crossposted to my blog on May 4The Brass Giant, first published in 2011 under the title The Clockwork Giant, is a short and sweet novel about a girl named Petra who wants to be an engineer, a desire thwarted by the fact that she was born female. Trying to sneak into university, she catches the eye of Emmerich Goss who realizes her inborn talent and comes to her for help with his secret project. There's a lot to like in this book: unlike other books where the protagonist happens to deus-ex-machina her way into a learning institution she otherwise couldn't get into, she can't. At the end of the book, when she does get her wish fulfilled, it's decidedly a bittersweet victory and the circumstances surrounding are hardly what would you call ideal. The budding romance builds up at a pace that makes sense and I enjoy the fact that it's a match of minds as much of anything else. I could have done with the jealous non-boyfriend, and I wish there was more to the Luddites hatred of the Guild. While we can personally see why the Guild is bad, there's nothing in what we see in the day-to-day life that would indicate the kind of corruption they suggest. While more rounded it out than most novels of this length (sub-200 pages) this is one area in which it was lacking.Reviewing the author's Goodreads page, there is a novella due to be republished in June and a third book (length unknown) due in September. I do hope the third book is of a longer length so this world can truly be fleshed out. This was a good read, and I'd like to see what the author could do given the space to do so."}, {"userName": "Monica", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/3402653-monica", "userReview": "This was my first time going into reading anything steampunk and i really loved the details in this story. The book is set in 1881 but with amazing clockwork and very advanced technology but still a sense of being in the past. I love the mix of technology and old timey aspects to this book. Brooke takes you into the world of Chroniker City and as you read you can visualize everything and have it be such an amazing notion in your mind you wish it was real. In The Clockwork Giant you get brought into the world of Petra Wade. She is a girl but isn't allowed to be an engineer which is the dream of a lifetime for her. She has taught herself how to be a clockwork engineer with the help of her employer. The sexist views of the Guild only allow males to study at the institution and she has to find a way in. I love the way she tries to get into the guild its such a simple way but just how she tries to pull it off is adorable. When Petra meets Emmerich Goss her world gets turned upside down when he offers to pay her to help him on a top secret project that no one is supposed to know about. But he can see in her the real potential and clockwork ingenuity that he might be lacking. After they are tasked to build a clockwork giant, things go awry and Petra has some tough decisions to make and so does Emmerich. This book is amazing, and I think I've fallen in love with steampunk. It really pulls you into the past, but has semi futuristic aspects that is just amazing. It has love, mystery and amazing technology. Definitely a good read and I definitely want to read the next in the series!review here: http://www.onceuponatwilight.com/2012..."}, {"userName": "Once Upon a Twilight", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/3515991-once-upon-a-twilight", "userReview": "This was my first time going into reading anything steampunk and i really loved the details in this story. The book is set in 1881 but with amazing clockwork and very advanced technology but still a sense of being in the past. I love the mix of technology and old timey aspects to this book. Brooke takes you into the world of Chroniker City and as you read you can visualize everything and have it be such an amazing notion in your mind you wish it was real. In The Clockwork Giant you get brought into the world of Petra Wade. She is a girl but isn't allowed to be an engineer which is the dream of a lifetime for her. She has taught herself how to be a clockwork engineer with the help of her employer. The sexist views of the Guild only allow males to study at the institution and she has to find a way in. I love the way she tries to get into the guild its such a simple way but just how she tries to pull it off is adorable. When Petra meets Emmerich Goss her world gets turned upside down when he offers to pay her to help him on a top secret project that no one is supposed to know about. But he can see in her the real potential and clockwork ingenuity that he might be lacking. After they are tasked to build a clockwork giant, things go awry and Petra has some tough decisions to make and so does Emmerich. This book is amazing, and I think I've fallen in love with steampunk. It really pulls you into the past, but has semi futuristic aspects that is just amazing. It has love, mystery and amazing technology. Definitely a good read and I definitely want to read the next in the series!review link: http://www.onceuponatwilight.com/2012..."}, {"userName": "Katy Sauer", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/23404833-katy-sauer", "userReview": "All of my reviews can be seen @ http://gloriouspanic.wordpress.com/We started out learning about Petra and how much she wants to become an engineer. The society she lives in is sexist and operates under a heavy caste system. The poor don’t get ahead, especially if they happen to be women. The way women are treated isn’t glossed over in the least. Because it’s all coming from the perspective of someone in the position – I think it’s easier to relate to her. I instantly felt for her because of this. She has this dream and passion and will do anything to fulfill it. Then all of the action starts taking place but it felt like it quickly got drowned out by this very intense romantic interlude. I don’t mind romance but this relationship felt a bit over the top. There were instances that seemed so elaborate and drawn out it would actually push me out of the story entirely. I wanted more of the action, more of the Petra who had a strong passion for engineering. I didn’t mind that she fell in love but it almost felt like she began putting her passion more into her new love interest than the engineering. The steampunk themes were very well detailed through out the book and I appreciated the glossary at the end. In the way that the movie Titanic is more about a romance happening on a sinking ship, I felt this was more a romance happening in an older steampunk society that happened to have some series conflict going on. If you really like young adult romance I think this would be a book for you to enjoy.Disclosure: I received this free from the publisher in exchange for an honest review."}, {"userName": "JD Estrada", "userReviewDate": "Sep 26, 2015", "userURL": "http://www.goodreads.com/user/show/22368367-jd-estrada", "userReview": "I really wanted to like this book. For the longest time I'd been looking to dabble into a steampunk book. I followed Brooke Johnson on social media, enjoyed her shares, and after an interview I read I definitely wanted to give her a shot. As I'd understood it, this was a steampunk book with some elements of romance. As I found out, this was a romance book with some elements of steampunk. Again, I really wanted to like this book and every time Johnson dove deep into mechanics, engineering, and elements of fiction, I was able to start to enjoy, but it didn't last long because I found myself going back to copper eyes, a dimple smile, and lots of yearning of all sorts. It's not so much that I dislike romance, it's just that my expectations were way off for what I ended up reading and that was a little frustrating. Imagine you see a trailer for a movie promising robots, fiction, and intense action and then finding yourself with the Notebook. It was a tough read for me because I held hope that some twist would surprise me up to the end, yet for me, it never happened. Am I saying that no one will enjoy this book? Not at all. I'm just saying that if romance is not your cup of tea, take heed. If you're expecting something where fiction and action take center stage, then the same. If on the other hand you enjoy fiction to have a good dose of romance, elements of engineering, and some action, then by all means, give this a shot. For me however, it wasn't my cup of tea, and that's Ok too."}, {"userName": "Jessica Hansen", "userReviewDate": "May 27, 2015", "userURL": "http://www.goodreads.com/user/show/4691966-jessica-hansen", "userReview": "Metal & Mystery!Will you look at that! My 2nd steam punk style book in a week....and I am addicted, for sure. Jumping straight into this book was a challenge, not only was I coming directly off another steam punk book, but this book also had a determined leading female. Petra wants so much out of life that it hurts. She knows she's got the talent to hang with these upper class inventors, but within the settings of The Brass Giant she can't exactly do that. After plenty of trying she finally finds her out, or should I say \"in\", with Emmerich. The dynamic between these 2 was very well thought out. Not only were they complete opposites, but they were opposites that completed each other's faults, or what the other was lacking. Emmerich felt truly genuine to me, he did want Petra to succeed...but there were times when I wondered if he wanted it more. Overall the end vibe of this book was amazing! Each plot came together, the bad \"people\" threw me for a loop. I'm happy to say that I can see this series going far. Petra & Emmerich will be one of those famous series couples you'll need to watch out for, because their story will either end happily or in heart break."}, {"userName": "Chris", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/12217227-chris", "userReview": "Petra Wade, a young woman working in a pawn shop fixing 'tickers'. Her sole dream in life was to go to University, become an engineer and join the Guild. She even goes so far as to dress in her brothers clothes and try to register at University however her ruse is detected and she's turned away. On her slow walk that day back to the pawn shop to work she sees something that changes her life. A group of young engineers walking along and one has an automaton that is following him and doing his commands. Petra makes it a point to examine the automaton and meets the young man, Emmerich, whom she astounds with her knowledge of engineering. Emmerich is so amazed by what she knows that he makes it a point to ask her to assist him in finishing the automaton and fixing some of the problems that it has. I'll leave the rest of what happens to you, the reader of this excellent book, to find out as I did. This kept me up late a few nights reading just one more page or just to the end of the chapter. If you're like me and like Steampunk this is one book you need to read in my opinion. I'm looking forward to more of the Chroniker City tales."}, {"userName": "Kay Solo", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/2115834-kay-solo", "userReview": "I would have finished this book sooner if I had the time; already I was reading it in class and on the bus when I probably should have been reading things for school. Whoops.This was a solid steampunk book. It's clear the author did her research, and it wasn't just a few elements here and there -- it was the whole thing. It was just what I wanted and needed.I will say that there is a heavy romantic element to this book I did not expect. It didn't necessarily detract from my experience, but I'm not typically much of a romance reader. Since it takes such a dominant role in the book, that might be something to consider when picking it up.That all said, it was well written with solid pacing and storytelling, a few mysterious subplots here and there, and a variety of interesting, distinct characters. There were also many loose ends tied up at the end, but a few left tantalizingly open-ended to encourage you to move on to the next book. At least for me, it worked. If you're looking to pick up a good steampunk series, I'd recommend this one for sure."}, {"userName": "Mari Stroud", "userReviewDate": "Dec 20, 2011", "userURL": "http://www.goodreads.com/user/show/5098854-mari-stroud", "userReview": "This book is delightful! I'm fairly well-read in YA, but I don't read much in the way of steampunk; however, I loved this. The plot zips along, the world-building is rich and detailed without becoming overwhelming, and Johnson does a great job of constructing a heroine that pings with a modern audience without losing sight of the very different social mores that a proper Victorian young lady would be expected to follow. Petra is a fun, proactive protagonist that had me rooting for her the whole way, and Emmerich would have drawn many a swoon from me when I was thirteen. I wanted to take him by the lapels and shake him a bit when it was all said and done, but in a generally benevolent way: he's capable of being better. Can't wait to see where Johnson goes with this series next."}, {"userName": "Nancy", "userReviewDate": "Nov 07, 2015", "userURL": "http://www.goodreads.com/user/show/970459-nancy", "userReview": "Bold, confident writing introduces Petra Wade a shop girl, who dreams of being an engineer in a wonderfully complex steampunk Great Britain where only men may enroll in the University. Her natural talent brings her to the attention of Emmerich Goss, a young engineer, who enlists her help in constructing a secret project for the Guild. Petra soon becomes entangled in a web of lies, politics, and espionage. Johnson’s skill in describing machines and how they work is incredible, but she is equally adept at writing tenderly realistic love scenes. Add in brilliant cover art and this book has something for everyone!"}, {"userName": "Kathy Collier ", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/3678717-kathy-collier", "userReview": "I loved this book. This is the first time I've ever read Steampunk. Brooke takes you into a world where an orphan struggles in an era where women didn't go to college to be an engineer for clockworks. She had training through with a clock repair man in a pawn shop. There she was discovered by a young man in need of her assistance while he worked on his final design for graduation. The story is magnificently done, and very well-written, lots of unexpeceted twists and turns. A girls real struggle in a world dominated by men, and her drive to do what was right. I see this making a movie for sure someday. It may even become a classic someday."}, {"userName": "Angela Brown", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/6124777-angela-brown", "userReview": "The Clockwork Giant is the first book in the Chroniker City series. After reading the first book, I'm eager and anxious for the next book.Brooke has me hooked.She's created a heroine in Petra that readers can't help but admire. She's strong and witty. Her intelligence? Well, let me not get carried away. Don't want to put out any spoilers.It's definitely a steampunk novel with technology at its core, and the romantic relationship between Petra and Emmerich adds a layer of steam so thick, it's intoxicating.I basked in each page, suspended in Chroniker City, 1881, adoring each scene as they unfolded.The Clockwork Giant is a MUST READ!"}, {"userName": "Shandi", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/7083309-shandi", "userReview": "My favorite books are those that combine a bit of mystery, a touch of suspense, a lot of fantasy, and a smidgen of not too over the top romance. The Clockwork Giant has all of that and more. I love the unexpected twists, the sweet, ambitious Petra, and the entire set of Chroniker City. The way Brooke describes her world makes it easy to imagine yourself walking the streets smelling the fuel of the undercity and seeing the fantastical clockworks. I'm a fast reader, but I even surprised myself when I first finished this book in a day. We all know that's the sign of a great book! I'm anxiously awaiting book 2 of the series!!!"}, {"userName": "Eduardo Suastegui", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/30766058-eduardo-suastegui", "userReview": "Overall I found this a compelling read penned by the hand of a talented, highly imaginative writer. You will find lots of vibrantly drawn steam punk goodness alongside emotion and romance.The Brass Giant certainly lives up to the expectations of steampunk fans, thanks to the world and details that Johnson ably portrays in her narrative. But the story also incorporates a strong—and I should say, at times predominant—romance component, along with political intrigue and a message against war and those who would seek to profit from it...Read my full review..."}, {"userName": "PopcornReads", "userReviewDate": "Feb 26, 2012", "userURL": "http://www.goodreads.com/user/show/5725748-popcornreads", "userReview": "Book Giveaway & Review: When Brooke Johnson approached me about reviewing her YA steampunk novel, The Clockwork Giant, I was immediately drawn to the concept. I’m a sucker for steampunk and strong female protagonists, and I couldn’t help asking myself why someone would build a giant. At the time, I was solidly booked with reviews, but Brooke is very patient and I’m glad because this novel was well worth the wait. Not only do I get to share it with you but she’s provided a copy that you can enter to win! Read the rest of my review and enter our giveaway at http://popcornreads.com/?p=3344."}, {"userName": "Nathan Garrison", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/27876000-nathan-garrison", "userReview": "This delightful tale follows a young girl who wants nothing more than to be an engineer in a world that tells her she can't. You can't help be cheer her on as she puts her genius to work in secret, building things no one else alive can. Although the emphasis on the romance was a little strong for my tastes, the story was still engaging, full of twists and surprises and marvelous feats of engineering. This is sure to appeal to those who like their steampunk steamy (but still clean!)."}, {"userName": "David Riehl", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/33329150-david-riehl", "userReview": "All I've got to say is I loved this book! The storyline and the characters were really enjoyable. And the story was described in vivid detail that you can almost picture it in your head. I highly recommend that you give this book a read. The next book after this is The Mechanical Theater, which I will buy and start reading sometime soon."}, {"userName": "Erin", "userReviewDate": "Mar 26, 2012", "userURL": "http://www.goodreads.com/user/show/8018994-erin", "userReview": "A very fun read in an awesome world. Gripping and exciting, I am very excited for the next book to come out to find out what happens to Petra. As a female engineer myself, I identified with Petra and loved reading about her struggles in a male dominated profession. A very good and satisfying read, plus steampunk is Awesome!"}, {"userName": "Rosie Reast", "userReviewDate": "Mar 15, 2015", "userURL": "http://www.goodreads.com/user/show/28883910-rosie-reast", "userReview": "Wonderful book, I love the world of Chroniker City and can't wait to find out more about the city and the world it inhabits. There was one part where we got a glimpse of life below the city very cool. Brooke Johnson has a gift of explaining complicated engineering in a way anyone can understand.Very enjoyable book and I look forward to reading the next book. :)"}], "description": "Sometimes, even the most unlikely person can change the worldSeventeen-year-old Petra Wade, self-taught clockwork engineer, wants nothing more than to become a certified member of the Guild, an impossible dream for a lowly shop girl. Still, she refuses to give up, tinkering with any machine she can get her hands on, in between working and babysitting her foster siblings. When Emmerich Goss—handsome, privileged, and newly recruited into the Guild—needs help designing a new clockwork system for a top-secret automaton, it seems Petra has finally found the opportunity she’s been waiting for. But if her involvement on the project is discovered, Emmerich will be marked for treason, and a far more dire fate would await Petra.Working together in secret, they build the clockwork giant, but as the deadline for its completion nears, Petra discovers a sinister conspiracy from within the Guild council … and their automaton is just the beginning.", "title": "The Brass Giant\n      \n          (Chroniker City #1)", "url": "https://www.goodreads.com/book/show/22836684-the-brass-giant", "average": 3.72, "cover": "https://images.gr-assets.com/books/1425669108l/22836684.jpg", "reviews": 67, "authors": [{"url": "https://www.goodreads.com/author/show/5320239.Brooke_Johnson", "name": "Brooke Johnson"}], "type": ["Science Fiction", "Fantasy", "Science Fiction", "Young Adult", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/22836684-the-brass-giant", "http://www.goodreads.com/book/show/13091545-the-clockwork-giant", "http://www.goodreads.com/book/show/25817362-the-brass-giant", "http://www.goodreads.com/book/show/13260244-the-clockwork-giant", "http://www.goodreads.com/book/show/25477210-the-brass-giant", "http://www.goodreads.com/book/show/22895363-the-mechanical-theater", "http://www.goodreads.com/book/show/24331493-the-guild-conspiracy"]}