{"ratings": 299, "userreviews": [{"userName": "Faye", "userReviewDate": "Apr 28, 2012", "userURL": "http://www.goodreads.com/user/show/6215055-faye", "userReview": "Rating: 4.5Lucie, (My Mom)'s Review:A story about how it's never too late to make the right choice. Vivian, the youngest of the Sinclair sisters comes to Cripple Creek to join her three sisters and to flee her past. But what starts out so innocently turns into a bigger mess than Vivian could have imagined. Each step making it harder to make the right choice. There is also the sheriff, Carter Alwyn, what will he think when he finds out about her secrets? Third in the Brides of Cripple Creek series, fans of the series will be happy to finally read about the youngest Sinclair sister. While it is not absolutely necessary that you read the first two books first, I believe that it would be extremely helpful. I read the first book, so I knew about two of the sisters, but I haven't read the second book yet, so I had some catching up to do!There were times that I will honestly say that this book was difficult to read, when Vivian kept making more and more bad choices. I just wanted to be able to tell her, \"No, please don't do that!\" But this story had a surprisingly powerful message, that no matter how many mistakes she made, and the harder it got to get out, she still had a choice, and she could always turn to the Lord. One of the side stories that I really appreciated was the one of Nell (one of the sisters from the first book) and her husband, who wanted children, but it just wasn't happening for them. But of course, if you want to know what happens you'll have to read and find out :)Overall this was a terrific read! I loved how it updated me on the former characters, yet introduced new ones. This was a pretty riveting read considering how I read this book in less than one day, in a 4 hour sitting, to be more exact! And I will most certainly be picking up the second book as soon as can. The Bride Wore Blue is a book I would happily recommend, it is definitely a book that sticks with you long after the last page is turned down.I received this book from the publisher in return for and honest review."}, {"userName": "Paula-O", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/3327000-paula-o", "userReview": "The Sinclair Sisters of Cripple Creek Series by Mona Hodgson book #3\"The Bride Wore Blue\"This is the story of the \"Baby\" of the family Vivian, a young woman with a will of her own and tired of being referred to as the youngest.Vivian has made some mistakes in her life and feels she is unworthy and not \"up-to\" standards of her older sisters. The sisters had came from Maine to Cripple Creek in Colorado and now there will be a reunion as sister #3 arrives to join them. In books 1&2 we saw the sisters find worthy mates and marry and settle into their lives as good upstanding citizens.This unworthy feeling gets her into a lot of trouble as you will see when you read the book. Vivian seems to go from bad to worse as she tries to find a job to support herself in Cripple Creek. She did not want to come to this small town-she wanted to be with her dad in France and pursue a career of fashion designer- from a young age she had liked to sketch and was very good at it. When she meets the sheriff's deputy Carter Alwyn she is determined she will not get close to this man. Men are not to be trusted in her estimation.Carter a deputy sheriff feels his job lets him bring justice when there is a wrong and he remembers his dad saving a young woman who had been kidnapped that no one else wanted to help because she came from the seedier side of life-namely a prostitute. He feels he has to stay single to protect a woman from living married to a man taking chances and possibly getting killed leaving her alone. He first meets and sees Vivian as a sweet young innocent woman and is so dissappointed when he finds out how she has lied and has so many secrets about her life in Cripple Creek...Can he forgive her and get back that \"good feeling\" he had when he met her.Mona has her job cut out for her in this book. Read and learn how by the Grace of God these two young people make amends and learn to live again -there is forgivness and Grace if you take the time to notice as the family is reunited at the end of story.I was given this book by WaterBrook Multinoman Publishing Grp for an honest review and I loved reading and doing so..."}, {"userName": "Romancing the Book", "userReviewDate": "Feb 22, 2014", "userURL": "http://www.goodreads.com/user/show/5328566-romancing-the-book", "userReview": "Reviewed by AngieBook provided by a GoodReads contest winReview originally posted at Romancing the BookThe Bride Wore Blue is an inspirational story of an 18 year old girl named Vivian who’s made some mistakes and is desperate for a new start. Unwanted by her father in Paris, Vivian sets off for Cripple Creek, Colorado with her Aunt to reunite with her sisters.First and foremost, I NEED to get my hands on the first two books in this series. I didn’t check when I asked to read this book so I’m unfamiliar with the family. While you could read this on it’s own, I think it’s probably best to read the whole series.This is such a heartwarming novel about forgiveness – forgiving yourself, having others forgive you, and accepting God’s forgiveness. It’s also about love {sisterly love, friendly love, and God’s unconditional and ever abiding love} and acceptance. The messages are unmistakable; told in a gentle way.Vivian is stronger than she thinks and is probably my favorite of the sisters; yes, I know, I’ve only read this one, but you somewhat get to know the personalities of the other sisters and I have to say that I identify with her wholeheartedly.Even the secondary characters come alive and worm their way into your hearts. You don’t learn everything about Carter’s past, but enough to know the demons he’s fighting.I love how understated the love between all couples was, but you knew just how very, very much everyone genuinely loved each other. I highly recommend this series to anyone!"}, {"userName": "Brandi", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/3888591-brandi", "userReview": "I really loved this book. I read it as a stand-alone novel, without having read the first two books, and I didn't miss a beat. Mona Hodgson has a lot to offer as a writer.Disclaimer: I received this book from Waterbrook Multnomah through its Blogging for Books program in exchange for an honest review."}, {"userName": "Tawny", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/1001935-tawny", "userReview": "Favorite lines:1. \"Sitting in the front pew doesn't make you closer to God\" (p. 248).2. \"God doesn't list sins from the worst down to the slightest and judge a person accordingly. Only people do that\" (p. 251)."}, {"userName": "Vera Godley", "userReviewDate": "Aug 10, 2012", "userURL": "http://www.goodreads.com/user/show/6214962-vera-godley", "userReview": "Book 3 in the Sinclair Sisters of Cripple Creek series opens with Vivian, the youngest of the Sinclair sisters and the only one not yet married, traveling with her aunt to Cripple Creek where her sisters await.About the book: At last, the sisters are reunited! The youngest Sinclair, the family“ baby”, is moving from Maine to Cripple Creek, Colorado and joining Kat, Nell, and Ida. But Vivian is a young woman with a will of her own, and made some decisions back in Portland that have begun to haunt her. Will she be able to live up to the expectations of her three perfect and now happily-settled sisters?The sisters warmly welcome Vivian to the mountain west, but the wild-and-woolly mining town isn’t ripe with opportunities for a respectable young woman. The youngest Sinclair sister is determined to make her own way, so when she’s offered a job as a hostess in a sporting house, she takes it, thinking the position is appropriate for a tainted, unlovable woman like herself. Although she’s convinced she’ll never be asked to entertain privately, Vivian keeps her employment a secret from her sisters, knowing they’d be mortified—as will Carter Alwyn, the kind and godly sheriff ’s deputy who’s sweet on her.Vivian is descending into a life of secrets, lying to the very people who love her and could help her heal from her mistakes. Will an outpouring of grace remind her that she is still God’s beloved and that her past can be washed as clean as Rocky Mountain snow?My thoughts: This is a very enjoyable read of the American West in 1867. Cripple Creek is a small western town with limited prospects for employment and yet Vivian wants to be able to stand on her own two feet and begin working as a designer of ladies clothing. But prospects are dim.Vivian has secrets in her young life that no one is aware of - least of all her sisters. She has tried to put them behind her and live her life according to God's leading, but she continually finds herself being deceptive and not choosing wisely. She does not seek the assistance and counsel of those who love her. So she makes mistakes. Big mistakes.This is a story of the American West and the book brings good christian fiction, sweet romance, wild west outlaws, soiled doves, and a train robbery all lending color and adventure. But you won't find inappropriate scenes or language to spoil it for you. Being a Western style story, we have a hero, too - Deputy Carter Alwyn. So watch out for tender sparks between Vivian and the Deputy Carter.Character development is good and each personality shows through. You will fall in love with Hattie. (I'll not tell who she is so you can read the book and find out!) And the sub-sub-plot of Nell and her husband desiring a child and being unable to have one resolves itself in a beautiful way. (Again, I'm not going to give this sweet morsel away!)But this is a story of forgiveness. God's grace and forgiveness and that of those we love. No matter how big or terrible our mistakes, God is gracious and God is forgiving. You will find an inspirational read in The Bride Wore Blue by Mona Hodgson that will be an encouragement to you if you need forgiveness and a source of helping others whom you know who need to realize the forgiveness of God and that of friends and loved ones.You will also find family loyalty and acceptance toward Vivian even after her mistakes and secrets are discovered.The Bride Wore Blue can easily be read as a stand alone book although it would be fun to read the entire series in the order in which they were written. I look forward to reading Mona Hodgson's new release in October 2012 of Twice a Bride.DISCLOSURE: I was provided a copy of The Bride Wore Blue by Blogging for Books on behalf of Waterbrook Press and the author in exchange for my honest review. Opinions expressed are solely my own and I was under no obligation to render a positive review."}, {"userName": "Victor Gentile", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Mona Hodgson in her new book, “The Bride Wore Blue” Book Three in The Sinclair Sisters of Cripple Creek series published by WaterBrook Press brings us into the life of the fourth Sinclair sister, Vivian.From the back cover: Headed toward a fresh start but tethered by her past, Vivian longs to break free, to find forgiveness and love.At last, the sisters are reunited! The youngest Sinclair, the family“ baby”, is moving from Maine to Cripple Creek, Colorado and joining Kat, Nell, and Ida. But Vivian is a young woman with a will of her own, and made some decisions back in Portland that have begun to haunt her. Will she be able to live up to the expectations of her three perfect and now happily-settled sisters?The sisters warmly welcome Vivian to the mountain west, but the wild-and-woolly mining town isn’t ripe with opportunities for a respectable young woman. The youngest Sinclair sister is determined to make her own way, so when she’s offered a job as a hostess in a sporting house, she takes it, thinking the position is appropriate for a tainted, unlovable woman like herself. Although she’s convinced she’ll never be asked to entertain privately, Vivian keeps her employment a secret from her sisters, knowing they’d be mortified—as will Carter Alwyn, the kind and godly sheriff ’s deputy who’s sweet on her.Vivian is descending into a life of secrets, lying to the very people who love her and could help her heal from her mistakes. Will an outpouring of grace remind her that she is still God’s beloved and that her past can be washed as clean as Rocky Mountain snow?As human beings what is the one thing we all like to keep? The answer, secrets. What is the one thing that God knows that we should not keep because it is detrimental to, not only our health, but our relationships as well? You guessed it, secrets. When Vivian Sinclair comes to Cripple Creek to settle down what is the one thing she brings a lot of? Of course, secrets. Ms. Hodgson does a wonderful job of showing us how Vivian’s secrets affect her relationship with her sisters, Deputy Carter Alwyn and her choices. ”The Bride Wore Blue” is more than just a great romance it is a story about guilt, bad choices and forgiveness. Vivian makes huge mistakes and it takes God to work out everything in both her life and Carter’s. Not only that Ms. Hodgson gives us some excitement and adventure in this story as well. Ms. Hodgson gets us caught up in the story and the characters to the point that we actually hate to say goodbye to them when the book ends. The good news is that the fourth book in the series is coming soon.If you would like to listen to interviews with other authors and professionals please go to www.kingdomhighlights.org where they are available On Demand.To listen to 24 Christian music please visit our internet radio station www.kingdomairwaves.orgDisclosure of Material Connection: I received this book for free from WaterBrook Press for this review. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Renn Shearin", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/3828546-renn-shearin", "userReview": "Headed toward a fresh start but tethered by her past, Vivian longs to break free, to find forgiveness and love.The youngest Sinclair, the family“ baby”, is moving from Maine to Cripple Creek, Colorado and joining Kat, Nell, and Ida, her three older sisters. But Vivian is a young woman with a will of her own, and made some decisions back in Portland that have begun to haunt her. Will she be able to live up to the expectations of her three 'perfect' and now happily-settled sisters?The sisters warmly welcome Vivian to the mountain west, but the wild-and-woolly mining town isn’t ripe with opportunities for a respectable young woman. The youngest Sinclair sister is determined to make her own way, so when she’s offered a job as a hostess in a sporting house, she takes it, thinking the position is appropriate for a tainted, unlovable woman like herself. Although she’s convinced she’ll never be asked to entertain privately, Vivian keeps her employment a secret from her sisters, knowing they’d be mortified—as will Carter Alwyn, the kind and godly sheriff ’s deputy who’s sweet on her.Vivian is descending into a life of secrets, lying to the very people who love her and could help her heal from her mistakes. Will an outpouring of grace remind her that she is still God’s beloved and that her past can be washed as clean as Rocky Mountain snow?The Bride Wore Blue by Mona Hodgson was an interesting and convicting novel about a sinful woman who learns that God offers forgiveness and acceptance to those who turn to Him and away from sin. The Bride Wore Blue is the third book in the Sinclair Sisters of Cripple Creek series. While I did not read the first two books in the series, the novel was written so that I was able to quickly connect with the characters and enjoy the story. The plot line was well written and had a couple surprising occurrences that added to the suspense and excitement of the story. The tone of the novel varied, and the author clearly showed the thoughts and feelings of the two main characters, Vivian and Carter. The characters of the story were fairly well developed and engaging. I liked Carter Alwyn. At times I thought he was too perfect, but I enjoyed seeing his growth and his confessions of hypocrisy and making some sins worse than others. Vivian was an interesting young woman. I liked her independence and boldness, but I was saddened to see her choices in life. I was pleased to see her growth as well and her realization of God's love and forgiveness. As Vivian realized, \"when faith should have sustained her and sent her into God's arms, she's wallowed in self-pity and turned to Gregory. Now she knew the difference between a superficial man and a man of deep faith and integrity. Her transgressions and the wrenching heartache that followed had readied her heart to receive God's grace.\" [The Bride Wore Blue, Kindle location 3240]. Overall, I enjoyed The Bride Wore Blue, I cannot wait to read the first two novels and the fourth novel in the The Sinclair Sisters of Cripple Creek series. I highly recommend this series for an quick yet enjoyable read. I received this eBook for free from Waterbrook Multnomah Press in exchange for an honest review."}, {"userName": "Patty Hearts Dave", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/6769120-patty-hearts-dave", "userReview": "Vivian Sinclair moved to Cripple Creek, Colorado with dreams of becoming a fashion designer. Her three older sisters lived there and had found success in the boom town. The problem standing in the way of her dreams was her past. She was sure she didn't deserve to be happy because of a mistake she made back in Maine.When job after job didn't work out, Vivian found herself submerged in a role that blurred the lines of the truth and lies. Vivian was turning farther and farther away from God. Every decision she made put her one more step out of His will.Cripple Creek's Deputy, Carter Alwyn, also had trouble letting go of the past. His father was killed while doing his job as a sheriff. Carter couldn't step out of his father's shadow. Still, Carter was growing closer to God. He was seeking God's will for his life.The growing town of Cripple Creek and it's townspeople are described in such a way that you know you're reading about the late 1800's. The dress of the people and the sights and surroundings of the area are shown well through words. The author doesn't let the reader know everything up front. Slowly the story unfolds and more and more is discovered about the characters. The subplot of bandits in the area that seems to be minor changes into a bigger story that involves death and kidnapping by the end.Vivian and Carter always had the past on their minds. Some people may find it unrealistic how they were so obsessed with it. Vivian could come off as a little snobby. She critiqued everyone's style of dress and wanted to change it. Vivian and Carter had an instant attraction to one another. But they let their pasts kept them apart. There is very little romance in this story because of this.Vivian's three sisters, Ida, Kat and Nell's stories from the previous books in the series continue but take a back seat to Vivian's story. I enjoyed the subplot with Nell and her husband's struggle to have children. Hattie owns the boardinghouse where Vivian is staying. She is like a mother to all the Sinclair Sisters.The Bride Wore Blue is story of forgiveness - giving it and receiving it. God's grace is bigger than our mistakes. If you enjoy inspirational stories be sure to check out this book.The Sinclair Sisters Of Cripple Creek Series:Book 1 Too Brides to ManyBook 2 Too Rich for A BrideBook 3 The Bride Wore BlueBook 4 Twice a Bride - to be released in October 2012I received a free copy of this book from WaterBrook Multnomah for my honest review."}, {"userName": "Lisa Johnson", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/7092311-lisa-johnson", "userReview": "Title: The Bride Wore BlueAuthor: Mona HodgsonPages: 288Publisher: WaterBrook PressYear: 2012Note: I received a complimentary copy for an honest review. Other reviews can be read on the blog located here: http://seekingwithallyurheart.blogspo...\tDo you ever feel unlovable? Maybe you feel that you’re not good enough or don’t deserve love? How about feeling unworthy of God’s love? Can anyone love me when I’ve…? If you’ve ever had those thoughts or feelings, you’re not alone. The author does a wonderful job of exploring these questions through the eyes of her main character, Vivian Sinclair, and a supporting cast of her three sisters, a boardinghouse owner, and the deputy sheriff. The story is set in the late 1800s in Colorado. Vivian and her sisters have grown up as Christians. She is the fourth of four sisters and has never liked being the baby of the family. She longs for independence to show she can take care of herself. She makes some poor choices in her home town in Maine, and thinks that she can start a brand new life in Cripple Creek with her sisters. When she arrives in Cripple Creek, she meets the deputy sheriff, Carter Alwyn. They both are attracted to each other, but both are not wanting more than friendship. Vivian doesn’t think she is worthy of anything more, and Carter doesn’t want to drag a woman into the life of a lawman.Vivian tries to find a job, but is rejected time and time again. She is desperate for a paying job, and makes another poor choice. This job leads her to encounter some criminals who have been robbing banks and trains in the area. What happens to make Vivian a murder suspect? Can anyone ever forgive her? Her desperate situation causes her to turn back to God for help, and makes her realize her true feelings for Carter run much deeper than friendship. Carter is trying to catch the thieves and bring them to justice. He also realizes how much he wants a wife to share his life. Does Vivian feel the same?Once Carter learns the truth about her past, will he still have feelings for her? Will he be disgusted with her? The story shows the path of forgiveness, mercy, and compassion of God. It also shows the love that is shared by fellow Christians, and their mercy and willingness not to pass judgment. This is the third book in the series “The Sinclair Sisters of Cripple Creek.” The story is easy to read and you’ll be finished before you know it!My rating for this book is 3.5 stars."}, {"userName": "Orbs n Rings", "userReviewDate": "May 29, 2012", "userURL": "http://www.goodreads.com/user/show/4694420-orbs-n-rings", "userReview": "Great historical fiction a little short on romance.The Bride Wore Blue is the first book in the series I have read from this author. I didn't know what to expect and went into reading this book with good intentions and wanting to really like this story. Maybe I was just looking for more heat so I was kind of disappointed when I came to the end and it just didn't have as much romance as I thought it would. The story however does well on the historical fiction front and I liked that aspect of it. I was even surprised to learn that a few of the characters in the novel were actually real people who existed in the late 1800's. So this was very interesting as well as the plot itself.The books main character is Vivian Sinclair and she has just arrived in Cripple Creek where her other three sisters now reside. The character of Vivian reminds me of a lady who is high maintenance, always completely dressed up even if she really has no where to go. I just could not relate to her character. Vivian is an artist who does sketching and designing and has designed numerous outfits and accessories for friends and family and she has her mind set on a job as a designer when when she arrives in Cripple Creek. However when Vivian cannot find a job designing or keep any job for that matter she ends up settling for anything she can get her hands on that will help her pay her rent. Not wanting to be dependent on her sisters Vivian weaves a web of lies to keep a job she is not to proud of. Carter Alwyn a bachelor and the sheriff of Cripple Creek met Vivian the first day she arrived in town and he immediately became attracted to her spunky nature. But Carter has some insecurities of his own that leave him having second thought about pursuing a relationship with Vivian.I found the characters lacked better deceptions of their past involvement with Vivian. It could be because the author wanted to keep the emphasis on Vivian. However I found to be a mistake for those of us like me who are coming into the series at an angle and don't really know any of the other characters well enough. I felt that if Hodgson would place a little more attention to giving a little more information on the other characters and just a little more feisty romance it could be a series I would look forward to."}, {"userName": "Meagan Myhren-bennett", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/5477348-meagan-myhren-bennett", "userReview": "The Bride Wore BlueBy Mona HodgsonThe Bride Wore Blue is the third book in the Sinclair Sisters of Cripple Creek series. Vivian is joining her three older sisters in Cripple Creek, Colorado. But Vivian has a secret that she is hiding, a secret that could make her sisters turn their backs on her if they ever found out.But just before the train arrives in Cripple Creek bandits rob the train and Vivian accidentally trips on e of them. Using her skills for costume design, Vivian sketches the bandits clothing but Deputy Carter Alwyn is more interested in the physical build of the men then their clothing.Vivian is warmly welcomed by her sisters, their husbands, and Miss Hattie. Vivian takes a room at Miss Hattie's but she needs a job to pay for her room and board. But Vivian's job search is not making much headway and she is determined to stand on her own two feet and not be the \"baby\" of the family any longer. But when the two jobs she does find don't work out she takes a job as a day hostess at the local sporting house. Now Vivian has another secret to keep from her sisters - after all they don't need to know just how low she has fallen. Vivian is convinced that she has forever ruined her chance for love, marriage and a family. Can she ever forgive herself? Will she allow God to forgive and heal her? Soon Vivian's independent stubbornness gets her into more trouble than she has ever been in. With her life on the line will she ever get the chance to admit her mistakes to those who love her or will she die before she can seek redemption?The Bride Wore Blue is a look at the relationships we have in our lives. Family is one of the most important we can have after our relationship with God. It is also a look at the importance of seeking forgiveness and not compounding our sins by trying to hide them from those in our lives. Nothing is ever hidden from God and He sees our heart. Give it to Him, He can restore you if you just ask. I received this book for free as part of the Blogging for Books program from WaterBrook Multnomah Publishing Group for this review."}, {"userName": "Megan", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/5372197-megan", "userReview": "4.5 StarsThe Bride Wore Blue is another enjoyable installment to The Sinclair Sisters of Cripple Creek series, and my favorite of the series to date. I hope to read Twice a Bride, the fourth book in this series, very soon.Vivian may be the baby of the family, but after making a grievous mistake the previous year, she has done a lot of growing up. I thought she was such a believable character, and I felt an immediate connection with her.Shortly after Vivian arrives in Cripple Creek she begins to look for employment. However the town has recently suffered a fire and most of the local businesses have just rebuilt, so there are very few jobs available. She is told about a job as a hostess and thinks that is something she could do...that is until she learns it is in one of the sporting houses. However, when she loses one job, has to leave another and can't find work anywhere no matter how hard she tries, she decides to see what would be involved in that hostess job. When she is told that she wouldn't have to work upstairs, she decides to take it - thinking that it isn't that big of a deal to work there after what she did last year. Knowing that her family would never understand or condone her decision, she keeps her place of employment a secret from them...even going to great lengths to deceive one of her sisters when she comes across her on her way to her job.The Bride Wore Blue is a wonderful story. I think this book could be read be itself and you wouldn't feel that you are missing out on anything. However, just know that if you did read this one first, and then decided to read the other two, that you would know a lot of the key details of those books and that may take away a little of your enjoyment of them. I would recommend this book and this series to fans of historical fiction.***I received a complimentary copy of this book to review. I was asked to give my honest opinion of the book - which I have done.***"}, {"userName": "Sally", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/7384414-sally", "userReview": "The Bride Wore BlueBy Mona HodgsonI will keep this book to read over and over! The Bride Wore Blue is a book about guilt, forgiveness, and trust. This is book 3 in the Sinclair Sisters of Cripple Creek series. You do not need to read the first 2 books to read this one, but once you finish this book, you’ll want to go back and read the others to read about the other sisters. In this book, the other sisters have returned to Cripple Creek and are married. Now the baby of the family has come home. Vivian Sinclair has a past she is hiding from. She doesn’t want anyone to know what she has endured. No one can possibly love her for the things she has done. One lie leads to another and pretty soon, no one knows the real Vivian. Carter Alwyn is the sheriff’s deputy of Cripple Creek. Can he convince Vivian to trust him with her secrets? Will Vivian’s past release its hold on her so she can have a future basking in God’s love and Carter’s arms? Can Vivian learn to forgive herself? This book is for anyone who enjoys a great Christian western with romance, humor, and characters who learn from their mistakes and embrace God’s grace and mercy in their lives. The sisters and the inhabitants of the town become people you care about. Once you read this book, you will want to read others by Mona Hodgson! The Bride Wore Blue: A Novel\nMona Hodgson"}, {"userName": "Susan", "userReviewDate": "Aug 13, 2012", "userURL": "http://www.goodreads.com/user/show/2502054-susan", "userReview": "WaterBrook Press (Blogging for Books) recently sent me a copy of The Bride Wore Blue by Mona Hodgson to read and review. The Bride Wore Blue is a 288 page Christian romance novel. It also contains a Readers Guide as well as a preview of her upcoming book Twice a Bride, available in October 2012. It is the third book in The Sinclair Sisters of Cripple Creek series. A while back, I read the first book in this series; Two Brides Too Many and really enjoyed it.I enjoy Mona Hodgson’s writing style, but I don’t thing this book was quite up to her normal standards. I enjoyed the plot alright, it it was just that: alright. There was nothing really special about the book or the plot. The plot was very predictable and similar to other books I have read. I also felt the the book just dragged on and on and was very slow in the beginning. Then when the “action” finally took place, it was rushed through. I also found it really hard to believe that none of her sisters would have helped her more in finding a job or even offer her a job, especially when they are supposedly so close. The story was predictable and I feel that the relationship between Vivian and Carter was rushed and the chemistry just lacking between them. It just didn’t seem that their romance was well developed. Overall, I think Mona Hodgson writes well, but this book just didn’t work for me. I really wanted to like The Bride Wore Blue, but for me it fell flat.NOTICE:Disclosure of Material Connection: I received this item free from the creator. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Wanda", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/5303838-wanda", "userReview": "It has been a while since I read Two Brides Too Many and I somehow missed Too Rich For a Bride, but that did not detract at all from my enjoyment of this latest novel in the series. Vivian Sinclair is the baby sister of the bunch and she has finally made her way to Cripple Creek, Colorado, to join her other three sisters. She has missed her sisters terribly and can’t wait to be near them again but that is not her only objective in moving. She is trying to make a new start for herself after suffering a broken heart and she is ready to try her wings at becoming a clothing designer. But nothing goes as she has planned and she finds herself making one poor choice after another in a desperate attempt to keep her head above water.I connected with this story from the get-go and was completely wrapped up in Vivian’s adventures and mistakes along the way. I found all of the characters to be believable and the story to be well thought out. Not only was it an enjoyable read but it had a very strong message about the consequences of a choice. Even though Vivian should have known better in some areas, I found her to be portrayed as a woman who just allowed herself to be drawn into the wrong choices without intending to do the wrong thing. Any of us can have that happen if we are not careful, so I was pleased to see this depicted in a novel that could not only tell a captivating tale but could also encourage young and old alike to make the right choices. That is what I look for in Christian Fiction—a good story with a good moral—and this book delivered. I received this complimentary copy from WaterBrook Multnomah Publishing Group through their Blogging for Books program. A positive review was not required and the opinions expressed here are my own."}, {"userName": "Caitlyn Santi", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/6980753-caitlyn-santi", "userReview": "I give this four and a half stars.I have not read the first two books in this series. But when I was offered a chance to review this book from the publisher I jumped at the chance! And I am glad I did! I so enjoyed getting to know these characters, although I did have a bit of trouble keeping them all straight in the beginning, but I think this was probably because I haven't read the previous books, yet. The four sisters were all very unique and charming and their relationships with each other were very realistic. I am blessed to have a wonderful family that bands together through the good and the bad, so I will always love to read about families that do the same, this is one of those books! I loved the message of this book, learning that God still loves you unconditionally, even after you have sinned and although you feel unworthy, you have His forgiveness. Basically this story was awesome and I loved reading it! The only thing that kept me from giving it five stars was that it moved slowly and the plot line progressed slower than I would have liked. Because of this it could be kind of hard to get into the swing of things, but persevere, it is totally worth it! I very much enjoyed this book, honestly I usually stay away from series like this because I feel like most of them are all the same but this series has something unique and special about it. I know fans of this series will love this book and as a new fan of this author I am here to say that you do not need to read the previous books in order for this one to make sense. I love series like that. However I look forward to going back and reading the previous books. I absolutely recommend this book. Mona Hodgson definitely has a new fan in me!"}, {"userName": "Virginia Campbell", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/2333268-virginia-campbell", "userReview": "\"The Sinclair Sisters of Cripple Creek\" are reunited in \"The Bride Wore Blue\", Book 3 in author Mona Hodgson's delightful series. This time, \"baby sister\" Vivian is leaving Maine and heading to Cripple Creek, Colorado to join her contentedly-settled older siblings. Vivian has always marched to the beat of her own drummer, following her impulsive heart instead of her head, often meeting with disaster. Determined to make a fresh start and pursue her dream of becoming a successful fashion designer, she forges ahead by train, encountering a band of robbers and providing Deputy Sheriff Carter Alwyn with a sketch of the bandits. A search for work eventually lands Vivian a job as a hostess in a house of ill-repute. She hides her work from her sisters and also from Carter, who is quite taken with the youngest Sinclair sister. Due to poor decisions in her past, Vivian thinks that she is not worthy of Carter. He thinks the danger of his line of work in law enforcement makes him an unsuitable candidate for marriage. When a dangerous twist of fate brings Vivian's secrets to light, can those she loves forgive her? Author Mona Hodgson writes with appealing historical detail and creates compelling characters whom we want to find their happy ending. Forgiveness and self-acceptance are strong themes in \"The Bride Wore Blue\". Learning to truly forgive oneself and learn from our mistakes is a huge step toward growth of character and also enables us to be more tolerant of others. If you are a person of true faith, then forgiveness is already yours for the asking. It is what you do in your life with the blessing of benevolence that you receive that makes all the difference. A recommended series for lovers of inspirational historical romance."}, {"userName": "Judy", "userReviewDate": "Jul 07, 2012", "userURL": "http://www.goodreads.com/user/show/1871221-judy", "userReview": "The Bride Wore Blue by Mona HodgsonThe Sinclair Sisters of Cripple Creek Book 3Vivian Sinclair is the youngest sister and the last to make the trip to Cripple Creek, Colorado. Her three older sisters have all found love and happiness but Vivian hoped she could just hone her skill of a designer so she could move on to New York or perhaps Paris. She made a huge error in judgment that she knew cost her the love of a good man. And unfortunately even after the move her poor judgment continued in her choice of work. Decisions of her past kept her from any future, especially with the handsome deputy.Carter Alwyn liked the spunky newcomer the minute she stood up to him on the train when he came to ask questions about the robbery. Too bad he would never take a wife as long as he was a lawman. A beauty like Vivian Sinclair had him second guessing his career choice. Could two people let go of their pasts and have a new future?I really enjoyed this book. The author wrote a moving story on how God can forgive our sins and give us freedom from the past….even if others don’t. The story also shows how Vivian’s pride leads her down an even darker road than what she was on. How when we compare ourselves to others, we most likely won’t live up to it. A well rounded story of love, forgiveness, adventure and prayers answered in unexpected ways. The first books in this series are: Two Brides Too Many, Too Rich for a Bride and the fourth book will be Twice a Bride.**Received from Edelweiss for reviewhttp://justjudysjumbles.blogspot.com/..."}, {"userName": "Renae Sattazahn", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/12458497-renae-sattazahn", "userReview": "This is the fourth novel in the \"Sinclair Sisters of Cripple Creek\" series by Mona Hodgson, and in my opinion it was the very best of her books so far. I loved the storyline, and the main character made so many poor choices it was easy for me to identify with her! All of Mona's main characters have a a strong desire to achieve their goals and aren't afraid to take chances. I love the adventurous spirit reflected throughout the entire book.The storyline revolved around Vivian, the youngest Sinclair sister, who moves to Cripple Creek with dreams of being a fashion designer. When those dreams are squashed, followed by the failure of two successive jobs, she resorts to working in a brothel as a hostess for Pearl DeVere. One day she shockingly finds Pearl dead. Unfortunately, Pearl's boyfriend assumes that Vivian is the killer and sets out on revenge. The story only gets better when Vivian's love interest, the deputy of Cripple Creek, rescues her and discovers -- upon his dismay -- where she has been working. What a beautiful story of redemption and joy! Mona keeps it light and fun the entire way through. My favorite quote of the book came from Miss Hattie when she said, \"It's what we do in our future, dear, that decides how important our past truly was.\"Currently, this novel retails on Amazon for $11.40, or you can purchase the Kindle edition for only $9.99. Don't forget to order books 1, 2, and 3, though. They are all very good.This book was a complimentary copy from the publisher in exchange for an objective review."}, {"userName": "Loraine Alcorn", "userReviewDate": "May 15, 2012", "userURL": "http://www.goodreads.com/user/show/3696460-loraine-alcorn", "userReview": "I received my copy of the Bride wore Blue by Mona Hodgson through blogging for books. I thought this was a really interesting Christian fiction story that is the latest in the series from the author. This series is called The Sinclair Sisters of Cripple creek and This one is book 3. I have not read the other 2 in this series but now I really want to because I was really able to identify with the characters in This story. This is the story of Vivian who moves to Cripple creak to be with her sisters who have all gotten married and found love in this town. Vivian wants to be a fashion designer but in this smaller town of Cripple Creak finding a job is not easy. Vivian is also hiding a terrible secret about her past in Portland. This secret leads her to believe that she could not possibly be forgiven for the sin she committed and her damaged self esteem leads her to make some really bad choices. I Liked this story it touches on how sometimes we dwell so much on our failure's and sins we forget that God Knows us and forgives us. We get caught in the trap of being so ashamed about our behavior that we end up making even worst choices because we can't forgive ourselves. We forget that through Christ our sins are covered and should be put behind us. We forget to move forward and not dwell on the mistakes we made before. Dwelling on past sins only breads feelings of worthlessness and despair. We need to keep running the race, not wallowing in our failures. Christ forgives, he never asked us to wallow in despair."}, {"userName": "Patricia Kemp Blackmon", "userReviewDate": "Feb 22, 2012", "userURL": "http://www.goodreads.com/user/show/5314062-patricia-kemp-blackmon", "userReview": "Vivian Sinclair is the youngest of the Sinclair sisters to arrive in Cripple Creek. Being the youngest she feels as if she will never be able to compete or compare with her older sisters and their accomplishments.When she first arrives she meets the local deputy sheriff, Carter Alwyn and they do not seem to see eye to eye on anything. When they finally come to a meeting of the minds Vivian tries to discourage his advances. She feels she is not worthy be in a relationship with any man, because she is so haunted by her past.The local businesses are just getting back on their feet after the last fire that swept through Cripple Creek. Which left her with no luck finding employment. Her dream was to be a fashion designer. But in Cripple Creek there was not much use for high fashion. She is offered a job as hostess at a local bordello. She justifies taking the job because she would only be a hostess and not a working girl. She takes the job trying to keep it a secret from everyone which has put her in extreme danger. Growing from school girl to adulthood is a hard transition and back then women were not wanted in many of the workplaces. I enjoyed this series very much and look forward to reading book four TWICE A BRIDE.I highly recommend this book.I rated this book a 5 out of 5.DisclosureI received a free copy of this book from WaterBrook Press/Blogging for Books for review. I was in no way compensated for this review. It is my own opinion."}, {"userName": "Angela Bycroft", "userReviewDate": "May 10, 2012", "userURL": "http://www.goodreads.com/user/show/7833108-angela-bycroft", "userReview": "Third title in the Brides of Cripple Creek and a worthy continuation of this heart warming series. We are next to meet the youngest of the sisters, Vivian - who holds both surprises and secrets from her past. She comes to the township fully intending to make her own way in life and to put her love of design and fashion to good use. Sadly her best efforts to earn an honest living for herself as a single woman are sorely tested.Then there's the story of the sheriff's deputy - Carter Alywn is a man who knowns his town and is determined to keep it safe from bank and train robbers. When Vivian's train to Cripple Creek is robbed by said gang - their paths cross for the first time. Initially antagnositic and avoiding of one another - soon they both begin to realise that they can be friends and mayb more. I loved revisiting many well loved characters and catching up with their stories. Ultimately the story would still make sense even without reading the first two books it ceretainly adds a true serial nature to the stories to have the complete history at hand. The book also took some surprising turns and kept you guessing how the eventual ending would finally happened. Vivian's story is definetly one of making multple mistakes before realising that God's grace can indeed cover a multiude of sin and bring about a true transformation - blotting out all that went before. A truly lovely story which makes either a wonderful continuing saga or a wonderful stand alone story."}, {"userName": "Susan", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/4560664-susan", "userReview": "I have now read all three of The Sinclair Sisters of Cripple Creek stories to date. This third book in the series gives the reader an in-depth look at the \"baby\" of the family, Vivian. I felt like Vivian had been a typical spoiled baby sister, wanting her own way before she went to join her older sisters in Cripple Creek, and had learned some hard life lessons in a very difficult way. Though she seemed to be more mature and to have learned from the mistakes in her past, she seemed to continue to resent her older sister's influence in her life at times, and I think it led to her making more mistakes that could possibly been avoided if she would have just taken the time to talk with one or more of them.This realistic sibling dynamic made the story much more enjoyable for me, as well as the estranged romance between Vivian and Deputy Alwyn. The overwhelming lesson of forgiveness, faith and acceptance is an integral part of the story from beginning to end. This heartwarming story is one that shows how forgiveness, love, and family loyalty can help overcome difficult circumstances. I also enjoyed the mystery and danger involved that gave the wild west type feel to this story that I really like. This is a good christian fiction romance, with some wild west outlaws, soiled doves, train robbery and so much more excitement thrown in the mix. Although it can be read alone, I do recommend reading the first two books in the series first in order to get to know many of the other characters in this story."}, {"userName": "Erin Cataldi", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/3670585-erin-cataldi", "userReview": "This book was literally a breeze to get through. Mona Hodgson (www.monahodgson.com) continues her Sinclair Sisters of Cripple Creek series with this third installment. The story follows young Vivian Sinclair as she moves from Maine to the \"wild west\" to join her three older married sisters. On the train ride over, bandits break onto the train and steal the cash box, but not before Vivian accidentally trips one of them. Her accidental heroics lead her to meet charming young Sheriff, Carter, who is immediately impressed with her sass and charm. Although she begins to develop feelings for him, she tries to avoid him by working hard at finding a job designing gowns. She \"soiled\" herself in Maine and doesn't think that she will ever find joy in family life like her sisters because no man will take a tainted woman (a secret that haunts her). The story grows more intriguing as the bandits bring havoc to the normally quiet town and Vivian is forced to take a job that no real lady would ever consider. Will Vivian ever forgive herself and move on? Will Carter ever catch the bandits and the girl? Read on to find out!The story (like many historical Christian romances\" was slightly predictable, that being said it wasn't a bad read. It was fast and easy (like Vivian? haha, I couldn't resist)and will be a perfect beach read. \"I received this book for free from WaterBrook Multnomah Publishing Group for this review.\""}, {"userName": "Amy Bradsher", "userReviewDate": "Sep 01, 2012", "userURL": "http://www.goodreads.com/user/show/8690471-amy-bradsher", "userReview": "What do you do when you can't find a job, really want to be out from under your older sisters' wings, and are just about out of money? How far would you go to maintain your independence? That's Vivian Sinclair's dilemma in The Bride Wore Blue. The Sinclair sisters are a lot of fun. This is the first book in the \"Sisters of Cripple Creek\" series that I've read, but I thoroughly enjoyed it. Hodgson took a very serious problem - how to achieve financial independence - and a spiritual one - how to forgive yourself - and addressed them with historical accuracy, emotional depth, and enough lightheartedness to keep the story fun. Vivian's antics were often comical and her run-ins with Carter, a deputy, had enough zaniness to make you blush for her. Trying to untangle the mess she's made of her life, though, has a depth that is belied by the simplicity and beauty of the cover. The message is far deeper than what is normally contained in your typical 'romance' - and could prompt serious soul searching to those in need of personal forgiveness.Previews are included for Hodgson's next two books at the end of this one (as well as a reader's guide). They sound as fun and dramatic as this one. I can't wait to read them!I received a free copy of The Bride Wore Blue from the Blogging for Books program in exchange for an honest review.http://anestintherocks.blogspot.com/2..."}, {"userName": "Kate", "userReviewDate": "Jun 01, 2012", "userURL": "http://www.goodreads.com/user/show/5963420-kate", "userReview": "Grace is sometimes found in the most unlikeliest of hearts.Vivian Sinclair, talented seamstress and artist, relocated to Cripple Creek, Colorado at the request of her sisters. At her arrival the reunion holds promises and surprises. The town seemed hospitable enough to Vivian but she is in desperate need of work. A majority of her prospects for a source of income seemed invaluable, but when an opportunity presents itself to her in an area of questionable location she keeps this new venture from her sisters which does prove to be quite difficult indeed.Carter Alwyn, Sheriff Deputy, is doing his part to keep his town safe but even the best of intentions has its challenges. In his search for an outlaw Carter discovers something truly more valuable, but could he lose more than his badge in the process? A steadily, well flowing novel that proved to be quite entertaining! A stand alone novel,and although this is the third book in the series, of which I have not read the ones prior, I was able to start fresh not knowing the history previously. Promising drama, romance and justice this book will capture the reader's attention. Scenery and dialogue worked well and the down to earth characters were well developed. I found the overall message inspiring and would recommend this book to others."}, {"userName": "Laura", "userReviewDate": "Oct 12, 2012", "userURL": "http://www.goodreads.com/user/show/1603322-laura", "userReview": "Trying to forget the sins of her past, Vivian moves to Cripple Creek to join her three sisters. Determined to succeed as a fashion designer, Vivian will take any job to make her way...even a job that will hurt her reputation beyond repair. Will the past pull her back in, or will Vivian finally find relief from her guilt?Vivian may be my favorite sister. I liked her determination and the storyline of her guilt over her past. When Vivian witnesses a crime that the local law enforcement is desperate to solve, she becomes involved in character descriptions, witness statements, and even a kidnapping. What she hadn't expected was the sparks she felt for Carter, the Sheriff who is afraid of having a family with his dangerous career. Their relationship is predictable but enjoyable.The best part of the book was the question of how far will people go to survive. Many people say they won't do certain things, but when you have tried every other option, what will you do? Will you compromise your values to eat and to have a place to live? Although this was a minor part of the story, it is the part that left me wondering about the situations people have endured to lead them to the bad choices they make.Fans of Christian fiction will enjoy this book. I recommend reading the series in order, but this book can be read as a stand alone.I received this book in exchange for my review."}, {"userName": "Miss Pippi the Librarian", "userReviewDate": "Nov 25, 2011", "userURL": "http://www.goodreads.com/user/show/5015868-miss-pippi-the-librarian", "userReview": "The Bride Wore Blue follows Too Rich for a Bride. If you haven't read the previous Sinclair Sisters novels, please read them before enjoying the third installment.The Sinclairs sisters are united in Colorado! The youngest, Vivian, has moved to be with her sisters after a broken relationship and a refusal to join her father in Paris. Vivian is looking for a new start as a fashion designer, but jobs are scarce. She needs the support, but feels she can only find it by living a double life.Quite the excitment for the youngest sister! She's on the way to be reunited and stubbled into trouble from the first. Vivian trips a bandit, loses several jobs, and eventaully finds a job as hostess at a sporting house. The adventures never seem to end, so the reader is always turning the page to find out what is next. And not to worry when the final page ends, Hodgson shares the beginning of another novel about the Sinclair family!\"Therefore being justified by faith, we have peace with God through our Lord Jesus Christ: by whom also we have access by faith into this grace wherein we stand, and rejoice in hope of the glory of God.\" ~ Romans 5:1-2Time Period: 1890'sLocation: Cripple Creek, Colorado, USAReviewed from a library copy."}, {"userName": "Book Him Danno", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/872245-book-him-danno", "userReview": "I’ve read the last book in this series and enjoyed it much more than I did this one. The rules were a bit different for this story, but the romance was not there like in the last one. The romantic aspects of this book were few and far between in my opinion and that was one thing I missed. The family dynamics were there and yet I still do not quite understand the way this family works exactly. The sister had no job and no money and yet she was paying for a boarding house in a town where three of her married sisters live and could put her up for free? Forced to work in a ? You will have to read the book to find out that one, but as an older sister I would have paid her rent or had her move in with me before things got so desperate. Yes the sisters all have busy lives, but come on….Cripple Creek is a town that many readers enjoy and I did in the last book, but this one fell short of my expectations. I was really looking forward to this book and started reading it right away and yet…now I wonder why. The story was OK and that is about it. But if you have read the rest you will want to read this one to keep up with the comings and goings of The Sinclair family."}], "description": "Headed toward a fresh start but tethered by her past, Vivian longs to break free, to find forgiveness and love.At last, the sisters are reunited! The youngest Sinclair, the family \"baby,\" is moving from Maine to Cripple Creek, Colorado, and joining Kat, Nell, and Ida. But Vivian is a young woman with a will of her own, and made some decisions back in Portland that have begun to haunt her. Will she be able to live up to the expectations of her three perfect and now happily-settled sisters? The sisters warmly welcome Vivian to the mountain west, but the wild-and-woolly mining town isn't ripe with opportunities for a respectable young woman. The youngest Sinclair sister is determined to make her own way, so when she's offered a job as a hostess in a sporting house, she takes it, thinking the position is appropriate for a tainted, unlovable woman. Although she's convinced she'll never be asked to entertain privately, Vivian keeps her employment a secret from her sisters, knowing they'd be mortified--as would be Carter Alwyn, the kind and godly sheriff 's deputy who's sweet on her. Vivian is descending into a life of secrets, lying to the very people who love her and could help her heal from her mistakes. Will an outpouring of grace remind her that she is still God's beloved and that her past can be washed as clean as Rocky Mountain snow?", "title": "The Bride Wore Blue\n      \n          (The Sinclair Sisters of Cripple Creek #3)", "url": "https://www.goodreads.com/book/show/12796308-the-bride-wore-blue", "average": 4.02, "cover": "https://images.gr-assets.com/books/1391994999l/12796308.jpg", "reviews": 57, "authors": [{"url": "https://www.goodreads.com/author/show/602227.Mona_Hodgson", "name": "Mona Hodgson"}], "type": ["Romance", "Christian Fiction", "Historical", "Christian", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/12796308-the-bride-wore-blue", "http://www.goodreads.com/book/show/7041799-two-brides-too-many", "http://www.goodreads.com/book/show/9600912-too-rich-for-a-bride", "http://www.goodreads.com/book/show/16142056-prairie-song", "http://www.goodreads.com/book/show/13532285-twice-a-bride", "http://www.goodreads.com/book/show/16141841-dandelions-on-the-wind", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}