{"ratings": 44, "userreviews": [{"userName": "Jennifer ~ TarHeelReader & Traveling Sister", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/32340179-jennifer-tarheelreader-traveling-sister", "userReview": "4 seashells by the seashore for The Bakery at Seashell Cove! 🐚 🐚 🐚 🐚 I am ever grateful to my friend and Traveling Sister, Melisa, who told me about Karen Clarke’s books. They are pure fun, and The Bakery at Seashell Cove is no exception!Where The Cafe at Seashell Cove was Cassie’s story, The Bakery at Seashell Cove is Cassie’s friend, Meg’s, story. Also taking place in picturesque Seashell Cove, Meg Larson has it all. She is a baker, and she is about to marry her high school sweetheart, Sam. But it all goes off-kilter when the bakery is up for sale, and Sam becomes distant. And obsessed. Completely obsessed with cycling! (My husband had his own obsession with cycling, but I digress! Lol)Will Meg follow in Cassie’s shoes and have her own happily-ever-after?If you are fan of brisk, fun, beachy reads with cute characters, a cozy setting, and British humor, give Karen Clarke a try. I am most definitely a fan and cannot wait to see whose story she explores next at Seashell Cove!Thank you to Karen Clarke, Bookouture, and Netgalley for the ARC. The Bakery at Seashell Cove will be released on June 8, 2018. I’ll have a pic up on my blog and instagram inspired by the adorable cover! My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"userName": "Sarah", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/27246754-sarah", "userReview": "I really felt for Meg. She loves her job in the bakery so it certainly couldn't have been easy having an uncertain future, especially when she is literally months away from tying the knot.Now Nathan the love interest sent my pulse racing never mind poor Meg's. I fell head over heels in love with him myself. The blossoming friendship between the two will certainly have your heart melting.Meg has so many decisions to make that I didn't really envy the position she is in getting pressure from her boyfriends family with the wedding arrangements. You can see her heart and soul goes into her baking, of which can I just say had my mouth watering. I probably wouldn't advise reading this book on an empty stomach that's for sure!Even though Meg has some serious decisions to make, this is still a heart warming and very much light hearted read. I loved how the author threw some little surprises in there for the readers making this one novel extremely hard to put down.The Bakery At Seashell Cove is a deliciously, wondrous story that you will devour within no time at all. It is escapism at it's finest and I really enjoyed every minute of it.My thanks to Bookouture and NetGalley for an advanced readers copy of this book. All opinions are my own and not biased in anyway."}, {"userName": "Els", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/3645710-els", "userReview": "This kind of books have covers that already put a smile on my face, even before I have read one single word. They make me want to sit down, put a 'do not disturb' signal on the door and read.Love, romance, betrayal, misunderstandings and of course the happy ending are some of ingredients that are needed to create a story in this category. It ticked all the boxes for me. I felt like I could smell all the delicious creations Meg was making and the recipe at the end of the book was a surplus. A story well constructed and thoroughly enjoyable and entertaining.Thank you, Karen Clarke, Bookouture and Negalleyhttps://bforbookreview.wordpress.com/..."}, {"userName": "Nicola Clough", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/30792063-nicola-clough", "userReview": "I couldn't wait to read this book as loved all Karen's other books and she certainly didn't disappoint at all as such an amazingly read just didn't want to put it down. It's worth far more than the five stars I have given it as it's full of romance and an easy read while being funny and heartwarming. It's full of families and cakes and of course it is set in beautful countryside makes you want to be there. Fantastic read highly recommend it. Meg has worked in a bakery for years and when the owner passes away and it's been left to a family member who doesn't want it so puts it up for sale. Meg can't afford it but she's with her boyfriend who is her school sweetheart but he's more interested in bikes and he's about to go off on a tour on his bike but can they plan their wedding. Nathan is the estate agent for the bakery and meg soon forms a friendship with him. She is asked to take part in a tv show that will show the bakery at it's full potential so hopefully someone will buy it but in doing this she goes home one day and finds her mother with a mystery man and this turns her life upside down for ever as she wasn't expecting this news she tries to ring Sam but she can't get hold of him and she's sees photos of him on his tour. Is Sam the right man for meg or is she really falling for some one else suddenly a mystery man buys the bakery in order for her to run it still as a bakery so meg is so happy. Can she find who the mystery man is or not and can she decide which man she's wants to be with or not. Simply fantastic read."}, {"userName": "Jennifer", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/2315277-jennifer", "userReview": "Loved this book!! The cover is what first caught my eye. It was a fun read and I felt like I was in the bakery working next to Meg. I loved the character of Meg and wanted to be her friend, especially when no one(her fiance, mother, soon to be mother-in-law) was being supportive of her bakery dream.The bakery where Meg worked is up for sale. She still uses it to make some cakes for the cafe where she currently works. Meg wishes someone would buy the bakery and put her in charge. From the start I didn't like Sam. His family is just as bad. Sam's mom, Bevereley, blames Meg for everything and is \"helping\" with the wedding plans. Who would want an owl as a ring bearer, especially if you are deathly afraid of birds? The \"slutty\" wedding dress, which Beverley insisted was exactly Meg, was awful. Especially when Meg described the model looking like Porno Barbie. Besides her friends, no one seemed to support Meg and her passion for baking. Sam is too concerned with his cycling club and Meg's mom wants grand-babies. Then she meets Nathan. Meg gets featured on Britain's Hidden Gems' and everything changes. From the start I figured out the identity of the anonymous donor. I enjoyed Gwen and her one-eyed tomcat. The stuff that came out of her mouth was quite hilarious. She had a rough exterior but she loved that kitty. Meg's two best friends Cassie and Tilly were always there for her. I need to read The Cafe at Seashell Cove to get Cassie's story!!!I definitely recommend the book and can't wait to read more books by the author.Thanks to NetGalley, Bookouture and the author, Karen Clarke, for a free electronic ARC of this novel."}, {"userName": "Lynn", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/16095414-lynn", "userReview": "A lighthearted, fun and easy read. Set in a quaint seaside town, full of colourful characters and some wonderful baking descriptions that make your mouth water. The plot was predictable and I did find Meg a bit of a doormat but overall enjoyable. Thank you to NetGalley and the publisher / author for providing me with a free electronic copy of this book for review."}, {"userName": "Kim", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/40928988-kim", "userReview": "Great to return to Seashell Cove. This book was a fun read and would be great to tote along to the beach. I look forward to reading more about this seaside town."}, {"userName": "Meg Dean", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/7108856-meg-dean", "userReview": "Solid chick lit…doesn’t take itself too seriously! You’ll laugh, cry, and say “Oh! No!” Definitely a fun weekend read :c)"}, {"userName": "Kaisha (The Writing Garnet)", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/40776578-kaisha-the-writing-garnet", "userReview": "All reviews can be found on my blog at https://thewritinggarnet.wordpress.comI'm going to get straight to the point here - I absolutely LOVED this book and everything it stood for. Personally, I think that this is Karen Clarke's best book yet as the entire vibe of the storyline was truly magical, written with such warmth and magnetism. It would take a person made of stone to not fall in love with 'The Bakery at Seashell Cove', and I will tell you why!Meg has been with her fiancé for most of her life. Waking up to him every morning is all she has ever known and, instead of feeling happy about her upcoming wedding, Meg can't help feeling that she will be making the biggest mistake of her life. To be honest, with a family like the one she is about to marry into, it's no wonder she feels the way that she does! They're awful people!! There's one thing being proud of their son's achievements with cycling, but then there is another thing thinking that Sam's faeces don't stink, even when he is in the wrong! I am probably not one to dish out relationship advice seeing as I am single and all that, BUT, I thought that couples were supposed to support their partners in whatever life throws at them, instead of patronising and belittling them at every opportunity? Like I say, I'm not good ol' Jezza Kyle by any means, so I could be wrong! -insert eye roll here-. Why should Meg have to make allowances for Sam whenever he jets off to different countries to ride his bike? Why isn't he supporting his soon to be wife with her bakery dream? Oh. Wait. I know why....it doesn't contain a bike..So, if you haven't guessed already, but my opinion of Sam, and his family, isn't really a good one. I don't quite get why Meg has stuck with his attitude for as long as she has. I guess a part of me can see why if I really thought about it, what with the way that Sam treats her. Maybe she felt as though she wouldn't be able to cope on her own because that's how he has made her feel over the years, I don't know, but that was the vibe I was getting. Watching Meg come alive whenever she was in that bakery was like watching a child step into a toy shop. Her personality shone like nobody's business, with a completely different side popping out to say 'hello' at times, without feeling like she had to pretend to be something she wasn't. The one thing I loved most about Meg was that she refused to let go of her dream, even though people kept telling her to. Her passion for the bakery was infectious - how could anyone not support that?'The Bakery at Seashell Cove' doesn't just revolve around Meg and her relationship with Sam, in fact it has so much to it, I am in awe at how the author managed to squeeze everything into the storyline! Obviously I won't tell you the other things that it contains, as that would be a spoiler! So, I'm going to tease you and say that there are several really touching moments in this book, and I can guarantee that you'll be sitting there wanting to scoop several characters up and hug them.This book made me feel the happiest I have felt in a long time. I laughed, I nearly cried, and I felt as though I was on cloud nine due to the wonderful, wonderful characters and enchanting vibe. I truly didn't want the story to end - I wanted to hold on to that happiness for as long as possible, because I knew that as soon as I closed the book I was no longer part of 'The Bakery at Seashell Cove'.Take this book in your hands and give it the attention it deserves because I cannot think of a better book to settle down with tonight - and I'm not just saying that because it contains cake! A mesmerising, compelling, and enchanting read that had the recipe for perfection flowing through the entire book. Deliciously enticing with every turn of the page, 'The Bakery at Seashell Cove' is looking to be my top book of June. Simply perfect, I wish I could give it more than 5 stars."}, {"userName": "Karen Whittard", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/30631037-karen-whittard", "userReview": "Every so often a book will come along and speak to your heart and that you can relate to on a emotion level. This for me is one of those book, and I absolutely loved it. Seashell cove is a sounds like a really beautiful place that I would love to go and live there. Such a beautiful and stunning setting for a book. It is so lovely to find out about all these people who live here. For me this book touched my heart on a personal level and I found myself in floods of tears at certain parts of this book. This book was so true to how people treat you and speak to you about this personal subject. Not quite realising how their words or actions really affect you. People just word vomit and just expect you to be able to deal with things. Not quite knowing how deploy their words and actions can hurt. I thought this book showed this subject in a very true to life manner. In this book we met Meg Larson a character I wanted to be friends with immediately and immediately connected with on a personal level. Meg works in the Bakery in Seashell cove and has been working here for a really long time. It had always been her dream to run her own bakery and now her dreams are coming true sort of. Except for the fact that the Bakery has come under threat of closure due to needing to find a new owner as Mr Moseley the previous owner passed away and Didn’t leave the bakery to anyone in his will. Looking to make some money out of it Mr Moseley’s brother is determined to sell the shop to make some quick money. A tv programme has come to the little seaside town and wants to showcase the bakery as the star of the show and Meg is determined to use this opportunity to save the bakery. But will this happen? Will Meg be able to save the Bakery? And will the new owners keep Meg on and keep her dream alive? Meg is also getting married to her childhood sweetheart Sam. Everything is going well except for when Meg meets local estate agent Nathan who is put in charge of selling the bakery and Meg is suddenly over come back with as her friends categories it as a little ‘crush’ but which is causing Meg to have second thoughts about her relationship with Sam. When Sam goes away on a bike tour in France. Meg and Nathan get closer as Meg starts worrying about the future of the bakery, Nathan becomes Megs shoulder to cry in and Meg realised that they have much more in common then her and Sam. Will Meg get everything she has ever dreamed of? And her own happily ever after? Well you will need to read this beautiful book to find out This book is absolutely wonderful and I extremely enjoyed reading it. Karen’s books also manage to put a big smile on my face and are also feel good and like a big warm hug. If I could give this book more then five stars I really, really would. This is my favourite book of Karen’s that I have read. Just due to the fact that I felt that I related to the subject matter at the heart of this book. This book is uplifting, feel good and absolutely beautiful. I adored it."}, {"userName": "Nicola Smith", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/296328-nicola-smith", "userReview": "It's been so lovely to return to Seashell Cove and to meet up with Meg again. She first appeared as one of Cassie's best friends in The Cafe at Seashell Cove but this time she's taking centre stage. I must say, I do love this kind of series in which there is the familiarity of the setting and some of the characters but they can be read as standalone stories.First of all, don't read this book if you're really hungry. There is description after description of delicious cakes, breads, biscuits - you name it. But it made it the perfect book for me as I love cake!!The previous book had touched on Meg's relationship with Sam. They'd been together since school and had sort of drifted along over the years. I guess that for each of them, being with the other one was just the most comfortable and easy option. But their relationship lacks that special something and when Meg meets Nathan, the really quite delectable agent tasked with selling the bakery that Meg loves, she realises that maybe she's been settling for Mr Not Quite Right after all.I loved the fact that there's lots of baking in this book, and all the ups and downs regarding the bakery made for interesting reading too. I so wanted Meg to be able to run the bakery (she'd worked there for the previous owner before he died) and was just hoping that she got a chance to do so. There's loads of family stuff going on for Meg as well and her life was certainly a bit turbulent for a while, after years of bobbing along quite nicely. I thought she was an utterly charming character and I really wanted her to be happy. I love Karen Clarke's books. They're so easy to read, with engaging characters, heart-warming storylines and gorgeous settings, and she gets the balance just right between serious issues and light-hearted humour. Her books are a joy to read and she's one of those authors whose books I get excited about before I even know anything about them.Reading The Bakery at Seashell Cove is as pleasurable as tucking into a slice of your favourite cake. In fact why not do both at the same time and hit pleasure overload?! You won't be disappointed."}, {"userName": "Eve", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/28656604-eve", "userReview": "Meg and Sam are a young couple engaged and soon to be married. Meg works part time in a cafe and the rest of the time in the old bakery as it awaits sale after the death of its owner.Nathan whose overseeing the sale catches her eye and she starts to daydream about him much to the amusement of Cassie and Tilly her friends.When she gets the chance to take part in Britain's hidden gems tv show she talks of never knowing her father and her mum's agoraphobia amongst things and soon the world or at least programme viewers learn their business.Sam is too interested in Cycling and so she looks on Facebook and discovers George, a woman secretly in their cycling group. Whilst his family always seem to disapprove of Meg and judge her harshly.Meg's mum suffers with agoraphobia and is also constantly pushing Meg to get pregnant ASAP as she is unawares of her daughter's growing unease and feelings about her situation.So when Freya a rich local woman and her husband want to buy the bakery to become an ice cream parlour, Meh is unhappy but then an anonymous buyer appears...facing up to her relationship and work life woes Meh needs to turn her life around fast and make herself truly happy forever.This book was a lovely chick lit, women's fiction read and was full of drama. The writing was engaging and there were some hilarious one liners at times in this book. Meg's story will probably be relatable to women out there suffering the same issues. I would've liked some different scenarios with whom the anonymous buyer turns out to be but you shall have to judge that for yourself!Many thanks to the publishers for allowing me to review this book for them!"}, {"userName": "Robin Taylor", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/4484885-robin-taylor", "userReview": "Meg Larson has the job of her dreams, working in the local bakery, and making and selling her amazing cakes. She's about to marry her high-school sweetheart, Sam, and lives in a beautiful home. She finds the balance of her life completely thrown off when her boss suddenly dies, and the bakery goes up for sale. Meanwhile, all is not so wonderful with her relationship with Sam - whose focus is primarily on his cycling. Seeing cozy pictures of Sam with a female cyclist completely throws her.Meanwhile, real estate Nathan Walsh wants to see her dream of continuing on in the bakery fulfilled. However, the previous owner's brother plans on selling the building, no matter what the future plans are. It is patently obvious that, while the business side of Nathan should take precedence, that there is something deeper going on with him with regard to Meg.This is an enjoyable, light-hearted romance. Family is very important to Meg, so her being so drawn to Nathan comes completely unexpected. Despite her goals, and her troubles, she can't help how she feels about him. So the growth of her relationship with Nathan barely takes off in this book. It is more of a friendship, with a pleasant ending, making this simply a sweet story. This is the second book in the Seashell Cove series by Karen Clarke. Many thanks to Bookouture and NetGalley for this ARC to review.Date of publication: June 8, 2018"}, {"userName": "The Word Nerd Reviews Blog", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/26359999-the-word-nerd-reviews-blog", "userReview": "The Bakery at Seashell Cove is a light story of personal growth and discovering just what you want out of life now, as an adult may be very different from the dreams of youth. This is an engaging story, the author has an effortless writing style, and there are a few funny moments. Almost from the beginning, we learn that Sam is a self-absorbed jerk and that Meg really needs to get rid of him. Nathan is the alternative love interest and seems like the much better choice.I very much enjoyed this story, my only criticism is the supposed love story between Meg and Nathan. It really didn’t happen. The sum of their interaction is a few conversations and a couple of stolen kisses. That’s it, and then suddenly they are in love. I would have liked to see an actual relationship develop between them during the story, or have Nathan as the potential love interest that Meg moves on to after ditching the dastardly Sam and his critical family. Instead, the love declaration comes across as shallow and leaves a bit of a superficial taste to what could have been just a story about Meg finding her feet and deciding what she really wants from life.Regardless, this story was enjoyable. It had a few funny moments and quite a few times where I would have loved to be able to tell Sam and his family where to go! The romance element was sweet, I just think it was taken too far, way too fast. But it was only a very small element of this book, and overall it was a lovely light read."}, {"userName": "Between The Pages Book Club (Gemma M) ", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/36095519-between-the-pages-book-club-gemma-m", "userReview": "Happy Publication Day!What a delicious story. The Bakery at Seashell Cove is bound to get your tummy rumbling, with so much baking and yummy food! I loved reading this story and found myself falling in love with the bakery, the town and the characters!I loved Meg’s character, bless her. So passionate about baking! She may have a bit of a hectic life at the moment but she’s a positive character who takes everything in her stride… I also liked Nathan’s character too, the perfect man from the sounds of it and the picture i built up in my head! And a little mention for little charlie, he was cute! I must admit I did find Sam’s character a bit arogant and self centred. Hmm. Anyway…A perfect heart-warming story which I devoured in a day. Brilliant. I felt relaxed and right at home reading it the whole time as if I knew the characters all my life. Lovely. An easy to read, beautiful story with the perfect ending and a cherry on top (see what I did there?)… A well deserved five stars. Highly recommend! A perfect little getaway for your mind. A story I won’t forget in a hurry.A perfect read for summer 2018."}, {"userName": "Joanne D'Arcy", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/3430550-joanne-d-arcy", "userReview": "It is only a mere few days since I was in Seashell Cove and was getting to know Cassie and how she was trying to make her mark on her parents cafe.This time back in Seashell Cove we are with one of Cassie's friends who we were introduced to previously, Meg. Meg is a baker and bakes the cakes for the cafe and very popular they are too.Trouble is the bakery where Meg works is being sold so she is feeling a little vulnerable especially as her fiance Sam is more interested in bikes and racing than he is in Meg. But childhood sweethearts can overcome anything if they are meant to be together.Whilst Sam is away riding, Meg receives some rather shocking news about her family's past and what is exactly going on with her mother in the present. Turning to Sam seems the obvious answer but he is not being very forthcoming. Meg is starting to worry. To add to the worry of who will buy the bakery.Nathan comes across Meg in the bakery when he is there to sell the place and show round potential buyers. Meg is not keen on it being sold and not remaining a bakery but vows to silently bake until she can't anymore. Nathan seems quite keen for the bakery to remain and when a secret buyer is found and Meg finally gets her dream she suddenly can see what life might be like if you perhaps choose different ingredients.This is another great read from Karen Clarke. I was transported to the warmth of the ovens in the bakery, the dusting of flour over everything made the relationships sparkle. And I positively wanted to scream at Sam. Somehow it all works but it gives you enough to care about the characters and loathe them in equal measure as well as superb settings and great plot lines.I am wondering where we are going to go next with Karen Clarke."}, {"userName": "Stacey", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/44375937-stacey", "userReview": "As soon as I saw this novel pop up on Netgalley I knew I was going to love it. Karen Clarke's novels have a talent for drawing you in and making you feel as though you're right there next to the main character! I absolutely adore this cover. I love the bright colours - and all of Karen's novels make you want to read them just by glancing at the cover! It's stunning, as was the story.The storyline follows main character Meg, who is having a bit of trouble with her soon-to-be husband Sam and also the Bakery where she used to work to bake cakes. She feels in a bit of a rut, with Sam taking absolutely zero interest in her and her life ambitions, she starts thinking that maybe they shouldn't get married after all.As well as this, her beloved Bakery is up for sale and she's worried that whoever will buy it won't allow her to continue working there. Until, a mystery buyer comes and decides he wants to pay for the bakery to get back to it's former glory - and for Meg to run it! Meg can't believe her luck, but when she logs onto Facebook and sees that fiance Sam is cosying up to other cyclist George, she doesn't know what to think anymore.This novel is absolutely fantastic, I wished throughout this book that I could have friends as nice as Tilly and Cassie. And it was so nice to see characters that was in Karen Clarke's other novel: The Cafe at Seashell Cove make an appearance. It was like greeting old friends when I realised it was about the same group of people and I love every minute. I'm really hoping that there'll be a book about Tilly next, then we've got to know the whole group of friends!Overall, I absolutely loved this novel and there was no way that I could give it any less than 5 stars. I can't wait to read more from this author. Thank you to the publisher for a chance to read this novel via Netgalley, which I have reviewed honestly."}, {"userName": "Kim", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/2252657-kim", "userReview": "I absolutely loved this return to Seashell Cove- which sounds just the sort of place to spend a nice week by the sea surrounded by tempting cakes and bread for breakfast.Meg has dreamt of making a success of the bakery that she used to work at before the owner died. She also has a wedding to plan to her childhood sweetheart, Sam. But Sam doesn't seem to be as committed to their relationship as she'd like.The characters are all wonderful, even those that you'd probably hope to avoid in real life. There are some lovely surprises along the way and we are willing Meg to get her dream fulfilled. The cakes made me feel really hungry and keen to make something hopefully just as delicious this weekend.Meg has some soul searching to do and some tough decisions to make."}, {"userName": "Kathleen Gray", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/16056426-kathleen-gray", "userReview": "Wonderful rom-com chick lit with some underlying serious issues. AND, it's back to Sea Shell Cove, which seems like a wonderful place (don't worry if you didn't read the first one- this is a linked but not dependent series.). Poor Meg has a lot happen to her-the bakery where she works is up for sale, her fiancé Sam is a rat, her mother in law to be is overbearing, her own mom is agoraphobic and pressuring her to marry Sam and then....she meets Nathan. Nathan is the estate agent working to sell the bakery. Readers of the genre can guess how things will go for the two of them but Clarke makes the relationship special. Thanks to net galley for the ARC- this is a delightful read perfect for the beach or travel or just about anywhere."}, {"userName": "Alison Eden", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/61733639-alison-eden", "userReview": "#TheBakeryAtSeashellCove #NetGalley My usual go to book is crime drama so it was really nice to read this lighthearted English romance without any fear of a dead body turning up in the bakery!. It was lighthearted, funny and easy to read and it was fairly obvious early on how the Meg, Sam, Nathan love triangle was going to end, but nevertheless I really enjoyed this book. Set in a quaint seaside town with colourful characters and an endearing storyline not to mention some delicious cakes! This is a lovely summer read. I also appreciated the author adding the recipe for the chocolate and raspberry cake at the end of the book!!"}, {"userName": "Rachel Kennedy", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/61476690-rachel-kennedy", "userReview": "Second book in this series set in Seashell Cove, this time centred around Meg. She works in the cafe, but really wants to run the bakery which is currently for sale.She is engaged to Sam, her high school sweetheart, but is becoming more attracted to Nathan the estate agent selling the bakery. The more you learn about Sam, you find that although Meg supports him in what he wants in life, he does not offer her the same in return. but will she realise this before she loses her chance with Nathan?I received an ARC of this book in exchange for a voluntary and honest review."}, {"userName": "Jackie Wright", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/21982051-jackie-wright", "userReview": "Karen Clarke is a new author to me but that’s about to change because I loved The Bakery at Seashell Cove and I need to check her other books out. This is a fun easy to read book set in a quaint seaside town, the characters are loveable and this author has a way of making you feel like you are reading about the friends you miss from the seaside town you know so well. Seashell Cove sounds like the perfect place to live and I can’t wait to dig into other books featuring this town and it’s inhabitants for me this was the perfect read to introduce me to a new author. Great job Karen Clarke."}, {"userName": "Kelly", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/65692969-kelly", "userReview": "I’ve finished the book. I liked the book. There was drive to finish it to see what happened. However I can’t shake the feeling that Meg is just a bit too much of a wet blanket. This is not the book for you if you like your heroine to make things happen for herself and take a stand. This is the book for you if you like a damsel in distress where things happen for her and it all ends happy ever after. It was heart warming and well written but Meg is just too drippy. I’ll keep a note of the author and a couple more books might make the to be read list but they won’t be at the top of it."}, {"userName": "Janette", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/4119720-janette", "userReview": "I have read and loved all of Karen's previous books so I was excited read this one. I was not disappointed - I couldn't put it down. An easy read, a story of family, friendship, romance and delicious sounding cakes! Heartwarming, funny, lovely seaside location and strong characters I loved. A perfect cosy read for an afternoon on the sofa or in the garden. Highly recommended, I loved it! Can't wait for the next one!Thank you to the publisher and NetGalley for the opportunity to read this book in exchange for an honest review."}, {"userName": "Clara", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/16971783-clara", "userReview": "Karen Clarke is quickly becoming one of my must read authors.This is the second book in the sea shell cove series and it's a good one! I have to say that the main character Meg did annoy me a bit at times. I just wanted to shake her and say wake up woman!! She got there in the end and made the right decisions. Loved the story, this is what I would call the perfect cosy read, I'm really hoping we get another book in this series ."}, {"userName": "Paula Pugh", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/22456314-paula-pugh", "userReview": "I found The Bakery at Seashell Cove to be a refreshing and delightful book. A woman, Meg Larson, finally comes of her own, learning about what really matters and striving to achieve it. In her path is a fiancé who is more into bike races than into her, an overbearing future mother-in-law, and agoraphobic mother, and two of the best friends a girl can have. Throw in an adorable real estate broker and mix it all together for a perfect recipe for an afternoon read."}, {"userName": "Brenda Blair", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/44799562-brenda-blair", "userReview": "I found this book to be a pretty fast read. I loved the fact the Meg was able to find her self worth. She didn’t give up on her dream even when her fiancé didn’t approve. This book had its funny parts as well and showed that true friends stick together and true love provails. Such a light great contemporary read."}, {"userName": "Sharon", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/5492096-sharon", "userReview": "review to follow"}, {"userName": "Anjana", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/16053023-anjana", "userReview": "https://superfluousreading.wordpress...."}, {"userName": "MetLineReader", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/5585442-metlinereader", "userReview": "A return visit to Seashell Cove with its warm cast of characters. I always enjoy this author’s books and this was no exception. An enjoyable read which shows the bonds of friendships and the importance of going for your dreams..."}], "description": "A warm welcome and delicious chocolate gateau are always on the menu at the Bakery at Seashell Cove – and this summer, romance is in the air… Meg Larson thought she had everything she wanted: she works in the local bakery, she’s months away from marrying her high-school sweetheart, and home is beautiful, sunny Seashell Cove, where the sky is blue, the sea is turquoise and the sand is golden. Except that the bakery is up for sale and her fiancé Sam’s more interested in bikes than their relationship. When Meg receives shocking news about her family, he’s on a cycling tour and ignoring her calls – and posting selfies on Facebook with a female cyclist he looks far too cosy with... Luckily the bakery’s estate agent, Nathan, is understanding and funny, and as the summer goes on an unexpected friendship blossoms. When the bakery is given a second lease of life under a mysterious new owner, Meg realises a change might be exactly what she needs too. Will Meg find the happy-ever-after she dreams of in Seashell Cove? An uplifting, laugh-out-loud rom com that will make you dream of romantic days at the beach. Perfect for fans of Debbie Johnson, Holly Martin and Jenny Oliver.   What readers are saying about Karen Clarke:  ‘Had me properly laughing… A light-hearted, fun, easy-to-read story that will have you giggling.’ Rachel’s Random Reads ‘Karen Clarke has such a knack for writing hilariously funny one-liners. I have lost track whilst reading this how many times I’ve laughed out loud… Five Stars!’ Stardust Book Reviews ‘A fun and heart-warming read that had me feeling all toasty inside… Karen Clarke has become one of my must-read authors and is one I can rely on to cheer me up and chase those bad old blues away.’ By the Letter Book Reviews ‘This book had me laughing from page one. The story was light, funny, warming and LOL all the way through. I cannot recommend this book enough.’ Goodreads reviewer ‘Totally amazing… So heart-warming while funny as well. Full of families, beautiful seaside countryside and romance… An excellent book from the first page, has you hooked and so well written. I highly recommend reading this.’ Goodreads reviewer ‘Fabulous… With every book I read of Karen Clarke's she is becoming a firm favourite of mine. The setting of Seashell Cove sounded divine and I would have loved to visit for myself.’ Rachel’s Random Reads ‘I’ve read all of Karen’s books and have loved every one of them!... An absolutely perfect story to lounge around on the beach with. But, if you can’t wait that long, then grab a cuppa, turn on the heating and whisk yourself to the sunny Devon seaside for a couple of hours! Fantastic!’ Stardust Book Reviews ‘I absolutely loved it. Fantastic.’ Goodreads reviewer ‘This is a really fun-filled book.’ Goodreads reviewer ‘Another wonderful story by Karen Clarke.", "title": "The Bakery at Seashell Cove", "url": "http://www.goodreads.com/book/show/39337389-the-bakery-at-seashell-cove", "average": 4.16, "cover": "https://images.gr-assets.com/books/1521631680l/39337389.jpg", "reviews": 35, "authors": [{"url": "https://www.goodreads.com/author/show/2351838.Karen_Clarke", "name": "Karen Clarke"}], "type": ["Contemporary", "Womens Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/39337389-the-bakery-at-seashell-cove", "http://www.goodreads.com/book/show/33387759-the-beachside-sweet-shop", "http://www.goodreads.com/book/show/33979446-the-beachside-flower-stall", "http://www.goodreads.com/book/show/37612808-the-cafe-at-seashell-cove", "http://www.goodreads.com/book/show/35605750-the-beachside-christmas", "http://www.goodreads.com/book/show/23751896-my-future-husband"]}