{"ratings": 306, "userreviews": [{"userName": "Elizabeth", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/27276528-elizabeth", "userReview": "3.5 Sci-Fi/YA lovin' stars!\"You can't live life that way, worrying about what's going to happen. You'd be paralyzed. Living means taking risks.\"The Corridor is a fast paced Sci-Fi YA novel. The concept behind the novel is fresh and the writing was rich with description.Stel lives in a dystopian society at in the future. In her world exists a “corridor” or gateway to other worlds. The corridor has been found to be unstable. Stel’s dad has been a huge contributor to helping her world find success through scientific advancement. However, recently he was torn from his position by none other then a close family friend (who coincidentally is also her best friend’s mother).Justin, Stel’s brother, is currently working as a guard in the regime. Although he loves his father and sister, clearly he is loyal to the government and wants to support their mission. Stel discovers that she has special gifts and she herself is in fact able to create a “corridor” to other worlds. Through this discovery she meets Cohl a human that lives in another world.\"Then I noticed my hands. A pale blue circle of light glowed inside each one of my palms.\"Overall, The Corridor was an enjoyable read. As with most \"first books\" in a series, there was quite a bit of information to cover. At times, I would need to “re-read” sections in order to decipher all of the information. However, the characters are extremely likable and the young romance budding between Stel and Cohl is very endearing. There was a great deal of action in this book which kept the tempo paced at a comfortable rate. I will definitely be on the lookout for the next book in this series."}, {"userName": "Sarah", "userReviewDate": "Jun 17, 2015", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "(Source: I received a digital copy of this book for free on a read-to-review basis. Thanks to Alloy Entertainment and NetGalley.)\n“Light kindled inside the portal, sparking like a fire. Electricity cracked in the air.My dark brown hair rose from my head and stood on edge. My body subtly vibrated, teeth chattered and ears rang with the noise.Then my entire world ignited.”\nThis was an interesting YA sci-fi story about a girl who could open portals to parallel universes.Stel had a real problem in this book, being able to open portals to other universes was a difficult talent to hide, and trying to work to what to do for the best was also quite difficult. I did think she did well to try and use her talent for good, but other people didn’t make things easy for her.\n“I squeezed my eyes shut, positive I was hallucinating. Whatever the Corridor had done to me – it scrambled my brain.”\nThe storyline in this was about Stel trying to work out how many other parallel worlds there were, and also trying to find out if what the techs on her Earth had planned was likely to cause a catastrophe the way it had on Second Earth (the only other dimension that people on Stel’s / First Earth knew about). I thought Stel did a good job of trying to help when she could, and also of using what she could do to her advantage.\n“It was getting easier to control the power ith every port, but each time was such a risk.”\nThere was a bit of romance in this, but it wasn’t the main focus of the story. Stel and Cohl were quite cute together though.\n“I pushed my mouth into his, cutting off the words. I brought my hands up to his face and kissed him,”\nThe ending to this was a bit of a cliff-hanger. It will be interesting to see where the story goes from here.6 out of 10."}, {"userName": "Lia Park", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/7348023-lia-park", "userReview": "You can take a look at my blog Bookland@wordpressCheck out my twitter BookLand@twitterAlso you can like my fb page Bookland@facebook\nArc kindly provided by the publisher, via netGalley, in exchange for an honest review .\n The Corridor was an easy and enjoyable read. I can't really say that I went wild while reading it but it was decent.It started a bit boring but the plot was promising and intriguing. After reading 30% of the book it felt like things were getting better and faster. A.N. Willis writting style is pleasant and not confusing. I had no trouble keeping up with the story and the trasition from Estele's feelings to information and dialogue had a flow. I was inside her head and I was easily able to see her surroundings without getting lost. Reading in a different language than my own is not hard but simple and elegant writting style like the one in The Corridor make it easier for me. Gladly!  We were introduced to Estele, a girl with the ability to travel in parallel universes. This wasn't normal and she was trying to hide it because it was dangerous. All she needed was to be normal and leave a quiet life. Estele is the kind of girl who would do anything for her family and the ones she loves. She didn't know it but she was brave and determined and when her dad needed her in order to save their world, she was ready to sacrifice herself and reveal her powers.I was really satisfied with Estele's thoughts, feelings and reactions; they seemed realistic to me and that's how normal people would have acted if they happened to be in her shoes.I admit that her Chol, her love interest was kind of uninteresting and forgetabble and their romance was rushed and kind of awkward. I mean, yeah the attraction was there since the very beginning but escalated quickly, out of nowhere. They didn't even met eachother more than, what? Five times?That was my only objection. Other than that, Chol was pretty ok and I can say that if he had a bigger part in the book I would have liked him more.The book had a lot of action and twists that I enjoyed and the romance was not the biggest part, thing that I appreciated. There were a couple of characters that I disliked and others that earned my trust with a bit more effort. Estele had to go through a lot in order to trust the right people and actually see what was in front of her. I enjoyed being in that journey with her, putting my faith in her to make things right.The book ends with a cliffhanger and the second book has already my attention.Hopefully we will get to see more of Cohl and his world and I can't wait to find out about the new world that was promised to us."}, {"userName": "Allie", "userReviewDate": "Jun 12, 2015", "userURL": "http://www.goodreads.com/user/show/3389375-allie", "userReview": "***Copy provided by publisher in exchange for an honest review***\nThe Corridor is a fantastic novel about a multiverse. In this multiverse, numerous alternate dimensions exist. And there's a way to travel between them. Doing so has cost many alternate planets severely, and has led to death on a large scale. Yet, physicists are desperate to find a way to stabilize this transportation between alternate earths and continue to root out more dimensions. In each dimension, little changes exist that are crucial to solving the mystery behind the Corridor's instability and are the key to preventing another wave of destruction across any of the planets in the multiverse. \n\"Mod physicists like Dr. Kantz had spent years and trillions of dollars constructing this portal. They'd supposedly dreamed of sharing their world's amazing technological advances with all human civilizations, across all dimensions. But when they'd stepped inside, the Corridor unleashed a catastrophic blast of energy back onto Second Earth.The Pulse...Death and destruction - the true legacy of the Corridor.\" \nThe concept of The Corridor had me intrigued from the very beginning. I was entranced by this idea of traveling between dimensions and being able to see how little changes caused entirely different situations and planets to be born. Already hooked on the story line, Willis' novel further pulled me in through her fast and sharp writing, and the well developed characters.Estele is the main character and we get the story through her point of view. Estele is also different than the people on her earth. She possesses a dangerous power, one that lets her travel between dimensions without the use of the scientific abomination known as the Corridor. Stele's gift also puts her in danger of being labeled a Mod - a genetically modified person from Second Earth. Mods are typically imprisoned or used for their abilities to the point of torture, especially on Stele's version of Earth. \n\"Mods were seen as unpredictable, as dangerous. Would my power be seen the same way? No Mod could open a portal between her own hands, and walk into an undiscovered universe as easily as walking through a door. Yet, somehow, I could. I had the power - and maybe even the instability - of the Corridor itself, hidden beneath my skin.\"\nFor the most part, I really enjoyed Stele. I think she's a strong female lead, and I think Willis presented her in a manner that was realistic and had me supporting her in most endeavors. Stele was also really compassionate and desperate to belong somewhere. For most of the novel, she feels truly alone and like she can't share this dangerous part of herself with anyone. She also dedicated her life to her family and refused to give up on them. All in all, Stele was a brave woman and a leader that I enjoyed getting to learn more about and watching her journey.As for the other characters in the book, both Ana, a Mod who Estele helps escape from captivity, and Cohl, the main male interest, I thoroughly enjoyed. Ana is a quick witted, feisty Mod from Second Earth. She lived through the Pulse and destruction of her own planet and has had to deal with the trauma and the guilt from that disaster. She's also extremely loyal and an overall brilliant character. I particularly loved how Ana and Stele's relationship came together and grew, as I think they both really needed each other. I'm looking forward to seeing how Ana's character continues to play out in the upcoming installments of this series, as she's one of my favorite characters.\n\"I took her hand, holding it in my own. Tension stiffened her arm, as if she wanted to pull away. But she didn't. We sat there together, no longer Mod and First Earther - we were just two people, far from home. And for the first time in so many long months, I didn't feel alone.\nAs for Cohl, he was extremely interesting. It's always a rare (and nice!) surprise in YA when there isn't instalove. Thankfully, The Corridor features none of that. The romance in this novel takes a backseat to the bigger issues (YES!) and is a slow burning one. I thoroughly appreciate how Stele didn't become entirely consumed by Cohl and let the pressing issue of the Corridor and certain doom take the steering wheel.Overall, I think The Corridor was a great first installment. There was a lot of world building, but once you get past that I think the story moves really fast and that you will get into it just as much as I did. I'm looking forward to the next book in this series, \nThe Thirteenth World\n, which comes out in the fall, so I would definitely jump onto this series now."}, {"userName": "Jessica (Goldenfurpro)", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/8096484-jessica-goldenfurpro", "userReview": "This and other reviews can be found on The Psychotic NerdI received an ecopy of this book via Netgalley in exchange for an honest review.\nMY THOUGHTS\nI adore the premise of parallel worlds, it's probably my all-time favorite topic, and I will pick up anything that even mentions them! I felt like this book incorporated parallel worlds very well! This book was intriguing, fast-paced, with lots of twist!This book takes place in an alternate future. In Stel's world, there's a mysterious portal, called The Corridor, that takes you to an alternate Earth, Earth 2. The problem is that The Corridor is dangerous. More than half of Earth 2's population died with he creation of The Corridor. A burst of energy from The Corridor accidentally gave Stel the ability to travel to other alternate Earth's, safely, but she must hide her ability. When the people of her Earth start going dangerous routes to erase The Corridor, Stel knows that their routes could destroy their world, but she's powerless to stop them. Stel has to travel to other Earth's to find out more about The Corridor and how it can safely be destroyed.There was a lot going on in this book! This book does not have a pacing problem at all! In fact, there was so much going on and so much information to grasp, that sometimes it just felt like too much. That's one of the few downfalls of this book, but for a first book in a series it's kind of hard not to dump a bunch of info. Especially with such a scientifically packed novel! Despite this, I still felt like the world-building (world-buildings?) was well-done. My tiny brain could still grasp the science and be astounded by all the action and twists occurring in the book! I really need to stop and appreciate the amount of work, research, and just overall imagination it takes to create this story! Also, PARALLEL WORLDS! Like I said, I adore it when books include parallel worlds and I was not disappointed in this aspect and it actually made me really enjoy this book. As for romance, it was okay. It wasn't annoying or bad, but it didn't click with me completely. The love interest was a great guy, but he's kind off your average love interest.Lastly, I would like the warn you that there is a bit of a cliffhanger.\nIN CONCLUSION\nOverall, this was a very surprising read with a very intriguing plot! I had a few minor issues, but I overall enjoyed this book and think it's a fabulous sci-fi! I'm looking forward to reading the next book!"}, {"userName": "Kirsty (Amethyst Bookwyrm)", "userReviewDate": "Jun 20, 2015", "userURL": "http://www.goodreads.com/user/show/7436809-kirsty-amethyst-bookwyrm", "userReview": "Thanks to Netgalley and Alloy Entertainment for giving me this book to review.The Corridor, which is a portal to a parallel earth, which is called second earth, appeared 17 years ago. The Corridor almost destroyed second earth and has humans called Mods who have powers. Estele has lived near the Corridor all her life but when it fluctuates near her, she discovers she has a dangerous power to open portals, not just to second earth but other earths. When the Corridor starts to fail, Estele has to somehow save her earth, with the help of an escaped Mod and an arrogant man from another earth, they have to find a way to stabilise the Corridor before it is too late and everyone she has known is destroyed.The Corridor is an enjoyable YA sci-fi novel, with an interesting idea of the parallel earths and has some romance, twists and some action. It was a bit slow paced at the beginning but it does pick up, however, it is not helped with the book skipping the 6 months when Estele is experimenting with her new powers.I liked Estele as she was a strong lead who is self-reliant as she did not turn to anyone when she developed her powers and wants to belong. However, she was not as strong as Ana who is haunted by guilt but is still feisty and adaptable. I really liked the romance in this as it was not the first guy we met and Estele was interested in. I liked this book and I am looking forward to reading the next book The Thirteenth World. I would recommend this to fans of YA sci-fi fans. This and my other reviews can be found at Amethyst Bookwyrm"}, {"userName": "Cheyanne Young", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/34173981-cheyanne-young", "userReview": "This is the perfect read for someone who likes adventure, sci-fi, and swoon worthy love interests. Luckily, I happen to love all three. This story is about Estelle, who lives near the corridor, a portal to a parallel universe where there's another earth. The corridor is highly unstable and basically ruined the second Earth that it was created by, leaving First Earth with some creepy Mod residents. When the corridor freaks out one night, Estelle finds herself with a special modification of her own - she can create a portal to other universes all by herself. Her portal doesn't just go to Second Earth, it takes her to any of the other 12 parallel universes. During her adventures, she meets a Mod who just wants to get the hell out of First Earth (probably my favorite character in the book), and two hot guys from another Earth that's slightly more advanced. The information she learns in the third universe is absolutely vital to the survival of her own Earth, but the head of the Corridor, Dr. Tabor is hellbent on ignoring the facts. Plus, it's kind of hard to make someone believe you when you can't tell them where you got your information.I won't ruin the story here, but this book made me FEEL THINGS. I adored the love interest and the whole idea of falling for someone in an alternate universe. Talk about one hell of a long distance relationship. The twist at the end had me gripping my Kindle, dying to know what would happen. I am totally in love with this series and can't wait for book 2!(I received a copy from Net galley for an honest review.)"}, {"userName": "Carrie Esposito", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/1933353-carrie-esposito", "userReview": "The Corridor is an excellent science fiction young adult novel that explores the possibility of parallel universes. The main character, Stel, is engaging as she struggles to understand herself and the power she possesses that when unleashed to its fullest capacity has the potential to change not only her, but the entire multiverse.What makes this novel special and sets it apart is its incredible emotional life. We feel Stel’s losses deeply as well as her passions, particularly for Cohl, a dark and mysterious boy who sparks something in Stel that she can’t ignore. Lastly, Mods, pulses, multiple Earths, and other carefully crafted elements make the world of The Corridor unforgettable. Readers will be yearning for the sequel after the last page is finished."}, {"userName": "Giovanna", "userReviewDate": "Jun 04, 2015", "userURL": "http://www.goodreads.com/user/show/23204207-giovanna", "userReview": "*I received a copy of this book through Netgalley, in exchange for an honest review.1.5I'm extremely sorry because I did want to like this book but...it's so messy.The concept was interesting, but the plot is all over the place and the insta-love was almost unbearable. It is a quick read, even too quick, but the concept couldn't make up for all those flaws."}, {"userName": "Christina", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/40300958-christina", "userReview": "The concept of this book was pretty awesome. Multiple universes? Check. Trans-dimensional travel? Check. This book hooked me in from the very beginning and kept me reading until the last page. The first book in a new series, it left me wanting more. Where's the next book, please?Stel is a normal girl on First Earth, until a horrible energy surge gives her powers to open portals to any other dimension of Earth. Throughout the book she struggles with her new gift and the implications it could have on her and her world. But she grows. She learns to use it and control it. Stel is a slightly complex character. She wants what's best for her world and for her father. She doesn't necessarily know what that is, but she's always willing to put him first. Meeting Cohl changes things slightly for her. Their relationship is slightly awkward, but that is what makes it so great. From the first time we met Cohl I instantly liked him and knew he would play a major role in the story. And their awkward romance is so realistic that I found myself laughing while reading it. Because romance is never perfect. It's messy and weird. And it's conveyed very well here, even if that's not the main premise of the story.The setting of The Corridor was brilliant. Even though the worlds were all so similar, just little differences made each one its own separate place. And these differences were conveyed so well: through the difference in technological advancements, the lack of people, whatever. Each Earth was the same Earth, yet it was so vastly different from the next. The Corridor asks the question: do we have an infinite number of universes?Overall, I really enjoyed this book. I am now anxiously awaiting the sequel. It's much recommended to fans of science fiction, fantasy, and dystopian novels."}, {"userName": "Hannah L (Reviewer)", "userReviewDate": "May 13, 2015", "userURL": "http://www.goodreads.com/user/show/8532981-hannah-l-reviewer", "userReview": "In The Corridor, there are multiple dimensions and universes, and the main character Stel Alaster can open portals to them all on her own. When her world is threatened by the potential creation of a new Corridor, which could cause a second Pulse and kill everyone; she is forced on an adventure with two 'other dimensions' inhabitants.  Very intense and thrilling, The Corridor takes the reader on an adventure through dimensions and parallel worlds. I found The Corridor to be interesting and pretty creative in it's concepts and story telling. Also, I found myself very emotional when it came to the father. His character was very kind, yet such a workaholic I found myself very frustrated with him. I loved the romantic interest in this novel, with his intelligence and strength... and general hotness; but I struggled with his moodiness. To top that off, I was bothered how they just made the other guy kinda just disappear from the story. I found it abrupt and a little lazy. (I specifically did not use names to prevent spoilers) I liked Stel as a character. She is loving, strong, intelligent and resourceful. Plus, her powers were pretty awesome. Her ability to open portals between her hands, where ever she is leaves a lot of opportunity for awesome plot twists and turns in future novels. I am interested to see where this series goes and give The Corridor FOUR OUT OF FIVE STARS!Want more of me and my reviews? Go to: http://thenotsopubliclibrary.blogspot..."}, {"userName": "Jessica | Booked J", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/5392797-jessica-booked-j", "userReview": "FULL REVIEW HERE: http://bookandbroadway.blogspot.com/2...and soon to be here: http://bookgirl.co.vu As a note, an e-galley of this novel was sent to me via NetGalley by the publisher in exchange for an honest review. This does not effect my opinions in any way.THE CORRIDOR by A.N. Willis has been on my most anticipated list for quite a while now and thankfully, it didn’t disappoint me. Within the first chapters, I knew that it was on the track to becoming one of the best young adult sci-fy releases in 2015 with its engaging plot that centers around one girls ability to travel within various parallel universes.Readers who aren’t used to sci-fy stories could easily lose themselves in this, it could be the first real experience of the genre for them, because it’s simple and thrilling and has an excellent leading lady in Estele. There’s something undeniably smart and suspenseful about the entire story that makes it engaging in the manner that you don’t want to put it down.Needless to say, the plot is as fascinating as the description would lead you to believe and it keeps you on the edge of your seat the entire time. It’s easy to imagine the colours of each world passing us by as Estelle explores and reads quite a bit like a movie or television series; which is awesome. I can certainly see this novel being adapted sooner rather than later and frankly, I need it NOW! I just need more of these worlds."}, {"userName": "Ana", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/33471531-ana", "userReview": "[how the story Justin told about the kids was crap, what happened to the people in the Barrens and who would end up betraying Estele, although I have to admit I thought Lissa would too. And I never understood why Dr Tabor wanted to build the second Corridor, knowing it was so dangerous. Estele kept wondering that too but I never got an answer. (hide spoiler)]"}, {"userName": "Jamie (Books and Ladders)", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/6759237-jamie-books-and-ladders", "userReview": "This review was originally posted on Books and LaddersDisclaimer: I received an advanced review copy of this book on NetGalley in exchange for an honest review. Thank you to Alloy Entertainment for the opportunity.First of all, this is a beautiful cover. Like I am in awe with how beautiful this cover is. It is one of the reasons I wanted to read this one, but once I read the synopsis, I was hooked. And the story delivered.Stel was an interesting character. She was really dependent on her family and wanted to make sure her father was recognized for being the brilliant man he is. As well, she wanted her brother to see it, to see that his worship of his boss -- and her former bffs mother -- was unjustified. I did however think that this plot line was too easy to solve in a way. It was really black and white, clearly Dr. Tabor was in the wrong and eventually she would show her true colours. I thought that Stel forgave Lissa too quickly considering Lissa was her bff and then ditched her with no communication for months on end. Especially since Stel was the one to reach out to her, not the other way around. I think that none of the minor characters were really well developed, but especially not this Lissa or the rest of her friends. Even Ana wasn't that well developed considering how many scenes she was in. I hope her character expands more throughout the series, especially after the ending!I liked the multiuniverse thing until we met Flinn and Cohl. It was so obvious that it wanted to be a love triangle that it actually tried too hard to be one. And Cohl and Stel's relationship was too quick and unrealistic in my opinion. I mean, I know a lot of young adult dystopian novels have these insta-loves, but this one was just awkward. She hated him then two days later she was in love with him. It wasn't well-developed and I think Stel deserves a better explanation of her relationship. The weirdest part to me was the Mod stuff. There was no explanation as to why they were genetically modified. I assumed it was because of the pulse but I'm not actually sure that is why considering we found out information about some of the Mods that apparently came before the Corridor was built, meaning they would have been Mods before the pulse. So I'm not really sure. Unless I misunderstood that?Overall: 3.5/5 stars for hooking me in but having unrealistic relationships."}, {"userName": "Ranu", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/36627561-ranu", "userReview": "*An advanced copy of this book was given to me through Netgalley in exchange of an honest review.Find more reviews on my blog: The Bookish LifeHave you ever finished a book, put it down, and then wanted to scream out loud in agony because the characters and the plot and the ending were so marvellously, amazingly good? This book certainly made me feel that way.So where do I start? I absolutely loved, loved, loved this book. To begin with, it was science fiction. Very few people can pull of science fiction to be as engaging and thrilling as The Corridor without boring the reader to death with huge info-dumps which only manage to confuse everyone.First of all, I loved the premise of this book. It's set in the future, where scientists have discovered a portal, which they call a corridor, that can take you to to an alternate Earth (Second Earth). It was absolutely fantastic how the author explains the theory without making it too complicated or taking too long. It was also believable. This book embodies how YA science fiction should be written.The, the characters. All of them had so much depth, and were three-dimensional. Our protagonist, Stel, was brave and kind and just so relatable! I loved the way she saved Ana, and also the relationship they built slowly. Ana was my favourite secondary character.Oh, and let's not forget Cohl. I seriously haven't met such a swoonworthy, complex and broody character since Will Herondale! One of the best things about Cohl was the different ways in which he was portrayed. There was Cohl the Major Jerk, angry Cohl, mysterious Cohl, broody Cohl and happy, relaxed Cohl. I love it when authors do that; letting us see the different sides to a character at different times, and making us love them as a whole.Lastly, the plot. This book just threw huge plot twists at me over and over again, yet didn't confuse me or give me the feeling that it was too fast-paced. There were no places which dragged or just had pages and pages of boring, confusing exposition..The Corridor is a perfect book for science fiction lovers and everyone who enjoys an action-packed, engaging book with a spunky female lead and fantastic supporting characters. Highly recommended."}, {"userName": "Bailey Riddle", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/1476961-bailey-riddle", "userReview": "*I was provided a copy of this book via NetGalley in exchange for an honest review. All opinions are my own.*Imagine a world in which there is not only one Earth, but many Earths, with the possibility of traveling between each of the Earths and finding the same planet with different people, different technology, different ways of life. This is the world of The Corridor.A group of people from the Second Earth open up a portal to First Earth, but this has unexpected consequences when it causes chaos and destruction on Second Earth, killing many of its inhabitants. Seventeen years later, an unexpected energy pulse occurs at the portal, leaving Stel with a mysterious power that allows her to open up portals to the other Earths. On her journeys between Earths, Stel meets two brothers, Flinn and Cohl, who both help her in their own ways. While with the brothers, Stel finds information that could help her father put an end to the Corridor between First and Second Earth once and for all, but there are plenty of people who stand in his way.Stel is a very strong character, which is why I took such a liking to her. While she is still relatively young, she is independent and does things that are difficult, simply because they are the right thing to do. She is also a caring loving person who wants to look out for the best interests of those who are dear to her, even if it means she can't always see things as they are.This book was a pretty quick read for me, and I enjoyed it quite a bit. Even though the idea of portals between worlds is not a new one, the way that the story was portrayed made it feel very new and unique. Overall I would give the book 4/5 stars."}, {"userName": "Perks Of Being A Fangirl", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/12344513-perks-of-being-a-fangirl", "userReview": "'\"I know I wouldn't want to be standing right here with anyone else but you,\" I told him. That was all I could see right now- this moment- so it was all I could give him. But maybe that could be enough.' Rate: 3.5I was seriously contemplating on giving it a DNF because nothing really spiked my interest.It was dragging on and I wanted some action. But thank god I soldiered on, it got so much better after posting my update at 27%. From that point onward I sped through the book. Everything came together and made it a more enjoyable experience. The characters, the worlds, the Corridor they made this book really interesting and I'm intrigued for the next book.The reason that I did not give this book 4 stars was that the plot was very slow at the start which can make some readers feel bored and discouraged to read further. If A.N Willis builds the plot up more quickly in her next book I would thoroughly enjoy the entire book. I'm automatically drawn to next world that A.N Willis will create for the next book in the series and I would recommend this book to anyone who loves sci-fi, YA books."}, {"userName": "Carolyn", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/92620-carolyn", "userReview": "I love the fact that Willis says that the idea for this book came to her in a dream --the multiple Earths named after the signs of the Zodiac definitely has that uncannily \"on-ness\" that happens in dreams. But there are so many layers to this book - Stel, the protagonist, is fully drawn, with an ability to move between worlds that could have her locked away because her society fears such powers, and a mission to help her ailing father. Like other readers have mentioned, I appreciated that Stel's love interest didn't swamp her fight. (maybe b/c I have a daughter...)I also loved that Willis touches on the political --there's a power struggle for control of the scientific Facility between Stel's father and the mother of Stel's best friend, and there are \"Mods\"- genetically engineered beings that the residents of Stel's world fear so much that they turn a blind eye to their mistreatment. Given the way the novel ends (I'm trying not to spoil anything here!), with Stel's personal life in disarray, and her safety at risk, I'm very much looking forward to the sequel!"}, {"userName": "Kirsti Call", "userReviewDate": "Jun 06, 2015", "userURL": "http://www.goodreads.com/user/show/900890-kirsti-call", "userReview": "I got a copy of this book from netgalley in exchange for an honest review. SPOILER ALERTThis story is an action packed, compelling, sci-fi YA with a sprinkle of romance. This premise of this book is intriguing. There are two different versions of earth connected by a portal called the corridor. Estelle, the MC, is a normal girl until she's close to a corridor energy surge and becomes someone who can make corridors herself. What I liked: The characters in this story are real and likable. Estelle is sweet and scared and a realistic teen. What I didn't like: I felt like some of the plot points were predictable. And I felt that Estelle should have realized that her brother would make some of the choices that he did. I also wondered at how quickly Estelle felt attracted to Cohl after thinking he was creepy.I really enjoyed this book and I can't wait to read the next book in the series."}, {"userName": "KEM", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/43216881-kem", "userReview": "This is a rare treat. A sci-fi thriller that's exciting and fast-paced for casual fans, but also hits on a deeper level with its characters and the amazing universe(s) it creates. Even better, the author weaves in enough real science to appeal to the nerdier sci-fi genre people (like me) who love the world-building aspects of these books above everything else.This is a must read for YA fans, sci-fi fans, and all my fellow dorks who got excited by every time-travel/multi-dimension episode on Star TrekI've already read it twice . . . now I just need to figure out what to do with myself until the sequel comes out!"}, {"userName": "Melanie", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "The Corridor was a fun and unique read, but it did have a few things I didn't like (insta-love romance and a skinny dipping scene that was a little uncomfortable to read). Still it was interesting and quick to read. I'm not sure if I will read the next book or not.*i received a compliment ebook copy via netgalley for my honest review. As always, all thoughts and opinions expressed are my own.*"}, {"userName": "Jeanne", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/43218496-jeanne", "userReview": "Willis manages to create a fast moving and compelling story that is pure fun and adventure with characters you will love and loathe. It is beautifully and intelligently written so that I felt I was in Stel’s shoes and heart through her highs and lows. I am so looking forward to the sequel and what other books A. N. Willis has for us in the future!"}, {"userName": "Cooleen Books", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/32223996-cooleen-books", "userReview": "4.8 / 5 stars. Loved it. Can't wait till it's released so everyone can read it ❤️"}, {"userName": "Sophia (Bookwyrming Thoughts)", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/12463408-sophia-bookwyrming-thoughts", "userReview": "This review and more can be found at Bookwyrming Thoughts.Original Rating: 4.5 out of 5.An ARC copy was provided by the publisher for review via Netgalley.It seems, that books relating to parallel universes are like mermaid books and contemporary books: I either get along with them, or I don't get along with them.It's no brainer that a book involving parallel universes as A Thousand Pieces of You and The Corridor have would be extremely scientific in its explanation. An information dump is (or maybe just a dumbing down of information) bound to happen if the authors want me to make sense of their parallel universes.But somehow, I enjoyed a story concocted by A.N. Willis far more than a story concocted by Claudia Gray (parallel universes related – I DO like Claudia Gray's other works), even if my first thoughts reading the first chapter was, \"Oh, no. Parallel universes. Please don't disappoint me, A.N. Willis.\"I find that I'm actually not disappointed – I really enjoyed the first book in the Corridor series, and I was pretty engrossed with Willis' writing. I wanted to know more than what the author actually wrote – Estele's power, Dr. Taber's betrayal years ago. I even found myself interested in the science of the universes that the scientists were seeing and the different \"Earths\" Estele visits using her power. And I am not generally a science person, regardless of the fact I think Chemistry is easy and passed it with a fabulous A-.(Maybe I'm a chemistry kid rather than a physical science or biology kid. I guess I can't run away from math after all. What if I'm an accountant one day?!?!?! I won't complain, of course, since it's baby math...)There were moments that I found myself confused on which Earth the characters were talking about – each world has different names for each of the other Earth. The original Earth simply went with First Earth, Second Earth, and possibly so and so forth if they found any more. Estele went with calling First Earth and Second Earth whatever the scientists called them, and came up with names that were significant to that Earth when she first visits. Another version of Earth was further advanced and found more twelve Earths in total, and went with the zodiac in naming each of them. I found that while the more advanced Earth was far more complicated, Estele's version seemed to make things a lot more clearer in matching up the Earths.Possibly the biggest difference between A Thousand Pieces of You and The Corridor was how Marguerite actually uses a device while Estele somehow has a power to travel across worlds. I personally found that really cool and interesting, and as mentioned earlier, I wanted to know more about that power as much as Estele did.By the time I actually got to the end of the book, I was pretty disappointed... in a good way. I suppose Willis did disappoint me after all. I honestly have no clue where the author is going with the series, but I'm hoping the sequel will be just as good as the first one is."}, {"userName": "Aparajitabasu", "userReviewDate": "Jun 25, 2015", "userURL": "http://www.goodreads.com/user/show/4790652-aparajitabasu", "userReview": "Original Link to the review at my blog Le' Grande Codex - here\n----The first of the series, The Corridor is a fast paced sci-fi drama about alternate realities or multiverses, alternate Earths. There is never any conclusive proof that alternate realities exists bit if you (like me) are sci-fi nerds with an open mind then you'll believe that our choices coupled with all that 'what if' scenario available on a grand scale, then anything is possible. Just believing is the key. But we are weening off topic, A. N. Wills spins a vivid and imaginative spectrum within its pages around the portal - the Corridor through which inter-dimensional travel to other worlds is very much possible.The Corridor is a much coveted technology on First Earth but it is also unstable. Where one such bout of fluctuations gave protagonist Stel Alaster her unique ability to be able to create portals on her own. But necessarily doesn't understand what it would mean for her. First Earth is a bleak dystopian world where having powers like that makes you inherently a mod (and gets you tagged), refugees from Second Earth. She loves her family very much but doesn't know what to do with them. Her absent minded father, who was once a great contributor of the Corridor's maintenance and study, now relegated to the position of a lowly scientist or her brother, who puts much more stock in the beliefs of his new manipulative boss than his own family.Suffice it to say, she satisfies herself by doing her own explorations of her new found powers. One such incident leads her to a different inhabited world, where she meets Cohl. A cocky and brash testosterone fueled teenager who tends to hide his true nature behind an indifferent and angry mask. Of course the attraction between Stel & Cohl is instant and felt rather rushed but in this situation that can be quite believable. Stel is someone who would give it her all too her family and loved ones safe and Cohl readily accepts that and helps her as much in her endeavors to save her world.Starts out slow and ending in a high octane battle across realities and the confines of time & space. The Corridor sets the ground work for the sequels (yes this is a series) in vivid proportions. Be it the technology to travel through dimensions or lush Earths or consisting of characters with questionable motifs and all the actions and twists & turns woven throughout the pages makes this a book you shouldn't miss out on. Add a strong and inspirational protagonist like Stel, who goes through cosmic proportions of hardships but comes out still maintaining the love and compassion for friends & family .... Of course it just had to end on a cliffhanger ...... Definitely on the lookout for the next book because really cliffhangers are a pain.\n\n\"Fast paced, astoundingly scintillating and scientifically vivid. Keeps your attention\""}, {"userName": "Theo", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/32013181-theo", "userReview": "**Copy provided by Netgalley in exchange for an honest review**The thing that disappointed me most about The Corridor was that it had potential. So much potential. But it was let down by the character development and the progression of the story.Probably the first thing that irked me about The Corridor was the time skip. Six whole months from the first chapter to the second. We are told later in the story that Estele did certain things in these six months, like exploring the Barrens and learning to control her powers. We are told a lot of things during this story, and I am left to wonder... why were we shown none of this? It would have made a huge positive impact on the novel if the author had included these things.One of my biggest pet peeves is protagonists who seem to have the memory of a goldfish, especially when it comes to friends and love interests. That and instantly forging bonds with people without any sort of development. There were so many instances in this story where it happened that I don't know if it's possible to list them all. These were the main ones I can recall:- Estele and her friendship group. The beginning of the story makes it seems like she has one friend - Lissa. Then suddenly an old friend pops in and she hangs out with them for a whole scene and references things they used to do together. Do you think we ever hear of any of them again? Nope. Well, one of them got a brief mention, but that is about it.- Flinn. The moment Estele meets him she's totally falling head over heels in lust with him. Then she spends all of two scenes with his brother and it's like, Flinn who?- And Ana. After spending one night with her and Cohl, they are suddenly bff. Do you know how much of that friendship we got to see? Zilch.- Cohl! One moment he's this creepy guy who essentially stalks her, the next? Almost insta-love.Estele and Lissa's friendship was also another source of frustration from this book. There was no substance to it! Absolutely none! We're told all these things about how their friendship was, and you know how much of it I believe? Zero. It felt very fake, as with most of her relationships, and in suit left the story feeling a little wooden.Still, as much as these inconsistencies bothered me, the story was for the most part, bearable. I was intrigued by the different worlds and how they worked, even if the science behind it was a little vague, and this is essentially what kept me reading. Overall, I'd give this book 2.5 stars, rounding up to 3 for good measure."}, {"userName": "Lindsey Learn", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/885129-lindsey-learn", "userReview": "I was excited to read The Corridor. Finally, some science fiction! I loved the premise with multiple Earths and Mods (a mutant-type character, but more genetically engineered). Despite my initial excitement, it was really hard for me to get into this book. I still can’t believe it’s only 217 pages…it felt like fourhundredandthirtytwo…thousand, to be exact. Fortunately, the second half gained some speed and the relationships fell into more natural rhythms, but it took a little too much time to get there.I was surprised when there was a six-month time-jump between when Stel suddenly obtained her powers and the story picking up again. It could have been fun to experience some of the uncertainty and discovery with her. And while A.N. Willis explained some things in good detail, other details were lacking. I wanted to know more about the Mods, more about the other Earths, more about the antagonists’ motivations, etc. It’s possible we could get more history in the next installment, which despite my complaints I still might read – there was a nice cliffhanger. My hopes for the next installment would be for more character development and more action.Would I let my teen read this book?If you’re teen likes science fiction, this is probably a good option. Despite my complaints, Stel and her friends are admirable for wanting to save First Earth. They go through a lot of emotions—tempted to hide or just run away, but decide to face the problem courageously. It’s also a pretty clean read. There’s some kissing and a little bit of violence towards the Mods, but nothing graphic. PLUS – it’s only $3.99 for Kindle on Amazon.Age recommendation: 14Language – mildDrugs & Alcohol— noneSex – There’s a skinny-dipping scene, while in the water a boy caresses a girl’s back and they almost kiss; An emotionally charged make-out scene (mixed with confusion and grief), a girl crawls into a boy’s lap and they kissViolence – Some of the Mods are punished by shocks or electrocution; One character get’s his midsection “portaled” out of him (schkump!).For more reviews with an emphasis on age-appropriate content, visit my blog - FickleLit"}, {"userName": "Katy Sauer", "userReviewDate": "Jun 21, 2015", "userURL": "http://www.goodreads.com/user/show/23404833-katy-sauer", "userReview": "The story started out a little confusing for me. A lot of the technology took me a moment to figure out from the descriptions given. Once I did though, I became a touch jealous. I’d love to have some of the gadgets they have as every day items! The real events of the book start happening right away which I really appreciated. It didn’t seem like there was a big gap at the beginning for world building or getting to know the various characters. All of this came up as the plot moved along, not as something separate. Stel is probably one of my favorite female protagonists that I’ve ‘met’ in quite a while. She was intelligent but also made various mistakes along the way. The mistakes made sense and flowed with the character and events surrounding them. In a way they built up her personality more rather than just being ways to move the plot along. The other characters were also incredible and I really appreciated getting to know them. The “arrogant boy from a third universe” had me from his first appearance. He was mysterious, moody, dark haired – instant curiosity. There is some of what I’d refer to as insta-love here but I didn’t mind it. First, I was just as taken as she was and second, it doesn’t detract from everything else going on. Instead this romance is like a little side bonus that I really appreciated. Then the ending had me in all kinds of emotions all over the place. I wouldn’t quite call this a cliff hanger because in a way there is some resolution. But there is some bacon dangling from a stick calling my name to the next book in this series.This eGalley was provided free from the publisher through Netgalley in exchange for an honest review. This in no way affected my opinion and I was compensated in no other manner."}, {"userName": "Kelly", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/16087827-kelly", "userReview": "Writing a review with a headache isn't the best thing to do but still, I just finished reading this YA sci-fi story so I'll try to put into words what this book is about and how I felt about it. First of all, the Corridor is about Estelle or 'Stel', a young girl living on \"First Earth\" who loves her family: her dad and older brother Justin. Due to an accident with the Corridor a few months ago, she's now able to open portals to other worlds or other Earths. She doesn't really know how her power works and she's a little scared people might think she's one of the 'Mods' from the second Earth, so she hides her ability. Her dad is the former leader of her planet, he's also a scientist and has been trying to find out what is wrong with the First Corridor. The new (and manipulative) leader Sam ignores everything he learns and announces the building of another Corridor, the problem is, it will probably destroy and kill everyone on this Earth, like it happened on the Second Earth. Stel is determined to help however she can. I enjoyed reading this but it took me some time to read it because i had to put it down a few times. I liked the concept of the book, it was interesting and i liked the touch of romance in this. I didn't love it but it was enjoyable. I'm not sure I like the way it ended though. ***I received a copy thanks to the author/publisher in exchange for an honest review***You can find this review on my bookblog: http://reading-more-everyday.blogspot..."}, {"userName": "Rachana Hegde", "userReviewDate": "Jul 31, 2015", "userURL": "http://www.goodreads.com/user/show/19842469-rachana-hegde", "userReview": "***This review will be posted on Addicted to YA  - check it out for more reviews! :)Disclaimer: This book was provided by Alloy Entertainment via Netgalley in exchange for an honest review. The premise is great, the plot is okay...But you guys..It's confusing. And that is my #1 issue with the book because while it's fast-paced and interesting, it's really hard to keep track of everything. There is even info-dumping at some points in the book (and I know it's not easy to avoid but come on). I'm not even sure I remembered the \"important stuff.\"Although things moved along pretty quickly during the first half of the book, I found myself skimming the second half. There just wasn't enough to hold my interest. In terms of characters, I expected a lot more than I got. I wanted the main character, Stel, to be better developed. But we barely get to know her. In fact, I would have preferred Ana to be the lead because I her story is way more interesting and her perspective would probably make the book a lot richer. (Ana is the modified human from second Earth.)The romance is okay and the love triangle dissipates fairly early in the book. But it doesn't add much to the story. I think this book had tons of potential but it turned out to be a mediocre read. It's not good but it's not bad either. I wouldn't recommend this book but if you're curious, you should try it (or at-least read an excerpt)."}], "description": "Infinite worlds. Endless possibilities . . . Stel Alaster has never known life without the Corridor. It appeared suddenly seventeen years ago, the only portal to a parallel version of our world—Second Earth. Everyone on First Earth fears Mods, the genetically modified Second Earthers who built the Corridor. They are too smart, too strong, and have powers that can’t be controlled. Any Mod found on First Earth is branded, then detained in the Corridor’s research labs.Only Stel has a dangerous secret. She has a power, too: She can open a portal to Second Earth . . . and several other parallel universes she’s discovered. If anyone ever finds out, she’ll be imprisoned, no better than a Mod or common lab rat.But when the Corridor starts to fail, emitting erratic bursts of energy that could destroy First Earth, Stel must risk everything to save the people and world she loves. With the help of an escaped Mod and an infuriatingly arrogant boy from a third universe, Stel sets out to unravel the mysteries of the Corridor and stabilize it before it’s too late. The fate of every world lies in the balance. . . .", "title": "The Corridor\n      \n          (The Corridor #1)", "url": "https://www.goodreads.com/book/show/25534273-the-corridor", "average": 3.69, "cover": "https://images.gr-assets.com/books/1431559132l/25534273.jpg", "reviews": 98, "authors": [{"url": "https://www.goodreads.com/author/show/13980964.A_N_Willis", "name": "A.N. Willis"}], "type": ["Young Adult", "Science Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/25534273-the-corridor", "http://www.goodreads.com/book/show/25532533-the-corridor", "http://www.goodreads.com/book/show/25844803-the-thirteenth-world", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}