{"ratings": 1381, "userreviews": [{"userName": "Will Byrnes", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "Antarctica. The first sunset of the year. Darkness will increase 20 minutes a day. Róisín, an Irish astrophysicist, and François, a French chef, both working at a research station, are becoming involved. They share a wanderlust and a deep attachment to people and places continents away, she to her beloved cousin, Liam, he to his unusual mother, Severine. But each feels a connection to the other that seems to have been written in the stars. The Comet Seekers traces their paths through time and geography to show how they found themselves and each other at this time in this forbidding but magical place at the end of the Earth. Helen Sedgwick - from her siteRóisín always had her eyes on the sky. Even as a child she would drag her closest friend, her cousin Liam, out at night to look at the heavens, in rural Ireland, particularly when there was a comet to be seen. Liam is very much earth-based, expecting to spend his life working his family's farm. Róisín always knew that she wanted to see the world, and study the worlds beyond. The tension in Róisín's relationship with Liam is as palpable as their deep love for each other. They talk about their respective worlds, the earth and the sky, the ground under his feet and the planets over her head.Comet West - from LearnAstronomyHQ.comFrançois was an only child, raised in the Normandy town of Bayeux, seven miles from the English Channel, home to the world famous Bayeux Tapestry, but more on that later. It is François' mother, Severine, we follow on most of the track-back of François' journey. Severine is an unusual sort. Faulkner may have famously noted that The past is never dead. It's not even the past. Maybe this is more true for some than for others. After her grandmother passed away, Severine began receiving frequent visits from her relatives, her...um...late relatives. She had humored her beloved grandmother when she had seen her, frequently, talking to people no one else could see, and who Severine presumed were not there. Turns out, she has inherited her Granny's ability, and becomes hostess to frequent visitations. Much more garden party than spook house, as she gets to meet, in addition to beloved Granny, ancestors from ages past. There is one, though, whose ghostliness is decidedly ghastly. Brigitte haunts Severine in a more usual way, with displays of the horror that had ended her life. The mystery of this ghost, and why she remains, herself, haunted, is a large motivator for Severine. Comet McNaught - from LearnAstronomyHQ.comFrançois, as had been true for his mother before him when she was young, does not see the ghosts. He thinks his mother is mad, and is mortified when she chats with the unseen while any other living souls are present. But they remained close, despite her oddity, and his disbelief. But Severine contributed more to her son than a store of discomfiting tales. It is the cooking she does with him that leads him to a life in fine cuisine. And she passes on to François her passion for exploring the world, however homeward she may have turned her own adventure. Donati's Comet - from WikimediaA central notion of The Comet Seekers is that not only are there ghosts, but these spirits are most visible when there is a comet in the sky. Like hand-crank radios, comets seem to provide temporary power to spirits, enabling them to visit their earth-bound descendants, at least the ones with the capacity to see. Once the comet fades from sight, so do the visitors.  Her granny says the ghosts will only stay for as long as she can see it in the sky. The brighter it is, the more they have to say. And there are other conditions. The ghosts are somehow rooted to an earthly location. Yes, they can make the odd visit elsewhere, but the cost in battery power is considerable. If you want to hang with the haunts you really have to stay close to home. You have to want to see the visitors in order to get to see them, and you must have lost someone. Comet Hyakatuke -from the University of OregonThe spirit-power issue embodies the home-heart, stay-wander conflict for Severine. For François, while he is not in on the ghostly vision thing, he is very attached to Severine, which keeps him from wandering too much, even though Maman encourages him to see the world. For Róisín, the attachment is Liam, (As a young man, he wanted to be just like his father. It is heartbreaking, he thinks, the things people believe they want when they are young.) but the pull of her curiosity is so overpowering that she breaks out of the gravity of home and sees as much of the world, and the universe, as she can.\nWhen she walks across the field she opens her arms wide and imagines a world so big, so full of people, she would never tire of exploring it, her eyes fixed on the sky above until she slips on some sheep droppings, only just managing to catch her fall. Liam ís always telling her the ground is just as important as the sky.\nThe book is organized around the arrival of major comets. Each chapter includes the name of the comet and the year in which it appeared, from contemporary, well, a little ahead of when this was posted, (2017) to medieval (1066) times. Each chapter is populated by ancestors. The selection of Bayeux as a base location is no coincidence. The Bayeux Tapestry (on display in Bayeux, but most likely made in England), an impressively lengthy work of art, at over two hundred twenty feet by a foot and a half tall, not only tells the historical tale of events leading up to the Norman Conquest and ending with the Battle of Hastings, it is also the first reference in human history to Halley's Comet, which appeared in 1066. Sedgwick weaves the tapestry into her tale, shows us a bit of it's making, and it's display in a local museum. She uses images from the tapestry as inspiration for elements of her story. A small piece of the tapestry, with Halley's comet - from Britain's Reading museumAt first blush one might make the mistake of thinking this is a romance. I did not react to it as such. Sure, there are certainly romantic elements in the connection of this person to that, and that one to another, but The Comet Seekers has it's eyes cast upward on grander visions. There is a certain force we experience with people and places, an attraction, a pull, a connection, however invisible it might be, and so we circle, maybe connect, possibly even crash, even if, in the case of things like comets, or hearts, the ovoid route may be a particularly long one. In a way, one might see Róisín-Liam and François-Severine as two binary star systems, locked in a gravitational dance with each other, whatever the physical distance there may be between. In addition to the draw of home, there is much tugging between the past and present, the attraction of and even need for adventure vs the gravity of warmth and home, the appeal of the wide open universe vs the draw of terra firma.Comet Hale-Bopp - from WikimediaThe plot line may involve connecting Róisín and François, who encounter each other like two heavenly bodies with intersecting orbits, but that is a mechanism, not the essence. There is so much going on here it could fill a planetarium dome. But it would all result in a gray cloudy view if the characters Sedgwick created did not have some starlight in them. I found things I could relate to in a range of characters, male and female. Yearning knows no gender. Feeling stuck is neither male nor female. Having to make excruciating choices is a human condition not a male or female one, as are joy and disappointment. Losing loved ones hurts on both sides of the gender fence. There are tears to be found here. Keep those tissues at the ready. But there is joy as well, in the humanity of Sedgwick's characters, the daring of her approach, and the magic she has dreamt up to illuminate her tale. The Comet Seekers is a masterful and brilliant book, smart, emotionally engaging and wholly entertaining, a celebration not only of our capacity for connection to each other but of taking strength, hope and inspiration from the connections we have to our past. This is a book that is sure to blaze a bright trail across the publishing universe, one you will not want to miss. The Comet Seekers is nothing less than heaven on earth.Publication - 10/11/16Review - 5/13/16=============================EXTRA STUFFLinks to the author's personal, Twitter and FB pagesThere is a lovely short piece on Sedgwick's inspiration for a short-story progenitor of this novel, on Kirsty Logan's blog. The Comet Seekers gets a nice pat on the back in this piece in the NY Times - October 30, 2016 - Newly Released Books The animated Bayeux TapestryThe sound of a comet. Yes, really, well, sort of. Go ahead. Check this out. For all things Comet-ish, check out this siteThe comet section of NASA's website is lovely as well I looked around for 2016 comets that might be visible to the naked eye. Alas. But if you have telescope technology there are some to be found."}, {"userName": "Adina", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "The Comet Seeker is a marvelous, beautifully written, emotional debut. It seems to be very hard for me to write a review as this is a book which is hard to describe, it needs to be felt. The Comet Seeker is the story of two people, Roisin and François who share a connection that seems to be written in the stars (or, more appropriately in comets). They meet for the first time in Antarctica where they both work, she as a researcher, he as a chef. The book starts with the day Comet Giacobini become visible in the sky, in 2017, with the final chapter returning to the same date. Each chapter of the book presents glimpses from the lives of the two characters whenever a comet is visible in the skies. During their existence, they both had a deep relationship with a special person and suffered loss. The two lives intersect like the threads of a spiderweb and we discover connections between our heroes that emphasize the thought that they are destined for each other . Oh, I should also mention that there are ghosts in the story, only visible to certain characters when a comet flies close to the Earth. I do not want to say anything about them as I want you to read the book to find out. When I started to read the novel I was expecting a beach read because the pages were flying. I was on the beach so I had no problem with that, only that I ended up with tears in my eyes by page 20. Yes, it only took that long to care and to realize it is not the easy read that I thought. I cannot define this book. It is a love story, a ghost story, it also have bits and pieces of magical realism, it is a story about loss and about being stuck in a life that makes you unhappy , without the possibility to get out without hurting the ones you love. It is a book about the power of family ties. It is a book that revolves around comets and about having high aspirations. It is many things and all amazing. It is sad but also joyful, it makes you feel anguish and you can also feel comfort. „The proof that ghosts are no better or worse off than the rest of the population; they too need others to survive.”Thank to Helen Sedgwick, Random House UK/Vintage, and Netgalley for this copy in exchange for an honest review."}, {"userName": "Angela M", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "This is a quiet introspective story and it's fascinating in many ways to learn about the comets. I was drawn immediately to Roisin, an Irish scientist in a research facility in Antarctica studying the comets and to Francois, the chef at the facility. I wanted to know how their relationship would develop and about their pasts and how they came to be where they are, both in the place and in their states of mind. Moving from time and place when comets occurred 2017, 1976, 1759 , 1066, back and forth , we see these characters in earlier years and also how they are connected to others at other points in time . There are ghosts and a good dose of magical realism and I thought it an interesting story but I felt it to be a bit disjointed and contrived . So what's it about? For me it's about love and loss, a desire to know and be somewhere that gives something more than the place you are from versus wanting to stay in the place you are from. It's not more than three stars from me, but I will definitely watch for what this author may write in the future because of the lovely prose .  I received this ARC from HarperCollins through Edelweiss."}, {"userName": "Cheri", "userReviewDate": "Dec 27, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "”1759 Halley’s Comet In Beaux, two sisters in lace dresses read to one another as their husbands play cards and drink cognac. The family home was once deserted, so the story goes, burned down to its stone foundations, but it was rescued by twin sisters, like them, and now it is filled with books and flowers and laughter. They read in the paper about the naming of a comet after an astronomer who did not live to see it arrive, but they are not saddened by this. They know that their house is filled with more than children – sometimes, when a comet flies through the sky, they see generations past and know that their family is tied to the skies and to their home and they are glad.” The story centers on Róisín and François, and their families – those living and those who lived long ago. Róisín is from Ireland, an astrophysicist. As a child, she shared her love of the sky with Liam, her best friend / cousin – but especially her love of comets. Róisín is attached to the sky, and Liam, tied to his father’s farm. ”They lie on the grass and talk about the things that drunk people talk about at four in the morning: past centuries and the vastness of the universe; what makes true love true and whether or not the world is becoming a better place.”François is a chef from Bayeux, France, a town on the Aure River. As an only child, he was tied to his mother, Severine, and Severine was tied to her ghosts. ’Things are different now’, her granny says. ‘She will be the last.’Great-Grandpa Paul-Francois shakes his head. It’s not a disaster, he thinks, more an inevitability. The proof that ghosts are no better or worse off than the rest of the population; they too need others to survive.”Everything in Severine’s mind pulled her to other places and the adventures and travels she’d yearned for in her youth, while everything in her heart tugged her home. To her family of spirits ever hovering ‘tween the afterlife and the here. Tied to Bayeux, where her ghosts remain attached – unable to wander freely or for long, still tied to home.”So much company, she thinks. What a beautiful thing, to have all this family.” I loved this story despite the frequent change of timelines, which is usually a negative for me. There are multiple years that bounce back and forth, typically a bit harder to connect to the characters for me. That wasn’t true in this story – but I was feeling my own family spirits around me as I read a great deal of this story on what would have been my mother’s 91st birthday. A love story about families, memories, all the things that bind us to this life and to the living even after we are but memories. A dash of magical realism, lovely prose, wonderfully atmospheric settings and memorable characters add up to an unusual, lovely debut."}, {"userName": "Liz Barnsley", "userReviewDate": "Jul 15, 2016", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "I LOVED this book. It was something a little different, beautifully written and absolutely engaging.Following our characters and those that came before them over a thousand years, snapshots of life whenever a comet is visible in the skies, this is a gorgeous, imaginative premise that really hits you in the heart. To be fair it is actually really difficult to review because you don’t want to give away the pure magic of it but also you want to throw it at people and just say READ THIS you will fall in book love.The Comet Seekers has a haunting, surreal quality to it, the prose poetic but highly immersive and the descriptive sense of it just sits with you long after you have finished it. I read it in pretty much one sitting so caught up was I in the lives of these people, their world and experience, holding it all together in heavenly (yes) style is the night sky in all its glory – this is a journey in more than one sense of the word.I adored how Helen Sedgwick made the connections, sent the threads up and around and through the narrative like a spider spinning a web on a dewy morning – pitch perfect to keep you involved and attached to the story unfolding.Really really lovely. A lovely book – one that you will return to again and again just to find the things you have missed.Highly Recommended"}, {"userName": "Bianca", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/29843800-bianca", "userReview": "I am afraid The Comet Seekers and I were not a good match.While I appreciated the lyrical writing, it wasn't enough to sustain my interest. Things were moving slowly, the many characters from past and present confused me, especially in the beginning. I never felt engaged with the story, never really cared for any of the characters. This novel was too melancholy and too ponderous and it felt much longer than it was.The ghosts drove me insane, as I never quite got their meaning. I personally would have loved a lot more science and fewer ghosts. I can get my head around sciency matters, even though I'm illiterate when it comes to astronomy (not a subject that ever interested me), but ghosts and other such supernatural beings don't do it for me.The narrator of this book did a great job, so I can't blame my lack of enthusiasm on the audiobook.So this gets an indulgent 3 stars."}, {"userName": "Evelina | AvalinahsBooks", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/13716524-evelina-avalinahsbooks", "userReview": "Updating this review in anticipation of The Growing Season. I will be publishing the review on Sep 1, and I absolutely loved it! So you should check it out too, once it comes out.\n\nIn short: The Comet Seekers is a wonderful book. I loved it.\n\nMain feel: layered, nostalgic, deep and emotional.\n Slow, will focus on feelings, coping with them, family events, and not action or developments, will also jump around timelines. However, very magical, very warm and personal.\nI loved this book to bits.\n Considering I got it on NetGalley for free, it makes me even more thankful and happy that I got the chance to review it. Such a gift. Especially at the end of the year, somehow. The comets, the snow. The memories.(if the images don’t load, you can read this post on my blog)This book tells the story of several people – the main characters Róisín, who is trying to cope with the loss of someone very dear to her, and François, who is trying to come to terms with the fact that his mother is seeing ghosts - something he understands as mental illness - as well as the fact that she prioritizes the ghosts over him. The secondary characters are Liam, the one Róisín lost, and Severine - François' mother.\nAnd then there are all the ghosts. Yes, they're real in the story.\n About the only one who doesn't understand that is François. The ghosts basically suffer from the dilemma of a tree falling down in the forest and nobody being there to see it - the ghosts are afraid of being gone when there's no one left to see them anymore. Some of them still deal with the loss and pain they've suffered in their own lives long, long ago. Severine wants to help them deal with it, but she's got her hands full with her own life already.\nAnd the comets...\n They are an integral part of the story too. \nThey are the passion that drives Róisín to become a scientist, to travel, and ultimately choose to pursue her dreams instead of sacrificing them for love.\n It's also the phenomenon that marks the times the ghosts come back to visit. It's what will brings Róisín and François, as well as their families, together in the end.\nThis is a great book on family history, loss and loneliness, being different and trying to find your place in life.\n For me, it had everything a book should have. Which is why I'm sad I can't write a better review for it. I've noticed this happens more often than not when you're dealing with great books. \nEither way - I absolutely recommend it.\nI thank Helen Sedgwick and Random House UK, Vintage Publishing for providing me with a copy in exchange for my honest review.Read Post On My Blog | My Bookstagram | Bookish Twitter"}, {"userName": "Ron", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/43881851-ron", "userReview": "I applied a firm grip to this book the other night and said,“Prepare to be torn in half.”Three reasons why that didn’t happen:1) I’m not strong enoughEven thinking about it hurt my muscles2) Thought about my librarianShe's a meanie3) Fell asleep soon into the next chapterZzzzzzzzzzzzzzzI love books too much to actually do that, but I don’t love every story in them. Was it that bad? Maybe. Truth is, the ending was kind of good. I just had to get through the first 300 pages."}, {"userName": "Heather", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/26560507-heather", "userReview": "Holy book, Batman! This was painfully beautiful. So, there are certain movies that are worth watching over and over again. You never feel like you can unfold all the layers and fully understand every aspect of it, so you keep watching those movies, and keep discovering something new that was hidden the times before. Every time you watch it again, you realize something that maybe you didn't know you realized before. This book was that for me. About one chapter in, and I knew this was something I'd have to read again, because there are so many layers. This book demands and deserves to be explored, again and again. It can only get more beautiful... I also must say that the style of writing didn't really hit me until the end. That's when I really understood the beauty behind the words. Every single line is so eloquent, well thought out, and thought provoking. I mean... guys. This one is a beaut.I'm not going to delve too far into the subject matter other than to say this book is really sad and really depressing and really freakin' eye-opening. It almost seems like I'm saying, \"Don't read this book, it's super depressing and will make you sad & nostalgic and all those feelings you try to avoid.\" I'm not saying that. My point there, is that, it touches on an experience everyone has, or certainly will eventually have, at least once in their lifetime. Losing people we love - for one reason or another. Making every day the best day. Telling the people in our lives how we feel, precisely when we feel it. This is a story about loss, but more importantly, it's a story about life. Some of us will try to avoid it, some of us will try to embrace it, but no one can escape it.Read this book. Do it now. I'm not trying to boss you around (or am I?), but I think you'd be missing out on something really special if you didn't."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I enjoyed this story of comet seekers tracing through history to follow a family who communes with ghosts. I would call it a beach read except I froze while reading it! I would read this alongside Good Morning, Midnight.I also learned about comets. I didn't know about Shoemaker-Levy 9 and Jupiter's role in devouring potentially dangerous comets from our solar system. There are some beautiful moments in this book, which I can't share with you because I had a review copy from the publisher."}, {"userName": "Cindy Burnett", "userReviewDate": "Sep 25, 2016", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "3.5 starsThe Comet Seekers is beautifully written. I was so excited to read it based on the summary and other reviews I had read. Somehow, I just did not totally connect with the story. There are SO many characters that I found it hard to keep up with them all. I also just did not love the story line. Sedgwick’s prose is lyrical, and I truly enjoyed reading her writing so after several days of thinking about the book after I finished it, I decided to give it 3.5 stars. Her descriptions of Antarctica are very descriptive, and I felt like I was being transported there. She conveys the isolation, the darkness, and the ice and cold phenomenally well. That was my favorite part of the book by far (and the cover which is spectacular). Thanks to BookBrowse for the chance to read this ARC in exchange for an honest review."}, {"userName": "Ryan Michael ", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/33568365-ryan-michael", "userReview": "This book is truly incredible. I will admit I am prone to liking novels like this, that have a firm foundation based in people, emotions, and relationships, but with a piny dipped in the waters of the supernatural. But even with that said, \"The Comet Seekers\" kept pushing me further and further into a place (or more accurately, places and times) that push the boundaries on how I view like and the quick-moving time we are here on this planet. I want to be the type of person that takes no one day or person in my life for granted. It's fair to say that you never know how long you have, or when someone might fall in your lap that completely turns your day to day life upside-down. It probably sounds like a cliche, but I think about it every day. I want to be that type of person, but I'm still working on it. But, it's books like this that keep me on track in this quest. Helen Sedgwick does a remarkable job in laying at each character in each time line, segment by segment, throughout the first half of the book. I have read some reviews saying there are too many threads and all I can say to that is this; I am not that smart, nor am I good at keeping a lot of detail in my brain. But I had no trouble keeping things together and, the further you go into the story, and once you hit the spectacular second half, all the pieces start to come together, and they come together flawlessly. The balance between mysticism and emotion is the true bedrock of what makes \"The Comet Seekers\" such a complete story. While I do my best to keep everything in perspective during my day to day life, there is nothing quiet like thinking about our \"place\" in the universe to keep you in your place, is there? Sedgwick uses the known and unknown of space and the universe to not only show us how insignificant our lives really are, but in the same breath, show us how truly meaningly everything you do is. It's not just that she gives you several enriching characters to work with, but their relationship to each other, and their relationship with time and, in a sense, all other human beings and living things on earth. I won't go into too much other detail about the plot (seems like you can find that all over reviews), but I will say that what keep me reading was a perfect combination of wanting to know how things would end and how the threads would come together (or not) in the end, but also how much the book made me think. And for someone who thinks about mortality a lot, that's saying something. One last thing I will say is that, without being able to really articular it well, this book had an overall sense of calm that I really enjoyed throughout. I was on the phone with my mom the other day and she was asking me about \"The Comet Seekers\", seeing if it would be something good for her book club to read, and of course my answer was yes. But as I was attempting to (not very well) describe what I liked about it, I kept coming back to the word \"calm.\" I guess what I mean by this is that even though each character is going through many different thinks during many different parts of their lives, there seems to be a sense that everything is moving along like it should. If you have read this book while you read this, you might disagree with that statement sense there are a couple points in the story that no one would ever want to have happen to them, and it would be even harder to say to yourself, after experiencing something like that, that it was something that happened \"like it should.\" But in the context of a piece of fiction, everything seemed very real and without pretension, and I was both shocked by some aspects of the ending, and in equal stride, not at all surprised because of how authentic it felt. This \"calm\" that the book exudes really comes down to how well Sedgwick moves in and out of each story line, and never seems to miss anything important through out them.As you can tell at this point, I really loved this book. I can understand why it might not be for some, but if you are okay with a little bit of a slow (but very meaningful and well written) first half of the book, the second half will blow you away. I hope you enjoy it as much as I did."}, {"userName": "Carolyn", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/19559507-carolyn", "userReview": "Comets have always captured the human imagination. In earlier times they were thought to be harbingers of doom but more recently they are seen as romantic wanders of the solar system or universe. Many comets, like the most famous, Halley's comet, have an elliptical orbit within our solar system appearing regularly and predictably (Halley's comet will next appear in our skies in 2061) while others have orbits that take hundreds or thousands of years. In the comet-seekers Helen Sedgwick explores the ties that bind us to our place on Earth and the longing to constantly travel, seeking other places and experiences. The novel starts with Roisin and Francoise meeting in the icy depths of Antarctica. Both of them have had to fight the ties that have bound them to their small home towns and each has left someone behind who has been more firmly attached to their place on Earth. In Francoise's case, it is his mother Severine who will not leave their small town of Bayeux and for Roisin it is her dearly loved cousin, Liam who will not leave his failing farm in Ireland. Although Francoise and Roisin have broken away to go to the ends of the Earth they can never entirely break free of the gravitational pull of their roots and loved ones.I love the unusual construction of this novel zipping back and forth through time with each chapter set in the year of the visible appearance of a comet in our night skies, from Halley's comet in 1066 (depicted on the Bayeux tapestry) to Comet Giacobini expected in 2017. One of the main stories is that of Severine who sees the ghosts of her ancestors, but only when a comet is visible in the sky, as if the comet's magic is needed to give the ghosts strength to appear. These are not scary ghosts but mostly happy, playful ghosts, with the exception of Brigitte who burned to death after having her infant son ripped from her arms. Severine knows she can only see the ghosts if she stays in Bayeux and refuses to travel, frustrating Francoise who has an intrepid nature and would love to see jungles and deserts but feels bound to stay in Bayeux near his mother. Roisin has always had her eyes on the sky and becomes an astrophysicist, travelling around the world to work in different research centres, leaving her dearly loved cousin Liam unhappily behind, unable to cut the ties to his family farm. Throughout the novel, Roisin and Francoise's paths cross several times, eventually colliding in 2017 in Antarctica.This is a well written novel with some lovely prose and fully formed characters who yearn and grieve, fighting the tension between loving the familiar and seeking the unknown. However, although there is much to admire in the book and I mostly enjoyed it, it didn't quite work for me, probably because the jumping about from one time to another upset the flow of the narrative and made it feel a little forced at times."}, {"userName": "Suanne Laqueur", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/10273177-suanne-laqueur", "userReview": "ONE MILLION STARS AND COMETS. This is why I read. These are the books I live for. I read this on a flight from Heathrow to JFK and honestly forgot I was in a plane. Utterly transported somewhere else. A brilliant idea brilliantly executed. I highly HIGHLY recommend this, especially if you have a few unplugged hours to disappear."}, {"userName": "Asghar Abbas", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/37421322-asghar-abbas", "userReview": "If you know two people who are just on the verge of falling in love; hiding in that small space between mayhem and harmony, do them a favor and give them this book. That'll get the job done, it is very decisive that way. This novel made me weep. Do yourself a favor too and read this as well. Be free."}, {"userName": "Allie", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/6894205-allie", "userReview": "Four stars for the incredible writing.Two stars for the meandering plot and frustrating main characters.First, the writing is gorgeous, especially when the author (a physicist) is describing space. For example, the creation of planets: \"And the debris comes together, forming rocks and swirling angry gas, distant ice planets, and occasionally an ideally placed one, that is not too light and not too dark. But at the heart of it, she knows, there can be a stellar black hole where once there was a star, a nothingness from which no light can escape; the remnants of a scream at the instant of death from a star that had taken in too much, and had to let it all go.\"However, I nearly abandoned the book out of sheer irritation with the plodding storyline and self-absorbed central character. Roisin is an Irish astrophysicist eager to escape the small town where she was born, and much of the book follows her restless travels from place to place studying comets. However, she left behind the man she loved, Liam, who remained in Ireland to care for his aging father and the family farm. The two circle one another and make multiple attempts to find a life that reconciles their different desires: he wants a home, stability, and Roisin, while she wants to pursue her own dreams more than she cares about anyone else. (The gender role reversal here was interesting.) The bleakness of Liam's life and his increasing depression was heartbreaking. After tragedy strikes, Roisin finally realizes what she has lost, and she goes off to grieve at a study station in Antarctica. The second story follows young Francois and his mother Severine, in Bayeux, France. Severine, like her grandmother before her, sees the ghosts of her ancestors whenever comets pass overhead. However, they can only appear while she remains in France, thwarting her dreams of traveling the world. Essentially, she is the antithesis of Roisin. Severine is a more sympathetic character, but her focus on communing with ghosts sometimes leads her to neglect her son and her lack of interest in anyone outside her immediate family seems unrealistic. Growing up fatherless and with a mother who talks to invisible people takes a toll on Francois, a chef who has dreams of leaving France for exotic destinations. (The ghosts tell their stories in chapters throughout the book, but I didn't find any of them particularly interesting, except the one about the creation of the Bayuex tapestry.)Their stories converge when Francois joins the exploration group in Antarctica, where he meets Roisin. Their budding love story amidst the frozen sheets of ice is the book's happy ending, but I just wasn't emotionally invested in their relationship. Also, Elsa and Anna did not appear at any point and start singing, so I'm deducting half a star for the missed opportunity.The book explores an interesting theme: the conflict between family and freedom. I think the author had some thoughtful points to make about this subject, but I felt she made the same points too often. And the ghosts of ancestors seemed like a poor way to emphasize our connections to family. Despite the lovely language, I'm giving this book three rather mixed stars."}, {"userName": "Kirsty", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "I started reading Helen Sedgwick’s The Comet Seekers on the long journey up to Glasgow. It has fast become one of my highly anticipated reads of the year, especially since scrolling through some of its Goodreads reviews. The premise was simple, yet very cleverly used, and all of the separate stories were carefully tied together to make a rich whole. Some of the occurrences - for example, Roisin and Francois living in the relatively small town of Bayeux at the same time - felt a little too convenient, but it was put together in such a way that actually, such chance almost-meetings felt very sweet, and almost necessary to the whole.The breadth of Sedgwick’s research here is almost breathtaking. She handles the information well, and writes beautifully. Some of her phrasing is nothing short of sublime. I wasn’t sure how I felt about the presence of the ghosts - I am the first to admit that I am not at all interested in the paranormal for the most part - but in hindsight, it did work well. The Comet Seekers is peopled with realistic characters, well-rehearsed scenes, and startling conversations. My only real qualm was that some of the details toward the end of the novel were a little odd and unnecessary, but overall, I must admit that I really enjoyed it."}, {"userName": "Megan", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/7854826-megan", "userReview": "Oh my my my, yes to the magic, the feelings, the comets, and pain. - \"I couldn't live like that, too much was missing - one person can't be enough, can they? You need more. Everyone needs more.\" Reading this book was like being in landscape of relationships with a wonderful typography of emotions that felt so real. And to think it only took a few ghosts."}, {"userName": "Thekelburrows", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/6970499-thekelburrows", "userReview": "GoodReads review algebra.\"book X has a lot of great aspects such as Y and Z\" + \"however the A felt heavy-handed and B seemed under-developed\" + \"author W is young and shows a ton of promise\" = \"I look forward to the future endeavors of W that take the Y and Z of X to the next level and corrects for the the inconsistencies of A and B\"Rinse and repeat as necessary."}, {"userName": "Kirsten", "userReviewDate": "Apr 04, 2016", "userURL": "http://www.goodreads.com/user/show/1861287-kirsten", "userReview": "The best books defy description because they've already used all the right words. Anything I say will fall short. Evocative, ethereal, wrenchingly beautiful family relationships both distant and close. I stayed up very late reading this one. Couldn't put it down."}, {"userName": "Odette Knappers", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/35775020-odette-knappers", "userReview": "Dit boek kwam ik in Oxford in een van de prachtige boekhandels daar tegen. ik had er nog nooit van gehoord, maar de titel en de cover spraken me meteen aan. Ik heb heel lang alleen veilig gekocht (schrijvers die ik al kende, boeken waar ik al een stukje in had gelezen van de bieb etc.), maar op vakantie ging ik in de boekhandels een beetje los. Wel spannend, maar de prijzen liggen daar iets lager, dat scheelt ook haha!En toen ik in ons idyllische huisje was en begon in dit boek, vloekte ik even in mezelf ohnee wacht hardop. Het is HEEL ERG wennen om dit boek te lezen, want er staan geen aanhalingstekens om wat er gezegd wordt. Dat leest echt heel lastig. Gelukkig bleek dat vrij snel te wennen.Dan het verhaal. Het begin vond ik erg tof, maar toen werden het daarna vage stukken uit het verleden over dingen met geesten van verloren familieleden, en een verliefdheid op een neef bij het andere hoofdpersonage en dacht ik even okéééé.Als ik dit boek uit de bieb of op mijn ereader had, zou ik na een aantal bladzijdes misschien wel gestopt zijn. Misschien ook niet, misschien triggerde de rol die kometen in dit boek spelen me ook wel genoeg. ik zal het niet weten, want ik heb hem uitgelezen omdat ik hem gekocht heb.Ik schrijf dit nu wel alsof het heel spannend is maar jullie hebben allang gezien dat ik dit boek 4* heb gegeven. Inmiddels snappen jullie wel waarom het er geen 5 zijn denk ik zomaar (: Maar waarom dan wel die vier? Nou, omdat ik erg van dit verhaal en de personages ben gaan houden, er erg om ben gaan geven. En ik weet niet precies op welk punt dat gebeurd is of wat daar voor zorgde.Wat ik heel mooi vind aan de loop van het verhaal is dat het heel echt en rauw aanvoelt wat er gebeurt. het gaat gewoon niet altijd allemaal goed, het is soms moeilijk en zwaar, maar op een manier die niet overkomt alsof het verzonnen is om het personage te laten lijden, maar het komt heel echt over. En het idee met de rol van de kometen in dit boek is toch wel erg gaaf. Ook is het erg tof dat het niet echt een liefdesverhaal is (wat je op basis van de buitenkant en de omschrijving misschien wel denkt), het is meer een levensomschrijving. Ik raad hem aan als je houdt van Dani Atkins. Als je niets hebt met een vleug (dit is geen vleugje meer) magie of bovennatuurlijke dingen in een boek, dan raad ik dit niet aan."}, {"userName": "Amy | shoutame", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/10559838-amy-shoutame", "userReview": "This was an okay read, I wasn't blown away but still enjoyed the experience - don't think I would pick it up again though.There are two stories interwoven in this book; one follows the lives of two cousins living in Ireland and the other part follows a family living in France. Both stories are connected by the fact that all of the people are keen watchers of comets. In the story of the cousins we see how they fall in love with each other and struggle with the implications of this, whilst the guy wants to make home in their Irish village the woman wants to see the world and progress in her career. In France we follow a young woman who is able to see her dead family members when comets are flying overhead, this causes problems throughout her life as she never wants to leave the place of her birth - if she does she will no longer be able to see or speak to her dead ancestors.I thought this book had a great premise but needed a bit more to it, I felt it dragged on a bit in the middle and didn't really seem to have a proper end in sight. I preferred the story of the family in France and the magical realism elements that arose in that plotline. I would recommend to those who have an interest in space and comets but if incest bothers you then this is probably not the book for you."}, {"userName": "Michele Harrod", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/2126679-michele-harrod", "userReview": "It’s been a while since a book contained so many sentences that gut-punched me, or left me breathless. That brought back longings so deep, and losses so painful, it was like having my heart excavated at times. Sometimes by a sentence describing a simple gesture. Other times by a character’s handling of a human emotion, such as grief, so perfectly rendered, every cell in my body ached. How can a book make me feel so bereft, and yet still so hopeful, all at once? So insignificant, yet so connected? Who knew that the glory of the skies could be captured and transformed into words so beautiful it was like the comets themselves were shooting through my heart. But this is what Sedgwick has achieved for me! Reminiscent of early Isabel Allende work, I almost feel a visceral need to travel to Antarctica after reading this, to find everything that has ever been lost. This is a cryptic review, because life and love so often are. In a nutshell, this is exquisite writing. This book lover’s idea of ‘absolute magic’."}, {"userName": "Julia", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/9819047-julia", "userReview": "I knew I wasn't going to be a fan of this book as soon as I started reading it and discovered that the author didn't use quotation marks. That is one of my pet peeves; I find it pretentious. I got the sense that the author tried too hard with the lyricism and I felt duped by the synopsis, which made it seem like the book would be set mostly in Antarctica. Only the first and last chapters are set in Antarctica and the rest tells you the life stories of Róisín and François, the former I kind of like and the latter I found boring."}, {"userName": "Jaclyn Day", "userReviewDate": "Dec 03, 2016", "userURL": "http://www.goodreads.com/user/show/1373260-jaclyn-day", "userReview": "This book has a quiet, otherworldly beauty. Though there are a lot of characters, a few do stand out and provide enough connective tissue to pull the reader through the tricky (and potentially confusing) narrative structure."}, {"userName": "Elisa Strickler", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/16695858-elisa-strickler", "userReview": "This book has many lovely written passages. Although it took me a few chapters to really become invested, it ended up being one of the best books I have read this year. It made me want to learn more about astronomy as well - always a bonus when a novel makes you want to learn about a new subject."}, {"userName": "Kristy", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/51307044-kristy", "userReview": "A different kind of love story but I enjoyed it. \"There is something liberating about making a decision and walking straight towards it.\""}, {"userName": "Marlene", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/7001837-marlene", "userReview": "Originally published at Reading RealityThis feels like an easy book to like but a hard book to love. Your mileage, even to Antarctica and back, may vary.I want to say this is a story about two people who feel connected to comets, and through that somewhat ephemeral connection find themselves connected to each other. At first their connection seems to be an accident, but in the end we discover that some gravitic force has been moving them towards each other all along.Róisín is an Irish astrophysicist. She has been following comets since she was a child, and wants nothing more than the chance to study them. But Róisín is from a tiny Irish village, and while her family understands her need to see the universe, her first love does not. Every part of her journey away seems to encompass just a bit pain, a worry about what might have been if she and her cousin Liam had ever had a real chance.Ironically, or coincidentally, or a bit of both, Róisín’s journey around the world, the journey that eventually leads her to Antarctica, keeps intersecting with François’ journey. Francois is younger than Róisín, but as she travels and explores the world and her profession, she keeps almost bumping into Francois and his mother Severine.Not just when François and Severine make their one great trip, to Edinburgh, but also when Róisín finds herself working on a grant project in Bayeux, the home of the famous tapesty and the place that Severine and François call home.Much of the story is Severine’s. She finds herself tied to Bayeux by the family ghosts. Down the centuries, from Aelfgifu in the 11th century who worked both herself and Halley’s Comet into the tapestry, all the way to the 21st century and Severine’s own grandmother, members of Severine’s family appear to Severine as rather lively ghosts whenever there is a comet in the sky over Earth. Severine loves her family, both the dead as well as the living, and can’t bear to part from the ghosts. But there is a price to be paid for keeping them close beside her – she has to stay close to them as well. If she leaves Bayeux, she loses her family.Of course, her son Francois thinks she’s lost her marbles, just as Severine’s mother thought had happened to HER mother. Severine’s mother was astonished to find herself a member of the family ghostly choir upon her own death!The story begins on a scientific expedition in Antarctica, where Róisín is studying the heavens and chef François is keeping everyone fed. They are both there to get away from, or let go of, losses that they can’t bear around other people. And as their story progresses, we see the stories of all of the comets, and all of the members of François’ family who have been tied to their own particular comets.Because the ghosts are telling their stories, one last time before they go.Escape Rating B: I enjoyed the individual stories, but they just didn’t quite hang together into a single anything for me. This may explain why I often don’t quite get literary fiction – I keep expecting a plot there isn’t there.The through story line is how Róisín and François reached the place where they can finally see each other. Not just because he had to grow up first, but because they each needed to experience their own profound losses before they were ready for a possible future together.But we only glimpse their stories in bits and pieces. Most of the book feels like it is taken up with the visitations of the ghosts, and the different times that each of them experienced a comet passing through the sky. And all of the stories seem to have a tragedy in their hearts, whether it is the death of young Antoine, Severine’s uncle, or the tragic lives of Aelfgifu in the 11th century and Brigitte in the 15th.We also only see Róisín and François’ lives through the tail of a comet – the narrative is not sustained through their lives. Instead we get glimpses through the 20th and 21st centuries as one comet after another makes its way into, or through, our solar system. So not just Halley’s Comet in 1986, but also Hale-Bopp, Shoemaker-Levy 9 and Hyakutake. It’s been a busy half-century for comets, which provides lots of points to observe their lives – but still not the same as a more straightforward story.The historical vignettes are not in chronological order either, making it easy for the reader to get a bit lost among the stars. And comets.Individual sections are often lyrical, but somehow the book just misses cohering into a whole. I’m flailing a bit, trying to convey that this book didn’t quite do it for me. It got close a few times, but just missed.The Comet Seekers is a debut novel. Those lyrical parts of this story are lovely, and I have hopes for this author’s future work."}, {"userName": "Elizabeth☮ ", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/990216-elizabeth", "userReview": "The premise of the story orbits around various comets. We have two characters that meet at the beginning of the book whose lives come closer and closer (mimicking how a star explodes into a black hole?). The story takes us to various corners of the world and is interesting, but I found myself growing a bit uninterested in the middle section. The chapters are written in short chunks, so I forged through and did find the end result pleasing. I like the incorporation of astronomy and an element of the supernatural."}, {"userName": "Megan", "userReviewDate": "Dec 20, 2016", "userURL": "http://www.goodreads.com/user/show/21103030-megan", "userReview": "In two words, I'd describe this book as dazzling and haunting. It's hard to sum up everything this book is about: it's about Ireland and France. It's about space and comets. It's about ghosts and history. It's about tapestries and cooking. It's about forbidden love and deep family ties. It's about Antartica and loneliness. There is so much going on here, but yet the plot doesn't get muddled because of it, instead it soars comet-like through time and space and stories that weave together in beautiful and unexpected ways.The greatest underlining theme in the novel is the tension between \"home\" and \"away,\" between the desire to travel and explore the world and the desire to stay home in the the embrace of family. These theme is played out through two different stories. Róisín is an Irish astronomer and she wants nothing more than to travel the world learning about the heavens. She blissfully travels from Edinburgh to Bayeux, from Toronto to New York City. But following her dreams means leaving behind her cousin and true love, Liam. A decision that eventually comes with disastrous ramifications. The other narrative is that of Severine, a young French woman, who dreams of showing her young son François the world, but is unable to leave her hometown. Leaving Bayeux means losing the ability to communicate with the ghosts of her ancestors, who appear each time a comet passes over. Despite her many attempts to leave, Severine is continually drawn back to family, even if they are ephemeral. This obvious parallel reflects a theme that has seemed very real to me, especially as I live abroad, do we follow our restless urge for travel and adventure or the familiar comfort of family and home.Stylistically, the book is written beautifully, but in a way that demands total attention to each word. There aren't any quotation marks, so while I usually skim for dialogue if I'm impatient, Sedgewick forces the reader to slow down. It's worth it as the language and thoughts in the book are nothing but elegant. I ended up writing down several quotes as I read, not wanting to forget them. However, because of the amount of attention the book demands, I found it took me a while to finish. I used to racing through novels, but this book really slowed me down and took me almost a month to read. It's also a heavy book at time. There is a loss and loneliness and regret- themes that sometimes forced me to put the book down for a while to process. Overall, the book was really lovely and I'm grateful that I found it. I ended up buying a copy for my friend who is an astronomer because it was that good (also Sedgewick was physicist herself so the scientific/academic side of the book is well developed and realistic). The cover and inside design is also very pretty, not something I usually comment on- but worth noting for this book.Pair With: All the Light We Cannot See by Anthony Doerr because it shares a similar style of flipping between two very different narratives that eventually come together. Like Doerr, Sedgewick has very distinct themes that continually repeat and combine throughout the book. And there is a dash of magical realism!Listen Along With: Saturn- Sleeping at Last // You Are Made of Stars- I Am The Sky // Corner of my Eye- Roo Panes"}], "description": "One Day meets The Time Traveler's Wife in this spellbinding, magical debut novel about love, loss, hope and heartbreak that shows us that for each of us, the world can be as lonely or as beautiful as the comets that illuminate the skies above us.Róisín and François first meet in the snowy white expanse of Antarctica. And everything changes.While Róisín grew up in a tiny village in Ireland, ablaze with a passion for science and the skies and for all there is to discover about the world, François was raised by his beautiful young mother, who dreamt of new worlds but was unable to turn her back on her past.As we loop back through their lives, glimpsing each of them only when a comet is visible in the skies above, we see how their paths cross as they come closer and closer to this moment.Theirs are stories filled with love and hope and heartbreak, that show how strangers can be connected and ghosts can be real, and the world can be as lonely or as beautiful as the comets themselves.", "title": "The Comet Seekers", "url": "https://www.goodreads.com/book/show/27430351-the-comet-seekers", "average": 3.6, "cover": "https://images.gr-assets.com/books/1480961263l/27430351.jpg", "reviews": 271, "authors": [{"url": "https://www.goodreads.com/author/show/5183586.Helen_Sedgwick", "name": "Helen Sedgwick"}], "type": ["Fiction", "Magical Realism", "Contemporary", "Historical", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/27430351-the-comet-seekers", "http://www.goodreads.com/book/show/28512756-the-comet-seekers", "http://www.goodreads.com/book/show/29411934-the-comet-seekers", "http://www.goodreads.com/book/show/29885238-the-comet-seekers", "http://www.goodreads.com/book/show/32180626-the-comet-seekers", "http://www.goodreads.com/book/show/30079420-the-comet-seekers", "http://www.goodreads.com/book/show/33295190-the-growing-season", "http://www.goodreads.com/book/show/21209658-lesbian-lovers-on-holiday", "http://www.goodreads.com/book/show/27134827-i-am-because-you-are", "http://www.goodreads.com/book/show/15726948-story-book", "http://www.goodreads.com/book/show/15728763-fractured-west-3", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}