{"ratings": 5883, "userreviews": [{"userName": "Marita", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/17415449-marita", "userReview": "[“As the train went south along the Hudson River, I realized that I was travelling through the setting of many of the books I had read. I was not just city-bound, but world-bound, it seemed, where the books I read were published, where the papers I read were written.”“It was as though an alternate time stream was moving parallel with ours, plied at sluggish speeds by ancient modes of transportation as we in the train, city-bound, got older faster, though in space our destinations were the same.”“On Friday, payday, we swarmed Child’s Restaurant on Twelfth Street and, while arguing socialism, fed ourselves to bursting on sixty-five-cent four-course meals.”“He was the most open-minded man I had ever met. Told two contradictory versions of the same event, he believed both, as long as each reflected badly on the character of Newfoundlanders. I have never met a man so eager to have his sensibilities offended.”“It was September, but not so far into the month that the browning of the barrens had begun. An overcast day with a west wind that would keep the fog at bay. There was beauty everywhere, but it was the bleak beauty of sparsity, scarcity and stuntedness, with nothing left but what a thousand years ago had been the forest floor, a landscape clear-cut by nature that never would recover on its own. It was a beauty so elusive, so tantalizingly suggestive of something you could not quite put into words that it could drive you mad and, however much you loved it, make you want to get away from it and recall it from some city and content yourself with knowing it was there.”“As I walked along, I felt the ice rise beneath my feet, felt myself being lifted and then lowered and then lifted again. I discovered that it was possible while walking on the ice to become seasick. One second you were walking uphill, the next downhill. The water below moved shorewards but the ice did not; you rose to a crest on the ice, then felt and saw that crest move on ahead of you while another swell began beneath your feet. It was like walking on the skin of a massive animal.”\n(hide spoiler)]"}, {"userName": "El", "userReviewDate": "Aug 24, 2014", "userURL": "http://www.goodreads.com/user/show/83144-el", "userReview": "The embarrassing admission is that I am American. Why do I say that? Well, there are two answers. The first is that because I am American, I don't think I've ever seen a copy of this book during all my years of working in bookstores. I found it recently and I've heard people talking about it recently, so I thought it was a new book. Guys, this book has been on the planet since the late 90s. It hit bookshelves before I was working in bookstores, and I can say I never saw at the library I worked in prior to that either. I think this is because it is a Canadian book, a Canadian author, a Canadian topic, and we don't have those sorts here in the states. (I jest. Sort of.) It's like it just became popular here for some reason.The second is that because I am American, I know a pathetic amount about Canadian history. Like... zero. We learned about all the states we have united down here, all the people who killed a bunch of other people down here, and we learned that Canada shares the continent with us, but that's all we really have in common: North America. A somewhat shared land, but you still have to sign over your life to cross over to Canadia, and then again on the way back (though the Canadian side is usually nicer than the American side, I will say that). Okay, they say. You can go over there, but just for a bit, don't think about getting too comfortable or we'll come back and getcha!So I read this entire book and even questioned out loud on the internet how much of this story was based on real Newfoundland history. All my GR Canadian friends are probably laughing at me. The whole book is based on real Newfoundland history. The Joe Smallwood character? Like one of the most important people in real life Candian history. Guys, I'm dumb. I'm sorry. I'm American. That's all I can say.The other thing I can say to try to redeem myself is that I loved this book. Absolutely. I can see what Canadia wants to keep Johnston to themselves. He writes with a confidence and a beauty that I'm not sure Americans are prepared for. Well, that might be a bit dramatic, but this is a stunning book. That's my first impression, the one I'm putting down here, the one I'll stand by.The story follows Joe Smallwood through his youngun days and up to his premier days. It's a lengthy book, but it reads so smoothly that you barely even notice. Johnston was artful in how he laid the book out, telling you Smallwood's story through Smallwood's eyes, and then a brief chapter out of the history of Newfoundland, some excerpts from Smallwood's condensed history of Newfoundland, and some from his gal-pal-keep-your-enemies-closer, Fielding's account of the history of Newfoundland. And, my favorite bits, pieces from her journal.So let's talk about Fielding a moment. Sheilagh Fielding is her name, an invented character unlike Smallwood himself. She has a limp, uses a cane, and is unlike most female characters in literature you will ever read. I saw mention somewhere of Fielding being a Dorothy Parker-like character, and I think that is as fair an assessment as any. She is a rough, charming, bewitching character, and I would have been fine if the whole story was hers. Which, I guess, it sort of was. If a movie is made of this, they'll probably get Jennifer Lawrence to play Fielding.But it's also Newfoundland's story. (Says the American.) Newfoundland is on every page of this book which makes me want to pack up and move there right now.I know people will read this and think it was too long, or too meandering, or too something. But it worked for me. All of it worked for me. Don't be turned off by the back cover that calls it a \"mystery and a love story\". There's a little of each, but it's not at all what you would expect. It's just a really good book. Really. Yes, this is coming from someone who knows jack about Canadian history, so someone with real knowledge might have a different assessment. I somehow doubt it, though. Johnston appears to have done his research. He could have actually lived this life for all I know.What I do know is this won't be the last book by Johnston that I read."}, {"userName": "BrokenTune", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "\"We are a people in whose bodies old sea-seeking rivers roar with blood.\"\nI had The Colony Of Unrequited Dreams on my Canada reading list. To be fair, the book was not high up on the list as my knowledge of and interest in Newfoundland was pretty non-existent. If I say my interest in Newfoundland was pretty low, imagine how eager I would have been to read a fictionalised biography of Joseph Smallwood, Newfoundland's first Premier and the politician to lead the Dominion of Newfoundland into the confederation in 1949.Yeah, exactly...had it not been for a CBC group read here on GR, I probably would have missed out on what turned out to be a fascinating read that not only changed my perception of the province but also taught me a lot about Canadian history.As mentioned, The Colony of Unrequited Dreams is a fictionalised biography, and as such it starts off by telling about Smallwood's childhood and his upbringing in an impoverished environment, though he himself was able to attend school and was taught by what seemed British expats with a lot of chips on their shoulders from being stranded in the last outpost of civilisation - i.e. anywhere but Britain. \n \"All my marks had gone dramatically up, except my mark for character, which had stayed at forty-five. Its being not only so low, but also fixed, never-changing, was the point. It could not change, Reeves seemed to be saying; my other marks could go up or down, as the case might be, but my character, my fundamental self, would stay the same. I might as well have had forty-five stamped on my forehead. I was what I was, my character was my fate and my fate was forty-five.\"\n To be honest, the mention of \"forty-five\" made me cringe. I read Alistair McLeod's novel No Great Mischief earlier this year and I sincerely hoped that Johnston would not follow that same path that Alistair McLeod chose for his characters, where all events and character traits where blamed on the \"forty-five\", though in McLeod's case referring to the Scottish Jacobite rising and the Battle of Culloden of 1745.I was hugely relieved the Scottish topic did not make an appearance in Johnston's book. (Obviously, I'm still scarred from reading No Great Mischief.)However, the reference to Smallwood's character being criticised and the overall dismissive attitude by his tutors of anything local, anything originating in Newfoundland, seemed to have a profound impact on the young Smallwood - who early on decides that he should write the \"great Newfoundland\" novel. The literary aspirations of young Smallwood do not come to fruition, however, as he is kicked out of school over a letter he is being accused of writing. Incidentally, Fielding, his childhood friend from the neighbouring girls' school is also forced to leave shortly after. Her leaving, too, happens under unresolved circumstances and she too seems to have been involved in the letter that caused Smallwood's dismissal. From there on, the lives of both \"friends\" intertwine all throughout the story. Fielding, an alcoholic already in her youth, sets out on a career in journalism. Smallwood initially joins her but then decides to become a socialist and travel the land for the cause:\n\"I had bought a Bible in Corner Brook because I hoped my supposed religiosity would impress the sectionmen who fed me and let me spend the night in their shacks. It did, but, more important, it impressed their wives. When their wives went to my suitcase to get any clothes that needed washing, there was the Bible. That Bible, not one page of which I read along the way, kept many a section-man who was otherwise inclined to do so from dismissing me as a Godless socialist and convinced them to sign up with the union. I told them and their wives that when I thought I could not take another step, I took out the Bible and was inspired by reading it to carry on. “I could not have come this far without it,” I shamelessly said, at the same time recalling the many times I had been tempted to lighten my load by throwing it away.\"\nI won't re-tell the story from here on as this would spoil reading the book but eventually Smallwood is in a position where he owns a paper rivaling Fielding's columns and her political satire. It was fascinating to watch the two characters - the semi-historical Smallwood and the entirely fictional Fielding - interact in the course of the story. In a way, Fielding and Smallwood are complementary to each other: where Smallwood is driven by ambition and will not shy away from any trick in the book, Fielding is pragmatic, direct and proud of her integrity.\n\"She was called a fence-sitter and was challenged to defend herself, which she did by saying the accusation might or might not be true.\"\nConfrontations between the two are what made the book rather special:\n“You lost your job?”“No,” she said, “I know exactly where it is. As of two months ago, it was taken from me.” “You didn’t lose your job because of the union,” I said, “you lost your job because you wouldn’t join the union.”“Smallwood,” Fielding said, “are you some sort of agency of fate that it would be pointless of me to resist? If you are, tell me now so I can shoot myself without regret.”\nWhile Fielding was without doubt my favourite character, Johnston masterfully interjects other aspects into the book that are really interesting. For one, Johnston alternates the storytelling through different styles: Smallwood's perspective is told by way of narration from Smallwood's perspective, Fielding's story on the other hand is told through her letters to Smallwood. Both parts are separated with excerpts of real and fictionalised books about the history of Newfoundland.One memorable event that Johnston manages to web into the story is the sealing disaster of the S.S. Newfoundland that led a group of sealers frozen between two ships - neither allowing them shelter from the icy storms before they had caught the set quota of seals. The scene is not one that can easily be forgotten and Johnston does well to catch the despair and sadness of the event without exaggerating.Overall, Johnston's writing of the whole book is excellent. \n \"Where the water stopped, the wind went overland until it met up again with water on the other side, each one, it seemed, driven on by the other. Everything was headed one way — clouds, wind, water, the waves so high the horizon was near and jagged, bobbing as if I was jumping up and down. I was sure the motion of the waves must extend right to the bottom, the whole ocean running like a river infinitely wide. It was impossible not to personify the wind.\"\nHowever, there were still a few snags that kept me from loving this book more: One was the character of Smallwood. Even though the book is amount him, we don't get to know him well. Of course, not being able to read his character could be befitting of a politician. With Smallwood, though, a lot of things were hinted at but never explored, such as his relationship to his family and people other than Fielding. As a reader of a historical novel I would have liked to have seen more of Smallwood as a person and as a politician, not just as Fielding's counter-part. \n \"I thought about telling him that Fielding had saved my life, but I could not bring myself to do it, for it seemed to me that the more people there were who knew of Fielding’s heroism, the more indebted to Fielding I would be. I not only felt indebted to her, I felt, for reasons I could not understand, that her having saved my life rendered me morally inferior to her.\"\nWith respect to Fielding also, there was an issue that seemed to drag the book unnecessarily. Fielding's secret, the reason she was forced to leave school, and the mystery of the letter that caused Smallwood's expulsion, is revealed at a painstakingly slow pace - and left me somewhat disappointed. Btw, the secret is not what you might think it is - there is a twist, but I didn't feel the mystery element was needed in the novel and just drags it out. I shall leave with one more journalistic punch up between Fielding and Smallwood:\n “Got a phone call from himself yesterday. I made a suggestion. He made, and offered to help me carry out, a suggestion of his own. Said on the record I was off my rocker. Off the record a good deal more. The words Scotch and bitch came up a lot.”(Editor’s explanation: Miss Fielding and Mr. Smallwood, though they have never met, chat frequently by phone, often sharing a chuckle over the unaccountable rumours that there exists between them some sort of animosity. The words Scotch and bitch came up frequently in their most recent conversation because Mr. Smallwood had phoned Miss Fielding with the happy news that his terrier had just had a litter of puppies, three of whom were female. Miss Fielding, who had been promised the pick of the litter and who has followed with much interest and concern the course of Pokey’s pregnancy these past few months, could not have been more pleased. As for the exchange of suggestions, it demonstrates perfectly the deep-seated friendship that exists between these two, which no amount of professional rivalry can undermine.)\""}, {"userName": "Mmars", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/2243098-mmars", "userReview": "Really 3.5. For no reason my reading travels have taken me to many cold and desolate climates over the last year. It began in Iceland with Burial Rites. I visited Greenland in the unfinished This Cold Heaven: Seven Seasons in Greenland a follow-up to the The Voyage of the Narwhal in a which a fictional crew sets out in hopes of discovering what happened to John Franklin’s lost expedition in search of the Northwest Passage. I just finished this, a history of Joey Smallwood, Newfoundland’s first premier after confederation with Canada. And now I’ve picked up The Snow Child set in the Alaskan wilds circa 1920. Now let me make this clear. I hate winter. These are not comfort reads. This was not intentional. Newfoundland is somewhere that I had given little thought to for a great number of years. I knew virtually nothing of its history. Well, this book will bring any reader up on that. At first, I enjoyed the story. That of Smallwood’s impoverished childhood, living with a raging alcoholic father, and the oldest of many siblings. Because his uncle has been successful in the shoe business the Smallwood family is always well-shoed, but otherwise lacking. Joey Smallwood is fortunate in that his uncle sees that he has the opportunity for an education. Unfortunately, he is scandalized and several of these peers weave in and out of his life. A letter that sets his life on a different course remains a mystery to Smallwood for the rest of the book. And it is this premise that I struggled most with throughout this long book. It just wasn’t that compelling for me.I enjoyed most of the other aspects of Smallwood’s life path. That he left Newfoundland for New York City for a brief period, traveling by train across the island, then living marginally fortunately saved by other Newfoundlander’s there. That he returns to Newfoundland to organize labor and unions by walking much of the country. His career as a barely paid journalist and later as a host of a radio show intended to enlighten people on the country. And again traveling the coastal habitations and for political and social causes. Always though, wanting to leave his mark, but rarely seeming to be more than impoverished. Until finally he is known enough through his endeavors and he becomes Newfoundland’s first Premier after confederation with Canada. Until this time Britain has again and again assigned men to rule Newfoundland, but with various degrees of failure. Interspersed with Smallwood’s tale are brief descriptions of Newfoundland’s political rule. These are written by Fielding, an old female classmate and the reason for his childhood educational ending. He loves Fielding but is inept in the emotional IQ department and their relationship is really strange. She too is a journalist, but one who never takes to any particular line of political thought. Only that of placing thorns in everyone’s sides. There is a denouement in Fielding’s life toward the end of the book, but by then I had been strung along too long, and it did not have the desired impact. I have mixed feelings toward this book. It was saga-like but was too long. Although it packed a lot of history in. I so enjoyed the “physical” aspects of the book – the necessarily hard life of living in a remote and relatively unwanted land, of interest for its two natural resources, fish and lumber. And I enjoyed learning about its history and the fascinating story of Smallwood, a footnote in world history. I do think having more background on Newfoundland would have helped my appreciate this book, but there’s always plot and story well executed and told and unfortunately some of those footings were a little too shaky for me. 3.5 stars."}, {"userName": "Gail Amendt", "userReviewDate": "Jul 20, 2011", "userURL": "http://www.goodreads.com/user/show/5739689-gail-amendt", "userReview": "The best work of historical fiction I have read in a long time. Based on history - that of Newfoundland's entry into Confederation and the architect of that event - Newfoundland's first premier, Joey Smallwood, this is still very much a work of fiction. I'm not sure how much of the Smallwood we read about is real, but he is certainly an engaging, complex and well developed character. His longtime friend/love/nemesis, Sheilagh Fielding is one of my favorite female characters of all time and I'm so glad to hear that Johnston has written another book about her. Wayne Johnston always writes with wit and his word plays are second to none. I can't believe I liked a book about politics this much."}, {"userName": "Shane", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/1798222-shane", "userReview": "Mixing a historically significant character with a fictitious one is an interesting conceit, especially if the fictitious one outshines the real guy. Joey Smallwood, first premier of Newfounland post-confederation with Canada, is the real person, a kid from the sticks of St. John’s, whose father is an alcoholic and whose mother can’t stop having babies, who dreams big and seeks power, believing that one day he will be the premier of his country (yes, it was a country, a rather bankrupt one, before it became a Canadian province). Sheilagh Fielding, the fictitious character, is a doctor’s daughter from the “quality” side of the social strata; she is a journalist and Smallwood’s nemesis, a cynic oozing irony when she is not boozing on Scotch. Fielding is a metaphor for Smallwood’s Newfoundland: tortured, secretive, betrayed, impoverished, alcoholic, brash. They are in love with each other but are too intellectual and uptight to consummate their passion—they address each other by their last names even during intimate and private moments. In fact, for a politician, Smallwood’s sexual appetite is strangely...well...small. He prefers to sublimate his energy by walking or sailing around the Rock in all kinds of inclement weather, collecting union dues for his socialist cause from uneducated people who would prefer to hide from their neighbours in coves and harbours and spend their time fishing.Smallwood and Fielding have gaping character holes in addition to physical deformities. He is small, myopic, emaciated, pre-tubercular and is a lousy father and husband who never spends time with his family. She has a game leg, cannot shake off the booze, is tubercular, and is alienated from her family. A letter sent to the local newspaper that gets 15-year-old Smallwood expelled from his prestigious high school begins the life-long duel between this formidable couple and turns into a mystery that runs through the book, taking on sinister implications as new information is unearthed. Smallwood’s takes to a career in journalism and radio, and uses his media platforms to solidify his political position in the rural areas outside St. John’s. In fact, when the referendum on confederation is finally fought, it is these outlying areas that swing the vote towards a union with Canada—Smallwood’s goal all along. He is obsessed with writing Newfoundland’s history to counter the inaccurate attempts made thus far by others. And Fielding is out to do the same; but she belittles this impossible and inhospitable colony that seems to be run by charlatans and has-beens of the Colonial office.The novel covers Smallwood’s and Fielding’s lives from age 15 through to their retirement years in a combination of first person narrative (Smallwood), journal entries and unsent letters (Fielding) and short extracts from Fielding’s irony-laden, condensed version of The History of Newfoundland. I laughed during sections of this novel, particularly throughout the “true story” of prime minister Sir Richard Squires’ escape from the mob, aided by our dynamic duo. The unravelling of Fielding’s dark secret was heart wrenching, although reminiscent of most Canadian family dramas that reveal skeletons in closets brought about by lust and impropriety.Most importantly, I believe this novel is a better introduction to the history of Newfoundland than the books Smallwood and Fielding were trying to either discredit or write themselves."}, {"userName": "Ann-Marie", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/1077815-ann-marie", "userReview": "Seemed a bit derivative of Howard Norman (Sheilagh Fielding is a close sister to Margaret Handle in The Bird Artist, which was published a few years earlier). Although the writing is good—the author excels at description and character develpment—the story somehow doesn’t seem to justify the length (500-plus pages). That said, the interwoven pages from Fielding’s history of Newfoundland are an interesting device. Without them, there’d be less of a sense of place, which is essential for the story. Also, Fielding’s other writings are almost a novel in themselves. The two voices (of Joe Smallwood, the main character, and of Fielding) are complementary, as are Fielding’s public (history) and private (diary) voices. So it’s odd that to a large extent, it felt like the same thing all the way through ... And the mystery of who really wrote the letter that got Joe expelled from school wasn't that compelling. I kept waiting for something (Joe’s eventual triumph?) to happen, but it never does really, even though he becomes the first premier of Newfoundland after federation with Canada."}, {"userName": "Krista", "userReviewDate": "Jan 27, 2014", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "While reading The Colony of Unrequited Dreams, and especially upon finishing it, I needed to know just how historically accurate the narrative was -- the Joey Smallwood of the book fit more or less with the bits I know about the actual first Premier of Newfoundland, but if the acid-penned, hilariously ironic Sheilagh Fielding did exist, I wanted to learn more about her. A google search led to this essay by the author, Wayne Johnston, and the following revelation: \n The Colony of Unrequited Dreams is a dramatic rendering of the spirit of a people and a place, an island that in 1948 came within a hair's breadth of achieving nationhood and that it still longs for to this day. It was written in the belief that in this story of Newfoundland, this love story whose two main players are characters inspired by Joe Smallwood and the wholly imaginary Sheilagh Fielding, readers everywhere would see reflected their own attempts to crawl out from underneath the avalanche of history with their human individuality intact.\nI also happen to be listening to Pat Conroy's My Reading Life right now, and early in that book Conroy makes the case that Gone With the Wind is a masterwork, perfectly capturing the South's transition from separate society through the tragedy of the Civil War to ultimate confirmation of its indivisible union with the Northern States, and I don't think that it would be overstating it to say that The Colony of Unrequited Dreams is Newfoundland's Gone With the Wind; if Scarlett O'Hara is the embodiment of the South's transition, then Smallwood embodies the Rock's; if Rhett Butler is a dramatic foil, then so too is Sheilagh Feilding. But that's not to say that this book seems derivative in any way -- The Colony of Unrequited Dreams is epic and sweeping and wholly original. Through excerpts from the actual A History Of Newfoundland From The English Colonial And Foreign Records by D.W. Prowse and a highly ironic fictional history written by Fielding, a historical overview of the island is provided that gives context to the narrative. Through Smallwood's first person life story and Fielding's journals and newspaper columns, the capital-H-History of the time and place is made intimate and personal. On top of this intriguing structure are the words themselves -- the sentence-by-sentence beautiful writing and Newfie humour had me riveted on every page. A view of Newfoundland from offshore:\n It was hard to believe Newfoundland was an island and not the edge of some continent, for it extended as far as the eye could see to east and west, the headlands showing no signs of attenuation; a massive assertion of land, sea's end, the outer limit of all the water in the world, a great, looming, sky-obliterating chunk of rock.\nAnd a typical, to my ear typically Newfie, turn of phrase that made me chuckle and wince in equal measure:\n I well understood my father's horror of domesticity, of entrapment and confinement. The thought of nights in some fetid breeding bed while the products of other such nights lay listening in the next room or outside the door I found so revolting that I vowed I would never marry.\nThe Colony of Unrequited Dreams is a love-letter to Newfoundland and beautifully achieves the author's goal (from the same essay as above): It is about the human character and human emotions inherent in and often masked by historical events and by the written record we call \"history.\" This book has my highest recommendation -- if only Sheilagh Fielding actually existed; how I would love to immerse myself in her newspaper columns."}, {"userName": "John Hanson", "userReviewDate": "Nov 15, 2011", "userURL": "http://www.goodreads.com/user/show/5518587-john-hanson", "userReview": "I'm reviewing this novel with much trepidation and caution. My copy is signed by Mr. Johnston who I met at a reading this past November for his latest novel. He's a nice man and a great reader. He could be a stand-up comic, very dry, very patient with his story telling, and has a very good understanding of story at that. My caution comes from my own writing about Newfoundland, and I have to be very cautious for I am a Mainlander, not a native son. I have a sense of what Newfoundland is about. I've known and worked with many Newfs. I've partied in the Newfoundland embassy at Acadia University in the early 80's, and I began my own writing journey during a three month stay in St. John's. For the record, I have two novels nearly completed -- nearly is not an accurate word in this business -- and both are about Newfoundland characters. I've roamed the streets of St. John's at all hours of the day, I've toured the city by car, foot, and bus. I've worked with her people, drank coffees at night with them, and I've discussed with them what it is to be a Newfoundlander. I'm no expert on this subject. For that, I'd recommend David Benson at Afterwords book store on Water St., a quiet sidewalk smoker with all the histories of Newfoundland in his head plus a few not yet published. I saw Mr. Smallwood once, February 1991, in the Hotel Newfoundland. He was old and skinny, but he carried an air of dignity. I pictured him as a silver statue of elegance stuck in this land of self deprevation. That's what Newfoundland feels like; it feels like a line-up of inner city American vagrants waiting for their soup and handouts and complaining of the 1% and how such a raw deal they've recieved. It's a community dominated by unrequittedness, and it is very much a community. Wayne discusses the differences between St. Johners and the rest, the Baymen if you will; though they aren't all bay men. But to me, these are city-rural differences only. Burn a Newfoundland flag, and they'll all join in throwing your kicked ass into the ocean.This story lacks certain elements. There's no gripping mainstream plot; there's no great dissection of Joey Smallwood; and there's no satisfaction of story. Plot? Nope. This is a literary novel. Yes there's tension galore, but there's no dragon tattoo story here. Didn't really expect one, and I wasn't disappointed.Shallowness, emptiness. I think it might be worthwhile to point out who the main character is. In my opinion, it's the people of Newfoundland. It's the unrequitted tribe. We get a lot about Joe; it's told by him, but we really never get a sense of who he really is. He comes across as all high and mighty, but we also see his unexplained weaknesses: getting drunk, living as a bum in NYC, and dolling his influence on freedom of speech he so much relished earlier. I came away with little understanding of how the man really felt, and I felt little empathy. Many have argued this, but I found much of the discussion superfluous. I felt Joe was a first person narrator, telling the story through his disconnected voice. But I think that was necessary. If we fell in love with Joe, we'd never know the true Newfoundland.In the end, we're not satisfied with the outcome. Plain and simple. There's no story resolution to make you sit back and say \"wow.\" It leaves you hanging, empty. But you kow, Newfoundland leaves you hanging and empty. Her great people leave you hanging and empty. This is not a criticism of the land, but let's be honest. It's way the hell out there on the edge of the continent. They live on the outside looking in. They are very much forgotten and ignored by the rest of us.But when you add up everything, the constant, empty searching by Joe, the ascorbic commentaries by Fielding, and the constant unfulfilled hopes and dreams of this mysteriouos nation, you end up with a brilliant characterization of a land, of Newfoundland. As I read it, and as I continue to write about it, I find it's wholly consistent with my understandings and probably with reality. And that made me say \"WOW!\""}, {"userName": "Brian", "userReviewDate": "Jan 20, 2013", "userURL": "http://www.goodreads.com/user/show/160726-brian", "userReview": "I am typically a harsh critic of historical fiction (a crude subject heading that allows for the inclusion of fictionalized history) so it was both surprising and enchanting to discover in Wayne Johnston's The Colony of Unrequited Dreams a beautiful story tucked into a bed of \"real\" events and people. For those easily side-tracked by history, for those that read primarily to \"better themselves,\" beware the temptation to think this is the story of Joey Smallwood just because he is the first-person narrator of the hefty part of the tome. The character is a self-confessed windbag. Lest the reader be misled by the love we all hold for anyone with a recognizable nametag, Johnston gives Smallwood a lucid moment near the end where he is self-depicted as \"...absurd, vain, pompous, strutting, and ambitious...\" This is not the description of a character that I would willingly follow through his lifetime of foolishness, not without some incentive beyond merely cozying up to a fictional final father of Confederation. The real story is about Shelagh Fielding. She begins it. She ends it. She moves it. It is her unrelenting, inexplicable, unrequited love of Joey that allows the reader to have some hope, if little sympathy, for the bumbling accidental politician that one can only hope was a caricature of the real Smallwood. It is Fielding—with her razor wit, her strength, her poignant suffering, her ironic position as the saviour of Smallwood's career, his moral compass, his very life—that feeds the hungry reader. It is in her life, nestled in the same obscurity as Shawnawdithit's, we search for meaningful lessons, we see the reflection of the unforgiving landscape of the novel. It is her brave and stoic separation from the love of her children, her parents, her lover that trumps whatever losses to corruption and incompetence her countrymen have suffered. Never have I read a more palatable account of \"real\" suffering and loss."}, {"userName": "Dawn", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/5341034-dawn", "userReview": "I loved this book. It was enthralling and informative, well written and funny. I know very little about the history of Newfoundland, it's the other end of the country and to be honest, from a cultural point of view, BC has more in common with Washington, Oregon and California than with the rest of Canada and I seldom think about what goes on out East. While I realize much of this book is fictional, including one of the main characters, it fills in some very basic \"how life was\" in Newfoundland before joining Canada that I wasn't aware of. I certainly wasn't aware that they had been a Dominion or of the controversy over joining Canada. The character of Fielding was fantastic, she was a Dorothy Parker-esque type person. Acerbic but fragile and full of great quips, she has an independent opinion on everything and tends to think more about herself than the big political issues. She is a great foil for Smallwood who wants to make a name for himself and tends to be depressingly serious and socialist conscious. The story of Smallwood's life, as told by him, are alternated with sections of Fielding's diary and parts of the condensed history of Newfoundland that she is writing, very much in a sarcastic style. Her history made me laugh out loud several times, especially when they were about the unfairness of colonialism. I polished off this book in three days, over the course of a week, though the majority of it was read on one Saturday, where I didn't move from my very comfortable chair for hours on end, except to get another cup of tea. I highly recommend this book."}, {"userName": "Badly Drawn Girl", "userReviewDate": "Apr 22, 2011", "userURL": "http://www.goodreads.com/user/show/3131165-badly-drawn-girl", "userReview": "The history of Newfoundland is not a subject I would ever think I would enjoy learning about. This brilliantly written book manages to sum up the history of that island in a truly fascinating way. I never felt like this book was dragging, even though it is very large and stuffed to the brim with information, facts, and observations. By following the life of the future first premier of the country, Wayne Johnston reels his readers in. Joe Smallwood is like the little engine that could, he just keeps trucking along even when outside forces conspire against him. I found myself celebrating his achievements and mourning his losses and mistakes as if he were a person I knew and loved. And the character of Fielding is so wonderfully unique. You just never know what is going on in her head. And running throughout the book is the current of love and longing shared by these two who insist on pushing each other away at every chance. Don't let the subject matter scare you off. If you like well written stories with fully developed characters that come to life before you eyes this is a book you will probably enjoy!"}, {"userName": "Charles Henri", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/7581803-charles-henri", "userReview": "This book was highly recommended to me so I started with high expectations. But no matter how hard I tried, I could never really get into it. I should have abandoned it after a while but I kept reading through it, which took me a while to end it. It's not that it is a bad book or anything. It is well written with great vocabulary. But it's the whole tone to it... I felt like the author wanted to write about Newfoundland itself and the book was just a pretence to get to do that. Half formal history - half storytelling, everything is put in place to describe the history of Newfoundland. I felt like I was in a class room the whole time I read the book. As for the characters, the author tells the story of one Premier of the Province, but you can't help and wonder how much is romanticized and how much is true. How can you invent so much on a real person or how to you get to know their hidden stories that way? It just felt awkward reading through it. Maybe I should have moved on to something else sooner but it was interesting enough to finally get me through without ever being really captivated by it. Sorry to say, I'm happy to move on."}, {"userName": "HomeInMyShoes", "userReviewDate": "Dec 03, 2015", "userURL": "http://www.goodreads.com/user/show/5875907-homeinmyshoes", "userReview": "I laughed, I gasped, I almost cried. Some books are like that. There are those that would have cheered for the storm to finish him off, but what a story we would have lost. Very much five stars."}, {"userName": "Tracey", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/37756416-tracey", "userReview": "[I am a 100 pages in and am already drawn into the story. At this point the most memorable chapter for me was the episode of the sealers and the hard life they led. Having recently read Moby Dick I recognize the same tribute made to men who may have had to do a cruel hard job so as to save their families from starvation. People today complain so much about conditions in workplaces but looking back, previous generations would have thought we have it easy, which compared to them, we do. A very moving chapter on their courage and sacrifice.I have read the first 3 parts. The first part, detailing Smallwood and Fielding's school years I thoroughly enjoyed. Part 2 set in New York was not as interesting but the book picks up again in part 3 when Smallwood is back in Newfoundland.What I am enjoying the most are the newspaper columns and history of Newfoundland written by Fielding. Her irony is very amusing and smart. Out of all the characters I feel sorry the most for her. She seems to be a woman who is unable to believe the man can do any good from choice and as a result is a very lonely cynical woman; yet at heart she has a flicker of desire/hope that she is wrong. In part 4 Johnson juxtaposes the lives of the poor fishermen and their families in remote areas ice locked a lot of the time, with the British Commission, wealthy Newfoundlanders, and their wives.In the remote areas the fisherman have no money to buy anything and all their homes and furniture are made out of things like old crates and doors; the things others throw away. They have not enough to eat and live and work in harsh conditions. A caribou herd travels through one settlement he is staying and he asks the son of the home if they eat them. He says that not much due to few having guns and those that do cannot afford many bullets.When he returns from these regions, Smallwood is invited to attend an evening with the British Commission. There the tables are groaning with rich and expensive foods, and the people 'running the whole show' are dressed up like the aristocracy. As Smallwood says, to a fellow Newfie journalist, \"We are living in an occupied country. A marvelous piece of writing worthy of 5 stars.The book continues right to the end to be worthy of 4.5 stars.  (hide spoiler)]"}, {"userName": "Ron Charles", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "As Hollywood forgot long ago, romance, terror, and wit are produced by restraint, not excess. What better place to test that rule than Newfoundland, whose ferocious weather inspires a great deal of restraint, indeed. The setting for Wayne Johnston's spectacular new novel, \"The Colony of Unrequited Dreams,\" sometimes slows love and hate to glacial speed, but that only emphasizes the land's awesome power.Johnston's epic tells the fictionalized life of Newfoundland's first premier, Joe Smallwood. Born on the eve of the 20th century, Joe lives with his 12 siblings under the erratic terror and pleading of their alcoholic father and Pentecostal mother.When a rich uncle sends Joe to a snobby private school, the boy finally has reason to think he'll make something of himself. Despite his humble background, he manages to navigate this world of wit and wealth with some success. He even holds his own against the biting repartee of Sheilagh Fielding, a bold, bright young woman whom everyone refers to by her last name.Graduation and the social status it will afford are only months away when Joe is accused of writing a slanderous letter about the school to a local newspaper. At a crucial moment in the boy's mock trial, Fielding interrupts and confesses, a move that shocks Joe most of all and locks him in a frustrating, life-long attraction to this deadly sarcastic young woman.Despite her confession, the cruel headmaster continues to hound Joe until he drops out of school. His father, so reluctant for Joe to mingle with the upper-class scholars, now rages day and night about his son's expulsion.At the center of his father's rantings is an old book of Newfoundland history, a national story he's sure will never include him or his son. Fed up with her husband's obsession, one night Joe's mother grabs the book and throws it outside, a move that starts a avalanche that kills an old man.In this odd, cold place, Johnston has managed to cultivate a wonderful hybrid of Charles Dickens, John Irving, and Annie Proulx.From this richly drawn, inauspicious adolescence, Joe and Fielding strike out into the world on separate paths that cross every few years. One old woman tells Joe, \"There's not enough of you to bait a hook with,\" but he's determined to make a name for himself. A succession of jobs as a journalist, unionizer, radio host, and political assistant leads him across Newfoundland as a \"wanderlusting patriot.\"In one of the book's most haunting episodes, Joe accompanies a seal ship that gets caught in a bad storm. Eighty hunters are left on the ice, lost in the snow. When they're finally found several days later, wind has blown the snow away, leaving a bleached vision of Pompeii: \"For several minutes after the ship stopped, no one disembarked. I saw what I had not been able to through my binoculars: that these were not survivors but a strange statuary of the dead.\"Later, in a chapter that tests the limits of nature and man, Joe walks across the entire frozen country to meet and unionize all the railway selectmen. After a mixed success, he sets out to organize hundreds of desperate fishermen, until he finally realizes that these poor people don't even have a word for the concept of government.\"There was something about abject hopelessness,\" he admits, \"that inspired a delusionary optimism in me, a belief that for me, if for no one else in Newfoundland, prosperity lay just around the corner.\"Though he gives up his health, family, pride, and principles to ensure a place in Newfoundland history, Joe never gives up his ambiguous love for Fielding. Never has there be a more excruciatingly unconsummated relationship. \"We were not lovers,\" Joe confesses to this fascinating, sardonic woman. \"What were we?\"While Joe rises up the shaky political ranks of Newfoundland's on-again, off-again government, Fielding survives her chilly father, a bout with tuberculous, and alcoholism to become a leading political satirist. Her \"Field Day\" column is regularly devoted to ridiculing Joe.Throughout Joe's narrative of his unlikely rise, the author interrupts with selections from Fielding's hysterically sarcastic \"Condensed History of Newfoundland,\" her brutal newspaper columns, and her emotional diary. The friction between all these voices generates a tremendous degree of light and heat in this icebound story.Looking back at his unlikely success, Joe says, \"Newfoundland stirred in me, as all great things did, a longing to accomplish or create something commensurate with it.\" Clearly, Johnston has done just that.http://www.csmonitor.com/1999/0805/p2..."}, {"userName": "Ian", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/31384949-ian", "userReview": "I have had something of an interest in Newfoundland ever since an all-too-brief visit to The Rock back in the nineties, when I was bowled over by the landscapes and people. \"The Colony of Unrequited Dreams\" is a fictionalised biography of the life of Joey Smallwood, former premier of the Province and the man widely seen as the architect of its union with Canada in 1949. This novel is no plodding history-as-drama though. Smallwood is portrayed (perhaps accurately?)as a driven, ambitious character; born into a decidedly ailing branch of an otherwise middle class family, with an alcoholic father and numerous siblings. Despite the odds being stacked against him he is determined to somehow write his name into the history books. After countless false starts and failures he gains a degree of success as the host of a radio programme, and uses his modest fame to become the champion of confederation with Canada, (initially the viewpoint of a small minority). The strategy succeeds, but Newfoundland itself is too small and too poor for Smallwood's grandiose vision, and so desperate is he to transform the island that he becomes an easy mark for smooth talking \"investors\" who promise much but deliver little. Smallwood's failures as premier are hilariously ridiculed by the novel's other main character, the (sadly) entirely fictional Sheilagh Fielding. Smallwood and Fielding (they always call each other by their surnames)meet at school and go on to have a lifelong emotional but not physical love affair. Their relationship has more than its share of fiery moments and Fielding - intelligent, disillusioned, alcoholic, and possessed of razor sharp wit - ends up as a columnist on an opposition newspaper. The section containing Fielding's newspaper columns describing a tour of Europe made by Smallwood had me rocking with laughter. At other times the reader is left with a feeling of regret over the two characters' failure to consummate their desire for one another. Woven into the novel are two pilgrimage-like journeys undertaken by Smallwood, one across the interior of Newfoundland and the other along the coast. Both contain amazing descriptions of the island, and the incredible remoteness and isolation of the lives of the inhabitants away from St. John's. The early part of the novel also includes a journey made by Smallwood as an observer on a seal hunt, a terrifying description of the hardships of life for early 20th century Newfoundlanders.The Joey Smallwood portrayed in the book is in many ways a cold, hard character. The novel is at different times warm, funny, tragic and moving."}, {"userName": "Shannon", "userReviewDate": "Feb 22, 2013", "userURL": "http://www.goodreads.com/user/show/1715547-shannon", "userReview": "This title fit the book very well.I enjoyed the characters very much and felt that Fielding was essential to the story. I loved the layers of irony and the demonstrations of things simply stated. Eg. Smallwood said he was not a good father or husband and then throughout the book you realize how little the wife and children play a part its incredibly demonstrative of how poor he is at those roles.One of the highlights of the novel is a series of brief interpolated chapters under the rubric of \"Fielding’s Condensed History of Newfoundland\" in which Johnston revisits various episodes from the island’s past, deploying his wit to provide an historical context—Newfoundlanders having for centuries been cheated, exploited, or at best ignored by those who have power over them—that helps make sense of Smallwood’s Newfoundland.It was a dense book that read fairly slowly but I definitely enjoyed it and will read more by this Canadian author."}, {"userName": "Tina Siegel", "userReviewDate": "Jul 08, 2010", "userURL": "http://www.goodreads.com/user/show/3827161-tina-siegel", "userReview": "This should have been a fabulous book. And parts of it were - mostly the language. I think Wayne Johnston did a wonderful job of evoking the tone and timbre of the time he's writing about. He also has a remarkable job of creating his two main characters - both Smallwood and Fielding are quirky and smart and a little irritating, with very distinct voices. Actually, I did love Fielding. She's feisty. Unfortunately, the story focuses on Smallwood, who (as thoroughly imagined as he is) feels pedantic and fussy and repressed and boring. Which was my reaction to everything else in the book. The style might be appropriate for the time in which the book is set, but it comes across as stuffy and unappealing here. And that's over 500 pages of stuffy and unappealing. Completely unnecessary.Ultimately, my affection for Fielding wasn't enough. I hated it."}, {"userName": "Sarah B.", "userReviewDate": "Sep 06, 2010", "userURL": "http://www.goodreads.com/user/show/360913-sarah-b", "userReview": "This was the most fun I can ever remember having with Canadian history. I was fascinated by the characters' personal lives, and very interested in the development of Newfoundland as a country before it entered Confederation. I wish it could have been written from the point of view of Sheilagh Fielding, who I found much more interesting than Joey Smallwood. Smallwood's naked ambition was almost his only character trait. But I guess Johnston might not have been able to include as much detail in his political history if he had followed Fielding instead of Smallwood, so in the end it was probably the right decision. Wondering how much more I would have loved the book if Fielding had been the main character is what keeps me from giving it a 5 out of 5."}, {"userName": "Toto", "userReviewDate": "Jun 09, 2014", "userURL": "http://www.goodreads.com/user/show/11218866-toto", "userReview": "The book starts with a bang but ends not even with a whimper. The early years of Joey Smallwood are well imagined; he is a real person. Once he gets married and devotes his life to socialist utopia for Newfoundland, the story falls apart. He becomes a stiff historical figure and his story loses its dramatic tension as it is engulfed in regional and federal politics. His imaginary love affair with the odd Ms Fielding is thoroughly unconvincing.Historical fiction is one of the hardest genres to write. This book shows why."}, {"userName": "Kristen", "userReviewDate": "Jul 11, 2015", "userURL": "http://www.goodreads.com/user/show/1041137-kristen", "userReview": "The Colony of Unrequited Dreams is at its heart a book about Newfoundland. Johnston creates a fictionalized version of Joey Smallwood, a real Canadian labor organizer and politician, to tell this story of the province during the 20th century. Like Robertson Davies (my gateway into Canadian literature), Johnston finds a really nice balance between wit and depth that I like a lot. Thanks to Keith for the recommendation!"}, {"userName": "Jennifer", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/60972434-jennifer", "userReview": "I had high hopes for this book going into it and it did deliver initially. Gorgeous writing and an intriguing storyline (at the outset) kept me going. But after page 350 or so, I just couldn't do it anymore. When it started getting into the whole confederation drama, I was just too tired to get into it. Significant skimming occurred at that point. I did finish -- I just couldn't outright quit after going so far."}, {"userName": "Maria", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/7794948-maria", "userReview": "Where to start? This was a very long book that took a lot of motivation to pick up off my shelf, but that I ended up having a lot of opinions about. I was worried that it was going to be really dense, but fortunately, it turned out to be a very well written and engaging book about Newfoundland. The Colony of Unrequited Dreams is historical fiction about Joey Smallwood, Newfoundland's first premier who helped to usher Newfoundland into confederation with Canada. He is both a well liked and disliked premier, depending on who you talk to. Johnston definitely takes a lot of liberties with Smallwood's character in this novel, but the story is still pretty accurately based on his life in terms of what he accomplished. The story starts with Smallwood as a child in the early 1900's. His family we're shoe salesmen in St. John's and he lived up on the Brow looking over the Harbour until his uncle decided to pay to send him to Bishop Feild, the prestigious boy's boarding school of the day. At Bishop Feild, he meets Prowse, grandson of a noted historian, and Fielding, a girl who attends the nearby sister school, Bishop Spencer. Fielding is the other main character in this story and unlike Smallwood, her character is completely fabricated. Fielding has a cane, walks with a limp, has a wry sense of humour, with sarcasm and irony being her preferred mediums. She's a bit of an outcast who goes on to work as a reporter for The Telegram, publishing critical articles about all branches and parties of the government. Fielding marches to the beat of her own drum and I really liked her. I loved that she wasn't afraid to speak her mind and I loved her sense of humour.This book actually had a lot more humour in it than I was expecting and it had me laughing out loud early in the novel. Below is one of my favourite quotes from the book, which is an argument Smallwood has with his mother, and had me laughing because I also grew up in St. John's while my parents grew up in rural outport communities. This is pretty much the exact same thing my parents would say to me growing up and the biggest way you could offend my parents would be to call them townies. \n\"I'm a Newfoundlander, but not St. John's born, no, not St. John's born,\" he said.\"You're a bayman and you always will be,\" my mother said.\nI've been living on the West Coast for the last 4 years, so this was super nostalgic for me. Wayne Johnston is not even describing my St. John's in this novel because it's set between 1900 and 1950, but there's something really special about still being able to vividly picture the setting of a story, especially when it's a place like Newfoundland, which I hold so special in my heart. I didn't love Joe Smallwood's character, but I did like the writing. This was one of my monthly challenge books and I'm glad I challenged myself to read it because I probably never would have gotten around to it otherwise. Johnston does a really great job with the setting. I don't know how non-Newfoundlanders might feel about this book, but I loved the setting and the atmosphere Johnston created. Especially towards the end when we finally get to the whole business of confederation and the end of independence. I felt like Johnston did a good job of not taking a side and presenting both sides of the story. It really makes you reflect on what Newfoundland gained, what it lost, and what may or may not have been.I read Greg Malone's Don't Tell the Newfoundlanders several years ago and I felt that this book was a good contrast to that. Greg Malone is very clearly anti-confederation, as well as a bit of a conspiracy theorist. While I really liked Don't Tell the Newfoundlanders, because it has some great history in it and I learned a lot, it is very speculative and I liked that Wayne Johnston presented a more balanced version of history and I feel he left his personal feelings out of it.For those of you not well versed in Newfoundland's history, we we're an independent country up until 1933 when we had a commission of government forced on us by the British as a result of our war debt (even though A LOT of Newfoundlanders lost their lives fighting for Great Britain in WWI - I am a little bitter, yes). I've written an entire blog post about Don't Tell the Newfoundlanders if you're interested in our fascinating history (to me anyways), but basically we were supposed to get back our independence when we became self-sustaining once more, which we did after WWII. However, instead of just turning governance back over to Newfoundland, it was decided to hold a referendum to let the people choose if they wanted to join Canada instead.Joe Smallwood wanted nothing more than to do something for which he would be remembered. He dropped out of Bishop Feild and failed at making a life for himself in New York, so he was desperate to have an influence in Newfoundland's future. He was an avid socialist in his youth, but upon realizing that Newfoundlanders were never going to buy into socialism, he turned his talents to the Liberal government. He helped former Prime Minister Sir Richard Squires with his re-election campaign in hopes of winning the nomination to run himself, but he is jilted by Squires again and again and struggles to get into politics. In this novel, he is a huge supporter of unions, walking across the entire provincial railroad line to start a rail-workers union, and he later travels all around Newfoundland's most remote islands, trying to start a fisherman's union. This really gave me an appreciation for how Smallwood became so popular and influential and why he supported Confederation. He really cared about Newfoundlanders and he spent an inordinate amount of time speaking with the poor throughout his life. He was also the host of a popular radio show that focused on sharing stories of Newfoundland and about Newfoundlanders. \nThe fisherman were not nationalists of any sort...They would vote for Confederation to get the mother's allowance and would live by Confederation exactly as they had before...They had starved through a depression that had ended when the war began. Now, they were terrified that another decade like the thirties was on its way.\nThe crowd from St. John's, the merchants and the wealthy, were all big supporters of independence. But Smallwood understood from his travels around Newfoundland that the majority of Newfoundlanders were poor fisherman, struggling to keep food on the table. They didn't care about the government of the day and it rarely affected them. Confederation wouldn't really change anything for them, except they'd be able to profit from access to Canada's established public services. \nThe anti-confederates must have wondered how they lost...They had been to London and they had been to New York, but they had never been to Bonavista or La Poile, and that was why they lost.\nDon't Tell the Newfoundlanders leaves you feeling angry and riled up, but The Colony of Unrequited Dreams gave me an appreciation of what it was really like for Newfoundlanders. Forget the politics and the conspiracies, rural fishermen just wanted to catch a break and this was something I never really understood before. Yet Johnston still presents the other side of the story and makes you feel very nostalgic for what might have been. Personally, I wish we could have seen what might have been had we re-gained our independence, but I do also think it's likely that we might have ended up joining Canada anyways and I'm proud to be both a Newfoundlander and a Canadian. I think this must be one of the reasons why Newfoundlanders always retain such a keen sense of home no matter where they go. There is something unique about Newfoundland culture that does not come from Canada because we have not always been Canadian.The ending of this book was heartbreaking for me though. I was a little bit disappointed that Johnston chose to end this book about Fielding. I really liked her, but as a fictional character, I don't think her story was quite as powerful and it felt very anti-climatic to suddenly jump back into Fielding's past.\n\"You all but gave away Churchill Falls, which you had hoped would crown your career as Confederation had crowned Mackenzie King's\"\nJohnston touches very briefly on Churchill Falls and I wish he'd explored it more. If this book had been written 10 years later, I'm sure he would have because the Lower Churchill is such a hot topic in Newfoundland right now. But I found this so heartbreaking because Churchill Falls was meant to be Smallwood's swan song - his legacy - and instead it turned out to be one of the worst deals every made and a real sore spot for Newfoundlanders. Smallwood did not have a successful start as Premier and Johnston portrays him running out of time in office and chasing after Churchill Falls as his last chance to see Newfoundland transformed.That said, my favourite part of this book is easily the way Johnston writes about Newfoundland. You can tell he has a great love and reverence for the island. I'm sure any Newfoundlander can relate as there's just something that makes Newfoundlanders have this deep attachment to their homeland. She's a rocky isle in the ocean, and she's pounded by winds from the sea, but you just can't help but love her ruggedness and her people. Smallwood was relentless and he really did want to do something good for Newfoundland. His whole life was dedicated to making Newfoundlander better and I do really think he cared about the poor Newfoundlanders and that they are what ultimately motivated him to chase after confederation. \nI have often thought of that train hurtling down the Bonavista like the victory express. And all around it the northern night, the barrens, the bogs, the rocks and ponds and hills of Newfoundland. The Straits of Belle Isle, from the island side of which I have seen the coast of Labrador. These things, finally, primarily, are Newfoundland. From a mind divesting itself of images, those of the land would be the last to go. We are a people on whose mind these images have been imprinted. We are a people in whose bodies old sea-seeking rivers roar with blood."}, {"userName": "Dianne", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/3222213-dianne", "userReview": "The Colony of Unrequited Dreams by Wayne JohnstonWayne Johnston is a wonderful writer. I read \"The Navigator Of New York\" a few years ago and found the same excellent reading this time. These books aren't the sort you just have to keep reading to see what happens next. I had no problem setting this one aside to read our Book Club selection then picking it up where I had left off. That doesn't sound like much of a recommendation but a sizzling plot isn't everything. These books have good stories, but the thing that stands out to me is that they are just darn pleasurable reading. If the book never ended I'd go on reading it forever because it's so enjoyable, like sitting in your favourite chair or wearing comfortable old shoes.The story here is a fictional account of Joey Smallwood's life. For those too young to remember, he was the Newfoundlander who successfully pushed for Newfoundland to join Canadian Confederation in 1949 and who then became it's first Premier. I don't really understand how fiction and the lives of real people mix in a book. I'm unsure what parts we are supposed to believe and what to call fiction. I don't even understand how it's legal to make up stories about actual people. Does calling it fiction allow a writer to say whatever he wants? I don't know. I just know I liked it.In this account, Smallwood's story is not at all what you'd expect in the life of a prominent politician. His family, education, personal life and career are colourful and make for a unique and sometimes strange tale. He is socially inept and a complete dud when it comes to personal relationships, but politically, he's driven by an unstoppable will. When he wants something, he'll do whatever it takes to get it and he won't allow anything or anyone to keep him from it.For me the main character in this story is Newfoundland itself, and from the title I think that's what the authour intended. I grew up with Newfoundland being a province of Canada and am slightly embarrassed to say I never gave a thought to what it was before that. Reading about pre-confederation Newfoundland was nothing short of fascinating to me; I couldn't get enough of it. By the end of the book I was convinced that joining Confederation was a bad idea for Newfoundland - and I'm Canadian!You'll fall in love with the harsh, beautiful land, the wild, unpredictable weather and the people, from the quirky, competitive city-dwellers to the stalwart souls living in the outports, who live only on what they can provide for themselves surrounded by ice, water and rock. I don't think I've ever read of harsher living or hardier people. The authour creates for us some refreshingly honest word-pictures of life on this unique island. He talks about their \"...perverse pride in our ability to do anything, even fail, on so grand a scale. Whether our distinguishing national trait was resourcefulness or laziness, ineptitude or competence, honesty or corruptibility, did not seem to matter as long as we were famous for it, as long as we were acknowledged as being unmatched in the world for something.\" and about standing on a boat offshore \"...regarding the somehow oppressively spectacular scenery, the houses in their drearily bright and cheerful, state-of-the-universe-denying colours.\" If ever you should see the bright rainbow colours of coastal village houses, you will know exactly what he means by \"state-of-the-universe-denying colours\" (one of the best descriptions I've ever heard). They signal such optimism, such cheer in what seems like pretty cheerless living conditions. He writes another passage that gives us some idea of the isolation of residents in the more remote locations: \"What I had not realized was how cut off from the world in both space and time these people were. Most of them did not understand or even have a word for the concept of government.\" They \"had only the most rudimentary understanding of what a country was. And at the same time were destitute beyond anything I imagined when I first set out.\"I could go on forever but I'll spare you. Just read the book and let Newfoundland seep into your imagination, then I wish you the best of luck trying to resist the temptation to go and see with your own eyes what Wayne Johnston has described so perfectly."}, {"userName": "Paula Dembeck", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/15166873-paula-dembeck", "userReview": "There are two main plot lines in this grand historical fiction: one is the wacky lifelong relationship between two friends - Joey Smallwood and Sheilagh Fielding; the second is the story of Newfoundland's slow and awkward march towards Confederation with Canada after years of mistreatment by the British. Newfoundland is a cold, barren and challenging land with few resources, populated by a warm and friendly people who despite the odds did their best over the years to eek out a living from its poor resources. For the most part, they depended on the fishery for their livelihood, although they never had enough cash themselves to buy the boats and nets to carry out their work. They were forced to depend on others to loan them their basic work tools and thus were always in debt.Smallwood, a man with an alcoholic father and twelve brothers and sisters who lived in poverty most of his life was determined to do something big, something that would match the greatness of the landscape. It did not matter what it was he did, he just wanted to do something for which he would be remembered. He hated the \"quality\", the rich and the educated, who treated the rest of the population with derision. Yet it seems when he accomplished his dream, travelling from his humble beginnings to eventually becoming Newfoundland's Premier, he also became one of them.The center of the novel is the Smallwood/Fielding relationship. The two meet at a private school and from there their lives constantly meet, bump together and affect each other over a lifetime.The descriptions of the landscape in this novel are plentiful and detailed, so much so as to render them almost additional characters.Historical fiction is a genre that manipulates and animates historical fact, so although the Smallwood figure did exist in true life, the Fielding character did not, and it would be interesting to speculate if there ever was a \"long lost love\" somewhere in Smallwood's past and what other parts of this tale are true.This is a good read, over 500 pages, but it moves quickly, especially the first half of the book. It is a story of many things: the road to confederation, the story of people who can constantly reinvent themselves over time, and the story of a tense and wacky relationship."}, {"userName": "Loraine", "userReviewDate": "May 29, 2015", "userURL": "http://www.goodreads.com/user/show/4754879-loraine", "userReview": "It would be wrong for me to rate this novel. It is wonderfully written and the story is deeply engaging. I am sure that if I could finish it, it would be a 4 star read. But as a historical novel, it leaves me always asking the question \"is this true?\" or \"Did that really happen?\" and I just can't get past it. I am sure that what looks like fact most probably is, but the fictional character of Fielding is such a presence that I am able to appreciate neither the facts nor the fiction. I've read 325 pages so I know how good it is. If it was history or fiction, it would be my perfect read. But as historical fiction, well, sorry....it's not for me.There are some wonderful passages about Newfoundland and its people. For those alone this book is worth it. I knew of grown men who hurried home from trouting or berry-picking in a panic as the sun was going down, for fear of being caught out after dark and led astray by fairies. My mother had often told me stories of people from Gambo who, fairy-led, were found weeks later at the end of a trail of clothing that in their trance, they had discarded. They had been led in a dance by fairies until they flopped down dead from sheer exhaustion, my mother believed, and no appeal to common sense or any amount of scorn could change her mind. Yet these same fairy-feeble men would go out on the sea at night in the worst weather to rescue a neighbor whose boat was going down. Here was all this land and they had not claimed an inch of it as theirs, preferring instead to daily risk their lives, hauling fish up from a sea that never would be theirs...I would not discourage anyone from reading this fine book. I will read other books by Wayne Johnson, and hopefully a different book about Joey Smallwood."}, {"userName": "Jennifer", "userReviewDate": "Nov 29, 2013", "userURL": "http://www.goodreads.com/user/show/2635637-jennifer", "userReview": "i finished this novel a few days ago but, so far, i haven't been able to consolidate my thoughts vey well. so this 'review' may be a bit of a mess - sorry!johnston is a great writer - his prose is lovely, funny and smart, and his eye seems to come at things from a slightly off-centre slant. i loved (LOVED!) the character of fielding. so much so, at moments i kept wishing this novel was all about her. johnston did a great job weaving the history into his story. i very much appreciated the feel for newfoundland presented through his writing.where things fell apart for me a wee bit - and why i have't been able to come up with anything helpful to say for a few days - was at the end. it felt like the story was very backloaded and rushed, and the mystery of the letter writer was not very satisfying and ended up feeling unnecessarily drawn out. so for now i have landed on 4-stars. for the most part, i was completely swept up by this book, and i wouldn't hesitate in recommending it to certain readers. i think i will get out my copy of The Custodian of Paradise, since my beloved sheilagh fielding takes centre stage!! thank you, wayne johnston!"}, {"userName": "Diane", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/7172184-diane", "userReview": "This is a fictionalized biography of famed Newfoundland politician Joey Smallwood's early days from childhood up to his early days as Premier of Newfoundland after his campaign to bring it into Canada in 1949. There are two main characters, Smallwood and Shelagh Fielding, a girl he met in the schoolyard and with whom he had a running on again off again friendship. Although they never had a romantic relationship, he did love her after a fashion and she probably loved him. It's portrayed as a long standing friendship where they were often at odds and on opposite political sides but yet connected on a deeper level. Shelagh Fielding was not based on a real person but her story running through the book via her words, her newspaper columns and her journal make this book a lot more interesting. I felt like she was kind of his conscience, where she was usually right and he was intent on proving her wrong. I leaerned a lot about the early 20th century Newfoundland and it's rocky road to being Canada's 10th province and even if much of Smallwood's life has been fictionalized here, I think the basic facts are true and I didn't know much about him before now."}, {"userName": "Carol Waters", "userReviewDate": "Nov 10, 2012", "userURL": "http://www.goodreads.com/user/show/10387600-carol-waters", "userReview": "I've never been to Newfoundland, couldn't find it on a map. I'm half-way through this huge book and have no desire whatsoever to go there. I have no clue how this tome ended up in my bookcase. It must weigh six pounds. It took up a lot of space so I decided to read it to clear the shelf.Fabulous, fabulous. I want to be Fielding. I want to buy boots for Joe. I want to vote two or three times in some local election. The bitterness of their lives is buried under hope, love, loyalty, confusion, dedication, misunderstanding, as is the joy. The author has served up a fabulous story that I didn't think would be the least intersting. It's up there with Annie P., perhaps better. We'll see in the next 250 pages what happens. I took a star off as the book trudged to a finish. It was more like wikipedia than the clash of misunderstood personalities and verbal fireworks. OK, I did go to wikipedia for a while. Joe did have a pig farm. I'd still recommend it for anyone who wants to learn about Newfoundland (not likely) or likes history to be reflective of personality and not dates and data."}], "description": "A mystery and a love story spanning five decades, The Colony of Unrequited Dreams is an epic portrait of passion and ambition, set against the beautiful, brutal landscape of Newfoundland. In this widely acclaimed novel, Johnston has created two of the most memorable characters in recent fiction: Joey Smallwood, who claws his way up from poverty to become New Foundland's first premier; and Sheilagh Fielding, who renounces her father's wealth to become a popular columnist and writer, a gifted satirist who casts a haunting shadow on Smallwood's life and career.The two meet as children at school and grow to realize that their lives are irreversibly intertwined, bound together by a secret they don't know they share. Smallwood, always on the make, torn between love of country and fear of failure, is as reluctant to trust the private truths of his heart as his rival and savior, Fielding—brilliant, hard-drinking, and unconventionally sexy. Their story ranges from small-town Newfoundland to New York City, from the harrowing ice floes of the seal hunt to the lavish drawing rooms of colonial governors, and combines erudition, comedy, and unflagging narrative brio in a manner reminiscent of John Irving and Charles Dickens. A tragicomic elegy for the \"colony of unrequited dreams\" that is Newfoundland, Wayne Johnston's masterful tribute to a people and a place establishes him as a novelist who is as profound as he is funny, with an impeccable sense of the intersection where private lives and history collide.", "title": "The Colony of Unrequited Dreams\n      \n          (Newfoundland Trilogy #1)", "url": "https://www.goodreads.com/book/show/95230.The_Colony_of_Unrequited_Dreams", "average": 3.93, "cover": "https://images.gr-assets.com/books/1320470124l/95230.jpg", "reviews": 322, "authors": [{"url": "https://www.goodreads.com/author/show/54816.Wayne_Johnston", "name": "Wayne Johnston"}], "type": ["Fiction", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/95230.The_Colony_of_Unrequited_Dreams", "http://www.goodreads.com/book/show/18966421-the-colony-of-unrequited-dreams", "http://www.goodreads.com/book/show/243109.The_Colony_of_Unrequited_Dreams", "http://www.goodreads.com/book/show/13533054-the-colony-of-unrequited-dreams", "http://www.goodreads.com/book/show/1202954.The_Colony_of_Unrequited_Dreams", "http://www.goodreads.com/book/show/870385.The_Navigator_of_New_York", "http://www.goodreads.com/book/show/296742.The_Custodian_of_Paradise", "http://www.goodreads.com/book/show/11691235-a-world-elsewhere", "http://www.goodreads.com/book/show/17262157-the-son-of-a-certain-woman", "http://www.goodreads.com/book/show/296743.The_Divine_Ryans", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}