{"ratings": 4951, "userreviews": [{"userName": "Michael", "userReviewDate": "Aug 14, 2016", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "This second in Foote’s trilogy of the war is a vast doorway into the stories of a myriad of people managing and perpetrating the American Civil War for most of the year 1863. Starting with Robert E. Lee’s Confederate successes in Virginia against Ambrose Burnside in Fredericksburg (Dec. 1862) and against Joe Hooker at Chancellorville in the Spring, the year proceeds toward a major turning of tables with Meade’s victory over Lee at Gettysburg in Pennsylvania and U.S. Grant’s final taking of Vicksburg on the Mississippi after seven failed attempts, both in July. Then in the Fall, much fighting in and around Tennessee leads to a Confederate comeback at Chickamauga in northern Georgia, where Braxton Bragg defeated William Rosecrans. But Lincoln’s placement of Grant at the head of all western forces puts an end to their momentum, as the Union is finally able to drive Bragg’s forces from the ridge where they had long besieged Chattanooga on the Tennessee River.As a master of narrative history he harnesses his novelist skills to paint the stories behind these and other campaigns like little stage-plays full of atmosphere and realistic detail, especially in the area of the personalities and motivations of the actors. These actors are mostly the generals and admirals, but also the commanders and ship captains, and, behind the scenes, the cabinets and presidents of North and South, Lincoln and Davis. Foote’s facility at fleshing out the action owes a lot to his ability to marshal an array of quotes and examples from journalism, memoirs, letters, and official records without disrupting his narrative flow. If you had a chance to hear his delivery by a warm and genteel Southern speech on Ken Burn’s “Civil War”, you will know what I mean. The kind of “voice” present in his writing made my choice to experience the book on audio work well (though I had to resort to Wiki maps of certain battles). No lifting of the doorstopper hardback or swiping pages forever in an e-book version, but instead I experienced a couple weeks of submersive listening on my commuting trips along the shores of my rural Maine location. Each day another battle and geography (now Virginia, later Mississippi) or a succession of political or planning crises in the Union and Confederate governments. I didn’t want the narrative to end, and in a sense it won’t until I imbibe the third volume. Why read such an involved book? Somehow the details matter to me. To delve into the details is to encounter brilliant feats of accomplishment and courage on the same stage with acts of brutality, incompetence, and human weakness. I do appreciate the attitude behind “I ain’t going to study war no more”. And it is shameful that America had to resort to such a horrible slaughter, including up 700 thousand plus direct deaths alone and a multiple of that for direct and indirect casualties from injury, infection, and disease. An understanding of why and how people fought the war makes me realize it wasn’t a senseless effort by the participants. Compared to the North’s goal of preserving the Union, the Confederates had more motivation to fight, initially harking to the attitude of the Founding Fathers over their right to independence from the Brits. Later, once invaded, it was easy for them to see the war as part of the struggle for existence. State rights and property issues surrounding slavery were not the primary drive behind taking up arms, although the dirty truth that it all was about slavery is hard for me to relinquish. In that vein I was surprised to learn how many sectors in the North were in favor of either saying goodbye and good riddance to the Rebel states or negotiating a return of South to the fold with retention of slavery (favored by the “Copperhead” Democrats). On the other shoe, even Jefferson Davis believed that slavery was doomed in the long run, but when one general formulated a written proposal of emancipating the slaves and enlisting in Confederate army the goal of maintaining unity of purpose led him to suppress the idea so completely its existence wasn’t unearthed for 30 years.I love the sense in this history of how military successes and failures depended on the personality and character of the commanders. For every brilliant top general like Grant and Lee there were duds like Rosecrans and Bragg. The cavalry stars are a particularly colorful lot, with Confederates like Stonewall Jackson, Nathan Bedford Forrest, Earl Van Dorn, and J.E.B. Stuart particularly fun to behold wreaking havoc on the supplies and railroads behind the Union lines or making a surprising strike in a battle where they were least expected. Because of the proximity to my Oklahoma origins and a role of one of my ancestors, I especially appreciated reading in this history about the marauding raid of General Jo Shelby from Arkansas through Missouri that involved leading 600 men over 1500 miles in 41 days destroying railroads and bridges, capturing horses, wagon trains, and men, all the while picking up 800 recruits along the way. He made his escape by punching through Union forces five times his number and ended up with 150 casualties compared to the 600 inflicted on the Federals. (I am not so enamored with how he later refused to surrender at the end of the war and ended up taking his Texans to Mexico where he established a Confederacy in exile and foolishly served as a mercenary with Napolean’s colonialist government against Juarez.)I also have a particular fascination with the role of Ironclad ships in the conflicts along the rivers and assaults on ports like Charleston. War begets such creative innovation in terrible technologies. Despite the role of technology, so many battles turned on old fashioned human elements of deception, subterfuge, and surprise. I also appreciated how ordinary people, like the Maine college professor Joshua Chamberlain, transformed themselves to do the impossible, in his case shape a militia into an effective fighting force which could pull off an important bayonet charge up Little Round Top at Gettysburg. The section on Gettysburg was so good, Foote made it a separate book well worth reading on its own:Stars in Their Courses: The Gettysburg Campaign, June-July 1863 .Foote doesn’t spend a lot of time assessing the economics behind the war or delving closely into slavery as an institution. He has been accused of furthering the mythos known as the “Lost Cause”, a view of history used to ennoble and justify the Southern stance in the war by minimizing the impact of slavery and cast its heroes as saints. I don’t see it that way. He obviously sees Forrest, Jackson, and Lee as geniuses in strategy and respects their integrity, but it comes through how much he admires Grant and Lincoln. Foote’s apt way of rendering a picture of leading figures is worthy of some extended examples. Here he speaks of the limits of Lincoln’s resiliency following a section about how he could handle continual attacks in the press or Congress for being a “clod or tyrant, clown or monster”:It sometimes seemed to him … that each recovery from gloom was made at the cost of future resiliency. “Nothing touches the tired spot” he had confessed the year before, and lately he had come back to this expression. Returning from a horseback ride that seemed to lift his spirits, he was urged by a companion to find more time for rest and relaxation. “Rest?” he said. He shook his head, as if the word was unfamiliar. “I don’t know …I suppose it is good for the body. But the tired part is inside, out of reach.”It helps a lot the way he can invest a figure with descriptions that help you hold them in your mind, as here on William Tecumseh Sherman:Sherman did not wait until morning. Impatient as always, he rode straight over, a tall red-haired man with a fidgety manner, concave temples, glittering hazel eyes, and a scraggly, close-cropped beard. “I never saw him but I thought of Lazarus,” one observer was to write. A chain smoker who, according to another witness, got through each cigar “as if it was a duty to be finished in the shortest possible time” …On Grant, Foote tried hard to capture how his no-nonsense ways free of “superfluous flummery” inspired a kind of “familiar reverence” in his men despite his appearance of a “burly beef contractor” and impression if “a man who could be silent in several languages”:..a slight man, rather stooped, five foot eight inches in height and weighing less than one hundred and forty pounds, who walked with a peculiar gait, shoulders hunched “a little forward of perpendicular”, as one observer remarked, so that each step seemed to arrest him momentarily in the act of pitching on his face. Forty years old, he looked considerably older, partly because of the crow’s-feet crinkling the outer corners of his eyes—the result of intense concentration, according to some, while others identified them as whiskey lines, plainly confirming rumors of overindulgence and refuting protestations of friends that he never touched the stuff…One of his staff officers got the impression that he was “half a dozen men condensed into one,” while a journalist, finding him puzzling in the extreme because he seemed to amount to a good deal more than the sum of all his parts, came up with the word “unpronounceable” as the one that described him best.This thumbnail sketch of General Phillip Sheridan at Murfeesboro tickled me:As pugnacious here as he had been at Perryville, where he first attracted general attention, the bandy-legged, bullet-headed Ohioan was determined to yield no ground except under direct pressure, and only then when that pressure buckled his knees.Foote’s portrayal of the poor performance of William Rosecrans, who commanded the Army of Cumberland in its disastrous defeat at Chickamauga, finds voice in Lincoln’s comment to his secretary that ever since then he had been acting “confused and stunned, like a duck hit on the head.” A report on the general from a journalist serving as the administration’s secret observer in the field had me laughing out loud:I have never seen a public man possessing talent with less administrative power, less clearness and steadiness in difficulty, and greater practical incapacity than General Rosecrans. He has inventive fertility and knowledge, but he has no strength of will and no concentration of purpose. …His imbecility appears to be contagious.By the time you finish this book, you will certainly have a better appreciation of one of America’s greatest failures as a nation, the sacrifices that were made to solidify its paradoxical strength as a union of independent states, and the lingering balance of pride and shame that still persists in the South, where you still see hear the war referred to as the ‘War of Northern Aggression’ and widespread display of the Confederate flag."}, {"userName": "Lizzy", "userReviewDate": "Dec 06, 2016", "userURL": "http://www.goodreads.com/user/show/30575403-lizzy", "userReview": "I took me three months to read the almost one thousand pages of The Civil War, Vol. 2: Fredericksburg to Meridian, the second volume in Shelby Foote’s trilogy. It was a great read considering all the battles minutely analyzed, and the many actors depicted and portrayed. Foote's marvelous narrative made this reading a real enjoyment. As in the first book, here Foote once again presents a detailed analyses of the political climate both in the North and the South, discusses the difficulties and challenges of Lincoln and Davies and how both leaders were able to deal with their respective roles as Commander-in-Chief.The first volume ended after the bloodbath of Antietam in the fall of 1862. This one takes up with events following the removal of the American commander, George McClellan, and his replacement by General Burnside in time to start off with the December 1862’s Fredricksburg and ending in the spring of 1864, with Grant taking command of the entire Union Army.The beginning for me might have been slow, but from the moment Foote starts to discuss two of the most decisive Union victories, Gettysburg and Vicksburg, I could not stop reading. I went straight to the end practically without stopping and merely breathing. That’s should be enough to tell you how much it enthralled me. The other major battle discussed was Chickamauga, a Southern victory which ruined the careers of two generals, Rosecrans and Bragg, and ended with Grant victorious at Chattanooga. Foote continues to use his great narrative style to full effect here. Early on when we read about Lincoln search for a commander for the Army of the Potomac:\nScott and McDowell, Pope and McClellan, and now Burnside: none of these was the killer he was seeking. Already he saw that this search was perhaps the major problem. All else – while, like Blondin, Lincoln threaded his way, burdened by untold treasures – was, in a sense, a biding of time until the unknown killer could be found. Somewhere he existed, and somewhere he would find him, this unidentified general who could face the grim arithmetic being scrawled in blood across these critical, tragic pages of the nation’s history.\nIt is a masterful book, with the concomitant analyses of developments occurring simultaneously in different theaters, both East and West. For the reader, it means not only a better organized telling, but also a more real understanding of what it was like for actual actors – military, politicians and civilians – to live through this nightmare.Thus, the reader will be reading about Grant's trials and tribulations in finding a way to attack the formidable Confederate defenses position of Vicksburg, Mississippi; while reading concomitantly about the contemporary conflicts between the Federal Army of the Potomac and Rebel Army of Northern Virginia as they fought at Chancellorsville and Gettysburg in May and July of the same year.For the first time, the Union started to produce the victories that start to point out to a possible end of the war. The taking of Vicksburg was a great victory for Grant, while at Gettysburg, Lee was defeated by the newly appointed General Meade, after Lincoln had already gone through over a handful of generals. But the outcome of Gettysburg was basically the result of Lee’s mistake of attacking entrenched Union forces. Lee had gambled the chance of winning the day and the war in one sweep; the southern generals’ realization that the South could not hope to actually win the war unless he gained a major battle against the North seemed to have forced his hand. \nThe true total of Lee's losses in Pennsylvania could hardly have been less than 25,000 and quite possibly was far heavier; 28,063 was the figure computed by one meticulous student of such grisly matters, in which case the butcher's bill for Gettysburg, blue and gray together, exceeded 50,000 men. This was more than Shiloh and Sharpsburg combined, with Ball's Bluff and Belmont thrown in for good measure.\nWith Lee defeated, however, Meade failed to follow Lee's army in retreat and destroy it. Once more, a commander of the Army of the Potomac showed an acute lack of aggressiveness that until then proved to be one of the Union’s major shortcomings.Later we read about the fighting in the West, with the Federal capture of Chattanooga followed by the battles of Chickamauga Creek and Missionary Ridge in Tennessee and Northern Georgia. This is just a sample of how much Foote is able to handle at any given time. With the first loss by the Union, where Bragg defeated Rosecrans, Lincoln places Grant as the commander of the Union’s Western Army. Thus, the South’s momentum is broken. Grant once again showed the aggressiveness that was lacking in the East, by attacking Bragg’s position in the ridge and liberating the besieged Chattanooga. Foote ends this installment with Lincoln's decision to bring Grant to the East to command all the Union forces as the General-In-Chief. Lincoln, after going through with seven generals that proved not aggressive enough, had finally found his killer, the man to win the war. \nYonder began the campaign, Sherman was to say a quarter century later, standing before the hotel on the occasion of a visit to the Ohio city. \"He was to go for Lee and I was to go for Joe Johnston. That was his plan.\"\nHighly recommended!"}, {"userName": "booklady", "userReviewDate": "Apr 08, 2013", "userURL": "http://www.goodreads.com/user/show/350218-booklady", "userReview": "As we finished the second volume in this trilogy on the Civil War I wondered who/what I am most amazed by: the War in all its many complexities which tore our nation apart, the man who wrote this book over 50 years ago when he was still in his 40s, or the incredible people (north and south) who fought, struggled, suffered and died for so many different reasons. The author, Shelby Foote, who died in 2005, believed that this war was central to us as Americans. As my husband and I listened to this book we could see so many issues (states’ rights v. federal control; presidential power during national emergencies; honest v. corrupt media; suspension of habeas corpus to name just a few) which are as relevant today as they were then.There are those who claim Mr. Foote—as a southerner—wrote his narrative with a southern bias. That might be, I’m not enough of a historian to comment on the accuracy of his book. However, if that was his objective, after having listened to the first two volumes twice now and the third once, he has not managed to convince me of ‘the southern cause’. Rather I still see the war from a perspective of an American who deeply loves all of her country: black, white, north, south, male, female, etc., which is how it seems (to me) the author has presented the story, from the perspective of whoever he was writing about at the time and/or the on-scene observer. His objectivity in telling this story is only compromised by his humanity and empathy. I can forgive him that.There are so many things about this book which I like: it’s narrative flow, detailed descriptions of the times and people, humorous anecdotes, comparisons between north and south, Lincoln and Davis, Grant and Lee, etc. Foote is not afraid to point out character flaws (such as Generals Bragg and McClellan) or where commonly-held opinions (Grant being an alcoholic) are not substantiated by the available evidence. Excellent! Can’t wait to start the third volume ... although I know it will be hard to get through because of all the tragedies."}, {"userName": "Jamie", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/51089-jamie", "userReview": "When I started Vol. 1, I said I wanted books that took up years of my life. The first one didn’t quite— it took less than three months— but now the second one has filled that bill. And I couldn’t ask for a better one to take up that time."}, {"userName": "Jim", "userReviewDate": "Jul 26, 2013", "userURL": "http://www.goodreads.com/user/show/1895570-jim", "userReview": "Ever since I first came across the works of Bruce Catton in my teens, I have been an aficionado of the American Civil War. So much concentrated slaughter among peoples who resembled one another so much! Also, so many lessons to be learned about the arts of leadership, and what happens when they are lacking -- as in all but the last general in charge of the Army of the Potomac!This is the second volume of three of historian Shelby Foote's The Civil War: A Narrative. Nestled away in the \"Bibliographical Note\" section at the end is this revealing quote:As for method, it may explain much for me to state that my favorite historian is Tacitus, who dealt mainly with high-placed scoundrels, but that the finest compliment I ever heard paid a historian was rendered by Thomas Hobbes in the forward to his translation of The Peloponnesian War, in which he referred to Thucydides as \"one who, though he never digress to read a Lecture, Moral or Political, upon his own Text, nor enter into men's hearts, further than the Actions themselves evidently guide him...filleth his Narrations with that choice of matter, and ordereth them with that Judgement, and with such perspicuity and efficacy expresseth himself that (as Plutarch saith) he maketh his Auditor a Spectator. For he setteth his Reader in the Assemblies of the People, and in their Senates, at their debating; in the Streets, at their Seditions; and in the Field, at their Battels.\" There indeed is something worth aiming at, however far short of attainment we fall.I don't think Foote falls far short at all. In Periclean Athens, there was not much first-hand information upon which the historian could rely, whereas the Civil War is one of the most written-about episodes in all of world history. In addition to making his information vivid, Foote has to wade through terabytes of minutiae to find interesting episodes. One example: Nathan Bedford Forrest, encountering one of his men in headlong retreat, stopping him in his tracks, pulling down his trousers, and administering a savage spanking with a brush to motivate him to reconsider, which he did.The period covered by the volume is calendar year 1863, in which two of the most decisive Union victories took place: Gettysburg and Vicksburg -- right around the 4th of July. The other major battle discussed was Chickamauga, a Southern victory which ruined the careers of both generals, Rosecrans and Bragg, and which could have gone either way if a third of the Union line had not panicked and run. There is also a brief look-ahead to the spring of 1864, when U.S. Grant was named a Lieutenant General and appointed to the Army of the Potomac.This 966-page book seems sorter than its weight would imply. That is due to Foote. In fact, this volume is so good that two extracts have been separately published as books: The Stars in Their Courses about Gettysburg and The Beleaguered City about Vicksburg, both of which are excellent reads in their own right."}, {"userName": "Richard", "userReviewDate": "Feb 01, 2010", "userURL": "http://www.goodreads.com/user/show/1751300-richard", "userReview": "Shelby Foote continues to use his great narrative style to full effect in this, his second in the series of Civil War histories. This volume mostly covers the events of 1863, although the books in this series are not designed to start and stop according to precisely equivalent calendar time frames. Volume I ended after the bloodbath of Antietam (Sharpsburg) in the fall of 1862. Volume II takes up with events following the removal of the American commander, George McClellan, and replacement by General Burnside in time to start off with the December 1862 charnel house of Fredricksburg and continues with all of the major, and minor, conflicts of 1863, ending in the spring of 1864, when General Ulysses Grant had taken over command of all of the Union's Armies. Foote does probably the best job any historian accomplishes in the way of describing the developments occurring simultaneously in different theaters. Thus, he will describe Grant's trials and tribulations in finding a way to attack the formidable Confederate defenses preventing the full navigation of the Mississippi River, at Vicksburg, Mississippi (while Grant was commander of the Federal Army of Tennessee) and segue into the contemporary conflicts between the Federal Army of the Potomac and Rebel Army of Northern Virginia as they fought at Chancellorsville and Gettysburg in May and July of the same year. Both during and after these events, there were naval, army, and combined actions along the southern coastline, including the Federal attempts to capture Charleston; the Federal attempts to invade and occupy at least a section of Texas, in order to block any attempt by Mexico's (French) Maximillian from forming an alliance with the Confederacy; and the Federal capture of Chattanooga followed by the battles of Chickamauga Creek and Missionary Ridge in Tennessee and Northern Georgia. This is just a sample of what Foote is able to juggle at any given time. The service he does to the reader is to give an organized, highly digestible account of dozens of instances of what would have been, contemporaneously, continuing news, good and disastrous, to the civilians and government officials on both sides as they tried to live through this national nightmare.There have been newer accounts of these events over the decades since the publication of this book, but I doubt anyone would have given a more enjoyable description than Foote, in his unique narrative style. It's not that any historical details have been missed, or controversies avoided. The Vicksburg and Gettysburg sections of the book, in particular, are described in major, incisive detail.One point of contention which will perhaps always be debated is the effect of U.S. Grant's drinking on his behavior. Bruce Catton had earlier done a masterful job of exorcising the ghost of alcoholism on Grant's behavior during the Civil War, but Foote is not as charitable. One difference between the two derives from an eyewitness account from a newspaperman named Cadwallader who traveled with him on a two-day trip up the Yazoo and claimed to have seen the General repeating his pre-war drunken behavior. Trouble was, this account didn't get reported until Cadwallader wrote his memoirs thirty years later. Nevertheless, Foote places credence in this report.A continuing source of enjoyment is Foote's usage of the nicknames of the opposing Generals instead of constantly using \"General this\" and \"General that.\" Thus, we become familiar with \"Old Rosy\" (William Rosencrans); \"Old Jack\", or, as history now records, \"Stonewall\" (Thomas Johathan Jackson]; \"Fighting Joe\" Hooker; Earl \"Buck\" Van Dorn; \"Old Brains\" (Henry W. Halleck); \"Little Powell\" (A.P. Hill); William F. \"Baldy\" Smith, and so on.Using a lighthearted technique like this is welcome in a story that was becoming increasingly grim, not just because of the mounting death count, important as that was, but because the mood of both countries, North and South, was worsening. Foote keeps us aware that there were two Presidents, living in two White Houses, who were growing increasingly despondent and anxious daily. Both were hands-on managers of their armed forces. Each had to face growing public discontent and severe criticism from their political enemies while personally bearing the heavy burden of constant military reverses many times caused by generals who used bad judgement or lost their competitive edge when confronted with the stress of battle. Thus Lincoln grew increasingly anxious while needing to relieve, in this volume alone, Burnside, Hooker and Meade from the main Union army, and Rosencrans from command of the Army of the Cumberland; while Jeff Davis, luckily holding his trump card in the brilliant Robert E. Lee, had to suffer through Lee's Pennsylvania invasion debacle while wincing at the subpar performance of such important generals as Pemberton, Johnston and Bragg.Foote masterfully uses irony at times to describe the war's often hideous results. He relates the Federal attempt to storm Battery Wagner on Morris Island in Charlston Harbor. This is the battle when the Federal forces were led into the fight by the all-Black Massachusetts regiment portrayed in the wonderful film \"Glory.\" The regiment, as Foote tells the story, was led by officers who were white \"Boston bluebloods\". In an hour, it was nearly wiped out, with the attackers taking over fifteen hundred casualties, including the Massachusetts regiment's commander, Robert Gould Shaw. Nothing was gained from this costly attack. As Foote reports, Shaw's mother had earlier cried for the good fortune that God had bestowed on her, as she pridefully witnessed her boy leading the regiment off to war at its grand farewell review in Boston. Within seven weeks, as Foote states, \"it developed that God had not been so good to her after all, unless what she wanted in place of her son was a fine bronze statue on the Common.\" (p. 697).The Northern forces were not the only ones to feel the sting of Foote's irony. He tells of the two quarreling Confederate calvary brigadiers who, believe it or not, engaged in a personal duel while fighting off the enemy in Arkansas in September. This was not a verbal duel; it was \"pistols at ten paces to fire ..\" As Foote relates the death of General Walker to the gun of General Marmaduke, following this archaic code satisfied the conditions of honor \"..which, presumably, was one of those things the South was fighting to preserve as part of its 'way of life' - presently, after a period of intense suffering by the loser, the Confederacy had one general less than it had had when the two men took position, ten paces apart ...\" (pp. 706-707).The reader is made aware, as the book unfolds, of a trend toward a hardening on both sides to the suffering of opposing soldiers and civilians. The swapping of each others' prisoners, and releases of captured forces on \"parole\" (the release of groups of prisoners with the promise that they would return home and not participate in war again until the passage of a specified time) were giving way to the placing of war prisoners into crowded prisoner-of-war camps; the well-publicised refusal of General Grant to accept surrender terms and to demand \"unconditional surrender\" at Fort Donelson in 1862, and at Vicksburg in 1863, put an end to the formerly chivalrous sword-surrendering niceties between opposing commanding officers at the end of battles; the initial burst of patriotic fervor for the war had long since dissolved, leaving both sides with the necessity of running a military draft to replenish the losses due to battle casualties and the expiration of enlistments, with riots occurring in certain Northern cities; rioting was especially ugly in New York City.A practice developed by Grant and his chief lieutenant, General William T. Sherman, would significantly add to this gloomy picture. Grant had rediscovered the technique of Cortez and Winfield Scott in their prior conquests of Mexico. This consisted of living off the land of the enemies' citizenry instead of relying on endless delays caused by the need to build transportation networks to supply the invading force. He showed Sherman how effective this worked while they conducted their campaign in Mississippi in the spring of 1863. Later in the year, Sherman demonstrated his mastery of the methods designed to keep an invading army moving. He led an invasion force from Vicksburg, across Mississippi, with the intention of invading Selma, Alabama. Problems prevented him from reaching his final objective, causing him to turn back at Meridian, Mississippi. During the course of the campaign, however, his army destroyed Meridian (and also burned out Jackson, Mississippi, for the third time that year). His army returned to Vicksburg by a different route in order to keep the army from foraging where they already laid waste to the country. Sherman, quoting \"vigorous war ... means universal destruction\" (p. 937), destroyed railroads for miles in every direction, burning out and spoiling all farms and industrial infrastructure they passed. The civilian victims in this state were said to be left with the stunned look of disaster survivors, while Sherman boasted of having created a fifty-mile-wide belt of destruction across Mississippi. Grant and Sherman were at this time (February-March, 1864) planning on invading Georgia, using these techniques.The stage was therefore set for the destruction which would be unleashed on the South in 1864-65. The Union army was ready to march. Politically, the leaders on both sides were committed to fighting to the end. Any possibility that existed previously for a truce or for foreign powers, namely Britain and France, to force an arbitrated peace, were long gone. Too many lives had been lost by this time to stop the war short of total victory. Those who Foote calls the Jacobins in the North would have Lincoln's head if he showed restraint now, and they were already agitating for imposition of harsh rule for the eleven rebellious states when the war ended. Their plan was for the Southern states to be placed under military governors answerable directly to the President. Lincoln, in order to dispel some of their influence while he used his dwindling energies to run the war, issued a tentative Reconstruction Proclamation as part of his year-end message to Congress. He proposed to offer amnesty to Southerners who would, after the war, take an oath of loyalty to the federal government and support the Emancipation Proclamation. Each rebellious state would be admitted back into the Union when one-tenth of the state's 1860 voters had taken the oath.Not only did news of this Proclamation not soften hearts in the rebellious states, but it led to a firestorm of condemnation. Lincoln's Southern critics had reminded their citizenry that this President had earlier fired General Fremont, commander of the occupying Union forces in Missouri, for declaring that state's slaves emancipated without consultation with his superiors or with the White House, where Lincoln was holding off on issuing his Emancipation Proclamation at the time. Worse yet, Lincoln had described Fremont's methods of military proclamation to be tantamount to setting up a military dictatorship in the conquered state, exactly what he was accused of proposing in December, 1863 (actually, he was offering amnesty to the conquered peoples and proposing certain reconstruction guidelines designed to restore the Union). Lincoln's Southern newspaper detractors took instant, violent offense to the notion that they should ask forgiveness for anything. The Confederate forces would continue to be urged to fight to their last drop of blood."}, {"userName": "Pamela Okano", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/1864839-pamela-okano", "userReview": "Volume 2 takes us up to the point where Grant is made lieutenant general in charge of the entire Army. By this time, the North's superior resources are beginning to take their toll on the South.As with volume 1, volume 2 is primarily concerned with troop movement and battles. One criticism I have of both volumes 1 and 2 is the lack of dates. There are PLENTY of dates during the description of the multi day battle at Gettysburg, but dates again disappear thereafter. Interestingly enough, the section on Gettysburg mentions Joshua Chamberlain just once, as an aside. One thing that becomes crystal clear after reading volumes 1 and 2 is that both sides had their problems with generals, so it wasn't just McClellan, as more cursory histories might lead one to believe. Volume 2 also deals with the stories of Grant's drinking. Although he briefly alludes to the point of view that Grant did not have such a problem, the author comes down on the side of those who believe he did, but only when he was bored and his wife was not there. In what may be thought of as prescience with respect to Grant's presidency, Sherman believed that his friend Grant, due to his naivete, would not be able to avoid being suckered by the cons of Washington DC."}, {"userName": "Jay", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/1356377-jay", "userReview": "Like the 1st volume, Shelby Foote's 2nd (of 3) volume of his massive The Civil War: A Narrative series is nearly 1000 pages countless details. These books are a truly amazing accomplishment. Foote has the gift of elegant writing, which makes it considerably easier to make it through such a vast series. If you want to dedicate a few months....or years....to learning about the Civil War, these books will do the job. If you only want to know this gist, I wouldn't go with any of these. However, the Gettysburg section would be a good read for anyone."}, {"userName": "David", "userReviewDate": "Jan 02, 2011", "userURL": "http://www.goodreads.com/user/show/2213498-david", "userReview": "Many of my earlier comments with respect to The Civil War, Vol. 1: Fort Sumter to Perryville apply, although Foote's cultural awareness is clearly developing in response to the height of the Civil Rights movement during which this second volume was written--evident in a wry note of thanks in the Acknowledgments to the governors of Alabama, Mississippi, and Arkansas, whose heavy-handed stances against desegregation helped temper his natural Southern sympathies. This installment covers the period stretching from roughly January 1863-March 1864, a period in which the Union pursues three important strategic objectives--Richmond, Vicksburg, and Chattanooga. After Pope's disaster at Second Manassas, and a brief interlude where McClellan is restored to command, Gen. Ambrose Burnside is left in charge of the Army of the Potomac. It is a position he does not desire, and assumes under protest. His unsuccessful assault of a superior Rebel position at Fredericksburg results in his replacement by Gen. Joseph Hooker. Fighting Joe fares little better in a pitched battle at Chancellorsville in April, opening the way for Lee's summer campaign through Maryland and into Pennsylvania. Lee has no clear objective, other than a vague desire to occupy Harrisburg, and the loss of Stonewall Jackson at Chancellorsville leaves a gaping hole in Lee's cavalry leadership. A chance encounter between a Rebel detachment and elements of the pursuing Army of the Potomac, now under Gen. George Meade, erupt into the three-day Battle of Gettysburg, the turning point in the war. Lee's repeated failure to take the Union positions on a fishhook-shaped ridge convinces him to end his campaign and retreat to Virginia as Meade parallels his course, leaving both armies more-or-less where they started the year. A long stalemate follows.Meanwhile, in Mississippi, Grant makes plans to crack Vicksburg, the tough nut holding the two halves of the Confederacy together. A number of abortive incursions into bayou country in the Spring prove unavailing, until Grant forces a crossing of the Mississippi at Bruinsburg and quickly occupies Jackson, leaving Vicksburg open to assault from the east. As Gen. Johnston ineffectually hovers off to the north, Pemberton loses a holding action at Champion Hill, bottling his troops up within \"the Gibraltar of the South,\" as Grant, Sherman, and McClernand prepare to assault the city. After several failed attempts to take the city directly, Grant settles in for a protracted siege, forcing Pemberton's surrender on July 4.In Tennessee, Gen. William Rosecrans slowly consolidates his strength for a push on Chattanooga. A well-executed crossing of the Tennessee River southwest of town in September persuades Bragg to evacuate and fall back into northwest Georgia, giving Rosecrans his prize as Burnside occupies Knoxville. However, while pursuing what he believes to be a fleeing Bragg, Rosecrans is ambushed and soundly defeated at the Battle of Chickamauga, forcing him to retreat back to Chattanooga as the Confederates ring the city to the south and lay siege. Lincoln transfers command of the Army of the Cumberland to Grant, who, with Hooker's assistance, breaks the siege by establishing the Cracker Line into the city, and then routs Bragg and Johnston in November. Sherman's winter campaign in Mississippi is a brief, and not entirely successful, sideline leading up to Grant's assumption of overall command of Union forces in March.Once again, the political focus is on Lincoln, now prepared to throw down the gauntlet of emancipation. The north's military fortunes are necessarily tied to Lincoln's political fortunes, as the war passes into an election year. Lincoln fends off a potential challenge from Salmon P. Chase, his able Secretary of the Treasury, leaving his nomination assured. Some attention is also paid to Lincoln's troubling suspension of habeas corpus--a move which resulted in the only substantial Supreme Court case during the entire war.Ultimately, we get a sense of an inexorable, yet protracted, conclusion to the war in the distance. At the close of the book, the Union has achieved two of its intended three objectives, while the Confederacy is fighting a purely defensive conflict. The South failed to translate its long string of tactical victories into any sort of long-term strategic advantage, thereby surrendering the initiative and rendering the result only a matter of time. From a critical standpoint, it is hard to imagine a better military treatment of the Civil War, and Foote maintains his emphasis on personality over broader issues. It gives the events a certain immediacy, albeit one necessarily limited to the troops in the field and the two opposing presidents. Still, for a novelist, Foote is a great historian, and, for a historian, Foote is a great novelist. This is by no means faint praise--making the Civil War readable was an impossible challenge made to look easy."}, {"userName": "Ross", "userReviewDate": "Feb 11, 2013", "userURL": "http://www.goodreads.com/user/show/2209582-ross", "userReview": "Volume II of the this definitive history of the war deals with the period from the spring of 1863 to early 1864. The first part of the book covers the Union siege of Vicksburg in the West by Grant and the battle of Gettysburg in the East. In taking Vicksburg Grant gains an enormous victory. At Gettysburg a newly appointed General Meade defeated Lee's army when Lee made the mistake of attacking entrenched Union forces with too few men to hope to succeed. Lee was gambling if he could win the day, the North might give up on the war. At this point Lee knew the South could not hope to actually win the war unless he gained a major defeat and the so-called \"Copper Heads\" in the North insisted on forcing Lincoln to give up the fightWhen Lee was defeated, the new Northern general, Meade failed to follow Lee's army in retreat and destroy it. Lincoln was enraged and wanted to replace Meade with Grant but was counseled against it at the time in the summer of 1863. The balance of the book deals with further victories in the West by Grant and failure in the East by Meade to achieve anything at all despite having much greater forces than Lee. This leads to the end of Volume II when Lincoln realizes, in spite of his advisors, he must bring Grant to the East to command all the Union forces as the General In-Chief, the man who will win the war in Volume III. So Lincoln, after having to fire seven previous generals for timidity and incompetence has finally found the general he needs to preserve the Union.The overall theme in this volume, the South's belief that war would not be a fair fight with tough Southern woodsmen easily beating the North's pasty faced mechanics and store clerks was simply wrong by 180 degrees. True, the Northern soldiers for the most part could not fight worth a damn. But there were just too many of them and they were too well equipped. The author points out that the Industrial Revolution was coming to the North with all its powerful technology. The fact was the North was growing richer than ever and fighting the war with one hand behind it's back.In May of 2016 I am reading this trilogy again and have increased my rating of this volume and the series to 5 stars from 4. I really appreciate the detailed coverage and the quality of the writing."}, {"userName": "Ralph Wark", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/26299560-ralph-wark", "userReview": "God I love Shelby FooteThe Civil War Trilogy is not a project or light read, it's a commitment. The second volume is 967 pages, about 100 more than volume one. The first two have been exhaustively researched and detailed, and Mr. Foote's ability to tell a story is wonderful. This is not just a compendium of facts and troop movements, it's a real, living breathing account of the men who fought this war. From the men on the line to the generals to the presidents, you are there, you feel what they feel. The personalities are drawn with a vivid brush, you know what it's like to try to hold the factions of a country together (both sides had riots), the politics and rivalries between the generals, and what the civilians experienced. This book is so real, so accurate, that Gettysburg, a battle that took three days, takes three days to read. I've read books on that battle that weren't this good. I did have to take break between tomes, but I think I'm ready for volume three. The thing is, when I'm reading these books, that's what I want to do. I mean, the dishes really pile up, y'know?"}, {"userName": "Michael Atkinson", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/9255403-michael-atkinson", "userReview": "This second volume is as good as the first, especially since it covers some of the most dramatic battles of the Civil War: Gettysburg, Chickamauga, and Chancellorsville. Shelby Foote's writing is as good as ever. My favorite passages from this book: \"What mainly distinguished the conflict from the outset was its fury. An Alabamian described the racket as 'one solid, unbroken wave of awe-inspiring sound...as if all the fires of earth and hell had been turned loose in one mighty effort to destroy each other.\"My second favorite, an exchange of dialogue between General Braxton Bragg and a long-suffering private: Do you know what a retreat looks like?\" Private: \"I ought to, General. I've been with you during your whole campaign.\""}, {"userName": "Michael", "userReviewDate": "Nov 28, 2007", "userURL": "http://www.goodreads.com/user/show/644080-michael", "userReview": "I have never enjoyed reading anything more in my life. This is a Homeric telling of America's 2nd revolution. The author is biased towards the south, and he fails to adequately incorporate the political developments of the time into his account. He also worships the wrong hero: Jefferson Davis rather than Abe Lincoln. But the Civil War is the story of the south more than the north, and its being told by a southern partisan is thus fitting. No one has ever researched a topic more thoroughly. No one has ever brought ghosts to life like this. After reading this book, places like Shiloh, Vicksburg, and Chattanooga are transformed into holy ground. It is so gargantuan, I fear I will never have to chance to read it again"}, {"userName": "Donna", "userReviewDate": "Nov 10, 2007", "userURL": "http://www.goodreads.com/user/show/301807-donna", "userReview": "My intention was to read the entire three volumes of Shelby Foote again during the commemoration of the 150th anniversary of the Civil War. That may yet happen, but as we approach the anniversary of the battle of Gettysburg I chose to read \"The Stars in Their Courses\" which is a small volume extracting the middle chapter of the middle volume of this giant work. This is the best discussion of the military actions at Gettysburg and you can feel which parts influence Michael Sharaa's \"The Killer Angels\" and subsequently Ken Burns' PBS \"The Civil War.\" If you can't read 3,000 pages, read this short volume.We need more stars!!!"}, {"userName": "Greg", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/15848160-greg", "userReview": "No drop off at all in volume 2 of the series, and did not disappoint. In fact, the material is pure war topics, without the precursor material found in Volume 1. Foote's narrative style draws me even deeper in, and I'm very fascinated how objective he is, when I was expecting a much more Southern perspective. And still I think Foote offers the Southern side objectively, that I think was probably missing in epic series (i.e. Catton) like this done that were done in his time. LOVED page 719's account of the Texas captain captured at Chickamauga, and his predictions for the battle he provided to Rosecrans under interrogation. This one goes back to its' place of honor in the shelves."}, {"userName": "James", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/13145295-james", "userReview": "Foote's novelistic history of the war is well worth the (considerable) time commitment. There are more scholarly works out there, and there are more readable (shorter) works out there, but I'm not aware of any other book that combine's the exhaustive coverage of the whole war with a novelistic style that keeps you going through the whole, long, dragging misery of the 1860s."}, {"userName": "Sam Lonberg", "userReviewDate": "Dec 23, 2015", "userURL": "http://www.goodreads.com/user/show/4163595-sam-lonberg", "userReview": "Incredible."}, {"userName": "Theodore", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/340673-theodore", "userReview": "Joshua Lawrence Chamberlain got exactly one line!"}, {"userName": "Aimee Morse", "userReviewDate": "Sep 02, 2015", "userURL": "http://www.goodreads.com/user/show/7585769-aimee-morse", "userReview": "Just amazing."}, {"userName": "Alex", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/6910620-alex", "userReview": "Foote's writing falls in an odd spot between history and entertainment; I guess that made him an obvious choice for his role in the Ken Burns Civil War documentary. Foote writes wonderfully, and though his status as a mid-century Southern white man shines through every word he does not indulge sectionalist perspectives the way many of the contemporaries did. As far as I know, Foote's telling of the major facts and events is still considered accurate and probably no one has done a better job of humanizing and illustrating the conflict from the perspective of soldiers, particularly white southern soldiers. It's clear that Foote loves all the men who fought in this war, and admires Lincoln and Grant while not being blind to the sins of the South or the faults of the Confederate government and military. For such a very long \"Narrative,\" however, Foote seems incredibly cramped compared to more recent scholarship. Though he doesn't indulge in any bullshit denying the centrality of slavery to the Civil War or other such self-gratifying Southern myths, he also doesn't do much to place the war in context. He talks about suffering on the home front, particularly in the deprived and decimated south, only as it pertains to the soldiers and politicians.In short, Foote should be read by people who are interested in not just the history of the Civil War but also in the historiography: This is how 20th Century white historians wrote about the war.Those looking for a more concise and yet more comprehensive view should look to James McPherson's \"Battle Cry of Freedom,\" and those who are interested in the way civilians coped with the war and the way it changed American society should look to various books (\"This Republic of Suffering,\" \"Mothers of Invention\") by Drew Gilpan Faust."}, {"userName": "Brian", "userReviewDate": "Jun 29, 2010", "userURL": "http://www.goodreads.com/user/show/45193-brian", "userReview": "Political:Jefferson davis’s tour of western theater of army of tenn (bragg) and army of miss (pemberton) in December 1862, overarching goal defense of Mississippi riverLincoln’s Cabinet battles and neutralizing designs of Chase on higher office, ally in loyalty of Secretary of State SewardFood shortages in South and Bread Riot in RichmondInternal dissent in both Union and Confederacy during the warLincoln’s plan to re-integrate south with puppet governments whereby 10% of citizenry must swear loyaltySouth’s suspension of writ of habeas corpus, extension of inscription age rangeNorth call for 500,000 more soldiersWest:Union forces opposing Confederates of Rosecrans (against Army of Tenn) and Grant (against Army of Miss)Battle for Control of Mississippi River in Late ’62, Early ‘63Prairie Grove, AK defeat of Confederacy (Hindman) by Union (Blunt) and consequent inability to transfer troops to Mississippi TheaterGalveston, Texas defeat of Union by Confederacy (Macgruder)Grant’s battle to capture Vicksburg, MISSRear guard cavalry action of Confederacy (Van Dorn, Forrest) in Tenn/Kentucky to disrupt Grant’s supply linesSherman (union) amphibious landing and unsuccessful attempt to capture VicksburgRivalry between Grant/Sherman and McClernandSeven variously unsuccessful attempts to breach Vicksburg in roundabout manner by breaching levees, bypassing Mississippi via lakes and rivers, building canalsGrant’s Main Attack\tGrierson’s Cavalry raid as feint east of Mississippi River\tSherman’s feint north of VicksburgGrant’s main army landing south of Vicksburg and fighting inland and north/east and then attacking west into Vicksburg Frontal assault failure vs. Pemberton’s forces and subsequent siegeSurrender of Confederate forces after Lengthy Siege, Grant’s turn to face and defeat Confederates forces east of Vicksburg at Jackson, Miss under Joe JohnstonMiddle-West Tennessee Battles between Rosecrans (Union) and Bragg (Confederacy)\tBattle of Murfreesboro, Union victory of sorts in very bloody battleForrest’s long cavalry chase of Speight – ‘63Bank’s campaign to capture Port Hudson, south of Vicksburg, siege similar to Vicksburg, eventual surrender, surrounding action near New OrleansDefeat of Confederates in attempt to capture Helena, Arkansas over Union forcesMorgan’s long cavalry ride for confederacy into Ohio and eventual petering outUnion relatively easy capturing of Little Rock, AKQuantrill’s horrific massacre in Lawrence, KS as part of reprisal for Confederate imprisonment of women aiding confederacyShelby’s long confederate cavalry raid into Missouri, success but no overall impact on Union in westRosecran’s drive against Bragg in Tennessee Longstreet’s transfer of troops from East to Bragg’s assistance in TennesseeBattle of Chickamauga in Tennessee, Union (Rosecrans) vs. Confederacy (Bragg, Longstreet), Union defeat, bloodiest battle of Western Theater of WarRosecran’s sacking after fleeing from Chickamauga, Thomas put in charge after preventing total rout/disaster, Grant in charge of whole department of the WestBattle of Chattanooga in Tennessee post Chickamauga, and Union victory (Grant) with assistance of Hooker from east, Sherman from Mississippi, and Thomas, over Confederacy (Bragg), opening up of supplies through Cracker Line, attacks on Missionary Ridge, Lookout Mountain, Raccoon MountainLongstreet’s aborted siege on Knoxville vs. Burnside (Union) after being detached (over his protest) prior to Battle of ChattanoogaRemoval of Bragg as Commander post ChattanoogaBanks minimal gains in Texas with island hopping in/near MexicoSherman’s campaign against Meridian and Selma, driving east from Vicksburg, in advance of the Atlanta Campaign – Winter/Spring ‘64East:Union (Burnside) defeat at Fredericksburg, VA near Rappahannock River in late ‘62 against Confederacy (Lee, Longstreet, Jackson), successive defeats of charges up against Marye’s Heights by Union, Union near destruction of town of FredericksburgSacking of Burnside after another aborted attempt of crossing Rappahannock post Fredericksburg and putting Hooker in charge of Army of the Potomac\tHooker’s over-confidence in direct contrast to BurnsideBeauregard’s Defense of Charleston Harbor and city – ‘63\tIronclad repulse in the vicinity of Fort SumterContinuing challenges of Union to capture Charleston (Morris Island, Wagner, Sumter)Detachment of Seymour to Florida and Union loss in Battle of Ocean Pond (’84)Union (Hooker) defeat at Chancellorsville, VA near Rappahannock River in May ‘63 against Confederacy (Lee, Jackson), death of Jackson, Jackson’s end run around Union far western flank, Hooker’s loss of nerve and aggressiveness with far superior forces and ultimate retreatLee’s invasion of PennsylvaniaGettsysburg\tLee vs. Meade\tLee’s attack over objection of LongstreetDeath of Reynolds on day one, union pushback from Seminary Ridge northwest of city to Cemetery Ridge south of city\tSickle’s independent push forward west of Cemetery Ridge on day 2Confederate attack on far right union flank on round top, little round top on day two, confederate repulses on Cemetery Ridge, Cemetery Hill, Culp’s Hill on day two\tDisappearance of jeb stuart confederate cavalry prior to battle and re-appearance \tat end of day twoLongstreet’s assertion that position cannot be taken of cemetery hill/ridge at start of day three and lee’s going forward \tanyway\tDestruction of Pickett’s Divisions after final charge on third day up Cemetery \tRidgeLee’s aborted attempt to resign from Army post GettysburgPost Gettysburg clashes at Bristoe Station (union victory), cavalry action of Buckland Races (confederate victory) after Lee’s fall back into VirginiaUnion (Kilpatrick, Dahlgren) unsuccessful cavalry raid towards Richmond to release union prisoners there"}, {"userName": "Christopher", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/12306131-christopher", "userReview": "Foote's first volume was very much about Davis, McClellan, and Lee. Lincoln was obviously featured but not as prominently except insofar as he had to deal with McClellan. This second volume sees McClellan ousted and Lincoln now struggling to find a general. I love Lincoln, but man was he a meddler. We collectively consider his wartime leadership \"brilliant\" but that's only because he won. In his role as Commander in Chief he was quixotic, random, arbitrary, and as mentioned, ridiculously meddlesome. Asking whether or how things would have turned out differently had he acted differently is pointless because then he wouldn't have been Lincoln.But this second volume really highlights Lincoln's increasing willingness to challenge and replace generals that he did not feel were measuring up."}, {"userName": "Nathan", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/36079863-nathan", "userReview": "Three months into 2017, and I'm already two-thirds of the way through Shelby Foote's 3-volume narrative, and one-sixth of the way through my 2017 goal of reading a cherrypicked selection from the New York Times Civil War Books List! If only clinics weren't looming ahead, I might actually make it. Like the first volume, this is an excellent book by any standard, and there is a good reason why it continues to grace library shelves and reading lists fifty years after it was written. Foote's prose is sharp, fluid, and peppered with wit, that retains the epic grandeur and tragedy of the war. There are still historical mistakes and omissions, however, including some major ones, such as a failure to discuss the interrelated rise of the US Colored Troops and the breakdown of prisoner exchange programs in late 1863. Still, however, well worth reading."}, {"userName": "Tim Byers", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/436516-tim-byers", "userReview": "Tragedy and Hope Take RootWith this middle volume the magnitude of the Civil War sank in. So many miles, so many men, and so many graves. The year 1863 proves to be the turning point, as this work artfully shows, and with it comes a profound sense of the tremendous cost paid, as Foote is fond of saying, to the butcher. In this installment, we see Grant emerge as the answer to Lincoln's prayers and equal in the West to Lee in the East. What is also evident that the war will end in conquest not negotiation. Among the nearly thousand pages I find myself most intrigued by Sherman, whose vision of the task at hand seems at the same time terrible and correct. I regret not having invested in learning our history sooner."}, {"userName": "Kevin", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/54076393-kevin", "userReview": "This is the definitive history of the definitive year of the Civil War. Foote was a great writer who examines each battle in detail. I skipped a few parts that were not part of the big events. One \"drawback\" is the extent to which General Lee is glorified, and the Southern forces as somehow tougher and their cause legitimate. The fact was that the Union forces were led by generals who were not up to par, until Grant and Sherman took over. Also, most of the fighting was in the South, where these men lived, so they felt they were protecting their own. Lincoln played the long game and we owe the survival of our country to him."}, {"userName": "Isaac", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/8967389-isaac", "userReview": "This series seem more like a single large book, split up into multiple volumes because it would be impossible to hold otherwise, so I do not have much to add to what I gushed after finishing the first volume.I will say that as Foote described Pickett's charge, about half-way through this book and, as the second of three volumes, half-way through the series, I had already consumed more of Foote's prose than any other author and I felt as rapt and engaged as I had 80 hours hours ago.Foote's genius cannot be overstated, this series continues to be a tremendous achievement and I will waste no time digging into the final volume."}, {"userName": "Barbara", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/5173917-barbara", "userReview": "Struggled through Vol. 1 and finally finished it, despite the lack of important detail and clarity. I remember thinking I would appreciate it more if I knew more about the players. But that’s why I read—to know more, not to reinforce what I already know! Started Vol. 2 but I’m ⅓ of the way in and still not clear what’s going on where. I know there are better histories than this. I just feel guilty that I’ve owned this popular trilogy for so many years and never finished it. But I give up. This is going to the book drive along with Vol. 3. There. I feel better already."}, {"userName": "Mike", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/11732914-mike", "userReview": "The second volume in Foote's trilogy covers from December 1862 to the beginning of March 1864 and includes some of the most important battles in the war: Vicksburg, Gettysburg, and Chattanooga. Better than the first, though maybe a 100 pages or so longer than it needed to be. Still, required reading for Civil War or American history buffs."}, {"userName": "Jack Lewis", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/34234570-jack-lewis", "userReview": "Brilliant!A keen insight into the relationships between Gettysburg and Vicksburg. I had not realized how Lee’s convincing of Davis and his cabinet that invading the North would save Vicksburg. Instead, Lee is defeated AND Vicksburg falls. Two major defeats for the South instead of one Victory."}, {"userName": "Helena R-D", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/5661042-helena-r-d", "userReview": "I've been reading this on and off since I got it and finally finished it.mi have learned more than I ever thought possible and I never want to read this again. Yep. Masterfully Boone, but holy does it take commitment. I'm done."}], "description": "Focused on the pivotal year of 1863, the second volume of Shelby Foote’s masterful narrative history brings to life some of the most dramatic and important moments in the Civil War, including the Battle of Gettysburg and Grant’s Vicksburg campaign.  “Foote has an acute sense of the relative importance of events and a novelist’s skill in directing the reader’s attention to the men and the episodes that will influence the course of the whole war, without omitting items which are of momentary interest. His organization of facts could hardly be better.” —The Atlantic “Though the events of this middle year of the Civil War have been recounted hundreds of times, they have rarely been re-created with such vigor and such picturesque detail.” —The New York Times Book Review “The lucidity of the battle narratives, the vigor of the prose, the strong feeling for the men from generals to privates who did the fighting, are all controlled by constant sense of how it happened and what it was all about. Foote has the novelist’s feeling for character and situation, without losing the historian’s scrupulous regard for recorded fact. The Civil War is likely to stand unequaled.” —Walter Mills", "title": "The Civil War, Vol. 2: Fredericksburg to Meridian\n      \n          (The Civil War #2)", "url": "http://www.goodreads.com/book/show/10093998-the-civil-war-vol-2", "average": 4.52, "cover": "https://images.gr-assets.com/books/1328302881l/10093998.jpg", "reviews": 165, "authors": [{"url": "https://www.goodreads.com/author/show/24846.Shelby_Foote", "name": "Shelby Foote"}], "type": ["History", "Military History", "Nonfiction", "North American Hi...", "American History"], "outlinks": ["http://www.goodreads.com/book/show/10093998-the-civil-war-vol-2", "http://www.goodreads.com/book/show/373593.The_Civil_War_Vol_2", "http://www.goodreads.com/book/show/15981166-the-civil-war", "http://www.goodreads.com/book/show/44236.The_Civil_War_Vol_1", "http://www.goodreads.com/book/show/44234.The_Civil_War", "http://www.goodreads.com/book/show/874419.The_Civil_War_Vol_3", "http://www.goodreads.com/book/show/764255.Shiloh", "http://www.goodreads.com/book/show/44246.Stars_in_Their_Courses"]}