{"ratings": 48, "userreviews": [{"userName": "itpdx", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/558587-itpdx", "userReview": "This book is written the way I like history to be written—while giving the overall picture, it gives us the stories of the regular people who lived the history. I very much like to know what it was like to be there (without being shot at, blown up, or being hungry and dehydrated myself). James Campbell does an excellent job of this. But I am still unconvinced that these two incidents belong together. The book centers on the invasion of Saipan and the explosion at Port Chicago, California during ammunition loading of ships bound for the Pacific theater. I understand that the build up of pressure for speed of loading at Port Chicago was due to the build up of munitions for the invasion of Saipan and that Saipan proved to be a critical piece to the victory over Japan. But to me the overall theme of the book was the treatment of African-Americans by the military during WWII. And the Saipan story did not add to that. Maybe this should have been two books. Both parts are well worth reading and there is certainly more material mentioned in the telling of both stories to fill two books.The book that I read is an uncorrected proof. It appears the published final edition includes a map and photos (and hopefully an index) that should add much to the book."}, {"userName": "Elgin", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/2615246-elgin", "userReview": "One of the best WWII books I have read in years...two fascinating and surprisingly related stories recounted in a masterful way. This book tells the story of the invasion of Saipan, one of the bloodiest battles in the Pacific, and the story of the black Navy sailors that worked as longshoremen loading the ammunition and bombs for the Pacific battles. The Saipan story followed a few young (17-19 yrs old) white men from the time of their induction in the Marines through the end of the battle and (for those who make it through) beyond. The longshoreman side focused on some young blacks who joined the Navy, with promises that they would serve on ships and in combat, but instead were literally treated as slaves once in the Navy. In the early 1940's the Civil Rights movement was strong, and one goal of the movement was to allow blacks to serve in the military in other than menial positions. The Navy (and other branches of the service) reluctantly took in blacks. The accounts of the discrimination, mistreatment, and lack of concern on the part of the Navy towards the black enlistees are shocking and disgusting...almost unbelievable. We all know there is racial discrimination alive today, but back in the 1940's it was not only a visible part of life, but something many whites, especially in the Navy, were proud of. This is an absolutely outstanding book...both the story of Saipan and that of the blacks in the Navy are incredibly well told and gripping."}, {"userName": "Yiming", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/71745230-yiming", "userReview": "This book was a nice history book about the battles Americans fought abroad and at home. The aboard experience talks about Marines on Saipan, and the at home experience talks about Port Chicago. I gave this book a low rating because the Saipan/Port Chicago transitions are very choppy. If you want something better, check out \"The Port Chicago 50\". It's more depth and focuses on the story more.If you haven't read PC50, this book might be for you."}, {"userName": "Jana", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/11158604-jana", "userReview": "I set this book aside...not because it wasn't good and worth finishing, but because after reading the horrible description of the explosions that passed from one ship to another and set the water on fire in Pearl Harbor not during the Japanese invasion, but afterward, when safety practices were ignored and Black enlisted sailors' lives were sacrificed... I couldn't bear to read on... not right now with the way things are in our country... I don't know if I will try again ..."}, {"userName": "Jock Mcclees", "userReviewDate": "Jul 21, 2016", "userURL": "http://www.goodreads.com/user/show/29803086-jock-mcclees", "userReview": "This book talks about the battle of Saipan and also the ammunition loading facility at Port Chicago on San Francisco Bay. It is kind of 2 books in one. It is the story of white soldiers fighting on the Pacific islands starting with the Marshall Islands and then primarily focusing on the invasion of Saipan.I have read some war stories but this one is one of the most graphic in terms of the hell that they experienced, not just during the shooting but in the living conditions or lack of them. Why white soldiers? Because of the prejudice of the time and the Jim Crow. Blacks weren't allowed to be soldiers in combat. They were given the jobs of cooks and stevedores and cleaning out latrines and any other jobs the white soldiers didn't want to do. In fact, the Navy, Marines and Army wanted no part of blacks in general. The vitriol, hatred, bigotry and racism was so in your face back then that it is hard to believe. This book needs to be read to understand how far we have come and how far we still have to go. Blacks were lobbying to be treated as equals and had an ally in Eleanor Roosevelt. So it was decided with pressure from the NAACP and many other organizations to allow blacks into the military and into other areas besides cooks. There was huge push back and they suddenly had the idea that they could use them as stevedores and other manual labor like this. So a whole group were sent to Port Chicago to load ammunition onto ships bound for the war in the Pacific. They were given no training on how to handle munitions. The white officers placed bets on whose group could get more loaded in a given time, causing safety short cuts to be routinely taken. They also wouldn't allow Coast Guard inspectors to oversee because it slowed down the loading. Many people realized it was a disaster waiting to happen.The blacks were treated as second class citizens in almost every respect. In fact, in many cases almost treated like slaves.On Saipan they brought in black units to unload the ships and handle getting supplies to people. They were out in the open and took heavy casualties. There were gaps in the lines at the start of the invasion and the blacks filled those gaps at night and prevented many deaths by preventing the Japanese from getting behind the lines. It was the first time blacks had been involved in combat and some of the white officers took notice of how well they performed. As the battle went on, and men were killed, the officers no longer cared that things were supposed to be segregated, they tossed the blacks into the fray where needed out of necessity.Back at Port Chicago, the regulations got more and more slack in order to load more munitions. There was only supposed to be one train on the pier with munitions at a time. Now there were two or three which greatly increased the risk. No one knows exactly what happened, but the inevitable finally happened and a mostly loaded ship and the railroad cars full of ammunition and bombs blew up with almost the force of an atomic bomb.The white officers were given survivor leave and the black Marines were denied survivor leave and told to go back to loading munitions. Some of the blacks said they would do anything but load munitions. This started a court martial for mutiny and their possible deaths by firing squad. The tale of the trial is riveting and was so biased and rigged as to be laughable.Despite or because of the fallout from the explosion and the trial the Navy was ultimately the first of the Armed Forces to completely integrate in the 1950s. But to read about the horrible treatment of the blacks in WW2 just made you want to wring someone's neck or shake some sense into them and try and get them to see how reprehensible they were being."}, {"userName": "Meg - A Bookish Affair", "userReviewDate": "Apr 26, 2012", "userURL": "http://www.goodreads.com/user/show/1132408-meg---a-bookish-affair", "userReview": "This book is really made up of two stories. The first story is that of the Battle of Saipan, a very decisive battle in the Pacific theater during World War II. It was a hard fought battle that really turned around how the Americans were doing in the war against Japan. The second story is that of the Port Chicago explosion, a much lesser known event that happened during World War II that happened at a Naval munition shipping port of sorts. I actually had never heard of this event (at least that I can recall) and I really enjoy reading about World War II history.In the battle of Saipan, most of the military personnel that fought were white. While at the Port Chicago explosion, many of the military personnel were black. The military was still really working (working might not be the best word; perhaps grudgingly and exceedingly slowly are more fitting) on trying to fully integrate the military. Even though all branches of the military desperately needed men (remember women were only in the military in a small, very specialized capacity), all branches of the military had serious misgivings about moving forward. It was stunning to see how bull-headed the military leaders were even though opening up the military to other races would have alleviated or at least helped to alleviate the dearth of personnel. It's amazing to look at how things have changed between then and the present. This is not to say that the military is perfectly equal now but man, we've come a long way.What I liked about this book is that the two stories are told through the people that were there. You get to know the people that were there and what they were seeing and feeling and where they were coming from. I love history books that are told from the view of people. They seem more tangible and seem to touch you a little bit more. I think using stories of people that we, the readers, may be able to see a little bit of ourselves in the men in this book.I really wish that there had been even more discussion on what was going on as far as integration and segregation in the military. You get a flavor but there isn't really that connective story between what was happening in Saipan and what happened at Port Chicago. The comparisons on how the different troops were treated is really left up to the reader, which is fine but I really wanted a little bit more. That being said, history lovers are still going to find a lot to love about this book. One of the things that I love most about non-fiction history is seeing where we've been. It's been said that those who don't remember the past are doomed to repeat it. This is why we all should read history books!"}, {"userName": "Murdo Morrison", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/5778226-murdo-morrison", "userReview": "This review is for an Advance/Proof copy of the book.The Color of War: How One Battle Broke Japan and Another Changed America juxtaposes an account of the invasion of Saipan by American forces with that of a devastating explosion at Port Chicago, a munitions transfer depot in the Bay Area of California. The central theme of the book is an examination of the effects of segregation in the American armed forces during World War 2. The author weaves a compelling story, using the personal stories of a number of individuals involved in both events. The events are linked in that the Port Chicago facility was a major shipping point for munitions needed in large quantities for the invasion.Regardless of background, training or ability, black servicemen were routinely assigned to menial duties despite the wish of many to serve in combat or other activities that matched their motivation and skills. Racist attitudes were common in the command structure of the various armed forces. Despite numerous warning about unsafe practices at the Port Chicago facility, the workers, mainly black, are forced to work without proper training and at a pace that safety experts warn is likely to lead to a catastrophic incident. In the aftermath of the explosion, a group of 50 workers are tried and convicted for mutiny when they express an unwillingness to go back to loading ammunition under the same leadership. The book details the events of the trial in which the workers are given harsh sentences while the Navy's leadership deficiencies are essentially ignored. The Color of War: How One Battle Broke Japan and Another Changed America is a well written and compelling account that ably depicts the real horrors of war and the ugliness and injustice of bigotry and prejudice."}, {"userName": "Jennifer", "userReviewDate": "May 31, 2012", "userURL": "http://www.goodreads.com/user/show/6597281-jennifer", "userReview": "I received this book as a giveaway and am required by law to include that information in this review.Now, with that out of the way, a review. I don't do a lot of pleasure reading, or at least, not as much as I would like as my job requires a lot of detailed reading. My interest in this book was to see if it was something my husband would like to read. He is very interested in historical World War II accounts.For the first 32 pages I didn't see a connection to World War II and race although I had read enough to realize that was what the book would be discussing - African American Marines and Soldiers in World War II. At that point I was going to give it until page 50 until I gave up.Page 33 actually started recounting some vignettes. At first I was not sure if this book was supposed to be fiction or non-fiction. From further reading I think it is a non-fiction account, but after 100 pages I am setting it aside. Maybe my husband will like it.I was reminded of the movie Men of Honor while reading what I did and more recently of the book and movie, The Help. There were too many people mentioned, I couldn't find a connection between any of the people/characters mentioned and felt the book really didn't feel it matched the proposed title until page 33 of my copy.I wish the author continued success."}, {"userName": "David", "userReviewDate": "Jun 03, 2012", "userURL": "http://www.goodreads.com/user/show/1408078-david", "userReview": "The Battle of Saipan is considered by those who are knowledgeable to be as important to the ultimate Allied victory over Japan as Normandy was in the ultimate victory over Germany. This book explores the Battle and a little known tragedy in an ammo loading facility in Port Chicago in California. At the facility, in early 1944, under the extreme pressure to get ammo to the Pacific, mistakes were made (or, maybe, an early version of a small atomic bomb was detonated to gauge the damage) and a huge explosion resulted, killing hundreds and wounding hundreds more. Adding to this really well-written book is the fact those most of the people loading the ammo were African Americans. They enlisted to help defend their country but, as Jim Crow ruled in the military, were used as laborers. This is a story of an incredibly important yet bloody victory in the Pacific, absolute bigotry in the military and resilience on the part of the African Americans who wanted nothing more to be treated as Americans."}, {"userName": "Barry", "userReviewDate": "Jun 28, 2012", "userURL": "http://www.goodreads.com/user/show/1551258-barry", "userReview": "This book provides an interesting glimpse into life for black Americans serving in the military during World War II. Not only does it peel the cover off the military, it also provides a good look at attitudes and the treatment of black civilians in America. Though the book appears to focus on incidents relating to a large ordnance explosion on the coast of California, it ends up encompassing far more of the Pacific theater during the war. While highly interesting, after a while I started wondering what the real point of the book was. If the battle of Saipan was the real focus of the book, the author chose a very unusual and long round-about way of getting there.All in all this book is a good read, though a little disjointed. The strengths of Mr. Campbell's effort is twofold: character introduction/development, and looking at events in their American context of racism and segregation. [This book was given to me through a goodreads.com giveaway. I wasn't required to give a review, but did so gladly.]"}, {"userName": "George", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/9245159-george", "userReview": "This is really two independent books that come together only on July 17, 1944. On that date, Port Chicago Naval magazine exploded and the Japanese surrendered on Saipan while its leadership faced up to the idea that the war was lost. I pretty much ignored the Saipan story as it discussed the tactics of capturing the island, palm tree by palm tree--not my kind of story. Port Chicago's story is a step on the US' road to racial equality. It was an excellent telling of that story. That story is the US Navy's institutional prejudice. I would have liked to see a better nexus between the stories, as I skipped whole [Saipan] chapters to digest the Port Chicago story. Further, it would be interesting to see the impact of the Port Chicago loss on the war effort. Half of this book was excellent, the other half is throw away."}, {"userName": "Olivia", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/5300976-olivia", "userReview": "I won this book in a good reads giveaway. It took me a while to get into this book which may in part be due to the fact that history books aren't usually what I read. However, I thought the description of the explosion at Port Chicago and the trial afterwards were really interesting. I found myself getting frustrated with the obvious racial relations and segregation that was occurring during WWII. While I did have a harder time getting interested in the war component of the battle of Saigon, it was a solid reminder of what these guys went through; one second your friend is right next to you, the next he's been killed by the enemy and instead of risking your life to take his body and \"not leave him behind\" you have to keep moving and hope you can come back and get his body later."}, {"userName": "Kimberly", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/4645213-kimberly", "userReview": "A free copy of this book was received from a Goodreads First Reads giveaway.I enjoy reading about history, especially military history. This book provided an interesting glimpse into a part of WWII which I hadn't seen before. I was drawn into the book by the general topic and then my attention was grabbed by the individual stories which the author recounted. The Battle was a very important event and the book shows it in the proper perspective. It also provides good information on what it was like to work in an ammo factory, providing the weapons and other supplies for the Pacific Front. Informative read, with interesting and engaging characters."}, {"userName": "Doug", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/316285-doug", "userReview": "Campbell explores the stories of African American service men during WWII. Many of the soldiers suffered due to attacks from angry groups of white soldiers who harassed the African American men when they went off base on leave. They had to do dirty tasks that white service men did not want to do. The book climaxes with a trial which resulted from African American Navy men refusing to work under very dangerous conditions. Thurgood Marshal is among those who come to their defense. This is a little known and tragic portion of our history. If I had not won this through goodreads it may have slipped my notice."}, {"userName": "Vince", "userReviewDate": "May 06, 2012", "userURL": "http://www.goodreads.com/user/show/1244857-vince", "userReview": "Well written and well documented look into both the Battle for Saipan and the explosions that rocked Port Chicago leading to the death of many ammunition loaders of African descent. Both battles were important, one was a needed step towards victory over Japan and the other was a needed step towards full equality in the armed services. Worth reading especially if you like a lateral view of history and like to appreciate the interconnectedness of events.I received this book for free as a review copy but received no compensation for writing this review."}, {"userName": "Michelle", "userReviewDate": "May 29, 2012", "userURL": "http://www.goodreads.com/user/show/6452126-michelle", "userReview": "A part of history that I never knew...heartbreaking, tragic, and hard to understand based on today's world. A must read for history students. Campbell spells out the story and the reader feels like there were there with the soldiers seeing what they are seeing, feeling what they are feeling. Thanks to Goodreads for providing my copy."}, {"userName": "Jack", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/9028643-jack", "userReview": "Very insightful. A look at WWII history from a different perspective -- men who WANTED to fight for their freedom, but the culture would not let them. Pres. Truman would change that just a few years later."}, {"userName": "Felicia", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/6459254-felicia", "userReview": "I won this book from Goodreads first reads. I put this book to read since me and my son had been talking about WWII. I thought this book took you into the heart of the people at the time. I thought it was great."}, {"userName": "Matthew Thompson", "userReviewDate": "Jul 05, 2015", "userURL": "http://www.goodreads.com/user/show/12596051-matthew-thompson", "userReview": "they better be teaching this in US history classes now, i can't believe i grew up in the east bay and never heard of port chicago until reading this book."}, {"userName": "Hildegart", "userReviewDate": "Jun 01, 2012", "userURL": "http://www.goodreads.com/user/show/9113583-hildegart", "userReview": "First-reads book. This was a really good book and I liked how it looked at the experiences of African-American troops in WWII. Definitely a book that should be read if you enjoy WWII history."}, {"userName": "Carl", "userReviewDate": "Aug 03, 2012", "userURL": "http://www.goodreads.com/user/show/8921615-carl", "userReview": "Good look at the racial issues that came up in WWII. I was impressed to see the adversity minorities overcame."}], "description": "From the acclaimed World War II writer and author of The Ghost Mountain Boys, an incisive retelling of the key month, July 1944, that won the war in the pacific and ignited a whole new struggle on the home front. In the pantheon of great World War II conflicts, the battle for Saipan is often forgotten. Yet historian Donald Miller calls it \"as important to victory over Japan as the Normandy invasion was to victory over Germany.\" For the Americans, defeating the Japanese came at a high price. In the words of a Time magazine correspondent, Saipan was \"war at its grimmest.\" On the night of July 17, 1944, as Admirals Ernest King and Chester Nimitz were celebrating the battle's end, the Port Chicago Naval Ammunition Depot, just thirty-five miles northeast of San Francisco, exploded with a force nearly that of an atomic bomb. The men who died in the blast were predominantly black sailors. They toiled in obscurity loading munitions ships with ordnance essential to the US victory in Saipan. Yet instead of honoring the sacrifice these men made for their country, the Navy blamed them for the accident, and when the men refused to handle ammunition again, launched the largest mutiny trial in US naval history.The Color of War is the story of two battles: the one overseas and the one on America's home turf. By weaving together these two narratives for the first time, Campbell paints a more accurate picture of the cataclysmic events that occurred in July 1944--the month that won the war and changed America.", "title": "The Color of War: How One Battle Broke Japan and Another Changed America", "url": "https://www.goodreads.com/book/show/13152093-the-color-of-war", "average": 4.02, "cover": "https://images.gr-assets.com/books/1336283686l/13152093.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/5236672.James_Campbell", "name": "James   Campbell"}], "type": ["History", "Nonfiction", "North American Hi...", "Cultural", "War"], "outlinks": ["http://www.goodreads.com/book/show/13152093-the-color-of-war", "http://www.goodreads.com/book/show/39585.The_Final_Frontiersman", "http://www.goodreads.com/book/show/204501.The_Ghost_Mountain_Boys", "http://www.goodreads.com/book/show/26109024-braving-it"]}