{"ratings": 1570, "userreviews": [{"userName": "Laurie", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/1050800-laurie", "userReview": "This is a family biography, the story of a family split by an ocean and by different ways of life. It’s a sad tale of prejudice, war, and brutality, as well as of love. Chan Sam had a wife and land in southern China in the 1920s, but word was that one could make enough money at ‘Gold Mountain’- Canada or the USA- for a person to set themselves up for life. So Chan Sam went to Canada to make his fortune. He didn’t like being alone- there were very, very few women in the Chinatowns at the time. He acquired a concubine from China: a 17 year old May-ying, who was basically sold. Chan didn’t have the money to pay for her, so he made a deal with a tea house owner: the girl would be Chan’s concubine, but during the days and evenings she would work at the tea house to pay off her own purchase price. That’s not an auspicious start for a relationship. As time went on, May-ying had two baby girls. Chan wanted them educated in China, and between the two of them they had made enough money to go home for a while. When Chan Sam and May-ying returned to Canada, her daughters remained in China with Chan’s wife. They returned just in time for May-ying’s third child to be born on Canadian soil. It wasn’t the hoped for son that would have given her some prestige in the family, but another daughter- worthless in her eyes. In time, Chan Sam returned to China without May-ying to try and sire a son on his wife. This left the young May-ying in the unenviable position of financially supporting not just herself and her daughter, but Chan Sam, his wife in China, and her two daughters over there. Not to mention the costs of the mansion (by rural Chinese village standards) that Chan Sam was building in his village. That’s a lot to expect of a young woman. Even after Chan Sam returned to Canada, but had separated from May-ying, he showed up every week to collect the money she had earned. Not that he was lazy; he did back breaking work in the shingle mills and at any other job he could find. Employment was severely limited for the Chinese in North America. May-ying was a badly damaged person. She sought solace in alcohol and gambling, and abused her daughter both physically and emotionally. I was horrified by the way she treated her, but the circumstances of May-ying’s life might have broken anyone. Thankfully, the daughter, who took the English name Winnie, had the inner reserves to survive, concentrating on school and getting away from home. She succeeded in doing so, through hard work and marriage, and brought up a great family. The author is Winnie’s second daughter. After 50 years, the Canadian sister and the Chinese sister finally managed to meet in a 4 day visit that brought tears to my eyes. But what really hit an emotional chord was the way the Chinese family viewed May-ying: basically ignoring the money she’d sent for years, they saw her only as a very bad wife who brought only misery to Chan Sam. They were only given half the story. It’s a very sad story of the miserable lives the Chinese in North America lived during the first half of the 20th century thanks to prejudice, and an even sadder one that as bad as those lives were, they were considered worth while because monetarily it was even worse in China. I’ve read a number of books about the Chinese in North America, and this one is the grimmest. But it’s a story I couldn’t put down and stayed up half the night reading."}, {"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "fabulous"}, {"userName": "LibraryCin", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/12860715-librarycin", "userReview": "This is a biography of three generations of a Chinese-Canadian family. Chan Sam came to Canada and left his Chinese wife at home, but soon brought a beautiful younger Chinese woman to Canada as his concubine: May-ying. May-ying gave Chan Sam 3 daughters; before the 3rd one (Hing) came along, the other two had been taken back to China to live with Chan Sam’s Chinese wife. Hing, the daughter who stayed in Canada, was mostly neglected by her drinking, gambling mother. Hing’s daughter, Denise, is the author of the book. The book does focus mostly on May-ying, but it also tells the story of the family in China, as well. I can’t recall the phrase in the book, but something along the lines of a split family. I thought this was very good. It covers a good portion of the 20th century, so it also includes a bit of history of how Chinese people were treated in Canada, and North America, in general, over that century. The story was interesting, and it did primarily focus on the most interesting person, in my opinion, May-ying. There was also a nice set of photos included – photos of those in both Canada and China."}, {"userName": "Betty", "userReviewDate": "Nov 08, 2008", "userURL": "http://www.goodreads.com/user/show/1380729-betty", "userReview": "The Concubine's Children is a wonderfully crafted non-fiction book written by the granddaughter of the main characters. Chan Sam, a peasant, leaves his wife behind in China in order to go to the fabled \"Golden Mountain\" as Western Canada was refered to at the time (1913). He brings with him his Concubine, a beautiful but no-nonsense girl, to British Columbia, living in Vancouver's Chinatown. Expectations are high that Canada was a land of riches. All spare money was sent back to Chan Sam's wife in China, and the Concubine and her children did without. The wife, Huangbo, raised their son & two daughters by the concubine in China; May-ying, the concubine worked hard as a tea-room waitress to earn money to support both the family in China and her husband and their own two children. Life was harsh, there were moves from Vancouver to Victoria's Chinatown. Gambling became a problem particularly with May-ying. This is a historical account of a time in the Lower Mainland of B.C. that every Canadian and American should read, there is so much history both of early B.C. and China, with China occupied by Japan, then the rule of Mao Tse Tung. A few years ago, the narrator Denise and her mother made the trip to China to visit what relatives they had there, and so the two families finally came together. I thoroughly enjoyed the book and read it when it first came out (about 1989; it has now been reprinted) and still keep my precious first copy paperback; I've loaned it or bought one for some friends through the years, that is how much I care about it. I have now read it a few times. Highly Recommended. A quote from Denise Chong: \"I didn't realize the extent of it, until I did my history, that my grandparents lived in Canada at a time when they could not participate in White society.\""}, {"userName": "Teghan", "userReviewDate": "Feb 28, 2011", "userURL": "http://www.goodreads.com/user/show/4020363-teghan", "userReview": "This book was given to me as a gift and I cannot for the life of me understand why I hadn't read this earlier! A breathtaking memoir that spans a century. Chong writes so intimately, laying forth her family's history for all to see, the bad parts and the good parts. There is a quote on the front cover from The New York Times Book Review that summarizes this book so perfectly that I have to repeat it here:\"Beautiful, haunting and wise, it lingers in the mind like a portrait one returns to often in a family album, and elicits the same mysterious response of love, melancholy and pride\"It does stick with you. When I finished it, closing the back cover over, I felt sad. In reality what was only a matter of days, it felt longer, you live with the Chan/Chong family through 90 years of history and experiences. It leaves an impression on you, feeling as if you almost know them. With that thought in mind, I next pondered that this was actually the life of someone....it is a memoir, not a biography done by a third party. This is the life of several still living individuals, who have put their entire private lives out there for us to experience. I am unsure I would be able to do the same. It is not the story of any particularly remarkable person or event. Its rather ordinary actually, its an experience that many Chinese-Canadians experiences one way or another. It is about real people, with all their complexities. I realized this as I was frequently flip-flopping between sympathy and animosity towards May-ying; but thats how we react to real people: they are at times wonderful and less so at other times. Real people are never understood in a binary of good or bad, its a complex mix and that is what this memoir is. The story of real people and in the process, it becomes remarkable."}, {"userName": "Hilary", "userReviewDate": "Dec 11, 2011", "userURL": "http://www.goodreads.com/user/show/276463-hilary", "userReview": "Fascinating and heartbreaking true story of Chinese immigrants in B.C.'s Chinatowns in the mid-1900s. This tale recounts the story of Chan Sam and his progeny. Chan Sam came to Vancouver to make his fortune at the turn of the century. After 11 years he is still waiting for his metaphorical ship to come in, while his wife and child remain in China. Anxious to produce a male heir, he takes a second wife, the titular concubine, who joins him in Canada. But this wife, May-ying, is no wilting flower and is not content to simply do Chan Sam's bidding. She wants independence, but is willing to keep sending her husband most of her earnings to get it. Especially tragic is that after decades of working difficult and menial jobs to send money to China, the land and homes purchased there were ultimately confiscated as part of Mao's lands reforms. The book provides fascinating insights into the world of Chinatown from the 1920s through the 1950s - the tea houses, the gambling dens, the rooming houses. Absolutely riveting."}, {"userName": "Catherine", "userReviewDate": "Mar 17, 2009", "userURL": "http://www.goodreads.com/user/show/64544-catherine", "userReview": "Another incredible memoir. Very well-written. This is one of my absolute favorites."}, {"userName": "Melinda", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/55187687-melinda", "userReview": "I loved this book. Part education piece, part grippin at your heart kind of story.I think it’s so important right now to learn about how immigration policies shape the lives of so many ppl living abroad from their home countries. You learn hugely the shared recent past of Canada and China through one family’s history and it’s just so well written too. This is a good one. I want to read more books like this. If anyone has any recs pls send em my way !!"}, {"userName": "Steven Langdon", "userReviewDate": "Sep 29, 2012", "userURL": "http://www.goodreads.com/user/show/5864496-steven-langdon", "userReview": "\"The Concubine's Children\" was first published in 1994, and became a long-time best-seller in Canada, having a major impact on many people's awareness of the past state abuse and discrimination endured by Canada's Chinese-origin population -- especially Chinese women. With the harrowing details in her hard-edged account of some sixty years of the lives of three generations of Chinese wives and daughters (all of it factual and presented with unsparing but calm deliberation,) Denise Chong provided a social commentary on ethnic inequality but even more so on gender inequality and poverty.May-ying came to Canada in 1924, as a second wife or concubine to Chan Sam, starting the saga that Chong (May-ying's grand-daughter) recounts. It is a story of complicated and conflictual relationships, involving two continents and various locations across Canada, but Chong navigates her tale with skill, plus brings alive a series of disparate characters (May-ying and Chan, their three daughters, two other wives, a disabled son, then the lovers to whom May-ying ultimately turns, the husbands of the daughters, Chong herself and her family.) And in the end, the tension mounts as, more than 60 years after 1924, both sides of Chan Sam's divided family finally come to confront each other within a changing China.I found this book slow going here and there, given the recurring conflicts and maternal failures of May-ying, whose experience of abuse pushes into alcoholism. It is also a grim and depressing book at times, as again and again white society of the time blocks the chances of Chinese Canadians to realize their dreams. But on another level it is also a hopeful book because so much has changed for the better over time for those whose origin is Chinese (like our two daughters.)Most of all, though, I am struck by what an honest, blunt book this is -- how clear and forceful it is in organizing its evidence -- and therefore what a fine piece of work Denise Chong has given us."}, {"userName": "Marcy", "userReviewDate": "Jan 28, 2010", "userURL": "http://www.goodreads.com/user/show/1140398-marcy", "userReview": "Chan Sam, married to a woman in China, takes on a concubine and moves to the new world of Vancouver, with the hopes of making a fortune to send home to China. May-ying, the concubine has two daughters. The entire Vancouver family goes back to China. May-ying leaves her two daughters in China with Chan Sam's wife when Chan Sam and his concubine moves back to Vancouver. May-ying works hard at waitressing to provide Chan Sam with money to send back to China to support his wife and two daughters, and later a son who is born with backwards feet. May-ying and her Chan Sam are no longer happy together. May-ying begins to drink and gamble heavily. May-ying has one more girl child in Vancouver and adopts a son years later. May-ying meanwhile, continues to waitress, gamble, and drink. Her abusive behavior to her daughter, Hing, is heartbreaking. Hing is an excellent student and she works hard to make her life as an adult better than her life as a child. This is a story about two families, all connected, but living in two worlds."}, {"userName": "Enikő", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/1195946-enik", "userReview": "Another good read. :o) It was a bit difficult at first, owing to the fact that I had trouble with the foreign names of people and places, but once I got into it, I could at least make out wether the author was writing of a person or a village. Some parts were very sad, all the more so because this is based on true events. Good ending, though. Nice to see the author derive joy of the outcome, finding meaning in all that happened and, finally, peace."}, {"userName": "Toni", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/4720553-toni", "userReview": "This is the amazing story of a young woman who comes to North America (Canada)as a concubine. It is the story of the author's grandmother and is told with honesty and love. It exposes the injustices Chinese immigrants faced on the North American continent. A great story and a tribute to the author and her family. The story spans three generations, two continents."}, {"userName": "Ann", "userReviewDate": "Sep 17, 2007", "userURL": "http://www.goodreads.com/user/show/328083-ann", "userReview": "The memoir of a daughter born in the US (or was it Canada) to a Chinese man and his concubine. She unravels the history of her parents, both flawed in their own way, and her sisters that stayed in China with the 1st wife. An interesting read, although sometimes painful on the daughter's part, that explores the hierarchy and allegiances of the husband, 1st wife, and concubine."}, {"userName": "Lbaker", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/5182359-lbaker", "userReview": "So many biographies do not read well, this one reads like fiction - which I mean as a compliment!Denise Chong grandmother May-Ying was the Concubine who moved to Canada from China to join her husband who she had never met. She lived most of her life in Vancouver, Nanaimo, and Victoria. The history of British Columbia was as interesting as the family history."}, {"userName": "Val", "userReviewDate": "Jun 24, 2010", "userURL": "http://www.goodreads.com/user/show/3920677-val", "userReview": "Wow! This book traces the family history of Ms. Chong's maternal side, and how the family was divided between China and Canada. A great history lesson about Vancouver and Nanaimo's Chinatowns, Canada's treatment of the Chinese, and of the hardships faced in China. A must-read."}, {"userName": "Irene D ", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/28072019-irene-d", "userReview": "An excellent portrayal of the hardships and tenacity of the Chinese culture. Educational and heart wrenching. I was stunned to learn of the Chinese politics of quite modern times. As the Concubine is damaged she also damages her daughter and the two are forever in conflict. Not that this is a cultural thing but is common everywhere. I found the author’s handling of this narrative riveting, compelling and heart felt."}, {"userName": "EricaLynn", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/80479564-ericalynn", "userReview": "This family memoir captured Chong's grandparents journey to Canada and starting a new life amidst uncertainty, war back home and racism in a country that was only part-way to acceptance. It inspired me to look into my own family's history. Chong talks about piecing together old black and white photographs, reading through journals and taking the trip to China to see her grandfather’s village. She ended with a line that’s stuck with me, that “the life we lead begins before and continues after our time.”"}, {"userName": "Germaine Lynch", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/39059778-germaine-lynch", "userReview": "What an interesting, heartbreaking and inspiring story! Well-told and easy to read. I think this is an important story for all to read as it gives insight to the hardships often endured by immigrants and can encourage compassion for those whose stories we often know so little about."}, {"userName": "Katrina", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/1321883-katrina", "userReview": "Less easy to read than Snow Flower (which I also recently read), probably because it's a biography and has a lot of historical information as well. It wasn't real happy either, but I did find it interesting--especially the photographs, which made it all seem real."}, {"userName": "Brian Liang", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/25319161-brian-liang", "userReview": "One of the best written memoirs of a Chinese-Canadian family in the mid 1800's to 1930s. It's so strikingly similar to what my ancestors went through. I had a chance to meet Denise Chong and had her sign my copy in high school; a must read."}, {"userName": "Jane Glen", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/7439172-jane-glen", "userReview": "This memoir was a sad and poignant story of life lived between two cultures."}, {"userName": "Christina Parlov", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/82090887-christina-parlov", "userReview": "A very well written family memoir. This is one of my absolute favorites."}, {"userName": "Debra Donaldson", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/69204925-debra-donaldson", "userReview": "Great insight into what was seen in a whole new perspective"}, {"userName": "Susan Finck", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/7739937-susan-finck", "userReview": "3.75 stars"}, {"userName": "Arielle Masters", "userReviewDate": "Jul 03, 2016", "userURL": "http://www.goodreads.com/user/show/49102892-arielle-masters", "userReview": "Author's exploration of her parents' and grandparents' history through the mid- to late-1900s, sparked by family photos. They started in China. Some stayed; some emigrated to Canada and returned; some emigrated and stayed, only to visit much later. There are a lot of themes. Exploration of the poor immigrant experience in various Chinatowns in Canada over the years. How hard her mother's parents had to work to support themselves and their families, both in Canada and back in China. Frustrations along the way: local and overseas interference; the Depression and two world wars; drinking and gambling problems; health issues; trust; different value systems. The worth of a salary in Canada vs. China during different economic periods. Contrast between the traditional Chinese, more modern Chinese, and more traditionally Western (as in Canadian/American) ways of love, marriage, schooling, work. Prejudice and discrimination against Chinese immigrants in Canada. Love vs. duty. First wife vs. live-in but unofficial wife. Husband vs. occasional lover. The value of land. The value of a house - and the risks of a fancy house in a down economy or during a revolution. Doing whatever is necessary (pretty much) to put food on the table. What that costs to oneself and one's children and other family members. Resentment over time - and eventually understanding, acceptance, and appreciation of those sacrifices.The maxim \"it could always be worse\" seems to apply throughout much of the book, as does \"where there's a will, there's a way\". I appreciated that the author tried to tell the story from both her side and the point of view of her family that stayed in China. It was not an easy story to read at times, but it was also not particularly harsh or violent. In all, it was probably a very typical story for many families."}, {"userName": "Louise", "userReviewDate": "Nov 04, 2011", "userURL": "http://www.goodreads.com/user/show/2143983-louise", "userReview": "Story Description:To me, China was what was left behind when the boat carrying my grandmother, pregnant with my mother, docked in Vancouver. China was the soil underfoot in the photograph of the two sisters who, as I thought then, would never meet the third, my mother. China was where you’d find yourself if you dug a hole deep enough to come out the other side of the Earth.THE CONCUBINE’S CHILDREN is the story of a family cleaved in two for the sake of a father’s dream. There’s Chan Sam, who left an “at home” wife in China to earn a living in “Gold Mountain” North America. There’s May-ying, the wilful, seventeen-year-old concubine he bought, sight unseen, who laboured in tea houses of west coast Chinatowns to support the family he would have in Canada, and the one he had in China. It was the concubine’s third daughter, the author’s mother, who unlocked the past for her daughter, whose curiosity about some old photographs ultimately reunited a family divided for most of the last century.”My Review:This was an exceptional work of family history that was well researched and well written. The story was utterly amazing, gripping and held my attention from the first page on. It took a great deal of courage for Denise Chong to pen this fictional memoir of her family and she made the story come alive against the backdrop of two widely different countries. It had a narrative flow that captured the essence of the truth.This was an intriguing journey that crossed all cultural boundaries. I’ll be keeping this book as part of my permanent collection. Excellent!"}, {"userName": "Allison", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/27047099-allison", "userReview": "I'm so glad that Denise Chong took on this project. The Concubine's Children chronicles a really interesting story of her grandparents' immigration to Canada, and the challenges they faced. It adds to the archives of the Chinese-Canadian experience, and it's important.But more than that, this is a story about life, expectations, aspirations and family ties -- and real observations on each of these. In these ways it reminds me of the wonderful novel (one of my favourites!) The Good Earth, not because of the China connection, but because of the commentary on humans' expectations on life -- and the dichotomies and also sameness between people everywhere. This book reads like journalism, like a long magazine article, and that makes sense, as that's really what Chong is -- a strong journalistic author. But having heard her speak at a writer's festival, I was so entranced by her intelligence and her commitment to her work, that I immediately bought two more of her books."}, {"userName": "Grace", "userReviewDate": "Nov 06, 2010", "userURL": "http://www.goodreads.com/user/show/2254007-grace", "userReview": "The Concubine's Children is a story about a Chinese family where half lives in China, the other half in Canada. It starts out with the author's great grandfather, and his dreams of bettering himself and his financial situation in Canada. It then follows the family through parts of their lives in Canada and China during the Sino-Japanese war, the Chinese Cultural revolution, the Great Depression that hit both Canada and America, and even the times of strong prejudice that the Chinese faced. Chong wrote the book as a compilation of her family's memories, and took a very non-sentimental tone throughout the entire book, even for what must have been emotional scenes of their lives. I thought it was well written, easy to follow the lives of those she collected the memories of, and very insightful to many parts of the Chinese way of life and attitudes. It is a great book for a Chinese history class. It would even work for a sociology or anthropology case study, really. It really gives an inside look to what a Chinese peasant class went through, and, for the most part, their apparent thoughts on what happened during those scary, unstable times of their lives forced upon them."}, {"userName": "Dina", "userReviewDate": "Jul 19, 2010", "userURL": "http://www.goodreads.com/user/show/819951-dina", "userReview": "It was a struggle on whether to give this book three or four stars; if I could I would give it three and a half stars. What kept it from being four stars was that I got a little confused sometimes between grandparents and parents and siblings, and also I got a little bogged down at times with the historical events of the time, although that was interesting. Nevertheless, this is an engaging story about a complicated family separated by distance and war. The struggles and pain suffered by everyone involved are communicated very well, and all the members of the family are presented as multi-dimensional, not simply as all good or all bad. I would say the last fifty pages are especially engrossing. The history of the Chinese emigrating to Canada and the laws that kept most of them from achieving the level of wealth they dreamed of was something I had not read about before. I also learned a lot about the Cultural Revolution in China"}, {"userName": "Sonja", "userReviewDate": "Jun 01, 2008", "userURL": "http://www.goodreads.com/user/show/937375-sonja", "userReview": "This is a memoir written by the grandaughter of the concubine. In 1913, her grandfather left his first wife in China to earn a living in Canada. He bought a Chinese concubine, and brought her to Canada to be with him. He returned to China when he could and fathered a sought after son with his first wife. Despite his decade's long absence, he supported his Chinese family, often times with money earned by his concubine in Canada.The concubine ended up being an abusive mother, alcoholic, and general tramp. Her first two daughters were sent to China to be raised by the first wife. Her third daughter stayed with her in Canada. She was left to raise herself while her mother was hitting the gambling dens and boozing it up.This is a great read. The only reason I didn't give it five stars is because the author would elaborate a little too much on current political situations in China, which I found boring."}], "description": "The Concubine’s Children is the story of a family cleaved in two for the sake of a father’s dream. There’s Chan Sam, who left an \"at home\" wife in China to earn a living in \"Gold Mountain\"—North America. There’s May-ying, the wilful, seventeen-year-old concubine he bought, sight unseen, who labored in tea houses of west coast Chinatowns to support the family he would have in Canada, and the one he had in China. It was the concubine’s third daughter, the author’s mother, who unlocked the past for her daughter, whose curiosity about some old photographs ultimately reunited a family divided for most of the last century.", "title": "The Concubine's Children", "url": "https://www.goodreads.com/book/show/231573.The_Concubine_s_Children", "average": 3.88, "cover": "https://images.gr-assets.com/books/1407032766l/231573.jpg", "reviews": 109, "authors": [{"url": "https://www.goodreads.com/author/show/135536.Denise_Chong", "name": "Denise Chong"}], "type": ["Nonfiction", "Cultural", "Biography", "Autobiography", "History"], "outlinks": ["http://www.goodreads.com/book/show/231573.The_Concubine_s_Children", "http://www.goodreads.com/book/show/2018885.The_Concubine_s_Children", "http://www.goodreads.com/book/show/24856058-concubine-s-children", "http://www.goodreads.com/book/show/2018887.The_Concubine_s_Children", "http://www.goodreads.com/book/show/2018886.Concubines_Children_Portrait_Of_A_Family_Divided", "http://www.goodreads.com/book/show/373992.The_Girl_in_the_Picture", "http://www.goodreads.com/book/show/6462568-egg-on-mao", "http://www.goodreads.com/book/show/17262112-lives-of-the-family", "http://www.goodreads.com/book/show/851408.The_Penguin_Anthology_Of_Stories_By_Canadian_Women", "http://www.goodreads.com/book/show/9486516-finding-the-words", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}