{"ratings": 476, "userreviews": [{"userName": "Pouting Always", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "I honestly am surprised by how much I enjoyed this, like when I started reading it I was bored as first but once she gets her mother's confessional I couldn't put it down. Like I had such a visceral reaction to everything that happened and even up until the end I felt like anxiety about it all. I think it got a little bogged down when we started reading the details of what happened after her mother left but I think the ending more than made up for it. I'm so glad he stopped where he did because it wrapped everything up nicely and I feel like if he had kept going I would just get bored again. It's a good suspense/thriller novel if anyone like's those kind of things they should totally check this out.Also has anyone else seen that devil picture from the codex gigas because it's not that great a picture but for some reason it still creeps me out."}, {"userName": "Dannii Elle", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/44487975-dannii-elle", "userReview": "I received this in exchange for an honest review from NetGalley. Thank you to the author, Luke Gracias, and the publisher for this opportunity.What does a suicidal nun, a winning lottery ticket, a paraplegic and a centuries-old missing prayer book have in common? This sounds like the beginning of a bad joke, but is actually the start of this queer and extraordinary tale.I was initially a little disappointed with this book. The knowledge the author imparted was phenomenal and the author was clearly well-versed in the history of the subjects covered. However interesting this was, it read more like a non-fiction than a thrilling tale, which I wasn't anticipating. But once this initially dense first section had concluded the thrills and suspense began to take hold of the plot.This became a dark and gory read and the author held nothing back in his portrayal of the immoral and the traitorous. This raw depiction of each horrifying scene is what made this come to life, in all its grim glory. The geographical settings and the historical fact were also written of so evocatively and sublimely that I felt I re-lived this book, rather than read it.This is a superb and original book but is definitely not one for the faint-hearted, due to some of the brutal and possibly triggering topics covered. The cliffhanger ending had me eager for a conclusion to this epic tale. With none yet announced I am struggling to see how this ending is fair on the poor nerve-wracked readers!"}, {"userName": "Maxine (Booklover Catlady)", "userReviewDate": "Aug 20, 2016", "userURL": "http://www.goodreads.com/user/show/22943325-maxine-booklover-catlady", "userReview": "This is a book that you want to read with no preconceived ideas in mind. Just dive on in and start turning the pages. This book was so much better than I expected and one I enjoyed for lots of reasons. Let me share some.If you like books like The Da Vinci Code, those with secret sects, religious secrets and conspiracies and seekers of truth that find the dark side is a very real thing you will love The Devil's Prayer.Europe - Ancient monasteries, nunneries, secret corridors, locked away libraries, ancient religious books and texts is what we are immersed in at the start of this fascinating novel and it hooks you pretty fast. I was intrigued and all settled in when....We are in Australia, the stunning Gold Coast (know it well I lived in Brisbane for many years), immersed in family life and I'm wondering what on earth the connection may be. The connection is huge but is not revealed too early in it's entirety. We get drip fed twists, turns and messages as we read on the writing style used is really effective.There are some harrowing scenes concerning rape and nasty murders that I didn't see coming and it showcased the authors versatility with writing as at times the two storylines that eventually merge into one huge plot seem so very different. I enjoyed moving between the two. These scenes are intense, unexpected and critical to the plot. The author could jump to crime fiction in a heartbeat!It's been predicted that the child of the devil was to be born at a certain time in history. That signs would indicate the date of this dark birth. You've got to be careful if you make deals with the devil. He makes you keep them.There are fascinating tales of history weaved in from papal scandals and events, prophecies of saints and monks and Nostradamus. Genghis Khan and his army annihilation of countries, lands and people, the finding of the missing gospels of the bible and other key texts and then a very, very coveted book that is central to the search for one woman, a destiny call no matter how HIGH the price. Totally fascinating. I kept googling dates, names, events to see what was true and what was fiction!Murder, mayhem, the prince of darkness, secrets, lies, danger, conspiracies - it's all here cleverly blended with history and modern day. I was following the journey with utter fixation. Eager to know the outcome. The world depends on it.It's a well written book, and to be honest I wasn't sure if I would like it but I did, I really did. It's one of those where I would recommend it to fans of any genre as it covers so much. My criticisms are slight - I don't think the cover does this book any favours. Knowing how much a cover draws many readers I think it gives too harsh a message even though you learn about what the image is all about. I think a cover with a more mysterious thriller \"feel\" will attract more readers as the plot will draw them next. I'm worried between the title and the cover too many will pass thinking it's all about satanic worship which it's not, not in the way many think.My only other criticism was in parts it felt like a LOT of dates, names and periods of history are shared and it's interesting but a lot to digest. I think spreading this would read better.Despite those minor issues I was thrilled with this book and give it 4.5 stars, almost a 5.0. It's a book you might want to pop on your to-read list and let yourself be surprised by. I bet it's nothing you'll expect.How far will one mother go to protect the daughter she loves? How far? What about you? If you were in her shoes. Characters are great in the book! Very well-developed and deliciously complex are some of them. So many fascinating moments to share with both worldly and other-worldly folk. Fancy something a bit different that will entertain? The Devil's Prayer will do just that.Thanks to the author and publisher for my copy of the book to read and review via NetGalley.Thanks for reading my review! For more of my book reviews, plenty of awesome books to win, author interviews and features come over to join me for book fun at: https://www.facebook.com/BookloverCat...To follow me on Twitter: https://www.twitter.com/promotethatbookTo enquire about joining my reviewers team: http://goo.gl/forms/GWMOvlofZgFinally to enquire about my book publicity services: http://goo.gl/forms/eVwa2HFKnK"}, {"userName": "Dianne", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/7395171-dianne", "userReview": "When Siobhan Russo saw the face of the nun who had just committed suicide, she saw the face of her mother, a woman who disappeared six years before. This revelation sends Siobhan on a journey to discover what happened to her mother so many years ago. What she finds is a confession of sorts, a plea for forgiveness from her daughter and the history that led her to run far away. Do you believe in a power beyond our comprehension? Do you believe that if there is a God, there is a Devil? Everyone has heard of making a deal with the devil, the cost is your soul, or in the case of Denise Russo, the soul of her oldest daughter, should she fail to hold up to her end of the bargain.Her story started long ago, on the night that held one of the most grievous betrayals a person can face. For Denise, it was a night of torture, as she became the victim of some of the most vile and heinous crimes against a human being. Left for dead, she miraculously survived, paralyzed, mute and powerless to seek justice. That is when he came, the Devil, himself with a promise of revenge for Denise against her betrayers, the animals she once thought of as friends, including the man she was supposed to marry.The cost of that revenge was high, her daughter’s soul if she failed. The only aid she was given was the use of her body once again, but only at night. By day she would once again be trapped within her mind and useless body. But is the Prince of Darkness to be trusted or has he used Denise for something far more heartbreaking and soul crushing? Was she to become the vessel to birth the devil’s own child?Siobhan also finds throughout this gut-wrenching tale that an ancient and mythical message, is tucked between the pages of her mother’s posthumous confession and now there are those who will stop at nothing to take it from Siobhan.Follow along as both Denise’s tale and the ensuing tale of Siobhan’s desperate attempt to live culminate in a tale of horror, pain, revelations and loss as she realizes she has become entangled in a battle for her very soul.Brutal, raw and repulsive details come to life under the dagger sharp pen of Luke Gracias as he unwraps his unholy tale of revenge and regret in The Devil’s Prayer> High on tension, graphically descriptive action, we are thrust into the nightmare this writer has created. Definitely not for the faint of heart or those who are susceptible to night terrors, Mr. Gracias has brought dark fiction to life, blending fact with fiction and conjuring up a tale that in itself is a masterpiece of terror. Never has revenge seemed so repulsive, yet, never has turning the other cheek seemed so impotent. Prepare to be scraped raw and left shuddering by this powerful author.I received this copy from Luke Gracias in exchange for my honest review.Publisher: Australian eBook Publisher (February 18, 2016)Publication Date: February 18, 2016Genre: Horror | OccultPrint Length: 293 pagesAvailable from: AmazonFor Reviews & More: http://tometender.blogspot.com"}, {"userName": "Wendy", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/1418580-wendy", "userReview": "The Devil's Prayer, by Luke Gracias, whisked me away into a world of horror that genuinely scared me.The story begins with a nun committing suicide in front of thousands in Spain. In Australia, Siobhan Russo recognizes the nun as her mother, Denise Russo, who disappeared 6 years ago. In search of answers Siobhan travels to the secluded convent where her mother had lived. Here she discovers Denise's final confession, a book that details betrayal, torture and her near death at the hands of her trusted friends and her subsequent deal with the Devil to get revenge on those responsible. In this desperate pact made with the Devil, she wagered Siobhan's soul. Siobhan learns that hidden within the pages of her mother's confession is part of The Devil's Prayer, an ancient text with the power to unleash apocalyptic evil. Can Siobhan escape those determined to get the Prayer back?The history and theological lore is very well researched, the imagery is extremely vivid and the storyline is both spine chilling and thought provoking.The Devil's Prayer, by Luke Gracias, is his debut novel. It is a thrilling, frightening ride and I can hardly wait to see what he comes up with next.Thank you to NetGalley and Australia eBook Publisher for an arc of this novel."}, {"userName": "Jason", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/24154009-jason", "userReview": "*My first NETGALLEY book review!*Received an advance reader copy in exchange for a fair review.This novel reads like an adult fairy-tale. At it's core, it's just a story about morals. It's a story about the clash between good and evil, God and the Devil. The main arch of the story is as follows: A woman wins the lottery and is brutally raped and beaten into paralysis, and it's all done by her closest friends. In order to regain her ability to walk, she cuts a deal with the Devil, and in return for her ability to walk she must kill every one of her friends who wronged her in their pursuit of riches. THIS WOULD HAVE BEEN INTERESTING ENOUGH. Alas, the author continued. Years before the woman became paralysed, she gave birth to a child, who just so happened to be the antichrist (i.e. she had a baby with the Devil). That's the germ of the idea. But, the author takes it one step too far (in my opinion) and tries to link this - rather loosely - to a historical text called the Devils Bible, inside which is the Devil's Prayer, which must be located and read by the child that is his, in order to....ahh hell, I have no idea what the outcome was really supposed to be - I think the apocalypse or something? There are parts of this novel that are exceptional, and there are parts that are poorly executed. For me, the novel is broken into 3 sections, or thirds. Here's a breakdown.The first third of this novel reads like a Dan Brown novel. When I first got going, I couldn't put it down. I was hooked and I was intrigued as early on as the first few pages. I kept thinking to myself, \"FINALLY, I've found the next Da Vinci Code!\" It was full of interesting lead ups, suspense, and mystery, and set itself up nicely for the next 2/3's of the novel. It took on the role of historical-religious thriller and ran with it. This section of the novel took place present day.The second third of the novel took an unexpected twist. It felt a bit disjointed from the first third of the novel. This section was almost solely a flash back in time. It examined what happened in the main character's life to lead up to those present day events that so fascinated me in the first section of the novel. But, in this section, the genre takes a sudden turn - into murder mystery/horror. That said, I was still interested and entertained at this point. There were links and clues as to how this all added up, and I just couldn't wait to get to the latter part of the novel to see what the outcome was going to be. Which leads to:The third third of the novel. This is where the novel dropped dead. This last section of the novel was flat. It was, essentially, just an information dump of historical fact and fiction. The novel returned to its historical-religious roots (from which is began in the novel) but lost the entertainment factor in the meantime. I also just didn't keep up with what the hell was happening at this point. I was no longer really sure what this Devil's Prayer was supposed to do, or why it really needed to be found, or who was supposed to find it, or why the nun in the beginning killed herself in the first place.And right at the very end, in the last few sentences, the author drops what was - I'm assuming - supposed to be some bombshell cliffhanger. Mostly, I felt annoyed that I'd just read hundreds of pages for nothing to be resolved. In the end, it had all the makings of the next Da Vinci Code, but it was poorly executed and disjointed. It was obvious to me that this began as a screenplay and was adapted into a novel. There are no problems with that, except that when you go from screenplay to novel, you must tread carefully, or you lose the reader. They are two different things, screenplay and novel.3 Stars. It was great, then good, then bad."}, {"userName": "Matt", "userReviewDate": "Dec 17, 2016", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "First and foremost, a large thank you to NetGalley, Luke Gracias and Australian eBook Publisher for providing me with a copy of this book, which allows me to provide you with this review.Luke Gracias offers readers an interesting novel that seeks to mix the foundations of religious belief--both the goodness of a god and evil of its great nemesis--with the human understanding of bartering for a particular outcome. By placing these themes within a modern setting, the reader is better capable of understanding the story and relates with ease. After an eerie preface, the novel opens in a small Spanish town, with one Sister Benedictine trying to locate The Devil's Bible, which contains a prayer that appears to hold much importance. After copying a few pages of the prayer, in complete secret, Sister Benedictine is able to hide it away with a journal of her own within her convent before being chased by a group of monks wielding swords. Trapped in a bell tower, Sister Benedictine takes the only path she has and ends up hanging from the bell's rope, in an apparent suicidal act. On the other side of the world, Siobhan Russo learns that her mother has died in Spain, after abandoning the family for six years. While Siobhan is curious as to what happened to Denise Russo (the actual name of Sister Benedictine) all those years ago, she is unsure what to expect. Siobhan's sister, Jess, wants nothing to do with her mother, though Siobhan feels she owes it to the entire family to explore what might have happened. Travelling to Spain, Siobhan is granted access to a vault where her mother held some key documents she willed to her eldest daughter. Siobhan receives the journal, which her mother called The Confession, and agrees to read it in order to learn more about what happened all those years ago. This confessional journal dates back to the early- to mid-1990s, when Siobhan was a young girl. Denise Russo was a single mother who tried her best to raise a daughter she loved more than life. After a traumatic event, Denise made a deal with a truly diabolical man, who forces her to trade Siobhan's safety with a pledge to commit numerous crimes. Feeling that she had no choice, Denise is led down a path of truly alarming proportions, but never strays from the promise she made. As Siobhan reads of these events and the eventual birth of her sister, all becomes a little clearer while also extreme muddled. An ancient sect of red-clad monks remain on the lookout for Siobhan, forcing her to remain in hiding and return to Australia with a secret that could tear her family apart. Her arrival opens new and horrific possibilities, just as Gracias keeps the reader in suspense with a major cliffhanger. A wonderfully crafted novel for those who love an evolving and dramatic narrative that takes twists as it tries the reader's personal faith.This being the first piece of writing I have ever encountered by Luke Gracias, I was unsure what to make of it. While the opening few chapters took a little time to grasp me, by the time the story entered 'The Confession' section, I was completely hooked. Gracias pulls on many time periods and uses strong characters to tell his story, layering both the narrative and character development throughout. His use of strong religious history plays perfectly into the larger story and, should it hold some degree of truth, the reader must wonder about this darker side of religious acceptance. Whereas many will turn to the god of their choosing and make promises for specific results, could the same not be done in the face of a diabolical being, the antithetical deity? Exploring the role this character played in shaping history, Gracias forces the reader to shelve their preconceived notions and potentially accept that there is an evil pulse that is steering world events alongside the goodness of some Higher Being. The powerful and plausible story is accentuated with the lengths to which a parent will go to save their child and face the consequences of their actions. Told primary to convey the life and times of Denise Russo, the addition of Siobhan and, to a lesser extent, Jess, allows Gracias to paint an extremely disturbing picture while flirting with safety for those who are not entirely ready to let go of their belief in goodness.Kudos, Mr. Gracias for this stellar piece of work. I cannot wait to see what other ideas you have percolating for your growing fan base.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/"}, {"userName": "Jess ❈Harbinger of Blood-Soaked Rainbows❈", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/7125124-jess-harbinger-of-blood-soaked-rainbows", "userReview": "This book was garbage. Truly. Garbage. Complete and utter Shite.Where do I even start? How about with the fact that this book bumped A Separate Peace off my \"bottom 10\" list (one of the absolute worst memories of tenth grade) Or that I would rather be trapped on a desert island with only The Twilight Saga to read for the rest of my life rather than read one page of this crap again. Or that this book is worse than Angels & Demons AND The DaVinci Code. Combined.I seriously mean no disrespect to this author or the people who loved this book, but I'm honestly stumped as to how this book has an average of 4.1 with 44% of readers rating it with 5 stars and only 2% rating it with 1 star. What the actual fuck here, people? Did we read different books? Or is this a case where people are lying about how great it is because it's a self-pub? I mean, I read a lot. I have rated very very few of the books I've read as 1 star. And not only did I rate this as a one star, but I will go to say that this is not only one of my bottom ten books of all time, but one of my bottom five. Ever. And I know shit when I read it.I'm not lying when I say that this novel is one big fat giant infodump followed by like 6 more big fat giant infodumps. Sister Benedictine is a nun in a Spanish abbey who has taken a vow of silence. She sneaks out of the abbey one night and into a neighboring monastery where she finds a hidden book and starts copying it into her notebook. She is caught by the red-cloaked monks and chased from the grounds. She frantically leaves the abbey and heads into the town and into a church where she mysteriously enters a rectory, leaves, is caught by the same red-cloaked monks, locks herself in the church's bell tower, and promptly hangs herself. This all happens in the first ten pages of the novel, and is the most exciting thing to occur.Meanwhile, in Queensland, Australia, the nun's family is informed of both her death, and the fact that she was a nun in Spain. You see, Sister Benedictine (whose real name is Denise Russo) left behind a mother and two daughters in Australia six years ago. This is the first any of them have heard of her whereabouts. And her oldest daughter, Siobahn, receives a letter from her mother via an old priest telling her to go to Spain. So she does, and she finds her mother's journal, entitled her \"Confessional.\" And begins to read it. And so the ENTIRE book is basically Denise's \"Confessional,\" interspersed very sparsely with Siobahn's journey in Europe. Dear author, This tactic is called an INFO-DUMP. And it epitomizes lazy storytelling, plot-holes, unrealistic narratives, and a lack of creativity.But let's put the obvious problems I had with info-dumping aside for a moment. Because even if the author found a more creative way to tell his story, I would still hate it.Denise's story begins when Siobahn was a baby. Siobahn almost drowns in a pool and is saved by a mysterious stranger with a gray fedora. This man disappears until years later on Denise's twenty-eighth birthday when she tells a tale of complete betrayal by her friends and loved ones that basically ends up with Denise in a hospital bed as a quadriplegic who cannot talk and her so-called friends who abandon her afterwards. This story is completely ridiculous. I cannot even understand how an author can a)make this story up and b)think that anyone would find it plausible. It is so farfetched, even Michael Bay would roll his eyes at it. I rolled my eyes the ENTIRE WAY THROUGH.And then afterwards, our novel shifts into a revenge story as the man with the fedora shows up AGAIN. And guess what????? (spoiler alert) he is the Prince of Darkness himself.So Denise makes a deal with the Devil and so her soul is damned. He tells her he will restore her body and voice if she kills all the people who had wronged her.(spoiler alert) She does.And as a result, she has become pregnant with the ACTUAL spawn of Satan himself herself.And then it becomes a supernatural/religious thriller as Denise must figure out how to live with the fact that her daughter is the antichrist. And Siobahn must figure out how to deal with the fact that her sister is the antichrist.Hooked yet? And then as it turns out, the Devil isn't so happy that Denise wants to get rid of his spawn. So he tells her to go away or he will kill Siobahn. So she goes away.And THEN, if that isn't enough for ya.......this book turns into yet ANOTHER info-dump on Gnostic Christianity when Denise becomes a nun and meets Father Jakub who takes her to Egypt so she can learn all about the Nag Hammadi. And then we get pages and pages and pages and pages and pages and pages of historical crap about the Crusades and ancient texts and the Devil's Book. And the thing is, it doesn't strike me even as heavily researched historical crap. I learned the exact same things this book was telling me with a 5 minute foray into the wide and wacky world of And then it happened. The thing happened that made this book go from a 2-star \"kinda boring and badly constructed meh novel\" into a 1-star \"worthy of Jess rage novel.\"This book got an agenda.Most of you that know me know that my number one pet peeve with books is when authors use fiction as a way to push their own agendas. My number one worst book of 2016 did this. Remember Mermen, the book every single one of my friends one-starred? It used the illusion of a smutty romance in order to send the message that we should save the ocean. Well this author used the cover of a revenge thriller involving the antichrist in order to push his own agenda of human greed, global warming, and other environmentalist bullshit. Thank you, but no.Father Jakub takes Denise to a place where the Nag Hammadi's Thirteenth Codex is kept. A codex he claims is written in hieroglyphics that tell a tale of how humans are greedy and are ruining the earth, killing all of the animals and plants, destroying the air and the water, and making the weather change drastically. First of all, WHY THE FUCK IS THIS EVEN INCLUDED IN THIS NOVEL? Second of all, IT ISN'T EVEN TRUE! Let me explain.The entirety of the side story rubbed me the wrong way, and so I decided to do my own research via the internet (only credible sources) and also my dad who was a religion and philosophy major in college and who knows a SHIT TON about many of the world's religions, particularly Christianity and its various offshoots. The Nag Hammadi is not a mainstream Christian text, but a text of Gnostic Christianity which is not recognized by mainstream Christian religions, particularly the Catholic Church. Have any of you seen the movie, Stigmata? For those of you that have, the alternate gospel in that movie is an example of a Gnostic text. And as correctly stated in that movie, it's number one enemy was the Catholic Church. SO WHY THE FUCK IS A CATHOLIC PRIEST TEACHING ITS MESSAGE TO A NEW NUN?And also in my own research I discovered that the author totally made up everything that's in the Thirteenth Codex of the Nag Hammadi anyway. I know this because I actually read it. And it contains words, not pictures, and does not preach against nor does it prophesize the catastrophe of global warming. Making shit up is what fiction is all about, but when you need to make shit up about an actual historical document or artifact in order to make a point, then that, my friend, is called AN AGENDA. Ask Dan Brown about this. He knows all about it. However, even I have to admit, Dan Brown wasn't nearly as brazen or as indelicate in making up the shit for his novels. This book almost makes me want to go back and rate his two crap novels I read higher.Almost.And so I say fuck you to this book. I skimmed the last 20% because it was boring and it pissed me off. All of my friends know how much of a completer I am, but I will not be picking up this book's sequel, nor will I ever pick up anything else this author ever writes. I would rather read the sequel to Mermen.I received a copy of this book from Netgalley in exchange for an honest review."}, {"userName": "Erin Clemence", "userReviewDate": "Dec 17, 2016", "userURL": "http://www.goodreads.com/user/show/16907451-erin-clemence", "userReview": "In “The Devil’s Prayer”, by Luke Gracias, a nun commits suicide in a bell tower during a festival in Spain. In Australia, a young woman (and our protagonist) Siobhan, recognizes the nun as her mother, Denise, who disappeared years ago, abandoning her and her younger sister. In her quest for answers, Siobhan travels to Spain and uncovers her mother’s diary- detailing a horrific incident that happened to her as a young adult, and the great lengths Denise went to to seek revenge, including making a deal with the Devil himself. As her journey continues throughout Spain, Siobhan soon realizes that her mother’s diary (now in her possession) has put her life in danger and she seeks out religious figures from her mother’s past to help her on her quest. I initially set out to rate this novel a four, but the last one hundred pages of the novel made me change it to a three-star rating. Initially, I thought this novel had been translated to English from its original version, as the writing was choppy and awkward and the sentences seemed disconnected and just plain short (turned out not to be the case). When I adjusted to the writing style, I began to get into the novel. The beginning of the novel started off slow, had an addicting, fascinating middle, and fell short at the end. The last one hundred pages (as mentioned above) were in fact so boring, I almost didn’t finish the book. I loved Denise’s quest for revenge, and her dealings with the Devil. This part of the novel was captivating and intriguing, and it left me wanting more. When Siobhan follows her mother’s trail to Spain, using Denise’s journal as a guide, the awkwardness of the writing continues, but it ceases to matter as the storyline is just so good. During the latter part of the book, when Denise (through her journal) is telling us about her trip through various monasteries in Spain and her own quest to find the “Book of the Devil”, I felt like I was reading a history text. In fact, I skipped several pages due to their dullness (I kept reading on, thinking “I’ll skip this part until I get to a better part”…..ten pages later). The history of various religious events in the past did not interest me and were not relevant to the story, and I would’ve preferred if these parts had been left out completely. The ending was a cliff-hanger, which leads me to believe there is another story to follow. This is unnecessary as, in my opinion, if the dull parts had been left out of the novel, Gracias could’ve focused on the interesting points and finished the novel in one fell swoop that would’ve been way more pleasurable. The choppy writing and the dull historical (and irrelevant) facts that took up a large portion of this novel, made it difficult to relate and connect with the characters. I do not care enough about this novel to read the sequel. Denise’s quest for revenge was this novel’s saving grace, and is the only thing keeping this novel dangling on the edge of a three-star review. Thanks to NetGalley and the publisher for a free electronic ARC of this novel, received in exchange for an honest review."}, {"userName": "Montzalee Wittmann", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/32532051-montzalee-wittmann", "userReview": "The Devil’s Prayer by Luke Gracias is a very exciting and chilling read! I made the mistake of thinking I would read a LITTLE of it before going to bed then could not STOP! I finished in the early morning hours, I HAD to finish the book! It pulled me in from the beginning and would not let me go. A nun is chased by red robed priest that are trying to kill her for sneaking a peek at a book that is locked away in a secluded room. She ends up killing herself in public before they can get to her. She wasn't always a nun. She ran away six year prior and told no one she was leaving or why. She left two kids and her mother. Why, well this is what the book is about, oh boy, it is soooo devilishly good! It is full of mysteries, revenge, gruesome violence, (most of the violence the reader really cheers for-Yes, yes you will!), paranormal activity, suspense, intrigue, creepy happenings, and so many other things I can't mention because I don't want to spoil it for anyone. This is a book for the paranormal, horror fan out there that needs a good book to read. This is a book for someone that needs a change of pace. Wonderful plot and lay out. Full of surprises!!! Wow. I would give this more than 5 stars if possible. The characters are so unique and .... creepy, interesting, different, and yet real, all of course except the paranormal ones ... and they seem to linger in the readers mind. I will be watching for book 2, he HAS to write book 2!!! Thank you NetGalley for letting me read this amazing, chilling, horrifying book that kept me up all night! I loved it!The sequel is scheduled for December 2017 and you can see the amazing locations of The Devil’s Prayer at www.devilsprayer.com.au"}, {"userName": "Jamie", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/40898015-jamie", "userReview": "I could not put this book down. What a roller coaster of a horror story. We start off the book with a monk, Herman the Recluse, in the thirteenth century. He has been condemned to death by being walled up alive. As a way to escape this horrific fate, Herman says that he will write a book “filled with human knowledge that would glorify the monastery forever”. The monks agree, thinking this could never be done, and allow Herman to try. By the end of the night, with a little prayer to the Devil, it had been completed and would be known as the Devils Bible. After seventy years of the Devils Bible being hidden away in a trunk with a key, it was finally opened, to discover that 12 pages in the back were missing, the “the Devils Prayer”.After a nun commits suicide, Siobhan discovers that it was her mother who, six years ago had suddenly disappeared, with no goodbyes. With only a note left to her by her mother saying “Come to Zamora. Tell nobody”, Siobhan sets out to uncover the truth about her mother; why she had disappeared and from what. This is a story about betrayal, revenge which had led to rage, guilt, and then heartbreak. There are some great horror scenes, and gore throughout as well. Warning-some trigger words and actions throughout: rape, sex, drug abuse, torture, suicide, and murder.I received a copy of this book through NetGalley for an honest opinion. My thanks to Luke Gracias and Australian eBook Publisher for the opportunity."}, {"userName": "Bill Kupersmith", "userReviewDate": "Aug 20, 2016", "userURL": "http://www.goodreads.com/user/show/12460952-bill-kupersmith", "userReview": "A blurb tells us that admirers of The Da Vinci Code will enjoy this book. As I am immune to the genre of Vatican hit-men, I’d not have begun The Devil’s Prayer had it not been @ the suggestion of a GR friend, & never had stayed with it had not the earlier part been set in Australia, specifically Queensland. By the time the Devil (that’s right, Auld Hornie himself, wearing a fedora hat – when I was young wearing hats was something Australian men did) I was firmly hooked & had to see this one through to the end. The story is told in two time frames through the device of a diary, found @ an austere Spanish convent (they go in for penitential rites like flagellation) by a young woman named Siobhan, whose mother Denise had sold their souls to the Devil in exchange for wreaking revenge on her ‘friends’ who live on the Gold Coast who raped her, tortured her, & left her a quadriplegic to obtain her winning lottery ticket. After receiving diabolical cure (the Devil is good with spinal injuries), Denise travels under the mentorship of an elderly priest to a monastery in the Middle Eastern desert when she learns to copy ancient manuscripts containing terrifying prophecies (for reasons I don’t understand, one contains ancient illustrations of future environmental catastrophes, but with English captions In contemporary script – any 2nd year Greek student could have provided more authentic-looking labels).Since mum is damned anyway, I’d thought she’d have chosen just to have fun rather than undertaking this austere regimen, but apparently daughter Siobhan gets damned too if she doesn’t. If you are old enough to remember such classics as Rosemary’s Baby (right, Siobhan is not Denise’s only child, there’s also Jessie, conceived by Satan in the guise of Denise’s husband Simon whilst she’s about to kill him), The Omen, The Seventh Seal, as well as Dan Brown’s opus, you’ll be on familiar territory with The Devil’s Prayer. Tho’ even the most bizarre forms of folk Catholicism are staid by comparison, popular supernatural fiction & movies are supplied with an idiosyncratic heretical theology of their own. Basically it’s Manichaean, a label secular journalists like to slap onto any Christian who can tell right from wrong, but which properly means the belief that not only does Satan enjoy equal footing with God, but that so far is our earthly life on this planet is concerned, runs the whole show. On the mundane level, in popular culture the Vatican employs an elite secret service capable of the most elaborate skullduggery. (Remarkable for a mini-state apparently incapable of running a high-street bank successfully.) Here they are called the Amalrican Monks (hardly very secret as they go about in bright red habits seizing young women @ railway stations) named for Arnaud Amalric, a nasty Cistercian who played a role in the Albigensian Crusade.There is just enough information about real manuscript finds & scriptoria – I confess I’d never heard of the Codex Gigas before, sounds interesting – to provide a plausible flavor to this almost hilariously OTT tale. I wish the author Luke Gracias had thrown in a little Latin (‘Caedite eos. Novit Dominus qui sunt eius’ would have done nicely’) & Greek to flavour a very spicy pot, tho’ the ingredients are overcooked & a bit past their sell-by dates."}, {"userName": "Bam", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "\"To believe in God, we must believe in the existence of the Devil. Without the Devil, religion has nothing to offer. Salvation means nothing if there are no repercussions to evil.\" This book is a mix of historical fiction, thriller and horror with some pretty graphic, explicit scenes of violence. The author says about 95% of the history is true. The Devil's Bible is itself a true relic of medieval times, huge in size, containing 322 sheets, from which 12 sheets have been removed--supposedly containing the Devil's Prayer. If that prayer is ever read, it is predicted it could unleash the apocalypse.The plot is gripping and exciting with lots of twists and turns. I especially liked how the author relates the current crises caused by climate change and global warming to the End Days predicted in the Biblical Revelations. Although this book comes to a satisfying conclusion, there is (hopefully) more to come. I'm looking forward to the sequel which the author says he hopes will be out in December of 2017. I am grateful to the author for granting access to a free ebook copy of this book through NetGalley in exchange for an honest review and hope the author is soon able to find a publisher for his work."}, {"userName": "Sofia", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/14453898-sofia", "userReview": "I did not finish this book and this is whyI knew from the first that the storyline was not one I like to read about but I was willing to let myself be surprised by being out of my usual zone so I decided to give it a try when my friend pointed it out to me. So my liking the book all depended upon the writing, how it was able to draw me into the story. Unfortunately it was apparent from the first that the writing was not a match either. I found it a lot of tell with no show. We are told what happens (lots) but very little inner narrative that is what makes me part of the story.So I've decided to part ways.An arc gently provided by author/publisher in return for a review.An attempted BR with Lena - hoping for better luck next time."}, {"userName": "Zippergirl", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/51388360-zippergirl", "userReview": "\"Religion is like a knife: in the hands of a surgeon, it heals, but in the hands of a murderer, it kills.\"Death knells of the thirteenth century ring into the present day. This dark historical fiction reveals the legendary and supernatural origins of the Devil's Book; later hidden away in a monastery in today's Czech Republic and guarded by a secretive order of monks. Twelve pages, known as the Devil's Prayer, with the potential to end the world as we know it and bring about the reign of Satan, have gone missing. One nun, committed to a vow of silence, risks her life to keep the manuscript out of the wrong hands. Her story is told through her confessions, to the only one she can trust with her (very) shocking and terrible secrets: her daughter, who takes her mother's Bible and a change of clothes and sets off to an isolated convent under the guidance of a mysterious priest.The settings are beautifully rendered, from hidden passageways in centuries-old convents and monasteries, to churches and ossuaries decorated in bones. (See them at the author's website.) This book should appeal to fans of classics like The Exorcist and Rosemary's Baby, and the more recent DaVinci Code. Caveat: There are many mysteries left unsolved at the end of the book, which ended abruptly. Presumably a sequel is in the works. I received this book in exchange for an honest review."}, {"userName": "Maggie", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/305395-maggie", "userReview": "Scrappymags 3 word review: Clunky, disappointing adventure.Shortest summary ever: Siobhan's missing mother turns out to be a nun who commits suicide at a festival in Spain, so Siobhan travels there and uncovers a confession book left to her by her nun-mother that details a deal she made with the Devil years ago. On top of that, there's an ancient text called The Devil's Prayer, hidden inside that has caused death and destruction for centuries. Now she's being chased and looking for answers.What’s good under the hood: The sad fate of this book for me is that I was mostly with it for the first 70% of the book. I enjoyed the mystery/thriller part (despite a few issues I address below), and was anxious to read more, and would use the word \"riveting\" in places. I was even a little freaked out (in a good way) with the whole Devil aspect. YIKES. In the vein of \"The Devil and Tom Walker\" and \"Young Goodman Brown\", this story starts out with such a great storyline and wonderful pacing, that big question - What if the Devil was REAL and RIGHT HERE? (Yeah, there's where the \"YIKES\" comes in.) Also, I LOVE a good revenge theme (who doesn't, right?) and man - this book takes it to a sick (as in mentally sick) level. That I liked. I do see massive potential in this author, but please please obtain a quality editor.What was bad or made me mad: Then I got to about 80% into the book... and it went to hell (no pun intended). First things first - in many places the writing is plain clunky, with many mistakes and questions that don't make sense and badly need an editor. Mostly, they are little things that I don't think I'm overly astute in catching, like someone who just moved (all possessions are in boxes) yet the new address is conveniently in the phone book? Or worse, being raped, no feelings about that expressed, no narrative, and two nights later willingly having sex with someone else and no thoughts of being assaulted two nights prior. Simple questions as to why a detective wouldn't test a rape kit from all of the people present with the victim the night someone was attacked? But I could semi-overlook these faux pas as the book paced nicely and a mystery brewed, until about 80%, then everything turned into this rushed historical fiction narrative that jumbled and bogged down much of the history being conveyed that it was impossible to connect to the prior narrative I was reading. It was like the main character - BAM - had to learn thousands of years of history in the last 20% of the book and then the ending was lame. To be honest, it made me mad!!! It's like two totally different books. I wanted to know what happened with Siobhan - what did she do next? How did she deal with her family? It's supposed to be a stand-alone novel, but the jumble just... ends, and not in a good \"ooooh that's a cool ending\" way, but more like a \"I don't know what to do so... the end!\" way, and it was infuriating.GOODREADS rant coming...The other thing that made me mad are the Goodreads reviewers on this book - yet again, I call FOUL to the hordes of \"honest\" reviewers out there giving this 5 stars. No. Effing. Way. This ALWAYS happens with ebooks (not publisher books, shocker) and yes, I've become a bona-fide skeptic of reviews of all ebooks because of this shady habit. Hey - I'm sure some people liked it, but comparing it to the Da Vinci Code? Um... NO. And what's even shadier is how many \"reviewers\" are ALLLLLLL comparing it to Da Vinci Code and Rosemary's Baby... weird huh? Why would all of these \"reviewers\" use the EXACT same books to compare? Hmmm... Funny I know both and uh.. no. Da Vinci was quick, sharp and one of the fastest reads out there. History mingled with a thriller done WELL. This is the opposite of that. Unless these are people who just joined NetGalley who are merely trying to get to their 80% and build up a rep and feel they HAVE to give positive reviews (hello? HONEST reviews people!!). I go to the book-fan app Litsy as well as other book-talk sites and wow, on those sites nearly everyone has posted the same critiques as I... isn't that... strange? (Insert my smirk). I'm massively sick of the \"plant\" reviews. Please stop!Recommend to: It might appeal to those who like Biblical lore/mysteries, ancient texts, stories about the church throwing shade...Thanks to NetGalley and Luke Gracias for an ARC in exchange for this honest review. I know it's painful sometimes, but it is honestly how I feel."}, {"userName": "Miriam Smith", "userReviewDate": "Aug 27, 2016", "userURL": "http://www.goodreads.com/user/show/35740838-miriam-smith", "userReview": "I really enjoyed this religious historical horror/paranormal book which was interesting, intriguing and in my eyes thought provoking. I loved the idea that you could trade souls with the devil for a deal for yourself. The book comes with a warning that it contains violence and rape etc, I personally did not find it needed this warning, I expect horror and crime books to contain violence and sometimes gore and as for the rape scene, yes this was very uncomfortable to read but in my opinion this just shows how much the author has put into getting the emotions across relevant to the scene. On a slight note though towards the end I found the historical religious facts a little heavy - dates, names, places etc but understood they were relevant to the whole story and happily look forward to the follow up book, I would dearly love to know what happens with Jess, Siobhan and the devil! Great book Luke, well done."}, {"userName": "Lisa", "userReviewDate": "Jul 21, 2016", "userURL": "http://www.goodreads.com/user/show/53479181-lisa", "userReview": "“The Devil’s Prayer” is a phenomenal book that makes you want to read it over and over again. The author blends history and fiction into a cocoon of reality that leaves the reader wondering what was historical and what wasn’t. “The Devil’s Prayer” is extremely well researched with no shortage of details. A mixture of “The Da Vinci Code” and “Rosemary’s Baby”…. Highly recommend this new favorite of mine.  Thank you to NetGalley, author Luke Gracias, and Australian eBook Publisher for an ARC of The Devil’s Prayer by Luke Gracias, in exchange for an honest review."}, {"userName": "Uma  ♥ Books.Bags.Burgers.", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/59490976-uma-books-bags-burgers", "userReview": "Note - Explicit content warning. This book contains explicit content and triggers for rape, murder and brutality.\n CHARACTERS \nThis is an unusual book and therefore I'm not quite sure what to talk about the characters in it. All I can say is that every single character is complex and not what they seem at first glance. I've never read about a more complex set of characters in any book. This book despite being supernatural in nature, is rooted in reality; rooted in the base nature of humans; rooted in greed that drives many a people to insanity. Although, Siobhan is the main character of the book in many ways, we see less of her as the story is all about her mother. Throughout the book, we along with Siobhan learn what happened to her mother on one fateful night; a night that has caused a cascade of events to happen that would affect the world. In this process, while the story was undoubtedly interesting, I wished to know more about Siobhan herself.\n PLOT \nLike I said before, we learn more about what has already happened than what is happening around Siobhan. We learn about the horros of a particular fateful night and the horrors it would unleash. The tale is dark and the author holds nothing back when describing the horrific scenes in the book. This is definitely not for people who do not like to read about the details of horrific crimes. I do admit it's the raw descriptions that make the story so realistic and makes us realize just the depth of hatred and jealousy that could lurk within humans. The historical facts in the book are fascinating, so is the author's take on The Devil's Prayer. I enjoyed the way Luke Gracias spins a tale so unique and dark that one can't help but be pulled into the pages entirely. I do wish the descriptions had been a little less raw but this isn't really a complaint but a personal preference.\n WRITING \nIt was wonderful. I loved the writing so much and it was one of the contributing factors that had me hooked to the book. The descriptions of the places and historical events were done in a manner fit to be called glorious. The author has a way of writing that bring forth emotions. I found myself angry, surprised and shocked constantly. This is one of the few books that actually make me angry; angry because of the injustice brought upon the characters. The writing gives readers a connection to the characters and events that make the story more interesting.\n WHAT I LIKED ABOUT THE BOOK \n- The writing- The plot with so many unexpected twists\n WHAT I DIDN'T LIKE ABOUT THE BOOK \n- The fact that we don't learn as much about Siobhan as we do about her mother\n CONCLUSION \nThis is definitely not a book for the faint of heart. This book has a lot of violence depicted brutally that might give the horrors to some people but at the same time, it's also a book so masterfully crafted and brought together with great precision. I'm dying to get my hands on the sequel because the book ends in quite a shocking cliffhanger."}, {"userName": "Abby Varghese", "userReviewDate": "Jul 15, 2016", "userURL": "http://www.goodreads.com/user/show/47943327-abby-varghese", "userReview": "[Personally I enjoyed climax leaving the reader to interpret Siobhan's next steps which may disappoint some readers. (hide spoiler)]"}, {"userName": "Megalion", "userReviewDate": "Jul 21, 2016", "userURL": "http://www.goodreads.com/user/show/14853675-megalion", "userReview": "A thriller that has it all. The synopsis gives a good idea of what you'll find. It's definitely a psychological thriller as Siobhan finds herself on a real mind f*ck of a journey in learning about her mother and how her mother's decisions have directed the path of Siobhan's own life. And if that wasn't all.... something's not right with her mother's grandkids. The story doesn't end with this book but I felt like it reached a good stopping point. A place to catch one's breath before beginning the next chapter. For both the reader and the characters.Thank you to the publisher for a free copy of this book and holy moly do I hope the next book is coming out soon! This one was riveting."}, {"userName": "Kajal Dhamija", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/47032765-kajal-dhamija", "userReview": "This book gave me the chills I seldom get even when reading a book full of horror. The devil's prayer is a historical fiction based on the thirteenth century conspiracy between the Mongols and the Papal inquisition. So, if one is interested in this particular aspect of historical fiction, this book is just the one for them. I read the book without having any knowledge of the history mentioned, but I think I enjoyed it a lot. Just after a few pages, the story became very interesting and kept me on edge whole of the time. The events were so horrifying, and I was impressed. My heart was beating fast wondering what dreadful event is about to happen in the book. I was awed and horrified at the same time. At that point, this became one of the very best books I've read. For me, it had everything I want in a good fiction book. At the top of it, it managed to scare me a lot. My only warning regarding these scary situations is that weak hearted people may not be able to bear with them. However, towards the end of the book, there are a lot of historical references. These references, as much as being important for the story, puzzled me. I was at the loss of knowledge there, anyhow. But yes, those few pages slowed down my read of this book. Moreover, for a novice in the history on which the book is based, it becomes difficult to grasp all the facts stated in a very few pages. As much as I was confused for a few pages, I think I enjoyed the most part of it. The richness of the content made it such a great it. 'The devil's prayer' has a class, which is the book's biggest strength. I would recommend this book to anyone who is looking for a rich and great read. The depth of the book makes one also learn some things spiritual. I'm sure it can keep anyone on edge! But it is my duty to remind the readers about the brutality in the book. I request weak hearted people to stay away from it."}, {"userName": "Betty", "userReviewDate": "Jul 08, 2016", "userURL": "http://www.goodreads.com/user/show/3298217-betty", "userReview": "After the death of her mother, Denise Russo, Siobhan needs to understand what caused her to vanish six years earlier, and finds herself caught up in a nightmare centuries in the making. Traveling to the convent in Zamora where her mother lived, Siobhan is in danger from the moment she arrives, and it is with great difficulty that she is able to access her mother’s final written confession. Reading it, she learns of a terrible betrayal that led her mother to make a deal with the Devil, risking Siobhan’s soul if Denise didn’t hold up her end of the bargain. As disturbing as all that is to Siobhan, other discoveries made in later parts of her mother’s confession are absolutely horrifying… as is the unfinished task her mother begs her to complete.The Devil’s Prayer is unlike any book I’ve ever read; this historical horror thriller has it all. The historical aspects of the book are based on actual events that occurred in the 13th century, and the locations mentioned actually exist—a bonus to any readers who are also history buffs. (Go here to see photographs and read information about the locations mentioned in the book.) Gracias’ historical research is excellent, and the masterful blending of fact and fiction makes this story even more chilling.The novel ends with a bit of a cliffhanger, but the point it ends on felt like the perfect stopping point, in my opinion. Don’t let that dissuade you from reading this fascinating novel. It’s my understanding that a sequel is in the works, and that’s a good thing because there is plenty more story waiting to be told.The Devil’s Prayer is an excellent read, and superbly written. I recommend this one highly… add it to your reading list!I received an advance review copy of this book courtesy of the author and Netgalley in exchange for an honest review."}, {"userName": "Janet Robel", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/9002621-janet-robel", "userReview": "I received a free copy of this book from NetGalley in exchange for an honest review. It's like finding undiscovered treasure! The first few chapters didn't grab me, but after that, it really took off. The intricate detailing and depictions in here are pure genius. This is a must-read thriller that is quite graphic at times and not for the faint-hearted. Now that Siobhan Russo knows her mother's story, there's just gotta be a book two in the works. I loved the whole good vs. evil and will be keeping my eye out for future books by this talented author."}, {"userName": "Lena♥Ribka", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/10446876-lena-ribka", "userReview": "DNF at 53%I hoped to read a religious thriller a là Dan Brown, but...forget it. The readers who compared this book in their reviews with Dan Brown's works probably never read them.Ridiculous plot, flat writing, weak characters, with a lot of senseless violence. I honestly won't recommend it to anyone. I normally don't rate books I didn't finish, but WHAT I read was not more than one star rating for me. ***Copy provided by the publisher via NetGalley in exchange for an honest review***"}, {"userName": "Jeannette Nikolova", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/2574284-jeannette-nikolova", "userReview": "Also available on the WondrousBooks blog.\nThe Devil’s Prayer were two very interesting books!The reason I say this is that there can be a line drawn very distinctively between the first and the second part of the book, and each could have been perfectly great on its own.The Devil’s Prayer is the story of a woman, Denise, who, after winning the lottery is abducted, raped and left to die. Instead of dying, she makes a deal with the Devil. Later on, she finds out about the existence of an old book, one part of which is called The Devil’s Prayer, and she sets out to find it.I greatly enjoyed the first part of the book – the story of Denise before she started looking for the book. It was a page turner and it was very exciting and creative. The end of this first story was a big surprise, even though I had guessed the general lines of where it was headed.The second part, the one about The Devil’s Prayer, was something else. It was interesting in a completely different way. This storyline was more in the vicinity of Dan Brown back when I enjoyed his works, and it had a great plot behind it. It also sort of reminded me of one of my favourites, The Historian, so that was another bonus for me. However, this part of the book also felt underdeveloped. It took entirely too little time in terms of the book, and it could have been so much bigger and more explosive. The author had a great “conspiracy theory” about a document signed between Arnaud Amalric and Jebe Noyan in the 13th century. I would have LOVED to read a more detailed and suspenseful novel about this. Not to mention that part of this story was set in Bulgaria, so I couldn’t help but being proud of our history. Sadly, it seems that the author wasn’t sure what to do with this treasure of a plot line, so he rushed it and he left big parts of it just hanging there.The ending of the book was also not ideal. The entire narrative seemed like the introduction to a much larger story, which never happened. The ending was supposed to be, in my mind, a bigger event, and instead it was left completely unresolved. If there’s a second book coming, I would definitely read it, because the ending didn’t satisfy my curiosity.Nevertheless, a very interesting book indeed.Also, for those who have read the book, this is the vampire burial from Perperikon:He had a metal knife stuck in his heart, and his left leg was cut off under the knee, severed in three and put next to the body. As The Devil’s Prayer points out, this grave is from the 13th century and this “anti-vampire” ritual was Christian."}, {"userName": "Richard", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/4501926-richard", "userReview": "Not since I read Rosemary's Baby Rosemary's Baby have the hairs on my body stood up reading a book in terms of sheer evil and devilry. Like all good historical fiction The Devil's Prayer focuses on some real names and incidents in the past but when cloaked in the mysteries of the Catholic church and the trend towards End Times literature and biblical revelation the author has a real winner on his hands.It reads well and is filled with tension from the opening dramatic mystery. A sense of menace and threat is sustained throughout the book which recounts the mission of a Mother who left her family one day and through her death leave a diary, a confession for her daughter to find and understand. In the hope that in death her first born daughter will continue the struggle against the Devil himself.I am interested history and as a reflection on church history and biblical prophesy the author makes a thriller that is rooted in reality even when the events seem fanantical most of the time. It spins a tale that is fiction but with enough truth in different guises to be embraced and the reader is transported to the Papal Bulls, Crusades and the Inquisition. Monks being threatened with being bricked up alive; brutality in the name of God and in a time with a dark sense of the Occult.I liked the general mystery and threat from monks rather than spies, government agents or general assassins.The sense of who can you trust and the fear for your life are also strong elements here. In between is a simple life of friendship and hope in the future that is destroyed by greed and jealousy.Here the story falters at times but it is such an interesting plot that much can be forgiven.A story where the Devil is a re-occuring character my not appeal to everyone but this isn't an attempt to undermine faith but to show that good and evil have always existed and it remains a human quality to chose their own path by the decisions they make. Satan is the author of lies so it is a great line when someone complains to the Devil for misleading them.The book appears to leave much unresolved which points to the story continuing into at least another book. If it is as good as this debut then it should be anticipated with the same enthusiasm this novel should be received."}, {"userName": "Murali Ryan", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/42689959-murali-ryan", "userReview": "The Devil's Prayer by Luke Gracias is an thriller with the story style of Dan brown, Why I compared with Dan brown is because his books are more like a thesis and travel guide. It makes you to learn and explore various new things. This book also given me the same feelings made me to explore Brisbane to half of the European countries.As the title and blurb story is about the devil and its dominant over Denise, a middle age women. The story divides into four parts, first part says about a sucide of nun at Spain and Siobhan Denise's daughter in Australia decides to search for answers by going all the way to Europe alone.In second part Siobhan gets her mother's dairy where it have all answers of why she left her family what terrible past she gone through and how the winning lottery ticket made her a mess.In third part author lets out the quest for Siobhan's searches true reasons of what she went through and dominance of letting devil in her own knowledge.In part four author ends all the searches and quest by stating the remedy for breaking through the devil's castle.In all this four parts author narrated in a good pace and Lucid language which made me to go through till last page and keen informations about all the historical places and also pictures presented where so helpful to go with pace and understanding.Eventhough a fiction author made it looks like realistic with historical reasons and stories of popes to Jengis Khan. Also the stories of devil's uperhand in various centuries where proof to his resarches.Overall, The Devil's Prayer is an interesting story to hung up yourself. I liked it most, whether its simple and detailed story telling or thrill he maintains or while uttering the most pain of women during and after she raped I had all of them.I didn't told the full story I'm leaving the choice of exploring this to yourself."}, {"userName": "Smitha", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/2481560-smitha", "userReview": "Received it from NetGalley...on request.I abstain from reviewing new books as I lack patience and perseverance, but the blurb of this book sent to me via email caught my fancy. And I was in the mood to read about the strife between evil and good.The story started good - a nun, Benedectine, who runs away from a sect of monks and commits suicide, who is later recognized as Denise, the woman who, one fine day, ran away from her two daughters leaving her old mother to fend for them. her elder daughter Siobhan, a young journalist student sets off to the monastery in search of the cause for her death... and learns more than she bargained for.Then follows a convoluted story - in present and past, often with tidbits from remote history and biblical times thrown in. Got to know a lot about the old Christian beliefs on good and bad, God and devil. There were many extraordinary happenings in this book which marred the simplicity of a tale well told. Too much violence, and too many weird happenings is what, in my opinion, deflected this story from a reasonably enjoyable one to a slightly tedious one.All in all, I persisted as I wanted to know what happens in the end, ... but the end was disappointing."}, {"userName": "Lynn Mccarthy", "userReviewDate": "Aug 31, 2016", "userURL": "http://www.goodreads.com/user/show/4698374-lynn-mccarthy", "userReview": "A great read.I didn't know what to expect when I started this book but it soon pulled me in.This book had everything History,suspense,horror and supernatural tones.It reminded me of The Da Vinci Code its a well researched book.Read it well worth it.Thank you to the Author Netgalley and Publisher for a chance to read this book."}], "description": "A nun commits suicide in front of thousands in Spain. In Australia, Siobhan Russo recognises that nun as her mother, Denise Russo, who disappeared six years ago. In search of answers, Siobhan travels to the isolated convent where her mother once lived. Here she discovers Denise’s final confession, a book that details a heinous betrayal that left her crippled and mute, and Denise’s subsequent deal with the Devil to take revenge. In the desperate bargain Denise made with the Prince of Darkness, she wagered Siobhan’s soul. As Siobhan discovers the fate of her soul, she learns that hidden within the pages of her mother’s confession is part of The Devil’s Prayer, an ancient text with the power to unleash apocalyptic horrors. And now her mother’s enemies know Siobhan has it. Can Siobhan escape an order of extremist monks determined to get the Prayer back? Can she save the world from its own destruction? Explicit Content Warning: \"The Devil’s Prayer\" is a historical horror thriller that contains brutality, rape, sex, drug abuse and murder. Readers may find its content offensive and confronting. You can view the video teaser for the book on https://vimeo.com/156061258.", "title": "The Devil's Prayer", "url": "http://www.goodreads.com/book/show/29225318-the-devil-s-prayer", "average": 4.01, "cover": "https://images.gr-assets.com/books/1455904305l/29225318.jpg", "reviews": 346, "authors": [{"url": "https://www.goodreads.com/author/show/15012924.Luke_Gracias", "name": "Luke Gracias"}], "type": ["Horror", "Historical", "Thriller", "Mystery", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/29225318-the-devil-s-prayer", "http://www.goodreads.com/book/show/32076440-the-devil-s-prayer"]}