{"ratings": 5211, "userreviews": [{"userName": "Carol", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/4525162-carol", "userReview": "This book changed my life! I cried thru the whole thing because ever since I was a small girl, I just KNEW that I was born for greatness and to make a difference in the world; however, I realized that I had allowed that dream to lie dormant, buried underneath fear and failures. I had settled for a life of mediocrity. but NO MORE! This parable is so easy to read but is filled with wisdom about how to never allow anyone to steal your dream and about the struggles we all face in reaching for that dream….but, dreams really do come true!"}, {"userName": "Natalie Vellacott", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/34178791-natalie-vellacott", "userReview": "I have just read as much of The Prayer of Jabez as I could stand. Reflecting, I realised that it wasn't my first encounter with this author. I read The Dream Giver whilst serving on-board a missionary ship. A friend highly recommended it so I found it in the ship library. I remember being disappointed and thinking it reminded me of the Christian hedonism principle espoused by John Piper which I don't have much time for.This book is an allegory in the style of Pilgrim's Progress or Hinds Feet on High Places but it falls short in every area by comparison. The main reason it falls short is because the underlying principle is erroneous--it is all about living our dreams in the here and now or as Joel Osteen would say \"Your best life now...\" It might be a \"nice story\" but encouraging people to focus on their earthly dreams, ambitions and successes even with God in the picture is a recipe for disaster.This book was not as offensive or dangerous as the Jabez one, I just think its focus is in the wrong place and it may distract people from taking up their cross and following Jesus. Also, what happens when the inevitable suffering and trials come or dreams fail?......let's set our minds on things above instead, then we won't be shaken."}, {"userName": "K.D. Absolutely", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "This book, Dream Giver, The is the second book by Bruce Wilkinson (born 1940) who is the author of the popular book, The Prayer of Jabez Devotional: Breaking Through to the Blessed Life (3 stars). That prayer is based on the passage from the Holy Bible (1Chronicles 4:9-10) that goes like this:Jabez was more honorable than his brothers. His mother had named him Jabez, saying, \"I gave birth to him in pain.\" Jabez cried out to the God of Israel, saying, \"Oh that you would bless me indeed and enlarge my territory! Let your hand be with me, and keep me from the evil one.\" And God granted his request.Wilkinson basically expounded on this prayer to encourage his readers to outlines his or her life and what he wants to do and raise that plan to God so it will be blessed by God.Here in this book he expound it some more: to include dreams in the plan. We all have dreams when we were kids but those dreams are probably dead now. Maybe they are not practical. Maybe they don't make sense anymore. My dream when I was a kid is to be an agriculturist. Then later it was to become a teacher. Then to become a priest. However, my father's dream for me was to become a doctor so I took up Medical Technology (a popular pre-med course) but when I finished it, he did not have money to send me to a medical school so I worked and while working finished my second degree, business administration. Now, I am an Information Technology (I.T.) career in an electronics manufacturing company. Haha.Should I pursue my dream of becoming an agriculturist even now that I am in my 50's? If I were to ask Bruce Wilkinson, his answer will be a resounding yes. Haha. Oh well, maybe ten years from now when I retire from corporate world, I'll try to go back to the province and plant crops in the farm. Or maybe I'll write (not a boyhood dream but something that I think I'll enjoy doing). One thing is sure though: I will keep on reading.Anyway, the book also gives an outline on what to do to pursue those dreams regardless of ones' age or life predicaments. Wilkinson only wants us to dream and to pursue it."}, {"userName": "Julie", "userReviewDate": "Feb 21, 2009", "userURL": "http://www.goodreads.com/user/show/2057571-julie", "userReview": "This book came at a crucial time in my life. It is a quick, simple read, but very profound. I found this information to be helpful in this new season of transition in my life. I learned that fear is just a four letter word and it is time to move with passion to reach my dreams. Yes, I said dreams with an \"s\", because life is full of many great things to achieve. Just holding to only one dream in life is too limiting. After reading this book I feel liberated from the prison of \"ordinary\" and that my life is just beginning."}, {"userName": "Andreea", "userReviewDate": "Aug 11, 2014", "userURL": "http://www.goodreads.com/user/show/13719652-andreea", "userReview": "Every time I read this book my heart is rejoicing and I see more clearly God's plan for my life. It's like a map you want to check from time to time to see where do you find yourself standing.I strongly recommend this book!"}, {"userName": "David Rave", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/11372899-david-rave", "userReview": "Best short book I ever read."}, {"userName": "Sarah", "userReviewDate": "Jan 31, 2008", "userURL": "http://www.goodreads.com/user/show/610982-sarah", "userReview": "The great thing about parables is that they are non-specific enough that everyone can find herself in one.When I first read the preface to this book, I was extremely skeptical. The author wanted to be my \"Dream Coach,\" excuse me? 'What a load of inspirational baloney,' I thought. 'This is going to be the cheesiest thing ever.'But I had a few hours to kill, and the book was thin enough and written in big print, so I gave it a shot.I think this cheesy little book of inspirational baloney has changed my life.I am so encouraged, so emboldened, and so convicted by it that I have no choice but to make a choice. There is more to life than what most of us are living, and God placed us here with the precious gift of life for a reason!I would encourage anyone to read this, and read it with an open mind. Maybe even take a break from reading it to stop and think - and pray - about what God is laying on your heart. You could easily read this entire book in one sitting and blow it off, but I would really encourage you to take some time with it and maybe even read it more than once at different times in your journey.It's very possible that in a few years' time, I will owe my happiness to this book. Maybe you will too."}, {"userName": "Ron", "userReviewDate": "Sep 18, 2008", "userURL": "http://www.goodreads.com/user/show/1256262-ron", "userReview": "Don't waste your money. At $17 for what would only be about one hundred pages if font, line spacing and margins were normal, it's pretty expensive.Wilkinson is a great communicator. His The Three Chairs and Prayer of Jabez are classics of inspirational literature. The Dream Giver however does not meet those standards. It's half parable (John Bunyan, Wilkinson is not.) and half inspirational guide (complete with The Dream Giver \"resources\").If you want to read something that'll do you some good, try Rick warren's The Purpose Driven Life."}, {"userName": "Mack Bartle", "userReviewDate": "Dec 17, 2012", "userURL": "http://www.goodreads.com/user/show/15577552-mack-bartle", "userReview": "This might be my favorite book. Dr. Wilkinson helps the reader discover his or her dream with a practical story that I will not forget. The Dreamgiver changed my life."}, {"userName": "Cynthia Egbert", "userReviewDate": "Mar 18, 2009", "userURL": "http://www.goodreads.com/user/show/1299007-cynthia-egbert", "userReview": "Kind of trite...but should make a great discussion with the kids in class."}, {"userName": "Wilson Arias", "userReviewDate": "Mar 22, 2016", "userURL": "http://www.goodreads.com/user/show/41284878-wilson-arias", "userReview": "He vuelto a soñar..."}, {"userName": "Carrie Daws", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/6612679-carrie-daws", "userReview": "Encouraging. The parable was easy to relate to, to apply to my own life as I've walked forward into my own dream. I've seen and experienced the doubts, fears, and bullies, and I've wondered if I should leave the land of familiar, routine, and ordinary. Yet I also believe the dream inside me was planted by God and fertilized by others who love Him. I appreciated the second half of the book, filled with specific questions, answers, tidbits, and hints for the journey. This is a great book for anyone who dares to believe that maybe God wants something different--something bigger--than what they've currently grabbed hold of."}, {"userName": "Vonetta", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/825238-vonetta", "userReview": "3.5 stars — Very encouraging, and a great way to start my reading year! I’m in a career transition, so it was nice to think positive thoughts as I consider what my goals might be for 2018. 3.5 stars because the parable was a little silly, though it did get the point across, and the message felt a little simplistic, but it was encouraging and I can’t wait to see what fears I push past this year."}, {"userName": "Christopher Lewis Kozoriz", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/7841536-christopher-lewis-kozoriz", "userReview": "\"God has put a driving passion in you to do something special...You are created in His image-the only person exactly like you in the universe. No one else can do your Dream.\" ~ Bruce Wilkinson, The Dream Giver, Page 75, Paragraph 5God is our Dream Giver and He has deposited something very special inside everyone of us. He has give us a calling, giftings, talents, abilities, etc. that He has not given anyone else on this planet.The realization I came to when studying this book was that I am the only one who can fulfill the vision or dream that God has given me and if I fail, then others will be affected as well. It made me realize that I have a lot of responsibility to fulfill the dreams and visions that God has given me. Bruce Wilkerson becomes your dream coach through this book. He starts off with a parable of man called \"Ordinary\" who wants to be a \"Somebody\", but the ordinary way of life is holding him back, as well as bullies. The parable takes you through the thoughts and actions of the character to the end of accomplishing his dream. The dream at the end of the story may surprise you. I'll give you one hint...it isn't about you, it's about taking care of others.I liked the questions that were scattered throughout this book and made every effort to write an answer them. Some of them are:* What have I always been good at?* What needs do I care about most?* Who do I admire most?* What makes me most fulfilled?* What do I love doing most?* What have I felt called to do?There is only one criticism I have for this book is that it failed to provide a practical way of accomplished your dreams. I highly recommend a book called, \"Mentored By A Millionaire\", by Steven K. Scott and using a skill he provides in this book called \"Vision Mapping\". This is one of the greatest skills that I know for reaching your dreams. Otherwise, I was greatly encouraged by this book and I think it is required reading for those who want advice about the tug that God has put on your heart - Your Dream."}, {"userName": "Valerie Caraotta", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/19022887-valerie-caraotta", "userReview": "The Dream Giver is comprised of two parts with part one including a fictional story on fulfilling your dream. Part two is where author Bruce Wilkinson becomes our dream coach and answers questions people have posed, especially the obstacles, that create uncertainties about their pursuits. Additionally he reviews key points from chapters in his fictional work and tells us how to apply each stage in our advancement toward our dreams. It is God's desire and high calling that we become all we were created to be and do. You will see in the story that as we embark on the journey to fulfill the dream, we encounter obstacles along the way that will try to deter us from advancing. These obstacles can be in the people closest to us as well as things like fear, rejection, and insecurities. Although a fictional piece, you will clearly understand the process of fulfilling your calling and the necessity of the dark times- Wastelands- encountered along the way. Each step of advancing toward your dreams will leave you with choices only you can make.Shared in this book also will be five common misconceptions that keep people from pursuing their God-given dreams and strategies for how to hang on during trying times. This book is super for all ages including young Sunday school classes. The options to be creative in sharing these ideas are numerous. The sooner the younger generation can embrace destiny and position themselves the better off is all of us as a result of talents and gifts being used for the glory of God. Author Bruce Wilkinson will share his personal \"Dream Giver\" experience and how the risks of leaving a fruitful past resulted in an even better future. His life experiences bring great validity to this book's theme message."}, {"userName": "Kent Thai", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/12167793-kent-thai", "userReview": "This was a very interesting book. Half of the book was a story, while the other half of the book was a lesson about life which was very religious. The story was very interesting and had a nice meaning behind it. The names that Bruce Wilkinson give to the characters are symbolic as well. The story was about a person who wanted to pursue his dream and in order to do so, he had to leave his city, Familiar, and had to face multiple obstacles such as border bullies, and giants which where representative of real-life obstacles. He eventually achieved his goal. He took the risk and did what the Dream Giver, or God, told him to do. In the end he got his goal back, and God's trust. The second half of the book explained how the author, Bruce Wilkinson, went down the same trek in real-life. As he explained his journey, he also explained how it related to the story. The story was a fiction version of his life."}, {"userName": "Laura", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/22375533-laura", "userReview": "This book gave a lot for me to think about and one that can be used in our daily lives when the \"Giant\" try to keep you on a path of their choosing. using words live Ordinary which we all are familiar with or Big Dreams can we do it without causing to much of a ripple. Once you can let go of your Comfort level you may find that your life was just plain without shaking a few branches.The biblical Wilkinson gives readers seem to be easy but limited with out going with God as your co-pilot. It is in my opinion a quick read but one to stop from time to time to see where you are in Ordinary's travel if you were Ordinary."}, {"userName": "Sarah Hayes", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/53701598-sarah-hayes", "userReview": "Absolutely loved this book!! Everyone has a dream. Even if you don't know what your dream is currently, seek after it. It's there! I love how this book shows you how to reach your big dream. I also love how it shows how much God plays a huge role in our dreams and that we need to rely on Him for help along the way."}, {"userName": "Trace", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/3767809-trace", "userReview": "I really like this book. I loved the simple story about Ordinary. I have a feeling I like it as much as I do, because it just seemed to come along at a crossroads in my life. I want to reread and take my own notes and I don't want to forget the message that this book imparts."}, {"userName": "Caitlin", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/19126779-caitlin", "userReview": "This book has helped me get my dream back. As a child it is easy to dream so big, but as you get older you end up feeling that you can only dream as big as your income will allow. But this simply isn't true. You can chase your dream, and at any age! So glad I read this book."}, {"userName": "kim fisher", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/62914291-kim-fisher", "userReview": "InspiringThis is an amazing book. Thanks for waking me up again to reach up and truly strive to make my life about glorifying God!"}, {"userName": "Chris Anthony", "userReviewDate": "Jun 20, 2015", "userURL": "http://www.goodreads.com/user/show/17772303-chris-anthony", "userReview": "One of the most easy to read yet very striking book I have read. A must read to all."}, {"userName": "Sherry Conrad", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/22306305-sherry-conrad", "userReview": "Author Bruce Wilkerson explains how to follow your dreams in this life even when those around you do not support you, God is always with you."}, {"userName": "Nadine BoPeep", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/73813251-nadine-bopeep", "userReview": "This book is nothing short of awesome sauce! This is another spiritual fill-up! Loved this book mainly because I could see so much of myself through the lens of the protagonist Ordinary. Now I don't want to spoil the fun for anyone but basically this book talks about Ordinary who lives an \"ordinary\" life until one day he is moved to go after his calling. Although Ordinary is fired up and ready to take on this challenge, it is hard for Ordinary to do this because he knows that it requires him to move out of his comfort zone. Though Ordinary faces some obstacles like fear and doubt from within he also faces some these adversities from those closest to him, he is able to ultimately push through all of the adversity and understand his \"big dream\"/ calling. Now this was a church wide study at my church \"Impact\" where my Pastor's broke down the book to make us understand the importance of this book right here! I have put together some basic conclusions/connections from my pastor's mouth and directly from the book:-God has a way of showing up in the familiar-God has a way of showing up when we think we've got it all together-If nothing is broken, than you do not believe in faith-Not only does God show up but he also shows up with a word-The word disturbs your unfamiliar-Do you want to be ordinary or extraordinary? When you choose extraordinary, you have to be willing to be set apart.-God wants to take you new places but we still carry old luggage?-There is more that God requires of us-Remember, return and reset-Where God gives vision God will also give provision-Your familiar is your comfort zone is what you know-Comfort zones are temporary --> careers, emotions, friendships, homes etc.,-What have here won't get you there-What blessed you to make it to level A will be a hinderance at level B-When you disturb your comfort zone, it disturbs others as well-The borderland is a place of transition & decision- Transitions --> Not everyone that starts with you will finish with you-Along the way expect to have a couple of funerals but don't get stuck at the cemetery (Come on SOMEBODY!!)-Decisions-->Be strong, be courageous, listen to God and he will give you what you need-Expect at your boarder to have boarder bullies aka doubters-Some of the hardest arguments and some of your biggest bullies are the people closest to you-The promise land is at hand.. The closer the promise is the more difficult your journey will become-In order to reach your dream, you need to show up to claim your blessing. God says wherever your feet touches, I'm going to give it to you-When you become comfortable, God starts to work w/in you againAgain, because I don't want to spoil the book, I'll just leave this right here: ENJOY!"}, {"userName": "Alex", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/29139967-alex", "userReview": "3.5/5 starsI think the book was a little too religious for my liking. But I was still able to translate very useful tips from a non-religious point of view. I read the Spanish version of this book and found some mistakes. As a professional translator, this bothered me a bit, but I think that someone who doesn't do that for a living wouldn't really care or even notice, so I'm not too upset about it; just enough to mention it and then let it go. The overall message about following your dreams was inspiring to me. Even when there was so much God talk in it. So I enjoyed most parts of the book, I just had to analyze it with my own words and give it my own useful meaning. I rarely take notes on my bullet journal about books I'm reading, but this one made it to the paper to remind myself to keep holding on."}, {"userName": "Edshara", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/10625722-edshara", "userReview": "This book was short and to the point. Bruce Wilkinson didn't drag on and overload you with too much information. Everything is useful and helpful and I really enjoyed it.My favorite part of the book was the actual parable. It was done in a creative yet realistic way and I saw a lot of my own journey scattered across the pages as I read. In fact, I got so much from the parable I could have almost done without the informational part of the book, but I did understand its purpose. I'm glad I read this and I can already see myself reading it again in the future, in my opinion, it was that good. I'd say give this a read if this is a subject area that interests you, even if you only read it for the parable, you'll get something out of it."}, {"userName": "Marisabel Alvarez", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/60040135-marisabel-alvarez", "userReview": "This whole book is about the significance about your Big Dream that the \"Dream Giver\" has set for you. There are many challenges that sometimes you just have to face. I know I have had many. But now I know that I have to overcome the ones I still have. I have to be able to achieve my Big Dream. Step out of you comfort zone, leave your land of familiar, stop being a Nobody and become a Somebody. Achieve the Big Dream that you want and desire so badly, after all the Dream Giver gave it to you for a reason and now it's up to you to find out the reason."}, {"userName": "Lorraine", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/18756383-lorraine", "userReview": "This book is divided in two sections: the parable, and the coaching guide. It is clearly written to be an inspirational object lesson of biblical principles about trusting God. The story focuses on an everyday character personified as 'Ordinary,' who perceives he has a purpose in his life and seeks to discover it but is beset by personal doubts and difficulties. Along the way 'Ordinary' finds out where his desires and strength comes from, why he's tested, and what is possible by believing. The parable isn't great prose but for those willing to read on the second half provides personal coaching about living life believing in potential guided by God."}, {"userName": "Crista Huff", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/20622812-crista-huff", "userReview": "This book is excellent for people who are yearning to know where they belong, what to do and where to go; looking for their life's purpose. It's also extremely helpful for people who have gone through trauma -- death, divorce, injury/illness, tornado, job loss, etc. -- and are past the initial freaking-out stage. Now you're just numb and lost and wondering how to rebuild your life. This book is for you.You'll find yourself rereading The Dream Giver, and buying copies for friends. This book is a blessing."}, {"userName": "Vinit Kumar Singh", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/75588093-vinit-kumar-singh", "userReview": "Welcome to a little story about a very big idea. This compelling modern-day parable tells the story of Ordinary, who dares to leave the Land of Familiar to pursue his Big Dream. Does your Big Dream seem hopelessly out of reach? Are you waiting for something or someone to make your dream happen? Then you’re ready for The Dream Giver. Made me think if I am living my dream— or just living my life? A must-read book for all the dreamers in the world."}], "description": "Are you living your Dream? Or just living your life? Welcome to a little story about a very big idea. This compelling modern-day parable tells the story of Ordinary who dares to leave the Land of Familiar to pursue his Big Dream. You, too, have been given a Big Dream that can change your life. One that the Dream Giver wants you to achieve. Does your Big Dream seem hopelessly out of reach? Are you waiting for something or someone to make your Dream happen? Then you are ready for The Dream Giver. Let Brice Wilkinson show you how to rise above the ordinary, conquer your fears, and overcome the obstacles that keep you from living your Big Dream. You were made for this. Now it is time to begin your journey.", "title": "The Dream Giver\n      \n          (Dream Giver)", "url": "http://www.goodreads.com/book/show/34704839-the-dream-giver", "average": 4.24, "cover": "https://images.gr-assets.com/books/1490651758l/34704839.jpg", "reviews": 398, "authors": [{"url": "https://www.goodreads.com/author/show/3035771.Bruce_H_Wilkinson", "name": "Bruce H. Wilkinson"}], "type": ["Christian", "Self Help", "Nonfiction", "Inspirational"], "outlinks": ["http://www.goodreads.com/book/show/34704839-the-dream-giver", "http://www.goodreads.com/book/show/3635.The_Dream_Giver", "http://www.goodreads.com/book/show/24629760-the-dream-giver", "http://www.goodreads.com/book/show/10842349-el-dador-de-suenos-the-dream-giver", "http://www.goodreads.com/book/show/6459107-the-dream-giver", "http://www.goodreads.com/book/show/103610.The_Prayer_of_Jabez", "http://www.goodreads.com/book/show/974122.Secrets_of_the_Vine", "http://www.goodreads.com/book/show/798938.A_Life_God_Rewards", "http://www.goodreads.com/book/show/280001.The_Prayer_of_Jabez_for_Teens", "http://www.goodreads.com/book/show/6661598-you-were-born-for-this"]}