{"ratings": 47002, "userreviews": [{"userName": "Meaghan", "userReviewDate": "Nov 12, 2009", "userURL": "http://www.goodreads.com/user/show/430758-meaghan", "userReview": "I wish I could say I liked this book. I thought I would. I know it's critically acclaimed and a well-known story. But it left me with a bad taste in my mouth.The book is meant to educate young people about the Holocaust, but it had a lot of historical inaccuracies. The idyllic shtetl world at the beginning of Chaya's story would have been long gone by 1942 -- by that time, all the Jews left alive in Poland were in ghettos, in concentration camps or in hiding. Lublin, the place Chaya supposedly came from, was ghettoized and in early 1942, most of its Jewish population was deported to Belzec and killed.The dialogue was overly didactic (a common flaw in historical novels, especially those for children) and too much was told rather than shown. Further, the camp confused me. Yolen says in the end that she created an amalgam fictional camp out of various aspects of real camps, but she used the trademark Auschwitz sign: \"Arbeit Macht Frei.\" I was confused throughout the book: This is Auschwitz? But where are the selections, the band, Mengele? Did she do any research at all, I wondered. Yolen should have revealed her use of a made-up camp at the beginning, and she shouldn't have used the Auschwitz sign.If you want to look for some better books on the Holocaust for children, try any of Uri Orlev's, or Jerry Spinelli's Milkweed, or Livia Bitton-Jackson's memoir I Have Lived a Thousand Years, or...well, quite a few books are better than this one."}, {"userName": "Chris", "userReviewDate": "Mar 29, 2010", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "This semester I am requiring my students to read The True Story of Hansel and Gretel, a novel takes place in Poland during World War II. The good news is that my students love the book; in fact, several of them are reading ahead.\tThe shocking fact, the bad news, is what they don’t know. It is not just knowledge of history that they lack; it is knowledge of basic geography.\tGod bless PowerPoint and blackboard.\tTo be fair, my students do ask intelligent questions, yet the lack of basic knowledge is shocking. At times, I feel like I am teaching a culture and history course in addition to a reading skills course.\tNow, I don’t think it is the students’ fault. I think the fault lies with the schools as well as parents and special interest groups. Here’s why.\tThere is a group called PABBIS (Parents against Bad Books in Schools). I disagree with them on so many different levels, but their website does have two good features. It actually quotes the material they find objectionable, and it has a complete list of banned and challenged books (as recent as 4-5 years ago).The Devil’s Arithmetic is on that list by the way.\tEverything by Stephen King makes the list. Everything by Dahl, Blume, Block. There are a few Black Stallion books on the list as is Black Beauty, Harry Potter, His Dark Materials, Three to Tango, The Diary of Anne Frank, The Lorax, and Shakespeare.\tIn other words, pretty much anything good.\tLately, history and science text books have been subjected to strange changes (i.e. as in Texas) and warning labels (usually about evolution).\tIn terms banning and challenging books, I might under the idea if the book was being assigned at an inappropriate grade level, say Beloved to first graders. Why an exceptional first grader might not have a problem with such a book, there are several things wrong, in general, about such assignment, least of which is the subject matter. Yet, I have never heard of such an assignment. Age appropriateness isn’t really the issue. It seems to rest on what might offend any group, anywhere.\tTake, for instance, The Diary of Anne Frank. This book has been banned, challenged, and rejected by parents and text book committees because of the sex and tragedy of the story.Raisin in the Sun has been banned and challenged because it’s pornographic. (Can someone please, please show me where?).\tI can certainly see why The Devil’s Arithmetic is banned. It is the mention of a wedding.\tBlatantly heterosexual.\tOkay, it’s most likely due to the violence (it’s about the Holocaust) and the ending. Romeo and Juliet was dissed by a teacher who said it was a blatant endorsement of heterosexual love (so I guess teen suicide is okay).\tBUT, Yolen’s magnificent book is exactly the type of book that should be used in schools.\tLet’s face it, the wrong text book and/or the wrong teacher can make history very boring, and sometimes people just don’t like learning about history for a variety of reasons. This is the reason why good historical fiction should be used in schools. A good historical novel can get a reader interested in a period, in an event, in a person. This true, to a degree, of such less accurate work than The Devil’s Arithmetic. 300 caused some people to become interested in the Spartans, Titanic in the actual ship. In terms of books, vampire novels and historical fiction, such as The Other Boleyn Girl also cause readers to become interested in the actual events or myths that the novel is based on. Curiosity and a desire to learn are fueled by a variety of things; interest is one of them.The Devil’s Arithmetic is precisely the type of book that for young readers can help history seem more real and, perhaps, get a reader interested in history. Yolen does not talk down to her readers, her main character is sympathetic, an older sibling, and because Yolen doesn’t pull her punches, it is a real history, not a feel good history. This makes the story far more compelling and interesting. The story is told actively and quickly. Words are not wasted. The reader learns but is not lectured to and screamed at.\tBecause of this reality and vividness, parents object to the story, and this raises the question of whether teachers and parents should sugarcoat history. It’s true that are plenty of novels and movies that present history in a more flattering light (look at the perfect teeth, the clean bodies, the small pox vaccination scars). A reader can quite easily find it in any average romance novel. Such writing does serve a sense of purpose, escapism, and there is nothing wrong with that.\tBut that is not education.\tIs this what parents want a school to be?\tI hope not. I suppose it is easy for me to comment on appropriateness and the evil of banning because I don’t have a child, and I was raised in a house where you were encouraged to read what you wanted. I see, however, the effects of banning and challenging which are a total lack of knowledge or, worse, a lack of interest about a subject because the subject has been taught in such a sterile environment, so devoid of any color or shading, where everything is the color and taste of sugar; where everyone in the world has always treated everyone with respect and love, where women always had the right to vote, and slavery only existed in North and South America, and was totally destroyed by the American Civil War.\tGood literature, of which The Devil’s Arithmetic is a prime example forces its readers to examine their own knowledge and lack of knowledge, forces readers to think about their own responses, notions, and stereotypes. Good literature teaches or enlightens the reader even if the reader already knows. It is a bond between writer, book, and reader that is no less real than those ties of family and society that provide the excuse for book banning."}, {"userName": "Becky", "userReviewDate": "Jul 29, 2008", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "I wasn't really sure what to make of this book when I first saw it, but after having read it, I would say that I am glad that I did. This is one of those books that really makes you look at things from a different perspective. I can relate to Hannah, because I remember being 13 and having little patience with traditions and customs, and just wanting to hang out with my friends. But given the experience Hannah had, she was able to see things in a new way, and was granted a gift, even though it was at a great cost, to be able to know and really understand her family's past and how they became who they are. And because of this, she gains a newfound respect and admiration for them, and her own life, that she might not have otherwise known. This is the lesson that this book taught me. Yes, it was about the Holocaust and the epic tragedy that occurred, but I think it was more about understanding and respecting where you come from, and not letting trivial everyday teenage life get in the way of honoring your past.***SPOILERS BELOW***Ultimately, I gave this one 4 stars only because the book never really explained who/where Chaya was really. With these types of books, where someone goes back in time into the body of another person, I always wonder where the person who is inhabited goes when the person who is inhabiting them is there. Did Chaya die when she was ill, allowing Hannah to come back in order make her a hero to her Aunt? Or did Chaya sort of get shunted off to the side when Hannah took over, which means that Chaya had no choice in the sacrifice she made?I hope the latter is not the case, although near the end it is mentioned that Hannah has 3 sets of memories -- of being in Lublin, of being with Gitl and Schmuel, and of her American family. It seems to me that Hannah should only have had 2 sets of memories if Chaya was not in there somewhere. The last possibility is that Chaya was Hannah in a past life, whose life Hannah had a vision of (through Chaya's eyes, perhaps?) at just the right moment to attain the perspective she needed... Of the three, this is the most appealing to me, although some aspects of the story don't fit perfectly with this theory. Overall, I am very glad that I read this book, and would highly recommend it."}, {"userName": "Lisa Vegan", "userReviewDate": "Sep 16, 2007", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "This is a marvelous book for young adults, although I wouldn’t recommend it as their first introduction to the holocaust because it portrays the atrocities committed in a starkly realistic way. And, unlike some young adult books that I enjoyed as young as nine or ten years old, I wouldn’t give this to kids until they were at least 12.It is a wonderful story and, because the main character, an American Jewish girl who’s 12 years old, is from the present time (even though the book was written twenty years ago, it still has a sufficiently modern feel) readers can perhaps empathize with her and the experiences she has when she goes back in time to Poland during the Nazi holocaust. I thought Jane Yolen had a truly inspired way to tell this story. Even readers who do not normally enjoy history or historical fiction will probably appreciate this book because the time travel nature of the story allows a contemporary young person to truly experience events of the past. (I’ve always loved history and historical fiction, but I know that some young people are not so interested.)The characters are likeable and believable and the ending is smart and heartwarming. All through the book there are hints about how the story will evolve and in a way it was predictable, but the details of the ending caught me by surprise, even though I was looking for the gist of what did happen.It’s a terrific family story and it could make for intimate discussions between young adults and their adult family members. I’m also strongly in favor of it being taught in schools as part of the curricula for holocaust studies and history lessons."}, {"userName": "K8", "userReviewDate": "Jan 06, 2009", "userURL": "http://www.goodreads.com/user/show/1876250-k8", "userReview": "Twelve year old Hannah is sick of spending Passover 'remembering' the past with her relatives. During the Passover Seder, she is transported to 1942 Poland, where she becomes Chaya (her Hebrew name), the girl she was named for. In this time, she is eventually sent to a concentration camp, where the bulk of the story takes place. Throughout the book, she struggles with memory - which memories are real (the future or the now), remembering anything b/c of the trauma of the camp, futilely trying to use her future-memory to warn those around her, etc.The story is chilling. And it is beautiful and sad. And it is an amazing combination of historical fiction and s/f.Some of my favorite quotations:\"Passover isn't about eating, Hannah,\" her mother began at last, sighing and pushing her fingers through her silver-streaked hair. \"You could have fooled me,\" Hannah muttered. (4)But as the scissors snip-snapped through her hair and the razor shaved the rest, she realized with a sudden awful panic that she could no longer recall anything from the past. I cannot remember, she whispered to herself. I cannot remember. She's been shorn of memory as brutally as she'd been shorn of her hair, without permission, without reason...Gone, all gone, she thought again wildly, no longer even sure what was gone, what she was mourning. (94)\"We all have such stories. It is a brutal arithmetic. But I - I am alive. You are alive. As long as we breathe, we can see and hear. As long as we can remember, all those gone before are alive inside us.\" (113)The days' routines were as before, the only change being the constant redness of the sky as trainloads of nameless zugangi were shipped along the rails of death. Still the camp seemed curiously lightened because of it, as if everyone knew that as long as others were processed, they would not be. A simple bit of mathematics, like subtraction, where on taken away at the top line becomes one added on to the bottom. The Devil's arithmetic.\" (146)"}, {"userName": "Kim", "userReviewDate": "Feb 15, 2009", "userURL": "http://www.goodreads.com/user/show/1906867-kim", "userReview": "Summary: When Hannah opens the door during Passover Seder to symbolically welcome the profit Elijah, she suddenly finds herself in the unfamiliar world of a Polish village i the 1940's. Hannah had always complained about listening about listening to her relatives tell the same stories of the Holocaust over and over, but now she finds herself in terrifying situation. The Nazi soldiers have come to take the villagers away, and Hannah can guess where they are going. Response: I loved this book. Being Jewish, Passover is a huge holiday in my family. I can relate to Hannah. I remember thinking that Passover Seders were boring when I was younger. It wasn't until I was older that I learned to fully appreciate the holiday. This book transforms the reader into the Holocaust through the eyes of a child. I think this would be an excellent book to use in the classroom during the study of the Holocaust to show the students a different perspective."}, {"userName": "Lars Guthrie", "userReviewDate": "Dec 13, 2008", "userURL": "http://www.goodreads.com/user/show/757602-lars-guthrie", "userReview": "Yolen employs a \"Magic Tree House\" trope to move her main character, Hannah, a bored American thirteen-year-old at her family's Seder dinner, through time, space and language, and it comes off as hokey. Once Hannah becomes Chaya, an orphan living in a Polish village in 1942, though, this tale grabs onto the reader and doesn't let go. Hannah opens the door of her family's apartment to welcome the prophet Elijah and is soon crammed into a crowded cattle car with other Jews on a train destined for the \"final solution.\" Yolen makes such a narrative more than a recounting of horror and the inhumanity of humanity with strong characters and a strong story. By the time Hannah re-enters the present and pleasant Passover gathering with heightened respect and empathy for her Holocaust-surviving grandfather and aunt, I was willing to forgive the contrived device. After all, it's one that works for kids in any number of series. And in the end, it did so here. The novel prompts young readers swept up in Yolen's carefully researched tale to make the effort to remember what must never be forgotten."}, {"userName": "Lindsey", "userReviewDate": "Nov 14, 2008", "userURL": "http://www.goodreads.com/user/show/1712996-lindsey", "userReview": "Anyone and everyone should read this book! It's a very fast read because it was written for children but it tells a beautiful story and has a great twist in the end. The Devil's Arithmetic is about a young Jewish girl who doesn't quite understand her family's past. She finds Jewish holidays and celebrations to be boring and is unappreciative of the hardships Jews have faced. She is mysteriously transported to the past and ends up in a concentration camp. Here she suffers the hardships first hand and begins to understand and appreciate her family's history. Heads up, it's a tear-jerker!"}, {"userName": "Agnė", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/22440207-agn", "userReview": "The Devil’s Arithmetic is a moving and heartbreaking young adult fantasy/historical fiction novella grounded in the real events that happened during the Holocaust. However, I found the first half of the book to be tortuously slow and boring."}, {"userName": "Loralee", "userReviewDate": "Dec 29, 2008", "userURL": "http://www.goodreads.com/user/show/1817661-loralee", "userReview": "This touching book uses time travel to help one young girl understand her Jewish heritage. One of the main themes is not to forget the past but learn from it. These memories include remembering the Holocaust.The book opens with Hannah being reminded why she celebrates Passover. \"Passover isn't about eating, Hannah....It's about remembering.\" (p.4) Once Hannah is transported back into time and begins living the life of Chaya she reflects on the things she's learned at family dinners and in classrooms. \"She kept remembering more and more, bits and pieces of her classroom discussions about the Holocaust. About the death camps and the crematoria. About the brutal Nazis and the six million dead Jews...A strange awful taste rose in her mouth, more bitter even than the Seder's bitter herbs. And they were for remembering.\" (p. 72) When she reaches the concentration camp, she's told she must remember her new identity. \"'You are Chaya no longer, child. Now you are J197241. Remember it.' 'I can't remember anything,' Hannah said, puzzled. \"This you must remember, for if you forget it, life is gone indeed.'\" (p. 100) Once Hannah returned to present day life, she discovered that her aunt was her old friend in the concentration camp. \"Aunt Eve closed her eyes for a moment, as if thinking or remembering. Then she whispered back, 'His name was Wolfe. Wolfe! And the irony of it was that he was as gentle as a lamb. He changed his name when we came to America. We all changed our names. To forget. Remembering was too painful. But to forget was impossible.'\" (p. 163)"}, {"userName": "Janette", "userReviewDate": "Oct 11, 2009", "userURL": "http://www.goodreads.com/user/show/1292612-janette", "userReview": "I usually read to avoid hearing about depressing subjects but I went ahead and read this one even though it was about a Jewish girl living during WW2.It was a good book, and I got choked up in the end. Then I couldn't get to sleep at night because I was too busy pondering how civilized societies are capable of butchering millions of people. It seems so impossible, and yet it's happened more than once in history. It makes you look at your friends and neighbors and wonder what sort of hearts of darkness might be there.And it makes you wonder what might happen again in the future. What would I do if the government came for me or for my neighbors?I know it's not the purpose of the book--but it did make me want to go out and buy a gun for the first time in my life. If the Jews had been armed, it would have been a different story.Anyway, this was a good book and it made you think--although I go back and forth as to whether it should really be in the juvenile section. I'm not sure it's a book I'd choose for an eight year-old. I mean, if I had trouble sleeping after reading this book, it might be too much for a young child to handle. Parents should probably read it before checking it out for their children."}, {"userName": "Ayanna Dukes", "userReviewDate": "May 20, 2014", "userURL": "http://www.goodreads.com/user/show/27434494-ayanna-dukes", "userReview": "So, during school (L.A) we're learning about World War II and the Holocaust, I've always wanted to learn more about both topics. My teacher suggested this book to me, and I'm happy that she did. I've never, so far, read a book like this in my life. First of all, this was the first Holocaust book I've read. I just love how this book starts and ends, sort of like a circular ending. Most books wont make me shed tears but this one did. I think it was amazing that Hannah the main character, got to go back in time to 1942! It was nice to see things from her perspective. This kept me at the edge of my seat, it was a little scary not knowing what was going to happen next. I really enjoyed this book, and I recommend it to anyone who is looking for a good Holocaust book."}, {"userName": "Cassandra Ramos", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/7142068-cassandra-ramos", "userReview": "My son came home last week and said “mom can you believe my language arts teacher is making us read a book this close to the end of the school year?” Being the book nerd I am I became excited and asked what’s the name of the book and he says “The Devils Arithmetic” well I had never heard of the book and decided to read up on it. After reading the synopsis I immediately put the book on hold to pick up the following day. I read it in one fell swoop! I cried like baby snot cried! I read everything my kids read, and I’m glad that my son had the chance to read this ( or still reading). I think that all kids of appropriate age should read this book because it’s real, it’s what happened and children were involved. I have never understood the reasoning behind banned books... I get age appropriate, but books such as this one can teach them to appreciate the life that has been handed to them."}, {"userName": "Molly Grace", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/59893072-molly-grace", "userReview": "This book is really good!! It's about a Jewish little girl transported to 1942 Poland and is captured by the Nazi's and brought to a concentration camp. This book gives us more information about what everyday life was like. I prefer that people read this book!!"}, {"userName": "Kandice", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/1396160-kandice", "userReview": "Five stars for the plot device used to tell this story. This is aimed at very young readers and so the grisly subject matter must be presented in a way that allows them to read it without ruining their sleep. Having the main character, a modern day, young Jewish girl, living in New Rochelle, transported back in time does this splendidly.My three star review is because I didn't feel the story was written very well after that initial stroke of genius. I must admit that part of this could be that I was expecting a book aimed at teens and this was clearly meant for even younger readers, but I still struggled through after the set up."}, {"userName": "Luthien", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/3890428-luthien", "userReview": "Giving this book a star rating and a review feels…strangely inappropriate. No piece of literature is above critique, of course, but after I finished this one, I felt like I had the wind knocked out of me a little. Though it wasn’t flawless, but deconstructing it for a full-fledged review didn’t feel like a constructive exercise. . There are undoubtedly small inaccuracies which older readers, in particular, might find frustrating, but the spirit of the book matters more to me given the themes and audience of the story.No matter how many times you read or hear about the Holocaust, the full horror of it remains utterly debilitating.I’m giving it four stars instead of five for a few reasons. As a literary work, it is on par with Between Shades of Gray, which I also gave four stars—this one is written for a slightly younger audience, though it’s no less emotionally riveting. I also feel it may be a little too intense for its intended audience (readers between twelve and fourteen or so). Jane Yolen does not pull punches. Everything short of dying women and children clawing at the walls of the gas chamber is in her. My library has it filed under “Older Teens” in the YA section.The novel is, however, still relatively well-written from an adult perspective. Yolen keeps her prose simple and to-the-point. The parts in the book that take place in the present dragged a little, and modern Hannah’s voice annoyed me (on purpose, I’m sure). I’m not Jewish, but I have attended three or four Passover Seders—if I hadn’t, I’m sure the beginning would have totally confused me, but the dark twist on the “Dorothy goes to Oz” trope during the Seder was clever and well-done.By keeping the cast of characters to a minimum, Yolen also maximizes each character’s importance to Hannah, to the reader, and to the story as a whole. Most of them aren’t fully fleshed out (the novel is more of a novella at just 170 pages), but they’re real enough to tug at the reader’s heartstrings. The Holocaust is often dealt with numerically—even by Hannah herself as she frantically tries to warn her skeptical friends that the Nazis will murder six million Jews. Yolen does a good job of scaling the immediate tragedy down to a handful of that number, thereby humanizing and individualizing the victims.The camp narrative, which takes up about half of the novel, was just fictionalized enough—and given the staggering number of victims and Yolen’s own research, something like it very well could have happened even if this particular narrative is fictional. As I said, she doesn’t shy away from the fear and the trauma, though fortunately she keeps the graphic content (blood, waste, etc.) to a bare minimum. It’s no less horrific for being rather simple. Elie Wiesel’s very real memories in Night are recounted in a similar style.Though the time-travel setup is a bit hokey, I did like the way Yolen handled Hannah’s fading memories and foreknowledge. It fit nicely with the theme of hope, however small, and the need to keep it alive from day to day in order to survive. Would it be better to know the full horror that awaited you—the truth about these “factories of death”—Yolen asks through Hannah, or to be ignorant? My introduction to the Holocaust was the decidedly milder Number the Stars in elementary school, and my first serious contact with it came when I was fourteen during a visit to the Holocaust Museum in D.C.. I’m not sure there’s an age when a child is “ready” to be exposed to that sort of horror, but The Devil’s Arithmetic is not a book I would give to anyone under twelve or thirteen.Effective, touching, haunting, and sometimes poetic, this short novel is worth a few hours of your time even if you fall outside its target audience."}, {"userName": "Alex (not a dude) Baugh", "userReviewDate": "Apr 06, 2012", "userURL": "http://www.goodreads.com/user/show/4449236-alex-not-a-dude-baugh", "userReview": "Since tonight is the first night of Passover, I thought I would review a book that is appropriate to the season. I chose The Devil's Arithmetic because, like the Passover story, it is also about the importance of remembering who you are and where you came from. Hannah Stern, 12 but almost 13, is a happy girl living in New Rochelle with her parents and little brother, except that she doesn't want to go to her family's Passover Seder. Bored and apathetic, Hannah is tired of hearing her grandfather's stories about the past, including those about the concentration camp where he spent part of his youth. But this year's Passover holds a big surprise for Hannah.When she goes to open the door to let Elijah in, Hannah suddenly finds herself transported back in time to a Polish shetl in 1942, where her name is Chaya Abramowitz and she is living with her Aunt Gitl and Uncle Schmuel. Hannah learns that Chaya parents have recently died and she has been very sick. The next day, Chaya goes with her family to another shetl where Uncle Schmuel is to be married. But before that can happen, the entire residents of both shetls are rounded up by Nazi soldiers and sent on a days long train ride in a cattle car to a concentration/extermination camp. Before she knows it, the men and women are separated, their clothes are taken away, their hair is shaved off and a number is tattooed on their left arms. Chaya and Aunt Gitl are assigned to a barracks and give jobs to do.Working in the kitchen, Chaya meets Rivka, a wise ten year old who has survived life in the camp for a year and knows how to do things to avoid being \"chosen\" by the camp commandant for \"processing.\" So far, Chaya, Rivka and their other friends have been lucky, but can their luck hold out? And will Chaya ever become Hannah again and return to her present day family?The Devil's Arithmetic is a wonderfully well-written middle grade novel. The randomness of life for Jews under the Nazis is captured so well, as it the horror their methods, yet not to the point where it is so graphic it would turn kids away from the book or from learning about the Holocaust, but it does help understand at least the how of what happened.And yes, Hannah does remember what she had learned about the Holocaust in school and home, but little by little she finds her memory fading. Even her present day family begins to recede from her memory. And she does try to warn everyone about what happened to Jews in the Holocaust, but they find it so outlandish that they can't comprehend what she says. And who could blame them? While Hannah's experiences in the concentration camp point to the importance of remembering, they also demonstrates the perils of forgetting, a good lesson for us all to think about during this holiday season. This book is recommended for readers age 10 and upThis book was purchased for my personal library"}, {"userName": "Sara", "userReviewDate": "Dec 04, 2008", "userURL": "http://www.goodreads.com/user/show/1172784-sara", "userReview": "This was really sad and scary. But so REALISTIC!! It's terrifying to think that it acually would happen! (Not the time traveling, the concentration camp.) It is about a Jewish girl, Hannah, who is at a passover dinner, when she goes through a door and finds herself in 1942. Everyone knows who she is except herself. They think she is an orphan girl called Chaya, which is what her name is in some language. She makes five friends; Rachel, Shirfre, Ester, Yente, and Rivka. Rachel and Yente die on the way to the concentration camp, so they don't have a big part in the book. Rivka is not from the village, and they meet her at the concentration camp. At the end Ester, Shifre and Rivka get 'chosen', which means that they would be gassed. Hannah swapps places with Rivka to save her and gets gassed, but just before she dies she goes back to the present. She sees her Aunt Eva has the number J18202 on her arm, the ame number as Rivka. It turns out that Aunt Eva was saved by her friend, Chaya, at a concentration camp. Hanah was named after Chaya. The reason I read this in the first place was because we learned about concentration camps at school. They sound like something out of a horror movie! I feel so sorry for Jews during WWII."}, {"userName": "Jamie Barringer (Ravenmount)", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/5877880-jamie-barringer-ravenmount", "userReview": "This book is a bit like the Chronicles of Narnia, but with a dark twist. A modern, American Jewish girl opens a door and is magically transported back in time into the body of another Jewish girl, just before that girl and her entire village is transported to a Nazi concentration camp. All of a sudden the Holocaust, instead of tiresome stories drummed into her by her older relatives at holiday gatherings, becomes very horrifically real. Having read quite a few nonfiction accounts of the concentration camps and other horrors of the Nazi regime, I found this book very readable, a story that makes the camps and the people in them real, without the story feeling preachy or flat. Yolen does a great job of balancing the horror and hopelessness of the situation Holocaust victims found themselves in, while still maintaining a glimmer of hope throughout, since the story is told from the perspective of a descendant of a survivor who somehow not only was not destroyed by the camps and the Nazis, but who went on to have a family and a good life afterwards."}, {"userName": "Echo", "userReviewDate": "Oct 12, 2009", "userURL": "http://www.goodreads.com/user/show/437515-echo", "userReview": "Hannah is tired of her family's passover celebration. It's always the same every year, with the old people talking about concentration camps and the war and how important it is to remember, even though it all happened so long ago. Hannah just wants to be like other girls who get to eat candy and decorate Christmas trees and go shopping. But when Hannah is chosen to open the door to welcome the prophet Elijah as part of the celebration, she finds herself transported to another time and another country where a strange family calls her Chaya. Soon after arriving in this strange place, men in uniforms gather everyone in the community together and put them in trucks, and only Hannah knows where the trucks are going.This was a really good book, and the story was well told. I think it would definitely be a good book for kids to read to learn about the Jewish concentration camps in Nazi Germany."}, {"userName": "Sara", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/5507464-sara", "userReview": "What a good story. What a good reminder.  So often we get caught up in the busyness of daily life, and we forget. We forget that there has been so much suffering. And while it's not the same type of suffering, there are people all around us that are tormented in one way or another, and that need our empathy and sympathy.  As Winston Churchill is quoted as saying \"Those who fail to learn from history are doomed to repeat it\", I ask: what will we learn if we choose to not study and choose to forget?"}, {"userName": "Ariana", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/2359497-ariana", "userReview": "I read this with my daughters 6th grade reading group. I really liked the way that they introduced the story through the main characters eyes and how she \"experienced\" what her Grandpa and Aunt had gone through being Jewish and taken to the concentration camps. This was a great book for a 5th or 6th grader to read about this time period in history."}, {"userName": "Melanti", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/3034846-melanti", "userReview": "Most of Yolen's work that I\"ve read so far has been fairy tale related - including other work centered around the Holocaust. So I was a bit surprised that this has only a mild time-traveling plot device but no fairy tales or any other fantastical elements at all. But I still really loved it, as I do most of Yolen's work."}, {"userName": "Clarissa Johnson", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/55511201-clarissa-johnson", "userReview": "I would have much more enjoyed this book had I read it in middle school or even high school. While it is too simply put for me now, I think it would have hit me hard as a preteen/teenager, and I definitely would suggest it to a younger crowd."}, {"userName": "Andrea Kulman", "userReviewDate": "Feb 24, 2009", "userURL": "http://www.goodreads.com/user/show/1161970-andrea-kulman", "userReview": "This book captivated me from beginning to end. The story flowed as if a conductor were actually standing before an entire band conducting a piece of music from Mozart. Such a strong story."}, {"userName": "Will Devane", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/46852505-will-devane", "userReview": "It was a pretty boring book. It took a while to get good and when it did get good it wasn't all that great, and it didn't last that long. Overall, it was an ok book."}, {"userName": "Morgan", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/71155972-morgan", "userReview": "The book, The Devil's Arithmetic, is by Jane Yolen. It takes place in New Rochelle, New York where a thirteen year old girl Hannah lives. Her family is Jewish and they are going to her grandparent's house to celebrate the Jewish holiday, Passover. One of their traditions is to welcome the spirit of the prophet Elijah by opening the door of their home. When Hannah opens the door she time travels to the past. She is a part of a family who calls her Chaya. She is very confused, but reluctantly goes along with it. The family she ends up with is taken by Nazis to a concentration camp. The setting is now in 1942. Hannah ends up meeting a girl named Rivka and many other women who help each other survive. Eventually, she returns back to her regular life in modern-day New York. The author uses literary elements like imagery and situational irony. I really liked this book, but if you don't know what the Holocaust was then you might have a hard time reading it. I thought the book was very well organized. Overall, this book is an emotional roller coaster and should be read by teens and adults.The Devil's Arithmetic has spectacular use of imagery. It helps the reader understand what Hannah is seeing. The author says, \"Outside, where there should have been a long, windowless hall with dark green numbered doors leading into other apartments, there was a greening field and a lowering sky\" (pg 20). The author's use of descriptive words of what should have been a hallway is actually a field. Words like \"dark green numbered doors\" and \"a lowering sky\" can help the reader create an image in their mind. Another example of this is when Hannah saw a child's body in the camp, \"Little Tzipporah lay curled in a ball, her finger in her mouth like a stopper in a bottle\" (pg 106). You can imagine what Hannah is seeing; this girl laying perfectly still curled in a ball. It also uses a simile by comparing the girl's thumb in her mouth to a stopper in a bottle. This comparison helps the reader by comparing the thumb in her mouth to a better visual reference. Lastly, this book has situational irony at the end. I can't give any spoilers, but I'll say that the part of the book made me surprised. I'm sure no one will suspect it. These are some insightful things about the book.This book did have some flaws. For instance, it used lots of Jewish vocabulary that sometimes made the book hard to follow. For example, \"At her urging, he plunged into the Second Question, chanting the Hebrew perfectly because he'd memorized it\" (pg 14). Many people might not know what the \"Second Question\" is or the \"Hebrew\". I know what the Hebrew is, but I'm not sure about the \"Second Question\". Also, if you do not know what the Holocaust is then you are probably too young to read this book. Hannah says, \"They'll take you from here and put you in a concentration camp. Then they'll put you in gas ovens and kill you.\" This, in my opinion, is too horrific for a younger audience. That is why I recommend teens and adults read this book. If you are interesting in the Holocaust like me, I would recommend reading it. Thus, this book was a good read. I personally liked it. The whole book is mostly entertaining and suspenseful. Jane Yolen uses some literary elements like similes, imagery, and situational irony. That helped me understand the book better. The only confusing part about this book was how much Jewish vocabulary was used. It was difficult to understand some parts of the book. It was suspenseful and emotional. The Holocaust is difficult to talk about because many people lost their lives. The author does not sugar coat things. In conclusion, The Devil's Arithmetic is a book I would recommend to teens and adults."}, {"userName": "Brayden", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/71704053-brayden", "userReview": "In Jane Yolen's novel, The Devil's Arithmetic, a girl from a Jewish family, is herself magically transported to a village in Europe during World War II. The villagers, all Jewish, are taken by Nazi soldiers to a concentration camp. During the story, many of the villagers are sent to the gas chambers, chosen for death by the camp leaders. The girl, Hannah Stern, slowly begins to lose her memory of her life and her family in her real hometown, as the events of her new life increasingly take over her consciousness. Her suspicion that she is in an elaborate dream gradually gives way to the reality of the camp. There, her name is Chaya Abramowitz, but even that is taken away by the Nazis, who tattoo the arms of all the prisoners with identification numbers. Hannah and her family were helped at the camp by a girl named Rivka, which turned out to be Hannah's mother in the future. Her own family has been killed by the Nazis, except for one brother, named Wolfe. Rivka teaches the others tricks of survival in the camp, but not everyone will listen to her. Hannah follows Rivka's advice. Occasionally, Hannah briefly remembers something from school about the Nazi atrocities.In the book their are multiple themes. For example, in the beginning Hannah heads over to her entire family to spend passover with. She says to herself on multiple occasions that she was tired of dealing with family members. This changes when she is magically transported to the past, when she is un able to contact her family she realizes how much she misses them. For instance in the book it says that, \"She remembered her mother and father and her brother Aaron with his big blue eyes and big smile.\" This i put into the theme of don't take family for granted becuase before she always did but once she went to the past her views changed Another theme in the book was respect the wise. In the beginning Hannah never really took Grandpa Will and Gramma Rivka seriously about how they talked about the war and how they were put into concentration camps and forced to watch the horrors of the war. Grandpa Will had lasting effects and this made Hannah very resentful toward him...Untill she went to the past. When she was introduced to the concentration camps she realized first hand the horrors of the past. This book goes greatly with the Nazi government and explains how they put Jews into concentration camps and terminated them. Hannah was a fictional character but it represented a true story."}, {"userName": "Tina", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/8445066-tina", "userReview": "Hannah is a bored preteen, tired of her Jewish family's traditions and her weird grandfather's outbursts. On the night of Passover Seder, she opens the door to greet the profit Elijah, but instead enters the past. Now she finds herself in the train being shipped to the camps for processing, were every day is one more day she's alive. This book is important. Told in a manner preteens can understand, it tells of the horrors of life in the camp. Little it held back. There are better books of this time period, like Someone Named Eva, and there are way worse (Boy in The Striped Pajamas), but this book is one of the few for fifth grade and up that tells of camp life. Families are separated, Children die, tears are silent, and rebellion comes in the form of witnessing and remembering. Too many remain with tattooed numbers on their arms with their own stories to tell and yet, too many still deny it happened. Until evil is vanquished, books line this need to remain. I read this book so that I could determine if my son was capable of reading this book. I will be handing it to him tomorrow. Why? Because this book is important."}, {"userName": "Sheri", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/6970638-sheri", "userReview": "So this was okay. I hate to come across as spoiled modern white folk, but I was intensely bored with the concentration camp stuff. The intro was okay and the idea of sending a normal, modern girl into the past was unique. I liked her confusion as she acclimatized to the past in rural Poland, but then we got to the camp and it was roughly 50 pages of the same stuff. Yes, I know the camps were horrible, but the text felt rather stagnant until Hannah was transported back to modern time at the very end.It is an approachable way to teach kids (middle school or high school, I wouldn't give this to anyone under 12-14) about the Holocaust and this is important stuff. I just felt like the middle section dragged a bunch."}], "description": "Hannah thinks tonight Passover Seder will be the same as always. But this year she will be mysteriously transported into the past. Only she knows the horrors that await.", "title": "The Devil's Arithmetic", "url": "http://www.goodreads.com/book/show/91357.The_Devil_s_Arithmetic", "average": 4.02, "cover": "https://images.gr-assets.com/books/1342046407l/91357.jpg", "reviews": 2024, "authors": [{"url": "https://www.goodreads.com/author/show/5989.Jane_Yolen", "name": "Jane Yolen"}], "type": ["Historical", "Young Adult", "World War II", "Fiction", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/91357.The_Devil_s_Arithmetic", "http://www.goodreads.com/book/show/906391.The_Devil_s_Arithmetic", "http://www.goodreads.com/book/show/1033828.The_Devil_s_Arithmetic", "http://www.goodreads.com/book/show/1033829.The_Devil_s_Arithmetic", "http://www.goodreads.com/book/show/38730314-the-devil-s-arithmetic", "http://www.goodreads.com/book/show/906390.The_Devil_s_Arithmetic", "http://www.goodreads.com/book/show/228696.Owl_Moon", "http://www.goodreads.com/book/show/122125.How_Do_Dinosaurs_Say_Good_Night_", "http://www.goodreads.com/book/show/81153.Briar_Rose", "http://www.goodreads.com/book/show/201054.Dragon_s_Blood", "http://www.goodreads.com/book/show/340489.How_Do_Dinosaurs_Eat_Their_Food_"]}