{"ratings": 13298, "userreviews": [{"userName": "Randy", "userReviewDate": "Jul 15, 2012", "userURL": "http://www.goodreads.com/user/show/1918807-randy", "userReview": "Periodically, while reading \"The Dirty Life\", a book which I loved, I found myself thinking about \"Eat, Pray, Love\", a book I hated for its solipsism. The protagonists in each book are both writers, living the Yuppy life. Their paths diverged with Elizabeth Gilbert ending up as a famous author while Kristin Kimball, in an unbelievable life shift, becomes a farmer now helping to produce food for more than 200 families from a 600 acre farm in Essex, New York.I'll return in a minute as to why I think \"The Dirty Life\" is way more interesting and inspiring than \"Eat, Pray, Love\". First, here's Kristin Kimball's story in brief: A Harvard grad and NYC free lance writer, living the cafe life, dating a variety of NYC characters, feels a tingling to have a \"home.\" She visits a farmer named Mark, a tall, good-looking fellow with a Swarthmore degree, to interview him for an article on young farmers. Mark is busy and puts her to work. At the same time Mark, an impetuous fellow, decides that Kristin is the woman he must marry. From here the book spins out the details of their unlikely romance, Mark's ability as a farmer/salesman, Kristin's unexpected decision to give up NYC and join Mark in his quest for a farm, their stormy partnership and the struggles of their first farm year told season by season culminating in their chaotic wedding. Along the way we learn much about driving teams, animal husbandry, sugaring, pigs, milking, plowing, butchering and other subjects that make up a dirty life.Mark had an unbelievably ambitious vision. He wanted to provide a full service CSA (Community Supported Agriculture). That is, he wanted to provide his members with all of their food: meat, fowl, dairy products, vegetables, sweeteners (maple syrup) and even firewood. More than that, he didn't want to limit his members but to let them have as much as they wanted, to encourage them to put food by. In addition, he wanted to farm using old methods, primarily with teams of horses.Fast forward and check out their website http://www.kristinkimball.com/ which reports that they now have 222 members who pay approximately $3000 per year each for the privilege of sharing in the bounty. Essex Farm has nine draft horses, a few tractors and ten employees.I've read a lot of back to the land memoirs in the last few years and this is the best one. The lesson is clear. The work is hard. The work is unrelenting. The work is satisfying. Clearly, the world needs more Mark Kimballs (who took his wife's last name when they got married as she didn't want to change hers). He comes across as idealistic, super energetic, charismatic, dogmatic, relentless, likable, visionary and invincible. We need to clone this guy.In \"Eat, Pray, Love\", Elizabeth Gilbert gives up home to find herself. I don't know if she did or not because I couldn't finish the book. The fact that \"Eat, Pray, Love\" resonated with so many people disturbs me. My inspiration these days comes from people like Kristin and Mark who actually do things rather than just think about them and write about them. By way of comparison with Ms. Gilbert, in \"The Dirty Life\" Kristin Kimball gives up finding herself for a home and, in the end, offers a simple paragraph of explanation:\"And this is the place where I'm supposed to tell you what I've learned. Here's the best I can do: a bowl of beans, rest for tired bones. These things are reasonable roots for a life, not just its window dressing. They have comforted our species for all time, and for happiness sake, they should not slip beneath our notice. Cook things, eat them with other people. If you can tire your bones while growing the beans, so much the better.\"Mark and Kristin have recreated an early twentieth century subsistence farm. Though it might seem unusual, the fact is that this type of farm operation was ubiquitous only two generations ago. Just over fifty years ago I was able to spend time on my own grandparents farm where they produced virtually everything they needed and traded for what the couldn't grow or raise. Two generations later many skills have been lost or gone dormant. It's comforting to know that here and there young people are working it out, getting down with the dirty life."}, {"userName": "Daniel Audet", "userReviewDate": "Nov 22, 2010", "userURL": "http://www.goodreads.com/user/show/4411850-daniel-audet", "userReview": "As I was reading what I knew would be the last few sentences of this book and then forced to, reluctantly, put it down I took solace in the idea and fact that as I was reading here today Kristin and husband Mark and their team on the farm were actually out working, doing many of the things I read about in her book. So, maybe there will be a sequel, the next 7 or so years.  Somehow in a very deep way this effort from Kristin Kimball touched me, connected the dots in me and for me in ways I heretofore couldn't do for myself. Maybe it was the struggle, the subterranean emotional ones or the literal variety, like, hard work, that were easy for me to relate to. Or, maybe it was her fearless trek inward AND hard work outwardly AND her willingness to plunge into both, always mindful of her fears, her doubts. I don't know, I just know something in me clicked. Based solely on the worth and substance of her personal struggles, overcoming her fears and trepidations, her development and character growth, this book could stand on it's own and Kristin would be hailed as the new Dr. Phil or Dr. Jane or Dr. Laura. She has however chosen to use whatever gain, whatever experience teaches a person to continue to use it to build her dreams with her family, friends and community, on, of all places, a farm. From a writerly standpoint this book exhibits a very high standard of skill, while literally keeping the reader grounded to the earth, in many ways. Passages regarding horses, seasons passing, description of the sights and sounds and smells and tastes of life, all, translated beautifully enough to bring the most knowing editor to tears. I read and re-read numerous pages again to try to absorb the flow, the translation the type of which only the heart can understand, but the technical mind marvels at. Yes, like I said earlier this week in an update and I'm completely serious, this book could stand with any authors work on any level technically, and as a non-fiction entry to the book hall of fame I believe it will take it's place in a category all it's own. Building bridges is easier when you know how, it becomes remarkable when someone builds a bridge across the great divide within themselves, using, as Kristin put it, \"The great gift of an Ivy League education.\"(Harvard) NOT knowing how and documenting the struggle using writing skills learned while creating a life that requires immeasurable sacrifice and effort, which she now lives, was a bridge building experience all it's own too. THIS is why this book is SO worth anyone's time. I myself know that a farm or ranch can test you, it can teach you, it can wreck you and it can save you and just like life, and it IS life, the cycle of seasons, plants growing, critters spending their lives doing what they do, well, it's where we've all come from at one time or another in our family histories. Kristin Kimball wrote this book about her life, \"The Dirty Life\". It's about her hopes, her dreams, her fears and weaknesses, a farm, a man, more hopes and dreams and struggles and finally - we get it. We get what it all means. And what it all means, part of it anyway is that with you or without you the land stays, and time rolls on. At that moment you'll look down at this book in your hands and say, \"What just happened?\" You'll realize how amazing it is to have just read a book where a woman built bridges within herself, between herself and the 21st Century, and our ancient agrarian past and did it with such style that it might just defy the imagination, if it weren't true. Buy this book and for a little while you too can live - The Dirty Life.Next time your in the bookstore or in an online bookstore, peruse a few pages, you'll see what I mean.Follow Kristin on Twitter http://twitter.com/k_kimball , from there follow links out to her site. Someday I just might hook up the camper to the pickup and head north to volunteer at this farm. Seems like the thing to do. Yep.____________________________________________________________________________________________________Really, I can't say enough about this book and Kristin. Her candor is so refreshing, since, as you might guess the farm life is not an easy one. Her and Mark, started out like a lot of young couples with hope, on a wing and a prayer. If you are an \"outdoorsy\" type or not, what you'll find here is pure inspiration. This is a woman's journey, with no symbolisms or cliches, just a hard fought - joy filled struggle. One, at times, with despairing and fearful moments but she always remains clear about her vision and willingness to step up and deliver, whatever it takes to see her and her husbands dreams and lives become one. I do not know this author but even after 200 or so pages in, I feel like I do. You will not be stumbling over an amateur's writing here, Kristin is very much a pro, having a background in freelancing and the NY publishing scene. Really, a good book!____________________________________________________________________________________________________I read the review for this book in The New Yorker magazine a few weeks ago and though I don't really read a whole lot of non-fiction, having been a ranch owner and in the near future, Please God Please, to be one again soon, I love this real life story and the very idea of living it myself. I plan to study how they created and maintain a self sustaining farm. It's modern in that she was a NYC resident and her husband, a real cowboy/farmer, studied what they needed to do and did it. But it's a throwback to a simpler time too in many ways because they use old tried and true farming methods from many generations ago and actually use draft horses for most of the heavy work. WOW! That sounds real good to me. Kristin left her life, partially, in the NYC publishing circle to become a working farmer, while still holding onto her dream to be a writer.So, now that I'm into the prologue, the first thing that struck me was how well she writes! Not that I expected anything less but still, her skill level is top notch. You'll notice this right away too. I'll keep you posted on my thoughts and my progress as I happily devour this book!"}, {"userName": "Judy", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "So there I was, eating haute cuisine in a mobile home. He cooked for me as seduction, a courtship, so that I'd never again be impressed with a man who simply took me out to dinner. And I fell in love with him over a deer's liver.Kristin Kimball lived, breathed and played in NYC until the fateful day she visited an organic farm with the intent of writing a magazine article. Dressed like a city girl she got drafted to help out until the farm's owner could spare time to talk to her. That was the beginning of the end of city life for Kimball and the start of a new love for Mark, her future husband, and farming. It may be my love for the farm-life or maybe she is an exceptional wielder of words but this book read like a beautiful melody to me. I laughed a lot, cried a little and pulled for Kristin and Mark as they began their journey together as owners of a CSA.This is the best memoir of this type, surpassing Animal, Vegetable, Miracle: A Year of Food Life in my estimation. Not only is Kimball an excellent writer in the classic sense, she knows how to evoke emotion...the reader feels like he/she is along for the ride.Here is a humorous tidbit (from page 189). Mark & Kristin were having difficulty interesting their CSA members in scrapple. Scrapple was a congealed pork concoction they were introduced to by Amish friends. Kristin had promoted it in their weekly newsletter.....In my zeal and my Spring delirium, I thought \"lovely brown gelatinous bricks\" sounded appetizing, which tells you why Mark is in charge of advertising. Ah, lovely brown gelatinous bricks doesn't whet my appetite either. Its a good thing Mark took charge of advertising!This was a book I eagerly anticipated picking up each day. It joined a select few books I've read throughout my life that I didn't want to end. I don't expect others to fall in love with it as much as I did unless they love the type of life that Kimball describes as much as I do. However, I'd be surprised if her readers didn't relish her story."}, {"userName": "Guy Choate", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/1250208-guy-choate", "userReview": "Kimball does a good job in using this book to remove any romantic notion of leaving city life for that of the farm life. Or maybe she enriches that notion for the person who truly wants to seek that farm life. Either way, she gives what I assume is a realistic view of the commitment that a farm is--the cow always has to be milked. I appreciated her straight-forwardness in that. If Kimball is anything, she seems honest, both about the farm and her relationship.There are a lot of characters that are constantly coming and going, which is indicative of the helpful nature of those involved with Kimball's farm, but it made the story hard to follow at times. Kimball wrote well enough of the animals, though, that they were easy to keep up with. And, when they were gone, I couldn't help but mourn the losses with her. I do think there was about 75 pages in the middle somewhere that I can't recall for the most part, and which should be considerably slimmed down."}, {"userName": "Lyuda", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/11624147-lyuda", "userReview": "Question: Why is farming like a relationship?Answer: Because you do not reap what you sow. That's a lie. You reap what you sow, hill, cultivate, fertilize, harvest, and store. ― Kristin Kimball, The Dirty Life: On Farming, Food, and Love I can count on my fingers the number of memoirs I've read. And the ones I did were either just plain not interesting or the writer came across as self-absorbed and narcissistic to the point of being off-putting. So, I started this book with a great deal of reservation considering its genre and the subject matter (farming) and…. imagine my surprise when I plowed through The Dirty Life in less than two days. I couldn't stop reading it. And when I finished, I wanted to know more about the author's farm,...so I went on reading her blog, watching You Tube interviews. I was totally fascinated!From \"About Kristin Kimball\":\nI was born in 1971, and grew up in central New York. I graduated from Harvard in 1994, then moved to New York City, where I worked at a literary agency, taught creative writing, and freelanced for magazines and travel guides. In 2002, I interviewed a wingnut farmer named Mark, and took more than a professional interest in both him and his vocation. We founded Essex Farm together in 2004 – the world’s first full-diet Community Supported Agriculture (CSA), as far as we know – and I’ve been professionally dirty ever since. \nThe book starts with this first interview and continues with a captivating chronicle of the couple's first year on Essex Farm in Upstate New York.Kristin Kimball does not romanticize her new found adventure; rather with a sprinkling of humor she exposes a life of exhausting days, grueling work and dirty fingernails. There are passages in the story that are not for a fainted heart, specially, for city people like me who associate meat with neatly packaged variety in the local supermarket. She is such a talented writer. I never thought I would find milking of cows or pulling weeds so captivating. And her descriptions of the gourmet meals made from their fresh farm products...Oh, they were so vivid and drool-inducing..The book is much more than depiction of farm life. It's a quiet love story. It's a story of courage, conviction, and dedication to ones goal. It's a truly inspirational story!My favorite quote: “‎A farm is a manipulative creature. There is no such thing as finished. Work comes in a stream and has no end. There are only the things that must be done now and things that can be done later. The threat the farm has got on you, the one that keeps you running from can until can't, is this: do it now, or some living thing will wilt or suffer or die. Its blackmail, really.”"}, {"userName": "Alexis", "userReviewDate": "Jan 19, 2011", "userURL": "http://www.goodreads.com/user/show/689723-alexis", "userReview": "This non-fiction book begins as a young journalist from the city interviews a hot, young, single farmer and falls in love with him. They move to the country, decide to get married and start up their own CSA. Question number one- I'm an agricultural journalist. WHY HASN'T THIS HAPPENED TO ME????(Perhaps it is because I interview farmers all the time, but generally they aren't young, single or hot. Admittedly, some of the older farmers who like me often make a point of mentioning their single sons or grandsons.)On the other hand, I can be poor and sit in my own apartment writing and enjoy the pleasures of the city, or I could be poor out in the country, get up at absurd hours and be covered with manure. Anyway, this book made me smile a few times and it was a pretty interesting story. I really like how the author didn't glamourize farming and talks about how hard it is and how much of a financial crapshoot it is. She also talks about the difference between book smarts and farm smarts, and how being educated might not actually help you out on the farm.I also liked how she was honest about her marriage. She admitted that at times she balked about her engagement, that it was difficult to run a business with someone you love (lots of farm couples get divorced in tough times), and that when you get married, you have to accept a certain lifestyle and say goodbye to some other options. I thought this was extremely refreshing, and honest and something that people don't talk about that much.I also liked some of the farming details- particularily the details about her dairy cows. The Kimballs farm using draft horses and I have to admit that that didn't interest me as much as it should have. These people also eat amazing food."}, {"userName": "Linda", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/3919132-linda", "userReview": "THE DIRTY LIFE was an engaging, often funny, true-to-life tale of two young people who meet, fall in love and marry. Their quirky life with all its ups and downs was refreshingly interesting. Kristin was raised in an upper middle class family with parents who mimicked Ward and June Cleaver. She graduated from Harvard University and traveled the globe writing various articles. Mark, on the other hand, grew up with folks from the hippy generation. He was down-to-earth: a farmer, gardener, chef and homesteader. He valued what was earned from the land. Kristin had an amazing way with words; she made me feel like I was near her watching things pan out. This is a non-fiction story for those of you that like memoirs. Or homesteading. Or good food. Thank you, Gita, for bringing this story to my attention and, Lyuda, for your wonderful review!"}, {"userName": "Michelle Gragg", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/589137-michelle-gragg", "userReview": "I did not think this would be a page turner, but it was for me! This is a story about the authors transformation from city girl to farmer. I loved her ability to describe her journey without making the reader feel like it should be theirs, or that it shouldn't. An excellent read!!!"}, {"userName": "Jane Stewart", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "Educational about animals and work on a farm. It kept my interest.This is not the kind of book I usually read, but someone gave it to me. I was surprised that it kept my interest. Only a couple times did I skim a paragraph or two.College educated city girl Kristin leaves that life to be with Mark a farmer. The two of them work every day to exhaustion. Emergencies and work never end. Kristin initially went with Mark because she desired family and children and maybe felt like something was missing in her life. Later when she left the farm temporarily, the two things she missed most were the land and the work. She was surprised it wasn’t the animals.Their life was one of financial poverty - but rich in other ways. Kristin’s advice/thoughts about comfort and happiness in life “Cook things, eat them with other people. If you can tire your own bones while growing the beans, so much the better for you.”Their farm had members who paid a yearly fee. Members would get all the meat, milk, eggs, vegetables, etc. that they wanted from the farm during the year. Mark wanted to do everything possible with horses rather than tractors. Their operation was similar to the Amish although Mark and Kristin were not Amish.This book is mostly about Kristin’s first year farming. The end of the book briefly summarizes some subsequent years.DATA:Narrative mode: 1st person. Story length: 273 pages. Swearing language: the f-word once (I think). Sexual content: none. Setting: current day mostly upper New York state. Copyright: 2010. Genre: nonfiction, farming."}, {"userName": "Sarah", "userReviewDate": "Dec 23, 2010", "userURL": "http://www.goodreads.com/user/show/1802912-sarah", "userReview": "This book fits into the whole foods, local grown, thinking ecologically about how we eat genre that is popular these days. Coming from Nebraska, it was nice to read a book that talks about farming as a nontrivial, nonmenial career. I suppose some might argue that Kimball glorifies it all a bit more than she should, but I'm not convinced. She talks about sleeping in a rat infested house and goes into pretty explicit detail about animal slaughter and birth. I tend to enjoy the whole local grown whole foods style books so it isn't surprising that I enjoyed this one. However, I was pleasantly surprised to find more than just these ideas in this book. This book also talks about controlling your own life and making decisions that might seem crazy to everyone around you. The idea of leaving everything for a life where you understand your impact and the outcome of your decisions really resonates with me after a long number of years in higher education. (No worries, I'm not planning on abandoning everything for the farm just yet.) I think many people who are feeling lost in our \"new digital age\" might enjoy this book for that perspective, even if they aren't into the organic farming movement."}, {"userName": "Gregory", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/573046-gregory", "userReview": "I picked this book up at the library primarily because I had, had a fruit/vegetable for lunch that looked like a tomato, smelled a little bit like a tomato, but tasted nothing like the fresh from the garden tomato's that I remember eating as a child.Kimball gives us an amazingly good look at her move from New York writer to Old Wave farmer. We also learn a little about local sourcing and Ms. Kimball's interior life as she makes the transition. Having grown up on something resembling a farm I understand the never ending chores of chopping ice on the pond so the cows could get water. Always being on a tether because something needed to be fed or harvested. But most of all that farming is HARD, let me repeat that, HARD work.Ms. Kimball helped me remember all the work involved when I get nostalgic and think I want a cow because I can't get butter that's smooth and creamy to melt on a homemade drop biscuit, and some chickens so I can have eggs where the yolks are so orange they're almost red, and maybe a few sheep oh and those tomatos...then my chosen reality sets in. ...but \"damn\" if the food didn't taste so much better."}, {"userName": "Lu", "userReviewDate": "Nov 15, 2010", "userURL": "http://www.goodreads.com/user/show/577741-lu", "userReview": "I really wanted to like - love this book. The ideas of running away from the big city to the country, to spend my days with real hard work instead of work that drives me crazy, and to enjoy the organic chaos of a farm instead of the mania that is modern suburbia all sound like the dreamy foundation of a book I'd love to lose myself in. I really wanted this book to be that escape for me - but the jumpiness of the writing was so prohibitive from achieving this escape and the focus of the book was more on day to day life on her farm than the experience of leaving it all behind as a working world escapee. It seemed like the author really wanted to document the activity of the farm instead of revealing an insider's view of what it feels like to escape. If I were to rename this book, I would have called it \"A Series of Short Stories About a Farm\" instead of the romantic, lucrative title it was given. So disappointed..."}, {"userName": "Anne", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/2967061-anne", "userReview": "The first two chapters about a NYC city girl falling in love and moving to a farm are endearing and funny. Kristin is a very good writer and she had really captured my attention at this point. But the book slowed down for me once the author got to her new life. Kristin was a travel writer prior to this farm gig and uses those skills to describe, in great detail, every experience, every piece of machinery and how it is used and every animal that is bought and slaughtered, etc.. All of this is interesting to a point, but I expected more depth and reflection in relation to her new life, her upcoming marriage and the birth of her first child. Without that the book became a string of events seen from a distance. Her attempt at a reflective look back in the epilogue just didn't work or even make sense to me. At the end of a memoir I should feel that I know the person and I'm disappointed that I don't know Kristin, but I know all about her farm machinery and her animals."}, {"userName": "Jackie", "userReviewDate": "Apr 22, 2011", "userURL": "http://www.goodreads.com/user/show/280172-jackie", "userReview": "I enjoyed this memoir and Ms. Kimball's story. It really was quite fascinating that she would give up everything she knew: her career, her home, her city all for love and a farm. During parts of the story I totally wanted to become a vegetable farmer. I quickly got over it and realized that a small garden with a few tomato plants would be all that I could ever manage though.There was a lot of farming jargon that I did not understand. I was reading it on my Nook, so I did a half-hearted attempt to lookup words but if the Nook didn't recognize it then I just moved on. So during those descriptions I could not visualize what she was talking about. This was mostly the machinery that they used for the fields.There was definitely a part where I skipped paragraphs. I am not a fan of weird foods. It makes me gag just thinking about them! Talking about eating hearts and livers made me squeamish enough but when she broke out the whole section on what they did with the testicles and blood, well, I just skipped the page. Seriously, I almost gagged. But that is just me.I did run into a few parts that I had to wonder if what she wrote was true, kinda true but embellished, or just made up all together. Blame this on my pessimism of memoirs. Between James Frey and now Greg Mortenson, I am totally wary. The first time I started questioning her was in the beginning of her story where she talked about cooking at the farm where she was interviewing Mark for the first time. In one paragraph she discussed her lack of cooking skills, even admitting that she never once used her oven in 7 years. The next paragraph was a huge description of how she walked into the very well stocked kitchen and knew immediately how to chop, steam, sauté and poach food. My friends that have no cooking skills do not even know those words let alone how to just immediately walk into a random kitchen and start doing all of those things. I’m a pretty good cook and I wouldn’t know the first thing to do with Kale let along to know to sauté it and then poach eggs in it. It seemed a bit of stretch."}, {"userName": "Alison", "userReviewDate": "Jun 13, 2012", "userURL": "http://www.goodreads.com/user/show/838613-alison", "userReview": "I thoroughly enjoyed The Dirty Life and read it in two days. I had a hard time understanding the inner transformation Kristin Kimball experienced, from city girl to farmer - or honestly, what she ever saw in her husband in the first place, since she paints him as an unsympathetic, crazy New Agish daydreamer - and that lack of depth would be enough to knock this book down another star, if she didn't do such a great job making me feel vividly both the difficulty and beauty of life on a farm (at least as much as paper and ink allow, which I am sure is really a pale shadow of reality) and the ability to make even an uncertain dream come true through sheer perseverance, in spite of almost complete ignorance and inexperience. The first half of the book is interesting, but she hits her stride about halfway through and there are some genuinely funny passages in the second half. Having just finished \"Folks, This Ain't Normal,\" by Joel Salatin, I found myself wondering about the legality of the haphazard way Kimball and her husband started their CSA program, as well as wondering how they handled all the paperwork and red tape from the start of their farm, but that information wouldn't really fit in this book, as it's not a how-to manual, but more a contemplative memoir. If you've considered farming, just moving to the country, or making a radical life change of any sort, I highly recommend this book."}, {"userName": "DocHolidavid", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/14732656-docholidavid", "userReview": "Try as I might to dislike The Dirty Life, it’s difficult to fault such an eloquent, honest, and authentic narrative. An impetuous young female writer, financially and emotionally destitute, longing for love, home and motherhood would have accepted almost anything making her life different. She did, surrendering to a willful man and his work.In a depiction of her man as the wizened one, she ever the apprentice, The Dirty Life is Kristin Kimball’s account of her introduction to horse powered community supported agriculture (CSA), and her courtship and marriage to Mark, a man of simple rural character who loves farming and remains true to his stated intentions and mate.Farming, love, and a battle of wills ignite a hectic and grueling life as Mark and Kristin continually fail in estimating their measure of physical, emotional, and psychological stamina against the size of their ambition and undertakings. They are assisted warmly by the kindness of their community. Anyone could find this book entertaining, but if you know the nature of erysipelas, a hame, and wet hay season – you might enjoy it more."}, {"userName": "Kate", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/454028-kate", "userReview": "After the first few pages of this book, I was sure it was going to be a detailed description of various meals the author had eaten. I wouldn't have minded as she is a kickass writer. But the book is more than that. It's how a Harvard-educated New York city writer falls in love with a Swarthmore-educated no-nonsense farmer, and how they build a life together, creating an over-the-top organic farm in upstate New York. And, as the title suggests, it's a dirty life--full of pigs, pig entrails, cows eating their own placentas, magnificent draft horses, clearing fields, harvesting, maple sugaring--just about everything you can think of that would happen on a small-scale organic farm. Conclusion? Farming the old fashioned way is nonstop hard work. But it is extremely rewarding in the end. Woven into the story of the farm is the story of her relationship with her man. I won't give it away, but it is very, very satisfying. Did I say this woman is an epic writer? She's an incredible writer. The kind of writer that would bring tears of joy to the cheeks of any English professor. I really, really liked this book. Definitely worth a read."}, {"userName": "Bev", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/6569053-bev", "userReview": "In this fascinating memoir, the author shares how she abandons heels and the bright lights of New York City to pursue a new relationship and a life of farming. I enjoyed the book because Kristin Kimball does not romanticize her newfound adventure; rather with a sprinkling of humor exposes a life of exhausting days and dirty fingernails, days compensated by colossal satisfaction and contentment. The book brims with stories of the challenges of working the fields with horses, raising livestock, growing crops, food, cooking, and finally the gratification of seeing their dream of abundantly providing food to the local community come to fruition. I LOVED the segments about food and cooking.Having grown up on a farm, here is a quote from the book that I feel accurately portrays the adventure of farming. \"You can't truly own a farm, no matter what the deed says. It has a life of its own. You can love it beyond measure, and you are responsible for it, but at most you're married to it.\""}, {"userName": "Denise Oyler", "userReviewDate": "May 22, 2012", "userURL": "http://www.goodreads.com/user/show/3432011-denise-oyler", "userReview": "Really enjoyed this book! It made me want to garden and farm and live an organic life. It made me think of my grandparents who were farmers and appreciate them more. The writing was beautiful! This quote really touched me: \"Some people wish for world peace or an end to homelessness. I wish every woman could have as a lover at some point in her life a man who never smoked or drank too much or became jaded from kissing too many girls or looking at porn, someone with gracious muscles that come from honest work and not from the gym, someone unashamed of the animal side of human nature.\" Amen!And this one is my favorite:\"In his view, we were already a success, because we were doing something hard and it was something that mattered to us. You don't measure things like that with words like success or failure, he said. Satisfaction comes from trying hard things and then going on to the next hard thing, regardless of the outcome. What mattered was whether or not you were moving in a direction you thought was right.\" Great advice!"}, {"userName": "Erica", "userReviewDate": "Mar 01, 2011", "userURL": "http://www.goodreads.com/user/show/4999807-erica", "userReview": "I value this book's stories about the trials of starting up a farm, of moving to a small town as an outsider, and of all the hard lessons that can only be learned through experience. I was annoyed by Mark's reckless \"Aw shucks, everything always works out\" attitude (taking huge gambles with no safety nets, ever), and by Kristin's persistent refusal to either embrace his approach or stand up to it - she always seemed resentful and ready to run. I kept wishing that their story could've been cozier throughout, with more laughs and teamwork (as they seemed to find at the end of this story) instead of the constant turmoil and escalating gambles. In the end, I'd call it interesting more than enjoyable."}, {"userName": "Amanda", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/10639187-amanda", "userReview": "This is an honest look at farming - the dirt, the heartbreak, the wonder, everything. While the author romanticizes farming to an extent, she is very direct about the difficulty of it as well. This book is not for the vegan or the weak stomached, as Kimball tells her readers about such things as animal butchering in a frank, detailed way. Her love for their farm and animals really shows through - the animals feel like secondary characters who are just moments away from speaking to her. I enjoyed the book quite a bit."}, {"userName": "Jane", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/156877-jane", "userReview": "I loved this book. It was more than enjoyable and interesting; the writing is terrific, and the account of life as a new farmer is filled with both concrete details and meaningful insights. Kristin Kimball is not just a farmer who has written a good book; she's a great writer who has a worthy subject.This is soooo not The Pioneer Woman. It's more like Little House on the Prairie, for adults. Yes, it's that good."}, {"userName": "Katie", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/1573197-katie", "userReview": "Good audiobook. I liked it ... It fueled my secret desire to be a farmer (or at least have chickens or a goat)"}, {"userName": "Zoom", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/1989201-zoom", "userReview": "First of all, she's a terrific writer. And secondly, she has the two things needed to write a great memoir: an interesting life and honesty. Kimball impulsively left her life in NYC to start a farm with the latest love of her life. The book is about being farmers - real farmers, with horses and horse-drawn tools, and a couple of cows that they milk by hand, and pigs and chickens and literally tons of vegetables. They work relentlessly throughout the growing and harvesting seasons, and the workload lightens in the winter. It's about farming, perseverance, fiery love, seasons, cycles, life, death, animals and human nature."}, {"userName": "Sarah", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/2506748-sarah", "userReview": "I read this book not long after finishing The Egg and I by Betty McDonald, another memoir about life on a farm (but set approximately 70 years ago and on the opposite side of the country). This book is the story of a woman who meets a farmer while doing some freelance writing, falls in love and gets engaged to him, and moves from New York City to live with him on a farm they are creating from scratch. She chronicles her life going from a city girl who cherished her silk blouses and heels to a woman more concerned with how to get the pigs from one barn to another without losing any. My timing was great for reading these two books so closely together because I was able to see very similar stories in two very contrasting circumstances.Ms. McDonald lived and farmed with her husband in the far northwest tip of the U.S. while Ms. Kimball lived and farmed with her fiance (for the first year) in the far northeast of the U.S. Ms. McDonald wrote during the 1930s while Ms. Kimball wrote during the 2000s. Ms. McDonald was rife with tale after tale of difficult, tiresome, and trying, yet always comical, situations in which she found herself as a farmer's wife. Ms. Kimball also wrote her own tales of difficult, tiresome, and trying times, yet her descriptions were focused on her evolution as a result of the experience as opposed to being portrayed as a comedy of errors. Ms. Kimball's story is a wonderful tale of striking out on a whim based solely on the nagging feeling that you are doing the right thing. She infuses her writing with the reasons she began to feel more and more at home on the farm than in the city and with her fiance turned husband at her side than a string of short-term boyfriends and a life alone. More than just a memoir, Ms. Kimball's story is also about the evolution of the farm she and her fiance created and how, as husband and wife, they've grown from having nothing to building a world where their local community can rely on them to supply fresh food that is sustainably raised with the aid of very little machinery. It is a wonderful testament to the simple joys and pleasures of life. It is a reminder that the food we eat is not just about a trip to the grocery store; it is about the ability of humans to share in the incredible power of bringing community together in nourishment, healing, and love."}, {"userName": "Chris Witkowski", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/5929196-chris-witkowski", "userReview": "I first read this book almost two years ago and decided to pick it up again in anticipation of the Friends of Schenectady County Public Library's planned trip to Essex Farm in May, 2014. I thoroughly enjoyed the book the second time around - in fact more so! The book is the author's account of how she left her glamorous freelance writer's life to marry a diehard, back to the earth man , who has a dream of starting a CSA farm that will provide all the food needs for shareholders, as much as a person could want, and then some. Kristin Kimball and her husband-to-be move to the North Country of New York and against all odds, make their dream come true, proving that hard work can be transformative. Kristan's account of the life-changing path she took is riveting; her skill at describing what it is like to work the earth is masterly. Wonderful imagery abounds, such as this description of a compost pile: \"Who knew? That heat comes from the action of hordes of organisms, some so tiny billions can live in a tablespoon of soil. They are in there, eating and multiplying and dying, feeding on and releasing the energy that the larger organisms - the plants and the animals - stored up in their time, energy that came, originally, from the sun. I think it's worth it, for wonder's sake, to stick your hand in a compost pile in winter and be burned by a series of suns that last set the summer before.\" Farmers rarely work alone, and the sections of the book that recount the numerous times the community members, friends and family pull together to aid the new, young farmers,are beautifully presented, emotionally filled passages. \"It was an expression of a larger loving-kindness, and, when I remember it, I have the feeling of being held in the hands of our friends, family, community, and whatever mysterious force made the fields yield abundant food. It is the feeling of falling, and of being gently caught.\"  Kimball's writing is rich with description and filled with much humor. It is clear she doesn't take her new found life on the farm for granted, instead she is filled with gratitude for the wondrous adventure she has been given. This is a delightful book and I can't wait to see the farm in action!"}, {"userName": "Caitydid", "userReviewDate": "Oct 23, 2012", "userURL": "http://www.goodreads.com/user/show/8702119-caitydid", "userReview": "Every once in a while I'll need a break from my usual heady, absurdly stylish reading fare, and books like this are my version of a beach read. Last year, I picked up a little gem called Goat Song (by Brad Kessler), which explored in a tight, journal-style format the trials and rewards of escaping the harried metropolitan life for a pastoral fantasy on a dairy goat farm. That book had such a lyrical flow, with gut-wrenching moments of life and death and lovely prose, fascinating anecdotes on history and mythology and the natural sciences. I read it three times in a matter of months. With The Dirty Life, I was hoping for something similar, albeit with expectations lowered. Not nearly as fulfilling, but still a fun, fast read. After the first few chapters the book felt rushed, and I would've appreciated more honesty and deep-digging into the issues Kimball only hinted at. A city girl more at home in a nightclub than even the nature lite of Central Park, Kimball falls for a tall, callused farmer, a 'real man', and finds herself suddenly thrown into a world of cattle husbandry, seed sowing and dirt hoeing, challenging her new relationship, her puzzled family, and well-manicured nails. But instead of bringing us along into these challenges, as Kessler did in Goat Song, Kimball merely lays these plot opportunities out matter-of-factly, like, 'it was hard having no money and starting a completely new lifestyle I have no experience with and that's that.' While the few hours it took me to plow (hehe) through the book, others interested in a great read about farming, food, and the poignant, difficult country life would be better off reading, or rereading Goat Song or Blood, Bones, and Butter. Any suggestions for similarly surprising memoirs would be greatly appreciated; I do love falling into the realms of nature while sitting on my porch in the big city."}, {"userName": "Maureen", "userReviewDate": "Nov 07, 2011", "userURL": "http://www.goodreads.com/user/show/1132021-maureen", "userReview": "It's hard to decide if this is a love story about farming or the author's husband. Both came as a complete surprise to the author. Kristin writes with great humor and exquisite detail about how a \"rustic\" style farm operates, without chemicals and with reliance on horses and hand labor over tractors and engine-powered machines. The farm life descriptions are fascinating, I really enjoyed learning along with her and Mark as they tried, failed, and succeeded at the various tasks (e.g. planting, animal husbandry, extermination of rats, sleep hen relocation, weeding, harvest, and especially cooking) they undertook. The book focuses on the first year of the farm and is written as a retrospective novel, 7 years after the events occurred. She must have kept a great diary to record each detail, as the ability to work such long hours, with intense focus, and to keep all of those events preserved to memory is more than is humanly possible. But then again, so is keeping a diary when working as hard as she was. It is an enjoyable and fun read, and definitely illuminates those of us who have embraced the effort to seek local sources of food more. The food sounds great, but the local food only choice probably isn't something I can see myself doing, let alone attempting. Does that make me sound like one of the modern day drones that won't take a big risk? I hope not, but not everyone can such a radical change. Kristin acknowledged as much when she realized that one's choice of a life partner can have a huge impact on the course of one's life. Which leads me back to my initial question - whether this book is more about the love of her life rather than the love of the farm, despite the placement of \"Farming\" and \"Food\" ahead of \"Love\" in her subtitle."}, {"userName": "Heather", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/1178920-heather", "userReview": "This was given to me by my friend,Sarah. She just knew I would love this story and she was so completely correct. I could barely put this book down once I got started, which surprised me, because I didn't expect to love it *that* much. The Dirty Life fell right in line with my interest in sustainable agriculture and farming as it followed Kristin and her husband through the beginning of their romance to their ultimate destiny as husband and wife farmers in the Northeast. Along the way she describes in excellent detail how a farm is run and just how much work it requires to raise everything we \"need\" to survive. From dairy products, to produce, wheat, and meat. Even though they work like dogs from sun up to sun down,to hear her tell it, they feel like they are living like royalty as they dine on rich yellow butter fresh from their jersey cow and heirloom tomatoes grown in every color of the rainbow. The sections where she describes their meals are just tantalizing. So simple, and yet so perfectly yummy and sustaining.There were some sections about raising and eating the meat that almost did me in, but I really enjoyed learning so much about the process of starting a farm from scratch and hearing about how Kristin and her husband came to learn to work together and grow as a family as well."}, {"userName": "Christie", "userReviewDate": "Nov 28, 2011", "userURL": "http://www.goodreads.com/user/show/1355394-christie", "userReview": "A dirty life indeed: pig entrails, a pit bull attacking and mauling a beloved Jersey cow, animal slaughter described in vivid detail and a rat infested home are just a few examples of the life Kristin Kimball chooses on an impulse, then grows into slowly, deeply. She chucks her Manhattan lifestyle and job for the backbreaking work of a 500 acre, organic farm, not knowing quite what she is getting into but better off for that, as it turns out. I laughed out loud at her descriptions of her wedding on the farm (kids running in and out of the chicken coop with baskets full of eggs, the rats making their last stand in the older pigs' pen, Mark disappearing in his good clothes to milk the cow). I sat at the edge of my seat, heart racing when the draft horses - spooked by the tractor with its bucket loader brimming with compost (soundtrack is a throbbing diesel engine) - took off at a dead run toward the road, the spreader clanging along behind them, and didn't stop once they got to the road and headed towards town...The constant butchering and cooking animal hearts and testicles (taste somewhat like fresh scallops, I learned) are not for me, but I relished and could relate, viscerally, to her descriptions of needing to get her hands into the soil. (Spoiler)And my eyes misted at the loss of her beloved draft horses."}], "description": "From a “graceful, luminous writer with an eye for detail,” this riveting memoir explores a year on a sustainable farm—and the real world epitome of Michael Pollan’s food philosophy.\"This book is the story of the two love affairs that interrupted the trajectory of my life: one with farming—that dirty, concupiscent art—and the other with a complicated and exasperating farmer.\"Single, thirtysomething, working as a writer in New York City, Kristin Kimball was living life as an adventure. But she was beginning to feel a sense of longing for a family and for home. When she interviewed a dynamic young farmer, her world changed. Kristin knew nothing about growing vegetables, let alone raising pigs and cattle and driving horses. But on an impulse, smitten, if not yet in love, she shed her city self and moved to five hundred acres near Lake Champlain to start a new farm with him. The Dirty Life is the captivating chronicle of their first year on Essex Farm, from the cold North Country winter through the following harvest season—complete with their wedding in the loft of the barn. Kimball and her husband had a plan: to grow everything needed to feed a community. It was an ambitious idea, a bit romantic, and it worked. Every Friday evening, all year round, a hundred people travel to Essex Farm to pick up their weekly share of the \"whole diet\"—beef, pork, chicken, milk, eggs, maple syrup, grains, flours, dried beans, herbs, fruits, and forty different vegetables—produced by the farm. The work is done by draft horses instead of tractors, and the fertility comes from compost. Kimball’s vivid descriptions of landscape, food, cooking—and marriage—are irresistible. \"As much as you transform the land by farming,\" she writes, \"farming transforms you.\" In her old life, Kimball would stay out until four a.m., wear heels, and carry a handbag. Now she wakes up at four, wears Carhartts, and carries a pocket knife. At Essex Farm, she discovers the wrenching pleasures of physical work, learns that good food is at the center of a good life, falls deeply in love, and finally finds the engagement and commitment she craved in the form of a man, a small town, and a beautiful piece of land", "title": "The Dirty Life: A Memoir of Farming, Food, and Love", "url": "http://www.goodreads.com/book/show/9820326-the-dirty-life", "average": 4.05, "cover": "https://images.gr-assets.com/books/1347586440l/9820326.jpg", "reviews": 1835, "authors": [{"url": "https://www.goodreads.com/author/show/106637.Kristin_Kimball", "name": "Kristin Kimball"}], "type": ["Nonfiction", "Autobiography", "Food and Drink", "Gardening"], "outlinks": ["http://www.goodreads.com/book/show/9820326-the-dirty-life", "http://www.goodreads.com/book/show/7841677-the-dirty-life", "http://www.goodreads.com/book/show/9545459-the-dirty-life", "http://www.goodreads.com/book/show/182800.Maui", "http://www.goodreads.com/book/show/182757.Southeast_Asia_on_a_Shoestring", "http://www.goodreads.com/book/show/68544.Rome", "http://www.goodreads.com/book/show/6313342-knocking-chocolate-off-the-trees"]}