{"ratings": 156, "userreviews": [{"userName": "Cindy Burnett", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "The Death of an Heir is an interesting read. I was unfamiliar with the story of the abduction of Adolph “Ad” Coors, the CEO of the Coors empire, and the subsequent manhunt for his abductor. On the morning of February 9, 1960, he was stopped less than two miles from his home by his would-be kidnapper. The crime went horribly awry, and no one could locate Ad nor the individual who tried to take him for many months. Philip Jett does a decent job relaying the story, but he is quite repetitive and verbose; it could have been at least 80 pages shorter. Moreover, the story jumps all over the place, and I struggled to follow his train of thought multiple times. I was glad I learned about the Coors family- what a sad tale and a dysfunctional family. I also really wished Jett had explained how the death of Ad affected who controlled Coors going forward. He alluded to the issues that could result from Ad’s death but then never followed through to explain how it all played out. Thanks to St. Martin’s and NetGalley for the chance to read this ARC. All opinions are my own."}, {"userName": "Jan \"don't blame me, I also voted for Hillary\"", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/22004574-jan-don-t-blame-me-i-also-voted-for-hillary", "userReview": "I could not put the book down and read it over the course of two days, finally accepting the fact that I had to sleep!The Coors kidnapping and murder haunts me to this day because, you see, my father was a special prosecutor on the case. I was only 8 years old when Adolph Coors III disappeared and 9 years old when his murderer was brought to trial. My memories from that time in my life are colored by this murder. It was such a high profile case in Colorado; great pressure and publicity fell upon my dad. I learned that the world was not always a safe place when I snooped and found photos of Mr. Coors' remains, and for several years I was afraid to go into the beautiful Colorado mountains--because you found dead bodies in the mountains. We had an FBI presence during the trial; our phone was tapped in case we received threatening calls and we had protective FBI surveillance as well. It freaked me out! At the same time, I was so proud of my daddy.This crime literally shook the entire Rocky Mountain region. The heir of the Coors Brewing dynasty Adolph \"Ad\" Coors, III was kidnapped and murdered. His wife Mary received the ransom note when unbeknownst to her, her husband was already dead. This truly was a heinous crime perpetrated by a cold and remorseless killer.Mr. Jett thoroughly researched the case and portrayed it with accuracy and compassion for the victims. I learned many facts of which I was heretofore unaware. I appreciate Mr. Jett for his diligence and eloquence.Check out excerpts from Richard Hite's closing argument. You'll see why I am so proud of him!"}, {"userName": "Jill Hutchinson", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/2222319-jill-hutchinson", "userReview": "In 1960 a kidnapping took place that shook the nation and was often compared to the Lindbergh baby case Adolph \"Ad\" Coors, middle aged heir to the Coors Brewery fortune was snatched on his way to work practically within sight of his home. Strangely the Coors family had often mentioned the dangers of a kidnapper targeting their family but always thought that if it happened it would be the children, and not the father. They didn't have to wait long for the ransom request to arrive and they contacted the FBI and local officials in an attempt to mediate the situation and hopefully catch the culprit. What ensued was unexpected and senseless as the family waited and waited for further messages for the kidnapper which never came. and they began to realize that \"Ad\" was no longer alive. It is an interesting and tragic story which reveals a kidnapper who was a bumbling idiot who left clues all over the crime scene. It was just a matter of putting the clues together in those days before DNA testing. It moves along rather slowly but will keep the reader's interest."}, {"userName": "Jessica Allen", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/62232739-jessica-allen", "userReview": "I received an advanced copy of this book from the publisher to read and review. My review is unbiased. I received this book in the mail on July 1, and picked it up briefly on July 3 and read about 30 pages. I was instantly sucked into the story, but got sidetracked by a book that I was reading simultaneously and close to finishing, and didn't touch it again for about 10 days. I finished it quite quickly once I was able to focus on it.The subject matter of the book, the botched kidnapping and tragic murder of Adolph Coors III, I found fascinating. I do enjoy true crime quite a bit, and as a self-proclaimed beer snob I also enjoyed a look into the Coors family as well (although, admittedly, I personally can't stomach their beers, yuck!). I was *extremely* excited to read this after St. Martins Press offered to send it to me, it sounded right up my alley. Where it feel short for me, unfortunately, was in Jett's actual writing style. His prose switches from being overly straightforward to convoluted- it often felt quite amateur to me. It never really 'flowed.' And right off the bat, I felt as though the prologue was completely unnecessary, he provided the same exact information again immediately in chapters one and two, just in different and far more lengthy. Often while reading I wanted to take a red pen to my copy. Case in point: page 240 - \"Earlier that afternoon, Hardesty had asked prospective jurors during voir dire how they felt about the death penalty ... (voir dire is basically the questioning of prospective jurors by prosecutions and defense attorneys prior to trial to determine potential bias or other cause why a juror should not serve.)\"JUST SAY JURY SELECTION. VOIR DIRE IS JURY SELECTION. I think he just wanted to use the legal term to remind us that he was formerly a corporate attorney, even though it felt awkward and he was forced to add a clunky definition right after so the reader could understand. My boyfriend is starting his third and final year of law school, so I handed him the book a couple times, and even from the perspective of someone who has become accustomed to reading legal-ese, he was woefully unimpressed. Also, maybe it's just the history major in me, but couldn't he have added these definitions in a footnote instead, rather that using parentheses? It would have been far cleaner. Sentences felt awkward throughout the book, often as though he used 20 words where 10 would do. Of course, my copy is an uncorrected proof, so some of these may very well be edited by the time the book is published in September. I am almost tempted to purchase the final copy to see how much the text has been 'cleaned up' by that point.All in all- I think the story of the Coors kidnapping and murder was interesting, and it was a quick read, once I was able to focus on it. But I don't think I would be in a rush to pick up another of Philip Jett's books, and I don't know how quick I would be to recommend it to someone else. It was just okay."}, {"userName": "Suz Saunders", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/49456351-suz-saunders", "userReview": "Exhaustively researched story of the 1960 attempted kidnapping, resulting in murder, of Adolph Coors III. The crime rocked the state of Colorado. J. Edgar Hoover flooded the case with agents and when the suspect was identified he became one of the FBI's ten most wanted. I've seen at least one true-crime TV show episode about this case and was somewhat familiar with it. But the book-length treatment allows Jett to explore the story in depth. He depicts some of the less salubrious law enforcement officers who were involved in the case, notably the then-sheriff of Jefferson County. Fortunately, most of the LEOs on the case were competent, as were the lawyers who prosecuted Corbett after he was captured.Sadly, Ad Coors, who was shot to death on that February morning in 1960, wasn't the only victim of the crime. His widow Mary, as depicted by Jett, was never the same afterwards, and died relatively young. Jett dealt, I think, fairly with the Coors family overall. Ad's father and brothers were/are all interesting characters, and the author was frank but not disrespectful about them. Overall this was a good read."}, {"userName": "Pam Koenig", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/4834829-pam-koenig", "userReview": "I received this book from NetGallery in exchange for a fair & honest review.First I love the True Crime genre, but this book left me disappointed and confused. The book seemed disjointed to me and read like an embellishment of news articles. To much seemed missing, granted it seemed to be a one on one crime where only the two people involved really know what happened, but facts seemed to be added randomly. More information about other family members was glossed over in the story and later embellished as afterthoughts. The author seems to indicate the lack of information was responsible because of the age of the crime, sorry, but that seems a cop-put. I have read current books on crimes from that era and older and they seem like complete accounts and complete books. This book seemed to just end, it almost seemed like part of a book, not a whole one. I'm sorry, but this book left me wanting to know so much more about the Coors Family and their lives and deaths and disappointed that the author didn't explore them more fully. I hate to write bad reviews, but had to give my honest opinion."}, {"userName": "Lori", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/7950608-lori", "userReview": "I received a free copy from the publishing company. This is an advanced reading copy. This true crime book focuses on the botched attempted kidnapping of Adolph Coors III. He is part of the Coors beer company. He was on his way to work when he was stopped at a bridge by Joe Corbett. There was a struggle a shooting and for the next months to come a search for Adolph Coors. This true crime goes into details of what may happened that day. the disappearance of Adolph, eventual finding of his remains. and the search for his killer. What was supposed to be a kidnapping and ransom turned into a murder.. I don't want to give too many details so anyone who would like to read this well done True crime book can read for themselves of the details. I found this to be a well written interesting book."}, {"userName": "Valerity (Val)", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/6864942-valerity-val", "userReview": "I thoroughly enjoyed this true crime/history book. A throwback to February 9, 1960. The same year I and a couple of my best friends were born. And to think that there was this huge crime committed against the very prominent Coors family in Golden, Colorado back then. I'm really kind of surprised I'd never read anything about it before. This was quite a big crime with the FBI involved and a lot of local and national resources used. I enjoyed the author's writing, for the most part, it moved along well and kept me very interested. A good book for true crime fans, for sure. I was given an ARC by NetGalley and the publisher."}, {"userName": "Jeff Jellets", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/15694222-jeff-jellets", "userReview": "Colorado’s Crime of the Century: The Kidnapping and Murder of Coors Brewery RoyaltyI received an advanced copy of this book from the publisher. (My first ever ... so that is REALLY cool). In return, I'm offering an unbiased review. Coors – the ‘Silver Bullet’ of beer – is pretty much a household name. Founded in 1873, the company is the third largest brewing company in the world. And, while it may be most famous for its beer, Coors corporate holdings extend far beyond the adult beverage market. In fact, the Coors conglomerate has done everything from producing materials used in the Manhattan Project to inventing the modern aluminum can to building much of the armor used by American vehicles and soldiers during the Iraq and Afghanistan wars. (Seriously, it was in a Fortune magazine profile). Anyhow, in 1960, the heir to this prestigious corporate empire was Adolph “Ad” Coors III, the eldest grandson of the company’s founder. Ad Coors -- by all accounts a well-liked, family man -- was on his way to work one cold February morning when he simply disappeared. His car was found abandoned, running and radio playing. Splatters of blood, Ad’s hat, and his broken eyeglasses were discovered close by. A few days later, a ransom note was sent to the Coors family that warned, “Call the police or F.B.I.: he dies. Cooperate: he lives.”With The Death of an Heir, author Philip Jett tells the story of a kidnapping gone wrong, a page-turning real-life detective story of one of Colorado’s most notorious crimes. The tale is compelling as Jett lays out the kidnapper’s plan, the search for the missing Ad Coors, and the international manhunt for the businessman’s killer. It’s a bit like walking in the footprints of one of the case’s many gumshoes as Jett paints a vivid picture of the hunt for both victim and killer and of the many characters involved -- from a bombastic local sheriff to the coldly pragmatic chief of Coors brewing, Ad’s father. Of course, Jett’s best character work comes in his portrayal of Ad’s killer -- a chillingly sociopathic assassin who displays little remorse over the murder – and more sympathetically, Ad’s widow, Mary. The toll the killing has on her and her children is heartbreaking.I’m always a sucker for ‘great mysteries of history’ and this book does a great job of keeping one of the most sensational crimes of the century out of history’s dustbin. The Death of an Heir is a gritty true crime drama, but it is also a rich slice of period history, offering a nice sketch of both the Coors company and of the law-enforcement agencies charged with solving the crime. It’s a book that will appeal to both the crime buff and the amateur historian. Of course, the best part about this book is that it comes as close to an ‘open-and-shut case’ as you are ever likely to find in this genre. I love a good real-life mystery and I can certainly savor the speculation around all those great unsolved cases. But it is nice every once in a while to read a book like this one … that ends pretty much with case closed, mystery solved … or as the book’s author would probably say, ‘solved … at least beyond a reasonable doubt.’P.S. Curiously, there’s a nice little moment of bizarre synchronicity between the Coors case and another ‘crime of century’ – the O.J. Simpson murder trial. In a move that is more than faintly reminiscent of the turning point of O.J. trail -- when Los Angeles County prosecutors insisted that O.J. try on the infamous bloody glove and IT DID NOT FIT! – Jefferson County prosecutors try the same tactic. Only this time it was a hat that was found at the murder scene, and when Jefferson Country prosecutors forced Ad’s killer to try it on, they were a bit luckier – THE HAT FIT! As one of the case’s prosecuting attorneys wryly observed, “I was taking a big risk with the hat at the end of my case because if it hadn’t fit, it could have fouled the jury.” Yeah … or as Johnnie Cochran put it much more succinctly years later, “If it doesn’t fit, you must acquit.”P.P.S. So … I don’t make it a secret that in my day job I coordinate disaster relief services for one of America’s largest charities, The Salvation Army. It’s an organization that’s been around since 1865 – so we have a lot of history – and it’s always a bit of a bonus thrill for me when I find a mention of ole’ Sally Ann in one of the books I’m reading. Most times, the reference is pretty innocuous, but this time, it was more of a shocker. After Ad Coors’s killer was released from prison, it was The Salvation Army that gave him a second chance and a job as a truck driver. Of course, we have always been an organization of second chances … but this one, really, really hit home. And, to be honest, after reading what Coors’ poor wife went through, just not sure how I feel about it."}, {"userName": "Stephanie ", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/1007476-stephanie", "userReview": "Read all my reviews at www.littorallibrarian.orgI admit, when it comes to my reading habits, my guilty pleasure is true crime. So a title like The Death of An Heir: Adolph Coors III and the Murder That Rocked an American Brewing Dynasty leaps out at me! That title turned out to be a spoiler for me, because I admit I had no awareness of this notorious crime – no idea that the CEO of the Coors family beer empire had been kidnapped and murdered at the age of 44 as he was on his way to work one morning in Golden, Colorado. (Of course, I was 12 when it happened, so I claim adolescence as my excuse!)In the 1950s and 60s, the Coors name represented the dynasty that ruled over business and society in Colorado. Emerging stories about possible unionization of workers at the family business were seen as a threat by the patriarch, Adolph Coors, Jr., who drew a hard line against organized labor. His view was that the family had worked hard for what they had, so they could decide how to run the business and no one had a right to direct their activity. This led the authorities to suspect possible retaliation from one or more disgruntled workers when they began to investigate the disappearance of Adolph Coors III.In February 1960, Adolph “Ad” Coors III, got into his car and left for work at the brewery, located twelve miles away. He saw a car stopped by a bridge, with the hood up, so he stopped to offer assistance. There he encountered a convicted murderer who had escaped from prison in California several years earlier, who thought if he made one big score by holding Ad for ransom, he would be set for life. Unfortunately, Ad was never seen alive again, and the search for his killer was exhaustive and included turf wars between the FBI and local law enforcement officials.The search for Ad was the largest manhunt in the U.S. since the Lindbergh baby had been kidnapped. Everyone in the FBI up to and including the director J. Edgar Hoover worked on the attempt to locate the kidnapper(s?) and the victim. For months, Ad’s wife and four children waited and hoped for a miracle.The Death of an Heir is a fascinating look at the incredibly detailed manhunt that resulted in the conviction of the kidnapper/murderer. The amount of tedious investigation that was required to be done manually before the Internet and the dedication of the FBI agents to “always get their man” is astonishing, although it turned out to be a Canadian officer who successfully located the suspect. The dislike between the federal and local authorities is emphasized by the way the showboat Colorado Sheriff (who later resigned in disgrace rather than be prosecuted on corruption charges) happily went to escort the suspect and escort him back to Colorado early one morning, only to be told that the suspect had been flown out of Canada in the dead of night by the FBI.It’s an interesting story, particularly the detail on the manhunt and the impact of the tragedy on the family members, both in Ad’s immediate family and the larger Coors family empire. Very well researched and sourced, and an entertaining read. With thanks to St. Martin’s Press and NetGalley for the advance copy in exchange for my honest review, I give this one four stars."}, {"userName": "skip thurnauer", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/68296964-skip-thurnauer", "userReview": "I have lived in CO about 7 years and, until now, had never heard of the Coors kidnapping. Adolph Coors III was the president and CEO of the Coors Brewing Company and the heir to the family business when he was kidnapped on his way to work on the morning of February 9,1960. Ad Coors' car was found with the engine running on a dirt road not far from his home by a milkman out making his morning deliveries. By the time the local sheriff was notified about the car, hours had passed. Once on site however, it didn't take authorities long to determine that they were at the scene of a likely kidnapping. A few days later the family receives a letter from the kidnapper with a half million dollar ransom demand and instructions for the ran some delivery and the release of Ad Coors. But days and weeks pass without further word from the kidnapper. Months pass before a hunter inadvertently happens upon Ad Coors' remains in a mountain landfill several miles from the crime scene.This story is told from the perspectives of the family, law enforcement, and the public, as well as that of the criminal, Joseph Corbett Jr. We learn about Corbett's meticulous planning and his flight from Colorado after the botched kidnapping. With local authorities and the FBI on his trail, Corbett flees Denver and heads across the country and then north to Canada. Even though Corbett is clever and highly intelligent, he leaves just enough clues behind, and, combined with a little luck, law enforcement catches up with him and makes an arrest about10 months after the crime. The case against Corbett is based on mountains of circumstantial evidence, but he never confesses to the crime, nor does he appear in his own defense. I enjoyed The Death of an Heir because I was familiar with many of the locations mentioned in the book, including the general crime scene, the landfill where the remains were discovered, and the Coors Brewery where I have enjoyed a few samples. While the outcome is never in question, the author does a credible job of maintaining suspense until the suspect is found, arrested, and tried. And through it all, it is business as usual at Coors Brewing. The tough old patriarch Adolph Coors II assembles the ransom money and prepares to make payment, but he also makes sure that brewery operations continue as if nothing has happened."}, {"userName": "Jim Razinha", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/5963979-jim-razinha", "userReview": "I received an advance uncorrected proof for review from the publisher. Disclosure: I do not generally read crime fiction, crime non-fiction, narrative non-fiction, but a publisher's representative found me here on Goodreads and reached out to me, asking if I'd be interested in reading Jett's book. I'd known of the murder, but nothing about it, and as I like to read books outside my comfort zone just to stretch the brain, I agreed. On a personal note, the book would have to be something I really did not want to read for me to turn down the offer. I don't like to be rude to generosity.When reading non-fiction, I tend to take a critical eye to how things are presented; something coming off, or stated explicitly, as fact needs to at least sound plausible/logical to me. I look for references, if not to actually check into them (which I do many times), then at least to know that they are there for verification...or to follow for more information. Because I do not read narrative/creative non-fiction, I had a hard time for the first third of the book: no references and some very conjectural scenes! I was marking in a few of the margins \"How could he possibly know this?\", and comments similar. So much speculation! Especially for a nearly 60 year old incident!But I was able to make the mental shift. And stop writing in those margins. Jett writes a good story. The factual resources are numerous - trial transcripts, investigation notes, etc. - and the author said he was able to interview some of the participants, but memories are fickle and fade and change over time, too often morphing into the retold, remolded narratives from the country gathering places. And while I might still be bothered by speculation, Jett's gap fillers were logical and consistent with what one might consider actually happened and did, as I noted above, make a good story. One observation: my copy had no photos and had no placeholders for any. I think given the temporal distance, they'd help set the background for the story.Still, it's a curiosity that for 48 years after the trial until his self-inflicted death, Corbett never seemed to have admitted to anyone that he was guilty of the crime for which he was convicted.If you are a fan of the genre, familiar with the story, or just interested, you should enjoy this book. It's quite good."}, {"userName": "Erika Daniels", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/22502969-erika-daniels", "userReview": "I knew nothing about Adolf Coors III's kidnapping and murder and was fascinated by the story itself. The tragedy of a loving father and husband and successful businessman being murdered simply because someone wanted to acquire some unearned money is one worth telling. The impact Coors' death had on his wife, children and extended family is also important to know. Unfortunately, The Death of an Heir did not do the story justice.It read like a first novel to me. Far too many words and repeated details than were necessary but, conversely, huge amounts of information were missing. I learned in meticulous detail how Joe Corbett (the person tried and convicted of the crime) likely plotted and planned the kidnapping and murder, but other parts of the story were just alluded to. Apparently Ad Coors' parents did not have a good relationship with his wife and children and therefore cut them out of their lives after his murder. Why? Apparently Ad Coors' brothers were sad about his disappearance but then continued with their lives and the business without even a stumble. Why? Delving more deeply into the myriad dysfunctional relationships of Coors relatives would have been a great use of words and space; instead, the focus was on telling about the leg shackles, handcuffs, and blood spatter over and over again. There were times when the text told us what Joe Corbett was \"likely\" thinking and feeling without any actual evidence to support why that might be so. Overall, I am glad I read the book because it is a piece of history about which I was totally ignorant. I just wish that the author's editors had done a better job of helping him shape the book into a more complete account of the experience."}, {"userName": "Gwen - Chew & Digest Books -", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/2946583-gwen---chew-digest-books--", "userReview": "Having never heard the story, I was intrigued and this didn't fail to keep me flipping pages in true narrative nonfiction form. What ultimately left me so saddened was that of the three brothers, Ad, seemed like the best of them and his disappearance/murder destroyed his family and not only that, but the connection that his kids had to the company that their forebearers started. The ultimate betrayal was that the man that most likely did it was not punished aptly, for either of his two murders. (Not really a spoiler, here)The only reason I didn't give it 5 stars was that I seldom do with nonfiction. 5 stars for me, means that I want to shove the book into every person's hands that I see and sadly, most readers aren't that into nonfiction and even fewer are into true crime or murder, no matter how historical."}, {"userName": "Kristine", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/4900654-kristine", "userReview": "The Death of an Heir by Philip Jett is a free NetGalley ebook that I read in late September.Jett (wooOOOoooOOOooo) is able to bring the 1960s alive with his Kodak Kodachrome-like narration complete with muted/fuzzed edges. It's used to its full advantage, whether or not readers are familiar with the death of Adolph 'Ad' Coors III and his alleged (and America's Most Wanted) killer, Joseph Corbett, Jr., when the storyline is split between the Coors family's trauma and the indecipherable, yet predatory Corbett."}, {"userName": "Leslie Clemensen", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/7467507-leslie-clemensen", "userReview": "This was a well researched and informative book, especially for those of us who have roots in the Denver area. It was full of the prominent names of the 50s and 60s- Boetcher, Gates, Phipps in addition to Coors family. I knew of the murder of Adolf Coors III, but did not know the entire story. I took it down to four stars because of a bit of author editorializing and bias. Overall, an enjoyable read and insight to the culture of the 50s and early 60s"}, {"userName": "Catherine", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/2098562-catherine", "userReview": "About the kidnap and murder of Adolph Coors III in 1960. Very readable, and just the right length. I’m not sure if this was intentional, but the somewhat dramatic writing style was reflective of the time period. Solid research about the kidnapping, subsequent events, and impact on the victim’s family.Props to my friend Kathy who, when I was telling her about this book, remembered not only the murder (she was 7 years old) but also where the body was found."}, {"userName": "Leslie Jonsson", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/10497692-leslie-jonsson", "userReview": "Extremely sad story of the murder of Ad Coors of the Coors empire in the 1960s. This story does not have a happy ending. The murderer is caught and never admits to the crime, and is paroled and kills himself after a long life. The wife of Ad Coors becomes estranged from the Coors dynasty, and her children and herself are left out of their will. Very sad for all parties, and an interesting view of the forensics and detective techniques used to solve a crime in earlier times."}, {"userName": "Ashley Waterman", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/33511909-ashley-waterman", "userReview": "I learned about this book via the Tattered Cover email list and was able to attend the book signing. The story of Ad Coors is quite interesting. I wouldn't have known about this piece of local history if it hadn't been for this book. Jett presents the facts of the case while adding some colorful scenes that aren't 100% accurate, but add to the story of Coors's murder. Overall, this book presents some Colorado history that should be on every Coloradans coffee table."}, {"userName": "Susan", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/2424606-susan", "userReview": "Interesting true crime recount of the death of Adolph Coors III in 1960. Narrative flows east and makes this a fairly quick read. Having been to this area of Colorado and the Coors plant, visual images came quickly. Shows the definite friction and one up man ship between local law and FBI. With lack of modern forensics at the time, the reader keeps close notice on how data collection and even interviews would be done today. Very good book."}, {"userName": "timv", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/2872116-timv", "userReview": "recommendable and well researched book about tragic Colorado history. I thought that the authors infered dialogs got in the way of the story, as occasionally did his writing style (as other reviewer‘s have pointed out). it appears that the author never found any Coors family member who would allow being interviewed, which might have enhanced the story."}, {"userName": "Rob", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/16638550-rob", "userReview": "3.5 stars. Interesting true crime story. Huge local connection. Truly sad case. I felt awful for the Coors family. I wish it had been a little more flushed out but the truth is sometimes people don’t tell everything and survivors and curious readers are left with gaps that won’t ever be filled and questions never to be answered."}, {"userName": "Greg O'Riordan", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/50016427-greg-o-riordan", "userReview": "Enjoyable Read, Couldn’t Put It DownI truly enjoyed The Death of an Heir as the book is about events I was previously unfamiliar. It is a page turner although you know from the beginning what occurs. I would strongly suggest reading."}, {"userName": "Marianne Evans", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/32514298-marianne-evans", "userReview": "Horrific theft of life, of all the lives of those close to Coors III; this awful story is true. Why can’t it just be a scary story? Justice was not served. I can’t imagine living with all the anger and fear the Coors Family suffered. Terrible, Terrible, Terrible."}, {"userName": "Jon", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/2068086-jon", "userReview": "A decent read. A little amateurish and not much of a page turner. Would've been a gripping story in the hands of a Erik Larson. Nonetheless, somewhat enjoyable. as the narrative non-fiction I'm increasingly becoming a bigger fan of."}, {"userName": "Patrick Macke", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/21581463-patrick-macke", "userReview": "Interesting and engaging and not just because I've consumed more Coors than seems humanly possible ... The book moves fast, is written in an effective, nothing-fancy way and at the end, though we are led to believe we know the killer, I'm not sure"}, {"userName": "Rhonda E Voitl", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/66636777-rhonda-e-voitl", "userReview": "Interesting BookLiving in Golden and hearing of the story, I was curious to read this account. I knew Holly Coors and met Bill Coors on several occasions. It was weird to read and relate the story to them."}, {"userName": "Shawn", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/5981047-shawn", "userReview": "Author says that he “deduced some scenes, remarks, and dialogue” from source materials. Sorry, that’s not nonfiction writing."}, {"userName": "Amy", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/9945907-amy", "userReview": "The Death of an Heir is a pretty interesting read. I would recommend it."}, {"userName": "Debra Lowman", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/2664507-debra-lowman", "userReview": "Interesting story. Jett jumps around a bit and possibly needed a better editor, but the story itself reads just like a thriller movie plot."}], "description": "The Death of an Heir is Philip Jett's chilling true account of the Coors family's gilded American dream that turned into a nightmare when a meticulously plotted kidnapping went horribly wrong.In the 1950s and 60s, the Coors dynasty reigned over Golden, Colorado, seemingly invincible. When rumblings about labor unions threatened to destabilize the family's brewery, Adolph Coors, Jr., the septuagenarian president of the company, drew a hard line, refusing to budge. They had worked hard for what they had, and no one had a right to take it from them. What they'd soon realize was that they had more to lose than they could have imagined.On the morning of Tuesday, February 9, 1960, Adolph \"Ad\" Coors III, the 44-year-old CEO of the multimillion dollar Colorado beer empire, stepped into his car and headed for the brewery twelve miles away. At a bridge he stopped to help a man in a yellow Mercury sedan. On the back seat lay handcuffs and leg irons. The glove box held a ransom note ready to be mailed. His coat pocket shielded a loaded pistol.What happened next set off the largest U.S. manhunt since the Lindbergh kidnapping. State and local authorities, along with the FBI personally spearheaded by its director J. Edgar Hoover, burst into action attempting to locate Ad and his kidnapper. The dragnet spanned a continent. All the while, Ad's grief-stricken wife and children waited, tormented by the unrelenting silence. The Death of an Heir reveals the true story behind the tragic murder of Colorado's favorite son.", "title": "The Death of an Heir: Adolph Coors III and the Murder That Rocked an American Brewing Dynasty", "url": "http://www.goodreads.com/book/show/33574160-the-death-of-an-heir", "average": 3.69, "cover": "https://images.gr-assets.com/books/1500893551l/33574160.jpg", "reviews": 38, "authors": [{"url": "https://www.goodreads.com/author/show/16231957.Philip_Jett", "name": "Philip Jett"}], "type": ["Nonfiction", "Crime", "History", "Mystery", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/33574160-the-death-of-an-heir", "http://www.goodreads.com/book/show/35689754-the-death-of-an-heir"]}