{"ratings": 95166, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Dec 25, 2014", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”A professional does not act out of fervour and is therefore more calm and less likely to make elementary errors. Not being idealistic, he is not likely to have second thoughts at the last minute about who else might get hurt in the explosion or whatever method, and being a professional he has calculated the risks to the last contingency. So his chances of success on schedule are surer than anyone else’s, but he will not even enter into operation until he has devised a plan that will enable him not only to complete the mission, but to escape unharmed.”\nCharles de Gaulle, the president of France, has alienated many of his top military staff with his decisions regarding French colonies. These same men had supported his return to power believing that he would strengthen the colonies, but de Gaulle had a different objective. He gave Algiers their independence and subsequently most of the rest of France’s colonies as well. The men who were bathed in blood securing those colonies felt betrayed. They formed a coalition called the OAS and recruited members willing to die trying to kill de Gaulle. They failed.The book begins with an execution for the attempted assassination of the president of France. ”It is cold at 6:40 in the morning of a March day in Paris, and seems even colder when a man is about to be executed by a firing squad.”They are soldiers. They know how to kill and have killed, but to assassinate a public figure like de Gaulle requires something more than just someone motivated to kill him. They need a professional. Enter:The Jackal.He is an Englishman, maybe, but who he truly is has been hidden under layers of identities that stretch back to the very first time he killed for money. He is a chameleon. He can change his personality, his appearance, and his passport with one quick stop in a deep doorway. He develops several contingencies for every step of the plan because rigidity is what gets men like him killed. The men protecting de Gaulle have a difficult job. They have discovered the plot by the OAS after some rather unsavory moments with a member of their inner circle. ”Apart from the breathing, the silence of the cellar was almost tangible. All the men were in shirt sleeves, rolled up high and damp with sweat. The odour was crushing, a stench of sweat, metal, stale smoke, and human vomit. Even the latter, pungent enough, was overpowered by one even stronger, the unmistakable reek of fear and pain.” The problem is that they don’t know enough because even the people who hired The Jackal know very little. De Gaulle is not interested in changing any of his public appearances because of unsubstantiated, well to his mind, rumors. After all he is well aware that there are people who want to kill him all the time. No one will ever be able to accuse de Gaulle of being a coward, but haughty arrogance he has in spades. \nEven with all the men assigned to protect de Gaulle he was still vulnerable to The Jackal.There is a leak in the inner circle of those that are assigned to find The Jackal. This woman uses her assets to elicit information from her lover that she can pass to the OAS. ”Tell me all about it,” she cooed.”The leaks go back and forth between both organizations, never giving enough information, but always just enough for those protecting and those intent on killing to alter their plans. The Jackal goes underground. He seduces a vulnerable Baroness. He is charming and she is in need of reassurances. ”Her thigh was pressed against him below the belly and through the satin of her dress she felt the rigid arrogance of his prick. For a second she withdrew her leg, then pushed it back again. There was no conscious moment of decision-taking; the realisation came without effort that she wanted him, badly, between her thighs, insider her belly, all night.”The line “rigid arrogance of his prick” made me laugh out loud. The Baroness is not the only one he seduces, lonely homosexuals, as well, serve as a safe haven for him as he makes his way closer and closer to his objective. The Jackal will use anyone and anything to win this game he has started. The Jackal also knows his hardware. ”As soon as the bullet struck flesh, gristle, or bone, it would experience a sudden deceleration. The effect on the mercury would be to hurl the droplet forwards towards the plugged front of the bullet. Here its onward rush would rip away the tip of the slug, splaying the lead outwards like the fingers of an open hand or the petals of a blossoming flower. In this shape the leaded projectile would tear through nerve and tissue, ripping, cutting, slicing, leaving fragments of itself over an area the size of a tea-saucer. Hitting the head, such a bulle would not emerge, but would demolish everything inside the cranium, forcing the bone-shell to fragment.”Can you feel the love for destruction? Back in 1997 I went to see a movie called The Jackal. I had no clue that it was based on a book. It was just a Friday night entertainment. One highlight of the film is when the actor Jack Black, who I harbor some kind of odd animosity towards, is killed rather spectacularly. Well the character he plays, not the actual actor, but I could suspend belief for a few moments. Bruce Willis plays The Jackal. Richard Gere and Sidney Poitier are playing the characters trying to find him. The setting of the plot has been changed and the timing moved up from the 1950s to the 1990s, but they do actually use plot devices from the Frederick Forsyth book. There is a 1973 movie that follows the book very closely. I have not seen it, but the reviews of that movie are very good. My intention is to watch it very soon. \nFrederick ForsythForsyth infused this novel with historical details that added more validity to the plot and added richness to the flow of the narrative. He also included the intricacies of political plotting and the difficulty, even with a small group, in keeping anything a secret. The ruthlessness and the zeal with which the assassin approaches what seems to be an impossible task was unnerving, chilling. The way in which the hands of the investigators are tied at many points by the unwillingness of de Gaulle to cooperate stretches the tension like an overstressed piano string. I was impressed that a 44 year old novel could still have me running through the streets of Paris, with an elevated pulse, hoping to thwart the aims of a diabolical killer. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at: https://www.facebook.com/JeffreyKeeten"}, {"userName": "Stephen", "userReviewDate": "Aug 15, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "To those that gave this 4 or 5 stars…I completely get it…I really do. I found much impressiveness in this classic spy story, despite the 3 star ceiling I ended up placing on it. Technically proficient and drenched in details, this is as authentic an anatomy of an assassination attempt I have ever seen. Forsyth’s “Jackal-like” control over the narrative was singular and I can certainly understand this being considered a classic among the spy-thriller genre.Despite the significant amount of superior that Forsyth brought to this story, my 3 star rating reflects my lack of engagement in the story resulting largely from what I found to be a lack of well-drawn characters and a dearth of emotion in the narrative. These two missing components prevented me from getting warm and toasty with the story even with the undeniable quality of the plot. PLOT SUMMARYA novel in 4 parts. First, the reader is introduced to the OAS (“Organisation de l'armée secrète”…or “Organization of the Secret Army”), a rabies-loaded, right-wing French nationalist group formed during the Algerian War and dedicated to keeping Algeria part of France…[if I can pause for a brief side note, the OAS completely reminded me of the scene in Monty Python’s, The Meaning of Life when John Cleese said: \n I would remind you that [the cormorant] was presented to us by the Corporation of the town of Sudbury to commemorate Empire Day, when we try to remember the names of all those from the Sudbury area who so gallantly gave their lives to keep China British.\n...Sorry, couldn’t resist sprinkling a little MP into the mix.] Anyway, feeling spiteful, betrayed and more than a little miffed by de Charlie‘s “gall” and his support for Algerian independence, the OAS unsuccessfully tries to pop caps in de Gaulle’s derriere several times, most notably in a French suburb in 1962.The above is all historical fact and provides a terrific lead in for Forsyth to seamlessly transition into the fictional story.Part 2 of the story is easily my favorite part of the book. The OAS is in shambles after being infiltrated and decimated by the French “Action” service (the counter-terrorist portion of the French intelligence apparatus). As a result, the head of the OAS decides that the only way to turn things around is to succeed in assassinating de Gaulle and the only way to do that is to bring in a ninja professional assassin. Enter…Bruce Willis the Englishman …a nameless, mysterious, high-priced assassin considered the best in the world. Engaged by the OAS and given complete operational control over the assignment, the rest of this section of the book details….and I mean D.E.T.A.I.L.S.…the Englishbloke’s preparation for the assassination. I was fascinated by this section and thought it felt incredibly authentic. Step by step the reader follows the Englishgent as he arranges the creation of false identities, the design and production of the perfect weapon, extensively studies de Gaulle, selects the appropriate time and place for the kill, and identifies his escape route. I’ve never seen this kind of detail presented better without intrusion by the “pace-assassins” known of PLOD and BOG. Forsyth eludes both of these story killers and maintains excellent narrative flow. I LOVED IT. Part 3 focuses on the French government’s counter-terrorist group as they learn of the potential plot and investigate various leads looking for a break. As with the rest of the book, the intricacy of the details is very impressive. However, this is where I started to disengage a bit from the plot due to a lack of emotional investment in the story. Part of this stems from the “intentional coldness” of the Englishman. His whole persona is one of ice which would have been great if contrasted by more emotionally colorful characters in the novel. Unfortunately, I didn’t find that and so it made immersing myself into the story impossible. Lack of immersion led to lack of connection led to lack of interest as the narrative began to seem far too dry. The fourth part of the book is the climax where we have the Jackal closing in on his target and the Frenchies closing in on the Jackal. Again, technically this was done to perfection and I have no truck with anyone who slapped 5 stars on this story. However, for me, my lack of investment in the narrative continued to plague me and so the amount of tension (of which there should have been plenty) was running on empty. I still enjoyed it, but I kept telling myself that I SHOULD be enjoying it more. Overall, Forsyth wrote a very impressive book and I would not quibble with it being listed among the classics of the genre. I just found the story a bit dry and the characters a bit too wooden to engage enough to say I really liked it. Thus a solid 3 stars and my respect for Forsyth’s accomplishment."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 16, 2016", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Day of the Jackal, Frederick Forsyth تاریخ نخستین خوانش: شانزدهم ژوئیه سال 1986 میلادیعنوان: روز شغال؛ نویسنده: فردریک فورسایت؛ مترجم: سورنا مهرداد؛ تهران، خامه؛ 1363؛ در 507 ص؛ چاپ دیگر: تهران، درسا، 1363؛ واژه نامه دارد؛ موضوع: داستانهای نویسندگان انگلیسی - قرن 20 معنوان: روز شغال؛ نویسنده: فردریک فورسایت؛ مترجم: روشن آقاخانی؛ امیر گرامی نژاد؛ تهران، سمیر، 1379؛ در 559 ص؛ شابک: 9646552129؛ پاریس، در یک روز سرد ماه مارس، ساعت شش و چهل و پنج دقیقه صبح، مردی که روبروی جوخه اعدام قرار گرفته بود بیش از دیگران سردی هوا را حس میکرد...؛پس از تلاش نافرجام برای ترور: شارل دوگل، در ماه اوت سال 1962 میلادی، گروه او.آ.اس. با مشکلاتی روبرو، و بسیاری از اعضای گروه شناسایی میشوند. رئیس جدید گروه، سرهنگ رودن تصمیم میگیرد، تا آدمکشی حرفه ای را که هیچ ارتباطی با گروه ندارد، اجیر کند. مردی انگلیسی با اسم رمز: شغال، برگزیده میشود، که خونسردی او بزرگترین امتیاز اوست و ....؛ ا. شربیانی"}, {"userName": "Tim The Enchanter", "userReviewDate": "Jul 20, 2011", "userURL": "http://www.goodreads.com/user/show/5654692-tim-the-enchanter", "userReview": "Still Amazing the Second Time Around - 5 Stars \nIn the past 16 years, with the exception of the Bible, I have never read a book twice. I enjoy the unknown and the mystery of the unravelling. When doing a Book Pal read, I decided to pick up a book that is in my Top 10 and to break my rule about never reading a book twice. What an excellent decision. Even the second time around, I was amazed by the excellent story and the author's ability to created suspense even when you know the eventual outcome. The author makes it clear from the outset that the book is about a failed assassination attempt. While this would generally spoil the story for me, this story was about the preparation, the chase and the excitement of the near miss. This is likely the reason it was still an amazing read the second time around. Whether it is your first time, second or fifteenth, fans of Thrillers, spy novels and political thrillers should pick up this classic volume. Plot I will not belabour the storyline. The story is that of an assassination plot on French President/General Charles De Gaulle. The uses up a significant number of pages to outline the history leading to the attempt and the tension and power struggle between the President and the OAS who were determined to oust De Gaulle and keep Algeria French. Admittedly, the opening is slow as it reads as a history. While the first chapter or two is dry, it provide the read with an excellent synopsis of the Algerian war, De Gaulle's rise, fall and second ascent to the presidency. After 6 failed attempts at assassination, the OAS hatches its best plan to date. Enter the Jackal. The top OAS leaders hire a foreign assassin to plan his own attack and assassination of the president. The story follows two major storylines. Firstly, the OAS leaders which eventually combines with that of the Jackal and his precise planning and attempt. Secondly, the story follows the French Detective who is tasked with the unenviable job of finding a killer with no evidence and clues. The result is an excited a detailed investigation/planning and one of the best international chases you will ever read. My Take This is widely accepted as one of the best spy/assassin thrillers of all time. Without a doubt, the author amazing eye for detail is a major reason for this. The reader does not miss a single step in the Jackal's planning. When he visits a forger to obtain fake papers, we get to see him return. We don't miss any steps. Additionally, we follow an equally detailed investigation into the identity and plan of the killer. It is truly an immersive experience.While the actual details of the Jackal's true identity and his planning are not well known, the author does an amazing job of taking the facts and filling in the blanks with some educated guesses. The result is a completely believable and engaging story. The Jackal is one of my favourite characters in literature. There is little back story for the character but this results in an incredibly mysterious and dangerous character. Even when you think you know him, you quickly realize you don't.Beyond the Jackal himself, the story of the investigation is equally amazing. The character of the French Detective is a small, unassuming and henpecked man but his looks belie his sharp intellect and tenacity. He is made to report daily to approximately 10 of the top men in the French government and to steer the largest manhunt in French history. The kicker is that there are quite literally no clues to go on. With a small bit of good fortune and some excellent instincts, he is able to track down an illusion. This is truly one of the most brilliant investigations I have read. Coupling this with the Jackal's story vaults this book into my top 10.Any fan of Thrillers need to read this excellent novel. While this was written decades ago, the writing, content and story does not feel dated. This story remains exciting and entertaining, even in time of instant gratification. Even though you know the end at the beginning, it is the journey that is exciting. A highly recommended book!"}, {"userName": "Luffy", "userReviewDate": "Jan 28, 2013", "userURL": "http://www.goodreads.com/user/show/7407364-luffy", "userReview": "The day of the jackal was over, and I was glad of that. Just because this old thriller was related to a favored genre of mine - the historical fiction - didn't mean I would like outdated thrillers with no idea that hasn't been milked by movies of various characteristics. But I learned one thing after reading this book, and that was that archaic books like this died intestate. There were defining aspects in this hefty - not too much though - novel. There were new characters that kept making entry until the last pages. Also there was the fact that we know that The Jackal wasn't going to succeed. At the other end of the spectrum, there was another type of sitting duck of the species known as Dead Meat. Those who you knew were going to die did die. But as the novel progressed, it was more difficult to care for the victims. The only brilliant idea in the story was that the info that set the ball rolling was an error of identification. That threw this reader completely. In the end, though, it wasn't enough to justify reading the book in the first place."}, {"userName": "peiman-mir5 rezakhani", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/42133960-peiman-mir5-rezakhani", "userReview": "‎دوستانِ گرانقدر، این کتاب از 21 فصل و 507 صفحه تشکیل شده است و از آن دسته از داستانهای هیجانی و جنایی میباشد و موضوع آن در رابطه با ترورِ <شارل دوگول> رئیس جمهور نامدار فرانسه میباشد‎داستان از سالِ 1962 و اعدامِ یکی از مخالفینی که قصد ترورِ رئیس جمهور فرانسه <شارل دوگول> را داشته است، آغاز میشود‎سپس نویسنده از چگونگی و دلایلِ یکی از ترورها پرده بر میدارد.. سرهنگ دوم نیرو هوایی <ژان ماری باستین تایری>، قصدِ ترورِ <ژنرال دوگول> را داشت و دلیلش این بود که وی با استردادِ الجزایر به ملی گرایانِ الجزایری، به فرانسه و مردمی که در سال 1958 دوباره او را به قدرت رسانده بودند، خیانت کرده است... البته ترور ناموفق بود و با اشتباهی عجیب در محاسبهٔ تاریک شدنِ هوا، به سرانجام نرسید و <دوگول> نجات پیدا کرد‎پس ازمدتی سرباز بیست و دوساله ای که در بین گروه سری و ترور آن روز قرار داشت، با نامِ <پیردنیس ماگاد> به صورت اتفاقی دستگیر شد و از 22 نفر از ارتشیانی که در ترور شرکت داشتند، نام برد و همه را لو داد و تنها یک نفر موفق به فرار شد که آنهم <جورج واتن> نام داشت که گویی به الجزایر گریخته بود‎داستان از آنجایی هیجان انگیز میشود که سه تن از گروه اصلی و سازمان مخالف <دوگول>، برای ترور <دوگول> تصمیم به استخدام تروریست و قاتلی حرفه ای به نام <شغال> میگیرند که تصور میکنند وی انگلیسی است‎از آنجایی که <شغال> درخواست نیم میلیون دلار کرده بود و این پول بسیار زیاد بود، لذا ارتش سری و مخالفان دوگول، برای فراهم کردن این دستمزد، تصمیم میگیرند تا به بانک ها و مراکز مالی دستبرد بزنند‎داستان در دو فصل پایانی، به اوج هیجان خود میرسد و نقشه های زیرکانهٔ <شغال> خواننده را به وجد می آورد‎عزیزانم، بهتر است خودتان این داستان را بخوانید و از سرانجامِ آن آگاه شوید--------------------------------------------‎امیدوارم این ریویو در جهتِ شناختِ این کتاب، کافی و مفید بوده باشه‎<پیروز باشید و ایرانی>"}, {"userName": "Nikki", "userReviewDate": "Apr 05, 2008", "userURL": "http://www.goodreads.com/user/show/736266-nikki", "userReview": "Re-reading The Day of the Jackal, Frederick Forsyth's 1972 Edgar winner for Best Novel, was perhaps even more satisfying than reading it for the first time (can it really have been 36 years ago?) I would never quibble with the committee's choice on this one.As most people probably know, the book deals with a plot to assassinate Charles de Gaulle, President of France, by a group opposed to his policies on Algeria. Not only does the reasonably well-informed reader know that, historically, de Gaulle was not assassinated, but Forsyth actually makes a point of telling us this early in the book. So, in a most important sense, we know from the outset how the book ends. And yet, it is one of the best examples I've read of page-turning, heart-stopping, breath-holding suspense writing.Using the third-person omniscient form, Forsyth takes us into the minds and actions of the plotters, the police, and the Jackal himself. As the Jackal's preparations are being made, the French policeman, Lebel, is making his own preparations to foil the hired assassin. The police (including a number of quasi-police agencies with few qualms about methods) are well aware of the plot to assassinate de Gaulle -- several unsuccessful attempts have been made -- and they quickly surmise that the plotters have a hired killer. But finding the Jackal is not so easy, and he always seems to be one step ahead of them until the last shattering moment.One thing that struck me in this reading of The Day of the Jackal was that, while one part of my brain was firmly on the side of Lebel and his need to stop the assassin, another part of me was admiring the Jackal's ingenuity and cool head, and almost wanted him to \"win.\" And all this with no attempts made by the author to excuse or rationalize the Jackal's career choice -- in fact we are told very little about the Jackal's past beyond one brief reference to his having grown up poor. Forsyth puts the reader in the very unusual position of watching two consummate professionals doing their jobs in opposition to each other; even though we know which is the \"good\" or \"right\" side, our inwards groans at a setback for the Jackal are as heartfelt as those for Lebel, at least until the last few chapters.If you are too young to have read this book when it first came out, or even if you did read it then, do yourself a favor and read or re-read it."}, {"userName": "Sanjay Gautam", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/10179929-sanjay-gautam", "userReview": "This book is one of the best books in its genre. Haven't found a book which can be at par with The Day of the Jackal."}, {"userName": "Checkman", "userReviewDate": "Apr 30, 2016", "userURL": "http://www.goodreads.com/user/show/5117003-checkman", "userReview": "One of the things that I like about Goodreads is that it's more than just a bunch of book reviews. It's a location where book-lovers can exchange stories, discuss books, buy and sell books and simply go on and on about their favorite (and not so favorite) books. So please indulge me as I provide a longish backstory before actually getting into my review because that is part of the fun. To begin with please look at my bookshelves. You'll notice that one of them is labeled \"seventies-classics\". I was a child in the seventies (born in 1968) and both of my parents were (are for they are both still alive) readers. Mom liked classic dense novels, works about human behavior (Carl Jung et al) and the occasional \"serious\" work about the supernatural (Edgar Cayce,Dorothy Jane Roberts and so on). She encouraged my love of history and started my modest collection of historical works - many of which I still own. Thanks mom. Now dad provided the \"men's action novel\" section of my parent's library. My parents compliment each other. Mom is the intellectual with a couple different university diplomas. Dad is the Vietnam veteran and career police officer. He is an intelligent man, but a down-to earth man who enjoys reading espionage/action novels and Louis L'Amour westerns. As a boy I was drawn to dad's reading selections and one of my clearest memories are the hardback copies of Frederick Forsyth's first three novels on the shelves:  The Day of the Jackal, The Odessa File, The Dogs of War. Dad was a huge fan and even got mom to read the first two. My mother, the intellectual, found them to be \"better than average genre novels\" (mom sometimes slips). I read The Odessa File when I was ten years old. At the time it took some effort, but I finished it and enjoyed it tremendously. The Dogs of War followed a few years later. However I then followed with The Fourth Protocol and The Devil's Alternative ,a couple years afterwards, and I was disappointed. Forsyth's later novels are competent, but they lack the Cinema Verite  (no I don't care if I'm using that term loosely) of his first three novels which was the very thing that I liked. As a result I moved on to Tom Clancy's more muscular works and the twentieth century rolled into the twenty-first. A couple weeks ago my wife brought home a Franklin Library leather-bound edition of The Day of the Jackal which she found at the local Deseret Industries store (if you live where there are large numbers of Mormons you are familiar with \"DI\". Terrific secondhand store chain offering a great selection of used books among other things). It's such a pretty edition with leather cover, high quality paper, sewn-in bookmarker, silk moiré end pages and gilt edging. The best part is that my wife picked it up for only two dollars (United States)! On Ebay the leather bound editions sell for at least thirty dollars a piece so way to go honey. As I admired the high quality book I realized that I had never read Forsyth's debut novel. I had seen Fred Zinnemann's 1973 movie of course , but never read the novel. An oversight that I knew I would have to correct. I dare anyone who is a book lover to toss a high-end printing to the side without reading it - for the sheer sensual pleasure if nothing else. It's the equivalent of a classic car lover leaving a 1963 Jaguar XK-E Roadster in the garage and not driving it around the neighborhood on summer weekends......simply inconceivable!So now that I have gone on and on without providing an actual review you're probably wondering what did I think about Mr. Forsyth's classic? Well I think it's a cracking good suspense novel. It is a forty-five year old novel so the technology and some of the techniques are dated. However that's all right because the novel is set in 1963 which moves it into the realm of historical fiction/secret history. The plot itself is not a complicated one. A professional assassin is hired by the OAS(OAS — or Organisation armée secrète, lit. \"Organisation of the Secret Army\" or \"Secret Armed Organisation\") to kill French President General Charles de Gaulle. The French learn of the plot and the race is on to stop the killer before he stops President de Gaulle . In 1963 the French government,and all of it's military and police branches, did not have computers, cell phones, satellite surveillance, DNA, thermal scanners, unmanned aerial drones or any of the other tools that are now used in the never-ending struggle against terrorists. The French authorities are also hampered by the President refusing to go into hiding as well as refusing to allow the news to be made public - which was so typical of that obstinate man. What they do have in their favor is manpower, organization and the French bureaucracy (yes you heard that right - red tape and endless paperwork makes a valuable contribution) on their side. The Jackal ,however, is a very smart man who is careful ,meticulous, motivated and lucky. The result is a race to the finish and I found it to be a very effective race even though we all know that de Gaulle died seven years later in 1970. This means that one starts the novel knowing that the plot is a failure, but it still pulls one into the story. That's an impressive piece of writing if you ask me. Day of the Jackal is an archetype of the modern \"techno-thriller\". Meticulously researched in which the characters function in our reality with all the drawbacks. Mistakes are made, people stumble and sometimes things move with an agonizing slowness. A former journalist Forsyth brought his skills to a novel, but he treated it like it was a research piece for a monthly news journal or a series in the  London Times . The result is that documentary \"Cinema Verite \" that I mentioned earlier. Other writers (Tom Clancy, Brad Thor, Jack Higgins etc.) have since pumped up the genre that Forsyth is one of the founders of and in many respects the genre has moved into James Bond territory only with lots of technical details. Younger readers will probably find Day of the Jackal to be dull with not enough action. The story is the action as it moves inexorably closer to the assassination attempt, but for the younger readers there is a definite lack of car chases, gunfights, thrilling escapes and an explosive climax. If one is curious as to how the story could be amped up see the 1997 movie version \"The Jackal\" with Bruce Willis and Sidney Poitier. Actually I like that version as well, but in terms of what it is and not what it isn't. I try not to get excited about movies straying from the source material.There are weaknesses, but that is true of everything in this world. Forsyth is an excellent researcher and excels at establishing a very realistic and detailed setting in which his characters move through. However he isn't as strong when it comes the characters themselves. Forsyth will describe his characters with a few sentences and then moves on. Essentially his characters are cardboard cutouts with out the psychological depth that readers have come to expect in 2016. Actually ,in fairness to the older generation, many novelists were doing that back in 1971 as well, but remember that Forsyth was a journalist. Journalists don't spend much time writing about the psychology of a politician (usually). A few sentences about a president's background and then it's onto the meat of the story. Personally I didn't find the story hurt by the rather sparse character development. It's a suspense novel about a manhunt and not an in-depth character study. Well here I am with my concluding paragraph. What to write that hasn't already been written? I'm going to opt with the simple approach. It's a good novel. Give it a try."}, {"userName": "Bettie☯", "userReviewDate": "Apr 25, 2008", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "This swept through our lives like a simulacrum of the fire of London. Everyone was reading and loving this story that took just over a week to write.It was the first time there was a generic book buzz in my life and I became hooked on that buzz :Right.There:And:Then: Wasn't so long after that Forsyth did it all again to our utter, utter amazement. A moment in time and book-love was created.30.08.2015: Frederick Forsyth reveals MI6 spying past"}, {"userName": "Pramod Nair", "userReviewDate": "Jan 27, 2015", "userURL": "http://www.goodreads.com/user/show/37107782-pramod-nair", "userReview": "Usually i don't re-read thrillers but 'The Day of the Jackal' & 'The Dogs of War' are two books from the genre that i have repeatedly read over the years. And each time they provide me with such an intense feeling of thrill and suspense.The plot takes place in the turbulent France of the early 60s which was bracing itself for a civil war. The steps taken by the French government from 1961 to consider and form a referendum on self-determination concerning Algeria and later the Evian Agreements of March 1962 which finally decided to grant independence to Algeria caused a lot of dissidence among a large number of Algerian war veterans. An entire faction of Foreign Legion paratroopers mutinied and formed 'Organisation de l'armée secrète' (OAS) which was a secret army organization hell-bent on preventing Algeria's independence from French colonial rule using armed resistance.The OAS attempted several times to assassinate French president Charles de Gaulle. The most prominent attempt Came on 22 August 1962 ambush at Petit-Clamart, a Paris suburb, planned by a military engineer who was not an OAS member, Jean-Marie Bastien-Thiry. From these historical events and the backdrop of a nation which was trembling at the fear of a civil war, Forsyth weaves together a high-voltage political thriller with sheer brilliance and a vivid imagination.Using these real facts from history Forsyth creates a fictional assassination plot against Charles de Gaulle, where the OAS frustrated with their repeated attempts of failure, hires a British contract killer - only known as 'The Jackal' - to kill De Gaulle. From this point Forsyth builds the suspense and excitement to such a high level of enjoyment by taking the reader through small thrilling ventures where the assassin scrupulously plans each step of his mission finally leading to an explosive climax. With a meticulous personality and obsession for planning to the last minute detail, 'The Jackal' will be one of the most intriguing and enigmatic characters ever created in the thriller genre. The Day of the Jackal is one of the timeless classics among the thrillers for sure."}, {"userName": "Said Al-Maskery", "userReviewDate": "Oct 25, 2007", "userURL": "http://www.goodreads.com/user/show/577651-said-al-maskery", "userReview": "I was walking around a library in Malesya when I found a shelf selling \"classic\" books. I wondered what does the Jackal mean ? Why is this book sold on a shelf that is presented infront of the entrance ?I took the book without knowing any history about it, never heard of the author & never thought I was entering a new world of thrillers!Since my native language is Arabic not english, I had difficulties understanding the first chapetr, especially with the small letters used in the edition I baught. However since I am a book cruncher, I absorbed it and thought of continue the read ... one chapter was not enough to judge a book isnt it ?!Once i got into the thrilling part of the novel, i just couldnt stop reading. To me this was a new reading. I never really ready a crime thriller before this book (unless anyone concideres \"The Broker\" one). I had a lot of difficulties coping up with what was happening around me in real life. Meals were easily passed just to complete a chapter, rides using the tram were just too short since they didnt allow to complete a section..... everything was moving too fast!I know I havent spoken about the novel yet, but anyways i wasnt planning to do so!I just wanted to give a taste of how enjoyable the read was & would not like to spoil the fun of exploring such a book & the fun of trying to think ahead of the Jackal! :)"}, {"userName": "Joshua Rigsby", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/12022033-joshua-rigsby", "userReview": "This is, without question, the best thriller I have ever read. Forsyth builds the narrative slowly and expertly, then crescendos to a satisfying finale. There are so many things to like about this book, it's hard to know where to begin. First of all, the premise is extraordinary, yet extremely realistic. A group of disaffected former military officers fail repeatedly to kill the president of France, so they hire a professional. Everything from the descriptions of the characters, the offices they work in, and the half page of backstory that everyone gets are spot on and believable. It's as though Forsyth investigated the events as they occurred and wrote them down from memory. I was maybe most impressed at how well rounded his characters are. All of them. Literally everyone from the French president to the toughs that protect the insurgent headquarters has a story. Each story is told in such a way as to build the plot and theme. Beautifully done. The way Forsyth uses time is fun as well. Though he's been copied quite a bit since, every hour and day leading up to the assassination are clearly delineated, adding a \"ticking clock\" sense of anticipation for the whole thing. Forsyth's use of language and description is smart as well. My one complaint is his over-specificity. At points, telling me exactly what street and apartment the character is looking at adds to the richness of the text, but when driving through France, naming every intersection and borough we pass becomes tedious. I guess I'm most happy with the fact that in spite of the modern tendency for thrillers to scrape along the bottom of half-planned plots, cliched characters, and dull description, there are some writers who still take their craft seriously. Forsyth delivers the goods. http://joshuarigsby.com"}, {"userName": "Mike", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/7022024-mike", "userReview": "So I actually saw the movie and the other movie well before reading this book. While the Bruce Willis version adapted the book to an American setting, the original was slavishly loyal to the book (and excellent to boot). In a way that is good and bad.On the one hand the plot of this book is very well constructed. It opens with an actual historic event, an attempted assassination on French President Charles de Gaulle. From there Forsyth weaves a fictional assassination plot to be carried out by a mysterious mercenary assassin hired by a historic French resistance/terrorist group (depending on your view of French Algeria). Of course killing De Gaulle is a tough task as he was likely the most heavily guarded person in the world owing to the many assassination attempts on him (seriously, the guy seems like a giant ass, but was also quite fascinating and made the brave decision to withdraw France from Algeria). The lengths the assassination has to go to achieve his mission and the preparations he makes are impressive. The assets and procedure the French police use to track him down is equally impressive. Very much a cat and mouse chase by the last third.So the plot is great and really lent itself to a movie. The problem is Forsyth doesn't do a great job of populating the plot with compelling characters or writing in a way very engaging way. Very frequently characters are nothing more than a role that is needed to advance the plot. Forsyth spends a lot of ink describing some pretty mundane activities that could easily have been slimmed down or cut completely. This was especially a problem in the early part of the book before the chase really gets going. So while all this translates nicely onto the silver screen it does not lend itself to compelling reading. Compound this and my foreknowledge of all the twists that were to come thanks to the super loyal first movie and this read felt like a slog at times. It is extremely well constructed story and if I had not already seen the movie I might have bumped it up a star. But as it stands this was just a so-so read for me. If you like thrillers this is certainly a touchstone of the genre and it does explore a fascinating part of French history which I enjoyed reading about."}, {"userName": "Miranda Reads", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "I'm not too versed with spy/espionage novels but I expected something more interesting. The beginning was a sheer cliff of a learning curve. So, so many details, dates and people. I reread it 3 times before giving up and hoping that I'd catch on eventually. (I did catch on, I think...there still may be one or two things that just never caught).This was entirely too much page space given to one day. Yes there are flashbacks but still... cut about half and this would've really gripped me. As is, I had to slog through so much background and jargon and irrelevant bits that when I finally got to something interesting, I was ecstatic.Hopefully other espionage novels aren't like this one, otherwise I'm out of a generaAudiobook CommentsSimon Prebble read this one and...honestly, it sounded super boring. Dull, dry and monotone."}, {"userName": "Rob", "userReviewDate": "Jun 05, 2016", "userURL": "http://www.goodreads.com/user/show/10743961-rob", "userReview": "Executive Summary: Slow at times, but with a great finish. I liked but didn't love this one.Audiobook: Simon Prebble is a great narrator. I liked him more in the last book I read by him, but he speaks clearly with good inflection and adds some voices into the mix. He was a good fit for this book making the audio a good option for this book.\nFull Review\nApparently the real life \"Carlos the Jackal\" was given his nickname because this book was spotted on him. I'm not sure if that's true, but I had thought this was somehow related to him.Instead it's a historical fiction/thriller about a real life group of French dissidents from the 1960s who hire a (fictitious) mercenary assassin to assassinate then French president Charles de Gaulle.The book starts with a bit of a history lesson that I found a bit dry. It then goes into a lot of background about the dissident group (called the O.A.S) and France in the 1960s. Charles de Gaulle survived six assassination attempts, which is pretty crazy. I can see why Mr. Forsyth chose him/France as his backdrop. I probably wouldn't have appreciated the politics without all the background, but I still found it on the slow side.In general, I found some parts of the book far too detailed for my liking. I'm not a huge crime buff. I tend to prefer my thrillers to be a bit more action oriented than this was. I think anyone who enjoys that kind of thing will find this story more enjoyable than I did.The final third of the book where the plan of the Jackal was being executed while a massive man hunt to find and stop him was underway was a lot more enjoyable to me than all the setup and planning parts that take up the first two-thirds.Overall, I thought this was a decent read, but wasn't quite as exciting as I had expected."}, {"userName": "Cphe", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/14907696-cphe", "userReview": "A terrific read, fast paced, tautly written and excellent characterisation. Remember reading this many years ago but thoroughly enjoyed it the second time around. Liked the premise of the story, the lone assassin taking on the might of the French Police, a real game of cat and mouse. Thought the differences between the two main characters, the unknown assassin and the French Detective Claude Label well nuanced.......most of all I appreciated the \"twist\" at the end. Time and money well spent."}, {"userName": "Sarah", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/23841736-sarah", "userReview": "I didn't realize how hooked I was on this book until I was actually dismayed at the thought of the Jackal being caught by the detective.The story is about a fictional assassination attempt on Charles de Gaulle. The OAS has a grudge against de Gaulle and after several failed assassination attempts they realize that they have a leak and they decide to hire a professional assassin. It's very suspenseful and, more importantly, the whole thing was very realistic and highly plausible. I completely loved it."}, {"userName": "Naddy", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/35112891-naddy", "userReview": "It doesn't matter to write one more review about this book when it has already received zillions of accolades but i couldn't stop myself to write a crisp review.ahhh.. What a book ,Loved it thoroughly. Can't find any book in this genre even close to it. Very nicely written. I picked this book with great expectations and Frederick Forsyth lived up to my expectation. Thanks to Forsyth for being very astute in the realm of international intrigue, will keep u hooked till the last page. If you are into spy novels go for it blindly. Apart from content, they way the plan was knitted to kill president, how meticulously Jackal planned everything to complete his mission. His expertise on guns, disguising the identity, choosing the liberation day to kill the president, Role of Claude Lebel, how to track Jackal when there was not even enough technology compared to the present, i m awestruck, not only the content, this book is written with such brevity, u won't even feel like anything has been added to increase the length of the book. So, my rating would be 5/5."}, {"userName": "BrokenTune", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "“It is cold at six-forty in the morning on a March day in Paris, and seems even colder when a man is about to be executed by firing squad.”One of the best opening lines ever. This was a re-read for me, and I am glad I re-read this one. While the descriptions of the police work are now dated, this is still a great thriller. And I guess, it could even pass as historical fiction now since Forsyth gives a great overview of the political tension between France and Algeria in the 1960s and the presidency of Charles de Gaulle. For this alone this is a fascinating book.But there is more, the description of the police work trying to collaborate with international agencies was fascinating - no internet, no cell phones, no fax. I swear I laughed in admiration when Forsyth described how they tapped phones and identified a number that was called by the time it took for the dial to return to 0. Yes! Phones with dialling discs!And then of course, we have the main character, The Jackal, who is charming and almost made me forget that he is the baddie of the piece. Almost. Because unlike Fleming (sorry but I keep thinking about Bond, who also is a hired assassin when it comes down to it), Forsyth has no qualms about reminding us that the Jackal is a ruthless killer.So, even tho the details of the story are dated, this is still a chilling thrill of a read."}, {"userName": "Darwin8u", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "A tight and fantastic political/cat-and-mouse thriller. Edgar award winner 'The Day of the Jackal' is well-paced, originally plotted and filled with amazing research. Forsyth clearly belongs among the top ranks of the great thriller writers. He is often immitated (Clancy, Thor, McBain) but NEVER really replicated. Beyond the merits of the novel itself, the Day of the Jackal has also influenced actual assassins (Yigal Amir and Vladimir Arutinian), inspired the nickname for Ilich Ramírez Sánchez (aka Carlos the 'Jackal') and provided both an inspiration to and techniques for several genearations of identiy thieves. That is a helluva lot for just one novel's resume."}, {"userName": "La Tonya  Jordan", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/32053623-la-tonya-jordan", "userReview": "My impression is that the book started off slow giving you so much detail about Algeria, OAS, and other secret services. This book is a true story; therefore, to me it starts to get good when the Jackal enters the novel. It kept me in suspense and excitement because I did not know the Jackal's next move or how clever he could be to alter his plans when necessary. The French police working with other countries' security forces to track one man seems unreal. But, the respect people of different backgrounds have for a person's abilities, talents, and skills can bridge continents. This is what the Jackal was able to accomplish with his mission of assassinating the French President, for money only, in 1963. My favorite quotes from the book are: \"You don't understand,\" he told the lawyer, \"no squad of Frenchmen will raise their rifles against me.\" He was wrong. The execution was reported on the 8 a.m. news of Radio Number One in French.Thomas settled back in the armchair to try and get some sleep. While he had been talking it had quietly become August 15.No one volunteered. The meeting broke up as usual around midnight. Within thirty minutes it had become Friday, August 16.As the two men looked towards each other unknowingly above the waters of the Seine, the varied chimes of the churches of Paris ushered in August 22.As he turned the key in the lock and caught the first shrill rebuke of his wife, the clock chimed midnight and it was August 23........, a solitary little figure, to return to his wife and children. The day of the Jackal was over."}, {"userName": "Richard", "userReviewDate": "Jun 28, 2015", "userURL": "http://www.goodreads.com/user/show/8386404-richard", "userReview": "7.5/10An enjoyable thriller that takes you back in time to a land where detectives had to root out evil doers with old fashioned police work and when the bad guys could get a passport the next day by using a technique known to me from The Simpsons episode where Sideshow Bob became mayor. There isn’t much I can say about this one which probably hasn’t been said previously. The story is well written and unfolds nicely from a number of perspectives split throughout the novel. The jackal was well rounded and a superbly efficient professional only to be matched by an equally efficient professional police office in Claude Lebel. You have a feeling that things will work out as they do but it’s all about the journey and how many of the people get there which makes this all the more interesting.I listened to this on audiobook and it was an enjoyable listen. The narrator provided a couple of differing voices to make different characters noticeable but there were parts which were in French (it is a novel predominately set in France so I guess I can forgive this) which just missed me by miles and stilted the enjoyment. I enjoyed the novel but wasn’t blown away with it. I did find myself thinking about it at times which is a good sign but there were a couple of times on my way to work when I opted for music which is a bad sign. It’s very methodical in its structure but is a good read nonetheless and worthy of picking up."}, {"userName": "Paul Alkazraji", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/17198910-paul-alkazraji", "userReview": "'The Jackal' had Charles De Gaulle in his sight on Rue de Rennes. “Half a million dollars is the price,” says the blonde Englishman being hired to assassinate French President Charles De Gaulle. “Considering you expect to get France itself, you esteem your country very cheap,” he adds noting the shock at his fee. With the contract made, the story commences of how the Organisation Armée Secrète (OAS) hire ‘Charles Calcot’ - the first three letters of each name making CHA-CAL (jackal in French) - to remedy their sense of betrayal at the granting of Algerian independence. In ‘The Day of The Jackal’ we read of the assassin’s meticulously prepared false identities: the Danish Pastor Jensen, the American student Marty Schulberg and others. He orders his custom-built weapon from the mild-mannered Belgian armourer Goossens. He tests it in a forest glade in the Ardennes, and then welds it under the chassis of his sports car as he journeys towards Paris. Yet it is through the capture and torture of OAS bodyguard Viktor Kowalski that the Action Service get their breakthrough. Then the unassuming detective, Commissaire Claude Lebel, is charged with the unenviable task of identifying and stopping the approaching ‘Jackal’. The idea for the story came apparently to Frederick Forsyth whilst he was working as a Reuters correspondent in Paris in the early 60’s: the time in which the book’s events are set. The paramilitary organisation OAS existed as described in the book, and the Bastien-Thiry ambush in Chapter 1 is accurate. Forsyth reported from the actual scene and befriended several of De Gaulle’s bodyguards to boot. The rest of the award-winning plot, which he wrote to clear his debts, is fictional, and its success across four decades began with him commenting that he’d “never seen money like it”. Debts paid. Unlike most novelists at the time, Forsyth used the research techniques of investigative journalism to give it an increased reality. It reads like a reconstruction of historical fact, and, that said, could have used a little more fiction-writing technique in places to add vividness. Yet what we are given is a hugely enjoyable tale of negative tension, where the reader wants something not to happen: the assassination of a French President. As the heads of various departments of state security confer nightly around a table, one can imagine similar scenes in the Paris of our times as new threats to France are faced following the attacks on Charlie Hebdo, the Grenoble gas factory and the Thalys train. It’s to be hoped that men of Commissaire Lebel’s tenacity exist in reality as well as fiction. And so one recent September afternoon in Paris, with the indulgence of my wife, we wandered south of the Jardin Du Luxembourg in search of the very spot where the climactic action was set. We threaded our way past pavement cafes along the Rue Vavin towards the Boulevard du Montparnasse. It was an unmistakable site at 154 Rue de Rennes where on page 354 Forsyth writes: ‘Six floors up and a hundred and thirty meters away the Jackal held his rifle very steady and squinted down the telescopic sight…’ I took out my camera, focussed and shot the rooftops, recalling the scene: ‘Marchons, marchons a la Victoire’ went the national anthem as the tall, proud general in his khaki kepi hat was positioned in the crosshairs. He pins a medal on a war veteran, leans forward to kiss the man on each cheek suddenly, and… Well, as the story ends, ‘The day of the Jackal was over.’By this reviewer:"}, {"userName": "Meaghan", "userReviewDate": "Oct 06, 2007", "userURL": "http://www.goodreads.com/user/show/430758-meaghan", "userReview": "This is one of the great classics in the suspense novel genre, and with good reason. I was stunned by it. This book made me want to go to the library right away and check out every Forsyth novel they had.You know at the beginning that the assassination plot failed -- it says so -- but that doesn't stop you from clinging to the edge of your seat as your follow The Jackal and those who are chasing him. He's the consummate killer, using money, sex, drugs and whatever other tools are at his disposal to get the job done. I was rooting for him as well as for Lebel, the policeman chasing him. And the ending was as satisfying as I could have wished."}, {"userName": "Nooilforpacifists", "userReviewDate": "Mar 20, 2014", "userURL": "http://www.goodreads.com/user/show/26071992-nooilforpacifists", "userReview": "One of the greatest spy/thrillers of all time; move is too."}, {"userName": "Nandakishore Varma", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "This was the quintessential thriller during my teens, where we keep on rooting for the villain while praying at the same time that he doesn't succeed. \"The Jackal\" has become an iconic figure."}, {"userName": "Bodosika Bodosika", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/5553160-bodosika-bodosika", "userReview": "Though it took a little time to pick up steam the writer's attention to details made this book an interesting read....I gave it four stars."}, {"userName": "Samuel ", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/20026692-samuel", "userReview": "THE GREATEST HIT \"One shot. One kill\".- US Army Sniper motto. Frederick Forsyth. In terms of thriller writers, he's one of the greats or perhaps the great modern thriller writer. A journalist by trade, Forsyth made his name working in France and the slowly disintegrating republics of Cold War era Africa. It was in the latter where while reporting on the Nigerian civil war, he ran afoul of the British establishment for supporting the secessionist Biafra province in stark contrast to British foreign policy which backed the central government. Eventually returning to England, Forsyth noted that since he was broke, he should write a novel. He did so in 30 days, using what he had learned in journalism. What resulted was a book which has defined modern thriller writing for decades, creating many tropes, conventions and expectations the majority of thriller writers since have drawn upon. The Day Of The Jackal. The influence of this book on the spy/political/conspiracy thriller genre cannot be overstated. Brad Thor didn't create faction. Forsyth did, his book wowing audiences with a look behind the curtain into a shadow universe populated by criminals, spies and unscrupulous politicians who existed among us in real life. Tom Clancy may have taken the genre into the realm of a geopolitical Wagnerian epic, but Forsyth set down the principles all non military/intelligence/law enforcement personnel turned writers must follow. Research. Do your homework on the subject matter. Check out the places where you set your book. Or develop contacts with experts and sources who can give you pointers on the real world details which factor into your narrative. Having made friends with many professional mercenary soldiers, criminals and during a stint at reuters, President Charles De Gaulle's security detail, Forsyth was well prepared to write about one of the great what-if novels of all time, and create the most iconic contract killer in the thriller genre. The plot and outcome are already known. So for here, I'll be brief. It's the 1960's. The OAS terrorist group which wishes to bring about a conservative/nationalist coup in France due to the destruction of France's colonial empire is on the back foot. This is because of the then SDECE deploying the world's first intelligence service run paramilitary unit, the \"Action Service\". With the action service engaging in a campaign of assassination and rendition targeting the terrorists, the OAS decides it's time to go nuclear and finds itself a professional killer to pull off the impossible. Kill President Charles De Gaulle, the man who they believe has betrayed France. But like all jobs, it's not easy. Having an extensive law enforcement infrastructure at its disposal and Europe's best close protection detail, the French government seemingly has all bases covered. Except a few. They don't know the contract killer exists. They don't know what he is capable of. They don't know when he's coming. And by the time they do, the hunter may be in place to take down his prey. In terms of plot, while technology and events have changed (the author noted this himself in a new edition of the book), The Day Of The Jackal holds up quite well due to the excellent structure. Methodical, yet throwing in curveballs for the characters with increasing frequency, forcing them to adapt, while we know the outcome, each new plot development will keep the reader on their toes, asking how The Jackal or his hunters are going to overcome the new hurdle that's been thrown down. The settings are also well done and accurate. Forsyth lived in France for a time and the locations which The Jackal goes to when doing a recce on the best area to make his killing are geographically correct. He also gives us a trip into the 1960's underworld of Western Europe, the center of the spider's web being the innocent looking Belgium, packed full of gunsmiths, forgers and other professional criminals who exist below the seemingly benign facade of civilization. It's that dichotomy of a darkness co-existing with mere mortals which also make Forsyth unique. His worldview is not of the Ian Fleming school, but instead far more brutally honest about the moral ambiguity which exists, especially today. There are no boy scouts. There are only the quick and the dead. The competent or the incompetent. No idealists. Only realists In a Forsyth book, most of the characters have to leave whatever principles(if any) at the door because they don't matter in a world where there is no substitute to victory. There are very few heroes among Forsyth's characters. Almost all of them, especially The Jackal, have bathed their hands in blood. And the few that are aren't your glamorous/rugged spy/soldier, but more down to earth and far more intelligent. Brains, not brawn is the name of the game, along with a good plan which comes together. The real star of the show however is the research. Others authors(even Ian Fleming) experimented with adding real world details into their work. But not to the awe-inspiring extent and accuracy Forsyth did. His work has set the bar/standard which all spy/military/geopolitical authors who have come after him must reach if they wish to be taken seriously. Take for example the operating procedure of The Jackal. He doesn't go buy some rifle off the shelf and immediately head off to France expecting to blow his target's head off. He does his homework on his target's routines, brainstorms the best method to make the killing, enters France covertly with a forged passport and then does a recce of potential locations to conduct the hit. And that's only the tip of the iceberg regarding the man's preparations. It's no small wonder why the perpetrators of three real life political killings have used this book for pointers on how to commit their own murder attempts. Apart from that, we also have a pretty impressive look at law enforcement in 1960's France, (presumably courtesy of Forsyth's buddies running French Presidential security.) You think post-9/11 America went down a dark road? You ain't seen nothing yet. The French unjustly get slapped with the \"cheese eating surrender monkey\" label. It couldn't be further from the truth. Most people think Mossad created the paramilitary side of the espionage game. Nope, it was the French. Meet the Action service, a group which still exists under the DGSE. Before the world had heard of Jack Bauer or Mitch Rapp, these were the guys dealing death to the enemies of the French state, breaking laws to preserve the democracy they served for the greater good. And in The Day Of The Jackal, we get to see the sort of thing, they're capable of, in scenes more brutal than a \"24\" Season. Now, characters. This is the main criticism of the novel. First of all, Frederick Forsyth's work is not about character development. It never was, considering each of his books is a closed loop/stand alone story. Want decent psychological depth? Tom Clancy and John Le Carre serve that up in spades. However, never fear, even if they seem a bit more shallow than modern thriller characters, The Day Of The Jackal is primarily a story between two titans, whose conflict is the driving force behind the plot. Meet The Jackal. The sort of contract killer with the best odds of executing a complex political killing. No name. No past. No future. He could be an Englishman, a German or an American. He could have toppled a dictatorship in his first contract. He could be a mercenary who has decided to take on more interesting prey in Europe. Who knows? The only thing you really need to know is that he's bloody good at what he does for a living. The ultimate consummate professional in other words. While undeniably a decent shot and fighter, that pales into comparison with his phenomenal planning abilities. With what the job entails, it's not going to be a simple sort of plan. But being capable of adapting to changing circumstances allows The Jackal to make it work up to the point he's within range of the target. However, as the old US Military saying goes \"plans don't survive first contact with the enemy\", and that, combined with neglecting one insignificant detail leads to his downfall. Next, we have Inspector Claude Lebel. Middle aged, unglamorous and held in contempt by the politicians who put him in charge of investigating the incoming threat, he's the polar opposite of the modern day spy/counter-terrorist thriller character. But having the face of a nobody has advantages, namely hiding his intelligence. His storyline has a lesson of sorts. While the French law enforcement infrastructure, especially the SDECE with all its strength flails impotently, he succeeds where they fail, using solid investigative work to pick apart The Jackal's contract in a methodical fashion. This is best exemplified during the climax. While the presidential security team stacks insurmountable meat-shields around De Gaulle, Lebel, knowing The Jackal would have had to come early, systematically begins checking the windows of the buildings around the area, which ultimately saves the day. So, overall, while dated, and perhaps not as enlivening as other conspiracy/political thrillers which have come after it (due to the slower pacing and characterization), I have to say this. You cannot call yourself a fan of spy/political/conspiracy thrillers if you have not read \"The Day Of The Jackal.\" It is perhaps the most influential book in thriller writing history. Brad Thor said fiction had to make sense. The Day Of The Jackal is the first thriller novel to make this idea an expectation for readers around the world. You might not need to be a former soldier/spy/cop to write a novel. But you must do your homework to make one successful. It might be fiction at the end of the day. But as Forsyth proved with an assassin, a cold day in Paris and a shot that would have made history, the facts can make fiction even better. MOST CERTAINLY RECOMMENDED."}, {"userName": "John Farebrother", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/68609816-john-farebrother", "userReview": "Like The Dogs of War, in my view one of Forsyth's best works. He is the consummate thriller story-teller, building on the reader's tension established at the very start right through to the surprising climax. The film starring Richard Gear fell far short of the book. The author also demonstrates an intimate knowledge of intelligence services and the underworld, in particular the OAS, the French anti-De Gaulle movement that arose in the army after his decision to leave Algeria. Another ripping yarn."}], "description": "Librarian note: an alternate cover for this edition can be found here.The Jackal. A tall, blond Englishman with opaque, gray eyes. A killer at the top of his profession. A man unknown to any secret service in the  world. An assassin with a contract to kill the world's most heavily guarded man.One  man with a rifle who can change the course of history. One man whose mission is so secretive not even his employers know his name. And as the minutes count down to the final act of execution, it seems that there is no power on earth that can stop the Jackal.", "title": "The Day of the Jackal", "url": "http://www.goodreads.com/book/show/540020.The_Day_of_the_Jackal", "average": 4.25, "cover": "https://images.gr-assets.com/books/1405364996l/540020.jpg", "reviews": 1584, "authors": [{"url": "https://www.goodreads.com/author/show/36714.Frederick_Forsyth", "name": "Frederick Forsyth"}], "type": ["Fiction", "Thriller", "Mystery", "Mystery", "Spy Thriller"], "outlinks": ["http://www.goodreads.com/book/show/540020.The_Day_of_the_Jackal", "http://www.goodreads.com/book/show/1793193.Day_of_the_Jackal", "http://www.goodreads.com/book/show/25693082", "http://www.goodreads.com/book/show/23272471-the-day-of-the-jackal", "http://www.goodreads.com/book/show/2972953-the-day-of-the-jackal", "http://www.goodreads.com/book/show/9982567-the-day-of-the-jackal", "http://www.goodreads.com/book/show/3947082-the-day-of-the-jackal", "http://www.goodreads.com/book/show/19932087-the-day-of-the-jackal", "http://www.goodreads.com/book/show/8380082-the-day-of-the-jackal", "http://www.goodreads.com/book/show/87591.The_Day_of_the_Jackal", "http://www.goodreads.com/book/show/981998.The_Day_of_the_Jackal", "http://www.goodreads.com/book/show/149572.The_Odessa_File", "http://www.goodreads.com/book/show/327255.Fourth_Protocol", "http://www.goodreads.com/book/show/460717.The_Dogs_of_War", "http://www.goodreads.com/book/show/825473.The_Devil_s_Alternative", "http://www.goodreads.com/book/show/109510.The_Negotiator", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}