{"ratings": 56407, "userreviews": [{"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Dec 19, 2010", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "Did you ever go to a Tupperware party where the hostess spent forever demonstrating all the gadgets in a dramatically effervescent voice? And at the end nobody bought anything? And there weren't even any refreshments being served to make it worth having shown up? And you didn't like any of the other people who came to the party? This book is that party---all elaborate demonstration, no sale, no refreshment, and no one I care about."}, {"userName": "James", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "4 out of 5 stars to Kate Morton's The Distant Hours, a beautifully written and compelling story of sisters, mothers and daughters across two different time periods set in London and rural England. \n\nWhy This Book?\n\nI'd read one of her other books, The Forgotten Garden, and fell in love with Kate Morton's style, effortless reads and vivid settings and characters. I had to continue absorbing as much of her books as I could, but given they are usually 500+ pages, and quite intense, I have to layer them in every few months. I happened to arrive in my building's laundry room a few minutes early and perused the library's bookshelves while waiting for the dryer to complete its cycle. Lo an' behold, there she stood.Some kind soul had dropped off this book and it beckoned me to depart quickly with it. Well... as soon as I finished getting all my clothes out of the dryer. It sat on my living room's bookshelves for a few weeks, until I'd seen a review of it this week and decided to move it up on my TBR list. SO GLAD I DID!\n\nOverview of Story\n\nEdie Burchill, a thirty year old book lover working in the publishing industry, recently split from her live-in boyfriend, is visiting her parents one weekend when a letter arrives in the mail, postmarked nearly 50 years ago. Edie's mother, Meredith, tells her very little, only that it came from one of the Blythe sisters who live at Milderhurst Castle where Meredith stayed as an evacuee during WWII's German Blitz. Though Edie and her mother aren't very close, she knows Meredith hasn't told her the entire story. And when Edie finds herself driving near the castle, and an opportunity to take a tour arises, she jumps on it. Inside Edie meets 85ish twins, Saffy and Percy, who care for their much younger sister, Juniper who is in her early 70s. All is not well with Juniper, who thinks Edie is actually Meredith from nearly 50 years ago. Edie visits local historians, presses her mother's family and becomes closer to the twin sisters, in hopes she'll discover what hides behind her mother's wistful eyes. And as she falls deeper in the story, she learns of a broken engagement, a missing fiancee, a long-lost love, a crazy author, an affair and a few mysterious deaths. Not to mention the mystery of the \"mud man\" who the sisters' father, Raymond Blythe, wrote a famous fiction (or was it?) story nearly 70 years before.\n\nApproach & Style\n\nThe book alternates time periods every few chapters, showing what happened in 1939-1941 and what is happening currently in the 1990s. Chapters take on different points of view and focus from all of the core characters: Raymond Blythe. His 3 daughters, Saffy, Percy and Juniper. Edie spends time with her parents and her mother's sister Rita. Mr. Cavill, the missing fiancee, has his own stories and connections, and his family is still looking for him in current time. The stories and characters unfold chapter by chapter, leading readers to discover all the covert relationships and actions that have occurred to bring everything to current times.\n\nStrengths\n\nKate Morton is quickly becoming my favorite author. Her writing style, though a little exaggerated and too lyrical at times, is astoundingly beautiful. You will always picture the setting, the views and the backdrops. Her choice of words ranges from intoxicating to phenomenal. And her ability to stop the story at just the right moment before switching to a different character or point of view is dazzling. And sometimes, it's not even a cliffhanger or point of suspense; it's a mere change to give you a chance to breathe and let your imagination run free for a bit.The plot is intricate, realistic and intense. You question with each chapter the motivation of the good people and the sentiment of the bad people. You wonder why they make the decision they make, only to find out later, you should never second guess it. I can imagine Morton writes very detailed outlines over several months, determining when to drop certain hints, and when to hold back for a complete and utter shock. She's clearly writing in a forum and a genre that is well-suited to her strengths.\n\nOpen Questions & Concerns\n\nAt times, the story is a little too unclear. In 90% of the cases, it works to your advantage as your suspense and thrill increases; however, every so often, it goes a little too far, unravels more than it needs to and opens itself up to a few too many questions that don't fully find resolution. In particular, with the ending of this one, I wasn't sure of a connection to make with the delay that happens on the bus (no spoilers here!)... that said, it's easily forgiven, but this reader wanted it a little more tidied up.Empathy for the character of Juniper should have been a stronger theme. Readers will feel attached to her, but when you discover what truly happened to her in the end, and how it seems so much could have been prevented, you wonder whether she was just there to suffer. A tweak here and there might have made this a little more acceptable, but then again, reality doesn't always work that way either. People have a misguided notion they are doing the right thing for the wrong reasons.\n\nFinal Thoughts\n\nIf you love flowery language, tremendous detail and an ethereal quality in a story, you must read Morton's books. And this one in particular shows the push/pull between siblings and parents and children, all the things you never know even though you live together for so many years. We are all different people and despite sharing so much in common, our relationships are unique. This book shows us how to question why a sister can control another, how a mother can choose not to truly love her child... and how a man could go crazy over losing so much in a lifetime.Go into this one expecting a long and intense journey, and you will be pleased. Go into this hoping for a thrilling ride of great leaps and shocks, you will be disappointed. This is not about how dastardly someone has behaved; this is about how people disappoint one another when they least expect to.\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world! And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Thanks for stopping by! Images are from GIPHY!"}, {"userName": "Anna", "userReviewDate": "Oct 23, 2010", "userURL": "http://www.goodreads.com/user/show/1632609-anna", "userReview": "I adored Kate Morton’s The House At Riverton and The Forgotten Garden, giving them both 5 stars, but delayed reading The Distant Hours after hearing so many bad reviews about it from people who, like me, loved those earlier books. I finally decided to take the plunge, hoping to disagree with the bad reviews. Sadly, I don't. The Distant Hours is packed full of unnecessary detail and description. On and on it goes, page after page of long-winded waffle, page after page of no dialogue, no action and no furthering of the plot. I can see that she was trying to create an atmospheric literary piece, but I think she tried too hard to be too clever, entirely at the expense of the actual story. Had this been my first Morton book, it would have also been my last. In fact, had it had been my first, I’d have abandoned it before the half way point. I stuck with it through 'loyalty' to Morton, and skim-read it in the hope that the 'real' author would eventually appear, and give me her usual tantalising, goose-bump inducing reveal. She did not. When the reveal finally limped in, I just thought, 'yeah, whatever.' The sad thing is, it could have been so good. It has all the right elements: three mysterious elderly spinster sisters who live in an imposing castle; the memory of their haunted and troubled father; a lover who’s been missing for 50 years; a woman who lived in the castle in her teens but has never talked of it since; various secondary characters with hints of their own secrets. It so easily could have been another intriguing, suspenseful, excellent Morton book.Hugely frustrating."}, {"userName": "Hannah", "userReviewDate": "Apr 15, 2010", "userURL": "http://www.goodreads.com/user/show/2411388-hannah", "userReview": "I loved Morton's earlier novel, The Forgotten Garden, and had high expectations for this one as well. If this book wasn't tailored made for my reading tastes, I don't know what would be:- Ancient castle in the bucholic English countryside- Past and present plotlines weaving and intersecting- Homage to books, readers and the written word- Gothic elements galore (including madness, forbidden love, family secrets, a lost letter, and a creepy children's story)However, by the end of this massive 560 page book, I was left closing the back cover with what I am sure was a comical \"What-the-****-?\" look on my face.Seriously, I concur with so many other disappointed reviewers that this book needed major red pencil attention by the editors. Morton is a gifted writer, but this book suffered from too much literary cleverness at the expense of what should have been a gripping and taunt gothic mystery. It's not enough that she can write strings of beautiful sentences; there needs to be a satisfying conclusion to such a whopping tome that I've invested loads of not-so-distant hours toward finishing.This time, the Morton magic didn't happen for me."}, {"userName": "Anne", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/27544490-anne", "userReview": "Actual rating: 3.5 🌟My edition of this book has over 700 pages, but it really didn't feel like a long book. The pages just kept flying by, which is due to Kate Morton's excellent writing style. She has a way of pulling you into the story and making everything feel alive and real. You have no option but to be completely invested and enthralled by what's happening. Like with her other books, the setting and overall \"feel\" of the book were just perfect. The suspense is written in a wonderful way - not over the top and just the perfect amount to keep you guessing without driving you crazy (and thus becoming annoying).However, I did enjoy this one less than the other two book by her I've read (The House at Riverton and The Forgotten Garden). This was mostly because I just didn't connect to any of the characters. I even disliked the main character Edie at certain points (no real reason why, I just didn't find her very sympathetic). And with the others, I felt like I didn't \"get a good grip on them\", so to say. And then the two characters I would have loved to get a clearer picture of (Raymond Blythe and Thomas Cavill) were kind of glossed over. A better view into their lives and thoughts would have been wonderful, and considering that they both are key figures, it definitely would have made sense and added some more depth to the story.Then again, the book definitely earns some plus points for being unpredictable. The ending, like in Morton's other books, takes a dark turn, and once again, I was not let down. The way all the beautiful things are combined with the gruesome and dark themes is done in a great and fitting way. Like I've said in my other reviews of her books: I'm glad she doesn't shy away from going down this route!Despite my detachment from the characters, I had a great reading experience and would definitely recommend it to others."}, {"userName": "Carol", "userReviewDate": "Sep 13, 2010", "userURL": "http://www.goodreads.com/user/show/1335103-carol", "userReview": "I welled up when this book ended & not just because I hated to see it end. One could weep over the sad lives of the 3 Blythe sisters, now elderly, & living with secrets that are beautifully & gradually revealed. The story jumps from the 1990's in London to the Milderhurst Castle during W.W.II and the present. When Edie Burchill encounters the 3 elderly sisters she is drawn into a family of secrets, whose \"distant hours\" are simply a wonder to read. It may be the best I've read since \"The Help\"."}, {"userName": "Margaret", "userReviewDate": "Nov 19, 2010", "userURL": "http://www.goodreads.com/user/show/1379840-margaret", "userReview": "I abandoned the effort to read The Distant Hours about a third of the way in. I don’t know quite what to make of Kate Morton, whose writing (at least for me) gets increasingly annoying with every book she publishes. At some point she has begun to confuse languor with atmosphere, and the pace of this book is like sitting on the leading edge of an advancing glacier. It could be millennia before it gets where it’s going. Morton is plainly far more interested in the details of setting and landscape than in narrative and character, and consequently she spends far more time on description and explanation than on dialogue or action, with the result that I started to feel as if I were having a guided tour of a novel instead of reading one. This is all the more frustrating because somewhere under all the visual detail there’s a story I was kind of interested in hearing, but she just wore me down with page after page after page of rambling, stylistically torpid journeys through landscapes both external and internal. I gave up after a two and half page description of someone looking for a pile of laundry. Life is just too short."}, {"userName": "Roger Kean", "userReviewDate": "Jun 10, 2011", "userURL": "http://www.goodreads.com/user/show/5600418-roger-kean", "userReview": "Is Kate Morton a women's writer? As an Ann Tyler and Maeve Binchy fan, I wouldn't know. I loved Morton's previous two books, and this one is even better. Flying back and forth in time between the evacuation of children from London prior to the blitz of 1941 and the modern day (1992), Book editor Edie Burchill uncovers the truth behind the creation of \"The True History of the Mud Man,\" a spectacularly successful children's story written by the patriarch of Milderhurst Castle in Kent, now in the possession of the \"Sisters Blythe,\" three characters truly wrecked by their father and their connection to the baleful book he wrote. Central to the complex and thoroughly gripping plot is Edie's mother, who was thirteen when she was evacuated in the war to Milderhurst and became entwined in the drama. Her part of the tale is only one of the things Edie discovers.Morton writes great characters and provides them with intelligent and utterly believable dialog. The slow unraveling of the plot is a delight, and I read this one in three evenings flat."}, {"userName": "Stacy", "userReviewDate": "Jan 19, 2011", "userURL": "http://www.goodreads.com/user/show/4840825-stacy", "userReview": "I have recently finished reading this book and I just loved it! I had it finished in a week. A few times a got a little frustrated wanting to know the secrets but the wait was well worth it. There are a lot of secrets in this book.I was worried it wasn't going to stack up to her two previous books due to some 'not so good' reviews I've read and heard. This book is a lot darker than her other two, but similar in the switching back and forth from the present to the past. Again, I love the way she tells a story and this is a fabulous story to read. Remember though, it is a dark book and she does take her time building the characters but it was one hell of a read. I hope you enjoy it as much as I did. It all starts with a lost letter delivered to Edith’s Mum, Meredith. The letter has been lost for 50 years. The letter is from Juniper Blythe who is now an eldery lady. Juniper and her twin sisters took Meredith in during the 1940 London Blitz and here the story begins of Middlehurst Castle and the secrets within it's walls......"}, {"userName": "Christy B", "userReviewDate": "Apr 22, 2010", "userURL": "http://www.goodreads.com/user/show/1204629-christy-b", "userReview": "I read the last hundred pages of The Distant Hours in the middle of a pretty intense storm. This just brought me even deeper into the story, where I felt as though I was a part of it. People who have finished The Distant Hours will know what I'm talking about.I'm such a huge Kate Morton fan. I raved over her two previous books: The House at Riverton and The Forgotten Garden, so when I heard about The Distant Hours a year ago, I could not wait for it. I had such high expectations, and I figured, for once, I wouldn't be let down by them.I was right. Oh, was I right. The Distant Hours was such a lush, dark, beautiful, sad, novel. I felt myself lost in it every time I picked it up. The mystery and the scenery. I was so caught up.The story starts when a lost 50 year old letter arrives in the post. Edie watches her mother's reaction as she reads the letter and Edie immediately becomes curious. The curiosity leads her to Milderhurst Castle, home to the sisters Blythe and home to Edie's mother during the London Blitz. Edie finds twin sisters Percy and Saffy and their younger sister Juniper, who hasn't been quite the same since her fiancée abandoned her 50 years ago.Edie finds there is much to their story. Much more. Nothing is as it seems, of course. Stories and legends that have been around for decades prove to be untrue. Just when you think you've got something figured out, you are not even close.That happened to me. Many times. I wasn't right about a darn thing. Nothing was as it seemed. And even at the end, we find out that Edie's conclusion - what she believed was the truth - wasn't correct. However, it didn't matter. No matter how you looked at it, the ending was sad.The Distant Hours was more character driven than plot driven, so therefore it's not for readers who like fast moving plots. The story weaves in and out of 1941 and 1992, switching back and forth seamlessly.I took my time with this one, despite my desire to find out what happens, because I wanted it to last as long as possible. Like her previous novels, Morton has written another story that has permanently attached itself to my imagination. Its ending never leaving me. All the sad 'what ifs'."}, {"userName": "Sara", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "I am a sucker for ancient, decaying castles with occupants who are eccentric and obviously have secrets to hide. When Morton sets the stage and begins to play out the lives of the Blythe sisters, children of a famous and ultimately bizarre writer, during the time of WWII, she has me hooked. At the same time, she introduces the modern-day story of Edie Burchill, the daughter of a WWII child evacuee who was sent to the castle to wait out the war. It is her mother's story that Edie is determined to unearth, but in the process she finds herself enmeshed in the story of the Blythe sisters as well. This contrivance of running parallel stories in different time lines is fairly common and seldom well done. Morton does it well. She makes us equally interested in both stories and anxious to see how they converge one upon the other.I would never argue that Morton's books are great literature. They are pure enjoyment. Now and then, that is what we need and what we seek. I never feel disappointed by having spent my time with her characters and she keeps me straining to figure out what the truth of the mystery will be (which I never do)."}, {"userName": "Eve", "userReviewDate": "Nov 09, 2010", "userURL": "http://www.goodreads.com/user/show/758088-eve", "userReview": "If I only read one book this fall, I decided months ago, it would have to be The Distant Hours by Kate Morton. Kate Morton’s debut novel, The House of Riverton, held me so spellbound that as soon as I finished it, I read it again. Despite the fact that The House of Riverton left me emotionally drained, I eagerly pre-ordered her next novel, The Forgotten Garden, and devoured it in one sitting, heedless of the late hour and lack of sleep, when it finally came. I'm glad to report that her third effort, The Distant Hours, was just as compulsively readable and captivating as the first two. Everything I loved in The House at Riverton and The Forgotten Garden, and have come to expect from Kate Morton, is in The Distant Hours.First, there's always a mystery that unfolds in lush, gothic detail, usually in a bygone era. Here, a letter sent during World War II arrives 50 years later. Like a siren call from the past, Edie is compelled to find Milderhurst Castle and discover the fate of the Sisters Blythe, Juniper, Persephone, and Seraphina. Aristocratic beauties in their day, what has happened to the Sisters Blythe over the years and what precipitated their tragic decay reminds me a bit of Grey Gardens mixed with We Have Always Lived at the Castle. So lovely and promising in their youth, they are now old women who never escaped the mouldy castle of their forebears, their dreams strangled by a mysterious tragedy 50 years before. “Have you ever wondered what the stretch of time smells like? I can’t say I had, not before I set foot inside Milderhurst Castle, but I certainly know now. Mould and ammonia, a pinch of lavender and a fair whack of dust, the mass disintergration of very old sheets of paper. And there’s something else too, something underlying it all, something verging on rotten or stewed but not. It took me a while to work out what that smell was, but I think I know now. It’s the past. Thoughts and dreams, hopes and hurts, all brewed together, shifting in the stagnant air, unable to dissipate completely.”The long shadows cast by their controlling father, a celebrated novelist, and his most famous work, The True History of the Mud Man, over their lives has something to do with why the Sisters Blythe have never left the castle. Morton, as usual, is adept at weaving subtle strands and hints so that even as the reader uncovers more and more of the mystery, the final reveal is devastating and unexpected. Hint - within the short, haunting excerpt from the Mud Man tale in the beginning of the book are symbolic clues as to the dark history and future of the Sisters Blythe. Love affairs cut tragically short; age-old secrets waiting to be discovered; suspenseful, atmospheric setting; and writing that left me breathless - The Distant Hours enthralled me to the very end."}, {"userName": "Katrina Passick Lumsden", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/1964146-katrina-passick-lumsden", "userReview": "I can't say enough about this book. It's not a happy one, so don't go into it thinking you're going to get a sweet happily ever after. No, that's not really Kate Morton's style. But beautifully lyrical prose and an almost unnerving talent for atmosphere makes this, on the surface a beautiful read. What's not so obvious is that Morton's talent for crafting intricately layered, interesting characters is superb. She presents you with a certain set of traits for each character that cause you to draw a hasty conclusion about their personality only to pull the rug out from under you later and completely destroy your preconceived notions. Each character shifts, grows, becomes more three-dimensional as you delve further into the story, and that's just what characters in a story should do. The story itself is sad. A love affair whose reverberations continue fifty years into the future and affect quite a few people. But it's also a reminder to live your life for yourself, to let go of fear and the machinations of others, to love those around you, but not to allow that love to suffocate you. It's a reminder that love isn't always a grand thing, but sometimes it's all we've got."}, {"userName": "Beatriz", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/46560610-beatriz", "userReview": "Un relato exquisito, una narración que envuelve los sentidos. Entra en la categoría de aquellas obras que terminas sin darte cuenta. Es un libro de amores y desamores, de admiración y decepción, de respeto e intolerancia. Un secreto familiar que sale a la luz de la forma más inesperada, a través del poder de las letras contenidas en una carta abierta por casualidad cincuenta años más tarde de lo previsto, y letras que trascienden más allá de las propias páginas del libro que las contiene. Porque La verdadera historia del hombre de barro, obra ficticia de la novela cuyo prólogo se nos aparece nada más abrir Las horas distantes, se convierte en un protagonista más; ya quisiera que fuera real para poder leerlo.Es primera vez que leo algo de esta autora y me ha sorprendido mucho, sobre todo en la habilidad de hacer encajar todas las piezas de una forma muy fluida, cada una en su justa medida y sin dejar cabos sueltos. Realmente fue un gran descubrimiento y estoy ansiosa de poder leer sus otras novelas que, por la opinión de otros lectores, superan a Las horas distantes."}, {"userName": "Bark", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "My friend passed this across the table and promised a trio of spinsters, a creaky castle and long hidden family secrets. I probably should not have taken the book, seeing as it’s roughly a million pages long and I read at a slugs pace, but I was sold anyway because I’m nosey and books with dark secrets cannot be turned away.This book kept luring me in with a whole lot of this.\nBut then it delivered nothing but a whole lot of empty promises until about page 4 million and 80. Then the twists and turns come fast and furiously but for me it was a little too little and all far too late.From here on out, I will never ignore my instincts to DNF.So on to the good. For those with more patience for slow moving books than I, this story is very atmospheric and I have to admit that there was something about it that kept me reading. It starts off with a letter that leads a woman to delve into the past of her mom and her relationship to three sisters who live in a castle. She’s nosey like me. I liked her. There’s a smidge of romance and the promise of dastardly deeds and perhaps a murder. There were many points where I zombie read and had to flip back a few pages but it always managed to re-hook me. The characters are also a quirky bunch and I liked that.So, I’d say this is a good choice for a gloomy rainy day (week, month?) if you like mysterious books where the castle is more of a character than many of the living, breathing characters within. But you must have endless patience and I clearly do not."}, {"userName": "Morana Mazor", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/30488471-morana-mazor", "userReview": "I opet odlična Kate Morton! U njezino sam se pisanje zaljubila uz knjigu \"Zaboravljeni vrt\", ali mogu reći da su mi i \"Davni trenuci\" na istoj razini kvalitete.Volim tu njezinu mistiku, tajne koje se otkrivaju, ozračje veličanstvenih, starih zdanja zidova punih knjiga i slika, a svako od kojih krije neispričane i brižno skrivane sudbine svojih žitelja.Ovaj puta pratim priču triju sestara, sada već starijih dama, koje su svoje živote provele na obiteljskom imanju, u dvorcu Mildehurst čije zidine skrivaju šokantna zbivanja iz prošlosti.Sve počinje jednim pismom, koje je tek nakon punih 50 god. isporučeno svom primatelju i s kojim počinje ova prekrasna priča koja nas, stranicu po stranicu sve više privlači u sebe. Pisano u maniri starih majstora pripovijedanja (ali, uz majstorsko isprepletanje sa suvremenim detaljima); atmosfera Orkanskih visova, Jane Eyre i sl. uspješnica mislim da Kate Morton malo kojeg pravog ljubitelja pisane riječi može ostaviti ravnodušnim. Čitajte i uživajte..."}, {"userName": "Melisa - Traveling Sister", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/42481357-melisa---traveling-sister", "userReview": "Update // I'm pretty sure I need to reread this book for a fair review as I was sick and cranky while reading it and I think it affected my judgment. One day I will reassess //This pains me to say - I did not love this book. While I adore Kate Morton and her novels read like one epic poem, this one was just much too slow for me. The writing is brilliant, she can create an atmosphere with prose like no one else, and while even the plot was very intriguing, I felt as if that couldn't even save me from the pace. 3.5 sad stars, rounded up because it's beautiful no matter how slow."}, {"userName": "TL ", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/4342402-tl", "userReview": "Ancient walls that sing the Distant Hours.The story meanders a bit, taking its time letting you into the world of the Sisters Blythe and their father Raymond, Edie and her mum. It splits between 1941 and 1992, introducing everyone as it pleases. It all starts when Edie's mother Meredith, gets a long lost letter in the mail from someone she didn't expect to hear from. We find out who and what later on, but this piece of mail starts Edie down the trail of her mom from long ago, during World War Two. By chance (or is it?) she stumbles upon Middlehurst castle after getting lost and impulsively decides to stay the night.Middlehurst... you can feel the secrecy, regrets, and emotion in this place stretching out it's fingers to you from the past, beckoning you in. It's a feeling hard to describe but some of it is loneliness and pain... but nothing as simple either.One of the many things I loved about this book both times I read it is the lack of predictability. Each time I thought I had a piece of the story figured out, something else would pop up and change my perception. Tragedy colors the novel but also laughter, determination, and hope. Even with the hope, sometimes it felt like a shadow was in the corner, waiting for it's turn to walk in.Secrets and betrayal ripple throughout,one seeming to stretch from another and shape someone else's fate in some cases. One instance or two the people involved thought it was done with best intentions but find themselves carrying a heavy burden.I felt for each of the Sisters in different ways but most of all for Juniper... the person she was then and how we meet her in present day... *hugs her gently*Like Mister Carlos Ruiz Zafon (though their styles are wonderfully different), Kate Morton has a way of weaving her tapestry of people and places, building atmosphere and tension. It's a wonderful feeling to let go and disappear into the rich and complex world of this, dreading and yet really wanting to know what happened to set everyone on the path that led to present day.Once again, words fail to say how this book affected me... this was the introduction to Miss Morton's writing for me, another one of those chance finds on the shelf at work :). Sounds cheesy, but the cover just 'called out' to me every time I passed it. So glad I took the chance on this <3It takes awhile to get to what happened, but the journey I didn't mind at all. We get clues dropped in throughout each chapter and glimpses into everyone's minds. I couldn't turn the pages fast enough :).When the secrets come out, it's a doozy. The first time, I was floored... did not expect to hear what I did and not long after, yet something else came up and then something after that. I won't spoil it for you, but your heart will go out to everyone when it comes.One secret that was sort of in the background but still present I remember guessing at, but being wrong yet again... Looking back when you think on everything,you can see in certain parts the little things you picked up on and/or may have mistaken for something else, or perhaps disregarded at the moment.Raymond Blythe is at the center and the side of alot of things and his actions echo down long after.There's three endings of a sort really.. two have connections to the past although in different ways. The other, is haunting and lays certain things out that had my mouth dropping open the first time and my heart pounding.One of the most beautiful gorgeous novels I have had the pleasure to read, and will read many times more... highly recommend, happy reading!“It was the sibling thing, I suppose. I was fascinated by the intricate tangle of love and duty and resentment that tied them together. The glances they exchanged; the complicated balance of power established over decades; the games I would never play with rules I would never fully understand. And perhaps that was key: they were such a natural group that they made me feel remarkably singular by comparison. To watch them together was to know strongly, painfully, all that I'd been missing.” .“For it is said, you know, that a letter will always seek a reader; that sooner or later, like it or not, words have a way of finding the light, of making their secrets known.” .Pre review:That's it... going back to an old favorite!"}, {"userName": "Veronica", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/2153853-veronica", "userReview": "I was very disappointed with this. I enjoyed her two previous books, without thinking they were masterpieces -- just long, lazy holiday reads. But this one began to seem awfully long, with too little substance and far too much padding. From the start, I felt the present-day first person narrative and the parts told in the third person and set in 1941 didn't sit well together. I did enjoy the 1941 parts at first; Middleton is still superb at evoking an atmosphere in the past with lots of period detail (certainly a million times better than Mary Ann Shaffer). But even these parts started to seem too slight, long-winded, and repetitive. In the 1992 part, I even warmed to the shy, bookish Edie at first, but she was such a dull, self-effacing character that it was simply not believable that people who hardly knew her would suddenly start confiding their fifty-year old secrets to her.As with her other books, you could guess roughly how things would turn out halfway through (even if she reserved a few twists). But oh, she took a long time getting there, and then galloped through a bunch of implausible coincidences to reach the denouement in thirty pages or so. She was trying much too hard with the gothic touches. And the epilogue was downright cheesy. A good editor with a big red pen would have helped a lot, but I still don't think it would have matched up to her other books, which had enough subtlety to retain interest."}, {"userName": "Erin", "userReviewDate": "Nov 04, 2010", "userURL": "http://www.goodreads.com/user/show/436675-erin", "userReview": "Any book over 500 pages makes me narrow my eyes suspiciously. There is so much room for extraneous things in a book that size. I was pleasantly surprised to find nothing extraneous whatsoever in The Distant Hours. It’s so long because Morton doesn’t just focus on a few main mysteries. Instead, she weaves in all manner of smaller unknowns that click into place one by one, usually just when the reader has nearly forgotten about them completely. The result is an extremely complex and masterfully woven plot that doesn’t sort itself out until the very last pages.The novel is broken into five parts. Each part is broken into chapters of two types: there are Edie’s chapters, which bear names instead of numbers, and there are flashback chapters, numbered and dated. I thought at first that the flashback chapters were Edie’s reconstruction of the story, but I soon realized that wasn’t the case. The flashbacks tell what really happened, clarifying some mysteries even Edie never solves. These historical chapters could be a separate novel in and of themselves.Morton does an amazing job drawing all of her characters. Even the minor ones, from the Blythes’ housekeeper to the town gossip to Edie’s boss, are vivid and real. Yet the full cast of characters doesn’t detract from the story. I was never confused about who was who, and by the novel’s end I had a good sense of where each character fit into the story.I thoroughly enjoyed reading The Distant Hours. While no book is without its flaws, there is no one thing about The Distant Hours that stuck out to me as being off. I would not hesitate to recommend The Distant Hours to anyone interested, and I hope to check out Morton’s backlist for myself in the near future."}, {"userName": "A. R.", "userReviewDate": "Nov 30, 2010", "userURL": "http://www.goodreads.com/user/show/2037711-a-r", "userReview": "What a disappointment!!!! I loved 'The Forgotten Garden'. It's one of my favorite books to recommend so naturally I was excited to read another work by Kate Morton. I found the entire story to long, to drawn out and lacking any real emotion. It was an effort to finish. With the exception of one or two chapters about the relationship between Thomas Cavill and Juniper Blythe it felt like a narration you would find in the newspaper.I had the ending figured out three hundred pages into the book and read the remaining 260 pages just to see if I was correct. The book was plot driven - not character driven. I much prefer the latter.And whoever compared the story to 'Shadow in the Wind' must not have read one or the other book. There is no comparison. It's like comparing Shakespeare to Harlequin Romance. One is full of characters with strong compelling personalities - the other is full of paper dolls. One is full of suspense with unexpected turns - the other like a drive to the local market.Not a book I would recommend to anyone."}, {"userName": "Cryssa", "userReviewDate": "Jan 03, 2011", "userURL": "http://www.goodreads.com/user/show/4742741-cryssa", "userReview": "This was the first Kate Morton book I had ever read and I heard rave reviews over the Forgotten Garden. It started off great; I found her prose fresh and her descriptions unique. Kate Morton is clearly a talented author but I think she failed with this book. She could have really benefited from tight editing. I didn't understand her structure in the least. Switching from a first person narrative to a third person narrative, using different view points was distracting. That was the first snag I hit as a reader. If she had made it all third person and still maintained the different view points, I would have been fine with that. I don't think the first person narrative added any additional insights either. That story line seemed like an add-on, almost like the original story was too short or needed some zip. It was the weakest part of the book. At about the 200-250 mark, I too felt like calling it a day. I found the scenes became repititious and I didn't care about any of the characters. Some of the mysteries/secrets that were revealed were a let down (i.e the contents of the lost letter). By the last third of the book, it picked up and I couldn't put it down. If she had sliced out whole chunks in the middle and ensured that she showed a scene once and well, the book would be excellent. I still want to read the Forgotten Garden and the House at Riverton but I don't recommend this one."}, {"userName": "Regan", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/11895508-regan", "userReview": "This was my first read by Kate Morton...and wow...absolutely stunning. I was completely lost in this novel and spent a good solid two days doing nothing but reading. I was constantly guessing at the many secrets and proved pleasantly right sometimes and shocked at others. The mixture of past and present, unfolding of long kept secrets, and deep insights from many points of view made this book perfection to me."}, {"userName": "Britany", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/5550397-britany", "userReview": "Kate Morton is a gifted storyteller. She has a gift for weaving multiple storylines together; add in mystery and some great character arcs and you have the premise for this novel. Edie Burchill stumbles across Milderhurst castle and remembers that she has been there before... The story shifts back to the past and into present day. Edie's mother was evacuated to Milderhurst around WWII and has kept this a secret from her daughter. Milderhurst is the home of world renowned author Raymond Blythe, and his 3 quirky daughters. Twins Percy and Saffy, disciplinarian and nurturer, add in Juniper Blythe, who is eccentric and suffering from her past lover who failed to show up on the night they were announcing their engagement.Even with the numerous storylines all weaving together, the clear mystery keeps the reader wanting more, and easily turning the pages to race to find out what happened..."}, {"userName": "❀Julie", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/7425446-julie", "userReview": "If not for the slow start I would have given this 5 stars."}, {"userName": "Laura", "userReviewDate": "Oct 13, 2010", "userURL": "http://www.goodreads.com/user/show/170420-laura", "userReview": "How can you not love a book that includes the following: \"After all, it's the librarian's sworn purpose to bring books together with their one true reader.\"? While the blurb calls this \"gothic literature\", it's more goth lit lite - the scary isn't there to the degree that I'd expect from that genre. Think more Rebecca than \"Fall of the House of Usher.\" The switching between 1941 and 1992 helps, I think, keep the tone light. Of course there are some Dark Family Secrets that get revealed, and a Literary Mystery gets resolved.Edith's trip to Milderhurt and the Castle is, at first, accidental but it's clearly fate, thanks to her mother's year-ish there during the Blitz. The Sisters Blythe (honestly, the characters are really well named here!) aren't quite as Miss Havisham as they originally are made out to be, but the Castle certainly is trapped in time. That Edith is ultimately able to unravel the past, not to mention bury it (in a manner of speaking) is not what you'd expect from the start because there are all sorts of Portents and Clues that lead the reader to think that Something with Happen to Edith. This isn't quite what my friend Wendy would call a \"comfort read\" because of the gothic overtones, but it's definitely on that continuum (and there is> an Aga!).ARC provided by publisher."}, {"userName": "Andreia Silva", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/5598612-andreia-silva", "userReview": "Estou extasiada!Eu não sei porque a Kate Morton não escreveu mais cedo, ou nem tem muitos livros publicados (tem três) porque a escrita desta senhora é fenomenal. E não é só a escrita, é o enredo, a forma de contar uma história mas nunca contando tudo de uma vez, a capacidade que tem de nos prender até à última página. Tal como no O Segredo da Casa de Riverton, também neste livro temos uma família (curiosamente, também com irmãs) cheia de segredos ocultos, macabros, que perduram no tempo até um dia em que alguém decida desvendá-los. Uma coisa que achei engraçado neste livro é que a verdade mesmo, os factos que aconteceram é-nos contado a nós, leitores, mas à narradora não! Pelo menos da maneira como o livro está organizado, foi o que me pareceu. Nós ficamos a saber, mas a personagem nunca vai ter conhecimento. Não é o máximo? O segredo continua secreto para a história. Uma das melhores escritoras da actualidade!Obrigado à Tink pelo empréstimo. Livro pertencente ao BlogRing My Imaginarium!"}, {"userName": "Melanie", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/3195534-melanie", "userReview": "I am going with 2.5 to 3 stars. That took me a really long time to finish. It took a long time to fully engage me, over the half way point. I didn't mind the story, just too long. A bit chick-lit as well, which is fine. I do hve a couple more books by this author on my shelves so will be reading more at some point. Here's hoping they move a bit faster :))"}, {"userName": "Sandra Bašić", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/32538982-sandra-ba-i", "userReview": "\"Ne mogu zamisliti svršetak dana bez priče kroz koju bih propala na svom putu prema snu.\"Ovaj prekrasan citat je trebao biti zabilježen. Ostalo? Pa, ne baš. Ovo je još jedna knjiga za koju trebam među-ocjenu, realno bi to ovog puta bilo 2.5.Inače jako volim romane koji su \"priče u priči\" - otkrivanje jedne davne prošlosti u sadašnjim trenucima. Međutim, ovi trenuci mene su strašno umorili. Nisam se nikako mogla poistovjetiti s likovima, s tom posesivnom sestrinskom ljubavlju, sebičnošću, strahom od samoće... Sa svakim nastavkom čitanja, imala sam osjećaj da ulazim u ledenu grobnicu iz koje mi ne daju van pa su moje misli stalno bježale. Onda sam (neminovno) počela primjećivati tiskarske pogreške, kojih je nažalost jako puno, tako da neke rečenice jednostavno nemaju smisla ni nakon ponovnog iščitavanja.Nadam se da su ostale autoričine knjige bolje, ali zasad to ne bih provjeravala. Možda jednom, u nekim drugim trenucima."}, {"userName": "Susan Johnson", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/5172713-susan-johnson", "userReview": "This is a lovely story that reads like a lyrical poem. It reminds me so much of \"Rebecca\" by Daphne DuMaurier. The physical reaction that a house like Manderly or a castle like Milderhurst evokes is so similar that the connection is quite apparent. The misunderstanding of people's relationships is apparent and the story drives itself from there. As layer after layer is peeled back, the reader becomes so engrossed until the surprising ending when everything is revealed. A truly wonderous novel that is perfect for a winter read, preferably while it's raining."}], "description": "A long lost letter arrives in the post and Edie Burchill finds herself on a journey to Milderhurst Castle, a great but moldering old house, where the Blythe spinsters live and where her mother was billeted 50 years before as a 13 year old child during WWII. The elder Blythe sisters are twins and have spent most of their lives looking after the third and youngest sister, Juniper, who hasn’t been the same since her fiance jilted her in 1941. Inside the decaying castle, Edie begins to unravel her mother’s past. But there are other secrets hidden in the stones of Milderhurst, and Edie is about to learn more than she expected. The truth of what happened in ‘the distant hours’ of the past has been waiting a long time for someone to find it. Morton once again enthralls readers with an atmospheric story featuring unforgettable characters beset by love and circumstance and haunted by memory, that reminds us of the rich power of storytelling.", "title": "The Distant Hours", "url": "http://www.goodreads.com/book/show/6746018-the-distant-hours", "average": 3.87, "cover": "https://images.gr-assets.com/books/1358273860l/6746018.jpg", "reviews": 6593, "authors": [{"url": "https://www.goodreads.com/author/show/615274.Kate_Morton", "name": "Kate Morton"}], "type": ["Historical", "Fiction", "Mystery", "Historical", "Gothic"], "outlinks": ["http://www.goodreads.com/book/show/6746018-the-distant-hours", "http://www.goodreads.com/book/show/9529165-the-distant-hours", "http://www.goodreads.com/book/show/16102654-las-horas-distantes", "http://www.goodreads.com/book/show/22533503-davni-trenuci", "http://www.goodreads.com/book/show/8573944-the-distant-hours", "http://www.goodreads.com/book/show/9150753-the-distant-hours", "http://www.goodreads.com/book/show/10429790-the-distant-hours", "http://www.goodreads.com/book/show/13477865-as-horas-distantes", "http://www.goodreads.com/book/show/3407877-the-forgotten-garden", "http://www.goodreads.com/book/show/13508607-the-secret-keeper", "http://www.goodreads.com/book/show/1278752.The_House_at_Riverton", "http://www.goodreads.com/book/show/21104828-the-lake-house", "http://www.goodreads.com/book/show/12387953-kate-morton-collection", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}