{"ratings": 203, "userreviews": [{"userName": "Jonathan Janz", "userReviewDate": "Mar 25, 2014", "userURL": "http://www.goodreads.com/user/show/4415785-jonathan-janz", "userReview": "Okay, if you're one of those idiots who thinks a man shouldn't cry, go stand in the highway. No really. I don't want you here. Because this book isn't for you. It's a book for fathers and mothers and daughters and sons and everybody else who has a heart and appreciates a story with a sense of wonder. THE DANDELION'S TALE is heartfelt, poetic, beautifully-drawn, and incredibly poignant. When I finished reading it to my daughter, I had to wipe the tears away. She just wanted to read it again."}, {"userName": "Rochelle Sondae", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/5374589-rochelle-sondae", "userReview": "Dandelion's remind me of my Great Grandmother. She lived in Michigan while I lived in California so I didn't get to see her very often. I'm not sure where I got the idea but I knew that everytime I scattered the dandelion's seed pods that I could make a wish and until July 1993 that wish was alway that the seeds would fly all the way to Michigan so that they could at least visit with my Great Grandma. After July 1993 they would have had to traverse an immeasurable distance so I stopped wishng that particular wish. The Dandelion in this tale is the one that wishes to be remembered and Sparrow makes that happen through listening to her story, writing it out, and finally telling it to Dandelion's \"grown up\" seed pods. A gentle story about how life does indeed go on after death.I forgot to mention that I read it to a 5 year old boy today and it was the one he liked best of the three that we read. A few months back I read him The Day Tiger Rose Said Goodbye and he was rather disturbed by it. Maybe because he has a cat so it was a little to close to home? We read a wide variety of books every week and he's a rather good listener at least when it comes to books."}, {"userName": "Lynne", "userReviewDate": "May 07, 2014", "userURL": "http://www.goodreads.com/user/show/1324789-lynne", "userReview": "This is one of those lovely, lovely children's books that will find a special place in the heart of many adults. A lone dandelion wants its story to be known before it disappears. With the help of a passing bird, that story goes on. I almost didn't pick this one up at first since there was a large stack of new picture books. If Gelene hadn't put it on my chair, I would have missed this one. That would have been a loss."}, {"userName": "Shiloah", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/973558-shiloah", "userReview": "Bittersweet story."}, {"userName": "Jocelin", "userReviewDate": "Apr 08, 2014", "userURL": "http://www.goodreads.com/user/show/2427708-jocelin", "userReview": "This is one of my favorite children's book that I have read so far this year. The story of a sparrow that meets a dandelion that only has lost almost all of her seeds and is worried that no one will remember that she ever existed. The sparrow begins to write her story in the dirt so when people pass by they can read the story of the dandelion. Then a terrible storm comes during the night and the sparrow wants to check on the dandelion but, hard blowing winds prevent that from happening. In the morning the worst has happened and the sparrow feels like he has failed. After a few days the sparrow notices new bursts of yellow in the field. The dandelion's progeny continues to flourish in field and so continues the circle of life.I thought this was a beautifully written story about reaching out to others, providing comfort, and remembering them when they are gone. I like the fact that the author used the dandelion as a protagonist in the story. The dandelion is one of the most reviled weeds and they cause constant headaches to homeowners every year. This author has soften my resolve against the weed, it made me think this weed has a great story to tell. Highly recommend this book."}, {"userName": "Caryn Caldwell", "userReviewDate": "Jul 03, 2014", "userURL": "http://www.goodreads.com/user/show/125257-caryn-caldwell", "userReview": "The old dandelion knows that once all of its seeds have blown away, it will wither and die and no one will care. A sympathetic sparrow offers to transcribe the dandelion's story in the mud so all may read and remember. But when a heavy storm not only removes the last seeds -- thus killing the dandelion -- but also washes away the story, Sparrow must find a new way to help Dandelion be remembered after death.As the synopsis shows, The Dandelion's Tale is not a light read. It is both uplifting and melancholy at the same time, and it deals with some pretty big issues, such as the fleetingness of life and being remembered after death. For those struggling with such issues -- perhaps those who have recently lost a grandparent or who are questioning the meaning of life -- this might be a good discussion opener, especially when read with an adult. Those looking for a sweet story about a bird and a flower, however, will likely find themselves surprised."}, {"userName": "Renee ", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/6120471-renee", "userReview": "I thought this was a tender and beautiful picture book exploring the natural cycle of life through a special friendship between a sparrow and a lone dandelion. The illustrations are very sweet, and the story is very poignant without being overwhelming for a young child. Great introduction to death and to discussions around the life cycle of plants. Very well done!"}, {"userName": "Abbey Jenkins", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/70822425-abbey-jenkins", "userReview": "The Dandelion's Tale is a wonderful book about a dandelion that is scared to lose all of his pods. A sparrow comes to a tree near the dandelion. Then Sparrow heard some crying and he looked down and saw the dandelion crying. Sparrow came down and was trying to figure out why Dandelion was crying. Dandelion was sad because he was going to lose all of his pods. So to cheer Dandelion up, Sparrow decided that to make sure Dandelion was remembered he would write Dandelion's story down in dirt. So Sparrow went home for the day, but there was a great storm in the area. Sparrow immediately thought of Dandelion. He tried to fly back to him, but the storm was too strong. To find out if Dandelion survived the storm, read this book! I really enjoyed this book because of the great story. The colors are so inviting to children. I think this would be a great for any students. It would be a great read aloud for a flowers unit."}, {"userName": "Madison Ramsey", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/71305618-madison-ramsey", "userReview": "This story is about a bird, Sparrow, who befriends a dandelion with only ten seedpods left. He helps the flower to write her story in order to be remembered. Unfortunately, the flower is wiped out along with her story by a raging storm. Sparrow keeps the flower's memory alive by telling ten new dandelions of the one who came before them. This story is great to introduce a very difficult topic. The idea of death is hard for children to grasp, but this book gently introduces it without being morbid or sad."}, {"userName": "Shelli", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/864675-shelli", "userReview": "A touching story of remembering those who have come before us that shouldn’t be forgotten. Sparrow befriends a dandelion who is clearly on her last pod… well last 10 pods. She is saddened to think that her time on earth will be all for not, so Sparrow listens to her stories and promises to share them with others. This poignant tale would be a wonderful book to share with young readers and listeners who have lost a loved one, inspiring them to help keep their memory alive."}, {"userName": "Kirsty", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "I spotted this on my library's online catalogue, and thought it looked like rather a good tome to slot between two quite depressing novels. It was sweet enough, but the real triumph is in the illustrations; I found the story rather lacking, I must admit."}, {"userName": "Raven DeLajour", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/2054747-raven-delajour", "userReview": "I tried not to cry but it was a pathetic, futile attempt. A beautiful and poignant children's book."}, {"userName": "Wanda", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/62325455-wanda", "userReview": "Good book for children"}, {"userName": "Lisa", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/10408237-lisa", "userReview": "Sweet story of friendship, life cycle for Science educators, circle of life for K-2."}, {"userName": "Victoria Smith", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/24290232-victoria-smith", "userReview": "What a sweet book this is........"}, {"userName": "Laura", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/6529512-laura", "userReview": "Deeply moving and very beautiful."}, {"userName": "Nicolette", "userReviewDate": "Sep 08, 2016", "userURL": "http://www.goodreads.com/user/show/59444360-nicolette", "userReview": "Book Review # 1The Dandelion’s TaleSummary – One day a sparrow hears the sad call of a dandelion in the meadow. The dandelion tells the sparrow that she is sad because she is no longer as strong and yellow as she used to be; she only has ten frail seed pods left. In an effort to make the dandelion feel better, sparrow offers to write down a few of dandelions favorite memories in dirt. The next day a storm washes away the dandelion and the dandelions story in the dirt. Sparrow is overcome with grief, but a few weeks later he sees 10 new, bright, young yellow dandelions in the meadow. He friends these new 10 dandelions and tells them the tale of his friend that has passed away and her memory lives in generations of dandelions to come. Theme – The major theme of this book is that although you may miss a loved one who passes away, you can cherish and remember him/her by retelling their favorite stories and memories for generations to come. This concept is conveyed as the sparrow shares his favorite memories of the dandelion with the other dandelions. Personal Response – This story reminds me of when my Grandpa passed away. My family and I were very sad, but we found comfort in talking about him and his favorite things. Telling stories and passing those along to future generations cherishes my grandpa and lets him live on forever in our hearts. This is exactly the case of the dandelion and sparrow; the dandelions tale lives on forever in the hearts of the new dandelions and the sparrow. Recommendation – I would highly recommend this book to any child who has recently experienced the loss of a loved one. This book helps children understand that a loved one is never truly gone forever because they live in our hearts forever through story telling. The Dandelion's Tale"}, {"userName": "Megan Nelson", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/51798901-megan-nelson", "userReview": "On a sunny, blue-sky day, a sparrow is flying over a meadow and stops to perch on the branch of a tree, when he hears a dandelion crying. He goes over to the dandelion and asks what's wrong, and she replies that she once was as yellow as the sun, but she has turned white and only has 10 seeds left. The dandelion's one wish is to be remembered, so the sparrow writes her story in the dirt beneath the tree as the dandelion tells him what to write. After the sparrow finishes writing her story in the dirt, he tells her that he'll be back in the morning to read it again, and he flies home. A thunderstorm comes that night, and the next morning, the sparrow finds the dandelion drooped over, and he is very sad. After a little while, the sparrow is flying over the meadow when he sees new dandelions; he goes to talk to them and realizes that there are 10 new dandelions, so dandelion's story has lived on. I really liked this book! The story was very sweet and had a great message! When the sparrow found the 10 new dandelions, my heart melted. The last page of the book said, \"She would always live on in the bright yellow petals of her children, and their children, and so on until the end of time.\" This book could be used in the classroom to talk about friendship; the sparrow and the dandelion became friends because she was alone in the meadow, and then he went on to write her story and tell it to her children. This book would also be a good one to read in the Spring/Summer!"}, {"userName": "Karen", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/20390649-karen", "userReview": "Dandelion laments not being the beautiful yellow flower and now only has 10 seedpods left. Sparrow spots her and stops by to chat. They become friends and Sparrow offers to help Dandelion be remembered. Sparrow writes Dandelions story in the dirt so everyone can read it. But that night, a terrible storm happens. This is definitely a tissue story. Everyone wants to be remembered in some way and what better legacy than a good friend to tell your story to your progeny. The illustrations are soft and muted to fit the tale. The book is geared toward upper elementary and older. I loved this story and would recommend it."}, {"userName": "Samantha", "userReviewDate": "Mar 19, 2014", "userURL": "http://www.goodreads.com/user/show/1380067-samantha", "userReview": "Think Charlotte's Web but substitute a sparrow for a pig and a dandelion for a spider. Sparrow and dandelion become fast friends and Sparrow tries to help Dandelion live on by writing her story in the dirt. When a storm brings an end to Dandelion and her story, Sparrow and the other birds sing the words of her life song. It's not too much later that a pack of dandelions spring up near the spot their mother had been rooted.Too long for a read aloud. Ink, watercolor, colored pencil, crayon, and digital media artwork is reminiscent of the best that spring has to offer. PreK-2."}, {"userName": "Sara Grochowski", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/2530658-sara-grochowski", "userReview": "THE DANDELION'S TALE is a delightful read-aloud about the power of storytelling and friendship. Young readers will meet Dandelion and Sparrow, new friends who work together to fulfill Dandelion's wish of being remembered after she is gone. Bright, colorful illustrations depict the happiness of Dandelion's life and the happy ending reminds readers of all ages that words and storytelling have infinite power."}, {"userName": "Naomi Blackburn", "userReviewDate": "Apr 07, 2014", "userURL": "http://www.goodreads.com/user/show/3849903-naomi-blackburn", "userReview": "Overall, I felt that this was a sweet book. Overall, I felt that the story was a beautiful story. On that note, I felt that it might be a tad difficult for kids in the age range it was written for to get, I could be wrong, but thought it was one of those books that might stimulate discussions between a parent and a child on death/loss and the continuation of life versus a kid picking it up and enjoying it on their own."}, {"userName": "Read  Ribbet", "userReviewDate": "Mar 20, 2014", "userURL": "http://www.goodreads.com/user/show/2259568-read-ribbet", "userReview": "A metaphoric tale of life and death and what we leave behind is told though the eyes of a dandelion who has gone to seed and his bird friend. Dandelion worried that he will not be remembered gets Sparrow to write his story down. Through both Dandelion and the story disappear, Sparrow lives on to tell the story of Dandelion's life. It shows the power of story writing and telling and could help convey that in lessons of urgency for writing."}, {"userName": "Margie", "userReviewDate": "Jul 03, 2014", "userURL": "http://www.goodreads.com/user/show/5281649-margie", "userReview": "As is often the case with children's literature, authors and illustrators make you pause to see life differently. Your perspective shifts as they expand on their distinctive \"what if\". In their first children's book, The Dandelion's Tale (Schwartz & Wade Books, an imprint of Random House Children's Books) author Kevin Sheehan and illustrator Rob Dunlavey have insured I may have to rethink my ongoing battle with these persistent plants. My full review: http://bit.ly/1r9BNGC"}, {"userName": "Kelsey", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/4232859-kelsey", "userReview": "Age: Preschool-KindergartenTough Issue: DeathAs sparrow is flying above the meadows one day, he hears crying below him. Looking down, he sees a puff of white on a stem--a dandelion. Afraid of not being remembered, Dandelion asks Sparrow to write her story. A lovely tale about being remembered and sharing one's memory through words."}, {"userName": "Carol", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/6673838-carol", "userReview": "A sweet story of a bird trying to keep alive the memories of a lone dandelion after its seeds have all blown away. The dandelion had seen a great deal from its lowly bit of earth in the meadow. Despite not being a mobile creature it had lived a life full of happiness and joy. The illustrations are beautiful and enhance the mood as the story progresses."}, {"userName": "Julie", "userReviewDate": "Jun 09, 2014", "userURL": "http://www.goodreads.com/user/show/2079573-julie", "userReview": "What child has not been entranced by the wispy seed puffs on a dandelion? (Please take yourself and your kids outdoors more often if this describes your experience!)My 5 year old son and I thoroughly loved this book. Its illustrations are sweet and clear, and the story of friendship and wanting to leave something behind for others is told clearly and in a kid-friendly way. We loved it!"}, {"userName": "Mary", "userReviewDate": "Apr 01, 2014", "userURL": "http://www.goodreads.com/user/show/23157878-mary", "userReview": "This story is incredibly heartwarming, but definitely not for those with sensitive dispositions. Some children might find the story to be too sad or sentimental for them to enjoy, but it is a beautiful story nonetheless. The illustrations are lovely and the friendship displayed in this book is enviable."}, {"userName": "Melissa", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/32770721-melissa", "userReview": "Loved the illustrations but I thought the book could have been so much better. Instead of the sparrow writing the story, I think it would have been better to have had some young dandelions saying goodbye to the sick one instead of just appearing after it was gone. Also didn't like the thunderstorm, so many kids are scared of them anyway."}, {"userName": "Karen", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/5998408-karen", "userReview": "If I was to purchase this book, it would be placed within our parenting collection. Perhaps some would find this a heartwarming life cycle book. I am somewhat disturbed if this book is purchased and placed within a general picture book collection."}], "description": "In this poignant story about the friendship between a dandelion and a sparrow, young readers are given a reassuring, yet emotionally powerful introduction to the natural cycle of life. One fine summer day, when Sparrow meets a dandelion with only 10 seed pods left, he asks how he can help. Dandelion laments that a short while ago, she was the brightest yellow, but now a strong wind could blow away her remaining pods and no one will remember her. Together, they decide to write Dandelion's story in the dirt, and so Dandelion tells Sparrow all the things she has seen and loved. Later that night, a storm changes everything. . . . But the tale of Dandelion lives on.", "title": "The Dandelion's Tale", "url": "https://www.goodreads.com/book/show/18077826-the-dandelion-s-tale", "average": 3.83, "cover": "https://images.gr-assets.com/books/1372682861l/18077826.jpg", "reviews": 50, "authors": [{"url": "https://www.goodreads.com/author/show/1100681.Kevin_Sheehan", "name": "Kevin Sheehan"}, {"url": "https://www.goodreads.com/author/show/4322873.Rob_Dunlavey", "name": "Rob Dunlavey"}], "type": ["Childrens", "Animals", "Death", "Childrens", "Environment"], "outlinks": ["http://www.goodreads.com/book/show/18077826-the-dandelion-s-tale", "http://www.goodreads.com/book/show/18077829-the-dandelion-s-tale", "http://www.goodreads.com/book/show/4297328-should-old-acquaintance-be-rubbed-out", "http://www.goodreads.com/book/show/35262004-growing-a-growth-mindset", "http://www.goodreads.com/book/show/32960546-growing-a-growth-mindset", "http://www.goodreads.com/book/show/38833233-vivus", "http://www.goodreads.com/book/show/37882429-thermoil"]}