{"ratings": 5384, "userreviews": [{"userName": "Jaidee", "userReviewDate": "Aug 25, 2013", "userURL": "http://www.goodreads.com/user/show/17295672-jaidee", "userReview": "4.5 \"restrained and elegantly cruel\" stars 10th Favorite Read of 2015 \"Bowen is a major writer....She is what happened after Bloomsbury....the link that connects Virginia Woolf with Iris Murdoch and Muriel Spark.\" -Victoria GlendinningPortia is sixteen and orphaned and sent to live with her half-brother and sister-in-law in 1930s London. Portia is extremely sensitive and extremely average. She moves from the bohemian countryside in Switzerland to an extremely elegant, tasteful but cold and aloof home in downtown London.In her brother's home Portia is slowly maligned, mocked and used by her sister-in-law and her young lover. Portia is defenseless, vulnerable and does not know about the cruelties of society and how due to her status can never measure up.As I read this book I had a consistent lump in my throat. So very sad. Sad because Portia due to her gender, socioeconomic limitations and most of all naïve and sweet character would not be able to survive in a world where feminine boredoms and cattishness and male dominance and caddishness would chew her up and spit her out and leave her in a most desperate predicament.This book is psychologically brilliant and written with interpersonal understanding that few writers are able to achieve."}, {"userName": "Violet wells", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/4196681-violet-wells", "userReview": "There was a time in my youth when I fell in love with Elizabeth Bowen. Her gorgeous high baroque prose style ravished me. You know how sometimes a writer announces herself as a soulmate, settles herself thrillingly into your mind and begins to help you see with more clarity an aesthetic of the world you had only previously sensed? Elizabeth Bowen, following Virginia Woolf, did that for me. I felt we were soul mates. And Death of the Heart was my favourite of her novels. Essentially it’s a novel about innocence. But Bowen adds something new to the standard ideas of innocence. For one thing it’s not necessarily a virtue in her eyes. Just the opposite in fact. Bowen sees innocence as a health hazard for civilised society. And, through the 16 year old orphan Portia, she explores the dismantling havoc innocence can wreak on civilisation’s defence structures – here represented by Anna and Thomas, a somewhat decadent married pair whose life is mostly refined ennui and whose home Portia enters. Portia herself was born outside of civilisation’s defensive ramparts – the child of an illicit affair on the part of Thomas’s father and an abiding source of shame to Thomas. So Portia enters the house as an enemy. And Portia, like most solitary outcasts, is a keen observer. She keeps a diary. Death of the Heart is also a novel about secrets and betrayal. Both Anna and Thomas have guilty secrets. Most of all perhaps the sham nature of their marriage. And when Anna deviously reads Portia’s diary it’s as if this sham is suddenly and fatally exposed. Portia too feels betrayed - \"One's sentiments -- call them that -- one's fidelities are so instinctive that one hardly knows they exist: only when they are betrayed or, worse still, when one betrays them does one realize their power.\" Portia’s subsequent attempts to find a new home, both symbolically and literally, first with the rake Eddy and then the equally innocent and homeless Major Brunt wreak further havoc. Bowen’s sense and therefore evocation of place is one of her great strengths as a writer. Few writers can conjure up place with so much haunting pulsing atmosphere – whether it’s the soulless harmonies of Windsor Terrace where Anna and Thomas live, Regent’s Park with its icy lake and, later, blooming roses, the seaside town of Seale or the seedy Bayswater hotel which down at the heel Major Brunt calls his home. Place in her books has agency. In this book place is home - the idea of home as sanctuary being another theme of this novel. \"After inside upheavals, it is important to fix on imperturbable things. Their imperturbableness, their air that nothing has happened renews our guarantee. Pictures would not be hung plumb over the centres of fireplaces or wallpapers pasted on with such precision that their seams make no break in the pattern if life were really not possible to adjudicate for. These things are what we mean when we speak of civilization: they remind us how exceedingly seldom the unseemly or unforeseeable rears its head. In this sense, the destruction of buildings and furniture is more palpably dreadful to the spirit than the destruction of human life.\""}, {"userName": "Mariel", "userReviewDate": "Mar 23, 2011", "userURL": "http://www.goodreads.com/user/show/647547-mariel", "userReview": "This book is one of the reasons why I believe stories are redeeming. Like food, second chances, bringing back to life a deadened heart.I love this book intensely as if it has some kind of gravitational pull or hold on me that reminds me of it during times of feeling what I cannot put name to. Frame of reference stuff. I found that I love it more as time passes and the life it still lives in my mind takes its place beside some of the most important moments I've had (um or something I've just made into something big by over analysing it to death). The shaping stuff (or just breaking stuff). Some have said it's a \"nothing happens\" book but those would be the people who don't watch everything around them and turn it into big or little stories that turn into altering events when, really, not much had happened as anything but emotional stuff. If having your heart broken is nothing happened, sure, nothing happened.I read years ago (closing in on a decade) a comment on amazon that described this book as the dark flip side of Dodie Smith's I Capture the Castle (that review led me to another favorite. Thank you, brilliant amazon user!). That's an excellent description. The dark side to noticing too much about the every day stuff. Hating being reminded of the trivial, of being forced to examine the increasingly sameness of the meaninglessness of every day. What if looking outward or inward was akin to a shark stopping his swim? (I'm unable to stop my own painful personal inventory taking, unfortunately.) With knowledge comes responsibility, or something. Portia has come to live with her half-brother, Thomas, and his wife, Anna, for a year out of obligation. They don't know what to do with her, and she doesn't know what to do with them other than watch and hope for some cue. They never do the right thing.Portia has been keeping a diary to record her observations of life, with them. (I'm too pleased with myself now. Her diary says \"I'm in London, with them\" and Anna's snooty writer friend St. Quentin says that the comma is style.) (Bring forth the sharks!) Thomas and Anna were quite comfortable with their previous life. Portia is an intruder on that life with her reminder of the affair Thomas's father had, and reading Portia's diary makes Anna unable to forgive or forget those staring eyes that record everything she does, not in judgement, but matter of fact facts. She doesn't like the viewing.Anna's boy toy buddy Eddie doesn't like the fit of playing entertaining monkey (or whatever else they want) for Anna's stylish crowd. He spies Portia standing innocently in the entrance, holding his hat, and that sparks his interest. He likes knowing nothing to pin his fantasy on (a reflection of himself, no doubt). Portia does not want anything from him, yet. Eddie hates and loves himself, and that pulls him apart. Poor Portia. She cannot see the playing part also feeds his ego as well as shames him.They meet Col. Brut in the theatre (one of the things that they can take Portia to do. Teenagers in the early twentieth century did not have a market catered to them like today, this book brings home to me). Another reminder of a past Anna would rather forget. There was a passionate side with a former lover, unlike the expected lines of her marriage to Thomas. (Anna doesn't like to do anything she doesn't do well. It's no wonder that relationship failed.) The passage of Col. Brut long carried memory of his forever ago day, with Anna and her boyfriend, is heartbreaking. He fed off it as a light to warm the rest of his lonely life. Bowen's description of this scene is one of my favorites I've ever read. Col. Brut built them up into something they really weren't, as Portia did with Eddie. He didn't have a lot else to grasp in a world that has passed him completely by. Sometimes what we hold onto to get by is tenuous, at best. While we can have it, it is still worth something, like the price of bread to a starving man. Much of this book makes me pinpoint, \"Ah, so that's how I felt\". I couldn't begin to say how much Bowen's book means to me in that weight. I might inventory, but expressing it as well as Bowen? No way.Another person that Thomas \"inherited\" was his mother's maid, Matchett. I loved Matchett's love of Thomas' hapless father (there was something noble about him, if ultimately spineless). I loved how she did the work for the sake of the work, and not to please anyone. (She says that the best work doesn't come out of those who do it to please you. This is true, and it is still true that employers want that kind anyway.) Her love of Portia is jealous and in secret (it is sad that she doesn't allow herself to have more). Bowen comes off as a snob in some biographries written about her. Some things I read made me sad indeed, but her care of Matchett belies that feeling. Matchett does love the work, and it is not a position to please anybody else. The rest is how we can fuck ourselves up with rules. It's one thing to build up love in your mind to get through, and then what next? Matchett does not have the courage to throw herself out there, as Portia did. One could argue that she knew better, was not innocent enough to do so, but if you don't do it sometime, when? One day you're eaten by a shark. I like to think she does finally allow more with Portia, in the end. It'd be the right thing.Irene, Portia's mother, meant a lot to me as well. The happy life they had in hotels of watching all of the different people, and the lack of hiding that that breeded in Portia. I'd have missed it too. And, I do. It was sad and crazy and I'd love to hide in that fake world of travel more often.Mrs. Quayne tossed her husband out because she liked herself to feel sorry for Irene. Elizabeth Bowen did not shy away from what people like to think about themselves. It's dangerous to think too much about yourself, too.I hate Anna. My ex read this and really hated Eddie, Portia's almost boyfriend. I really hated Anna. Eddie is fucked up on how other's see him and what people want. Hers is the unthinking sharklife that resented Portia's innocent eye turned on her for she didn't want to think of herself in any other way that glib society life terms. This is a person I couldn't have been around. How Portia's eye disturbed her, I'd have been disturbed by the gloomy feeling that life is supposed to be like THAT. I cannot stomach the idea.For a time, Portia is shipped off to the seaside to stay with Anna's former governness, and her children, like slutty Daphne. Thomas and his wife \"flee\" Portia. I hated them for that. I also related to Portia when the daughter Daphne views Portia with scornful disdain because she doesn't smoke and sleep around. I never, ever understood girls who lorded that over a young me as if they were more mature (I had experiences I didn't want. God forbid I was gonna succumb to pressure from pimply boys on top of it!). Bitchiness is not maturity. Give me a break.I wanted very much to leap into the pages and take Portia out to the movies, and walks in the park. She'd have fared better with me by her side. I'd have told her straight out those people were stupid bitches and not to worry about them.Something today made me think back again to The Death of the Heart in my trains of thought. It was something on if innocence is overrated or not, or at least considered too much an important fact. I won't get into an already jumbled review on why I was thinking about that. This book came to mind because of the line about Eddie and Portia's innocence forces combined devastating what it comes into contact with (Bowen's writing is, needless to say, 1000 miles leagues over the sea better than my sentence). Is innocence really that important? It's nothing but a lack of experience or knowledge. Does, for example, not having been in a relationship prepare you, or not, for starting one? Eddie wishes that Portia had been dumped before so she'd know how to behave (the idea that lots of breakups makes someone behave during another one is ludicrous. He wanted cool, society glib Anna). You're yourself, before an experience, and afterward. It's not destructive in of itself to not know what you are doing. Only if you live each and every day exactly as the one before it. I'm more interested in if it is too late. In the point of no return... Redemption. Portia was not a blank canvas, anyway. She just didn't know when to look away to make others comfortable. I still don't know that and no way am I an innocent. I'm starting to think that I don't believe in coming of age stories that don't end in death. Of the heart? It's like Matchett, what she allowed herself to have. And Eddie, too messed up from what he thought others wanted. It doesn't have to be that way. You pick yourself up and move on because we are built of more than that. The ending is open, and I believe that is what happens. No death! No sharks.Portia is thought of as one of those children that stare and see too much that you never knew what happened to them later. I feel like I'm one of those. I've got the staring problem down. I'm not very good at fixing my facial expressions to something less emotional. I guess I would really recommend this book to people who have staring problems. You'd really get Portia. I wouldn't recommend it for someone who doesn't watch people and see stories everywhere. Reading too much into everything is a requirement.I've read most of Bowen's other works, and found something in all of them. The Death of the Heart is the only book this close to my heart, though. Relevance to me personally, this is it, the book. (The Last September was my first, and it is beautiful. I couldn't, however, feel sorry for them losing their way of life.)I'm still waiting for someone to arrive and do the right thing for me..."}, {"userName": "Jenn(ifer)", "userReviewDate": "May 18, 2012", "userURL": "http://www.goodreads.com/user/show/780933-jenn-ifer", "userReview": "The Death of the Heart -- a pretty melodramatic title, don't you think? I mean, I was expecting a torturous, ruinous love affair. Instead I got a sixteen year old whose auntie read her diary. Still, I enjoyed the story a great deal. The recently orphaned Portia goes to live with her half-brother and his disapproving wife. There she meets a cruel character who wins her heart then tosses her out with the rubbish once she has become too needy. It doesn't take much to win her heart, however. Needy girls are ripe for the picking by filthy little scoundrels like Eddie. But in his defense, he did tell her again and again and again that he was no good. She just refused to hear him, even when he showed her the snips and snails and puppy dog tails dirty little social climbers are made of.Poor sweet Portia. I hope she finds her place in the world, but something tells me it will be an uphill battle.***Here are some songs for you, PortiaFoo Fighters - Dear Lover - http://www.youtube.com/watch?v=fKPt3a...The Courteeners - Please Don't - http://www.youtube.com/watch?v=MSdRDG...Arctic Monkeys - Bigger Boys & Stolen Sweethearts - http://www.youtube.com/watch?v=_BATj0...Libertines - Can't Stand Me Now - http://www.youtube.com/watch?v=BEDtVF..."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Death of the Heart, Elizabeth BowenThe Death of the Heart is a 1938 novel by Elizabeth Bowen set in the interwar period. It is about a sixteen-year-old orphan, Portia Quayne, who moves to London to live with her half-brother Thomas and falls in love with Eddie, a friend of her sister-in-law. At the beginning of the novel, Portia moves in with Anna and Thomas Quayne after her mother dies. Portia is Thomas's half sister. Mr. Quayne (Thomas's father) had an extramarital affair with Irene (Portia's mother) while married to Thomas's mother. When Irene became pregnant, and Mrs. Quayne learned of it, she was adamant that he do what was the right thing: so, at his own wife's unyielding insistence, Mr. Quayne divorced Thomas's mother and married Irene. Mr. Quayne, Irene, and Portia then left England and traveled through Europe as exiles from society and from the Quayne family, living in the cheapest of lodgings. Irene and Portia continued to live in this fashion until, when Portia was 16, Irene died. Portia was sent to live with Thomas and Anna after Irene's death. The plan is that she is to stay with them for one year at which time Portia will leave and move in with Irene's sister (Portia's aunt). ...تاریخ نخستین خوانش: بیست و چهارم ماه اکتبر سال 2016 میلادیعنوان: مرگ قلب؛ نویسنده: الیزابت بوئن؛ برگردان: سما قرایی؛ تهران، نشر شور، 1391؛ در 320 ص؛ شابک: 9786009067466؛ موضوع: داستانهای نویسندگان انگلیسی - قرن 20 متلخی برباد رفتن دوران نوجوانی؛ هوس، سوءِ ­تفاهم، ضعف عاطفی دوران بلوغ و تلخی معصومانه مورد خیانت واقع شدن با طنز و طعنه. ا. شربیانی"}, {"userName": "Sarah", "userReviewDate": "Jun 26, 2011", "userURL": "http://www.goodreads.com/user/show/1309716-sarah", "userReview": "Portia observes with a young girl's receptiveness. Elizabeth Bowen observes Portia with a woman's cool, discerning eye.This book demonstrates how a predatory man will tell you, and tell you, and tell you that he's predatory...and how a lonely, young girl will refuse to see it. It demonstrates how a jaded, older woman can resent a young girl's innocence with inexplicable venom. Bowen shows all this and more with beauty, wit, and grace. Her book is about innocence, corrupted. But Bowen, herself, is a great defender of innocence. Armed only with turn of phrase, she gives all concerned their due comeuppance.Though it was written (and set) in the 1930's, the book has a very Victorian, hearthside feel. It's a warm, dry, quotable novel. You listen quietly, or laugh low, as shadows play on the drawing room walls…\"This dread had haunted her tardy sleep, and sucked at her when she woke like the waves sucking the shingle of the terribly quiet morning air.\"\"She enjoyed being in the streets--unguarded smiles from strangers, the permitted frown of someone walking alone, lovers' looks, as though they had solved something, and the unsolitary air with which the old or the wretched seemed to carry sorrow made her feel people that at least knew each other, if they did not yet know her, if she did not yet know them. The closeness she felt to Eddie, since this morning (that closeness one most often feels in a dream) was a closeness to life she had only felt, so far, when she got a smile from a stranger across a bus. It seemed to her that while people were very happy, individual persons were surely damned. So, she shrank from that specious mystery the individual throws about himself, from Anna's smiles, from Lilian's tomorrows, from the shut-in room, the turned in heart.\""}, {"userName": "Mark", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/2569035-mark", "userReview": "Happy that few of us are aware of the world until we are already in league with itThe story covers a period of some six months in which a newly orphaned 16 year old comes to live with her half brother and his wife. There she keeps a diary, becomes infatuated with another slightly older but still youngish lad, finds he is not quite the boy she had hoped or imagined and gets a bit upset.Not much more happens then this really and yet i find myself giving it four stars, encouraging you to read it and then standing in the breach against all the rest of my bookclub chums here in Poole and say that i loved it in the face of their, almost universal dislike of it or at least severe boredom. It is because Elizabeth Bowen has constructed a novel of quite heartbreaking simplicity. Portia, the young girl is innocent and naive and thus, Bowen would have us see, supremely dangerous. She has none of the protective apathy of Anna, her horribly selfish sister-in-law, none of the vicious disregard of some of the more worldly wise young people, none of the self-absorption and miraculously preserved lack of self-knowledge of her 'admired', none of the hard cynicism of Anna's writer friend and sadly none of the beaten down acceptance of the perenially ignored Major Brutt.Every character struggles with seeing and being seen. A common refrain is of invisibility but not as a disguise but as a depression; as a point of loss or sadness. People talk on whilst not noticing being not noticed or again but she only looked through him, and Thomas felt the force of not being seenor again whether St Quentin really did not see her, or did see her and wished to show that he did not and again He could look right through her, without a flicker of seeing, without being made shamefully concious of the vacuum there must be in his eyesThroughout the book Bowen elaborates on this sense of the ethereal nature of any individual. Of their disingenuous facing of the society in which they exist. Each has a false view of his/her position in society or of the way they are pictured by others or they have a faulty view of others with whom they interact. Sometimes the ignorance is a blameless naivety but more often it is a carefully contrived and shamefully maintained \"re-ignorance\" as if they have worked at hiding the truth from themselves, a truth they once knew but have submerged in artifice.This cascade of incomplete or damaged images swirl around the innocent and seemingly inconsequential outlook of Portia. It is as if her standing in the story reveals the brutality and skewed nature of those around her. She trusts and invests too much in these worthless natures and when they are shown to be worthless they react not by recognizing their frailty and fault but by assuming she is at fault, she is in error, she is to blame. Bowen paints people of vivid horror, all the more horrendous because they float and waft along so elegantly, so socially acceptable. On four separate occasions four people who have behaved badly towards Portia succeed in making her feel she is in the wrong. the manipulation involved is frustrating for the reader because we sit and watch it happening and are powerless to cry out as we would like, powerless to set her free from the endless sadness.Towards the end of the novel, when hopes might have begun to appear the two people who might offer her help and a clearer path through the undergrowth and out into some sort of freedom, the only two characters who are sympathetic, are shown to be caught up with their own misery or at least recognition of their own inadequacies. It is a soberingly sad ending, left unresolved, left grey and forlorn. Not a charnel house of death or torture but instead a well bred cul de sac whose gated entrance you feel is gradually closing in. Bowen has a brilliant turn of phrase and is one of those writers who can, with a sentence, paint a clear visionDaphne never simply touched objects, she slapped down her hand on them; she made up her mouth with the gesture of someone cutting their throat or again For Portia, Daphne and Dickie seemed a crisis that surely must be unique: she could not believe that they happened every dayIn pauses that could but occur in the talk, Portia could almost hear Mrs Heccomb's ideas, like chairs before a party, being rolled about and rapidly rearrangedor the future sadness prefaced inrelentlessly, the too great day was poured out, on the sea, on her window sill.Even the fire only grinned, like the fire in an advertismentThis last sentence captures the vacuity, the horrible falseness of so much of the interaction which sadly Portia comes to realize and it is deeply sad.Caveats to my praise are few but present. Bowen has her characters thinking and reflecting and whereas some of these 'streams of consciousness' type excerpts work well, Matchett's extended soliliquy in the taxi towards the end of the novel being a good example, I sometimes struggled to work out whether it was Portia or Elzabeth Bowen I was listening too. Allowing for poetic licence I still found the inner trawlings of the 16 year old's mind rather high flown sometimes. Were we hearing her struggles and conclusions or were we being treated to extended patches of the author's purple prose? This tendency to 'over-word' passages was a tendency from which Ms Bowen did not often avert her quill. She is a beautiful writer but sometimes less could have been more.If you have never read this and might like a Woolf-cum-Brookner-cum-Ishiguro mash-up then I would recommend this most highly. You will not like many of the characters, it is one of those novels where I long to have the ability to enter into them and give the heroine a good talking to, the anti heroines a good shaking and at least two of the male characters a good pasting but I was genuinely saddened by the painful awakening of one who you see being hurt on the page. A truly goodread."}, {"userName": "Alex", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "[We don't know! It ends with Portia's friend and housekeeper Matchett ringing the doorbell to the attic apartment Portia's taken refuge in, after a stream-of-consciousness bit that's very reminiscent of the end of Ulysses except without the masturbation. Will Portia still be there? Will she have struck out on her own? She probably hasn't committed suicide - there's no instrument handily described. I chose to interpret the ending optimistically; I choose to believe that Portia's gone off to make her way. (hide spoiler)]"}, {"userName": "Cecily", "userReviewDate": "May 30, 2008", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "Portia, 16 year old orphan, moves to stay with her adult half-brother and his wife. She's on the cusp of adulthood, but very naïve. Almost everyone is cold and detached. Mostly written as a novel, but with sections of diary and several letters - a contrast that feels a little odd."}, {"userName": "Miriam", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/237469-miriam", "userReview": "Poor Portia. Poor everyone.In real life I'm rarely this sympathetic to horrible people. Maybe I should be."}, {"userName": "Jill", "userReviewDate": "Oct 23, 2016", "userURL": "http://www.goodreads.com/user/show/3386994-jill", "userReview": "A beautifully written book from another time and place!It was a difficult transition for me from contemporary fiction back to this slower & subtler style where so much is written but very little actually happens. It required me to read a lot between the lines.Portia, a 16 year old orphan, moves to London to live with her half brother and sister-in-law resulting in emotional upheaval (repressed as it may be) for all. I especially enjoyed the relationship between Portia and her sister-in-law Anna which showed Elizabeth Bowen's wicked sense of humor. My favorite line from Anna is \" Well, thank you for listening: you have been an angel. It's fatal\", she concluded, holding her hand out, \"to be such a good friend to a selfish woman like me.\" Exactly."}, {"userName": "nostalgebraist", "userReviewDate": "Mar 31, 2013", "userURL": "http://www.goodreads.com/user/show/8178894-nostalgebraist", "userReview": "This took me forever to finish. When I started reading it, it actually felt like a breath of fresh air -- I had been reading Angela Carter, William Gass, transhumanist SF, all of this mordant and grotesquely unreal stuff, and here was a work of plain old psychological realism, with people doing people stuff and thinking people thoughts and a careful author with a minimal, unflashy persona to relate it all.Yet I slowed down around around p. 200, put the book aside for a long time, and after I picked it up again it took me a number of grueling weeks to force myself through the remaining half. This was for two reasons, which might actually be one single two-faced reason (more on that in a moment). First -- why phrase it delicately? -- this book is really, really boring. I can deal with books that have little or no plot, and indeed there is a plot in The Death of the Heart. It's just that it's doled out in small dollops spread sparingly between gigantic loaves of polite chit-chat.It's possible that this has nothing to do with the book and everything to do with me. You know, I write these reviews on here as though I know what I'm talking about, but really I'm just a provincial sorta guy who reads science fiction and blokey classics like Joyce, and I guess in trying out books like this that are about all the vaguely tense nothing that goes on in fancy English houses, I'm trying to branch out. I try to branch out in a lot of ways -- I'm always curious what I'm missing -- and some experiments fail. Maybe I just demand a sort of action that this book, simply by virtue of its genre, can't provide.But then I'd like to say that I am satisfied with purely psychological action, which is what this book feels like it's selling, and doesn't quite deliver. As I said, I originally categorized the book as \"psychological realism,\" but the further along I got, the less apt that descriptor seemed. Bowen actually doesn't delve directly into her characters' thoughts, at least not in any straightforward way. Instead, much of the book is filled with descriptions of gesture, motion, and countenance, as though thoughts and emotions were mere implications of visible signs and not real entities in their own right. Rather than a growing acquaintance with the characters, I felt a growing unease with them, almost an \"uncanny valley\" feeling, as though they were machines or marionettes. Much of Bowen's description has the oddly physical, almost medical sound of the following passage:When they came to the crossing, Lilian grabbed Portia's bare arm in a gloved hand: through the kid glove a sedative animal feeling went up Portia's elbow and made the joint untense. She pulled back to notice a wedding carpet up the steps of All Souls', Langham Place -- like a girl who has finished the convulsions of drowning she floated, dead, to the sunny surface again. She bobbed in Lilian's wake between the buses with the gaseous lightness of a little corpse.This passage is an ideal transition point to the second of the two flaws I mentioned earlier, because it exhibits that one too. Notice the startling morbidity of the latter two sentences. They cry out -- in an obvious, almost melodramatic fashion -- to be interpreted as an indication of Portia's mental state (we know from context that she's having a bad time). Yet Bowen is actually not usually like this. Most of the time her prose is understated and her plotting minimalist. You read 20 pages of people sitting around making minute social gestures and asking each other whether they might like to go for a walk later on (while sending sedative animal feelings up each others' elbows and making each others' joints untense), and then suddenly one of these really lurid comparisons hits you and you have no idea what to make of it. It's like when some asshole musician starts out a recorded song real quiet to get you to turn the volume up, and then gets ear-shatteringly loud all of a sudden. You could say Bowen's book has a problem with \"dynamic range.\"The book is a tiny story about an angsty teenager getting burned in a bad first relationship, the kind of thing anyone reading the book has likely gone through (and, long ago, recovered from!). It is grandiosely titled \"The Death of the Heart\" and, although it isn't really concerned with sin or theology, it is divided like some Bosch triptych into three sections called \"The World,\" \"The Flesh,\" and \"The Devil.\"See what I mean?I'm left feeling like I didn't really \"get\" this book, but I'm not sure what there was to get. I'm willing to assume that everything that unnerved me about it was a deliberate effect, but if so, why? Maybe it's all a way to try to get the reader into the teenage mindset -- that mindset where your minor personal drama really does seem that thunderingly huge. But if so, I think it can be done, and has been done, much more effectively."}, {"userName": "Bethany", "userReviewDate": "Jun 18, 2011", "userURL": "http://www.goodreads.com/user/show/4314582-bethany", "userReview": "From the back description, I was expecting this to be a major seduction story like, er, well, I can't think of any examples, though they are a dime a dozen. Anyhow, it wasn't; it was about the seduction of the mind: mental, not physical. It was Portia's mind, of course, that was seduced and inevitably, betrayed. (Is that why this is called a psychological novel?)I rather liked Portia. She wasn't obnoxiously pathetic as I thought she would be. She wasn't when she was away from Eddie, that is. Parts without him she was a dreamy loner type which I identify with since I am one. But she was extremely guileless, captivated by Eddie whose faults and inconsistencies she was blind to. I don't suppose I can cast the first stone, though; the attractions of girls are mysterious things and there is little I wouldn't do for someone who shows me kindness at a time when I'm feeling sadly at loose ends.Eddie was indeed a Cad (with a capital 'C', yes.) who was in love with the sound of the words coming out of his mouth. Actually, he was not present in the flesh as often as I assumed he would be. Anna was the antagonist more than anyone.Elizabeth Bowen told the story somewhat indifferently, I thought. Just in the sense she never tried to make you love (or hate, even) any of her characters. She just told it like it was, so to speak. Though she mostly portrayed her character's pettiness and absurdities, she also showed them during moments of worry, vulnerability, and insecurity. Those moments really resounded with me. And her prose! She wrote little masterpieces of sentences and paragraphs full of brilliant imagery which made my little writer's heart pitter-pat with admiration and, of course, envy. Though some of her thoughts were dense and required more concentration on my part to grasp their meaning.I suppose there were greater nuances and themes to this novel that I missed, as I am far from being the most discerning reader, but still I enjoyed this book and that is what matters most, in my opinion. Perhaps I shall read this 30 years from now and see what I get out of it. (Sometimes youth feels like a ball and chain.)Incidentally, I enjoyed this a lot more than I thought I was going to and I cannot think, or express at least, what it was that I liked. I know I really enjoyed Elizabeth Bowen's writing. She deserves all the praise she gets in that respect.Sorry Sarah, this isn't much of a coherent or compelling review - The Death of the Heart may be doomed to languish on your bedside table a bit longer. ;)"}, {"userName": "Sara", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "This was a sadly cynical and very aptly named novel. Portia, a sixteen year old orphan who is just beginning to search for understanding of what love means, finds herself living with her half-brother, Thomas, and his wife, Anna. While Portia studies Anna to see what being a woman should be, Anna dislikes Portia, primarily because Portia is too honest an observer. All the adults in this book live in a kind of masquerade of life, with a cloud of dishonesty hovering over them constantly, while Portia is unschooled in deception and fails to understand that almost no one can be taken at face value.Along the way, Portia opens her heart to a young man who has been present because of his attempts to woo Anna. This is English society at its worst, a world of sexual innuendo and flirtatious games in which everyone is hurt. Poor Portia is like a lamb at slaughter, and everyone seems to feel free to play with her feelings and sensibilities. There is the added sorrow of knowing this girl has just lost her mother and is in a strange place that makes some of their actions seem excessively cruel and unfeeling.Portia’s encounters with life living in hotels with her mother, Irene; living in London with Thomas and Anna, and living for the spring at the beach in Searle with Anna’s former governess, give her an overview of different classes and strata and seem to indicate to the reader that love is fairly non-existent. You trust others at your own peril. This book had moments in which I was sure it would be a 5-star read for me. But, in the end, the ending was somehow unsatisfactory. I understood the point being made, and perhaps it could not have ended differently, but it felt somewhat abrupt and incomplete. I have been mulling it overnight and this morning, and I think we are meant to feel the bleakness of Portia’s position and perhaps that this is life and more story would yield no different outcome. I have perhaps said too much in this review. I never like to give away too much. But, I am sincerely wishing I had read this with at least one other person because there is so much here to grapple with and I’m unsure that I have skimmed the surface, let alone plumbed the depths. If you like a book that makes you puzzle over life, this one will."}, {"userName": "Colleen", "userReviewDate": "Jun 05, 2009", "userURL": "http://www.goodreads.com/user/show/185680-colleen", "userReview": "I had a difficult time getting started with this downer of a book because Bowen's writing style is dense and, at times, confusing. From time to time she would lapse into sermons or analysis and my eyes would glaze over and I'd lose my focus. But eventually I got into the story and decided it was OK. There's not much of a plot and there's certainly little action or excitement. It's mainly a psychological story. There are lots of characters playing head games with each other. They're primarily wealthy, lacking a moral compass and worthwhile activities to spend their time on. And then there's Portia...poor Portia... so innocent, so naive, and so trusting. And, God help her, she's inadvertently gotten on the wrong side of her guardian, Anna. Anna is the most self-centered and manipulative woman. She thinks Portia is \"on to her\" so she's going to underhandedly make her suffer. Actually, I don't think Portia is \"on to her\" at all; I think she's too naive. But Anna doesn't like herself and she sees in Portia all that she could have been. She's in a loveless marriage, she's materialistic, she sleeps around, and she's nice to people to their faces, then bashes them when they aren't around. Poor Portia is just trying to figure out her place in the world and Anna makes her her target. And she's certainly jealous of Portia's relationship with her \"boy toy,\" Eddie. She makes them both pay. You would hope that an evil woman like Anna would get comeuppance in the end but it's unclear to me what happens. Instead Portia pays with heartbreak and uncertainty about her future. Not a very satisfying ending."}, {"userName": "Teresa Proença", "userReviewDate": "Feb 23, 2012", "userURL": "http://www.goodreads.com/user/show/6923777-teresa-proen-a", "userReview": "De vez em quando, vou às \"catacumbas\" procurar livros que há anos esperam para serem lidos. Por vezes encontro alguns tesouros e zango-me comigo por os ter esquecido; mas não foi o caso de A Morte no Coração, que começou por ser uma leitura agradável mas, pelo tema ou pelo desenvolvimento, acabou por se tornar monótona.É um romance da época em que as mulheres, de uma certa camada social, viviam para procriar, apajear o marido, orientar a criadagem e organizar festas. Quando ficavam órfãs antes de casarem - porque uma menina de família não podia viver sozinha - tinham de ir viver com outros familiares, que nem sempre as aceitavam bem. Esta é a história de Portia que, com a morte dos pais, é \"deixada em testamento\" ao irmão e à cunhada. A vida na alta-roda e as pessoas que conhece, desencantam-na e desiludem-na, tornando-se uma jovem triste e solitária. \"Nós somos mesquinhos em tudo menos nas nossas paixões.\""}, {"userName": "knig", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/6163905-knig", "userReview": "I need to solve a mystery: all conspiracy theories welcome. Where exactly is the Kentish seaside town of Seale-on-Sea? It features in three of Bowen’s novels, prominently in ‘The Death of the Heart’ and not at all on Google maps. The only Seal in Kent has these are its coordinates:http://maps.google.co.uk/maps?hl=en&a...;With the best will in the world, there is NO way Mrs Heccomb and Portia leave Waikiki House on the shore and trundle onto THIS Seal High Street for Bisureated Magnesia Tablets and a bottle of gravy browning at ten, have a spot of tea, and make it back to the ranch for twelve noon. 60 odd miles and all that, brisk walkers though they are.And so what of it? Is Seal/Seale/Seale-on-Sea all that important in the scope of things? (the death of hearts and all ‘a that’). Well, why not? Ultimately, in a novel about nothing at all, why should I not bother with the pastiche of Seal, where much ado about said nothing transpires.This is not meant as a criticism. In fact, there is nothing more blissfully sublime than flipping pages in a salty trance where nothing happens on a soggy Sunday when nothing happens , the silence interrupted mellifluously only by the effervescent fizz dissipating the head of a spritzer. (my type of snap crackle and pop). Of course that type of thing requires panache: and Bowen has spades of it. Here is what she does:She sketches out a blank doodle of a 16 year old orphan girl Portia: doodle, I say, because Portia is such a blank canvass, so devoid of any materiality, backbone, sentiment and character in general that it made me squirm in my fauteuil (and to think before this book, I never even thought I owned one!) and shake some spine into her (although a few sips of the fizz mellowed me out substantially). There is a very good reason for this doodle diddling though. So, Portia is set as a work in progress in amidst. Well. Here, in a superb, sublime novel of manners etiquette, Bowen takes out her artistic chisel and plies it ruthlessly into what is easily the most breathtaking vivisection of Great Britannia I have come across. Finding purchase in the rich texture of stratiated social layers, she pares back and unwinds the mass of committing entanglements which define British social conventions and exposes the underbelly of the class system. Each layer: underclass, servant class, provincial bourgiousie, upper crust, unfurls in duress and emaculated, surrenders its pungent tempest into a cotillion of moral and social husks: debris of a failed pursuit. It now becomes apparent why Portia must be so utterly senseless: she is a void canvass in order to enable and channel the unfolding of social layers. Where she steps, worlds collide: she is the faultline where social classes meet and greet: and in this meshing, a constellation of supernovas explode. Portia is the catalyst for the storm of unabatement when a crossover crystallises between the British caste system, testing the grounds of moral, social, economic and cultural franchises in a collision course for advent in the twentieth century.And ultimately this is the raisonn d’etre of the novel: a cacophony of class voice seeking recontextualizing. In amongst the heady spirals of hedonism I was also arrested by an antiquated yet mesmerising use of language, which made me rearrange: not so much the world at large, but my mind, in order to perceive the world at large. More as a note to self than anything else, here are the gems which made me pause, breathless:Is it possible to envy MYSELF?‘There are moments when it becomes frightening to realise you are not, in fact, alone in the world’. For so many reasons, this quote goes against the norm today, doesn’t it? Page 157 for the intrigued. I do so like seeing the flip side of the coin.‘Life mitigates against the seclusion we seek’: again, against the grain.‘Propriety is no serious check to nature-in fact, nature banks itself up behind it’ (phew. Salvation. I was never very proper to begin with). Of course, page 158 will remind me of the true meaning here one day.My favourite exchange in the book:‘Why did you hold Daphne’s hand?’‘When do you mean?’‘At the cinema’‘Oh that. Because you see, I have to get off with people’.‘Why?’‘Because I cannot get on with them.’Amen."}, {"userName": "Tony", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "THE DEATH OF THE HEART. (1938), Elizabeth Bowen. ****1/2.This is a beautifully written book about the coming of age of a young girl, Portia. Portia, sixteen-years old when we meet her, is planning to spend a year with her step-brother and his wife in England. She has recently lost her mother and father to illness, and one of the provisions of the will was that she spend time with Thomas Quayne and his wife Anna. Thomas and Portia share the same father, but Portia’s mother was one of her father’s flings. The fling caused him to lose his wife, who threw him out of the house, and his residence in England. After the divorce, her father and mother set up housekeeping in France and had no further relations with his previous family. Portia’s set of parents represented a totally different set of influences on her than that she would have had by the first marriage. She was brought up to think things out and to seek the truth in all matters. Unfortunately, she was rather secluded, and was not wise in the ways of the world. She was extremely accommodating to everyone, and worked hard to get along with all. When she spends her year with Thomas and Anna, she is exposed to a whole new set of people; ones who didn’t always mean what they said. She has to learn to differentiate between what people say and what they really mean. It’s a difficult task for Portia to understand members of her new step-family and their friends. She wears her heart on her sleeve, and suffers because of it. Ms. Bowen had the ability to utilize the absolutely correct word or phrase when describing Portia’s adventures. Although I found this novel to be slow reading, I found that I was immediately drawn into Portia’s life and new relationships. I quickly grew attached to her and kept wishing that she made the right decisions. Highly recommended."}, {"userName": "Seth", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/4351439-seth", "userReview": "For a review of Elizabeth Bowen’s Death of the Heart, you can’t do much better than Jonathan Yardley’s review published in the Washington Post in 2005: http://www.washingtonpost.com/wp-dyn/...The themes of this novel are betrayal and innocence. As Yardley points out, the author believed that innocence must “be vanquished by experience.”I would just add an observation about the communication styles displayed in this coming-of-age novel set in British upper and middle-class society prior to World War II. The adults, in particular, fail to communicate directly and honestly until a crisis develops at the very end. One cannot fault them for their level of erudition or impressive command of English and French, but their discussions at tea are desultory, opaque, and even worse, duplicitous. What we witness until the end is an elaborate charade.The only characters who speak their mind are two young people: Daphne, who is loud and outspoken to the point of rudeness, and the sensitive sixteen-year-old protagonist Portia, who gradually learns to speak up. Although depicted unsympathetically, Daphne at least has the decency to give Portia some blunt, but good advice. That Portia fails to heed the advice reflects her inexperience. My favorite line is when a shy young man named Cecil, who is quite fond of Portia, explains why he would rather talk with her than try to get Daphne’s attention at a party: “To tell you the truth, I am not doing so badly where I am.”"}, {"userName": "Roger Brunyate", "userReviewDate": "Apr 30, 2016", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "The Unkindness of CivilityFirst off, let me say that the Anchor paperback edition is a pleasure to read, as are all the Bowen novels in this series. It has clean generous type, a binding that stays open, a cover that feels good in the hand, an attractive and totally relevant illustration, typography that captures both Bowen's elegance and her modernity, and—wonder of wonders—a back-cover blurb that brilliantly encapsulates the essence of this elusive novel. For example: \"As she deftly and delicately exposes the cruelty that lurks behind the polished surfaces of conventional society, Bowen reveals herself as a masterful novelist who combines a sharp sense of humor with a devastating gift for divining human motivations.\" Not for nothing does the book-jacket writer compare Elizabeth Bowen to Henry James. For this is a very Jamesian subject. The recently-orphaned 16-year-old Portia, Bowen's heroine, is significantly older than James' Maisie (\nWhat Maisie Knew\n) and younger than his Isabel Archer (\nThe Portrait of a Lady\n), but like them she is thrust into sophisticated society as a naive observer, and the book is mainly taken up by the author's razor-sharp dissection of that society and sensitive exploration of the heroine's feelings. What is surprising here, even in comparison to Henry James or to the other Elizabeth Bowen novels that I have read (\nThe Last September\n and \nThe House in Paris\n), is that so little actually happens. Everything seems to point to a premature sexual affair which will proves disastrous for Portia, especially once she falls for the charms of the caddish Eddie, whose previous dalliances we have already seen described. Portia herself is the offspring of her father's late-life affair, which has forced him to leave his life of English respectability and to live abroad; there is a sense of unreliability in the bloodline. Even the title of the book, The Death of the Heart, and the subtitles of its three major parts—\"The World,\" \"The Flesh,\" and \"The Devil\"—all seem to be leading in this direction. And yet, while sexuality is always present in the subtext (another Jamesian quality), it never tips over into action. This is a book in which so simple an event as a boy's holding the wrong girl's hand at a movie can have traumatic significance; there is no need to go farther. I can only think that Bowen's misdirection is deliberate. In the course of waiting for something to happen, the reader finds that he has absorbed countless details and impressions of everyday life that, taken cumulatively, have an even more devastating effect. This book is like a timed-release drug capsule; you may feel comparatively little after you have finished reading it, but it continues to work in the mind long after you have put it down. In her three-part structure, Bowen contrasts two different strata of English society. The outer sections are set in the upper-class world of Portia's half-brother Thomas and his wife Anna, who live in an expensive house in one of the Nash Terraces fronting Regent's Park. Thomas is withdrawn and remote; Anna leads a busy social life with many male friends; they communicate only superficially with each other and hardly at all with Portia, who is forced to turn to the housekeeper, Matchett, as the nearest thing to a confidante. It is no wonder that she falls for Eddie, whom she sees as an outsider just like her. Meeting him at first assuages her loneliness, but his eventual small betrayals only serve to heighten it. Contrasting with London society is a month that Portia spends with Anna's former governess Mrs. Heccomb, in an off-season seaside resort. Having been brought up in a similar resort town myself, I found Bowen's description of the wind-battered setting and the cheerfully rowdy life of the young people whom Portia meets there one of the most vivid sections of this excellently-observed book. While the apparently free-and-easy quality of this middle-class setting can be seen to have its own limitations and proprieties, it sends Portia back to town with an unbearable sense of the shallow frigidity of her life with Thomas and Anna. And the events of the weekend when Eddie comes down to join her, although slow to make their full effect, eventually alter their relationship (and Portia's view of herself) irretrievably. One of the most poignant aspects of the book is its awareness of transience. Thomas and Anna are eminently settled in their house, their work, their society; even the constant motion of the Heccomb young people and their set is based on an underlying stability. But Portia's life has always been rootless, moving from one European hotel to another, staying out of season and in the cheapest rooms—rootless with one vital exception: the security of her parents' love. Eddie's rootlessness is of a more dangerous variety, coming of having rejected the life of his still-living parents without creating anything significant of his own to replace it, but it takes Portia time to realize the essential difference between them. The theme is further reflected in one minor character who will become important at the end: the sad Major Brutt, who \"had a good war\" but has been rattling around since, growing rubber in Malaya, and now staying in a seedy London hotel waiting for something to turn up; it is a touching portrait, albeit a frightening one. And what will happen to Portia? Will her heart remain dead? Is it indeed her heart that dies? The book ends on a spiritual and psychological crisis, but it offers no resolution. Perhaps it is wishful thinking on my part, but I do not see her life ending in either tragedy or pathos, despite the book's title. Portia's first innocence has been dispelled, certainly, but there is an energy in her, a drive towards the good which I believe will enable her to learn from her experiences and ultimately rise above them. Not the least of the qualities of this admirable edition which I praised at the beginning is the cover painting, which goes far to contractict the implications of the title and declare that this wonderful novel is not, after all, depressing."}, {"userName": "Kusaimamekirai", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/33921897-kusaimamekirai", "userReview": "This is a tricky review simply because I don't think I've ever been so fascinated and drawn into a novel where nothing happens. There are some minor events, diaries read, summers at the sea, starts and ends to relationships, but even in these strands, there's never any one decisive moment of resolution or something that takes your breath away. Rather there is a lot of sameness, a lot of meanness, a LOT of unhappiness. The genius of this novel lies instead I'm the interior worlds of these characters who are all very unique and at the same time (for me) extremely unlikeable. What is someone to do with Portia's guardians, Thomas and Anna? These two are some of the unhappiest people in their marriage and life in general you're likely to come across. Thomas seems almost resigned to the sameness while Anna responds by gossiping, backbiting, and badmouthing pretty much every character in the story. Portia just kind of floats through the story in a kind of innocent haze, refusing to believe that the people who don't hate her, think she's a fool.  Overall this is a novel of bad people doing bad things to each other. Their lives are train wrecks but it's written so perfectly that it's hard to turn away from it"}, {"userName": "Mark", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/3174843-mark", "userReview": "‘Anna and I live the only way we can, and it quite likely may not stand up to examination.’Thomas and Anna Quayne are both vacuous individuals, living ineffectual and unexceptional lives, surrounded by an equally docile set of acquaintances, all bound by the strictures and conventions of their class and its narrow horizons. ‘From the outside we may seem worthless,’ Anna suggests, shaken from her torpor, as, finally, a modicum of self knowledge appears to be dawning, and the story reaches its farcical denouement. This biting satire on the effete upper classes, and their lightweight gentility, and sense of entitlement, provides a fitting climax to a tale of ineptitude and loathing, told through inference and implication : Portia hasn’t come home and Machett, the wise Old Housekeeper, is alarmed by the errant teenager’s unexpected absence. She is more concerned than either Portia’s step brother, Thomas, or his wife, Anna, whose passivity, detachment and lack of initiative are comic. The Quaynes have a tough call to make, that is way out of their compass, made doubly difficult as, the news that she isn’t in the house, comes, annoyingly, as they are enjoying pre-prandial drinks before dinner is served :‘Goodness,’ Anna said tartly, ‘it’s not such a crisis yet. It won’t be even nearly a crisis for half an hour. Meanwhile it’s eight, the whole point is are we to have dinner ? I don’t know really, this sort of thing has never happened before…… We either have dinner or call the police.’Portia, the naive, and rudderless, sixteen year old has arrived unannounced at the Kensington lodgings of the unsuspecting and crass Major Brutt, who realises he cannot shut and door and send her packing, and so finds, to his obvious chagrin, that she is now in his room and under his protection, and on his bed under the eiderdown. Such things could only happen to one whose easy-going life style has laid one open to accepting things, unquestioningly, come what may.Major Brutt telephones the Quaynes to seek their assistance, and help resolve this impasse, and they in turn, look at each other, non-plussed, without an ounce of compassion or understanding for poor misguided Portia simply don’t know how to respond.‘You say she’ll come home if we do the right thing..... Do we know what the right thing is?’This is much more than a mere witty comedy of manners. It is a devastating critique of the gentille classes in 1930s London with the ineptness of Thomas and Anna Quayne underlying the whole sorry story. Portia, their ‘ward’ is a lonely innocent, unable to decipher the rules and protocols of a moribund society, and utterly unable to navigate her way as hers has been a childhood notable for its absence of love and neglect."}, {"userName": "drea ", "userReviewDate": "Feb 25, 2012", "userURL": "http://www.goodreads.com/user/show/253027-drea", "userReview": "I should start by saying that I am horrible at writing about books I love, because when I truly love something, I get tongue-tied and bashful and feel like I can only express myself correctly if I am allowed to speak in exclamation points and cartwheels. But even though my heart started up in an illogical panic as soon as I saw the white expanse of the review box, I am trying with this one, gosh darn it, because, oh! It is lovely, and deserves all of the cartwheels. I forget what made me originally pick up a copy of The Death of the Heart. I wish I remembered, because I would like to thank it, along with whatever made the universe align a few weeks ago for this book to stalk me. Because suddenly it was everywhere that I turned. Mentioned in a blurb on Bookslut; lying innocently on a coworker's desk; sitting among a random browsing of the Modern Library's Best 100 Novels. And then I opened up a box of books that had been sitting in the corner for six months, and there it was, right on top of a stack of forty other forgotten books. \"Okay!\" I said. \"I give! But just so you know, I am not reading this dictionary, which I also put in this box for some inexplicable reason.\" And then I read the first 100 pages and was hooked, even though I am going to have a hell of a time explaining why. This is one of those books that has less of a traditional plot, and is more a million wonderful tiny insights that eventually decide to team up at the last moment for a lasting impact. Basically, The New Yorker was not lying when it called it \"pscyhological,\" so if intense character portraits and a relentless mission to figure out what really makes people tick are not your thing, then it's probably going to leave you cold. But if they are, you should just save yourself some trouble and underline the whole dang novel. Portia, sixteen and recently orphaned, has come to live in the town house of her reserved half-brother, Thomas, and his outwardly friendly, but inwardly unfeeling wife, Anna. Portia and Thomas were not close, as Portia's existence was the reason his mother demanded a late-in-life divorce from their father, but Thomas has granted his father's last request and invited Portia to stay the year to see \"how things work out.\" For Portia, this stable existence is a marked difference from the string of coastal European hotels that she used to call home, and she is having trouble adapting, a struggle she chronicles in a diary that is secretly being read by an increasingly resentful Anna without her knowledge. The only people she feels close to are the house's head maid, Matchett, and Anna's young and manipulatively caddish friend Eddie. When Anna and Thomas go abroad, they send Portia to the seaside to stay with Anna's former governess and Eddie follows, leading to a Weekend of Epic Disillusionment (and 400 pages of me going Yaaaaaaay!)As titles go, The Death of the Heart is a little obvious and melodramatic for me, but I will forgive it, because Bowen kills all her hearts so beautifully. Somehow, Anna and Thomas are dead inside and sympathetically human, and I love it. Thomas can't care for his sister, but he can get really annoyed when someone interrupts him from a pleasant Saturday afternoon spent doodling cartoon catson his desk blotter. (YOU HATE THIS TOO, don't lie). Anna should be the most sympathetic to Portia's crush on Eddie, having gone through a similar love affair fifteen or so years earlier, and yet she sees it all and doesn't intervene. Basically, I can't with the parallels. I can't. I want to smoosh their cheeks together, I love them so much. But mostly, there's Portia. Not going to lie, if I were an orphan in 1930s London, pretty sure she would be me. I would be lurking and silently observing and falling in love with funny dramatic cads all over the place, so, naturally, I was Team Portia, which only made her eventual hardening of heart all the more powerful. Ugh, if any character ever deserved a puppy, SHE IS IT. I am only giving this book four stars, because toward the end I was so addicted and desperate to know how Portia would end up that I was like STOP USING WORDS, JUST SHOOT THE STORY INTO MY VEINS, and Bowen insisted on continuing to write forty-paragraph philosophical asides every three pages or so. They were great at the beginning, and this lady knows her way around a philosophical aside,but when we finally got to that downward plot slope, I just wanted the momentum and only the momentum. HOWEVER, I want to re-read this one day, and I'm pretty sure it will go up to a 5 when I am less impatient. But anyway. Here are two reviewers that are smarter about positive reviews than I am. Jonathan Yardley, say hey! Charlotte Freeman, you too!"}, {"userName": "Lobstergirl", "userReviewDate": "Jun 15, 2009", "userURL": "http://www.goodreads.com/user/show/1910836-lobstergirl", "userReview": "A book about a 16 year old girl that should be read by adults. Portia Quayne, newly orphaned and very innocent, goes to live with her stolid half-brother and his effortlessly, subtly malicious wife in 1930s London. She falls in love with a 23 year old; keeps a diary; goes to stay with the wife's former governess and her two grown children at the seaside. The novel plods and meanders along densely until about the last 40 pages when things begin to unravel emotionally for Portia and those around her are forced to confront their own cruelty and fakery. The ending, with its odd and poignant switch in point of view, fascinated me. Bowen's writing is sometimes very opaque, often beautiful. She was close friends with H.G. Wells, Virginia Woolf, and T.S. Eliot, and Time magazine's 1939 review of the book asserted that Bowen had a more promising future than Woolf or Willa Cather."}, {"userName": "Mary", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/11538764-mary", "userReview": "I loved this book, a young girls coming of age.Portia comes to live with her step brother and wife in London.There she meets the cad Eddie, young and naive.She finds out about love and how hearts are broken .The best of hers so far.Beautifully written with an eye for detail of human emotions."}, {"userName": "Dillwynia Peter", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/8394997-dillwynia-peter", "userReview": "With imprints like Virago, Elizabeth Bowen has had a resurgence of popularity with a new audience. This is a wonderful thing because of where Bowen sits within the canon: she is a forgotten voice between the Bloomsbury 20s and 30s and the kitchen sink realism of the 50s; having said that, she is also a writer than is herself and stands alone.Primarily, this is a book about lost innocence and about the pitfalls of 1st late teenage love. I can hear some of you turning your minds off immediately, but this isn’t the sappy stuff dished out as YA literature – this has substance and is treated in an adult perspective. Portia’s (our heroine) trusted sources have gone; her parents are now dead and she has come to live with her half-brother and wife – two people she doesn’t know, and could have some animosity towards, as it was Portia’s mother that generated the split in Thomas’ parents’ marriage. Portia did not lead a conventional life with her mother – she spent most of it moving from one Continental hotel to another – and nor is the marriage of Thomas and Anna. Everything is off kilter from page one.Anna is an interesting character: brittle, glamourous and schizophrenic about Portia. She wants this new person in her life, as a sort of younger “sister” but at the same time resents the intrusion on her social life. Thomas is more the cypher: his feelings are mostly locked in a Yale safe that lies at the bottom of the Marianas Trench. They do surface, but often too late, and too ineffectual. Into this mix comes the friend of Anna and the cad: Eddie. Eddie is deliciously Thirties in his behaviour and personality. His type will bombed away sometime during the Blitz never to return.Eddie is attracted to Portia, as just another notch on his belt, and a way to annoy Anna and is thoroughly dreadful in his manipulations to this schoolgirl. The wicked deed that removes the scales from Portia’s eyes happens while she has been packed off to the seaside to Anna’s former governess which she holidays on the Continent. The turning point is done oh! so well, and I loved Bowen’s clever telling: so stark in some ways, and so bland. The effect is almost tragic and I didn’t rule out Portia committing suicide. The ultimate ending is something different altogether, but in keeping with the behaviour of the guardians.The characters are what drives this novel. Even the minor ones are rounded, and although a little stereotypical at times, are the right character type to carry the narrative along. I loved the hateful Anna, the caddish Eddie, the ineffectual Mrs Heccomb, the bored Daphne, and the manipulative St Quentin. The tragi-comic character is the Major. I felt for him – another character that disappeared once India has gained independence – his lacks the tools and skills to help Portia at the end, but his heart & kindness and aching loneliness shine through. In fact, he could have easily have been invented by Anita Brookner.The only thing that doesn’t satisfy is the dialogue. It’s often the one thing I find grates from 30s books. What they say, and how they say it just sounds quite artificial. Maybe that is also something that changed with the Blitz."}, {"userName": "Laura", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "3* The Heat of the Day3* The Last September4* Eva Trout3* The Demon Lover3* The House in ParisTR The Death of the HeartTR To the NorthTR A World of Love"}, {"userName": "Mela", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/41757430-mela", "userReview": "We desert those who desert us; we cannot afford to suffer; we must live how we canThis was one of these books which one can appreciate fully only when one reads the whole book. There are novels which I rate after e.g. one third or a half and this rate is the same to the end. And there are novels (like this) which I rate very high only at the end.For people who live on expectations, to face up to their realisation is something of an ordeal. Expectations are the most perilous form of dream, and when dreams do realise themselves it is in the waking world: the difference is subtly but often painfully feltIt is so, because I had to grasp the whole story. I had to hear all, that characters had to say. It is like eating a delicious cake, the ingredients are tasty too (more or less, although, some of them I couldn't even put in my mouth), but only the cake as the whole is really delicious. Another parallel: Imagine, you watch a few fragments of a movie (randomly). In cases of some movies, you would rate them exactly the same like you would rate the whole movies. But, with some other movies, your rate based on fragments would be unjust, underestimated, because only watching the whole movie you can grasp all.the senses bound our feeling world: there is an abrupt break where their power stopsI think that this story could be also called: \"The death of the human/humanity\". Portia symbolized not only an innocent heart, but also a human who isn't contaminated with hiding feelings, with regret for the world, with rules which an innocent soul doesn't see and understand yet. Watching Portia's life was sometimes like watching a cruel show. I often wanted to turn away my eyes, but part of me knew the story too well to be much surprised. Haven't we all gone through some of a kind of 'the death of our heart' in our youth?Habit is not mere subjugation, it is a tender tie: when one remembers habit it seems to have been happinessThe characters and the story were chosen perfectly. It isn't important who I liked and who I didn't. It is important, that the book looks like a masterpiece. I haven't read any other novel by Elizabeth Bowen, so I can't compare, but I have read that this piece is considered as her the best.\"Sacrificers,” said Matchett, “are not the ones to pity. The ones to pity are those that they sacrifice\"I have a 'but'. I have had some reservations with the language, the style of speaking. Some of the dialogues sounded to me too much unrealistic. I assume, that was the way of speaking in Elizabeth Bowen's time and her social circle. Nonetheless, sometimes I felt like hearing uncomfortable sound (you know, like rubbing with a fork on the plate). This made reading it a little hard to me at times. This is why I was torn how to rate it. Finally, I decided to concentrate on the message and on a psychological and philosophical aspects.Experience isn’t interesting till it begins to repeat itself—in fact, till it does that, it hardly is experienceRead quotes I have put in in my review and you will understand how precious the book is.“But Matchett, she meant to do good.” “No, she meant to do right.\"PS. The cover is simply ideal for this story.And at the end, summarizing (another quote):Contempt for the pack of us, who muddled our own lives, then stopped me from living mine. Boredom, oh such boredom, with a sort of secret society about nothing, keeping on making little signs to each other. Utter lack of desire to know what it was about. Wish that someone outside would blow a whistle and make the whole thing stop. Wish to have my own innings. Contempt for married people, keeping on playing up. Contempt for unmarried people, looking cautious and touchy. Frantic, frantic desire to be handled with feeling, and, at the same time, to be let alone. Wish to be asked how I felt, great wish to be taken for granted—You want more? Read Dillwynia Peter's review."}, {"userName": "Stephanie Sun", "userReviewDate": "Jul 16, 2012", "userURL": "http://www.goodreads.com/user/show/118030-stephanie-sun", "userReview": "What a strange little book! In The Death of the Heart, you'll find characters who swing wildly and often from sharp bourgeois caricatures to sympathetic portraits of people struggling with the collapse of social mores in post-WWI London to sockpuppets mouthing the author's Complex Feelings About Class and Cynicism and Honor and Love.There is really top-notch writing here—the opening image of the swans on the frozen lake is original and fantastic; I loved this passsage about dawn and summer encroaching on a hostel in a rough part of town:\n\"In the Karachi Hotel drawing-room, someone played the piano uncertainly. ...summer, internsifying everything with its heat and glare. In gardens outside London roses would burn on, with all else gone in the dusk. Fatigue but a sort of joy would open in all hearts, for summer is the height and fullness of living. Already the dust smelled strong. In this premature night of clouds the sky was warm, the buildings seemed to expand. The fingers on the piano halted, struck true notes, found their way to a chord.\"\nUnfortunately, the type of book this is changes so totally from one paragraph to the next, and the lack of any overarching aesthetic control undermined my ability to immerse myself in the inconsequential plot and its rather thin stakes (a crush; a diary; the encroaching self-awareness of some decent, perpetually unhappy, not always nice people).I loved the ending: both the final dinner conversation between St. Quentin, Anna, and Thomas and Matchett's taxi ride leave the right amount of stuff unsaid and almost make the book make sense. We get this hilarious monologue from the cat-doodling, Hear No Evil, See No Evil Thomas (he is talking about his teenaged half-sister Portia, whose brief moment of rebellion that evening has sent him and his wife Anna into the dangerous territory of drunken self-examination):\n\"No, the fact is that nobody can afford to have a girl as thorough as that about. I don't say we might not have kept the surface on things longer if we had lived in some place where we could give her a bicycle. But, even so, could she keep on bicycling round for ever? She'd be bound, sooner or later, to notice something was up. Anna and I live the only way we can, and it quite likely may not stand up to examination.\"\nHowever, I was simply too bored through most of this to recommend it very highly.That being said, this book did often stop me in my tracks and make me reflect back on my own life, actions, approaches, and dealings with other people in a critical way. Much like Portia—this book is inconsistent and quite silly, but it will mirror you back to yourself in ways you don't expect."}, {"userName": "Madeline", "userReviewDate": "Sep 17, 2011", "userURL": "http://www.goodreads.com/user/show/617334-madeline", "userReview": "Hmmm, well, I can't deny that Bowen is an exquisite writer. She has a kind of snaky prose style, that starts a sentence one place and ends it somewhere else, but not in a way that baffles the reader, only in a way that turns them pleasantly upside-down. There are some wickedly funny and mean one-shots slid in between incredibly serious sentences, sort of like in The Line of Beauty. Bowen's eye for character is excellent - this is the kind of book where a few people bounce off each other until they get stuck or trapped by their own flaws (it's a bottle episode!) - and almost single-handedly drives the novel forward. But all the same, I have some reservations about this book, and reading it was like chewing gravel.First, the plot is . . . deeply stupid. So, so, stupid. And although Bowen is really good at observing characters, she is not very good at making them interact. I know this sounds unlikely, to say the least, but it's the best way I can think to explain the odd experience of reading this book. It doesn't help, either, that everyone's default setting is \"overreact,\" although this is an early twentieth century British novel, so they overreact in the most understated and poisonous way possible. (I know that you are now thinking it is like Gosford Park or a du Maurier novel or something, but it isn't. How I wish that it were!)Second, the seduction story (it's not a love story - it's not, properly, a seduction story either, but what can you do) is totally uninteresting. There are occasional passages where Bowen seems to be examining bad faith (I think bad faith is a good choice in literature, because it unsettles readers while making them think more about what's going on) but by and large it is deadly dull and it's impossible to see the point. Or, indeed, the justification, since Eddie is so unattractive a character that it is difficult to see what would make him attractive, even to a 16-year-old, who is admittedly going to have impaired judgment. I don't care for Portia, but it's not very difficult to realize that a 16-year-old shouldn't get too invested in the adult friend of her sister-in-law, unless maybe they are all royalty and this is the only way to end a war or something, I don't know. But The Death of the Heart doesn't take place in that kind of heightened reality, it takes place in a true-to-reality reality, and doesn't even suggest something like chemistry as an excuse for its characters. (Anna, at least, has the motivation of power. My empathy lay mostly with Anna. I probably read this book wrong.)Bowen has written a bunch of other books, but this one is supposed to be the best, so I don't know if I'll be reading any others."}], "description": "The Death of the Heart is perhaps Elizabeth Bowen's best-known book. As she deftly and delicately exposes the cruelty that lurks behind the polished surfaces of conventional society, Bowen reveals herself as a masterful novelist who combines a sense of humor with a devastating gift for divining human motivations.In this piercing story of innocence betrayed set in the thirties, the orphaned Portia is stranded in the sophisticated and politely treacherous world of her wealthy half-brother's home in London. There she encounters the attractive, carefree cad Eddie. To him, Portia is at once child and woman, and he fears her gushing love. To her, Eddie is the only reason to be alive. But when Eddie follows Portia to a sea-side resort, the flash of a cigarette lighter in a darkened cinema illuminates a stunning romantic betrayal--and sets in motion one of the most moving and desperate flights of the heart in modern literature.", "title": "The Death of the Heart", "url": "https://www.goodreads.com/book/show/91494.The_Death_of_the_Heart", "average": 3.7, "cover": "https://images.gr-assets.com/books/1497190244l/91494.jpg", "reviews": 382, "authors": [{"url": "https://www.goodreads.com/author/show/52578.Elizabeth_Bowen", "name": "Elizabeth Bowen"}], "type": ["Fiction", "Classics", "Romance", "Novels", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/91494.The_Death_of_the_Heart", "http://www.goodreads.com/book/show/32735292", "http://www.goodreads.com/book/show/91498.The_Death_of_the_Heart", "http://www.goodreads.com/book/show/13497394-a-morte-do-cora-o", "http://www.goodreads.com/book/show/15982783-the-death-of-the-heart", "http://www.goodreads.com/book/show/843212.The_Death_of_the_Heart", "http://www.goodreads.com/book/show/18304881-the-death-of-the-heart", "http://www.goodreads.com/book/show/195990.The_Last_September", "http://www.goodreads.com/book/show/195993.The_House_in_Paris", "http://www.goodreads.com/book/show/195987.The_Heat_of_the_Day", "http://www.goodreads.com/book/show/536510.Eva_Trout", "http://www.goodreads.com/book/show/195988.To_the_North", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}