{"ratings": 4214, "userreviews": [{"userName": "Julie (jjmachshev)", "userReviewDate": "Aug 04, 2008", "userURL": "http://www.goodreads.com/user/show/882708-julie-jjmachshev", "userReview": "Whew! I'm almost at a loss for words. \"The Devil You Know\" is book 2 in Jenna Black's Morgan Kinsley, exorcist, series. Absolutely fabulous! BUT, you can't read book two without reading book 1, \"The Devil Inside\", or you will be way behind the powercurve. Also I should warn you that this book is very dark...I would classify it as Urban fantasy with heavy sexual overtones rather than paranormal romance. Indeed, Dell is marketing this series under Spectra, their Fantasy line. Morgan is back and she doesn't get much a break from the events of the last book before more excrement strikes the windblower! She's trying to get used to hosting Lugh, trying to go cold turkey from her lover Brian, trying to come to grips with her former-host, now catatonic brother Andy, and trying NOT to kill demon host Adam for just being his normal jerkself. As if that's not enough to deal with, now Lugh appears to be trying to seduce her into letting him 'drive' occasionally, Adam and Dominic seem to want to embarass her by playing kissyface all the time, Raphael is back on the scene and may want to repossess Andy, and Brian won't give up on their relationship regardless of the danger to them both. To top off the list: 1-Lugh tells her there's a mysterious 'blank' in her mind that even he can't penetrate, 2-her parents want Brian to let himself be a host again, and 3-apparently there's a sadistic demon serial killer whose been let loose and pointed straight at her. What's a girl to do?COULD NOT PUT THIS DOWN! The suspense and tension are tight from the first page to the last. Morgan is just as snarky as ever, and Adam is still HOT. Now she has Lugh in her dreams almost constantly. When she's seen Adam, Lugh dresses like an S&M god, and when she's seen Brian, he dresses like a California surfer...and Lugh is every woman's dream sex toy...unfortunately, he's also the king demon. All Morgan can say is, \"Why me?\"If you like your fantasies dark with an edge, don't miss this series. Next book is \"The Devil's Due\" coming out in December 2008. It's a must-buy for me."}, {"userName": "chucklesthescot", "userReviewDate": "Apr 20, 2010", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "Morgan is relieved when Andy recovers from his coma and he agrees to move in with her for protection in case Raphael comes back for him. But she has other worries when a demon comes for her to find out where Lugh is, putting everyone she knows in danger, and questions about her own past are going to be relevant to the situation she is facing. Things are getting tougher for Morgan. While she has rediscovered her relationship with her demon free brother, quizzing her parents about her past and the rape of her mother leads to a real estrangement. Who was her real father and was he a demon? What happened to her as a child in that hospital run by the demon fanatics? Lugh seems to think that this is important and as a reader, I want to know as well! The plot is intriguing, exciting and ever changing and you can't wait to see what is going to happen next.The demon hunting them is a pretty scary dude as well, and not knowing which body he is in puts everyone in danger. But really Morgan, your dad punched you and then disappears from your life with your mother, and then suddenly arrives at your door to 'talk' and you haven't considered that he might just be the dreaded demon who is chasing you? Oh come on you stupid muppet! Then she gets mad at Brian for doing what needs to be done and helping Adam kill host and demon? Honey, your dad was dead the moment the demon took him. It had to be done. At least Brian and Adam have the brains and nerve to do what has to be done to keep you alive and you as usual whine like the ungrateful bitch that you are. Very classy. Honestly Morgan is getting worse in her attitude and I'm getting tired of her.Random irritations-we are still getting this stupid sex thing every time she talks to Lugh in her sleep, when they should be working on a plan. Lugh, get a bloody grip and stop leaving it all down to Adam to save the day. This guy is supposed to be a powerful and important demon and instead of trying to solve his problems and take down his enemies, he just wants to get Morgan horny all the time. So the only intelligent person trying to come up with a plan is Adam and everyone hates him for it. There's gratitude for you huh. And Morgan, stop having a go at Adam every ten seconds. Even when he wants a truce, you just have to be a bitch again. You really get on my nerves with this crap! Grow up already!This was another good plot and I was so upset at the end when poor Andy gets taken over by Raphael again. It was pretty gut wrenching and I did not want this to happen. I'd love to know what happens next but sadly, my issues with Morgan and the dream perving crap have totally put me off continuing this series. I just can't bring myself to put up with that for another three books, which is a real pity. Her attitude stinks and it ruins what had been a good urban fantasy series."}, {"userName": "Bunnycore", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/50919516-bunnycore", "userReview": "I feel like I want to re-read this book. I feel like maybe I was having a bad day? anyways, it is on my bookshelf and I told myself to re-read this see if I am right. I almost didn't finish this book, I am giving up honestly. Mogan is not my favorite character, I love Adam, love him. Even tho he is an ass hole he cares, and he loves Dom. Which is just a beautiful thing? Morgan tho she's selfish, very selfish. She treats everyone like crap then cries when no one wants to help her or be around her. Then she questions \"why does everyone hate me and not want to help me?\" Oh, my Gods above duh! Because you treat everyone like crap and you don't care whose feelings you hurt! Lugh is trying to help the humans and all you can do is say how much you hate demons. Sure he's a bit of a letch in your dreams, but seriously! Brian is so undeserving of any treatment you give him, he almost died for you! Adam and Dom are helping, mostly it's for Lugh and they make sure you know that but I'd only help Lugh at this point. You don't want him but at the same time you won't give him to someone who will take care of him saying things like \"this is my burden to bare\" *pfffft* I'm done, really I can't keep going on to see what happens even tho I love these characters with the exception of Morgan."}, {"userName": "Aimee", "userReviewDate": "Oct 12, 2009", "userURL": "http://www.goodreads.com/user/show/2397038-aimee", "userReview": "Wow..I have to say, I really like the direction this series is taking. 4.5 stars. This one was really dark, just like the first. I have a feeling that the next installment in this series will be darker yet. The action just keeps going and the tension just keeps piling up! After reading other reviews of this one I was expecting the \"sexual situations\" in this series to be offensive..which I didn't feel in the least. There really isn't an overwhelming amount. More inuendo than anything. And it's absolutely integral to the story, in my opinion. Morgan is still a little whiney for my taste(losing a half star), but she has grown a little since the last book. Which tells me that the next will show a little more growth. I really could like her...and I'm pretty sure I will throughout the next coupel of books. Ms. Black has written interesting characters. I like most of them and I'm interested in learning much more about them. And am dying to see where she takes them next! I'm definately looking into the next one in this series."}, {"userName": "Mrs. Badass", "userReviewDate": "Jul 27, 2009", "userURL": "http://www.goodreads.com/user/show/2566231-mrs-badass", "userReview": "You know, this series could really be something. The concept is cool. It's just that the writing is mediocre at best. Jenna black is a teller. Not a show-er. In the two books that I have read, there has been no character growth, and the heroine is a nasty bitch. Now, I'm all for bitchiness when it's necessary, but Morgan is over the top, in your face, trying to be so tough by being telling us how bitchy she is, that it makes me bang my head against the wall and want to put the book down and just not pick them up again.The only reason I keep reading is because I am one of those people who if I start a book I am going to finish it, no matter what. It has nothing to do with the characters, whom I have no connection with, or really care if they live or die. I don't think I would really recommend people I know to read this book."}, {"userName": "Kathy Davie", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/4222001-kathy-davie", "userReview": "Second in the Morgan Kingsley urban fantasy series set in an alternate Philadelphia. The StoryMorgan Kingsley is an exorcist, a caster-outer of demons in a family that worships demons…so you can imagine how much fun the Thanksgiving and Christmas holidays are in the Kingsley homestead.Then Morgan finds out the truth about her birth. Worse, Lugh catches her at a weak moment and hypnotises her into remembering what happened at the hospital and she learns the truth about the \"encephalitis\" when she was 13.Then Andy wakes up from his coma (Devil Inside) only to find that Lugh's other brother, Raphael, is a bit too concerned about what Andy might say about demonic possessions, i.e., Andy's ass may be grass. Then Morgan finds out she is a product of rape which makes her almost impervious to demonic possession and Dougal has sicced a hunter demon on Morgan who will stop at nothing to test Morgan.The CharactersMorgan is a selfish, well-intended, hypocritical, chickenshit asshole with an avoidance streak and a mouth that has never encountered a brake. I can't stand her! That said, her life is fascinating and I sure wouldn't mind a Lugh in my life! Woo-hoo! He's a hunky devil.Black has created some amazing characters…yeah, yeah, yeah…even Morgan has…something, oh yeah, Lugh. Adam and Domenic make an incredible couple; Domenic is such a sweetheart (and a fabulous cook!) and Adam, well, Adam is a challenge with a hard edge. Andrew. Andrew is a bit of an anomaly who has been through some nasty experiences. Then there's Morgan's parents. Oh yeah, after you meet her parents, you're kind of surprised she turned out as well as she did. And Brian. He is such a sweetheart and, whooo, I dunno how things will turn out in Devil's Due. Not after what Brian goes through in The Devil You Know.The primary bad guy is Der Jäger, the Hunter, sent by Dougal, Lugh's evil demonic brother, to find Lugh in whoever's body he's hiding in.My TakeBlack will keep you reeling from one action to the next, from one bomb to the next dragging you through sensual dreams to torturous encounters. The Devil You Know is difficult to put down—try to set time aside when you begin reading this tale of revelations.The CoverI really can't figure out who the guy is in the suit standing in back watching Morgan meditating in her circle of candles. He doesn't look how I picture Lugh. He could be Andrew or Brian. As for Morgan's outfit…it seems a bit bare even for Morgan. I'm not sure what the title is about. The Devil You Know could refer to Lugh or Adam, the \"friendly\" demons that Morgan knows, or it could refer to Raphael or Der Jäger. Then again, it could refer to Morgan meeting the host that is Adam's body when the Adam demon slides into Domenic to save his life. Of course, my personal vote goes to her parents…talk about demonic actions!"}, {"userName": "Fiendishly Bookish", "userReviewDate": "Jan 13, 2010", "userURL": "http://www.goodreads.com/user/show/2615410-fiendishly-bookish", "userReview": "There are a lot of paranormal authors out there in literary land who have delved into the demon plain. In the demon realm we do have a few heavy hitters: Lilith Saintcrow (one of my favs), Kim Harrison (of course), Keri Author, Rachel Cain, naughty Emma Holly (smoldering) and a spattering of more, but Jenna Black clearly has a distinctiveness of her own. It's refreshing! I love championing the veritable bad boy/and or girl, and Black's Morgan Kingsley series is a virtual horn of plenty. It's got a plausible back-story of demon lore with a hierarchical pantheon, a potential coup in Hell, demons fighting each other on the Mortal Plain, professional exorcists like Morgan running the bad guys out of our realm, law enforcement officers possessed by lesser flight demons, and last but not least, Black's reality envisions middle-American WalMart \"walk-abouts\" embracing demon possession as a hip and holy lifestyle. Throw in a dash of S&M, and this series is cookin'. Morgan is the type of exorcist heroine that readers (especially female) gravitate towards: self-powerful, independent, sexually potent and aware, but just as willing to kick you on your butt with a pair of her size nine motorcycle boots. For fans, this book is a natural progression from The Devil Inside. Morgan starts to acquaint herself with her unlikely demon passenger, and starts molding a bearable lifestyle with him. But she still needs to unravel the mystery of not only how to get him OUT but how to help him prevent a full-scale war in Hell-a war that might just spill over into the Mortal Plain. What further complicates things is that Morgan is surrounded by frenemies, and a diabolical secret surfaces that her parents have been hiding from her...Revelations will be had. After reading the Devil You Know TWICE I sat back with a smug smile. I am hoping Black won't paint herself into a corner with Lugh, because fans will be panting for more after this second book. How will Lugh and Morgan consummate their relationship? When are we going to see what he really looks like? How will Black keep the tension up if Lugh slips his noose? It's tricky-tricky. What would be devilishly naughty is if Lugh were to \"borrow\" Adam's body for a bit of extracurricular activities with Morgan. I'm snickering just thinking about it. Copyright (c) Nicola Mattos"}, {"userName": "Archer", "userReviewDate": "Apr 23, 2010", "userURL": "http://www.goodreads.com/user/show/2933557-archer", "userReview": "From: http://www.fantasticfiction.co.uk/b/j...The beautiful. The bad. The possessed.Some people worship them. Some people fear them. And some people - like Morgan Kingsley - go up against them toe-to-toe, flesh to flesh, and power against power. An exorcist by trade, Morgan is one of the few humans with an aura stronger than her possessor, even though her demon can tease her body senseless. She's also a woman who has just discovered a shocking truth: everything she once believed about her past, her identity, may have been a lie.With a family secret exploding around her and a full-scale demon war igniting, Morgan is a key player in an unsettled world. Then a rogue sociopathic demon enters her life with a bang. His name is The Hunter. And since she is the prey, Morgan has only one choice: to hunt The Hunter down - no matter what heartbreaking truths she uncovers along the way.The Review:Book two in the Morgan Kingsley series is much better than the first; I’m glad that the first one grabbed my attention. Morgan can kick butt and if, for once, her life could become a little calmer, then maybe she wouldn’t have to so much. She is betrayed by those closest to her and assisted by those who previously stood in her path, but we won’t get into too much detail about that. This book is non-stop action, a real page turner, and the sexual tension isn’t bad either. A couple times I found myself trying not to throttle those well meaning people who love to interrupt you while you are reading. So here’s to Jenna Black; keep up the good work, maybe you can drown them out."}, {"userName": "Trace", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/3383520-trace", "userReview": "Sorry to say book two by Jenna Black in this series was an absolute shocker! Pity, because the whole concept of this series a kick ass female exorcist fighting against illegal demons on the mortal plain is very interesting. Unfortunately this one fell below par. I enjoyed the first book but felt it could of been better so I picked up the second book in the vain hope it would improve as the series went along. Wrong. I have the third book in the series but I just promptly put them all in the charity bag waiting to go to charity. I really hope someone else will enjoy them because it was certainly a big waste of my time over the christmas holidays!! It took me weeks to read this because it was so convoluted (do not attempt to read book 2 3 or 4 without reading 1 first or you will be in perpetual confusion) Morgan the so called kick ass exorcist is nothing more than a whining, over analyzing and whimpy woman with too much anger and baggage. She just droned on and on and bloody on!! There were no simple conversations in this book, the author felt it necessary to interrupt them with Morgan's continual analysis of every word action and body language of whoever Morgan happened to be talking with. It was tortuous to say the least. No more from me sorry I'm out and happily so!! ps - the body language mainly consisted of hard on's. I must remember when talking with men to look down at their pants to see if they are enjoying the conversation. (is the author 14? seriously!!!)"}, {"userName": "Aimee", "userReviewDate": "Jun 28, 2011", "userURL": "http://www.goodreads.com/user/show/3914805-aimee", "userReview": "This was a good follow up to the first. Things aren't getting any easier for Morgan. Lugh is still stuck in her body. After finishing the first book, I had time to think things over. I was starting to wonder just how this series would play out. How far it could possibly go. I'm liking the direction of it, to be honest. This stands out from most of the other recent books I have read.What I still love about this series, is that Morgan is strong. She's somehow able to control her body but able to let Lugh in when needed. I'm excited to learn all about this mysterious girl who is able to resist possession. And that is what this book was centered on. I thought the story line was well written and thought out. I was very happy with the many things we learn about Morgan. Very intriguing.I'm still wondering where things go. I can't imagine it would be easy to write about an attraction when said attraction is stuck in your head. I am interested to see how that plays out. I'm liking the series very well so far. Jenna has yet to let me down!!"}, {"userName": "The TBR Pile *Book review site*", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/5274619-the-tbr-pile-book-review-site", "userReview": "The Devil You Know is another highly recommended read in the Morgan Kingsley series. If you love paranormal romance, this is a must read! http://thetbrpile.weebly.com/reviews/..."}, {"userName": "Christine Kirchoff", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/24362437-christine-kirchoff", "userReview": "I love this series! Can I just leave my review at that? No? Okay, fine. The second book in the Morgan Kingsley Series and I love this world just as much as the first book. Full Review - http://thetbrpile.weebly.com/reviews/..."}, {"userName": "Janece", "userReviewDate": "Sep 14, 2008", "userURL": "http://www.goodreads.com/user/show/478664-janece", "userReview": "Rating this was MATURE, I don't even think I was mature enough to be reading it...."}, {"userName": "Nicole", "userReviewDate": "Aug 10, 2010", "userURL": "http://www.goodreads.com/user/show/4131645-nicole", "userReview": "Reread 7/3/17"}, {"userName": "Bry", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/24595244-bry", "userReview": "So far, this series has been great. I really like the direction it's going in."}, {"userName": "Starry", "userReviewDate": "May 28, 2011", "userURL": "http://www.goodreads.com/user/show/4738543-starry", "userReview": "morgan-main character,etc.Dominic Castello-adam's lover,etc.adam-cop,etc.lugh-almost-to-be king of demons,etc.raphael-lugh's bro,etc.brian-morgans use to be bf/ex bf,etc.dougal-lughs evil bro,etc.andrew(andy)-morgan's bro,etc.Dr. Neely-the body that raphael possesed,also the doctor that treated morgan at the healing circle that morgan doesnt remember about what happenedbradley cooper-the leader of social siciety grouppg.99when brian went to morgans house to tell her something, she hasnt expect to hear that adam has been investigating her and her family to see why raphael putted lugh in her, and she hadnt exected at all to hear that her mother was raped 28 years ago(morgan is 28 now) and that turns out morgans \"father\" isnt her real father.her whole life might be a lie.brian and adam thinks that the reason morgan is so strong and can block lugh out when wanted is because of whoever fathered her.morgans life had been worse when adam had to shoot andy for raphael to go back into the demon world, and andy is now having to stay in the hospital(morgan doesnt know how long he has to stay) and andrew cant really talk or control his body parts.only sometimes(cause when a demon exits ur body,they sort of damage ur brain).but the good news is andy got better when morgan visited him and he has to just stay for another day and he can go.but he would have to be probaly in a wheelchair.later on adam and dom tell morgan that andrew might be in danger, because andrew may still be hiding some info. that raphael wouldnt like him to have, so raphael might go after andrew once he posesses someone elses body to get the info.so adam suggests that andy stay with morgan for a while for protection.lugh also tells morgan in a dream one day that he doesnt have acess to all her memorys,because one of them is so bad that morgans brian wants to desperately forget it..but lugh did know that it had to deal with when morgan was in the healing circle(the hospital).adam tells morgan and andy that raphael came into the human world a few nights ago, but he never came to kill andy, so it probaly means that he isnt going to kill andy...but adams still not sure.raphael later comes in Dr. Neely's body and tells morgan that he doesnt plan on killing andy.raphael calls morgan later and tells her there is a new demon in the human world,he is known as Der Jager-or as the hunter.dougal offered Der Jager's freedom if he can find lugh and kill him.morgan decides to learn about who her real dad is and more info. that she doesnt know about herself, but all her mom told her was this:I used to do volunteer work at The Healing Circle when Andrew was young. One evening when I was leaving, a man dressed in scrubs accosted me in the parking deck. He forced me at gunpoint to drive him out into the suburbs. Then he\u0085\u0094 She swallowed hard and wrung her hands. \u0093He left me tied up in the backseat when he was finished, and that was how the police eventually found me. The Healing Circle said they\u0092d had a John Doe they\u0092d been examining in the psych ward, and that was probably the man who attacked me. But they never found him, never figured out who he was.\u0094..................and then later on morgan was caught reading her file from her dads private office and her dad punched morgan b4 she got to read anything more.morgan(of course) doesnt give up on the file.she she sneaks in2 the house and found the file gone(because morgans dad burned it) and was trying to find anyother info. that morgans dad might left behind in his office when she went face to face with Der jager.Der Jager ends up escaping but not b4 saying he'll be back to talk to her, adam plans on helping morgan, and morgan plans on warning everyone close to her that they have to watch out Der jager might transfer into their bodys to get to morgan..and the \"close to her\" means brian also, even though morgan hasnt talk to him since she left him.morgan was surprised when brian walked aout the door to her house(because the convosation gone wrong) and was thrown back in by adam(with dom behind him). adam then told morgan at the end that brian would be better off staying at morgans house, and morgan knew that after the trouble is over, brian is probaly going to stick at her side no matter what she does to try to protect him by leaving him. lugh gives morgan promission to tell brian about lugh and why morgan got a demon chasing her.morgan and adam got andrew to talk by threathing him and andrew finally said whathe knew that hapened in the hospital..he said that morgans mom and dad(not real dad) drugged morgan to get her to the hospital, and tried to give morgan away to the demons(because the demons were interested in morgans real dad and they were interested in morgan when they found out that mogan was morgans real dads daughter) but it didnt work and thats how raphael knew that morgan was different and putted lugh in morgan for lugh to be safe.der jaer is killed by adam.morgan finds out about the time she was in the hosital:her parents were standing at the side of her bed, with guilt on her moms face and no expression on her dads, and then cooper and dr.neeily were there too.the was a demon next to morgan trying to get axcess inside her body to posess her, but failed.the demon gave up and was going to kill her when cooper said that let raphael decide weither to keep morgan alive or dead.since morgan is alive right now it means that raphael must have picked to leave her alive..so that means raphael is the reason shes alive today.later on der jager somehow got into morgan fathers body and was posessing morgans father.then he went to morgans house and found morgan there and later on brian.morgan spilled her guts out to der jager alittle about what she knows(because der jager had his throat on brian) and later on morgan got to her weapons on time to taser der jager.morgan knows now that der jager knows too much, and she has to kill him(by flamming the host alive), but that would mean killing morgans father(not real father) and morgan doesnt know if she can do that.but lugh talks to morgan in her mind to let him have axcess to take over her but morgan didnt, and lugh trys and trys and finally sucesses and takes morgan over and blocks morgan out from lughs vision and what hes saying.when morgan came back to her body, she knew what happened.lugh burned her dad alive, and brian helped lugh.morgan feels worse when she goes to andrews house to find out that andrew is not in his body, but instead its raphael."}, {"userName": "Omi", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/9654620-omi", "userReview": "It was a fun, quick, read. Nothing spectacular but entertaining."}, {"userName": "78sunny", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/7373446-78sunny", "userReview": "5+ von 5 SternenInhalt:Morgan gewöhnt sich langsam daran unfreiwillig von einem Dämon besessen zu sein. Lugh ist kein gewöhnlicher Dämon, sondern der König der Dämonen und wurde auf Grund eines Komplotts unfreiwillig in Morgans Körper geschleust. Jetzt sitzen beide in einem Boot, aber ihre Zusammenarbeit wird durch Morgans Hass auf Dämonen und ein schreckliches Familiengeheimnis erschwert.Wie kam das Buch zu mirDieses Buch habe ich mir schenken lassen und ich habe mich selten auf ein Buch so gefreut wie auf dieses. Der erste Teil hatte mich bereits völlig umgehauen und ich musste daher dieses Buch haben. Leider scheint der Knaur Verlag die Übersetzung dieser Buchreihe eingestellt zu haben.Meinung:Das Cover ist leider wirklich hässlich und schreckt daher ziemlich ab. Allerdings ist es wenigstens etwas ansprechender als der erste Teil auf dem Morgan abgebildet was. Auf diesem Band ist ein Mann abgebildet mit wunderschönen blauen Augen. Ich denke mal, dass es Andrew darstellt.Die Grundidee der gesamten Geschichte ist genial. Wie schon im ersten Teil geht es hauptsächlich um Morgan, die unfreiwillig von dem König der Dämonen besessen ist. Eigentlich ist sie Exorzistin und hasst Dämonen. Niemals würde sie sich freiwillig als Wirt für einen Dämon melden, wie ihr Bruder Andrew. Der liegt aber seit dem Ende des ersten Bandes im Koma, da sein Dämons nicht mehr in ihm weilt. Lugh, der König der Dämonen, ist ebenfalls nicht freiwillig in Morgans Körper. Er ist für den Schutz der Menschen und erließ dementsprechende Gesetze. Dies passte natürlich nicht allen und somit wurde er Opfer eines Komplotts, dass er nun mit Hilfe von Morgan und einigen anderen extrem originellen und interessanten Charakteren aufzudecken versucht. Die Idee, dass sich Menschen freiwillig als Dämonenwirte melden, fand ich sehr originell und es wird sehr glaubwürdig erklärt. Auch die unterschiedliche Moralvorstellung von Dämonen und Menschen wird sehr gut erklärt.Die Spannung ist wieder super in diesem Band. Diesmal geht es hauptsächlich um ein schreckliches Familiengeheimnis, dass Morgan aufzudecken versucht. Alles ist verknüpft mit Lughs Geschichte und die Fäden der unterschiedlichen Handlungsstränge werden sehr geschickt zusammengeführt.Emotional hat mich dieses Buch noch mehr berührt als schon der erste Teil. Das Familiengeheimnis ist wirklich bedrückend und viele Dinge, die in diesem Buch geschehen ebenfalls. Trotzdem schafft es die Autorin einen immer wieder in einen beruhigenden Zustand zu versetzen.Man muss schon ein wenig die Dom/Sub- Geschichte mögen, da die Hauptprotagonistin so taff sie auch manchmal scheint, doch von den dominanten Männern geleitet wird. Und Männer gibt es in dieser Reihe jede Menge und wahre Schmanckerl wenn man auf Machos mit weichem Kern steht. Frauen gib es kaum neben der Hauptprotagonistin. Jeder einzelne Charakter in diesem Buch konnte mich voll und ganz überzeugen. Lugh ist sowieso der absolute Traumtyp, aber auch Brain, Morgans Freund, ist sehr interessant und sympathisch. Adam, der Dämon der Morgan hilft, ist oft ein richtige Macho-Ar..., aber trotzdem beschützt er sie. Sein Partner Domenic (ja hier gibt es ein schwules Pärchen) ist ein süßer und verständnisvoller Typ, den sich jede Frau aus besten Freund wünschen würde. In diesem Band spielt auch Andrew, Morgans Bruder, eine entscheidende Rolle. Auch er kann voll überzeugen.Action gibt es auch wieder genug, da Morgan in diesem Band auf der Flucht vor jemandem ist und auch ihre Liebsten vor demjenigen beschützen muss. Allerdings ist dieser Teil nicht so brutal wie manche Szenen im ersten Teil.Der Schreibstil ist super flüssig und man kann voll und ganz in die Geschichte abtauchen. Ich wollte einfach nicht, dass das Buch endet. Es wird aus der Ich-Perspektive und der Vergangenheit erzählt. An manchen Stellen wird der Leser direkt angesprochen, aber sehr selten und somit sehr angenehm.Ich kann einfach nichts negatives über dieses Buch sagen. Leider ist seit 2010 (3. Band) kein weiteres Buch mehr im Knaur Verlag erschienen und ich fürchte, dass es also ab Band 4 keine Übersetzung mehr geben wird.Grundidee 5/5Schreibstil 5/5Spannung 5/5Emotionen 5/5Erotik 5/5Charaktere 5+/5Lesergruppe:Der Leser/die Leserin sollten auf jeden Fall Geschichten mögen in den das Thema Dominanz eine wichtige Rolle spielt. Morgan ist ein toller, eigensinniger Charakter und steht mit beiden Beinen fest im Leben, aber schlussendlich wird sie doch von den dominanten Männern in ihrer Umgebung stark beeinflusst und geleitet.Fazit:Ich bin ein Riesenfan dieser Buchreihe und man kann dieser Buch mit keinen anderen vergleichen. Es ist einfach originell, emotional und super spannend. Allerdings sind die dominanten Männer wohl nicht jedermanns Sache, ich finde sie aber sehr ansprechend."}, {"userName": "Mietze's", "userReviewDate": "Nov 14, 2014", "userURL": "http://www.goodreads.com/user/show/36839420-mietze-s", "userReview": "Gestaltung:Das Buch hat wieder eine zum Thema passende düstere Covergestaltung mit dunklen Farben und schwarzen Mustern. Darauf ist diesmal ein männliches Gesicht zu sehen, wer genau dargestellt ist weiß ich selbst nicht :D ich mag bei der Reihe ja auch die Gestaltung der Schrift auf dem Cover. Auf jeden Fall passt der Band sehr gut zum Rest der Reihe (zumindest zu den deutschen Bänden).Meine Meinung:Diesmal hat es Morgan mit alten und neuen Problemen zu tun. Noch immer sind die Dämonen hinter ihr her, geschickt vom bösen Brüderlein des Dämonenkönigs um diesen endlich samt Morgan loszuwerden. Dafür schickt er ihr ausgerechnet einen dämonischen Killer genannt \"Der Jäger\" auf den Hals. Nicht nur das. Außerdem muss sie sich noch erschreckenden Geheimnissen in ihrer Familie stellen und längst verdrängten Erinnerungen stellen. Und dann sind da noch die Probleme mit ihrem Bruder, dessen Dämon Raphael und natürlich ihrem Ex Brian. Alles in allem hat sie wieder eine ganze Menge Ärger an der Hacke. Natürlich ist auch das Paar Adam/Dominic wieder mit von der Partie über die man noch so manche interessante Dinge erfährt. Auch werden wieder einige Geheimnisse der Dämonenwelt offenbart, die so noch kein Mensch erfahren hat...Ich mochte Morgan auch in diesem Band, auch wenn sie stellenweise nicht ganz so tough war wie im letzten. Jedoch war das ganze nie so extrem als das ich sie als nervig empfunden hätte. Ein bisschen Nervenzusammenbruch darf auch mal sein. Was ich von Brian halten soll weiß ich nicht. Irgendwie ist er mir immer noch zu blass. Dafür liebe ich das schwule Pärchen :D Ich mag Dominic der immer unterwürfig rüber kommt, es jedoch faustdick hinter den Ohren hat. Adam mag ich ja sowieso, interessant auch mal seine \"andere Seite\" kennenzulernen. Hier auch wieder der Hinweis: wer kein M&M mag, es kommt hier vor, wenn auch längst nicht so ausgeprägt wie im 1. Band.Mit Morgans Bruder kann ich allerdings auch noch nicht so viel anfangen.Ach ja und ihre Eltern sind echt furchtbar, da braucht man keine Feinde mehr wenn man solche Eltern hat.Letzendlich mochte ich diesen Band auch gerne, Die Erotik kam nicht zu kurz, Spannung war auch vorhanden, jedoch hat mich das Buch nicht ganz so gefesselt wie der vorherige Band. Woran das lag kann ich nicht ganz genau sagen, es war vielleicht nicht ganz so actiongeladen und Morgan nicht ganz so rotzig wie Vorgängerband. Das hat mir so ein bisschen gefehlt. Freue mich auf jeden Fall auf den dritten Band und hab mir auch die beiden letzten Bände auf englisch bestellt.Fazit:Ein guter zweiter Band der zwar nicht an den Vorgänger herankommt, aber auch nicht sehr viel schwächer ist. Eine tolle Dämonenserie auf deren weitere Bände ich mich auf jeden Fall freue.4 von 5 KatzenpfotenKomplette Rezi hier: http://cat-buecher-welt.blogspot.de/2..."}, {"userName": "Marianne", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/16417346-marianne", "userReview": "The Devil You Know is an excellent sequel in one of my favorite series: Morgan Kingsley, exorcist extraordinaire, drives out illegal demons from unwilling human hosts. Ironically, Morgan shares their plight as she recently learned she had become host to the future Demon King; Lugh. For some unknown reason, demons cannot possess her as easily as other hosts, and it takes a demon from the royal family to withstand her exorcisms, or possess her. Despite Lugh's strength, she maintains control of her body and mind. Lugh can only surface while she is sleeping, and in one instance that nearly cost them their lives.In the second book we delve deeper into their respective family secrets. Some long kept secrets are fairly dark, and surprisingly; intertwined. Not only do Lugh and Morgan share a body, they can both trace their troubles back to Lugh's morally questionable younger brothers: Dougal and Raphael. Raphael in particular plays a big role in this one, and although his methods are deplorable, it still gives us a feeling of how demons differ from humans. I admit, in some ways I even understand his actions. I may not condone them, but his relationship with his brother is still an intriguing one. For a little while I even felt bad for him. But of course, Raphael is... Raphael. And Raphael is self-serving.We also learn more of how human hosts really feel about the demons that have taken over their bodies. As one would expect, not every partnership is a happy one. Although we also get examples of partnerships that have worked out perfectly. Adam and his boyfriend Dominic are back and Morgan continues her tentative relationship with them, in particular Adam. Some may find a gay relationship bothersome, but I liked it. Admittedly, a BDSM loving demon is somewhat cliche, but in this instance it works for me. Now that Saul has been cast out of Dom, we see how Dom and Adam learn to cope with the true Dominic, instead of the demon Saul, who previously inhabited his body. I like Dominic the human, he is a gentle soul, but far from a pushover, even though he lacks Saul's penchant for heavy pain and accellerated healing abilities. A new psychotic demon, Der Jâger (the hunter) is sent from the Demon Realm to find out who carries the Demon King and destroy both the demon king and host. The politics of the Demon Realm with King Lugh, his younger brother Raphael and Dougal continue as Dougal attempts to overthrow Lugh and Raphael plays both sides. Let's just say that Raphael choice towards the end of the book, made the ending very interesting indeed. (Not to mention slightly disheartening.)"}, {"userName": "Wendy", "userReviewDate": "Jul 01, 2009", "userURL": "http://www.goodreads.com/user/show/1063235-wendy", "userReview": "We met Morgan Kingsley in THE DEVIL INSIDE, she's an exorcist that get pays by the government to well, exorcist unwanted demons. What makes things even more complicated - and deadly - is that somehow Morgan ended up possessed by a demon herself. And just as a ironic twist of fate - it's the Demon King, the most powerful demon there is. But no matter how powerful Lugh is, Morgan's mental barriers are pretty good and the only way he can control her is when she's sleeping or when she's um, otherwise busy, which is why he keeps trying to seduce her. That and he's hot for her which makes for some really sexy scenes. In The Devil You Know, Morgan and Lugh keep trying to hide from the demons who don't want him to be king, including his evil brother. There's a demon war brewing between the ones that want Lugh to rule, and those who don't and Morgan is right in the middle of it. Will Morgan be discovered as the one housing Lugh? And will Lugh be able to finally take control of Morgan's? I really liked The Devil Inside, the first book of the Morgan Kingsley Exorcist series, and so I started reading The Devil You Know with high expectations. The beginning was good, we see Morgan learning to deal with living with a demon inside her, and other problems as well. Since this series is in first person, it's practically impossible to know more about Lugh without bias and I feel this story would have been a lot better if I could read more about what goes on in his head. The secondary characters', Adam and Dominic, interactions with Morgan are great to read, there's a bit of unwanted sexual tension and it makes things really interesting. I liked the writing, it flowed well and it wasn't too fast or too slow for me. The only problem that I had is that there was a lot of conflict in the book and I felt like at the end, anything was barely resolved. I know this is a series but for all the conflict and enemies trying to kill Morgan, etc, I felt that Black should have at least solve more, because when I finished the book, I was left with \"was that it?\" feeling and that's something that really put me off. Overall I did like THE DEVIL YOU KNOW, it was enjoyable, the concept of Demons being able to possess humans with them being okay with that, even wanting to be possessed is very interesting and I liked it very much. I'm looking forward to the next book in the series."}, {"userName": "Anna Tulley", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/3501592-anna-tulley", "userReview": "I don't know what to think of this book, i guess i really liked it, to the point of being so attached to it, that i fervently wanted to beat some sense into the majority of its characters. I'm still frowning, feeling frustrated as hell, trying to decide what to make of it, but only anger comes to mind at the moment.It had an awesome beginning but lost it's momentum, and something surely rubbed me the wrong way. We got an insight of Morgan's past and things became clearer but shit definitely hit the fan.I don't like the way this story is developing.Dear Morgan was such an annoying b*tch most of the time (and to think that so far i liked her), and was unable to act and react properly and make up her mind about her actions and her feelings towards people.She felt helpless and hopeless most of the time. Ok, i get it that she may had all the rights in the world to be like that, because of what she's been through, but come on, she made things far worse with her attitude.Andy her brother, I'm mad at him for being a demon host in the first place, for regretting it afterwards, for being such a wuss. And the cherry on top, for becoming a host AGAIN. (we are not certain we was willing).Though, he's the least responsible for all this crap that has been going on and i do feel sorry for him.Lugh,the demon king, acted like not a King at all,he was so damn inadequate and worthless. I'm wondering who is the puppet and who the puppeteer?And he's simply the source of all evil!And Raphael, the guy that i really wanted to get my hands on, this bastard really got on my nerves! No matter what his excuses are, he is repulsive.Let's not leave out the epitomy of stupidity, Morgan's parents!Talk about frivolous,brainwashed,cluless people! I'm not feeling sorry for them in the least bit.The only characters towards whom my feelings haven't changed in this book, are Adam and Dominic. I really enjoy learning more about them and their relationship, although they were kinda in the background this time and i craved for more. I also, liked Brian a lot, although he's considered a liability.I don't see where this story is headed to, a lot of things happened, people got hurt for what exactly? We are back were we started... I honestly like this series and i do intent to read the rest of the books but i'm thinking of taking a break from it, at least for now, i'm really annoyed."}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Jan 13, 2011", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "In ‘The Devil you know’, the series first sequel kicks off with problems, exploding in all directions - personal, physical, emotional, it’s probably there. Hosts of issues for our Urban Fantasy host, Morgan, who is still housing the amusing and powerful demon Lugh.She is again in trouble as one of the King’s enemies is trying to hunt down and destroy whomever the demon is possessing. And remember, possessing is using in the loosest term possible as it’s different for this series than what we usually think of when we heard the word possession. There’s a lot going on from many sides – breaking off with Brian (drumroll or eyeroll?), Adam and Dominic still having fun embarrassing her (…), Raphael’s return (uh oh), her brother Adam’s recovery and the aftermath (meh), and Morgan finding her mind has a blank spot in it that even Lugh can’t penetrate to find what’s hidden beneath (du du dum.)Just as good as the first, I’m still in love with this different twist of a series. A pity it’s not higher in rating and popularity, but I suppose different tastes is what makes the book world spin around. Again with reading glee I’m delighted with an intense villain, high stakes, lots of dark themes, sexy wickedness from several of the key players, humor, and never quite knowing what’s going to happen next.I’ll admit Morgan isn’t the best character in the world – she’s actually one of my least favorites, so it’s funny it’s told through her POV. She really is too moody and uptight. Still her world is fun to be in, especially because of the charming Lugh dreams, the darkly teasing Adam, and the unusual battles and crisis she must face.It sometimes borders on Paranormal Romance over Urban Fantasy because of the emphasis on Brian and their relationship woes (this admittedly grows thin), but cools down unrealistic love interest types. Some are turned off by the bits of BDSM and alternative lifestyle stuff, but it affects me in pleasing, twistedly good ways instead.Jenna Black obviously had fun writing this world. It’s unique structures, the obstacles are tough and wars fierce. Oodles of mental gymnastics and emotional ambushes accompany all the excitement to make me fall in love with the series even more than the first did.Highly recommended for Urban fantasy buffs."}, {"userName": "Kimberly", "userReviewDate": "Nov 20, 2013", "userURL": "http://www.goodreads.com/user/show/7331381-kimberly", "userReview": "Morgan Kingsley is trying to keep her life as normal as possible, meaning nothing to do with Lugh's problems. The past few months have been hard on her, she discovered that she is possessed by a demon king, her best friend is trying to kill her, someone wants to burn her alive and she is putting her boyfriend, Brian, in danger so Morgan deserves a break. However, she cannot continue on with her denials any further. Adam, a demon cop, has been investigating Morgan and her family and it seems that Morgan isn't who she think she is. She now has to deal with her family drama and the horrible things that her subconscious mind blocked out. Other than that, people are dropping dead with their brains fried. The psychopath demon called the Hunter is out for Morgan's blood. She must do whatever it takes to keep herself alive, even if she has to lose someone for it. There is more to lose when she dies now than before.I could seriously say that this book is way more intriguing or interesting than the first one. I couldn't stop reading it. In the first place, I love the revelations about Morgan. I think everyone loves some mysteries uncovered. Morgan is getting deeper and deeper into the shit that she is thrown into. She needs to keep herself together for her mission isn't for the weak hearted. Also, I'm seriously excited with what Brian will do to bring Morgan back. I think that's what made me read the book non-stop, even if I have classes and homework.I also love the fact that Morgan is trying to be a better person, in other words, she is much less of a bitch in this book. She is learning to not be an annoying spoiled person. Though, she still doesn't know how to fight which is a total bummer but she is learning the word \"compromise\" which is a total plus.I still love Adam & Dom. Though, I'm so not into their BDSM relationship. I'm totally ok with them being gay, which I seriously think is cute, but I'm not into what they are in. I don't find it hot at all."}, {"userName": "Kat", "userReviewDate": "Mar 07, 2011", "userURL": "http://www.goodreads.com/user/show/5024269-kat", "userReview": "I have to say first that I wasn't expecting too much after reading the first installment in the Morgan Kingsley series. It started off rough in The Devil Inside, not understanding which genre Jenna Black was trying to fit her series into. But when I stopped trying to analyze it and where the book could go, it didn't matter. I'm glad I stuck with it. The characters, but most especially Morgan herself, have really grown. Morgan is much more appealing to me in the The Devil You Know than she was in The Devil Inside. I can't think of more than two things I didn't like. The following criticisms are nitpicky: Personally, I don't enjoy when any author backtracks in the series and repeats more than one or two things from what happened in an earlier book. Unfortunately, there was a quite a lot of that happening in the beginning, too much for my liking in The Devil You Know, but it's small beans. Also, one line that stuck out to me as a little odd was about Dominic and Adam's gay relationship in relation to display of affection. It felt like it should have been rearranged. It came off a bit, well, homophobic. Which is completely against what I've read so far in the series. Honestly, most of the sexual sparks are between her characters Dom and Adam, something that Ms Black effortlessly conveys in yummy detail. In any case, Morgan as a character has shown us to be a little bit of a prude with any display of affection even with her high sexual appetite, so it's understandable.Now, the plot. It was spectacular, and it very nearly outshines the characters. Unlike the first book in the series, I didn't feel any moments of stagnation in this one. I wasn't bored at any point in this book. It might not be the most mindbending one in its market, but it is damn well deserving of praise in the plot department. It's full of suspense and even a curveball or two. It's hard to surprise me in novels, but The Devil You Know did manage to sneak one over on me. Here's hoping the excellence continues!"}, {"userName": "Sarah", "userReviewDate": "May 14, 2010", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "This is the second book in the Morgan Kingsley series so there may be spoilers for the first book included in this review. If you are new to the series then I recommend you check out the reviews for book one The Devil Inside rather than reading any further. Morgan is still trying to get used to the fact that she is now unwillingly hosting the King of Demons Lugh. Luckily Lugh isn't able to take over complete control of her - he is only able to influence her body when she is asleep and he can only communicate with her through her dreams. Considering her job as an exorcist is to remove illegal demons she isn't very happy with this development but hasn't been able to work out a way to get rid of him. If anyone discovers her predicament she is at risk of being burned alive. Lugh's brother wants him dead so he can take over the demon kingdom and has sent a sociopathic demon called the Hunter after him. Unfortunately they know that Lugh was being hosted by Morgan so they know where to go looking. They have no way of knowing which body the Hunter is in - he has already taken several human hosts and as he can move to any human he touches the easiest way for him to get to her is through someone she knows. With her friends and family at risk Morgan is forced to turn to demon Adam and his lover Dominic for help. She also needs to find out more about the truth of her birth and events that happened during her childhood. I enjoyed the first book in the series but was a little put off by some of the S&M scenes that were included. I'm pleased to be able to say that this wasn't a problem with book 2 & I enjoyed it more because of that. There was less action in this book but there was still plenty of mystery and I enjoyed the developing relationship between Morgan and Lugh. Some of the twists were completely unexpected and I'm interested to find out how things will continue from here so I'll definitely be checking out The Devil's Due."}, {"userName": "Steph", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/4215697-steph", "userReview": "The second book in the Morgan Kingsley series.  I enjoyed this book just ass much as the first one. The Devil You Know starts off only a few weeks after The Devil Inside. Morgan has been trying to cut herself off from the world. She needs a break, time to wrap her head around the things that are happening in her life. But she soon realises that her problems will not just go away and they're already starting to catch up with her. Morgan is missing Brian (after dumping him in the last book, she believed it was for his safety) more than she ever thought she would. With all her problems heaping themselves on top of her she feels more alone than ever and her incredibly sexy Demon king (who has possessed her) seems to take full advantage of that. Every time they meet in her dreams he is so sweet and caring, charming and oh so hot. I was really hoping that they would get together even though I love Brian. I think Lugh just has that effect on people ;) It was great to see Adam and Dominic again so early on in the book. Adam has been investigating her family to try and figure out why Morgan can keep full control of her body when she is possessed, it's never been heard of before. But Morgan soon wishes that he had just left her past where she wanted it, dead and buried. We finally get to meet Morgans parents, and they're both a real piece of work. They don't really seem to care about their children all they want them to do is be Demon Hosts, no matter the consequences.  I really liked the storyline about Der Jager (The Hunter). Dougal (the kings evil brother, who wants the throne for himself) had offered The Hunter his freedom if he could find and ill Lugh and whatever host he was in.  I think Raphael (the kings other brother) wil always be a mystery to me. We never quite know which side he's on. He is deffinately working both sides but where do his loyalties truly lie?  Another great book. I am loving this series so far and can't wait to read more."}, {"userName": "Mello ❣ Illium ✮Harry✮ ☀Myrnin☀ Torin Ichimaru", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/6981505-mello-illium-harry-myrnin-torin-ichimaru", "userReview": "So I read this book in like 6 hours. Seriously, this series just sucks me in. I'm addicted to it.Morgan still has a lot of the same emotional issues that she has in book 1 and just when she starts to make some progress, she comes full circle. I hope it won't continue to be that way. Anger is a big part of Morgan's personality, but she needs to find a way to stop making it her go to emotion. It hurts her relationships with pretty much everyone. There are times when I don't find fault with her anger. I'm not sure how I feel about her reaction over what Brian did in that situation with Der Jager. I'm not sure how I feel about her reaction to Raphael once more possessing who he is possessing. I'm hoping she can get past this some how. I feel bad for Brian. Honestly, what was he supposed to do?I can't blame Lugh for what he did at the end, either. I don't blame Morgan for her reaction for being taken over, really. Being in that hole can't be pleasant. Even more so for someone like Morgan. I felt for her in that situation. She was genuinely afraid.I'm glad Brian knows the whole deal now. He really did deserve to know. Morgan was lying to herself nearly the entire book (and the last) regarding her relationship with Brian. I do hope she can be honest with herself in the future. She seems to be, but allows herself to live in denial, so it doesn't really count. A lot of time, I feel for those that have to constantly deal with her. Her stubbornness and refusal to admit things to herself and others often works again the rag-tag group. And they certainly are a rag-tag group.I'm so into these books that I have to keep reading, but I'm hoping Morgan can evolve a bit. In a lot of ways, she reminds me of Anita Blake with regards to her trust and anger issues. She can't be faulted for them entirely, but she has got to work past them at some point. Alienating everyone is not working to her advantage."}, {"userName": "Ithlilian", "userReviewDate": "Jan 28, 2011", "userURL": "http://www.goodreads.com/user/show/4793655-ithlilian", "userReview": "After putting this down and stepping away from it for a few months I decided to give it another go. I started at around page 131 and was so interested I went back and reread. There is the obligatory boyfriend drama, and banter between characters that don't really like each other, but beyond that there is an interesting story here. I really did want to know who Morgan's father was and what games Raphael was playing, and I found myself enjoying The Devil You Know. I would love to find out more about the world and the characters, so I plan to continue the series.There were flaws, and I found them hard to get past the first time I read this. The characters bicker and pick and generally don't like each other. I mean, I do understand why Morgan wouldn't like someone that killed her friend, and that she wants to keep her boyfriend out of danger, but it is a bit annoying to hear about it repeatedly. I also understand that she doesn't want to have sex, even if it's dream sex, with anyone but her boyfriend for awhile. I don't understand as much the constant S&M and gay references. It's not a bit deal that two of the characters are into that, but Morgan awkwardly brings it up and just makes everything feel uncomfortable. I do think that aspect may be thrown in there for potential shock value, and it makes it less natural, and therefore, not very enjoyable. Another thing I was underwhelmed by was the big bad guy in this. The demon that is after Morgan takes up most of the plot, and I didn't care about it at all. I'd rather find out more about the demon realm, and have Morgan actually do some exorcisms than read what is currently presented here. There is potential with this series, and I think there are some unique elements here that will continue to keep my interest, but I can see how this would not appeal to everyone."}, {"userName": "Irina", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/19662729-irina", "userReview": "Morgan is again confronted with attacks on her life and she is hunted down by The Hunter who specializes in finding specific targets. She has to rely on Adam's help to survive, but all the people she cares about may be hunted as well. She is forced to keep Brian and her brother close to her for their safety while her relationship with Lugh deepens without her realizing. My rating is actually 3.5That's about all I can summarize from the book right now, because I'm too angry with this setup. Lugh grew a lot on me because he was introduced in the first book and the author shows how the relationship between Morgan and Lugh grows. If it had been the same with Brian, it would have been okay, but he is part of her past and Morgan and Brian loved each other long before Lugh came into the picture. I mean why the hell are you putting a new character in Morgan's love life if you actually pretty much decided it in the first place? I mean c'mon they were close to marrying before all this demon situation was dumped on them. I mean Lugh is actually attractive and all that, but I seriously doubt Morgan would dump the guy she loves just for Lugh's looks. I already am pretty sure who she will end up with, not that it wasn't decided from the beginning.This is actually more a rant on my part, because I like my books with unexpected romance. Actually if there wasn't any romance I wouldn't be reading any book. I care about that a lot, and this being so predictable doesn't sit well with me.EDIT: After I read some reviews on book 5, I have decided that I won't read this series anymore. I won't spoil for those who still want to read the book."}], "description": "The beautiful. The bad. The possessed.Some people worship them. Some people fear them. And some people—like Morgan Kingsley—go up against them toe-to-toe, flesh to flesh, and power against power. An exorcist by trade, Morgan is one of the few humans with an aura stronger than her possessor, even though her demon can tease her body senseless. She’s also a woman who has just discovered a shocking truth: everything she once believed about her past, her identity, may have been a lie.With a family secret exploding around her and a full-scale demon war igniting, Morgan is a key player in an unsettled world. Then a rogue sociopathic demon enters her life with a bang. His name is The Hunter. And since she is the prey, Morgan has only one choice: to hunt The Hunter down—no matter what heartbreaking truths she uncovers along the way….", "title": "The Devil You Know\n      \n          (Morgan Kingsley #2)", "url": "https://www.goodreads.com/book/show/2398197.The_Devil_You_Know", "average": 3.81, "cover": "https://images.gr-assets.com/books/1388909238l/2398197.jpg", "reviews": 145, "authors": [{"url": "https://www.goodreads.com/author/show/51118.Jenna_Black", "name": "Jenna Black"}], "type": ["Fantasy", "Fantasy", "Paranormal", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/2398197.The_Devil_You_Know", "http://www.goodreads.com/book/show/2576314-the-devil-you-know", "http://www.goodreads.com/book/show/8177103-the-devil-you-know", "http://www.goodreads.com/book/show/15702764-die-exorzistin---d-monenjagd", "http://www.goodreads.com/book/show/7234828-glimmerglass", "http://www.goodreads.com/book/show/8161632-shadowspell", "http://www.goodreads.com/book/show/9720766-sirensong", "http://www.goodreads.com/book/show/729876.The_Devil_Inside", "http://www.goodreads.com/book/show/8562565-dark-descendant", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}