{"ratings": 23, "userreviews": [{"userName": "Kevin", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/21832475-kevin", "userReview": "This was a good read but not for all of the book. Basically, the story doesn’t really start until Chapter Three. Yes, the Prologue introduces characters that are important but felt a bit like a laundry list of things the author wanted to quickly explain and so did the chapter introducing Jillian and her husband. We were basically treated to a lot of backstory and characteristics traits early on.Once the story finally starts, it’s sort of a zombie invasion in the suburbs. Still, we’re treated to thoughts from Jillian’s mind and journal entries. Some of these entries are funny while others are simply info dumps. Just a lot is rushed through at the start. I liked the characters though and even the weird sex scene.Eventually we switch from Jillian to a new character named Kate. This is when I truly start to enjoy the book. It seems as if the author always planned on making this story about Kate and all the stuff with Jillian was just filler or to explain something that makes her version of the zombie standout from all the other zombie in the writing world.Kate and her friends eventually join other survivors and we stick with them up until the end of the book. I liked Kate and the other survivors, they honestly saved this book.As for the end, I was expecting a happy ending. She does a good job convincing us everything will end perfectly. I won’t spoil anything and will simply just say I would read the sequel just to see how the writer handles it. I want to see her write a full book without the journal entries or filler characters. The first half of this book gets a 3 out of 5, but the second half gets a 4 out of 5."}, {"userName": "Scott Collins", "userReviewDate": "Dec 06, 2013", "userURL": "http://www.goodreads.com/user/show/2946836-scott-collins", "userReview": "I really enjoyed the first book, and so I was really looking forward to this continuation of the story. The plot is solid, and I like the characters that were introduced, but I found myself distracted by formatting problems on my kindle and various grammatical and punctuation errors. The basic premise of the story is that some humans find the diary of Jillian, the protagonist of book one, in their search for a safe haven. They find a little girl at the same location and set out to get her to a secure location. Great characters are introduced in their journey, both good and bad. Well conceived, but at the end, I still found myself pulled out of the moment by the editing issues. I read in another comment that these issues are being addressed, so once that copy is available, I think this will make for a wonderful continuation of book one."}, {"userName": "Sonya Dodd", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/21805363-sonya-dodd", "userReview": "The clever thing about this writer is the way she makes a world filled with zombies seem so plausible. The reader is drawn into a world where a deadly virus is allowed to escape from a laboratory and infect people almost immediately, leading them to die and become zombies.There is a cunning mix of diary and narrative which adds to the realism. There is also very vivid description of some of the more bloody and grisly scenes which should appeal to lovers of horror.The pace is great and helps to convey the sense of the importance of the passage of time for those who fall victim to the virus and their loved ones."}, {"userName": "Robert", "userReviewDate": "Aug 27, 2013", "userURL": "http://www.goodreads.com/user/show/21693624-robert", "userReview": "The moment this book hit the kindle stores, it was on its way to my device!!!I had been waiting with baited breath for this addition to the series, and it answered some of the questions I had been rolling over in my head since book 3! I was sad to see some of the characters leaving in unpleasant circumstances!It is a little short, but I believe it is because following 5 and 6 being published, it is being combined into 1 book (This book will be on my Physical book shelf not just kindle!!)The book again brings out the dark selfish side in humans that lies underneath (In some it is JUST below the surface!)Very good read again, Look forward to 5 and 6 :)"}, {"userName": "Gemma Farrow", "userReviewDate": "Nov 19, 2013", "userURL": "http://www.goodreads.com/user/show/21420136-gemma-farrow", "userReview": "I first read The Last Day in the Life of Jillian, and loved the stark quality of the story. The Dead Live On is an extended version of the earlier story I read, where I got to meet new characters in this over-run zombie world. Cooper Brown writes well and ably captures what kind of world could be born from the meddling of Man. I loved the character of the little girl Angel, and felt for little Kimmy, a desperate child, seeking affection. This is a sad story, but also a story of strength and perseverance."}, {"userName": "Venky Iyer", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/25876700-venky-iyer", "userReview": "Let's see, now. What about this book struck me? It has got a great storyline, a strong theme that is based on a very plausible scenario involving both deadly viruses let loose by accident and acts of god. It has got a series of incidents involving lots of characters, most of who keep shifting. Just a handful of the characters are there throughout the book, but the story is kept taut. It has got a shock ending.It desperately needs some tight editing; the author should take this requirement seriously."}, {"userName": "Antonio Simon Jr.", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/21245621-antonio-simon-jr", "userReview": "This zombie apocalypse story opens with a recap of how an unstoppable virus came to threaten the end of life as we know it. A minor lab accident exposes the world to a deadly virus. The president and other high-ranking members of the government have been infected. The infection spreads and before long, hordes of waking dead threaten the survivors. There is no cure.The story then follows Jillian and her husband, Evan, as they struggle to survive the zombie apocalypse. At the risk of triggering a spoiler alert, I'll stop discussing the plot here. Suffice it to say, the book hops around to tell the stories of several survivors (and some victims), and to go into further detail would spoil the fun.I did enjoy the references to characters playing Silent Hill and Resident Evil. They made the story more believable (and a bit ironic) in that these days zombie pop culture is all the rage. I may be mistaken, but one main herself (Jillian) may be a reference to the Resident Evil character Jill Valentine. These little nuances don't detract from the story at all - in fact, I found it made the story more fun. The subtle references were like \"Easter Eggs\" for the careful reader.The book makes for an enjoyable read, but it could have benefited from more stringent editing. My copy exhibited a number of technical irregularities - nothing too flagrant, but still enough to draw attention. I'm informed that the author has it in mind to put the book through another round of editing, and this is great news because it'll only make her already good story even better."}, {"userName": "Julie", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/9948356-julie", "userReview": "Editing nightmare. This story felt rushed and was an editing mess. She was able to make me care about the characters and got me interested in the story but book four has probably satisfied any desire I may have had to read more of her work."}], "description": "First you will see the world through the eyes of Jillian Drake, she writes of her experience and the horrid things she learned, up to the point of being trapped. Her husband, Evan, has been mortally wounded and she documents the stages of infection as it ravages his body, turning him into a being that she used to love to be frightened of. Soon after, you meet Kate Roland. An American Soldier whom we've briefly met through the memoirs of Jillian. She is paired with her longtime friend and while searching for shelter, stumble upon Jillian and Evan's body as well as a 6 year old girl, Angel, abandoned in the midst of the dead. Can Kate protect the girl from harm and what other secrets of the dead shall be revealed before they make it to their next destination?", "title": "The Dead Live On\n      \n          (The Last Days #4)", "url": "http://www.goodreads.com/book/show/18747783-the-dead-live-on", "average": 4.3, "cover": "https://images.gr-assets.com/books/1383397561l/18747783.jpg", "reviews": 8, "authors": [{"url": "https://www.goodreads.com/author/show/7161213.Julie_Cooper_Brown", "name": "Julie Cooper Brown"}], "type": ["Horror"], "outlinks": ["http://www.goodreads.com/book/show/18747783-the-dead-live-on", "http://www.goodreads.com/book/show/18370719-the-dead-live-on", "http://www.goodreads.com/book/show/18161987-the-last-day-in-the-life-of-jillian", "http://www.goodreads.com/book/show/18171373-kate-s-calling", "http://www.goodreads.com/book/show/18195051-angel", "http://www.goodreads.com/book/show/18370699-the-last-days", "http://www.goodreads.com/book/show/27015738-the-last-days"]}