{"ratings": 3702, "userreviews": [{"userName": "Jilly", "userReviewDate": "Aug 20, 2016", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Molly Harper's books are mostly books that I sit & read while smiling like an idiot the whole time. So much snark and fun! In the last book, I wasn't a huge fan of the heroine, but in this one, I LOVED her. And, even better, she was a funny teenager a couple of books back. I loved her then! So, obviously, I enjoyed the book.The male in this was a little on the bland side, but he was a sexy blonde vampire and I have a weakness for them for some reason.Oh yeah. That's the reason...Gigi is as weak as I am when it comes to charming, sexy blonde vampires.\nThis would be so much easier if he was some alpha-male tool. But, here he was, being all charming and rakish, and rakish vampires seemed to be my kryptonite.\nShe also hates alpha-male tools! She is my vampire girl-soul-mate.More about my love for Gigi:She is a total nerd She uses Princess Bride referencesShe used the words \"crap on a cracker\"She and her sister had a Tommy Night where they watched Tom Hiddleston movies, shirtless Tom Hardy movies, and drank Tom Collinses.Seriously, I love her.(My daughter and I had a Hunk-a-thon night and Tom Hiddleston was definitely part of the line-up. We started the day with seeing the movie, Tarzan, with Alexander Skarsgard. Terrible movie, but you need to see it anyway. Rawr!)soak it in, girls. soak it in.Aside from the couple, we get to catch up with all of the amazingly fun characters from the Jane Jameson series and the previous books in this series. The chemistry between these characters is hilariously awesome. I really want to hang out with them someday."}, {"userName": "Jessica's Totally Over The Top Book Obsession", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/28967089-jessica-s-totally-over-the-top-book-obsession", "userReview": "4.5 stars :)"}, {"userName": "Carmel (Rabid Reads)", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/4561998-carmel-rabid-reads", "userReview": "Reviewed by: Rabid Reads.Whenever I just want to sit back, and enjoy a quality audiobook, I turn to Molly Harper & Amanda Ronconi. My last listening session with them was in June 2014, so clearly I was in desperate need of a fix because I finished THE DANGERS OF DATING A REBOUND VAMPIRE in one day. As soon as I clicked ‘play’ my smile was locked into place thanks to the fun quotes from The Office After Dark: A Guide to Maintaining a Safe, Productive Vampire Workplace—this installment’s fictional how-to manual—and there it stayed.We first met Gigi in I’M DREAMING OF AN UNDEAD CHRISTMAS, and it was nice to finally get the continuation of her story, and find out who her mysterious vampire stalker was. She’s the last human in the Jameson / Scanlon circle, so I was curious to see whether she’d stay that way, or join the rest of the HALF-MOON HOLLOW supes. She’s also the youngest POV to date which lightened Harper’s already breezy writing style even more, and made her character’s sometimes questionable decisions and go-with-the-flow attitude easier to grasp which is always beneficial in insta-love type situations.The plot wasn’t a brain buster, but still kept me on my toes, and I really enjoyed seeing Ophelia get kicked off her high horse. My favourite secondary, Dick Cheney, didn’t have as much dialogue as I would have liked, although Nik was a pseudo Russian version of him which was an acceptable substitution. It was entertaining watching Iris in all of her overprotective big sister splendor, and how their group of friends banded together when Gigi’s life was in danger. Plus, this author’s latest batch of pop culture references were real winners: GAME OF THRONES & THE WALKING DEAD.Amanda Ronconi pulled out all the stops once again with her exuberance, accents, voices, and sound effects. She’s a pro at pinning down the emotions that each scene calls for, and always gives her 100% in every performance. Harper’s sense of humour is increased tenfold by Ronconi’s narration, and because of that I ALWAYS opt to listen over reading. I can’t recommend Harconi enough; they are the benchmark by which I measure all Chick-Lit Paranormal Romance and a MUST for all audiobook junkies.THE DANGERS OF DATING A REBOUND VAMPIRE was like riding a killer water slide, except the whee lasted for 9+ hours."}, {"userName": "Dorsey aka ❤️ Wrath Lover Reviews  ❤️", "userReviewDate": "Sep 05, 2014", "userURL": "http://www.goodreads.com/user/show/5205999-dorsey-aka-wrath-lover-reviews", "userReview": "4 \"Mr. Tall, Blond and Bitey\" Fun Stars!!\nAnother light-hearted, happy Half Moon Hallow book with a snarky heroine along with her lovable & fun undead family. Between the over-protective nature of Gigi's sister Iris and her semi-nerotic brother-in-law Cal....I have to say I absolutely love and adore Gigi's vampire brother-in-law Cal, along with the rest of her undead family (love Dick Channey too!!) , they had me constantly grinning or even laughing out loud at times. I loved Gigi, you can't help but love her snarky self and I found myself waiting to see what she'll do next....she just seemed to always get into some kind trouble. \nNik is great, he's kinda quirky, definitely sexy, and very protective. He knows what he wants, isn't afraid to go after it, and he likes to keeps Gigi on her toes. Nik is an old (very, very old) friend of Cal's who at Cal's request has been keeping an eye on Gigi, however; there is something very wrong happening with him that is a danger to Gigi, but Gigi is determined to find out what the heck is going on, because if she can't figure it out, they will have no future and she has fallen hard for the vamp, much to the dismay of Iris & Cal.Lastly there is one character that will finally, finally have to answer for past and present bad behavior and yet I found myself kinda feeling sorry and hoping for leniency. All in all another Fun “Half Moon Hallow” story, looking forward to more of these fun and lovable vamps."}, {"userName": "Ian", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/6703235-ian", "userReview": "When Gigi accepts a job working for the vampire council, her sister Iris is none too happy. But the job pays well and has a killer benefits package. Unfortunately it appears there really is a killer benefits package. Somebody is out to get her and she has to look to her coworkers to find the culprit. Nik is a very old vampire from Europe who is in Half Moon Hollow to do a job. Though he can't quite remember what the job is. Still it has something to do with Gigi so he makes sure he keeps bumping into her. Can he protect her from the vampire who is hunting her? Can they hunt down the person who paid for the vampire to hunt her, break a curse and live happily ever after? Well...yeah, I mean you know that when you buy the book, but getting there is still great fun. I have a lot of love for these books. They're just such great fun. Clever, snarky banter, a lot of laugh out loud moments and despite the fact that they're nothing new, they somehow still feel fresh after ten books. If you want some light-hearted fun, this is about as good as it gets."}, {"userName": "Stephanie", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/3919719-stephanie", "userReview": "How could anyone not love a book containing the phrase, \"Mr. Tall Blond and Bitey?\" I know I loved THE DANGERS OF DATING A REBOUND VAMPIRE by Molly Harper, the latest novel in her Half Moon Hollow series. Molly's books are filled with all the good feelings and always touch my heart. They just make me happy! They also leave me unable to put them down. I started this one before lunch and then went to a meeting. When I got home, I sat down and finished the book before bedtime.Molly's books are light and funny, and sometimes poignant although I don't remember ever tearing up over one. Mostly I sigh and giggle. And, the Half-Moon Hollow books fit together very well across story lines and characters. So in this one Nola and her guy from A WITCH'S HANDBOOK OF KISSES AND CURSES seamlessly slips this-a-way into GiGi's book.It's nice to have the continuity but, it is also nice to have the flow of a series that began with Jane and Gabriel, and then morphed into the spin offs. I find I don't get bored, but I also don't have too much trouble figuring out who was who when time passes between books.Nik is an absolute fox. Yeah, I haven't met him since he is a fictional character, but the mannerisms and personality granted him by his creator makes me wonder if Molly has an ancient Russian hottie in her past. GiGi is often 20 going on 40, wise beyond her years, but not always. But, in general she is pretty mature. And, she doesn't question fate when it smacks her on the lips.REBOUND VAMPIRES DANGEROUS? Meet Mr. Tall Blond & Bite-y ORIGINAL POST 3/24/15 athttp://fangswandsandfairydust.com/201...This tale capitalizes on the small town feel of Half-Moon Hollow. And, the closeness of the vampires who live there, or at least this sub-set of them. The closeness is necessary to both solve the mystery and save the damsel. And, of course someone needs saving as there are threats coming from more than one direction.This was probably the longest I have been able to hold off reading one of these books, and that was only because I had a lot of other favorite series books in my queue. This story felt aimed at a new adult audience than the previous crop of stories about Jane, Gabriel, and even Iris and Cal (GiGi sister and brother-in-law) like Miranda Puckett's story (Driving Mr. Dead).The former Roman soldier, Cal always cracks me up and I wish he were real and could design a security system for my house!I have only minor complaints: that the ending felt rushed, and that GiGi makes a fundamentally stupid mistake (actually, she makes several questionable decisions due to inexperience rather than immaturity). But other than that this story left me with the warm and happy fuzzy feelings that make me want to pick up each book immediately and read it through!"}, {"userName": "Anna (Bobs Her Hair)", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/3167458-anna-bobs-her-hair", "userReview": "3.5 - Cute romance, but...I can always count on Molly Harper for light, entertaining chick-litish paranormal romance. Finally, Iris's little sister Gigi is grown-up - well, she's 20 in this story - and she finds the man of her dreams (who has also been stalking her, kissing her, and disappearing). It could be creepy, but the plot thickens when Gigi begins her job at the Council Office. Nik, Gigi's love interest, is sexy and funny. They have chemistry and sexy times. My main problem with this story is intrusiveness of Half-Moon Hollow's near-and-dear residents. It was an inner-struggle not to skim-read Dick Cheney's old story or Jane's turning or 'Colonel Sanders' role in Iris and Cal's romance. While I don't mind re-visiting prior couples, the level of inclusion in Dangers is too much! No Más! This could have been a 4-star book if the writing had remained focused on the hero and heroine and their plot. Oh, well. I still don't understand the title, but maybe 'Rebound' implied something else? Anyway, The Dangers of Dating a Rebound Vampire is still an entertaining story for Harper fans."}, {"userName": "Jen (That's What I'm Talking About)", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/4017411-jen-that-s-what-i-m-talking-about", "userReview": "I can always count on Molly Harper to bring a smile to my face and joy to my soul; her stories are clever and characters always charming. Following the events left hanging in the holiday-themed novella, I’m Dreaming of an Undead Christmas, it is summer and Gigi Scanlon is working at a summer internship with the local Vampire Council. While it is her geek’s heart dream job, filled with off-the-chart perks for Gigi, big sister Iris wants to keep her away from the dangerous vampires and shady council, especially after Gigi is attacked in the parking lot after work. However, Gigi has a secret history with her assailant and knows Nik is under a spell that compels him to attack her. Now she won't rest until she figures out how to break the spell.Although one could probably enjoy The Dangers of Dating a Rebound Vampire as a standalone, I feel the book is more rewarding having read the previous stories. Gigi's world is filled with her quirky vampire extended family, whose bonds have developed over time, starting with the first book. Reading about Half-Moon Hollow and learning about its denizens prior to starting the book makes for a richer, more satisfying read. With that said, I do feel that reading the Christmas novella is critical setup for this book. The romance between Gigi and Nik is fast-paced and a bit steamier than I recall from the earlier titles in the series. And even though things develop quickly between the pair, I'm okay with it because of the light-hearted tone and humorous feel of the book. Their banter is both silly and clever, playing off one another like long-time friends and lovers, which keeps the story moving forward and focused on the going-ons, rather than causing worry over if they will or won’t become a couple.Returning characters add humor and depth to the book. Additionally, new characters, like Gigi’s coworkers, provide dimension and fun to the mix. If you are unfamiliar with the series you may get a bit lost trying to keep straight all of the players and their the crazy antics. For those who are readers of the series, you may be a bit surprised at the actions of some of the characters. I for one, was a little shocked as the events of the story played out.Overall, The Dangers of Dating a Rebound Vampire is a highly entertaining book and a wonderful addition to the Half-Moon Hollow adventures! Filled with outrageous humor, silly mishaps, and marvelous characters who I have come to adore, I devoured the story in nearly one sitting. I found the mystery of what is happening to Nik to be well-executed, and even though the plot was a little obvious, I was still pleasantly surprised. Ms. Harper's titles are completely amusing and delightful, and I highly recommend starting the Half-Moon Hollow series with the first book, The Care and Feeding of Stray Vampires."}, {"userName": "Alana ~ The Book Pimp", "userReviewDate": "Feb 03, 2015", "userURL": "http://www.goodreads.com/user/show/5937988-alana-the-book-pimp", "userReview": "Review to come, because although I listened to this book (with Amanda Ronconi as the narrator, there is really no other way to consume this series. She is an absolute treat of a narrator) ... a little birdy told me to anticipate this book in my April XOXOperts book box. *So that means- bonus- I'll have a physical copy of this book... to keep or for a giveaway? Choices, choices*But... point being, though I am anticipating receiving a free physical copy of this book as a member of XOXOperts, I also will happily give Audible my money each and every time there is a Molly Harper/Amanda Ronconi audio available. That should be a BIG NEON SIGN that my thoughts are honest and not just stroking the metaphorical hand that feeds me.And I sucked it down in less than one day. Slurped it like a parched newly made vampire.Check out my full review on Dark Obsession ChroniclesIt's not my favorite of the series, but it's not my least favorite, either."}, {"userName": "Jacob Proffitt", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/1331641-jacob-proffitt", "userReview": "Gigi is likeable enough, but I really didn't connect with her. I think it's because she was so passive with the creepy Marty. I don't get being susceptible to being \"nice guyed\". Possibly, that's because I'm not really a girl. Still, it seems to me that a \"get out of my face you incompetent, creepy jackwagon\" would have short-circuited about half the story. In a good way. And left room for things that were more interesting. Also, Gigi was a little slow on the uptake occasionally. Not enough so that I was yelling at the novel, or anything, but still.But what dropped this almost into two-star territory was the revision of Ophelia's character. Or what I felt was a revision of Ophelia's character. I always found her creepy, but basically understandable in a cool Machiavellian way. She makes no sense at all in this story. I can't get into details without spoilers, so suffice to say that I'm not a fan of the developments there, even if the knock-on effects may be entertaining later..."}, {"userName": "Diane ~Firefly~", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/3264885-diane-firefly", "userReview": "Gigi is working for the Vampire Council as a programmer and is dealing with a boss who hates her, a co-worker who is incompetent, family who are overprotective and a vampire who either kisses or tries to kill her.The romance was ok. Didn't get much of a feel for Nik and it seems to be a case of love at first sight (or possibly first kiss). But the interaction between all the characters made the read worthwhile."}, {"userName": "Hayat", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/6116230-hayat", "userReview": "Gigi (Iris Scanlon's little sister from the first book of the Half Moon Hallow series) is now all grown up and ready to take on the world. Her sister, Iris and her sister's vampire husband, Cal, are not ready to let her go into the world unprotected but Gigi is fearless, knows how to kick ass thanks to Iris and Cal and she doesn't believe in starting slow. She's about to start her first job working for the vampires and she's also ready to experience the first of many things including romance with a sexy vampire who has a fetish for biting and inconvenient amnesia issues. Another fun light-hearted book by Ms Harper! I Just love the Half Moon Hallow series as it has the perfect mix of light humour, romance, intrigue, the supernatural elements and the fact that I get to see small glimpses of how the previous couples are doing in their respective relationships is a bonus!"}, {"userName": "Sana Zameer", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/23019397-sana-zameer", "userReview": "4.5 StarsGigi is back home and she is working for the Vampire Council. The last time we met Gigi, she was an obnoxious teenager, giving her sister Iris hell about everything. Iris is not happy about her working for the Vampires but the pay is good. And Gigi keeps bumping into a mysterious, blond vampire- Nick who can't seem to decide if he wants to date Gigi or kill her. The rest of the gang was there too and I love these bunch of misfits sooo much!!!"}, {"userName": "Malinda", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/14108764-malinda", "userReview": "4 starsThis was a very good story. I liked Nik and Gigi and their story was interesting and humorous (as is normal for Harper's work). I re-read I'm Dreaming of an Undead Christmas before this and it helped to have the reminder but I almost wish I had also re-read The Care and Feeding of Stray Vampires because there were a lot of references to history. None of it really affected the current story though so rereading book #1 wasn't required.So Gigi is Iris' little sister and she has a summer job (while in college for a computer science degree) working with the Vampire council. Iris isn't happy about this but Gigi won't let Iris and Cal to run her life. Back in December (during I'm Dreaming of an Undead Christmas) Gigi met and connected with a strange vampire but hasn't seen him for months. Not until she's leaving work one night and he attacks her. Things get a bit messy when they realize that he's a friend of Cal's and doesn't remember anything about his attempt to attack Gigi. They soon discover that Nik has been cursed and Gigi is determined to find a way to reverse it. While all this is going on, Gigi also has issues at work since Ophelia is her boss and hates Gigi for erroneous reasons and another co-worker is making inappropriate passes at her (a co-worker that's not Nik). Overall, the story was very good, humorous and interesting enough to keep me engaged. I like the characters as well, both the new and the old. There were a few points that I got little frustrated with Gigi's actions (or inactions) but the story got where it needed to be in the end (with Nik and Gigi starting on a HEA) so I can't really complain. Overall, I enjoyed this story very much and would recommend it. * note - I listened to the audio version of this story and the narrator did a great job.10/22/15 - I just did a reread of this story (during a reread of the whole series). I still liked Gig and Nik very much and really liked their story."}, {"userName": "Ginger Snaps", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/6744622-ginger-snaps", "userReview": "I think it's safe to say I'll read ANY book by Molly Harper. I adored Gigi's story. I loved the wit and humor in the writing and getting to \"see\" all the favorite characters from past books in her vampire \"Jane Jameson\" series (Jane, Dick, Iris, Cal, Gabriel, Jed, Nola, etc.) as they all get together to try to keep Gigi safe in her new employment for the Vampire Council. Not to mention the new male vampire that enters their lives, Nik, who is losing time and acting strangely. LOVED this book!!"}, {"userName": "Jen", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/1074915-jen", "userReview": "Gigi and NikMolly Harper is awesome. So funny and easy to read. Really enjoyed this one. Full review to come on Fiction Vixen Book Reviews"}, {"userName": "Angela (Angel's Guilty Pleasures)", "userReviewDate": "Aug 05, 2014", "userURL": "http://www.goodreads.com/user/show/7742509-angela-angel-s-guilty-pleasures", "userReview": "The Dangers of Dating a Rebound Vampire is book three in the Half-Moon Hollow series by Molly Harper. I can always count on Ms. Harper to bring a smile to my face. What keeps me coming back for more is that I can sit back and enjoy. The stories are always humors and easy to devour.I finished this novel in one day. The funny quotes, numerous pop culture references, and silly things that happen, plus the little mystery kept me entertained and turning those pages. As for Gigi, she shows up in a previous installment, which I didn’t read and now I need to pick up, but here we get her full story. She’s the last human in the circle of friends and when her life is in danger, the group comes together to help. The plot wasn’t deep, but still it was entertaining. I also liked seeing Ophelia get kicked off her high pedestal. The Dangers of Dating a Rebound Vampire was a delight to read. It’s light, sweet, and funny. Rated: 4 Stars"}, {"userName": "Jennifer", "userReviewDate": "Aug 05, 2014", "userURL": "http://www.goodreads.com/user/show/4295616-jennifer", "userReview": "Originally posted at The Book Nympho\n\n\nThe Dangers of Dating a Rebound Vampire\n is the follow-up to the short \nI'm Dreaming of an Undead Christmas\n. First Thought: Seriously any author that can work in references to Daryl Dixon, Soft Kitty, My Little Pony (especially Rainbow Dash) and Dr Who into a paranormal romance it they not sounded forced is an author you should be reading! Gigi aka the human, computer geek: Gigi is the younger sister of Iris from \nThe Care and Feeding of Stray Vampires\n. Gigi was raised in part by Iris after their parents' death. Iris runs a business that works with vampires and now Iris is one herself. So Gigi is no stranger to a life with vampires. In fact being a human has put her in the minority of her little group of friends/family. But Iris doesn't want Gigi to be sucked (no pun intended) into the vampire world. She only wants her little sister to live a normal and safe human life.But Gigi can't get one, Mr. Tall Blonde and Bitey, off her mind ever since that toe curly kiss they shared when she was home for Christmas break from college. And then there's little thing where she accepted an internship with the Vampire Council. Gigi is now neck-deep in the vampire world. Nik aka The Rebound Vamp: Nik is Mr. Tall Blonde and Bitey, he's also Russian and a long time friend of Gigi's bother-in-law, Cal. Oh, and he works for the Vampire Council. And he has a memory issue.Nik is in town working for the council and doing Cal a flavor by watching over Gigi. But Cal doesn't know that Nick has taken a hands on approach to watching Gigi. Narration: I was in a listening slump and team of Molly Harper and Amanda Ronconi brought me out of it. (Like I knew they would.) Really the team of Harper and Ronconi is great for a fast and fun listen. Harper pens the quirky characters with a snarky humor and Ronconi's voice brings them to life no other could. Last Thought: I'm super excited that we are getting other book in the Half-Moon Hollow series, The Single Undead Moms Club, in October!     Take a Listen"}, {"userName": "Tanya Davis", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/5624670-tanya-davis", "userReview": "In The Dangers of Dating a Rebound Vampire, we see more of Gigi. She seems to have matured and grown more. She has set her mind to where she wants to be headed. Gigi has gotten over her boyfriend and is ready to start fresh with her internship. Even if it is under Ophelia Lambert. Gigi is determined to make her life work. Unfortunately the universe has other plans. Iris always made a big deal over Gigi being with vampires, but now it seems Gigi works for the Council. Then to make it worse, there is this vampire that has been following her for ages while she was at school. Gigi finally gets the story out of Cal. Now that Gigi has met this strange vampire, and the lights spark, Cal may be questioning his sanity. Gigi is coming into her own, and as much as Cal and Iris don't like it, Gigi is going to go do what she wants. Even if it is with a vampire who takes some weird episodes. The last thing Iris wanted was for Gigi to fall for a vampire, but she can't protect Gigi from everything.There is quite a bit of mystery and for the longest time I couldn't pull them all together. You kind of feel like they are unrelated until the crap hits the fan and everyone's secrets are revealed. We are left with an awesome ending that opens some doors for the books to come. I'm so excited to see how a certain vampire continues her life from here.The Dangers of Dating a Rebound Vampire was what I expected from Molly Harper. She manages to include romance and mysteries together with a ton of snark and fun. You can't help but settle in and spend a cozy afternoon wrapped in this story. The laughs and the tension will leave you dying for more of Half-Moon Hollow. This review was originally posted on Rantings of a Reading Addict"}, {"userName": "All Things Urban Fantasy", "userReviewDate": "Jul 26, 2014", "userURL": "http://www.goodreads.com/user/show/2732683-all-things-urban-fantasy", "userReview": "Review courtesy of All Things Urban Fantasy.If I'M DREAMING OF AN UNDEAD CHRISTMAS left me wanting more, THE DANGERS OF DATING A REBOUND VAMPIRE definitely did not fulfill that need. With a lackluster romance, a mediocre mystery and generally too many characters to keep track of, THE DANGERS OF DATING A REBOUND VAMPIRE did not live up to the expectations I had for it.The most frustrating part of the book was the romantic aspect. Gigi and Nik's relationship didn't develop naturally, more like they were forced together and decided to make the best of it. While there were some sweet scenes, the general feeling I got was that these two would not necessarily have been together had the circumstances not made it happen.I did love Gigi as a character, though. She was tough and hard-working and for the most part, she made pretty good decisions. She was a strong heroine and I liked reading about her finding somebody. And Nik was sweet and caring, and while not as hunky (in my opinion) as some other Harper heros, he definitely fit the swoon-y romance hero bill.Plus, avid Harper readers will be pleased to know that there are appearances by nearly every character from the Jane Jameson and Half-Moon Hollow series - so many that I almost had a hard time keeping them straight, despite having read all of the books. New readers to the series likely won't be as appreciative, however, as the jokes tend to be inside jokes and a lot of context around various characters is lost without having read the back stories.While I am definitely not ready to give up the Half-Moon Hollow series, THE DANGERS OF DATING A REBOUND VAMPIRE wasn't everything it could have been. I'm looking forward to more Harper, especially the next in the series, THE SINGLE UNDEAD MOM'S CLUB.Sexual content: Several sex scenes"}, {"userName": "Paranormal Romance", "userReviewDate": "Aug 10, 2014", "userURL": "http://www.goodreads.com/user/show/22904875-paranormal-romance", "userReview": "The heroine has finally landed her dream job as a computer tech for the vampire council, against the wishes of her older sister and all their vampire and human friends. There she's reunited with the hero. They've met periodically in the past and each time he planted a hot kiss of her but never actually spoke to her. But now, he has no memory of their past encounters and worse, he blacks out sometimes and attacks her. Funny enough, the man who's her attacker, is hired by her brother in law as her bodyguard. As well, he's hired by the council to look into some shady thieving business in the company. The tone of this whole book is very comical and light and airy. I didn't feel like there was any further depths than that ground level of funny. The heroine is flippant, tosses out sassy pop culture references and absolutely refuses to fear the man who repeatedly attacks her because she's so attracted to him. I kept waiting for her to grow, to take SOMETHING, ANYTHING, seriously but she sort of lived in a bubble. She was so frustratingly easy going and I hate characters who think about doing or saying something but never do. I liked the hero, probably because he was funny and easy going but was able at times to be darker. It was a light read, there wasn't any tension or anticipation between the characters and the fact that every single character was exactly alike made for a boring read. This whole series tends to be more or less a photocopy of each other. The female character is quite literally exactly like every other heroine that came before her. And, every single character in the whole series has to make an appearance in the story and have a say about the heroine's relationship."}, {"userName": "TheGeekyBlogger", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/196094-thegeekyblogger", "userReview": "Listened for Fun (Audible)Overall Rating: 4.00Story Rating: 3.75Character Rating: 4.25Audio Rating: 5.00 (not part of the overall rating)First Thought when Finished: The Dangers of Dating a Rebound Vampire by Molly Harper was fun, smart, and snort worthy--everything I expect from Molly Harper!Overall Thoughts:1: This had a bit of an NA vibe (not my favorite) but I still had fun reading it.2: Side characters FTW!3: Goofy, Sassy, Smart--I love that Molly always makes her leading ladies just downright awesome.4: Computer nerds rule! I am not just saying that because I am one.5: I kind of really want a spin off of the humans living in the town and falling in love with each other. For some reason I think that would be entertaining: you work for a vampire --well I work for a werewolf!Audio Thoughts: Narrated By Amanda Ronconi / Length: 9 hrs and 13 mins / Publisher: Audible Studios Hands down one of my favorite Author/Narrator duos around. If you have not listened to any of the books in any of the series--you need to start now!Part of my Read It, Rate It, File It, DONE! Reviews"}, {"userName": "Melindeeloo", "userReviewDate": "Jun 28, 2014", "userURL": "http://www.goodreads.com/user/show/2766907-melindeeloo", "userReview": "3.5 stars - Molly Harper in audio, read by Amanda Ronconi, is always a winning combo for me and I thoroughly enjoyed The Dangers of Dating a Rebound Vampire. I did have some nits if I stop to think about it though. The biggest is the Gigi's lack of caution around the yummy vamp who keeps zoning out and trying to kill her, attraction over self preservation would normally be a TSTL show stopper for me but really the romance is almost secondary in these and the characters are familiar and fun so I was able to go with it. My other minor nit is the Russian accents didn't work for me - it's a family thing - it occasionally pulled me out of the story, but likely won't bug others who aren't familiar with the accent.Still, I wish there was more Molly Harper for me to listen to - I don't have anything in either her paranormal or checklist left... Maybe it's time for a re-listen:)"}, {"userName": "Vickie", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/11300847-vickie", "userReview": "Another winner with Molly Harper and Amanda Ronconi! The Dangers of Dating a Rebound Vampire is the third book in the Half Moon Hollow series with characters from the Jane Jameson series. Gigi is home from college and is working for the Vampire Council as a computer programmer. She finally meets Nik, an old, old friend of Gigi's uberprotective brother-in-aw Cal. I just loved having so many of the family characters back: Iris, Jane, Dick, Nora...at least they feel like family to me.The audiobook had everything that I have come to expect from the team of Molly Harper and Amanda Ronconi. Quirky characters, fast dialogue, snarky attitudes...they were all there.Go Cards! L1C4!!"}, {"userName": "Isis", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/4725689-isis", "userReview": "I'm so happy I just reread this book. I was in hysterics from laughing so hard!~~~~~I was gifted an early copy of this book by the author (the lovely Molly Harper) in exchange for a full review of the book. That full review will be posted on the actual release date later this month on Whedonopolis.com.For now, I have to say that The Dangers of Dating a Rebound Vampire is yet another fun romp in Half-Moon Hollow! I loved getting to know the story of Gigi and Nik, as well as the debacles Gigi got herself into. While certain parts of the book read a little too close to reality for me, I absolutely enjoyed the way those points in the story were shared. It was also fantastic to finally see a certain vampire get a bit of her much-needed comeuppance. GO GET AND READ THIS BOOK ON MARCH 24TH WHEN IT ARRIVES ON SHELVES!"}, {"userName": "Runningrabbit", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/4727328-runningrabbit", "userReview": "The principal reason this didn't garner 4 stars was that I found areas too ponderous."}, {"userName": "Elaine", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/27213617-elaine", "userReview": "This book is a solid 3.5 stars. An extra star more than I would have otherwise given simply because it made me laugh and I love a book that makes me laugh. I love all of Molly Harpers books. The plot and characters are an absolute riot. I always end her books with a smile on my face. This one had some funny in it but I really didn't feel connected to Gigi and Nik like I did with any of the other characters in other Ms. Harper's books. Their relationship felt rushed. I felt the romance was definitely underdeveloped. There wasn't much there at all before they were all but declaring themselves soulmates. Based on what? Shared lust? I just didn't see it. Also, very little was explained about Nik (physical description or past history). I liked the mystery and how it was solved though.I love the world and the characters and will continue to read books in this series. I just wish there had been more content here."}, {"userName": "Aarann", "userReviewDate": "Aug 04, 2014", "userURL": "http://www.goodreads.com/user/show/5173517-aarann", "userReview": "[Another thing I seriously adored? Harper's digs at the Nice Guy. You know, the guy who thinks because he's not a \"bad boy\" and doesn't have much going for him in the personality department, that by default he is a \"Nice Guy\" and as such is entitled to sleep with the object of his affections and if she isn't interested it's because there is something wrong with her and/or her expectations? Yeah. Those douchenozzles. I'm pretty sure all females have dealt with at least one of these at some point in their lives and they make me RAGEY so it was really lovely at the end to see souped-up-vampire Gigi beat the everlasting fuck out of the alleged Nice Guy, Marty, who had decided that if she didn't have the \"sense\" to love such a Nice Guy, she didn't deserve to live at all. At least I assumed this was all on purpose because Gigi goes into some great rants about the entitlement issues inherent in the self-proclaimed Nice Guy and maybe I'm projecting, but I'm thinking there was some author rage infused in those rants. I think girl rage at all self-proclaimed Nice Guys is fairly universal because, spoiler alert, if you have to tell me you're a Nice Guy... you probably aren't.Ahem. Sorry about the ranty-ness of that. Hot-button issue. (hide spoiler)]"}, {"userName": "Christi Snow", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/715656-christi-snow", "userReview": "My Review:I always know that I can count on Molly Harper's books to keep me smiling and laughing as I read them. And this one was no exception to the rule. In fact, my husband even called me out last night while I was reading it because I was disturbing him with my laughter. ;)This is a fun book. We've kind of seen Gigi grow up in the series and it's so fun to see her come into her own. She's home from college for the summer and is working for the Council...something big sis, Iris, is not exactly thrilled about. Iris and all her vampire friends are more than a little protective of Gigi and no one wants her to end up as a vampire meal. So prior to going to work, she's had a bit of hand to hand combat training. Which is good, because someone does try to kill her on her first day...Nik.Nik just also happens to be the sexy blond vampire that Gigi's been dreaming about ever since she ran into him when she was home from college at Christmastime. The problem...something is wrong with Nik. He enters a fugue state when he attacks her and has no memory of the attacks or even of ever meeting Gigi. That's not exactly flattering to the girl...either the attacks or the forgetfulness. To make matters worse, Nik is also working for the Council. And Gigi's having a few problems settling in with all her co-workers at her new job. If you've liked Molly Harper's writing before, you're going to like this book. The entire cast of characters from the Half-Moon Hollow series and Jane Jamieson series all show up and they are just as nutty and irreverent as ever. Their quips during the group scenes constantly keep me laughing out loud. I love this group of characters and they are even better when they are all together to poke fun at one another. Gigi and Nik fit right in...after the group gets over the fact that Nik keeps trying to kill her. Yeah, there's a few laughs because of that, too. Molly Harper writes with a snarky, fun voice that I love. And I also love that her books are beginning to get just a bit steamier. I like that a little bit of the smexiness is on the page now. It makes the romance side of the story even sweeter and more intense. I liked Nik and Gigi as a couple, but I really just loved Gigi. She's a good person who's had to put up with a lot over her lifetime. She's smart and though she's still young, she's had to grow up and mature a lot. I love her loyalty and understanding with her \"tribe\". She gets that even though they can be a bit much, they simply love her and want to protect her and she understands that and shows much more patience for it.The book was definitely one I would recommend. It easily can be read as a stand-alone,but I do recommend the whole series...not because you need to have read them to enjoy this one, but simply because they are all just that good. I received a complimentary copy of this book in return for an honest review."}, {"userName": "Patti TheLoveJunkee", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/3010365-patti-thelovejunkee", "userReview": "PJV Quickie: I’m pretty sure Molly Harper is my spirit animal. Seriously, I want to be her when I grow up. Or at least be as funny as she is. The Dangers of Dating a Rebound Vampire has us back in Half-Moon Hollow and I am absolutely thrilled to be back!Review:Gladiola “Gigi” Scanlon is Iris Scanlon’s younger sister from The Care and Feeding of Stray Vampires. She’s home from college and has a summer job working for the Vampire Council doing computer programming. Gigi lives with Iris and Iris’ husband, Cal, who are both vampires. Actually, most of the friends in their circle are vampires. But Iris wants Gigi to live a normal human life…one that doesn’t include dating a vampire. Problem is, the one guy she can’t get off her mind happens to be a mysterious hot blonde vampire with whom she shared a searing kiss while she was home for Christmas break. When he shows up again on her first night on the job and tries to attack her, she doesn’t know what to think.Nikolai “Nik” Dragomirov is an old friend of Cal’s, as in, they go back a loooooong time, and is in Half-Moon Hollow doing some work for the Council and Cal. He’s surprised when Gigi identifies him as the vampire who attacked her outside of her job and also the vampire that kissed her over Christmas break, because he has no memory of either event. While he’s working for the Council, he’s seeing a lot of Gigi, and he likes her. So why does he keep attacking her? And why can’t he remember doing it?~~~~~Molly Harper writes such entertaining books; she hooked me at Nice Girls Don’t Have Fangs and I’ve been a fan ever since. In the Half-Moon Hollow series, we’ve got a different group as the main focus but all the characters from her Nice Girls series are here, and it’s always fun to see how they’re doing.I had a lot of fun reading The Dangers of Dating a Rebound Vampire; the characters are hilarious and the snark runs high. Sometimes when I’m reading a book, I’ll think “hurry up and get back to the good parts”, but that didn’t happen here: the story transitions smoothly from Gigi’s job, to her home life, to investigating why Nik is having blackouts. I enjoyed hanging out with Gigi’s co-workers and the characters from previous books, as well as reading alone-time with Nik and Gigi. Seriously, there was no lag time here. I would not recommend reading The Dangers of Dating a Rebound Vampire anywhere where you need to be quiet, you’re going to laugh out loud more than once. The next book, The Single Undead Moms Club, out in October, and I can’t wait!Recommendations:If you like your paranormal romance sexy and funny, I highly recommend Molly Harper’s books. If you’re already a fan, don’t miss this one."}], "description": "In the next book in Molly Harper’s beloved Half Moon Hollow paranormal romance series, Gigi starts her first job (at Vampire Headquarters), gets over her first love, and may even fall for her first vampire!Gigi is no longer an innocent teen. All grown up and looking for love, her family and friends worry she’ll go for the sexy, alluring vampire instead of a nice, safe human. But sexy and alluring, with a penchant for biting, could be just what Gigi wants...", "title": "The Dangers of Dating a Rebound Vampire\n      \n          (Half-Moon Hollow #3)", "url": "https://www.goodreads.com/book/show/22550398.The_Dangers_of_Dating_a_Rebound_Vampire__Half_Moon_Hollow___3_", "average": 4.03, "cover": "https://images.gr-assets.com/books/1427161219l/22550398.jpg", "reviews": 335, "authors": [{"url": "https://www.goodreads.com/author/show/2503028.Molly_Harper", "name": "Molly Harper"}], "type": ["Fantasy", "Paranormal", "Romance", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/22550398-the-dangers-of-dating-a-rebound-vampire", "http://www.goodreads.com/book/show/24926578-the-dangers-of-dating-a-rebound-vampire", "http://www.goodreads.com/book/show/22710209-the-dangers-of-dating-a-rebound-vampire", "http://www.goodreads.com/book/show/5618698-nice-girls-don-t-have-fangs", "http://www.goodreads.com/book/show/8182682-how-to-flirt-with-a-naked-werewolf", "http://www.goodreads.com/book/show/5999242-nice-girls-don-t-date-dead-men", "http://www.goodreads.com/book/show/6329322-nice-girls-don-t-live-forever", "http://www.goodreads.com/book/show/12988478-the-care-and-feeding-of-stray-vampires"]}