{"ratings": 14094, "userreviews": [{"userName": "Dem", "userReviewDate": "Jul 04, 2011", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "The dry grass of August in a really interesting and engaging novel and while a lot of people seem to be comparing it in one way or another to The Help, I am not going to do this as I feel this book needs to be read and enjoyed in its own right. I bought the paperback edition and I love the cover and the quality of this publication and this is is the reason I still love my physical books!The Dry Grass of August takes place in 1954 in Charlotte, North Carolina and tells the story of 13 year old Jubie Watts and the relationship she has with her black maid Mary, and the blatant racism and prejudices that surround her. This is not just a story about race relations in the south but a warm and engaging story about a 13 year old girl’s relationship with her middle class southern family and her love for Mary her second mother the lady who cooked and cleaned and cared for her 3 siblings.I loved the characters in the Dry Grass of August and felt they became so real as the story unfolds. I especially liked the character of Mary and loved her quiet kind but yet strong nature throughout the story. I also loved the complex characters of the jubie’s mother and father and think these characters would make for excellent discussion at the bookclub I attend. There are a lot of issues in this novel and not all of them are addressed by the end of the story, but I liked this as that is the way life works, loose ends don’t always get tied up unfortunately. I also read the author interview at the end of the Novel and was amazed that Anna Jean Mayhew started this book 18 years ago and it took this long to finish it. She also says it was not written for the young adult market but that it would make excellent reading as it would give them a look into history through the eyes of someone their age. This is a very short read, it is a novel that will make you mad and sad."}, {"userName": "Jennifer", "userReviewDate": "Apr 02, 2011", "userURL": "http://www.goodreads.com/user/show/1449407-jennifer", "userReview": "I almost couldn't put down this novel set in the segregated South in the early 1950s--Mayhew's first--and wouldn't have if it weren't for that pesky thing called a job. The story of the summer that 13-year-old June \"Jubie\" Watts comes of age is a breathtaking glimpse into the relationship between a black maid and her white charges. Like the best-selling The Help, Mayhew breaks new ground exploring the dynamics of this relationship. When an unspeakably tragic event occurs, Jubie is forced to follow her own heart about the issue of race and what it means to be a decent human being. Jubie's voice is so authentic that the character echoes Scout Finch, but with preteen hormones! Her parents are not as idealized as Atticus Finch, but rather complicated and deeply flawed. Stell Ann, Jubie's older sister, seems to be a good person but is, at 16, worried about appearances. Jubie's parents are never idealized. Her alcoholic, philandering father is by no means Atticus Finch, and her mother is a deeply flawed being. Still, the novel ends with some hope for Mrs. Watts.It's been a while since a book actually made me cry. Highly recommended for fans of Southern fiction, historical fiction, and even teens who will find a real kinship with Jubie. Oh, and big thanks to my little sis for going through so much trouble to get me a copy of this thing!"}, {"userName": "Jal", "userReviewDate": "Sep 25, 2012", "userURL": "http://www.goodreads.com/user/show/13149361-jal", "userReview": "I thought this was one of the worst books I have ever read. I can appreciate the attempt the author took on, but I feel it was sub standard to be quite blunt. For me, it was like a soap opera. First, this story has been told over and over, and it has been told much better than this one. So, here you go: it has a dysfunctional family, child abuse, childhood emotional neglect, attempted sexual abuse of a house maid, criminal business practices, marital infidelity, substance abuse, racism, racial injustice, to name a few issues. The author did not seem to be able to focus on a central theme, it was all over the place. What was the point of this story I kept asking? Too many stereotypes.  I felt it was a waste of time for me personally, and only completed it because it was chosen as a book group selection. I do not recommend this book needless to say. Read To Kill A Mockingbird for quality writing, expert characterization, and much to think about if you are looking for life in the 50's in the south. If you read it as a teenager, revisit it. Mockingbird is a true classic and will be read over and over. I felt The Dry Grass selection was trite, the characters stereotypical, and the author uses sensationalism throughout the story, and it will not be elevated in a way that Mockingbird has been for years.The author posed too many lackluster, dysfunctional characters. Another great book if you want to know what life was like in the south for black people is Isabelle Wilkerson's \"The Warmth of Other Suns\". Google that book and add it to your list. It is an in depth account about the lives of real black people who migrated north and west from the south. It is a fascinating read, and although non-fiction it reads like a novel. It will elevate you in ways The Dry G of August does not. It provides many topics for discussion and Isabelle Wilkerson is an amazing author. You can get on her website and read an interview with her. The Color Purple, while it has been around for awhile, is another one to seek out and perhaps revisit. Happy Reading!"}, {"userName": "Jennifer Franz", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/558727-jennifer-franz", "userReview": "This book was so good!! The main character is Jubie, a 13 year old girl living in Charlotte, North Carolina in the late 1950s. Two stories are told: one is Jubie's trip down South with her, mother, her siblings and their black maid Mary. The other story is back story, to learn more about their family. Secrets are revealed in the back story that make you understand things happening on the trip much better. Plus, the deep racism of 1950s Florida and Georgia heighten the tension to it's inevitable climax. I literally couldn't put this book down!!"}, {"userName": "Carrie Enders", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/5815186-carrie-enders", "userReview": "I felt this book was a solid three-star read, and it was certainly a quick read. I love the title and the imagery it conjures up. It is beautifully written; and I think if Mayhew's book had come out prior to The Help, I might have given it a higher rating. The topics are very similar in the two books, however, I have to say I did not feel a huge connection between any of the characters in Dry Grass of August. None of them seem to really delve into anything below the surface. The main character suffers some abuse, but never talks about how she FEELS about that. She develops a friendship with an African American boy, but they never discuss why that was taboo during that time period - or how she felt about the fact that she wanted to be friends with this boy, but by society's standards at that time, wasn't allowed to be. Really, the parts I enjoyed most were the descriptions of that era - certain phrases, describing products from that time period. Plus, it takes place in an area near where I grew up, so that made it an interesting read as well."}, {"userName": "Saleh MoonWalker", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/66648866-saleh-moonwalker", "userReview": "Onvan : The Dry Grass of August - Nevisande : Anna Jean Mayhew - ISBN : 758254091 - ISBN13 : 9780758254092 - Dar 289 Safhe - Saal e Chap : 2011"}, {"userName": "Teresa", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "3 and 1/2 stars (I think I'm giving out more 3 and 1/2 stars for what are basically 3-star books, if only to make sure review-readers know that I did like a 3-star book.)I bought this book while I was on vacation in North Carolina last week, as I like to go into the local independents and see what is regionally of interest. This was recommended to me by the owner, who said it was well-written, after she asked me what I liked to read. (Literary fiction was my answer.)Not only is it well-written, but the characters and their development are very well-drawn. It's not only a 'coming-of-age story' for the 13-year-old narrator, but maybe even more so for her mother. It evokes a year (1954) that's before my time, and though I was impressed with all the details of the time period, I feel that maybe there are too many given at some points. The book starts off slow, imbuing you with place and atmosphere (essential to this tale of racism in the South at a volatile time with things on the cusp of change) and becomes somewhat (too?) plot-heavy near the end. But, all in all, a 'good read,' and a quite important one too."}, {"userName": "emily", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/4319857-emily", "userReview": "I picked this up because of the cover. I know the rule is don't judge a book by its cover, but I do. Not always, I mean if it sounds good but has a stupid cover whatever, but I love good looking books. Also titles. I love me a good title. This book, has both of those things, plus, it happens to be a very well written novel. It reminded me a little bit of The Secret Life of Bees mixed with The Help and Divine Secrets of the Ya-Ya Sisterhood. Those are all stories that I liked, and I enjoyed this one as well. The narrator is a 13 year old girl named June Bentley Watts aka: Jubie and she is fantastic. She is smart, caring, thoughtful, observant, all good things. But she also takes a lot in from what she sees and learns from it. Jubie is the second oldest child in a family of five, her older sister Stell (Estelle) is polite, pretty, religious, does most things right, where Jubie does not. Her younger sister Puddin (Carolina) is adorable and sweet, and her toddler brother Davie can do no wrong because he is a baby, but more importantly, he is a boy. Jubie's father seems to single her out in punishments (spankings, beatings etc.) and her mother tends to ignore her children, letting their maid, Mary, take the reins. The novel starts at the beginning of the summer and Jubie and her family (minus her father) are going to stay with their uncle for vacation. Their maid, Mary is coming along. This being 1954 in the south, they run into race issues. But the novel is not about race, its about Jubie and the people in her life. Jubie is an interesting and lovely character to get to know, her world feels very real and the author (first time) really knows her stuff. Its a great read, with a very pretty cover:)"}, {"userName": "Lisa", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/1778821-lisa", "userReview": "If you read and enjoyed \"The Help\", you must read this book! It's part coming of age story about Jubie Watts, a 13 year old North Carolinian and part story about Southerners (white and black) during the early days of civil right movement. Like \"The Help\"'s Mae Moebly, Jubie's mother, Pauly, is distant, leaving her to find love and acceptance from the family's \"girl\", Mary, just as Mae Moebly found love and acceptance from the family maid, Aibileene.Things are not right in the Watts household. Jubie's parents' marriage is foundering, her father drinks too much and is physically abusive. The story switches back and forth between past events within the family and current events during a family trip. Pauly has taken Jubie, her sisters (Stell Ann and Puddin') and baby brother (Davie) as well as Mary to visit her brother in Florida. Traveling through the Deep South during the days of segregation is an eye-opening, dangerous and ultimately life-changing event for the Watts family and Mary.\"The Dry Grass of August\" lacks the humorous elements found in \"The Help\" (the \"beautification\" of Hilly's front lawn with toilets, Minny's \"special\" pie for Hilly, etc.) I suspect it is also a more accurate depiction of the lives of African Americans in mid 20th century South. And, although it is natural to compare this book with \"The Help\" due to a similar setting, it is not a retread of \"The Help\". It is as much a story of Jubie and her family as it is a story of Mary and civil rights in the South.I loved this book."}, {"userName": "Book Concierge", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/1628041-book-concierge", "userReview": "Mayhew’s debut novel is a story of racism in the 1950’s South, a coming-of-age novel, and a look at a family falling apart. Jubie (June Bentley Watts) is our 13-year-old narrator, growing up in an upper-middle-class family in Charlotte NC with her three siblings. Her life, to this point, is centered on family and school; she is aware of change in the world, yet still somewhat sheltered by her age and the adults around her. But a family vacation to visit her Uncle Taylor in Pensacola will open her eyes to tensions within her family and throughout the Southern United States. There are some emotionally gut-wrenching scenes in the book, and Mayhew tries to explore how these events shape Jubie and her family. But she doesn’t succeed. I think Mayhew was trying to include too much and the plot got away from her. The family drama would have been plenty to handle in a novel. The racial tensions of a country facing major change just after Brown v Board of Education would also have fueled a full novel. In trying to incorporate both these significant plots, Mayhew failed to do justice to either one. There are moments of very good writing and I was interested and engaged in the novel, but felt as if I’d missed something by the time I got to the end. It’s a good first effort, but I don’t think it will pass the test of time. Karen White does a very good job on the audio book."}, {"userName": "Cheri Micheletti", "userReviewDate": "Sep 03, 2012", "userURL": "http://www.goodreads.com/user/show/4299211-cheri-micheletti", "userReview": "First--I listened to the audio version, and I thought the narrator was stellar. I think sometimes that can make a huge difference. When I'm undecided about reading a book, I go straight to the panning reviews--for some reason that I haven't bothered to analyze, these are often more helpful (maybe it's just that I'm slightly cynical myself). The first one-star review that I read identified the likely audience, and really nailed me, personally--grew up in the fifties in Missouri, clearly remember the year our school was integrated, and how my new friend automatically went to the back door when she came to my house to play. So closely did I identify with the target reader that I decided to read the book--and I thought it was excellent. Yes, the confluence of secret societies, murder, etc. is unrealistic, but I don't require absolute realism in fiction (if I did it would certainly limit my choices--and realism can be pretty dull). The details were almost always spot-on (only two anachronisms jumped out at me, one of diction, one of dress--not enough to affect my enjoyment). I thought the weaving together of the two arcs was well done, and the main characters were fleshed-out enough to be interesting."}, {"userName": "Kathy ", "userReviewDate": "Apr 14, 2011", "userURL": "http://www.goodreads.com/user/show/971945-kathy", "userReview": "There are novels that should be included in a collection of Southern literature before and during the struggles of the African American to gain basic civil rights in our country, and this novel should be a part of that collection. Each novel that I value as a part of my collection tells a different and important part of that story. To Kill a Mockingbird, Four Spirits, and The Help are three others that I value. As in The Help, this novel focuses on the hard life of being a domestic in the white world, the indignities and dangers that must be dealt with on a daily basis. The relationship between the domestic/caregiver and the children is also explored, with the white parents not always faring so well in comparison. Children are color-blind, class-blind, and belief-blind. They love because they value the worth of all people to be loved, without the realization that there is any other way. Hate is a foreign and unrealized option. That we all could keep this open-heartedness throughout life would result in a world voiced in John Lennon's song \"Imagine.\" The main character in The Dry Grass of August, thirteen-year-old Jubie, and her love for the family maid, Mary Luther, and Mary's love for Jubie is a testament to the undisputed power of that emotion in the face of the evil of prejudice and hate."}, {"userName": "Brittney", "userReviewDate": "Sep 16, 2012", "userURL": "http://www.goodreads.com/user/show/1255984-brittney", "userReview": "It's the 1950's in Charlotte, NC and 13 year old Jubie and her family (minus her father and plus their black maid Mary) are on their way to Florida for a family vacation. On their way, Jubie takes note of increase in segregation and hostilities towards Mary, whom Jubie adores. The trip does not end well, as manifested in the first couple of chapters, the rest of the book being a flash back of incidences that occur to their family down in Florida and on their way back home. I did not like this book at all. The characters fell flat for me, everyone being one dimensional in their personalities. Mary was a saint, the dad was a monster, the mom was a complainer, etc. The book jumped around so much at the end, I didn't know what was the point of all the incidences after they drove through Georgia. It all seemed a bit far fetched that all of those things (funeral, business law suits, suicide, divorce, etc) would happen so closely together and resulting in the conclusion of the book. I was told this book was like \"The Help\", which I loved, and it didn't even come close in my opinion. I don't object to a sad book that deals with tough issues, but I didn't really see the point in this one."}, {"userName": "Val Wilkerson", "userReviewDate": "Apr 19, 2011", "userURL": "http://www.goodreads.com/user/show/157228-val-wilkerson", "userReview": "Written about a family road trip taken in early 1950's, kids crammed in back, along withthe colored girl hired to help with the kids, being turned away from motels because they didn't allow \"colored\". You love the characters and are taken a step back in time."}, {"userName": "Marfita", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/1711341-marfita", "userReview": "Any complaints about this may relate to all popular fiction. Most of the complaints start with the words \"Why on earth ...\" I suppose the point of this book is the many degrees/forms of racism at a turning point in US history, after Brown v. Board of Education. Jubie and her family (minus the father but plus the saintly black maid, Mary) travel from Charlotte, NC to the Florida panhandle to visit Uncle Taylor. We see the indignities of separate and definitely unequal bathrooms, restaurants, and sleeping accommodations that Mary faces. Uncle Taylor's nosy neighbor makes sure Mary doesn't sully the Gulf waters and lower her property values.It's the subtle racism that's more realistic, Jubie's mother buying the smaller Claxton fruitcakes in a shop that won't allow \"coloreds,\" assuming that Mary doesn't have the money to pay for larger ones or perhaps something so luxurious was not for a maid. Mary's self-sacrificing saintliness and the father's panoply of evil habits just don't seem real. There was just something wrong with the other characters making them unlikable. The extra children are ciphers just to add to the workload of Mary and then the mother. I'm sure that individually rape, suicide, auto-theft, child abuse, euphemistically named \"secret\" societies, embezzlement, infidelity occur just the way they do in this novel - it just seems a bit over-the-top that they would all happen at about the same time in the same family. I suppose some people like this Grand Guignol drama in their literature but it leaves me cold (this from an avid mystery reader, by the way). It's definitely a book group book, especially for us older ladies who either lived through the time period or remember the echoes of integration and can nod sagaciously and say \"Oh, yes. That's the way it was,\" and \"Wasn't he awful?\" and \"How thoughtful to commit suicide that way!\"**I actually know a couple where something very similar to this happened."}, {"userName": "Lauren", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/5450723-lauren", "userReview": "Review by Sarah:The Dry Grass of August is Anna Jean Mayhew's debut novel about 1950s southern racism seen through the eyes of a thirteen-year old white girl. When thirteen-year old Jubie Watts embarks on a road trip with her mother, siblings, and the family's black maid named Mary, Jubie witnesses in full effect how racism becomes more prevalent driving from North Carolina to Florida. When tragedy befalls Mary, Jubie is confronted with the rudest awakening to just how horrible and evil the world can be. The Dry Grass of August is well-written and very touching; novels on racism always make my stomach turn with the powers they possess to make us realize just how ugly, corrupted and violent people can be. It's not surprising why young girls like Jubie and her siblings lose their innocence sooner than needed when they witness the people they love being unjustly mistreated and abused. Although written from Jubie's point of view, The Dry Grass of August is not so much a coming-of-age novel as a sharp example and reminder that skin-color is irrelevant and love is all that truly matters. Alongside Jubie we experience her same emotions, her same heartache, and her same compassion. Although I really enjoyed this novel and finished it in a matter of hours, it is very similar to so many other novels of the same nature with the same plot that I found it easily forgettable. Jubie's voice is touching, but passive. The Dry Grass of August has been compared to The Secret Life of Bees (2002) by Sue Monk Kidd, The Help (2009) by Kathryn Stockett and Ellen Foster (1987) by Kaye Gibbons. Having read two out of three of these novels, I'm not so sure I agree with the comparison. Regardless, The Dry Grass of August is an engaging read."}, {"userName": "Augusta Scattergood", "userReviewDate": "Jan 26, 2011", "userURL": "http://www.goodreads.com/user/show/411413-augusta-scattergood", "userReview": "I was sent an ARC of this one by the publisher. Yesterday I started thumbing through. 3 hours later, I was still reading, mesmerized. An authentic look at the South of the 50s, the novel is a truly beautiful, page-turner of a story. The young narrator's voice is perfect, not so innocent that the events around her are missed. But so much of what happened in that part of the country (my home, FYI) was just plain hard to figure out for anyone. What at first glance might seem like another \"Help\" knock-off, is far from it. A lot happens to this family, in deep denial that anything is wrong. A summer trip to the beach has so many layers that more than one, fast read will be necessary. And it's the kind of book I'll look forward to reading more than once. Although some of the events are certainly sensational and remarkable, they are never sensationalized. Just a terrifically told story about race, family, first love and so much more, set in troubling times."}, {"userName": "Cindy", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/365038-cindy", "userReview": "I loved young Jubie; her honor, her courage, her fearless love for Mary. Yes, I enjoyed the character of Jubie! Her mother, not so much; her father, not at all; her older sister; didn't like her so much either! So the book is centered around life in the Carolina's during the 50's and how one young girl survived. It also paints a picture of life for a (white) wife and family during this time and it's not all 'Leave it to Beaver'! I've heard others compare it to \"The Help\". Maybe a little, but I believe this book stands on it's own. I also agree that this book would make a fine movie, and I'm not sure why this hasn't happened! Don't leave it laying on your shelf like I did!! Pick it up and read it now, you won't be disappointed!"}, {"userName": "Alena", "userReviewDate": "Jul 02, 2011", "userURL": "http://www.goodreads.com/user/show/4456042-alena", "userReview": "3.5 stars. Since I love historical fiction and books told from a young narrator's perspective, this book was right up my alley. Jubie is 13 in the summer of 1954, a middle child whose body is rapidly maturing while emotionally she still feels like a little girl. On the surface, her family seems ideal with four children, a successful father, and a beautiful stay-at-home mom. But, of course, under the surface things are not well. The only person who really pays positive attention to Jubie is the family's black maid Mary. If this premise seems somewhat predictable and overdone, it is. But still, Mayhew handles it extremely well and invests most of her characters with multiple layers and a strong dose of humanity.I especially appreciated how Mayhew handles race issues. The family (minus Dad) is travelling south for a summer vacation. The further south they go, the more overt the racism becomes, especially in the post Brown vs. Board of Ed summer. Mayhew writes all levels of racism. Jubie adores Mary and develops a crush on a young black boy, but cannot bring herself to stand up for either character in the face of racist actions. Her mother also wants to do right by Mary but would never consider sharing a bathroom or really becoming friends with the woman raising her children. These kinds of ambiguity are what raise the storytelling.Mayhew has crafted a very dramatic story, given that it all takes place over two weeks. Tragic and horrible things happen to Jubie and to her family. I would say it even crosses the line into melodramatic, but Mayhew is a very good storyteller. By the book's halfway point, I knew I would not be going to bed until I had finished every page."}, {"userName": "Sophia Musgrave", "userReviewDate": "Apr 26, 2011", "userURL": "http://www.goodreads.com/user/show/2084966-sophia-musgrave", "userReview": "What a wonderful book. I loved that it was about the civil rights, although told from the perspective of a young teenage white girl, it had such a gritty feel and brought up several interesting points. No one has ever thought about how the children in the care of a colored nanny feel that I have read a book about. No one talks about the love, the bond these servants formed with the youngest members of the household and I loved that it treated such a sad and hard time of our history with such aplomb. This book is a must read for those interested in the period of the civil rights, in those who can handle the truth of how hard those times were and who want to know more, to understand as the main character in this book, young Jubie does. She is the typical girl on the edge of adolescence, at times still very childlike, but other times her heart and mind leave you amazed. She tells an amazing story of life at that time period, and in her innocent ways brings forth several disturbing truths that get to the core of what makes us human, how we can treat others with dignity and respect and even love those who are different from ourselves. A refreshing and fascinating look into the south and its flaws and the beauty that a young girl's love for her family and her 'girl' that endures despite the circumstances!"}, {"userName": "Ellen Black", "userReviewDate": "Oct 09, 2011", "userURL": "http://www.goodreads.com/user/show/2001979-ellen-black", "userReview": "The Dry Grass of August is Anna Jean Mayhew's first book and it reminded me a lot of the book, The Secret Life of Bees. Dry Grass is well-written, though not as lyrical as Secret Life. However, both books provide a front-row viewing of how white people treated black people in the late '50s/early '60s. Even though Secret Life described a terrible time in American history, because the majority of the main characters were people with incredible souls and personalities, it was an easier book to read than The Dry Grass of August. Most of the main character in Dry Grass are soulless, and this makes the book a painful read. As someone who grew up in the South, during the the Civil Rights movement, and lived in a small town where the whites lived north of the railroad tracks and the blacks lived south of the tracks, literally, Dry Grass took me back to a time that was anything but pleasant. Both The Secret Life of Bees and the Dry Grass of August are told through the eyes of young teenage girls, both of whom experience loss - just in very different ways. However, in Dry Grass, the loss is brutal and fierce, and there is no happy ending."}, {"userName": "Amy", "userReviewDate": "Apr 18, 2011", "userURL": "http://www.goodreads.com/user/show/4840367-amy", "userReview": "Wow, this was a fantastic debut novel by Anna Jean Mayhew. It has been compared to The Help and The Secret Life of Bees. To be honest, I loved The Help but was completely ambivalent about the Secret Life of Bees. I think that happens to me when there is so much hype about a book that my expectations are too high and are never met. But, I digress. The Dry Grass of August is a true coming of age story about 13 year old Jubie Watts whose life is turned upside down by a tragic event that takes place on a family vacation to Florida in 1954. 1954, when racial tension was really high and segregation was being debated by Brown v. the Board of Education. Jubie and her siblings live in Charlotte, North Carolina where things are not as tense as they are in Florida and they are being cared for by the family maid, Mary Luther who is of course black. I'm sure you can guess what the tragic event is that changes the course of Jubie's life. This is a beautifully written novel and I hope to see more by Anna Jean Mayhew."}, {"userName": "Tina", "userReviewDate": "May 16, 2012", "userURL": "http://www.goodreads.com/user/show/5009669-tina", "userReview": "I loved this book! A wonderful debut novel. It is the summer of 1953 and 13 year old \"Jubie\" from Charlotte, North Carolina sets off on a family trip (with their black maid) heading down south to Florida. There are two stories told thru her eyes. One, is the travels down south and the deep rooted racism of the time and things they encounter. The other, is a family story of secrets and lies. If you enjoyed \"The Help\" you will like this book although it is more a \"family\" story."}, {"userName": "Lynn Shurden", "userReviewDate": "Oct 13, 2014", "userURL": "http://www.goodreads.com/user/show/2371612-lynn-shurden", "userReview": "I happened upon this author and her book in our local library and I'm so glad that I did. A novel of coming of age, family and race relations in the South. It could have been the story of many families. Great read and I look forward to more from this talented author."}, {"userName": "Mendy-Sue", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/4723986-mendy-sue", "userReview": "This book is about racism in the 1950s from the perspective of a 13 year caucasian girl named Jubie who starts to question the racism around her during this time.Quick read but definitely a heartwrenching tear jerker. I would definitely recommend this book."}, {"userName": "Diane S ☔", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Very good well written but very sad book."}, {"userName": "thewanderingjew", "userReviewDate": "Apr 25, 2015", "userURL": "http://www.goodreads.com/user/show/2309191-thewanderingjew", "userReview": "The story begins in 1954. The Watts are a fairly comfortable and well respected family living in Charlotte, North Carolina. William Watts stays behind as his wife, Paula, his children Jubie, Stell, Puddin, Davey and the maid, Mary, leave in their Packard and drive off for a vacation at the home of Paula’s brother. As they travel south, 14 year old Jubie (June Watts), becomes more and more aware that the maid, Mary Luther, is not welcome in many places, and actually, although they professed to have separate but equal facilities for whites and blacks, that was definitely far from the truth.However, the trip to the shore goes fairly smoothly. They have a pleasant stay and for diverse reasons, are all sad when it is time to leave. On their return, an automobile accident delays them; from that point on, succeeding events alter the way they live their lives. Racism is an accepted mode of behavior in many places in the south, in those days, and the family is forced to confront it. Each of them deals with the bigotry and its effects in their own way. Often, in those times, and in many places, law enforcement looked askance at the white perpetrators of crimes and ignored the victims when the victims were non-white. The wheels of justice ground very slowly in those instances and remnants of that kind of injustice still exist today in many cities around the United States.The racism exhibited in this story is a bit horrifying, but, nevertheless, it is a pretty fair and honest description of the race relations of that time. The author has perfectly captured the tension that existed between the races, the arrogance of the whites who felt superior and the deference shown by blacks toward them because of their lack of power.In the north, many were naïve and largely ignorant about the behavior of the southern whites toward the blacks. In the north, they did not have separate facilities. There were no signs that said blacks had to board buses last or move to the back, schools and families did not discuss race relations since the prejudice existed beneath the surface. It was much more subtle, but it was alive and well there too. Although the whites for sure had more power and openly displayed their discrimination, there also existed a counterpart of racial bias against whites among the blacks, although it was not as effective because of their lack of power and support. While the Watts family was going through their traumatic situation in Georgia, another debacle was seeding itself in North Carolina, since Mr. Watts was not only a brute and a drunk, he was a racist, somewhat of a womanizer, and honesty was not his strong suit.Jubie describes her father as someone she loves, but also as someone who is abusive and quite rough around the edges. He drinks to excess and seems to make up his own rules as he goes along. Jubie’s mom Paula, was like most women of that time. She deferred to her husband who made the rules, made the decisions, paid the bills and controlled the home and lifestyle; and Paula had a nice lifestyle. She had her own home, a maid, cars, a country club membership and committee meetings to attend. Her husband had his own business which he operated with his brother. She spent her time socializing, paying little attention to what her husband was doing. She simply reaped the benefits of his effort without giving it another thought. In short, she lived a charmed life, never dreaming they would fall from grace.As Jubie relates the story, the timeline moves back and forth to lay the groundwork for what transpires during their travels. There seems to be a fine line between prejudice and tolerance with both sides exhibiting bias toward each other, albeit the white representation is a much more violent one. Jubie is a horse of a different color. She is open-minded and truly loves Mary, regardless of her color. There is mutual respect in their relationship which is warm and accepting. Jubie seems to be brighter and more willing to confront the world than most girls her age would be. She represents the future.The white people of her parent’s generation are portrayed as rather ignorant, selfish, inconsiderate and lacking in faith, worshiping money rather than a higher authority, while black people are law abiding, religious, and loyal, believing in a higher authority, always taking the higher road to the white peoples’ lower one. The older white race is representative of the past.The story is a coming of age story for both Jubie and her mother. Paula must begin to see the world without her rose colored glasses and grow more independent. Jubie must face the frailties of her parents and their generation and mature prematurely. In the short interval in which the story takes place, both mother and daughter are forced to confront issues and deal with them autonomously. Both rise to the task."}, {"userName": "Megan", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/30974881-megan", "userReview": "Listened to this audiobook on several shorter car trips and really enjoyed the story and the main character June. I was sad when it finished, but satisfied with the ending."}, {"userName": "Nancy Narma", "userReviewDate": "Mar 19, 2012", "userURL": "http://www.goodreads.com/user/show/5556257-nancy-narma", "userReview": "“A Riveting, Heart-Wrenching Tale You Won’t Forget”From the very first page, we are introduced to Miss June Bentley Watts; affectionately known as “Jubie”, an “older than her years” thirteen year old who is maturing through the early 1950’s with little to no help from her dysfunctional family. The Watts family unit includes her quick-tempered, abusive Father; Bill, her neglectful, demanding Mother; Paula and three siblings; older Sister, “Stell”, younger Sister, Carolina, better known as “Puddin” and baby Brother; Davey. The Watts family could not function without the loving, hardworking hands of their maid; Mary Luther. Mary is much more than a maid to Jubie. She is a trusted friend, sometimes protector, and confidante as she grows into young womanhood. Family life is complicated by the growing unrest over integration/segregation issues, especially how” Brown vs. the Board of Education “would affect the schools the Watts Sisters attend. As Paula, Mary and the Watts Children set out for Pensacola, Florida for a visit with Paula’s divorced Brother, Taylor (with a fruitcake buying stop in Claxton, Georgia) from their home in Charlotte, North Carolina , little did anyone imagine the trials, tribulations and terror they would encounter! Will Paula face the problems in her life? Especially where Husband, Bill is concerned? Can Jubie come to grips with love found and lost? Ms. Mayhew brings the characters to life so well that you will feel you know them personally. The Drama in this story grips you by the shoulders and won’t release you until you have finished the last page. The author has created a multi-faceted account including a family life which is monetarily comfortable but, sadly, poor in feelings and low on love, accented with courage, profound sadness, denial, infidelity, pride, lies, cheating, growth, duty, trust, responsibility, appreciation and realization. She takes you on this “roller coaster ride”, while touching the topics of alcohol and domestic abuse, racism and suicide with a firm, understanding hand. Above all, Ms. Mayhew had this reader spellbound and experiencing the same gut-wrenching feelings as dear, sweet, courageous and determined Jubie. I implore you to place this wonderful volume on your “To Be Read” list. I have given it five stars and wish I could give it more. Thank-you Ms. Mayhew for your persistence in writing this gem. Here’s hoping there will be others.Nancy Narma"}, {"userName": "Kat", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/822922-kat", "userReview": "Anna Jean Mayhew's The Dry Grass of August takes place in 1954 in Charlotte, North Carolina and tells the story of young Jubie Watts and the close relationship she has with her black maid Mary, despite the blatant racism and prejudices that surround her. This book started out slowly, introducing Jubie's home life: an abusive alcoholic father, an apathetic and out-of-touch mother, and a black maid who serves as her primary caretaker and single resource for affection and love. Mayhew's story meanders for a while, making the reader unsure if there is really a story to be told or if the point of the book is to merely explore the Watts Family's shortcomings, however, half way through the book an unexpected loss, infidelity, corruption, and an underlying current of unease over the outcome of Brown vs. The Board of Education decision upend any sense of normalcy in Jubie's life and propel her story into more of a plot driven narrative. I liked this The Dry Grass of August, I teared up a little at one part in particular, and felt for Jubie. However, some of the opinions expressed by the characters seemed a little too forced, as if Mayhew was simply using them as a venue to express her own opinions. The characters also continually contradicted themselves, Mrs. Watts occasionally sounded self-absorbed and stuck up, then at times defensive of Mary and noble. Jubie's father was abusive, terrifying, and guilty of several other less-than-reputable acts and yet Jubie still seems to vie for his attention... that is when she's not trying to escape his wrath. While I appreciate that Mayhew was likely trying to flesh-out her characters as realistic people who would not be categorized easily as Good or Evil, the personality changes seemed just too drastic for any normal person to go through without a lobotomy."}], "description": "In this beautifully written debut, Anna Jean Mayhew offers a riveting depiction of Southern life in the throes of segregation and what it will mean for a young girl on her way to adulthood and for the woman who means the world to her. On a scorching day in August 1954, thirteen-year-old Jubie Watts leaves Charlotte, North Carolina, with her family for a Florida vacation. Crammed into the Packard along with Jubie are her three siblings, her mother, and the family's black maid, Mary Luther. For as long as Jubie can remember, Mary has been there cooking, cleaning, compensating for her father's rages and her mother's benign neglect, and loving Jubie unconditionally. Bright and curious, Jubie takes note of the anti-integration signs they pass and of the racial tension that builds as they journey further south. But she could never have predicted the shocking turn their trip will take. Now, in the wake of tragedy, Jubie must confront her parents failings and limitations, decide where her own convictions lie, and make the tumultuous leap to independence.Infused with the intensity of a changing time, here is a story of hope, heartbreak, and the love and courage that can transform us from child to adult, wounded to indomitable.", "title": "The Dry Grass of August", "url": "http://www.goodreads.com/book/show/9429531-the-dry-grass-of-august", "average": 3.82, "cover": "https://images.gr-assets.com/books/1327170212l/9429531.jpg", "reviews": 1657, "authors": [{"url": "https://www.goodreads.com/author/show/4388802.Anna_Jean_Mayhew", "name": "Anna Jean Mayhew"}], "type": ["Historical", "Fiction", "American", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/9429531-the-dry-grass-of-august", "http://www.goodreads.com/book/show/10954708-the-dry-grass-of-august", "http://www.goodreads.com/book/show/12867769-the-dry-grass-of-august", "http://www.goodreads.com/book/show/9445762-sensational-south-carolina", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}