{"ratings": 414, "userreviews": [{"userName": "Sophia Triad", "userReviewDate": "Aug 23, 2015", "userURL": "http://www.goodreads.com/user/show/44642860-sophia-triad", "userReview": "Eveything you wanted to know about demons and you were afraid to ask. You will need this book, because Demonica world is really very complicated."}, {"userName": "Siobhan", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/35855553-siobhan", "userReview": "The Demonica Compendium is a quick read for anyone looking for more details about the Demonica world – details about the different species of demon, details about the hospital, and snapshot details of the main characters. However, I don’t think I’m alone when I admit to reading this purely for the short story, The Reckoning.Whilst The Reckoning is only a few pages long, it gives us an insight into the past. Throughout the first three books we received bits and pieces about how the three brothers came together, of the time Wraith was saved from the vampires, and this story finally gives us the insight into the actual events. It’s short, but it finally gives us all we wanted. Certainly worth reading if you’re a fan of the wonderful trio and their brotherly bond."}, {"userName": "Mel", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/3004972-mel", "userReview": "The Demonica Compendium is everything you needed and/or wanted to know about the demons within the Demonica/Lords of Deliverance world. You get characteristics of each different type of demon as well as how they rank on the Ufelskala (evil) scale. The world building is very detailed and there are numerous different demons, making the Demonica/Lords of Deliverance world rather complicated. Complicated world building made The Demonica Compendium a necessity.You also get extras about the main characters and a pronunciation guide for some of the more difficult names. I had problems with pronunciation when I first read the series, so this was very helpful. The way I pronounced Eidolon's name in my head was sooo far off base that it took a bit before I was able to read it the right way. 🤓😂"}, {"userName": "Marianne", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/16417346-marianne", "userReview": "The compendium is helpful, but I mainly read this because of the seminus brother's story, which was good as always, but sad. Poor Wraith. Note: An expanded version of the compendium/encyclopedia part of this book is found in the Apocalypse Lords of Deliverance Compendium."}, {"userName": "Julianna", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/883725-julianna", "userReview": "Reviewed for THC Reviews\nDemonica: A Demon Compendium\n – Although GoodReads has this listed as a separate prequel “book,” as far as I can tell, it was only ever published as bonus content at the back of Passion Unleashed. It’s a short encyclopedic reference which gives a brief introduction to the series, descriptions of each of the various demon breeds that are a part of the stories, background on Underworld General Hospital, and descriptions and stats on each of the main characters of the series up through Passion Unleashed. It’s a nice, informative companion reference to the series thus far. I learned a couple of new things by reading it. And since there’s not really anything included that could be considered spoilers, it might be helpful to readers just starting the series to read this first, which is probably why GoodReads has it listed first. Overall, it was an appreciated addition.\nThe Reckoning\n - “The Reckoning” is an original short story included in the compendium. It takes place about eighty years or so before the main series and tells the story of how Eidolon, Shade, and Roag meet Wraith. They can feel an unknown brother out there and go looking for him, only to find him severely tortured by his mother’s vampire clan and near death. It was interesting to see all the brothers way back in the beginning. Eidolon and Shade have always been great guys and they show that again in this story, making heroic efforts to save Wraith, even though they don’t really even know him. It’s all about family for them, which is why they’re also trying to have a relationship with Roag, who hasn’t yet devolved into the murderous villain that he was in Shade’s book, Desire Unchained. I really enjoyed this little peek into the demon brothers’ early lives."}, {"userName": "C is for **censored**", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/3288566-c-is-for-censored", "userReview": "The star rating given reflects my opinion within ‘the official goodreads rating system’.1 star: Didn’t Like it2 stars: It’s Okay3 stars: Liked it4 stars: Really Liked it5 stars: It Was AmazingI don’t really give a rat-fuck that there are some who think I ‘owe’ an explanation for my opinion. Nope, nada, and not sorry about it.Sometimes I may add notes to explain what my opinions are based on, and sometimes I don’t. I do this for me, on my books, in my library and I don’t ‘owe’ any special snowflakes a thing. Fuck off if you don’t like it and stop reading my shit.Particularly given the ‘modifications’ to reader’s personal content going on (and outright censorship), unless particularly motivated I will not comment in detail. It would help if GR was forthcoming in the new ‘appropriate’ and would make a site-wide announcement delineating the new focus from a reader-centric site to one that is now for authors and selling."}, {"userName": "JustJoi", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/67092094-justjoi", "userReview": "Good way to remind readers of the universe they were reading."}, {"userName": "Anna Serene", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/25871983-anna-serene", "userReview": "2.5 stars = IndifferentThe Reckoning: It was meh. Sort of unnecessary being as we got the story in bits and pieces throughout the other books.The Demonica: Interesting, but probably could have just been used as part of the glossary, and in the FIRST book not the third."}, {"userName": "Heather", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/5173140-heather", "userReview": "This would have been extremely helpful BEFORE you spend 3 books getting everything straight with demons. Wraiths short story really didn't give any thing you hadn't already priced together from the pervious books."}, {"userName": "Andrea Krka", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/15966404-andrea-krka", "userReview": "This is a great Book like a Guide and the Wraiths story is just....I love him even more now.To survive something like that and in the end save everybody and makes some hard choices?Well, I do love him for a reason! :)"}, {"userName": "Greeneyes Belle28", "userReviewDate": "May 06, 2012", "userURL": "http://www.goodreads.com/user/show/2601781-greeneyes-belle28", "userReview": "THE RECKONING - BEFORE THE UNDERGROUND HOSPITAL - WHEN ROAG WENT ROGUE"}, {"userName": "Emma", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/7755067-emma", "userReview": "Whilst the compendium was helpful, my 4 stars was for the short story, The Reckoning."}, {"userName": "Selenity Jade (Coffee Addicts Book Reviews)", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/18394080-selenity-jade-coffee-addicts-book-reviews", "userReview": "I always love compendium books. But I especially loved the short story the Reckoning, even if it did break my heart. It's always interesting to see things from before the start of the series."}, {"userName": "Izy", "userReviewDate": "Apr 07, 2013", "userURL": "http://www.goodreads.com/user/show/3433216-izy", "userReview": "Rating~ 5 stars.This is a very helpful guide to the Demonica Series by Larissa Ione."}, {"userName": "Michelle Tempted By Books", "userReviewDate": "Jun 06, 2012", "userURL": "http://www.goodreads.com/user/show/4183130-michelle-tempted-by-books", "userReview": "Interesting short story about the brothers finding Wraith. Really it just covered everything I already knew from reading. I am not generally a fan of these sort of books, that colors my rating."}, {"userName": "Jennifer☠Pher☠", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/3223175-jennifer-pher", "userReview": "Nice LITTLE back story. Poor Wraith :("}, {"userName": "Claudia Ayala", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/30303080-claudia-ayala", "userReview": "3.0 for the short story \"The Reckoning.\""}], "description": "A compendium of the demons, the hospital, and the key players in the Demonica World.Also contains the short story \"The Reckoning.\"", "title": "The Demonica Compendium\n      \n          (Demonica)", "url": "http://www.goodreads.com/book/show/13636496-the-demonica-compendium", "average": 4.05, "cover": "https://images.gr-assets.com/books/1377083949l/13636496.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/375143.Larissa_Ione", "name": "Larissa Ione"}], "type": ["Romance", "Fantasy", "Paranormal", "Paranormal", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/13636496-the-demonica-compendium", "http://www.goodreads.com/book/show/2679633-pleasure-unbound", "http://www.goodreads.com/book/show/4701550-passion-unleashed", "http://www.goodreads.com/book/show/4497978-desire-unchained", "http://www.goodreads.com/book/show/6660747-ecstasy-unveiled", "http://www.goodreads.com/book/show/7715664-sin-undone", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}