{"ratings": 67382, "userreviews": [{"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "[Did you people seriously think I would willingly chose to read something like this? Are you insane? (hide spoiler)]"}, {"userName": "Katerina", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "“Can there be any greater challenge to London’s Ambitious Mamas than an unmarried duke?” \n\nWell my Mama refused to find me a duke, even though she is desperate to see me settled down (apparently, I am a spinster at the ripe age of 24). In fact, she laughed at the idea, and then started her \"stop reading-start living\" lectures, while arranging to introduce me to the Lady of the Caramel's son, who is \"rich, young and available\"(I think available is her most important quality). Me, well, I ignored her as per usual, and started spinning, following the notes of an imaginary melody, pretending I was dancing with a handsome, sexy and mysterious duke (or prince, I'm not picky).Because that's The Duke and I's major effect; daydreaming.\n\n“There were rules among friends, commandments, really, and the most important one was Thou Shalt Not Lust After Thy Friend's Sister.” \n\nBut Simon Basset couldn't help it. Daphne Bridgerton haunted his dreams, evoking dark fantasies that could not see daylight. There was something about her, something that made him forget who he was and what he was, she was the perfect match for him. She challenged him. But he had taken an oath, and he was determined to keep it. No matter how much he wanted her.Daphne Bridgerton was not a popular debutante. She was witty (perhaps too witty for her own good) , and gentle, but not the kind of woman that would inspire poems and make men go crazy over her. But Simon Basset was different. He made her heart race and her body burn, and when he proposed an arrangement that would benefit them both, Daphne could not refuse. But she also couldn't stop hoping that one day this wonderful man would become hers, body and soul. That she would tear down the walls he was building for years.\n\n“When you smile it takes up half your face.''Simon!' she exclaimed. 'That sounds horrible.''It's enchanting.''Distorted.''Desirable.”\n\nI've been dreaming of balls and gowns since I was a little girl. I still close my eyes and place myself in fairytales, and a part of me whispers that I was born in the wrong century. Julia Quinn satisfied every girly fantasy I've ever had, and then some more. She had a Jane Austen vibe, but added sizzling tension, steam to make you drool, and a not so gentle gentleman (imagine a dirtier Mr. Darcy, with many issues but always eager to please a woman). It was delicious.The Duke and I was a light, entertaining and uttetly addicting novel. Every time I turned its pages, a brand new old world opened before my eyes, sucking me into a society that demanded of women good manners and healthy heirs but gave them nothing in return, a London shocked but mesmerized by Lady Whistledown’s gossip papers, ballrooms full of Ambitious Mamas that became the nightmare of every eligible bachelor, and a loud family whose banters cracked me up. I must admit there were times I wanted to punch Simon for being so stubborn, guided by the hatred towards his father, but I also ached for his difficult childhood and the lack of love and acceptance that marked him. But Daphne knew that she could cure him and fight his demons, I admired her for her persistance and devotion, and I could empathize with her. Simon and Daphne were an explosive couple, that warmed my heart and my cheeks!\n\n“The world seemed somehow different when one was lying down. Darker, more dangerous ... And in that moment, as he slowly closed the distance between them, he became her entire world.” \n\nIn this world, I was a debutante. An innocent girl seduced by a devilishly handsome duke. A woman determined to fight for the man she loved.And I savoured every single moment."}, {"userName": "Laura the Highland Hussy", "userReviewDate": "Jul 18, 2010", "userURL": "http://www.goodreads.com/user/show/2043222-laura-the-highland-hussy", "userReview": "review posted on Got Fiction? Books2.5A lot of my GR buddies love this book, and a few have recommended it to me. So I ordered it, and up until a certain part in the end, I really was enjoying it.I won't feel bad about the spoilers in here, because this is an older book, and a ton of people have read it.I liked Daphne, and I really liked Daphne and Simon's interactions, witty reparte, banter. all of the above. Obviously they were meant for each other, and not in the sickeningly sweet sort of way. They were fun to watch together. I hated Simon's father. Hated him so much. What a bastard. Simon at one point said his father wanted an heir, not a son. So well put. The two of them decided to fake an interest in each other so that all the match-making mamas would leave Simon alone, and Daphne could have better prospects, because with a handsome duke interested in her, suddenly every man finds her lovely. At one point, Daphne has 6 suitors (7 if you count Simon) in one room, and one is reciting poetry (bad poetry) from one knee for her! Too funny, their plan was actually working!But around 200 pages in or so, it all began to lose some of its appeal. Daphne is bossy...no problem there, I'm bossy, totally works for me. But she becomes more arrogant than bossy at one point, and this is right around the part where Daphne's brother catches Simon with his mouth on Daphne's breast. He says \"Marry my sister or else!\" or something as cliched. Simon, who we all have known since moment one, is never going to marry. Simon tells Daphne that, Anthony and Benedick (her brothers) tell Daphne that. But still Daphne feels (even though Simon never claimed any feelings of any sort towards her) that Simon cares enough for her to marry her instead of duel with Anthony. Wrong, Simon would never raise a pistol at his friend Anthony, so he goes in with the assumption that he will die. Daphne says \"I-I've always known that I wasn't the sort of woman men dreamed of, but I never thought anyone would prefer death to marriage with me.\"Wow, that line made me want Simon to explain things to her. He says \"If it could be anyone it would be you.\" which was heartbreaking, but not enough. So, Daphne gets her other brother Colin to take her to the duel so she can scam the duke into marriage-she tells him people saw them in a compromising position and he just has to marry her so she won't be labeled damaged goods. I didn't buy it. yes some folks saw them leave together but it was still manipulating. That is where I began to dislike Daphne. She manipulated him into marriage trying to justify that he might not want to live, but he might live to save her. It made no sense to me. She pressured him for marriage, got it, and they were actually happy for a while, but to me it felt hollow.Daphne found out from the housekeeper what kind of childhood Simon really had, and about his awful father who berated him, then declared him dead to any who would listen, all because Simon stuttered as a boy. ***SPOILERS***Daphne finally understood that when Simon said he couldn't have children, he didn't mean he couldn't father them, but rather that he could never be a father...he wouldn't have children. Her dream of a family was dead.What bugs me here are 2 things:1. She went in knowing no children would result2. When Simon was drunk and aroused and she wouldn't let him pull out. That sobered him up pretty quickly. That whole scene was a mess-she was wrong. Absolutely manipulative and wrong. Simon was absolutely right to be furious. That drunken scene was sweet and touching and funny and then...that. I was so angry because Daphne then rationalized to herself that it's not like she went in thinking \"I'm going to force him to come inside me.\" She did. She said she felt powerful and loved it.And for her to not explain to her family that he was angry because she did something, to let them think Simon was a prick for his boorish behavior, really made me lose a lot of respect for both Daphne and Julia Quinn.Simon was the one who had to apologize-yes he lied, I was mad he never clarified, but good Lord...Daphne just infuriated me.So, the book was good til Daphne became a master manipulator. For her to give Simon ultimatums about no sex until you say we can have children was selfish and pretty messed up of her.The ending was sweet, but not sweet enough for me to forgive the mess Daphne made of Simon's/their life/future."}, {"userName": "Catherine", "userReviewDate": "Mar 09, 2010", "userURL": "http://www.goodreads.com/user/show/3282244-catherine", "userReview": "I never thought that I could have a whole book spoiled for me by one action, but this book proved that I could. What's so irritating about this is that I was enjoying the book. I liked the character's amusing dialogue and the friendship the developed.Things did start to go a bit downhill for me when Daphne chases Simon down at the duel. I don't get the most optimistic feeling when I see someone willing to die rather than marry. I know it wasn't Daphne in particular, but when the hero has so much baggage that death is preferable to his other options I know the road ahead is not going to be smooth. I started to get nervous about how something with that weight would be handled by the author. She has skill but in all the books I've read by her they all seemed very light and not really serious at all. I was willing to go along for the ride though.In some ways I wish I had stopped reading half way through and never got such a bad taste in my mouth. I know that Simon lied by omission in letting Daphne assume he wouldn't have kids because he couldn't have them. But who can really blame him? He was ashamed of how he was when he was a kid. If he would have said he just plain wouldn't have kids she would have demanded to know why and he would have had to explain all his humiliation. Who would willingly do that? She had to maneuver him into marrying her in the first place. He would have rather died in the duel than marry her and be put in that situation! She was even the one that initiated the situation that led to them having to marry! She seems to forget it was all her idea toward the end.I just can't help but think that the whole conflict in this book was manufactured by Daphne. The way the book was written seems to make Simon seem like the bad guy when what she did to him was unforgivable. I was ready for Simon to find someone new after that. I can't believe he came back and actually apologized to her. She tried to take a baby from him by force! I'm sorry I know he was into it, but he was drunk and didn't realized she wouldn't let him pull away at the end. When he realized he started struggling. That right there is force. If a man had done that to a girl there would have been a lot more people upset by it.I know that Daphne made a token statement about being okay with him not wanting kids if it was for the right reason, but I doubt that. She was consumed by the thought of children like she wouldn't have been complete without them. Besides, she may not have agreed with his reasons, but who is she to try and say he doesn't have a right to feel that way?I don't know if I'll read anymore of her. I've read her other Bridgerton books (and decided to finally read the 1st one) and I thought most of them were ok, but this one really disturbed me. I don't know if I want to risk feeling like that again. I read to watch two people fall in love, not to watch someone try to force her husband to impregnate her."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Nov 02, 2008", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "When I read a book, I want to become involved emotionally. A book that does that is more likely to be highly rated. Such was the case with The Duke and I.I have a sickness, an infatuation for tortured, dark, conflicted heroes. The happy-go-lucky guys don't capture my imagination nearly so much as their darker counterparts. Fortunately, Simon was tortured enough to keep me happy.The beginning of this book was brilliantly done. I was already captivated with Simon, the future Duke of Hastings. My heart cried for him. I wanted to see him overcome the obstacles that were unfairly set before him, to become the man he was capable of being. And boy, did he become quite a man.Imagine my surprise, that for all my affinity for Simon, that the star of this story was Daphne? She started out very mild, sweet (typical Regency heroine), not necessarily standing out. But, by the end of this book, I loved her. She was just the woman that Simon needed. He was what she wanted, and she was going to get her man, and wouldn't settle for less than all of him. She had mettle, and she wasn't afraid to challenge Simon to change the future, and to shake free from the chains of the past, which held him prisoner. Perhaps he never would have found true happiness and joy if Daphne had not hammered (gently and not so gently, at times) at the walls around his heart.The event that puts a strain on their marriage could be read in different ways. I like that Ms. Quinn put that scene in. It was a brave move on her part. And there is enough ambiguity there to wonder if there was some culpability on Daphne's part. And it turns around some of those ever-present outcries we often get about sexual dynamics in romance.I liked that Simon had his so-called 'flaw'. I don't tend to care for perfect characters, because I don't enjoy rooting for them nearly so much as the flawed/less-than perfect ones. I loved that Daphne accepted that about him, and thought he was wonderful for overcoming the obstacles he faced, and that she thought he was brilliant. She loved him so much, enough to fight for him, and she did many times. In fact, I'd call Daphne the Knight in Shining Armor of this book. Go, Daphne!What was underwhelming about this book? Well, I thought some of the humor aspects were a bit off. I couldn't find the balance between humor and angst. On the plus side, I did like the family dynamics, and the humor they brought to the situation. Those were some of my favorite humorous moments. I liked very much that Daphne's family were useful weapons in her arsenal to win her fair prince. Simon had never felt the loving bonds of family. He was captivated by the Bridgerton family dynamics, good and bad. I must say that Anthony annoyed the crap out of me. He was a bit of a hypocrit. I think that he forgot that Simon was a man he respected, and that he cared about his best friend. When he saw that Simon and Daphne had an attraction to each other, Simon became his enemy. He refused to believe that Simon could be honorable. I know what you're saying. I realize that Anthony took his responsiblity to protect his sister seriously. But, if Simon could look at the situation from Anthony's vantage point, I would hope that Anthony would try to do the same. I didn't see him doing that. I do have to say that I really admired how well Daphne stood up to her over-protective brothers, especially when they tried to interfere in her marriage. She put her foot down, and she needed to, or that wouldn't even stop, for as long as she was married.  The other thing that bothered me about this book was that at times, it seemed to lapse into a modern voice. I know I shouldn't be so picky, but that's a rather large pet peeve of mine. However, I do have to say that for the most part, Ms. Quinn does the Regency period very well.I thought this was a good book, and probably my second favorite novel by Julia Quinn, after To Sir Phillip with Love. I don't go for the lighter Regencies that much, but this had enough angst in it to keep me pretty happy. Although I read it for a challenge, and to get it off my tbr pile, where it had been languishing for several years, I ended up reading it very quickly, and I enjoyed it very much.Overall rating: 4.25/5.0 stars."}, {"userName": "NiCoLeTa E.", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/37314676-nicoleta-e", "userReview": "***4,5 lovely stars from me***\nThe Bridgertons are a really crazy, but wonderfull family!!!I really had a great time...This book was funny, interesting and i couldn't put it down!!!The only reason that i put 4,5 stars was because i was torn between and 4 and 5... and that's because even though that it was a really great story, somewhere before the middle had a really slow pace for my taste!!!Well, well, well...I have to tell you that the Bridgerton family aparts from nine members...The mother and her eight childern!!! God help her!!!Four boys and four girls...And each one's name started by each letter of the alphabet in the right order as they were born... A,B,C,D...And i stopped in D because in this book the main heroine was the fourth children, Daphne who also happened to be the oldest from the girls...Well, Daphne was young, intelligent, spiritual, funny, charming and very kind.She wasn't very beautiful and that's why after two seasons as a wallflower she didn't have find the right one man to become her husband...The men usually found her very easy to be friends but nothing more, except one or two that they weren't what she was looking for to a husband...She wanted to get married and she wanted to have her own children... She wanted a big family like her own... A big, loving family that you could count on it!!!Simon Basset recently became the Duke of Hastings.He was a beautiful, clever young man who seemed a little bit arrogant and icy...His life wasn't easy, but he managed to succeed in everything that he had put on his mind.When he was a little boy he had some problems that guided all the rest of his life...His stubborness made him get over his old problem but he never get over the disaproval that he felt from his own father...And at this moment, he had reached the point that he made an oath to do not ever get married or to have children...After many years away travelling, Simon returned back to London and as a Duke he had to join the society!!!An unexpected fact brought in his path Daphne and he mesmerized by her, until he discovered that she was a Bridgerton.You see, her older brother was one of his greatest friends and there is an unwritten rule that you can not flirt with your best friend's sister...But Simon faces one big problem that forced him to make an unusual proposal to Daphne... All the unmarried girls and their mother's are drown from his title...So he and Daphne agreed to pretend that between them there is something more for the benefit of both of them... Simon will get ride all those girls and their mothers and Daphne will have more suitors when they will see her with him...But somewhere the plan started to change course since both of them started feel something for each other...I really liked this story...I laughed so much and i had a really good time...Daphne was adorable and so strong... I liked the way that she approached Simon...And i liked Simon... As a child was so cute and my heart was aching for him...But as a young man, he was stunning, but also very stubborn like a mule...I also liked the man that he became everytime that he was near to Daphne....As for the rest of the Bridgertons??? They were delightfull, but i will spoke for each one of them in their own books...And it's Anthony's turn, who made Simon's life miserable... Hahaha... Karma is a bitch, mister!!!I can not wait!!!Oh!!! I forgot!!!I am so curious about this Lady Whistledown... Who the hell is she???"}, {"userName": "Heather K (dentist in my spare time)", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/13070326-heather-k-dentist-in-my-spare-time", "userReview": "Disappointed. Actually, disappointed doesn't even begin to describe it.*Unpopular opinion time*Once upon a time, I wasn't into historical romance. I thought they were silly and anti-women, and I wasn't even interested in trying them. Thankfully, I discovered historical romances by Tessa Dare and Courtney Milan, and I fell head over heels for the genre. I'm thanking my lucky stars that I didn't try this book first because I fear I would have never read the genre again. I've been meaning to try this series for some time now. I've read Julia Quinn before, and I really liked Because of Miss Bridgerton. EVERYONE has told me to try the original Bridgerton series, starting with The Duke and I. So, of course, I decided to take the series on, and I even bought the next couple of books following the first. However, I'm absolutely flummoxed by the love for this book. Daphne Bridgerton was the worst heroine that I've read in a long time. She is meant to be strong and spunky, but I thought that she was self-serving and TSTL. I actually hated her. She manipulated poor Simon every step of the way. She forced him to befriend her, she forced him to marry her, and forced him in other ways that found absolutely morally reprehensible. She was vile, truly, and thought herself to be entirely blameless throughout the story. Simon didn't quite make sense either. He had a rakish reputations, one that I didn't see any evidence of in the story, and had a twisted mentality about his situation. He was self-pitying and broody, and though I didn't like him, I thought he got the short end of the stick being stuck with Daphne. To top it off, the book was way too long, and it took me ages to finish the audiobook. I wasn't motivated to keep listening, even with a flawless narration from Rosalyn Landor, who did her very best to add personality and sympathy for these odious characters. I know, a very unpopular opinion, but this book only gets as high as 2-stars because of the narration. Otherwise, it would be in 1-star territory."}, {"userName": "Literary Ames {Against GR Censorship}", "userReviewDate": "Jun 14, 2012", "userURL": "http://www.goodreads.com/user/show/2109885-literary-ames-against-gr-censorship", "userReview": "It's okay to rape your husband. (Source: Chapter 18 onwards.)Up until this chapter The Duke and I was on the road to four stars. Four and not five because of:➜ Anthony's behaviour after witnessing his friend's mouth on his sister's chest in the garden of a house party, challenging his FRIEND to a duel after Simon refused to marry Daphne on the grounds it would make her unhappy because he couldn't give her what she'd always wanted i.e. children and therefore happiness. If Simon really was a friend, Anthony would've asked more questions about the why and been more tenacious in getting an accurate answer instead of jumping into a duel where he'd be forced to kill his friend;➜ The following duel scene the next morning when Daphne outright lies to Simon about others, besides Anthony, witnessing their intimate act to prevent Simon from being killed in the duel and to force him to marry her, followed by Simon omitting the fact he won't have children and instead says he 'can't' have them so he doesn't have to tell her his very personal reason why.I swallowed these things hoping it would come out later and they'd forgive each other in the end.What I was not expecting was Daphne's grotesque arrogance and selfishness in taking advantage of her drunk husband after she found out the truth, denying him sex and companionship, and not allowing him to pull out during sex so she could have the children she'd always wanted. They'd been MARRIED TWO WEEKS, there was plenty of time to discuss his problems, his worries, about even contemplating children and instead she takes the choice from him against his will as he struggles with her once he realises her intentions. After what Simon's father did to him Daphne's behaviour is even worse because she knew about Simon's stuttering and his father's abandonment of Simon because of this. And then two months after Simon leaves her he finds he misses her and he CAN'T REMEMBER WHY HE LEFT IN THE FIRST PLACE, thereby excusing any wrongdoing on her part. But not only that, Daphne sends her angry brother after Simon without telling him she was the reason Simon left and not Simon himself. So, four stars to one. If the gender roles had been reversed I'd expect more people would've been outraged at the rape. Completely ruined a perfectly good book, and my first, and possibly the last, by Julia Quinn."}, {"userName": "Liz* Fashionably Late", "userReviewDate": "Aug 11, 2014", "userURL": "http://www.goodreads.com/user/show/8191214-liz-fashionably-late", "userReview": "I don't wanna be that guy but let Aunty Liz tell you a spoilerish story! gather 'round, dear children:A loving husband, very much in love, is eager to start a family but his wife is not mentally ready yet. She's been through a lot so she asks him to wait. She needs time to heal. That night, the wife enters the bedroom a little drunk. Yeah, she's been drinking, my children, don't drive if you're drinking. Anyways, the wife is very drunk so she goes to sleep. Suddenly, the husband lures her with kisses and more. He wants her and she, drunk and sleepy, won't say no. Sexy times, sexy times, he goes for it, sexy times. Once she is completely awake and realizes what he's doing, she tries to stop it BUT he's enjoying it too much to stop. She asks him to stop but at the same time she's doesn't want him to do it because some physical needs are, sometimes, stronger than will itself. Everything finishes in a bittersweet note and the wife, angry with her husband for using this weak moment against her, leaves the room. AAAAAND THAT'S HOW BABIES ARE MADE.Cute, sweet, LOVELY STORY? I don't think so... gender roles reversed and there you have it, The Duke and I. Show me the way, lord, because I am about to kill someone.Oh, I'm getting there. I could say so much about this book. I'd love to talk about the sassiness of the MC and how lovely her relationship with the brothers was. I'd be happy to say kudos to the author for the witty dialogues and charming characters.I'd love to talk about the banter between her and Simon and how hard I was shipping them. But everything good about this book was lost after terrible and WRONG choices. Daphne turned into a manipulative and selfish prat, Simon a possessive jerk and Anthony... ugh, don't get me started.I'm that guy, apparently. Everybody and their mothers are loving this book and I'm here thinking how on earth this book went from 5 stars to 2 in just a few chapters. I'm not sure if I'll continue with the series but I think I'll try to read something from the author in the future."}, {"userName": "Shawna", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/1802746-shawna", "userReview": "5 stars – Historical/Regency RomanceMy introduction to author Julia Quinn was with the books The Lost Duke of Wyndham and Mr. Cavendish, I Presume, and I wasn’t at all impressed and found them really boring. Several GR friends told me they aren’t her best books or indicative of her other works and that I should give her popular Bridgertons series a chance. I’ve had several of JQ’s books on my TBR shelf for quite a while now, and after mourning the end of two of my favorite HR series, Lisa Kleypas’s beloved Hathaways and Gaelen Foley’s Knight Miscellany, I was looking for another series centered around a family.After hearing such great things about this series from so many trusted GR friends (and also knowing that several of them are on AAR’s Top 100 Romances of 2007 list), I decided to finally read the first book in the Bridgertons series, The Duke and I. And boy oh boy am I ever so glad that I did because it was absolutely delightful!I was worried that it might be a little bit too light and fluffy for my taste; and although there are several humorous moments (I can easily see why JQ is famous for her clever wit!), there are also deeper, emotional elements to the story as well. I loved steadfast, spitfire Daphne and gruff, tormented Simon, and they made such a fun, sweet, endearing couple. They had some wacky and serious obstacles to overcome to be together, but in the end, their HEA left a big ole happy smile on my face. I didn’t feel as strong of a connection to the characters or experience the same lust and love for the hero as I do with every Lisa Kleypas book, and I would have liked a bit (okay, a lot) more steam in the love scenes. But it was still a highly enjoyable, thoroughly romantic story, and I’m looking forward to reading more Bridgertons! 5 stars!"}, {"userName": "Catarina", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/11538033-catarina", "userReview": "[Yes, and with the cutest epilogue. (hide spoiler)]"}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "\"Save your pathetic words,\" Anthony spat. \"I'll see you at dawn.\"\n\nPlease let there be a duel. Pleeeeaaasssse let there be a duel.One sec, flipping the page. *pause* Damn...no duel.\n\n\"I've always known that I wasn't the sort of woman men dream of, but I never thought anyone would prefer death to marriage with me.\"\n\n3.5 stars. I would have definitely gone for a solid 4 star had there been a duel. What a missed opportunity that was! There are more brothers in this family; it wouldn't have been a big deal to off one of them.So, I am no longer a Quinn virgin. The seduction is complete. Gonna take a sec and stub out this \"we made it official\" cigarette so I can write my review.Summary in a sentence : A duke who was abused and shunned in his childhood because of a speech impediment grows up to be a handsome young man that pushes away the one woman who sees him for more than what his father made him out to be.Truth be told, I wasn't a fan of the first half of this book. The banter was lackluster, the sexual tension was almost nonexistent, and not a whole lot really happened.Who knew that a failed duel scene would be the turning point of the story? I have no idea what happened, but once Daphne rode in on her horse, ready to throw herself in the way if necessary in order to stop her brother and the man she loved from shooting themselves, it was as if life had suddenly been breathed into the dying tale. From there on out, it became fun. All of a sudden, Daphne and Simon were actually worth reading about.I liked seeing a few reminders of other series I've enjoyed in the past. The Bridgertons came along before series like The Hathaways and The Luxe but since I read the latter 2 series beforehand, I had a smile on my face when I noticed the \"gossip column\" segments as chapter headers (Luxe), then later couldn't help but get excited over the possibilities of seeing what's to come in the future for the siblings of the main character (Hathaways). I especially can't wait for Colin's story. He sounds like the fun and careless rake : Colin's one-shoulder shrug matched his lopsided smile to perfection. The mother is also a riot. Her dialogue in the scene where she's explaining to her daughter what happens on the wedding night was priceless.Addressing the somewhat controversial scene... Okay, so I'd seen mention of a scene in this book which might raise an eyebrow for some people. I understand that had the roles been reversed, it would have been an extremely difficult scene to read. I don't mean to fall into the category of double standards because I do agree that the manipulation was extremely wrong. It just didn't anger me the way it did others. She made a bad choice in the moment and did end up having to pay for it to some extent, so at least she was partially held responsible for her actions. Sexy time was eventually sexy. The steam factor wasn't off the charts and it took a while before I even felt the heat between this couple but it got there at some point.\n\nAs his hands moved to his trousers, he saw that she was pulling the bedsheets over her. \"Don't,\" he said, barely recognizing his own voice. Her eyes met his and he said, \"I'll be your blanket.\"\n\nOverall, this was a nice read. Not my favorite historical romance, but still an endearing love story when everything came together.\n\n\"Simon, she pleaded, \"save me.\"And he was lost."}, {"userName": "Phrynne", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Written in the same vein as Georgette Heyer - not quite as good but still very entertaining! I must admit I raced through it because, although these books always have happy endings, it was hard at times to see how one was going to be achieved! Daphne and Simon were an attractive couple, the three brothers were hilarious and the Bridgerton family as a whole were charming. There was lots of humorous banter and some real laugh aloud moments. It was a nice, easy read for a Sunday afternoon and I will be looking out for more by this author."}, {"userName": "Manju", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/11166121-manju", "userReview": "3.5*"}, {"userName": "Seffra", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/4725020-seffra", "userReview": "So this book went from 4 stars to a 2 stars...Where to begin....OH THERE ARE MANY SPOILERS IN THIS RANT..ERM, I MEAN REVIEW...I really enjoyed this beginning of this book. I liked Simon and I seriously felt for him. He had a horrible father who ignored his existence because of he stuttered... Poor, poor Simon...Then we have the little chit who to be known as our heroine....her name is Daphne... we will not dwell on her attributes since she was a poor excuse for a female character. Instead, we will spend time on her dumb actions in this book.K....so I liked her a bit in the beginning before her character was revealed. She was fresh and unique. She had 3 (or was it 4?) older brothers from which she learnt the ways of men and rakes...well according to her....She claimed to be all knowledgeable when it came to the opposite sex...but she was actually a complete dimwit.Anyways....moving on...So Simon must make the decision if he wanted to marry her or die by the hands of her brother, Anthony. He chooses the death option...Only nope, DING, DING, DING! You got it, Daphne comes in between the duel and practically forces him to marry her because her reputation was ruined... I get it, she did in fact 'love' him but that's besides the point that he NEVER wanted to marry...but I decided to let this go for I knew he would fall in love with her...Then here comes the big whammy I will NEVER FORGIVE THIS POOR EXCUSE OF A WOMAN FOR...Simon NEVER EVER wanted kids because of his bad experiences and he never wanted his father to 'win'. He tells Daphne he CAN'T have children not that he WON'T, she finds out...blahhh, blahh, blaaahhh.....The guy comes home drunk one night and she comes up with this \"brilliant\" idea to have sex with him while he's still drunk. So she arouses him in his sleep and then hops on him. Once he comes to his senses and still is a little bit drowsy from the alcohol, he tries to push her off but he couldn't since she held on with all her strength. So he finished inside her which was against his wishes. I WILL NEVER FORGIVE HER BECAUSE SHE BASICALLY RAPES SIMON AND THEN DOESN'T THINK SHE DID ANYTHING WRONG...She never learnt that she made such a horrible mistake. She thought of only herself and her dreams of wanting a baby. What in the actual heck..???...She is such a big manipulator that I can't even...form coherent thoughts about her...I feel like I'l go on a swearing rampage ....I know this is more a rant than review but I needed to get it all out there.... I will read the second one because it was recommended to me by a good friend, plus, I did enjoy the writing just not the female character."}, {"userName": "Chan", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/48867675-chan", "userReview": "Once upon a time in a make believe world...\nJane: I love you, but I can’t marry you. I can’t have children and I want you to be happy. John: We were seen kissing. If we don’t marry, they shall literally burn you at the stake. Please marry me, Jane.Jane: Only if you understand that I cannot have children because I know how badly you want them.John: I understand.Jane: Okay. I’ll marry you.\nA few weeks later...\nJohn: Why do you have birth control pills?Jane: To prevent pregnancy.John: I thought you couldn’t have kids.Jane: Something horrific happened in my childhood. It scarred me for life and I will not have children.John: You lied to me.Jane: I’ve been in therapy and on antidepressants for 15 years to deal with my childhood. I’m not having children. \nTwo months later...\nJane: *Screaming* I’m pregnant. How did this happen? When I was on antibiotics you wore condoms.John: I poked holes in them because I want a child********************************************My Dear GR Friends, how does this make you feel? How on earth can this guy take advantage of a woman like this? It’s her body and stuff, right? He needs to respect her wishes?This is kind of what happens in The Duke and I, but it’s the female who wants kids. We sometimes forget that men have rights too. Men are allowed to say NO and women need to respect that. This book was really good up until Daphne disrespected Simon’s wishes and didn’t even have the decency to apologize. Then she was shocked when he left. She also allowed her family to think he was mistreating her.I will probably continue with the series because the Bridgerton brood is interesting, but I need a break first. I didn't like what Daphne did."}, {"userName": "Zairobe25", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/37373251-zairobe25", "userReview": "Me encantó, no se porqué no había leído esta serie y esta autora, no sabía lo que me perdía, me encantaron Daphne y Simón, y por supuesto todo el combo de Bridgertons!"}, {"userName": "Rane", "userReviewDate": "Jun 01, 2009", "userURL": "http://www.goodreads.com/user/show/1987431-rane", "userReview": "Ah my Gentle Reader, this Reviewer is pleased to report, that one cannot argue against; I loved this book. It was fun to read about Simon and Daphne finding each other through angry brothers, duels, crazy marriage mind mamas and a few misunderstandings along the way. The banter between the was laugh out loud funny as were some of the arguments . Simon was a great hero, dealing with his past and the treatment his father dealt him at such an early age, making it his goal in life to prove his father wrong over and over again. Not seeing the fact that while proving his dead father wrong was just proving his father was right and making him unhappy in the process.  Daphne was a strong lead for Simon and a strong lady (no really, she got one hellva punch!) While not having the harsh treatment that Simon did, she does have her own battles to fight between her family and Simon. Yet, she always manages to keep a happy and thoughtful outlook on life and look at things on the bright side of life.  Together both make a wonderful and funny couple whom bring out the best in each other even with crazy family members around them trying to rule them over. I really adore Daphne family, her brothers were a hoot but her Mom was the best, bringing all her sons to order with a few choice words or a yank of a ear. And a cute running mystery of who the infamous Ms. Whistledown truly is.  Overall: a great and fun read with a lots of laughs and a lot of love!"}, {"userName": "Alba M. ", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/51436903-alba-m", "userReview": "En realidad lo acabé ayer a las 2 de la madrugada PORQUE NO PODÍA SOLTARLO!!!! Me enamoré como una tonta de Simon... me encantó el epílogo pero necesitaba más. El único momento que no me gustó fue cuando entre Daphne y Simon se hicieron daño mutuamente... llevaban con un tira y afloja todo el libro y cuando por fin parecía que iba bien ZAS! Aún así no me arrepiento de haberlo leído fue precioso <3"}, {"userName": "[Aengell]", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/7221205-aengell", "userReview": "4.5 stars\nWhat a great introduction to an understandably beloved and well-praised series!I won't say anything on the plot, since 90% of my friends here on Goodreads have read this series, but this is the story about Daphne Bridgerton and Simon Basset, the Duke of Hastings. This couple though. Their little scheme, which covers about the first half of the novel, was funny and entertaining, and it left room enough for the little quirks of the Bridgertons to be shown. Julia Quinn, as I have experienced many times now, takes the time to make Simon and Daphne learn about each other. For Simon to get to know this crazy-as-hell family and everything that makes them so full of life and banter and for Daphne to get a picture of the person Simon is. Simon is one of those heroes that are round-up-perfect in every way, even with his faults. He is tortured, brooding, and tends to impress people as the arrogant duke. But he was so sweet sometimes, too. The scene where he gave Daphne's mother a bouquet of flowers? I fell in love right along with Daphne. She describes him better than I could have: \n\"You might just be a nice person after all\" \"I'm hardly nice\", he scoffed. \"Perhaps, but you're hardly cruel, either.\"\nI loved Daphne. She is dependable, down-to-earth, funny, kind of laid-back and overall simply made for Simon. I loved her sometimes quit, sometimes not so quiet strength. It's not everyday that an HR-author succeeds in creating an enticing and 3D-heroine when said heroine is merely a debutante. I appreciate that and I'm probably in the minority but I don't think every heroine in this genre has to be widowed or a spinster or a world-traveling exotic to be interesting.The other Bridgertons were introduced in the funniest way, and although I didn't get a singular impression of the sisters, I loved the mother, Violet, right away, and the brothers were exactly like older brothers should be. Benedict wasn't introduced as much as Anthony and Colin, so of course I'm the most curious about him. But honestly, I'm curious about every member of this family. The second half of the novel became more angsty and dramatic, and all the conflicts that were just scratched on the surface in the first half were opened like a book full of secrets and emotions. I've read many Julia Quinn books and this was the first were the angst was really in the foreground. Simon's issues with his stutter and his hatred for his late (and quite tyrannic) father were issues that left a cleft between his relationship with Daphne. I didn't mind that change, and although I found Daphne's way of dealing with the one big conflict between her and Simon rather strange and weirdly random, it didn't bother me enough to reduce my rating a with a full star. Simon was so endearing with his fear and anxiety, but heart-breaking, too, and Daphne was just right for him, she was strong but open and honest about her feelings to herself and to Simon, too.\n\"This was nice,\" she said, placing her hand on his. \"Almost like it used to be, don't you think?\"He nodded, turning his hand palm up so that he could clasp hers. \"It will be like this again, won't it?\" Her eyes showed a flicker of trepidation. \"We'll go back to the way it was, won't we? Everything will be exactly the same.\"\nA great, great, read and seeing that I'm probably the last one to start this series, I must say that some things are worth the wait!"}, {"userName": "~**Anna**~ A Romance Reader", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/61292418-anna-a-romance-reader", "userReview": "I loved it! I deducted one star for what Daphne did that I didn’t think was right, but I still enjoyed Simon and Daphne’s relationship so much! You can feel how much they love each other. Overall this book is a great Historical Romance that I highly recommend."}, {"userName": "Maria Sol", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/21424508-maria-sol", "userReview": "Primer libro que leo de esta autora y me gustó muchisimo!!Toda la familia Bridgerton es encantadora, divertida y en este caso Daphne y Simon me contaron una historia que me gustó mucho, me resultó super divertida, amena, ágil, romántica y entretenida. Sin lugar a dudas seguiré conociendo a esta amplia familia y sus locuras."}, {"userName": "Quinn", "userReviewDate": "Sep 03, 2010", "userURL": "http://www.goodreads.com/user/show/2310262-quinn", "userReview": "Wow. Way to ruin the book.I’m usually up for morally ambiguous characters and controversial subjects in my books. I like being surprised. I’m not a black or white kind of person – I live and think in the grey almost always.But there are some things that are just plain wrong, no matter how you slice it.I’ve deliberately avoided this author, hearing the words “light and fluffy” far too often in association with her books. My preference is generally closer to “dark and angsty”, so I just figured she wouldn’t work so well for me.Imagine my surprise to find myself quite enjoying this book. I actually liked the writing style, and it wasn’t at all too light or fluffy for me. I enjoyed the banter between the characters and there was sufficient development and gravitas to keep me satisfied.In fact, this was shaping up to be a 4-star read and on a par with a lot of the other popular Regency romances out there. While it was never going to be a standout favourite, it was still a positive experience.And then page 314 happened. That one act, for me, made a mockery of everything that had gone before. It was unforgivable and completely discounted the possibility that Daphne was in any way actually really in love with Simon. So what was the point of everything that had led to that point? It’s almost like the reader had been seriously misled or lied to.Lied to about the kind of person Daphne was, and lied to about the extent of her feelings toward Simon. It just seemed completely out of character for Daphne - although to think on it, we did see hints in the pages leading to that incident that showed she didn’t quite have the depth of character we were led to believe.I’m not suggesting Simon was perfect, far from it. But while he might have nudged the line quite forcibly, even straddled it, I’m not convinced that he ever quite crossed it. There's that shade of grey at work. Daphne, however, took a flying leap and sailed right over it.Sadly, the book never recovered, and I found the resolution unsatisfying – not just of that particular matter, but all of Simon’s issues.I have not the slightest idea how to rate this one. The first 313 pages were 4-star. The last 57 were 1-star. It’s tempting to give this a 1 or 2 star rating, because that scene pretty much ruined the story; but then again, I was entertained for more than 300 pages.Every time I think about what happened, I get angry and disgusted. The fact that it’s actually engendered such a strong response in me probably means I should give it at least a 3. Sometimes a strong reaction, even if it’s negative, is better than no reaction at all."}, {"userName": "UniquelyMoi ~ BlithelyBookish", "userReviewDate": "Nov 23, 2009", "userURL": "http://www.goodreads.com/user/show/1113032-uniquelymoi-blithelybookish", "userReview": "My Review:This was an entertaining read. I loved Simon, the ‘tortured from childhood’ soul, and Daphne Bridgerton, the one woman who could rescue him from his bitter, angry existence, and give him a future filled with happiness, family and the love he never dreamed he could have.The family interactions were highly amusing in the way Daphne’s siblings protected her honor even when she didn’t want it protected. Another fun side to this book was the inclusion of Lady Whistledown’s gossip columns which preceded every chapter. They were almost as humorous as the story itself.I’m looking forward to reading more of the Bridgerton family’s adventures!3.5/5.0"}, {"userName": "Grecia Robles", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/43801560-grecia-robles", "userReview": "Me encantó 💕❤💕❤Simon y Daphne 😍😍😍 Amor a toda la familia Bridgerton en especial a Colin que siento que me va a robar mi corazón Reseña completa pronto"}, {"userName": "Elena", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/68070948-elena", "userReview": "Julia Quinn writes delightfully funny banters.Julia Quinn has an obvious knack for romantic comedy.Julia Quinn can turn the simple act of taking a glove off into something sensual.Julia Quinn is utterly confused about what constitutes consent and what doesn't.*spoilers ahead*Just imagine: you've repeatedly stated that you do not want to have kids. You're taking every possible measure to ensure you don't end up pregnant. But hey, your partner knows best. So the day you have way too much to drink and go to bed wasted, he has unprotected sex with you in hopes to knock you up - because yes, he might have said he was okay with you not wanting a family, but... come on, seriously?! Once you're with child, you'll surely see reason. His reason, that is.Real charming, isn't it? Now swap the gender of the protagonists of this sweet little romance: does the fact that it was a man and not a woman who was taken advantage of change anything? If you think it doesn't, then probably you'd better stay clear of The Duke and I.The book was funny and adorable until it wasn't. I was ecstatic when Daphne confronted Simon about his stupid and offensive ploy to avoid getting her pregnant: he deliberately misled her into thinking he couldn't have children - when, in fact, he didn't want to; and he did so taking advantage of his wife's obvious (and unavoidable, given the times) ignorance of sex. Not cool. And the whole reason behind him not wanting kids was pretty asinine, really. But still. You talk to him. You try to understand what brought him to such a drastic decision and make him understand your needs and hopes for the future. You try to be patient - after all it's been what, two weeks since the marriage? Or, you know, you can always take advantage of the drunk moron who passed out on your bed and have him come inside you. There. All done!The fact that neither Daphne nor Simon - or Quinn herself, obviously - seemed to think that nothing much was wrong with this scenario had me alternately outraged and befuddled. I mean - pardon my French here - but: \nwhat the actual fuck\n? Is it just me? I re-read that awful passage three times and there's just no way to make it right, no matter how blasé Daphne and Simon are about it. Whatever, guys: if you're happy... ... still, what a way to wreck an otherwise perfectly lovely romance."}, {"userName": "Jen ", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/5962787-jen", "userReview": "3.5 StarsThere were rules among friends, commandments, really, and the most important one was Thou Shalt Not Lust After Thy Friend’s Sister.Some things never change.As much as I enjoyed it, The Duke and I ended up being my least favorite of the series so far. Yeah, like most things in my life, I'm experiencing this series out of order. Still, an alright Bridgerton book beats most of the stuff I've read lately so I'm left with absolutely no complaints."}, {"userName": "Annie (Under the Covers Book Blog)", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/2489554-annie-under-the-covers-book-blog", "userReview": "Posted on Under the CoversI have been ruined by Lisa Kleypas and all her wonderful historical that until now, I couldn’t find an author who could live up to the Kleypas craze. Julia Quinn is the answer.THE DUKE AND I is such a charming story of Daphne and Simon! The story captured me with its prologue. It starts off with a story of a vulnerable young boy and his prideful father who wished to have the perfect heir. When he learns that his son has a speech impediment, he deems him as defective and unworthy to love, shunning him from his life and love. The boy grows up, wondering what he has done to make his father hate him so much, harbouring an anger towards him that grows with each year.Years later, Simon Basset has learned to overcome his stutter and is now the Duke of Hastings, making him a sought-after bachelor. Simon is such a great hero. I loved him from the moment he stepped on the page. There’s just something about him that lures you in. He has secrets that make you want to keep reading until they are revealed. And, not to mention, he’s quite the seducer as well.I don’t blame Daphne for falling so hard for him. Daphne is the eldest daughter of the Bridgeton family, making her a prime target for her brother’s overprotective tendencies. But Daphne is a strong woman and is able to handle situations on her own. I loved the strength that she showed throughout this book. There is nothing better than a strong heroine who isn’t afraid to stand up to her man (and her brothers).What I love about historical romance is the lightness and charming nature of the stories. I found it very difficult to find another author who possessed that effortless wit that Lisa has in her writing, but after reading this I found that Quinn is just as capable of doing this. She manages to weave stories that are full of heart and passion but still making it light-hearted and fun.I loved the idle banter between the Bridgeton siblings! They are such a fantastic family and I can’t wait to read the next few books of this series. I have no doubt that the Bridgeton will charm me completely. I am so glad I picked this series up!"}, {"userName": "Nadia", "userReviewDate": "Jul 17, 2014", "userURL": "http://www.goodreads.com/user/show/25547640-nadia", "userReview": "Some spoilers ahead, so consider yourself forewarned.Oh where to begin...I suppose the beginning was not that bad. The characters were a little bit flat, but it was interesting enough. Cheesy, but readable.The part when they kiss for the first time was hilarious. I'm not really sure if it was intended, but still.But then, as Daphne became increasingly pathetic with every chapter, and Simon became an even bigger asshole, the book was quickly turning from readable to insufferable. And then it culminated.So Daphne's biggest wish in life is to marry and have children. I understand that women in the past were brought up with only that purpose, but in many HR novels, while the heroines do want marriage, they are also more than just that. The defining feature of Daphne's character is her wish to marry and have children. Like she doesn't exist beyond that. While I personally, don't feel like Daphne, I would respect her dreams if she had any other aspirations in life. Anything at all.So Daphne, limited twit that she is, decides to take advantage of her drunk and sleeping husband, even though the night before they had a HUUUGE fight about how Simon doesn't want to be a father.And I can't even. How is that okay?! Of course he would run away!! The man was sleeping, he was not a consenting adult in that. That scene made my blood boil.It's considered ungentlemanly and dishonorable when a man takes advantage of drunk woman, but when a woman does it, it's okay? The worst thing is, Simon felt betrayed and Daphne didn't even understand that what she did was terribly wrong like what the fuck?!?!?!?!?!?!?!? Girl, you were not that sheltered. So anyway, after that scene I lost any interest I had left for this book and for the characters. But the book has pretty high ratings here on GR, so it seems that a lot of people don't mind rape if it's done by the female character liked it. Read and decide for yourself."}, {"userName": "Ronyell", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/1169488-ronyell", "userReview": "[Also, the scene where Daphne seemed to force herself on Simon when Simon was drunk did unsettled me a bit since it made her look manipulative since she was so desperate in wanting a baby. What was so problematic about this scene was that the rest of the book seemed to go through this like it did not happen and I cannot help but wonder why this scene was not taken more seriously. I probably would have taken a point off this book if it did not go over so quickly and was forgotten about later on. (hide spoiler)]"}], "description": "Can there be any greater challenge to London’s Ambitious Mamas than an unmarried duke?—Lady Whistledown’s Society Papers, April 1813By all accounts, Simon Basset is on the verge of proposing to his best friend’s sister, the lovely—and almost-on-the-shelf—Daphne Bridgerton. But the two of them know the truth—it’s all an elaborate plan to keep Simon free from marriage-minded society mothers. And as for Daphne, surely she will attract some worthy suitors now that it seems a duke has declared her desirable.But as Daphne waltzes across ballroom after ballroom with Simon, it’s hard to remember that their courtship is a complete sham. Maybe it’s his devilish smile, certainly it’s the way his eyes seem to burn every time he looks at her… but somehow Daphne is falling for the dashing duke… for real! And now she must do the impossible and convince the handsome rogue that their clever little scheme deserves a slight alteration, and that nothing makes quite as much sense as falling in love…", "title": "The Duke and I\n      \n          (Bridgertons #1)", "url": "http://www.goodreads.com/book/show/110391.The_Duke_and_I", "average": 4.1, "cover": "https://images.gr-assets.com/books/1379594717l/110391.jpg", "reviews": 2905, "authors": [{"url": "https://www.goodreads.com/author/show/63898.Julia_Quinn", "name": "Julia Quinn"}], "type": ["Romance", "Romance", "Historical", "Historical", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/110391.The_Duke_and_I", "http://www.goodreads.com/book/show/6077588-the-duke-and-i", "http://www.goodreads.com/book/show/1859059.The_Duke_and_I", "http://www.goodreads.com/book/show/4799068-el-duque-y-yo", "http://www.goodreads.com/book/show/25322247-the-duke-and-i-with-2nd-epilogue", "http://www.goodreads.com/book/show/861326.The_Viscount_Who_Loved_Me", "http://www.goodreads.com/book/show/110384.Romancing_Mister_Bridgerton", "http://www.goodreads.com/book/show/110387.The_Secret_Diaries_of_Miss_Miranda_Cheever", "http://www.goodreads.com/book/show/110396.When_He_Was_Wicked", "http://www.goodreads.com/book/show/110386.To_Sir_Phillip_With_Love"]}