{"ratings": 25, "userreviews": [{"userName": "Blair", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "1.If I give this book five stars and say it's BRILLIANT and THE BEST BOOK I HAVE READ THIS YEAR and EVERYONE SHOULD READ IT, that tells you I loved it, but it doesn't tell you anything about why, or whether you would feel the same.If I describe this book as a ghost story, that tells you something about its themes, and also a little about its atmosphere: rich, evocative, gloomy, spooky, etc., etc. But it may also risk suggestions of cliche, stock imagery and cheap scares, a formulaic approach not on display here.If I describe this book as a mystery – a murder mystery, as the blurb has it – that may pique your interest if ghost stories aren't your thing. But then it might hint at some definitive answer, and this story isn't in the business of providing neat resolutions. It is much more enigmatic than that.If I say this book contains romantic and erotic elements, readers who balk at love stories might roll their eyes and groan. Anyone hoping for a tearjerking romance is likely to be disappointed, as the central relationship, if there even is a central relationship, is so slippery it barely exists. Anyone expecting pages and pages of wild sex scenes is likely to be disappointed too, since the sex is a minor part of the story (albeit beautifully done and very memorable).If I describe this book as Lynchian, that might do something to communicate how dreamy and macabre it is. But the reference might easily be misunderstood, and Lynchian is, in any case, one of those descriptors that's used so often it has all but lost its meaning. There is a deep current of surrealism here, sure, but what I also want to get at by using Lynchian is how very visual and cinematic the story feels. What I mean to say it's the closest to the experience of watching a Lynch movie a book could possibly get – but also, it's not a derivative pastiche.If I say this book experiments with form, that would cover the way it moves between truth and fiction, dreams and reality, and back and forth in time. (I have a Goodreads shelf called 'past and present', for books with split timelines; never has it been more appropriate than for The Eleventh Letter, in which past and present bleed into one another to the point of becoming indistinguishable.) But it may suggest the book is inaccessible/hard to understand/odd for the sake of it (which it isn't), or that it doesn't encourage you to read hungrily (which it does).If I had to sum up this book in one word, I would pinpoint its genre and go for slipstream. As per that Wikipedia entry, it is a kind of fantastic or non-realistic fiction that crosses conventional genre boundaries between science fiction, fantasy, and literary fiction. It certainly traverses the surreal, the not-entirely-real, [and] the markedly anti-real. It is perfectly encapsulated as the fiction of strangeness.If I had to compare this book to another book, I would choose \nIce\n by Anna Kavan. Which is ridiculous. It's absolutely nothing like Ice by Anna Kavan. But it made me FEEL the same way Ice did, and I find it equally hard to articulate its appeal. To refer back to that definition once again, cognitive dissonance is at the heart of slipstream... it is not so much a genre as a literary effect. The settings might feel far more familiar than the frozen wastelands of Ice, but that Kavanesque unreality is out in full force.2.If you read the blurb, you will see that The Eleventh Letter is, indeed, described as A ghost story. A love story. A murder mystery.Chris Katiwa is a Harley Street psychotherapist. He is clearly a successful man, but our first impression of him is a lonely, wistful figure, staying late at work to pack for the move to a new office, yet unable to articulate a reason for this move. A snowstorm descends, and outside, in the otherwise empty street, Chris sees a woman wearing a fur coat, looking 'dazed, as though she'd just woken up'. He invites her in; she introduces herself as Kay.At Kay's suggestion, the pair end up listening to some cassette tapes Chris has unearthed during his packing. These are recordings from a case Chris was involved with thirty years earlier in Pisa, Italy, when he was brought in to interview a British woman named Louise. Suspected of involvement in the disappearance of her recently married friends Kate and John, Louise weaves a peculiar and nonsensical tale which, as Chris comments, 'sounds like a ghost story'. Yet she is insistent: this is what really happened. There is Louise's obsession with Kate, and Chris's obsession with Louise. There are the hauntings Kate experiences at Wasing, the house she shares with John, and how Chris seems to inhabit the character of Kate when Louise recounts them. There are the dreams, the slips in time, the slips in identity, the doppelgängers. There is the uncomfortable concept of the book Kate was writing: a collection of imagined responses to letters written by the poet Jack France, her husband's father, to a lover he addressed only as 'K'. There is so much more, too.Is Kate K? Is Kay Kate? Is Kay K?What really became of Kate and John?What of Chris's story is real? What is a dream? What is a dream within a dream?Some of these questions will be answered. Some of them won't.This book is many books at once, and which one you read depends on you.3.Because this is a book from a small, independent press – and because I contributed to their Kickstarter, in part because of an extract from this book – I feel responsible for persuading people to try it, and more invested in its success, than I would otherwise. (Here is where I should mention that I received an advance copy of The Eleventh Letter from the publisher, Dodo Ink; but it was my chosen reward for backing the Kickstarter, not a review copy, and I wasn't obligated to write about it.)Honestly, this is one of the most challenging reviews I've ever had to write. It's taken me a couple of weeks to finish it, and I still don't feel I've done the book any justice; it's so difficult to pin down. But if there's one book I've read this year that I want to persuade people to buy, it's undoubtedly this one. I'm excited to see how others will interpret it. Seek it out.Amazon linkTinyLetter | Twitter | Instagram | Tumblr"}, {"userName": "Lisa Tuttle", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/55436259-lisa-tuttle", "userReview": "Hmmm, the dificulty with the star rating system -- did I like it or not? It made me think, and I am not sorry to have read it, but finally....well, a review is necessary.This is one of the first three novels published by Dodo, Ink, a new, independent publishing company founded by book-lovers to publish “original fiction with an emphasis on risk-taking, imaginative novels” that don’t fit neatly into marketing categories. I am totally on board with that; would that there were more such publishers! The Eleventh Letter is described by them as a ghost story and as “Lynchian”, which got my attention. \tI love ghost stories – especially “literary” ghost stories (Shirley Jackson, Peter Straub) – and although I am still not sure what they meant by “Lynchian” (I might have name-checked D.M. Thomas) but I tend to make bookish rather than cinematic connections when trying to describe a book’s effect (or affect). \tThe author is a psychotherapist in London, and the main character of this, his first novel, seems an autobiographical figure – Dr Chris Katiwa, a London-based psychiatrist, with childhood and family memories that chime with the biographical details provided for Tom Tomaszewski. How much is fact-based, how much is completely made up I have no idea, and it doesn’t matter. Was it a Freudian slip, where a character is referred to once as “Maria Tomaszewski” but otherwise has a different surname? Or did the author change his mind about that particular game? \tThis novel has an amazingly complex plot, with several different time-lines and inter-connected stories; there’s even a back-story concerning the (imaginary) grandson of Robert Browning that’s directly linked to the mysterious disappearances of a honey-mooning English couple in Italy in 1986 – Chris Katiwa is drawn into this mystery when he interviews Louise, a young Englishwoman who is suspected of murdering the missing couple, but the novel properly begins in 2010 when he finds himself inexplicably compelled to listen to the old tapes of those interviews from 1986, and soon we are re-living his experiences along with the stories told by Louise which involve even more mysterious events, and literary love affairs between the living and the dead.\tDespite the complexity, the novel is not hard to read, and is actually very enjoyable if you are willing to put up with some confusion and not insist on knowing what is “real” and what is not, and even accept that there may never be a clear definition where ghosts and haunting (and memories) are concerned. Is Dr Katiwa plagued by ghosts or is he having a mental breakdown? Is there a difference? I quite like ambiguous fictions, and I thoroughly enjoyed this for more than half the book – maybe two-thirds -- at which point I began to feel that the author was not in control of his material, that his ambition had outstripped his ability to tell a coherent story. The more interesting (to me) plot was overwhelmed by late additions – unexplained incidents from Chris’s childhood, the unsolved crimes of an Italian serial killer dubbed “The Wolfman” and still more psycho-sexual physical ghostly encounters along with the sense that past and present have switched places, or maybe there is simply no way of distinguishing between \"now\" and \"then\" in the mind. The weirder it got, the more frustrating, and – to me – less interesting. When absolutely anything can happen, for no reason, it is hard to care. I don’t feel everything needs to be explained, but surely readers have a right to expect some resolution to at least a few of the made-up mysteries. \tIt did occur to me that maybe I had missed something and would understand if I went back and read it again, but....then I recalled the author’s footnote on page 207, where he says he was thinking about inserting some dialog from Butch Cassidy and the Sundance Kid, but “I suggest you go and watch the film....” and then he also suggests reading Derrida’s Spectres of Marx and sighs a little over his inability to “write characters like Haruki Murakami does” – and I think that was the point at which my suspension of disbelief, already shaky, collapsed like a heap of cards. On second thoughts, however promising and interesting this novel was at first, in the end, it’s a mess."}, {"userName": "Bernadette", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/63063020-bernadette", "userReview": "This story was weird. I don't have a fancier term than that to use. However weird is good. There is no point reading this book and hoping to hang onto the details, you need to let go and wash along for the ride. Some questions may not be answered, in fact a lot aren't and a lot of the time you may be thinking 'what the hell is going on now?' But for me, I found the flow of the book quite relaxing because i didn't have to guess what was going to happen it just flowed along with me along with it. I found the publishing blurb very interesting and that the publishers Dodo Ink will only release three books a year and they will be progressive and unique stories. I like that. When I am in the mood again for something as mind-bending as The Eleventh Letter I will definitely head to Dodo Ink."}, {"userName": "Yvonne Davies", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/37667243-yvonne-davies", "userReview": "When Chris Katiwa began packing to move to a new premise, he didn’t think that finding some old tapes would stir up a load of memories. The tapes played the interviews between him an eager psychotherapist and Louise a young woman involved in a missing persons/murder case in Italy. Added to this is a mysterious woman who is rescued by Chris when she is outside his office in the heavy snow storm.The author had a way of telling story, they kept me hooked from the beginning. The idea of the interview tapes was a good way to tell Louise’s story and you could just imagine listening to her voice whilst wondering if she was responsible for her friend’s demise. Jumping to the time of the interviews we then follow Chris in his quest to get to the bottom of the mystery and to prove Louise’s innocence. Whilst reading I was on the edge of my seat as I was expecting something to happen. The introduction of Asha and Josephine was unexpected and I was surprised of their true identity. The way the story was laid out helped develop the main character as the young Chris in Italy was very unsure of his skill and leant a lot on his mentor, whilst when he got older and was working in Harley Street, he was confident in his abilities With the story line incorporating London, Italy and the interview with Louise, you would expect this to be a confusing read, but it wasn’t, each chapter told you exactly when and where it was set. It is hard to pigeon hole this book into one particular genre, but I would say that this is a Suspense Ghost story, that will keep you gripped. I will definitely look out for more from this author"}, {"userName": "Laff", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/8766709-laff", "userReview": "I couldn't help feeling that the author had been working on several different drafts for a novel and in frustration has forced them all into one story, using the idea of 'ghosts' as some sort of glue to hold them all together. It didn't work for me."}], "description": "A LOVE STORY.A GHOST STORY.A MURDER MYSTERY.Chris Katiwa, a Harley Street psychotherapist, finds himself trapped in his office by heavy snow. When a beautiful, enigmatic woman asks to take shelter with him, he finds himself drawn to her charisma. Discovering tapes concerning a murder trial from the 1980s, Chris and his mysterious guest listen to voices from the past as the night draws in and darkness falls.Chris begins to wonder if the woman he once tried to defend is as innocent as he had thought. Was she involved in the Pisa killings, or were they work of the savage serial killer that became known as the Wolfman?The Eleventh Letter is a ghostly, Lynchian tale that explores love and lies, murder and madness.", "title": "The Eleventh Letter", "url": "https://www.goodreads.com/book/show/32490000.The_Eleventh_Letter", "average": 2.88, "cover": "https://images.gr-assets.com/books/1475789627l/32490000.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/7998840.Tom_Tomaszewski", "name": "Tom Tomaszewski"}], "type": ["Contemporary", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/32490000-the-eleventh-letter", "http://www.goodreads.com/book/show/21273593-this-is-sick-teddy"]}