{"ratings": 1125, "userreviews": [{"userName": "Paul Bryant", "userReviewDate": "Mar 21, 2010", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Are we alone in the great big fat universe?It's presented as if it's a real lonesome thing. Just us nine billion, no one to talk to but each other. And true, when you put it like that - who would want to spend their life with no one except human beings? You'd have to be a psycho. Human beings? Eww. Give em a planet and what do they do with it? Only thing they're good at is making more human beings. But anyway. I don't get why people cudgel their brains about this question are we alone in the universe. Here are the facts :1) The universe is big.  It could be bigger than we think it is. It might turn out to be the biggest thing there is. Imagine that - or don't, you might hurt yourself! And - and - and - could be this is only one of a million universes. Cool. Could be new universes are popping into existence all the time. Pop! There goes one.2) Everything is a really long way from everything else.  Nothing is near. There are no corner shops in space, no local Sainsburys. There's sod all. Deep space facilities, in that respect, are poor. It would take centuries to get to anywhere. You'd have to have a massive ipod. When you look at the universe, you just think... nah. Let's stay in.3) So... just imagine along with me ... that means that if life started in a gazillion places apart from Earth... imagine, imagine.... we're never going to find out because in order to discover each other then one of the civilisations has to have invented Warp Factor Five  or whatever and then they have to happen to be living in the same galaxy as another civilisation and at the same time which is a little unlikely - it means that civilisations trying to discover each other is like one red grain of sand on a yellow beach wanting to find another red grain of sand which might appear on a different beach in 500 million years. Crazy! Just never gonna happen. Like me and that girl way back in the sixth form. Never gonna happen in a million years, and we were in the same year! 4) So therefore of course there's life out there - what, you think you're so unique? Oh stop it. But we'll never find out. Ever. The end. Stop writing books about this foolishness!"}, {"userName": "Nikki ", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "Paul Davies does a really good job here of illustrating the issues of SETI's lack of success, and Fermi's Paradox. He goes into the science and philosophy of it in depth, explaining all the terms and generally making it crystal clear. What amazes me is that he's still somewhat optimistic about finding intelligent life elsewhere in the universe, given all the things he says in this book -- I'm now almost completely sure that even if intelligent life has arisen elsewhere (and that's still a big if) that we'll have trouble finding it because of the issue of the sheer amount of time and space involved.Not that I don't think the search is worth doing. Even if we'll never manage to communicate with intelligent life elsewhere in the universe, we might find signs of it, and understand more about how life begins. There's so much we can learn along the way, and maybe the idea that we may not be unique will keep us a little bit more humble.Or not."}, {"userName": "David (דוד) ", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/5431286-david", "userReview": "This was a good book on how and why we need to think out-of-the-box while keeping the search ongoing for ETs (Extra Terrestrials). Paul Davies does a good job of mentioning the various ways in which we can do this, or what to look out for, where do we as intelligent beings need to think anew, and stay away from anthropomorphism and our mindsets based upon the past and present dogmas.A pretty delightful read for people who always have questions and thoughts regarding the possibilities of intelligent life-forms away from our planet.Having to read this alongside Jim Marss' Alien Agenda: Investigating the Extraterrestrial Presence Among Us was kind of interesting . :)"}, {"userName": "Ganesh Sanal", "userReviewDate": "Jul 01, 2015", "userURL": "http://www.goodreads.com/user/show/37332006-ganesh-sanal", "userReview": "There are but very few instances where you pick a gem that many mistook for just a dusty rock. How could this book be so unpopular. Maybe thats the most compelling evidence for the eerie silence. The intellectual orgasm was quite similar to that from the movie Interstellar. Its like a thousand classic science fictions distilled to just over 200 pages. The shadow biosphere, the great filter, neutrino beacons, nanoprobes... Oh baby, it's Christmas. And it reaches its pinnacle when Paul convinces you almost certainly why biological intelligence is to quantum processers as apes are to humans. The stepping stone in evolution. Phew.. And to end it all consider three choices to reason the eerie silence. Either we, as earthlings, are really special to hold life, Or really really special to hold intelligent life, Or are just the next iteration in an often repeating cosmic cycle of self destructing intelligence.By reading popular reviews you may feel that this book mainly discuss Fermi paradox and the impact of alien contact on religion. Not at all. This book about the search. Why it began, why the silence, what's the probability of success, where should we look, what to do when the contact happens and its impact. It's Bible for anyone remotely interested in aliens."}, {"userName": "Holly", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/4763049-holly", "userReview": "I can't imagine there is anyone else in the world (this world) who knows more about this subject than Paul Davies. A fascinating and comprehensive survey of what the \"eerie silence\" might or might not mean. E.g., either we haven't looked in the right places/ways; or \"they\" have already been here (and left their presence in our DNA or viruses); or there is very bad news in store for the future of our species. Cool book."}, {"userName": "Stan James", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/17318238-stan-james", "userReview": "Paul Davies, the chair of SETI's Post-Detection Science and Technology Taskgroup, wrote The Eerie Silence in 2010, a short time after the Kepler space telescope launched. Back then a handful of exoplanets (planets outside our solar system) had been discovered. Since then Kepler alone has confirmed over 2,300 exoplanets and estimates for the observable universe go as high as 5.3 trillion.That's a lot of planets.And yet seven years later, the eerie silence Davies wrote about persists. You might think that over 50 years of observation by SETI failing to yield any tangible results would be disheartening and indeed, Davies does admit it can be a little depressing when you focus solely on the lack of any clear signal that we are not alone in the universe. But he remains hopeful that life here is not a one-time fluke among the billions of star systems. That hope is tempered by his adherence to the scientific method, of observation and testing, with minimal speculation.It is that speculation, though, that forms the heart of the book. Davies presents comprehensive scenarios on how other planets might support life, what that life might be like, how alien races might communicate with us--or if they would even bother. He takes a dim view on fictional portrayals of aliens as malevolent beings looking to wipe us out and constantly warns against falling into the trap of anthropocentric thought. H notes that we might not even recognize aliens because they could exist in a state we can't comprehend.Davies also spends time covering how SETI and others would handle the world-changing confirmation of other intelligent life (he doesn't put much stock in politicians or government handling it well).In all, this is a wonderfully detailed and engaging look into the possibility of life beyond Earth. Davies keeps coming up with unique angles on how to approach looking for signs of communication--whether intentional or incidental, on how other intelligent beings might act and evolve, and why he is still passionate about continuing the search for other intelligent species beyond the confines of our solar system.Highly recommended."}, {"userName": "Jon Norimann", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/42703646-jon-norimann", "userReview": "The eerie silence is mostly a primer in the the search for extraterrestrial intelligence (SETI) focused around the US program formerly run by NASA. In addition Davies, who is part of that program, adds a fair amount of his own opinions and ideas on why and how this search should be done.In total its become a nice easily read book mostly for those already interested in the search."}, {"userName": "Tom", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/48903715-tom", "userReview": "As intimately involved with the SETI project as Paul Davies is, you might well imagine this book to be a cheerleading campaign for the program in general. Well not so much. He is unexpectedly candid about the many shortcomings he sees in how the search is currently being conducted. By succinctly explaining just how narrow the search parameters are and how limited the scope, Davies shows that it is hardly surprising that 50 years of listening to the stars has yet to yield any positive result. Upon this premise he then frames a rather compelling argument for broadening the search beyond radio astronomy by employing myriad technological advances to seek out tell-tale physical signs of intelligent alien activity. While searching for signs such as the relative distribution of magnetic monopoles isn't nearly as sexy as intercepting an ET radio broadcast, the chance of success is much greater and will begin to populate the SETI database with something other than the dearth of interstellar communication signals. Davies arguments are stated in a fairly straight forward and not overly technical manner. He can be a bit preachy at times, but for the most part what is presented is quite approachable and reader friendly. My only real beef with the case being made is Davies' insistent dwelling on the idea that intelligent aliens will be thousands if not millions of years more technologically advanced than earthbound humanity. Sure, that is a possibility. But it is only one possibility. Prospective intelligent alien societies anywhere technologically between humankind and those millennially advanced super ETs are conspicuously absent from the discussion. He makes a much better point in calling for a shift away from the current anthropocentric approach to the search. Regardless of relative technological advancement, assuming human-like behavior from a truly alien intelligence is not only severely constraining, it is also quite unreasonable. Some good thought provoking stuff that encourages some fun mental exercises along the way. An enjoyable read all around."}, {"userName": "John Wenning", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/11085684-john-wenning", "userReview": "This is a fantastic book for anybody interested in the SETI project and Fermi's Paradox. The biggest take home point I got out of reading this book is the question of what side of the \"Great Filter\" we are on (read the wiki article on the Great Filter for further info) and what profound implications it has whether the filter is already behind us or if the filter is in our future. If the filter is behind us and the rare earth hypothesis is correct, the future looks bright for our descendants and the possibility of our descendents (whether biological or machines) being able to make it to a neighboring star system in the millions of years to come before the sun swallows the Earth is somewhat hopeful. On the other hand, if the filter is ahead of us, it is possible that there may be many technological civilizations scattered through the galaxy but none of them ever develop the capability to travel to a neighboring star system. As hopeful as I am that there is somebody out there, the science is pretty discouraging so far and although I still think the SETI project is a worthwhile endeavor, it is extremely unlikely we will ever be able to find any alien signals. There just isn't anyway around the inverse square law of radio signal propagation and the distances are far too vast. It was a good read. I may have to read \"50 solutions to Fermi's Paradox\" soon."}, {"userName": "VijayaRaghavan S N", "userReviewDate": "Jul 12, 2015", "userURL": "http://www.goodreads.com/user/show/44530411-vijayaraghavan-s-n", "userReview": "One of those books which serves justice to the title (\"The Eerie Silence\").I was someone like the author's grandmother, who asked, why spend so much time, effort and money on such endeavors? But this book gave me reasons after reasons why I was being naive. It made gave me an insight into the endless possibilities related to ET life and it's discovery.Now, I can't take a step forward without looking at my surrounding for signs of ET life. After being done with the book, my curiosity is now at an altogether different level.I never imagined people were capable of forecasting so much into future. Especially on how aliens would try to contact us and also on their shapes.I could go through this book again and again without getting bored.One of the strong points of the book is that, even though the author is a scientist, he didn't try to establish that alien life exists. He was always open minded in his approach. This serves particularly well for a reader like me who isn't aware of such possibilities.This is a must read for everyone who watches science fiction movies and has a thing for it."}, {"userName": "Terry Tsurugi", "userReviewDate": "Sep 13, 2010", "userURL": "http://www.goodreads.com/user/show/1910716-terry-tsurugi", "userReview": "This was a fascinating, thought-provoking, and entertaining book. I've thoroughly enjoyed every Paul Davies book I've read. I like the way he pursues highly speculative topics but still maintains a reassuringly rational, critical, and intelligent point of view. I had previously considered the search for extraterrestrial intelligence to be an exhausted and cliched subject, but I learned so many new things from this book. For example, the possibility of a \"shadow biosphere\" (life that originated separately from the dominant life on earth) right here on the same planet and how that affects the likelihood of extraterrestrial life. And I like the way Davies shoots down the widespread misconceptions about how easy it is for life to begin spontaneously, even given hospitable conditions. And the discussions of the pessimistic ideas of Brandon Carter, et al, based on probabilities are mind-blowing and compelling. This book is a nice companion piece to his earlier book The Fifth Miracle."}, {"userName": "Nick", "userReviewDate": "Feb 29, 2016", "userURL": "http://www.goodreads.com/user/show/995651-nick", "userReview": "Hey guys, guess what!If the fact that we've never detected extraterrestrial intelligence is indicative of the non-existence of such*, there are two possibilities:1) The development of intelligent life is exceptionally rare even in the vastness of the cosmos, and it was extraordinally unlikely that the human race would ever have come into being. The fact that we exist is a minor miracle!2) The development of intelligent life happens all the time. It just doesn't survive long enough to make contact with other intelligent life. In which case, we're probably doomed in the very near future.Have a nice day!* - there are plenty of reasons that it might not be."}, {"userName": "Tracy Black", "userReviewDate": "Jun 25, 2010", "userURL": "http://www.goodreads.com/user/show/1780231-tracy-black", "userReview": "I enjoyed this one. Davies covered many points of veiw on how likely it is that other life is out there, and what it could be like. Some of it was very speculative and imaginative."}, {"userName": "Bioteo", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/14447058-bioteo", "userReview": "La domanda \"Siamo soli nell'universo?\" è forse quella più importante e profonda che possiamo porci. Il programma SETI da più di cinquant'anni sonda l'universo con i radiotelescopi al fine di captare segnali inviati da civiltà extraterrestri intelligenti. Ma è così scontato che esistano nell'universo civiltà tecnicamente avanzate? La vita nell'universo è diffusa oppure la Terra è l'unico pianeta ad ospitarla? Nel momento in cui la vita compare in un pianeta lontano è inevitabile un processo evolutivo che porti ad un aumento di complessità fino alla comparsa di esseri intelligenti e coscienti? Forse la vita è comune nell'universo ma l'intelligenza è solo uno dei possibili adattamenti e pertanto è poco probabile che compaia. Dal punto di vista scientifico la probabilità che ci siano altre forme di vita nell'universo oscilla tra l'impossibile (posizione sostenuta del premio Nobel Monod) e l'inevitabile (posizione sostenuta dal premio Nobel de Duve). Paul Davies analizza questi importanti temi con la massima serietà scientifica sebbene talvolta si spinga un po troppo in speculazioni che appartengono ancora al campo della fantascienza. Sono stati spesi moltissimi soldi per il progetto SETI sebbene alcuni detrattori sostengano che sia una ricerca che non porterà mai ad alcun risultato. Ma se all'improvviso trovassimo la prova scientifica dell'esistenza di vita al di fuori del nostro sistema solare che cosa comporterebbe? Davies sostiene che sarebbe una scoperta memorabile, la più importante della storia della scienza e dell'umanità, che porterebbe ad un vero e proprio terremoto in ambito scientifico, filosofico e soprattutto religioso. Per adesso però non ci resta che attendere e sognare quando la sera puntiamo il naso all'insù e scorgiamo l'immensità dell'universo che ci ospita!"}, {"userName": "Ulises", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/75041076-ulises", "userReview": "Are we alone in the universe? I think that this book was pretty good and interesting because at first they did not pay attention into the silence and signals that they were receiving until one person received a strong boom of radio signals, it changed everything about if we are we alone in the universe. SETI has jut been looking at the wrong place at the wrong time. Davies has been closely involved with SETI for three decades, and chairs the SETI Post-Detection Task group, charged with deciding what to do if we're suddenly confronted with evidence of alien intelligence. He believes the search so far has fallen into an anthropocentric trap—assuming that an alien species will look, think, and behave much like us. In this mind-expanding book he refocuses the search, challenging existing ideas of what form an alien intelligence might take, how it might try to communicate with us, and how we should respond if it does."}, {"userName": "Eric Jeppsen", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/35914708-eric-jeppsen", "userReview": "I just wrote a review of the Forever War, in which I mentioned that one of the most fascinating science fiction topics to me is time dilation—the other is the Fermi Paradox. In fact, it was the reveal of the “dark forest” hypothesis (in the Dark Forest) that set me off on my recent sci-fi kick .In short, this book feels a lot like any number of the novels I’ve read over the past year or so. We get the same theories and speculations, only there’s no story to back it up. Sometimes that’s good, as it lets us really dig into the speculation. Other times it’s bad, as some things are a lot harder for me to take seriously in real life than they are in fiction. Following up on that last comment, I’d say this is an uneven book. Some parts, such as the discussion often origin of life and whether life arose more than once on earth, are fascinating. Others, such as the discussion of diplomatic protocols in the event of first contact, not so much. And others, such as the author’s discussion of religion and extra-terrestrial life, are almost embarrassing. In the end, I enjoyed it, and I’m glad I read it."}, {"userName": "Scott Kardel", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/8848209-scott-kardel", "userReview": "I enjoyed Paul Davies look at the SETI program and its implications. The Eerie Silence takes the reader into not only the nuts and bolts of the search for life out there, but also into the implications of what it would mean if extraterrestrial life was or wasn't found. While it is seven years old it isn't as dated as some of the other books I have recently read on the topic"}, {"userName": "Ludi Nel", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/19975609-ludi-nel", "userReview": "Wow what a great book. I can highly recommend this to anybody with an interest in astronomy and the scientific search for extra terrestrial life. The massive challenges associated with this is truly interesting. A honest critical look at the \"possible\" success from a scientific perspective from someone within SETI."}, {"userName": "Alex Johnson", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/33009953-alex-johnson", "userReview": "I was always of the mindset that with such a vast galaxy/universe that it was completely arrogant for us to think we were the only intelligent life there is. Sadly, this book made me question that viewpoint. Very well written and thought provoking."}, {"userName": "Bjorn", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/19667916-bjorn", "userReview": "In 2010, the SETI - Search for Extra-Terrestrial Intelligence - initiative celebrated its 50th anniversary. And so physicist/cosmologist/astrobiologist Paul Davies was asked to write something. Rather than just write a simple back-patting congratulation, he decided to try and write about the whole concept: Why are we looking for signs of alien intelligence, how are we looking for it, how likely is it to exist, how likely are we to find it (or they to find us), what would we be likely to find, how would we react...? Is it possible that the big fat Zero that's been the result of our search so far means that we really are all alone in the universe, or are we just looking for a very tiny needle in a very large haystack? To do this, obviously, he can't just write about radio telescopes, he needs to go back and revisit the fundamentals: how does life arise and evolve, how would you travel or communicate across large distances, how would we even recognise technology that's thousands or millions of years beyond our own?The Eerie Silence is a great little primer on most of these subjects, though at 210 pages you'll probably find yourself wanting to dig deeper in some areas. Some of the stuff that fascinated me:Our telescopes keep finding more and more planets outside the solar system - 846 identified ones as of today - and with all the stars out there, it stands to reason that there could be millions of habitable planets in our galaxy alone; ie planets made of rock, in the \"goldilocks zone\" (not too hot, not too cold), with liquid water and an atmosphere. Theoretically, there could be a lot of aliens out there. But habitable doesn't mean inhabited; the problem when trying to figure out how likely that is, is that we simply don't have any indication of how easy the step is from \"theoretically habitable\" to \"practical rocket scientists\". As far as we know for sure (though Davies presents some interesting speculations), life has arisen in the universe exactly once (around 3.5 billion years ago on Earth) and evolved intelligence exactly once (Homo, about 2 million years ago), and one single data point doesn't give us any indication of how likely the same thing is to happen on other planets; it could happen every time, or never. For all we know, the universe could be empty, or it could be teeming with life that never evolved \"past\" bacteria or dinosaurs (going with the common fallacy that some animals are \"more evolved\" than others), or the 6-7 billion years that the average planet has before its sun supernovas simply isn't enough time to perfect interstellar travel. If there are aliens out there to communicate with, why wouldn't they have already done so? It's a bit like Stephen Hawking's question: if time travel is possible, why have we never seen any tourists from the future?What would we be looking for, and how would we recognise it when we see it? We take for granted that communication from other civilisations would come as, say, a radio signal carrying prime numbers, because that's what we can hope to read. If there are others out there, they may well be trying to communicate in ways we haven't even conceived of yet.For that matter, what would other, more advanced civilisations even want with us? Science fiction is full of aliens looking to humans as cheap sources of food, labour or concubines, which is just silly - if you're able to communicate across light years, you can't have much need for manual labour. How do we know they haven't noticed us and decided not to bother with us until we show some sign of intelligence? After all, we've only been broadcasting weak radio signals for about 100 years (and have pretty much stopped by now, since we're mostly using fiberoptics and satellites these days), and anyone looking at us from more than 110 lightyears away wouldn't even know that we've mastered flight.What would members of an ancient civilisation even be? Even assuming they started out roughly like us, we're already edging into cyborg territory ourselves; would a species that's had another 40,000 years of \"civilisation\" even be biological anymore? (Yes, Davies is an Olaf Stapledon fan.) Would we even recognise them as life? Would we recognise their technology as artifice?For all the high-flying speculations, The Eerie Silence is a sober and realitic look at the possibility of finding and communicating with hypothetical extraterrestrial civilisations. In the end, Davies is very sceptical that they even exist, but that's not his worst nightmare, nor a reason to stop looking. The worst-case scenario, he claims, is this: we keep looking, and we discover that there's plenty of life in the universe, and that it's occasionally evolved into intelligent beings... and that none of them have survived long enough to communicate with others before they wiped themselves out. If that's the case, then that's definitely something we need to know.Or, as xkcd put it:The universe is probably littered with the one-planet graves of cultures which made the sensible economic decision that there's no good reason to go into space--each discovered, studied, and remembered by the ones who made the irrational decision."}, {"userName": "Robert Fletcher", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/20034987-robert-fletcher", "userReview": "'The Eerie Silence' is an excellent primer on astrobiology and SETI."}, {"userName": "Eric Layton", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/33125404-eric-layton", "userReview": "Interesting.The author suggests some intriguing ideas regarding alien life/intelligence."}, {"userName": "Dalibor", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/74396173-dalibor", "userReview": "Prochází důvody, proč jsme nejspíše zatím nezaznamenali žádný mimozemský signál."}, {"userName": "Raúl Pérez ", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/51054011-ra-l-p-rez", "userReview": "Además de una breve historia de SETI, a 50 años de su fundación, Davies aborda tópicos tan interesantes como la idea de una \"biosfera en la sombra\": las enormes implicaciones de un segundo tipo de vida en la misma Tierra que no corresponda a los reinos conocidos (arqueas, bacterias y eucariotas), como parte del argumento de un principio universal sobre el incremento de la organización y la complejidad, que derive en la vida.Ameno, interesante, incluso poético (la búsqueda de vida en el espacio es también una búsqueda de nosotros mismos); sin duda un libro de divulgación científica que tendría que leer cualquier ufólogo (Maussan y compañía) para ya no decir o pensar sandeces."}, {"userName": "Patrick Winders", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/31714403-patrick-winders", "userReview": "pretty good. pretty hot take that monotheism us a necessary precursor for the development of science 🤷‍♂️"}, {"userName": "Ragnar Gudmundsson", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/56353876-ragnar-gudmundsson", "userReview": "One of my favourite books. A logical approach and a robust analysis of this facinating subject."}, {"userName": "Sandeep", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/12053512-sandeep", "userReview": "Was an interesting read and the whole idea of SETI and search for alien species was well introduced and discussed. Will be looking for more books from Paul Davies."}, {"userName": "John Gribbin", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/22224713-john-gribbin", "userReview": "This year marks the 50th anniversary of the first serious scientific attempt to detect signals from an alien civilization, using a radio telescope at Green Bank, in West Virginia. The title of Paul Davies’ homage to all the effort that has succeeded this pioneering work derives from the fact that nothing has yet been heard from “out there” – at least, nothing that can be interpreted as a sign of an intelligent technological civilization. But the silence is only eerie, as Davies makes clear, if there are sound reasons for thinking that there ought to be many other civilizations in our Galaxy broadcasting messages at radio wavelengths. As Davies also makes clear, this assumption is so full of holes that it should be no surprise that the search has proved fruitless. “As a scientist,” Davies admits, “my answer [to the silence] is that we are probably the only intelligent beings in the universe.” But as a human being, he “can think of no more thrilling a discovery than coming across clear evidence for extraterrestrial intelligence.” That is the point of what is now known as the Search for Extraterrestrial Intelligence, or SETI. It is reasonably cheap, taking advantage in most cases of spare time on existing radio telescopes, and relying on funding from individual benefactors (including the Microsoft billionaire Paul Allen) for such dedicated equipment that is used. The odds are long, but it scarcely costs the taxpayer a penny, ad the potential reward is huge. Worth a small gamble for the chance of winning the galactic lottery. But the example of our own civilization shows just how long the odds are. Life began on Earth almost as soon as the planet cooled, which is encouraging. But for more than three billion years that life consisted only of single-celled organisms, like bacteria. It was only some 600 million years ago that complex, multicellular organisms evolved, for reasons that are not understood, and eventually moved on to land. Even then, creatures with our kind of intelligence emerged only a few million years ago, civilization developed a few thousand years ago, and the kind of civilization that broadcasts radio messages to the stars emerged less than a hundred years ago. If any of these steps are missing, the result is silence. And even then, any civilization out there might be using some technique to communicate that is as far in advance of radio waves as radio is compared with smoke signals. Davies doesn’t set out to answer all the questions about intelligent life and the Universe (who could?), but to provide a light overview of the subject with a brief history of SETI so far. The result is an entertaining and thought-provoking read, from which the main conclusion seems to be that life is common in the Universe, but that our kind of intelligence is rare, and possibly unique. This raises profound philosophical and religious questions, which Davies is not afraid to acknowledge and, to a limited extent, address. I wholeheartedly recommend the book. The other profound question, though, is what we should do if this assessment of the situation is wrong and we do make contact with other intelligent beings. As the final chapter of the book asks, “Who Speaks for Earth?” And should we be actively trying to communicate with aliens – an activity known as Messaging to Extraterrestrial Intelligence, or METI? Bearing in mind that any being that receives such a message may be as much in advance of us as we are to ants, and also bearing in mind the attitude of many people towards ants, many commentators are alarmed at the prospect of advertising our presence; but this has not stopped radio astronomers in the Ukraine beaming messages towards at least on planet orbiting a nearby star in recent months. In my view, this is about as sensible as if the Native Americans had sent messages drifting across the Atlantic in the Gulf Stream inviting the Europeans to come and visit. But the most fascinating section of The Eerie Silence concerns the possibility of what Davies calls “Post-Biological Intelligence.” Before long, he says, it should be possible to simulate (or model) the workings of a human brain in a computer, creating a “virtual” brain as opposed to an “artificial” brain. ET, he argues, is more likely to be a computer than a biological being. And whereas biological beings need to live near stars to harvest their energy, computers need to be kept cool to run efficiently. So they would like to live in the dark depths of space far away from stars – possibly in the even darker spaces between the galaxies. So maybe the reason for the eerie silence is that we are looking in completely the wrong places, as well as listening out with very primitive technology. We should, says Davies, be looking for “the impact that alien technology makes on the astronomical environment . . . In pursuing new SETI, it is important to remember the adage: expect the unexpected.”Another one from the Literary Review"}, {"userName": "Dan Falk", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/28204661-dan-falk", "userReview": "It’s been more than 50 years since human beings began to search for other intelligent civilizations in the universe – and all we’ve heard so far, as the title of Paul Davies’ latest book captures succinctly, is an “eerie silence.”The first effort was a modest one. Back in 1960, a young astronomer named Frank Drake aimed a radio telescope at a nearby, sun-like star known as Tau Ceti. He reasoned that if an alien civilization had developed a technology roughly similar to our own, it would be sending radio waves out into space, and that some of those radio waves would reach our telescopes. (This could be either the result of a directed message aimed specifically at us, or accidental “leakage” from such a civilization; humans, for example, have been beaming everything from “I Love Lucy” to Rush Limbaugh out into the ether for decades now.) Other astronomers have followed in Drake’s footsteps, and to date they’ve examined several thousand stars, out to a distance of 100 light years or so (still relatively nearby in astronomical terms). The quest is known as “SETI” – the Search for Extraterrestrial Intelligence.What they’ve been listening for is any kind of unambiguously intelligent signal that stands out above the “noise” of normal radio emissions from astrophysical objects. And so we come to the one of the biggest “ifs” in human history: If we were to find such a signal, we would know we are not alone in the cosmos. “The consequences of such a success would be truly momentous,” Davies writes early in the book, “having a greater impact on humanity than the discoveries of Copernicus, Darwin and Einstein put together.” He quickly adds: “But it is a needle-in-a-haystack search, without any guarantee that a needle is even there.”Indeed: The simplest explanation for the “eerie silence” is that ET simply doesn’t exist, and beyond our Pale Blue Dot (to use Carl Sagan’s phrase) the universe may be a lonely place indeed. Of course, even that would be a profound discovery – and although you can’t prove a negative, if SETI searches are thorough enough, and are carried out for long enough, we might eventually be forced to admit that we are, in fact, alone – a sobering thought, to say the least.The Eerie Silence is a comprehensive analysis of the SETI question, from the scientist who is likely the most qualified Earthling to tackle the subject. Davies is a physicist, astrobiologist, and prolific science writer now based at Arizona State University, where he heads the Beyond Center for Fundamental Concepts in Science. He also chairs the “Post-Detection Taskgroup,” a committee charged with figuring out “what to do next” if ET does happen to call. (The committee has no legal power, but even so, it’s a heck of a title to put on your business card, and Davies takes the responsibility seriously.)It’s only natural, of course, to try to work out the a priori probability of ET being out there – to try to estimate how many (if any) needles are in the metaphorical haystack. Drake himself attempted to do so, multiplying a string of probabilities together in what has become known as the “Drake equation.” The problem is, each of those factors is exceedingly hard to pin down.For example, given an Earth-like planet, what is the likelihood that life will take root? At this stage, we simply don’t know, because we only have data for one such planet – our own. (Yes, life evolved here – but was it inevitable, or was it a fluke?) And, given a planet on which life has evolved, what is the likelihood that it will eventually evolve into intelligent life – the sort that might eventually use radio technology, or seek out other like-minded beings? The development of such life on Earth – that is, us – seems to rest on contingency upon contingency. If we could “rewind the tape” of Earth’s history, so to speak, would we have the plough, the pyramids, and the iPod once again? The answer is far from clear, Davies says. And so the number of civilizations out there is frustratingly difficult to even estimate.There is much more to digest here. Among Davies’s bold assertions is the idea that squishy, biological life is probably transitory; if we do eventually find an alien intelligence, it will likely be mechanical in nature. Oh, and if we find ET, our belief systems may need an overhaul: The discovery of aliens, Davies says, “would deal a severe blow not only to Christianity, but to all mainstream religions.”Some readers may quibble with that statement, or with some of the author’s more speculative arguments. But Davies, to his credit, is careful to distinguish established science from speculation, and speculation from opinion, at every turn. The Eerie Silence is honest yet provocative – and enormously entertaining. (Adapted from a review I wrote for The Globe and Mail.)"}, {"userName": "Max De Faveri", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/56611332-max-de-faveri", "userReview": "Ottimo volume divulgativo, preciso e scorrevole. Davies analizza con perfetta chiarezza i presupposti del progetto SETI, discorrendo con intelligenza dei vari scenari in materia di ricerca di vita nel cosmo."}], "description": "Are we alone in the cosmos? This is one of the big questions, yet it remains unanswered. This book explains why the search for intelligent life beyond Earth ought be expanded & how it can be done. 50 years ago, astronomer Frank Drake 1st pointed a radio telescope at nearby stars, hoping for a signal from an alien civilization. Thus began one of the boldest scientific projects, the Search for Extraterrestrial Intelligence. After a half-century of scanning astronomers have little to report but an eerie silence-eerie because many believe the cosmos teems with life. Could it be, wonders physicist & astrobiologist Davies, that we're looking in the wrong place, at the wrong time, in the wrong way? Davies has been closely involved with SETI for three decades & chairs the SETI Post-Detection Taskgroup, charged with deciding what to do if we're confronted with evidence of alien intelligence. He believes the search has fallen into an anthropocentric trap-assuming alien species will look, think & behave like us. His book refocuses the search, challenging existing ideas of what forms alien intelligence might take, how it might try to communicate & how we ought respond if it does.List of IllustrationsPrefaceIs anybody out there? Life: freak side-show or cosmic imperative? Shadow biosphere How much intelligence is out there?New SETI: widening the search Evidence for a galactic diasporaAlien magic Post-biological intelligence First contact Who speaks for Earth? Appendix: Brief history of SETIBibliographyNotesIndex", "title": "The Eerie Silence: Renewing Our Search for Alien Intelligence", "url": "https://www.goodreads.com/book/show/9022434-the-eerie-silence", "average": 3.97, "cover": "https://images.gr-assets.com/books/1442887285l/9022434.jpg", "reviews": 164, "authors": [{"url": "https://www.goodreads.com/author/show/1876666.Paul_Davies", "name": "Paul Davies"}], "type": ["Nonfiction", "Science", "Science", "Space", "Science"], "outlinks": ["http://www.goodreads.com/book/show/9022434-the-eerie-silence", "http://www.goodreads.com/book/show/7842907-the-eerie-silence", "http://www.goodreads.com/book/show/7335024-the-eerie-silence", "http://www.goodreads.com/book/show/8817216-the-eerie-silence", "http://www.goodreads.com/book/show/15712741-uno-strano-silenzio-siamo-soli-nell-universo", "http://www.goodreads.com/book/show/24691623-podivn-ticho", "http://www.goodreads.com/book/show/20973000-un-silencio-inquietante-la-nueva-b-squeda-de-inteligencia-extraterrestr", "http://www.goodreads.com/book/show/298252.About_Time", "http://www.goodreads.com/book/show/137797.The_Mind_of_God", "http://www.goodreads.com/book/show/263006.God_and_the_New_Physics", "http://www.goodreads.com/book/show/817511.The_Goldilocks_Enigma", "http://www.goodreads.com/book/show/17135.How_to_Build_a_Time_Machine"]}