{"ratings": 12105, "userreviews": [{"userName": "Jacob", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/637062-jacob", "userReview": "June 2012Dissatisfied with their respective lots in life, four English women divorce their respective husbands, get a hefty advance for a book deal, and go off to Italy to enjoy the wisteria (a kind of pasta, I think). After a month of wisteria and freesias and syringa (more pasta?), the women all go to India, where they become spiritual. Following that, they go to Bali, and take handsome exotic Indonesian men as lovers. When they return home, wiser and more enlightened than before, they write wise and enlightened books.Wait, what? What was that? They don't go to Indonesia? Or India? They don't take lovers or become prayer-tourists? They just take a month-long vacation in an Italian castle, and they don't divorce their respective husbands? Their respective husbands later join them on their vacation? A WISTERIA IS A KIND OF FLOWER? WHAT THE HELL KIND OF BOOK IS THIS?A very delightful one, actually. You should read it."}, {"userName": "Brina", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "Elizabeth von Arnim strikes me as an interesting character. A writer brought up in influential circles, she married no less than five times in her life, and also enjoyed an affair with writer H.G. Wells after he ended his own affair with Von Arnim's rival Rebecca West. When one of von Arnim's disastrous marriages ended in 1921, she decided to spend a month at Italian castello Portofino as a way to clear her head. The idea for her classic book The Enchanted April has been born. Von Arnim had the book published in 1922, and today it merits inclusion in Erica Bauermeister's book 500 Great Books by Women. This book is as charming as the spell cast by Portofino castle, and is still widely read today. Lotty Wilkins and Rose Arbuthnot lived a life of relative obscurity in the Hampstead section of London. Both were virtually ignored by their husbands and had the longing to get away from it all. One day, Lotty Wilkins noticed an advertisement in the Times to rent an Italian villa named San Salvatore in April for £ 60. Mesmerized by the idea but not wanting to spend her entire nest egg on the castle, she recruits Arbuthnot to join her. Later, the women ask Lady Caroline Dester and a Mrs Fisher to join them as well, making the pair into a foursome, and, more importantly, making the castle rental into an affordable getaway.  Even though Wilkins and Arbuthnot made the initial arrangements, Mrs Fisher and Lady Caroline shrewdly arrive at the castle first to claim the better rooms for themselves. The latter two women enjoy a higher standard of living than the former and want to ensure that they have an enjoyable holiday. Almost instantaneously, San Salvatore works its magic on all four women. An air of happiness overtakes them and rather than being bitter with their station in life, they talk of love being in the air. Wilkins and Arbuthnot originally came to the castle to get away from their husbands, but within a week, both women write their husbands asking them to join them in this enchanting setting. Within the month, all four women are the best of friends, although this takes time, especially with Mrs Fisher. I thought the writing was basic yet descriptive and the plot to be straightforward with few twists and turns along the way. Von Arnim was writing from personal experience and recreated the Portofino castello where she enjoyed a monthlong holiday. This book was originally published within a year of her excursion, so the memories were fresh, especially the descriptions of the sea air and ever changing flowers. These descriptions of time and place ended up working for me much better than the plot developments. While Von Arnim's novel is considered her greatest book, it did not captivate me completely. I enjoyed the seaside setting of the Italian castle, but I enjoy a complex plot of intrigue as well as multilayered character development. The ladies here while pleasant do not pack the punch for me as protagonists, although I give them much credit, especially in their era, for desiring a holiday independent of their husbands. The Enchanted April was a pleasant read for a lazy summer afternoon. I am sure the castle itself would have cast its spell on me as it did the ladies in this book, but the novel will not be an all time favorite for me. Still, The Enchanted April is a worthwhile read, which I rate 3.5 stars."}, {"userName": "Steven  Godin", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "You can't best a good old holiday in warmer climates, but for the four ladies at the heart of Elizabeth von Arnim's 1922 novel there is more to it than that. The story is both a triumph to the transformative power of travel, and charmed with a decorative feel like that of a sun-kissed fairytale. von Arnim certainly cast a spell over me, and although we may only be talking of the Italian coast, it really felt like being whisked further away, enraptured in another world. Four very different women in terms of age and attitudes respond to an advertisement in the Times appealing to \"those who appreciate wisteria and sunshine\" to come and rent a small medieval Italian castle for a month. That month being April of course. The two original two respondents, Mrs Wilkins and Mrs Arbuthnot, are joined in their escapism by the youthful Lady Caroline, whose beauty and general melodiousness have become something of a burden to her, and the formidable Mrs Fisher, who first appears a bit of a grouch, but she slowly succumbs to the pleasant environment after initially insisting the other guests think of her as just as \"an old lady with a stick\". She sets about imposing her will on the rest, which makes up just one part of the story. Each lady is vaguely unsatisfied with their lot and Mrs Wilkins and Mrs Arbuthnot both have marriages of quiet English unhappiness, but that is about to change as both husbands are invited to come and stay, and it's this holiday reunion that sparks a deeper love, not just for the wives and husbands, but something is opened up in all of them.Elizabeth Von Arnim has a keen eye for small human failings, the little acts of pettiness and selfishness in which most people indulge. She is perceptive about the way people misread one another's good and not so good intentions, and the early chapters read like a comedy of miscommunication. I felt it wasn't until the second half that the novel really shines, the characters seem fuller, growing on you like a petite garden flower. She also, perhaps not surprisingly, given her famed German garden revels in the descriptions of the castle grounds and their beauty and colour, like reading a vivid painting as literature. Everything is centred on the castle and guests, there are no outside influences, creating it's own little world of delight. The surroundings really do rub off on the women, they eventually start to wake up, shifting in the perceptions of love and life.When I think back to how the novel opened with misery and cold rain, by the time I reached it's happy finale all was forgotten. The story was both humorous and wise, with a wisp of a premise, but von Arnim's brilliant writing transforms it into something much more, a possible satire on post-WWI British society, a sardonic rumination on human foibles, and a tale of women coming into their own. And most impressive of all, she makes it look effortless. The four main characters are precisely drawn, and their transformation during this break works it's way into the reader, you can't help feel but a rapturous joy in their presence.It is written in a way that evokes geniality, without dipping her toes into the waters of sentimentality, which is a testament to her talent as a writer. And it's sweet pleasant temperament and light-hearted nature made for an easy, comfortable read, in fact had it been any lighter in tone, one could read this whilst the book floats in mid air. This would be an ideal candidate for that 'holiday book' whilst relaxing by the sea with a slightly chilled chianti. On holiday reading of a holiday, perfect fit!, sadly I had to settle for the Parisian suburbs. But not to worry, von Arnim brings the holiday to you in the comfort of your own home."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "[Lady Caroline's personality, though world-weary in both the book and the film, seemed much more worldly and edgy in the movie. In the book there's no affair between Lady Caroline and another character's husband; there's the potential for one, but it gets nicely snuffed out before anything ever starts. Or maybe I just assumed there was an ongoing affair in the movie? (Dang, I need to go watch it again.) Also, Mr. Briggs' terrible near-sightedness is not in the book, but I thought it was a great addition in the movie.  (hide spoiler)]"}, {"userName": "Rowena", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/2990642-rowena", "userReview": "“All down the stone steps on either side were periwinkles in full flower, and she could now see what it was that had caught at her the night before and brushed, wet and scented across her face. It was wistaria. Wistaria and sunshine.”This was a lovely book about four English women who answer an advertisement to rent an Italian chateau in San Salvatore,Italy during a dismal April in England. The advertisement seems to be a godsend to these women, whose lives are not going the way they had hoped. As the title word “enchanted” implies, the story does have a slight fairytale-like aura to it, but not annoyingly so.I wasn’t expecting to enjoy this book so much, on the outset it looked like it would be an extremely slow read. However, it turned out to be very enjoyable. Elizabeth Von Armin is a masterful storyteller. Her writing is beautiful and witty. Also, for a floraphile such as myself, her descriptions of flowers were heavenly:“The wistaria was tumbling over itself in its excess of life, its prodigality of flowering; and where the pergola ended the sun blazed on scarlet geraniums, bushes of them and nasturtiums in great heaps, and marigolds so brilliant that they seemed to be burning, and red and pink snapdragons all outdoing each other in bright, fierce colour.”Additionally, as a person whose life has been changed by travel, I think this book is a great advertisement for travelling to renew your soul and learn more about yourself and others.My first Von Armin and it definitely won’t be my last. Highly recommended."}, {"userName": "Bobby Underwood", "userReviewDate": "Nov 25, 2014", "userURL": "http://www.goodreads.com/user/show/17994985-bobby-underwood", "userReview": "Much like the film this book by Elizabeth Von Arnim inspired, there is something peaceful here on these pages. This is a gentle novel about gradual internal changes brought about by the beauty of our surroundings. It is a book that reads itself as much as it is read, the author writing with the flow of the characters' thoughts and feelings, as their hearts are changed by the surprise of beauty.An ad to rent a castle in San Salvatore on the Italian Riviera will prompt two British women of slight acquaintance named Rose and Lottie to inexplicably leave their husbands behind for a summer that will change their lives and their marriages forever. Joining Rose and Lottie for this holiday is Mrs. Fisher, an older woman living in the past, and Lady Caroline Dester, a gray-eyed society beauty tired of being gawked at like a majestic statue. Diverse in nature and temperament, not to mention background, the three women interact uneasily together until flowers and the sea bring about a change in their very souls.Surrounded by fig and olive trees, plum blossoms and Tamarisk daphnes, and the fragrance of fortune's yellow rose and blooming acacias, the women begin to discover their roles at this castle by the sea and, in doing so, find themselves as well.This is a novel about life and love, told gently through the emotions of these women, as the surprise of beauty, and the warmth of being suddenly admired and seen as beautiful -- when they had not been before -- changes their simple lives, which were not so simple at all.A peaceful yet breathtaking portrait of love is painted by the author, in a pleasing and gentle manner readers will find enchanting. A beautiful read on paper, one that refreshes the soul and calms the spirit. It is about love restored and love discovered, along the wistaria-covered steps leading down to the sea. You will definitely enjoy this novel if you enjoyed the lovely film it inspired."}, {"userName": "Eve", "userReviewDate": "Apr 16, 2015", "userURL": "http://www.goodreads.com/user/show/1283951-eve", "userReview": "“It was, that year, a particularly wonderful spring, and of all the months at San Salvatore April, if the weather was fine, was best. May scorched and withered; March was restless, and could be hard and cold in its brightness; but April came along softly like a blessing, and if it were a fine April it was so beautiful that it was impossible not to feel different, not to feel stirred and touched.”\nOne of my aunts recently introduced me to fruit infused water. In the scorching Texas heat, which has already begun its brutal descent, cucumber lemon water has been extremely refreshing and invigorating–a definite heat repellant. That’s exactly how I would describe the taste and effect of this book on me after my previous reading choices.Four British women, all strangers and unique to each other, let a castle high up on the Italian Riviera in April to escape the dismal London weather. Although initially all seem to be evading the weather and personal living situations, the magical effects of their surroundings in Italy produce profound effects on each of them. At once introspective, each begins to realize what they yearn for most, and go about setting things to rights.While the theme reminded me of several of E.M. Forster’s novels, I loved the unique female perspective of each character. At turns hilarious and romantic, I enjoyed every aspect of it so much so that I color coded each character with sticky note flags so I could easily find passages when a good laugh is needed. I was smitten by all of the women, and found bits of myself in each of them. Von Arnim's poetic descriptions of gardens and the lush landscapes also enriched the novel; I felt like I was there. What an affordable and ideal way to travel!"}, {"userName": "Cecily", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "[He’s actually Frederick Arbuthnot in Hampstead and Ferdinand Arundel in town, rather like Jack/Earnest in The Importance of Being Earnest (see my review HERE).  (hide spoiler)]"}, {"userName": "Kim", "userReviewDate": "Apr 18, 2015", "userURL": "http://www.goodreads.com/user/show/4542979-kim", "userReview": "Some spoilers ahead, so beware. On a whim, I joined a few of my GR friends in a group read of this novel, which I'd not read previously. Originally published in 1922, the premise of the narrative is appealing: four unrelated women share a medieval castle on the Italian Riviera for a month, the \"enchanted April\" of the title. Each woman has a reason to escape her life in gloomy London and, in time, each woman is transformed by the experience.The novel gets lots of love from reviewers and I understand why. It has warmth, wit and charm. It's also an ode to friendship, love and the transformative power of travel, sunshine and a beautiful environment. In addition, there's a fairytale element to the work - the use of the word \"enchanted\" in the title is a bit of giveaway. As much I appreciate the strengths of the work, for me it fell away once the husbands of two of the characters arrived. I found both men's new appreciation for their wives difficult to believe. Fairytale endings are all very well, but the idea that badly damaged marriages are going to fix themselves quite so quickly stretches credulity just a bit too far. As did the behaviour of another male character, who turns up romantically interested in one of the women and transfers his interest to another within nanoseconds. Overall, while I like the female characters a lot, the men don't have much to be said for them. I'm not convinced that the enchantment would last after Italy, April and sunshine had disappeared. But then, I've never been much of a romatic. Reading this has made me want to run away to Italy for a while. The idea of a month in a medieval castle with views of the Mediterranean is very appealing indeed, whether or not it works magic. 3.5 stars, rounded up to 4 stars for the fun of reading the book with others."}, {"userName": "Sarah", "userReviewDate": "Apr 16, 2010", "userURL": "http://www.goodreads.com/user/show/1309716-sarah", "userReview": "Shall I tell you a secret? .. It's always been my fantasy to share a castle with my friends!This book was a joy to read! It satisfies so many of my literary cravings: kinship, validation, botanical beauty. There's a shy misfit, a beautiful socialite. All four voices, though quite distinct, resonated with me in some way. Elizabeth von Arnim was very smart in the way she developed characters and intertwined their separate narratives into one cohesive whole. I was just enough aware of literary device to be impressed by it, though nothing ever felt forced. It felt as effortless as a fresh, April breeze. I was made giddy by the deceptive simplicity of it all.I'm a little conflicted as to how I should shelve this book. My \"ink in full flower\" shelf refers to floral imagery (seen here in abundance) but also to poetic prose. Her prose, for me, is a little too sparse. Poetic, in its way, but not quite vivid enough. It's my only criticism, as I very much appreciated this novel. There's something so inclusive about it, --perhaps because it's a happy story about sad people, perhaps because she defended her characters while allowing for growth and transformation. There's a warmth and a sweetness, an innate hopefulness. I definitely recommend it."}, {"userName": "Sara", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "In the words of Cole Porter, It’s delightful, It’s delicious, It’s de-lovelyThe Enchanted April is sweet and soothing and heartwarming, like the holiday we find ourselves on with Lotty, Rose, Caroline and Mrs. Fisher. First off, I loved all the descriptions of the grounds and the gardens. I could see the Judas tree in bloom, the wisteria draping the arbors, and smell the frecias. The idea of a medieval castle in Italy was as charming to me as it was to Lotty Wilkins when she encountered the advertisement telling her it was available for let in April. Lotty cannot afford a castle on her own steam, but she devises a plan that makes it possible by letting it on share with three strangers. These women are each dissatisfied with the lives they lead, they are lonely, they are stifled and they are unhappy. Over the course of a month, we watch them blossom, just like the flowers. There is nothing spectacular here, no tense dramatic plot line, no scintillating love story, but there is charm and a lesson about what you owe to self over what you owe to others that today’s women, who are busy in a different way, could still learn from. I fell completely in love with Lotty. She was positive and friendly in the best possible way. I loved the way she bonded with the other characters and pulled them together. I loved her forgiving nature, her political incorrectness, her ability to separate the important from the petty, her honest and free nature, her love for life. I enjoyed every paragraph of this charmer and it was exactly the breath of fresh air that I needed...my own little holiday in Italy."}, {"userName": "Candi", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "This was a delightful little story! Four women, previously unknown to one another, leave a dreary winter in England behind to take a one month April holiday in a small, charming Italian castle after responding to an advertisement in a newspaper. The descriptions of the landscape are very lush and made me wish that I could make such an escape myself after a seemingly never-ending winter. “By the end of the week the fig-trees were giving shade, the plum-blossom was out among the olives, the modest weigelias appeared in their fresh pink clothes, and on the rocks sprawled masses of thick-leaved, star-shaped flowers, some vivid purple and some a clear, pale lemon.”The novel is also sprinkled with humor throughout as the four very different personalities either bluntly clash with one another or surreptitiously try to avoid one or another of the group. I often found myself smiling at some of their little antics and remarks. Each woman begins with her own struggle, discontent, and preconceived notions of what is expected of her as a female member of society.Lotty Wilkins, who is the first to embrace the charms of Italy and is the quintessential transformed spirit in the novel, begins her journey as one who really has very little confidence in herself. “Her clothes, infested by thrift, made her practically invisible; her face was non-arresting; her conversation was reluctant; she was shy.”Rose Arbuthnot, the religious and charitable but lonely wife, is initially described: “Steadfast as the points of the compass to Mrs. Arbuthnot were the great four facts of life: God, Husband, Home, Duty… Frederick had been the kind of husband whose wife betakes herself early to the feet of God. From him to them had been a short though painful step.”Mrs. Fisher, the elderly widow, who leaves England for Italy with the notion that “Hardly anything was really worth while, except the past… She had not come away from these friends (in London), these conversable ripe friends, in order to spend her time in Italy chatting with three persons of another generation and defective experience; she had come away merely to avoid the treacheries of a London April.”And finally, the beautiful, unattached Lady Caroline, never without a suitor to her own exasperation, believes “Worse than jokes in the morning did she hate the idea of husbands.” She wishes to be left completely alone and yet she seems to attract everyone to her; and her coldness and biting remarks towards others is unnoticed due to her overwhelming beauty. “People were exactly like flies. She wished there were nets for keeping them off too. She hit at them with words and frowns, and like the fly they slipped between her blows and were untouched.”Ultimately, no one is immune to the enchantments of Italy and companionship and each undergo their own individual transformations. They learn the value of friendship and that “Beauty made you love, and love made you beautiful.”Perhaps one would say that this book was too neat and tidy, maybe a bit unrealistic. However, I felt it was a breath of fresh air and a great reminder that a little respite and new acquaintances can help immensely to renew a dampened spirit."}, {"userName": "Fiona MacDonald", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/2417021-fiona-macdonald", "userReview": "Charming, beautiful and wonderfully witty! This was a complete hidden gem, but I loved it, loved the writing which was lyrical, loved the characters, who were all drawn to minuscule detail and mostly loved the exquisite descriptions of Italy and the flowering and fragrance of early April"}, {"userName": "Mariel", "userReviewDate": "Dec 18, 2011", "userURL": "http://www.goodreads.com/user/show/647547-mariel", "userReview": "There's a castle in Italy. Wisteria grows there. Can you picture the private wilderness? The castle is not important. It is a fortress to protect the plants. Don't tread on me. More importantly, can you see yourself there? It's a little place unmolested and unpressed on by who you are in all of those other places you can't quite see yourself in but you're still there all the same. If you wander around in that bit of wild life will you leave tracks in the dirt there too? You know that Camera Obscure song \"Let's Get out of this Country\" (great song)? \"We'll find a cathedral city, you'll convince me I'm pretty.\" What does it take to convince you?! It's freaking pretty. There's wisteria! (Is that purple? The crayon called wisteria is purple. Color me stupid if I'm wrong.) It's a bit of land. Be pretty. I feel like I should know more songs about this. Kings of Convenience's \"Gold in the Air of Summer\". Patrick Wolf's \"The Gypsy King\". \"How do I follow? What road to be choosing? Do I follow the star or The Gypsy King?\" I know this feeling. I'm thinking the special thing about The Enchanted April is that desire. Let's get out of this country and we will shine like gold in the air of summer. (If you know more songs like this please share. I've felt for some time that it was a kind of song I should have been collecting.)I know why the advertisement for the castle with the wisteria brought up such longing in Lotty Wilkins and Rose (I forgot how to spell her A name so we get to be on first name basis. I wish I felt better about this presumption). Sometimes I get to feeling too trapped in myself that going somewhere else helps so much. Going to the beach with a book (the mind escape is as vital). The taking of you out of what you can't shake as being a part of you. (Kristen tells me that I should kite surf when I get like that. I wish that I could afford one of these kites. I bet that kite surfing high would last.) I read with hope in my heart that they were going to really spend Lotty's nest egg (a life time of denying herself to save for a rainy day that she had not really intended on having. Oh!). Rose would get out of the guilt of what she believed she should be doing: religious guilt, the needs of others. Recurring problem in others and not a cliche at all. Elizabeth von Arnim is so good! I could feel the weight on their shoulders and it was enough. In November I went to Berlin with my twin sister. Spending all of the savings in one big go because the having that to look forward to is totally something I would do. Is it so easy, though?Elizabeth recommended this book to me (thank you, Elizabeth!!) because we were talking about breaking your own heart books. The special thing (I'm getting a bit obsessed with pinpointing to myself what makes something special) about The Enchanted April is that it takes that further. What's the missing part? What is going to become easier to carry if you do something for yourself that is solely for the pleasure of it? Paying attention to the wrong things and reasons until other people become part of that scenery you are the wrong you in. Why does changing something like the background alter the before unhindered path? If you willed yourself into the background I suppose it would...I wasn't an all new Mariel in Berlin. There was the socially awkward moment typical to me when I bought tickets to the super famous Roman and Greek antiquities museums and then didn't go in because the employee was a bitch to me. I turned tail and ran. Then I fell down outside. And it started to rain! (When it happened I told myself that I'd never tell anyone it did.) The only thing missing was a teary Madonna track like the sob scene in Never Been Kissed (that only made me bawl like no movie has ever made me bawl in my life because I was pmsing!). Other times I had such fun doing things that I could really do at home, or any where else. It didn't take much. It's like the wisteria. I loved so much imagining the past when in historical sites. I liked that the people didn't seem to want to force themselves to exude happiness. I liked that no one knew me. It was an illusion of freedom that's really always there (and not an illusion), if the part of you that allows that is there. All new. Did Lady Caroline aka Scrap (ha! I loved it when von Arnim switches to identifying her as Scrap midway. Revenge!) really get pinned by what she thought were other's needs on her person? Lotty could talk as she could only in her head before because she wasn't nervous. Maybe it has to do with echoes of your own mistakes haunting you. If you leave the haunted house? I think there's a lot to be said for that bit of land. The special thing about The Enchanted April is the desire to have that gold in the air of summer glow. Ah, but what about the after glow? I felt the potential. What about the April? I didn't feel like I got one enough. I don't know if this is a criticism or not. It's something that occurred to me and then stayed there in the back of my mind. Maybe I need a new setting to figure out what it is. The air between them -- Don't forget Mrs. Fisher, Mariel! Yes, they are accompanied by an old lady who has no one any longer. She holds onto her money because she WILL be taking it with her when she dies. She influenced me a bit towards Lotty, I must admit. Or I just agreed with her. Lotty lost me with all of her certainty once she is in the castle. She \"sees\" and knows and it is without question. What was the missing part of her and where was it found in Italy? It's true that a new morning can make what seemed hopeless the night before better. Was it something to be admired or does it just preclude me from knowing her beyond this? Will that good mood continue? I know that I wouldn't have been friends with Rose either. I think it is because they don't question a lot (and the goody two shoesness of it all). It was interesting that the air von Armin puts between them often reads like action that has taken place off stage. It wasn't important what happened as much as that it did. I'm not sure how I feel about that but it was an interesting dynamic, like a place out of time. Done deal. They were all in their own ruts for whatever reason (mostly the burden of expectation, perceived or otherwise) and took for granted. In a new place! I don't like to take for granted. (That's what is great about new places. You aren't used to them and you don't take for granted what you are not used to.)Mrs. Fisher and Rose's battle to be the mistress of the castle was too funny. Rose follows up every request for tea or food something with the same. \"Will you have some tea?\" \"Will you?\" Neither of them understand why the other is doing what they are doing. This is all my confused and roundabout way of saying that I felt the desire more than the change. Expectations persisted. Dammit, it was probably because I was not there. I could only see the advertisement for the wisteria... Why didn't they long for more when they got there. If you get the dream and then there are no more dreams then it is worse. I miss having the something to look forward to.\"How passionately she longed to be important to somebody again- not important on platforms, not important as an asset in an organization, but privately important, just to one other person, quite privately, nobody else to know or notice. It didn't seem much to ask in a world so crowded with people, just to have one of them, only one out of all the millions, to oneself. Somebody who needed one, who thought of one, who was eager to come to one- oh, oh how dreadfully one wanted to be precious!\"I want to see preciousness. If Scrap lived in mortal fear (it's all so life and death) of being grabbed at (it was all so tyrannical to her) then I live in ruin another perfectly good location fear of grabbing. I don't want to take it for granted that I \"see\" it all played out as Lotty does. Off stage? Not as good. Guess you can't get out of the country forever. Guess it is a good idea to find what the hell the missing thing is. The physics (I blame science) reason for breaking ones own heart in the first place is probably connected to that. And it feels less off stage if they notice as I'm noticing why they are doing those things. (I suspect it gets to that unimpeded train of expectations when what you're noticing is only what you are noticing. Not that I'm wise or nothing.)P.s. I really liked this book! (But they aren't invited to my villa. I wanna be pretty and you be handsome with someone who will sit under the trees and not worry about what god thinks about it. At least I don't agonize over what is proper or not! It could be so much worse.)"}, {"userName": "Edward", "userReviewDate": "Sep 13, 2016", "userURL": "http://www.goodreads.com/user/show/5895486-edward", "userReview": "Introduction, by Brenda Bowen--The Enchanted AprilChapter One of 'Enchanted August', by Brenda Bowen"}, {"userName": "Piyangie", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/48056505-piyangie", "userReview": "The Enchanted April is one of the most sweet books I have read. It is a classic; a classic which is timeless and which has universal appeal. The story is about four women, who are almost strangers, sharing a medieval castle for the month of April in Italy. These four women, having fled from their unhappy homes, reflect on themselves and their past in the quiet, beautiful, sunny surroundings; and at the end of their shared vacation, they come to understand themselves and what has made them unhappy better while developing the inner strength and peace to face the future. For a classic, the book surprised me, for it didn't have the diction one would expect from a classic. The writing was pretty basic and the flow was not smooth, nor graceful. Yet the story drew me in. I was enchanted by the descriptive set up and the wonderful choice of characters. The four females, three young and one old came from different backgrounds and had different problems. The young Mrs. Wilkins led a restrained life and was overtaxed in her domestic duties; the young Mrs. Arbuthnot was ignored and abandoned; the beautiful and young Lady Caroline Dester was tired of admirers and pursuers; and the old Mrs. Fisher needed a change in her monotonous life. It was interesting to read these different characters and their different problems. The characters were so true and real and their problems, their heartaches, all too relatable. This made it easy to connect with the characters and feel for them. I felt that there were so many expressions of these characters that I could personally relate to. And this made the reading touching and emotional. One could call this book, light and sentimental; and perhaps, it is so. But the honest and truthful account of the lives and problems of young and old women of her time, and their relevance for the modern day made the read appealing. And I honestly enjoyed the read and could recommend without reservation."}, {"userName": "Sue", "userReviewDate": "Mar 08, 2011", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "Very enjoyable story of 4 English women who holiday in Italy to escape their lonely lives in London. The transformations wrought by the Italian sun and the landscape are wonderful to behold. There is a delicious note of irony behind the narrative as we watch these women wake up in a decidedly un-feminist time from their pre-holiday existences. I definitely think I'll re-read this book in the future."}, {"userName": "Diane", "userReviewDate": "Nov 29, 2011", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "\"To those who appreciate wistaria and sunshine...\"This is the second Elizabeth von Arnim book I've read recently, and I've enjoyed them so much I plan on reading more of her novels. Enchanted April is the story of four unhappy Englishwomen who impulsively rent a castle in Italy in April, and the experience changes them for the better. One finds peace, another vitality, and several find love. I was especially fond of the character Lotty Wilkins, the one who was convinced that a month in Italy would invigorate them all. This novel is so delightful that I was ready to book a flight to Italy for next spring.Some favorite passages:\"Mr. Wilkins, a solicitor, encouraged thrift, except that branch of it which got into his food. He did not call that thrift, he called it bad housekeeping.\"[On Mrs. Wilkins first morning in Italy.] \"She lay with her arms clasped round her head thinking how happy she was, her lips curved upwards in a delighted smile. In bed by herself: adorable condition. She had not been in bed without Mellersh once now for five whole years; and the cool roominess of it, the freedom of one's movements, the sense of recklessness, of audacity, in giving the blankets a pull if one wanted to, or twitching the pillows more comfortable! It was like the discovery of an entirely new joy.\"\"She was having a violent reaction against beautiful clothes and the slavery they impose on one, her experience being that the instant one had got them they took one in hand and gave one no peace till they had been everywhere and been seen by everybody. You didn't take your clothes to parties; they took you. It was quite a mistake to think that a woman, a really well-dressed woman, wore out her clothes; it was the clothes that wore out the woman -- dragging her about at all hours of the day and night. No wonder men stayed young longer.\"\"Lady Caroline began to be afraid these two were originals. If so, she would be bored. Nothing bored her so much as people who insisted on being original, who came and buttonholed her and kept her waiting while they were being original.\" Note: There is also a lovely movie version of the book featuring Miranda Richardson, Joan Plowright, Polly Walker and Josie Lawrence."}, {"userName": "Laura", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/1394928-laura", "userReview": "John Steinbeck said, at the beginning of his book, Travels with Charley: In Search of America, that \"...we do not take a trip; a trip takes us.\" I was reminded of that quote so many times while escaping to Italy in this wonderful book. I don't think the power of a trip such as the one these four women took can be overestimated. We see in the novel how their lives were all transformed as a result. It's a pleasant story, but I think as women, as the primary (in most cases) caretakers of our homes and families, we all owe it to ourselves (and to our families) to take a trip like this, to go away by ourselves and rediscover ourselves. I can think of no human being who would not benefit from such an experience. I took off a couple of months after my only child went away to college, just escaped to the mountains for a couple of weeks. I needed to do it. That trip changed me, and I've wanted a repeat ever since (only this time, I'd like to take a month, as these women did!) This novel hit all of my happy places. I was dying to know how it ended, while at the same time never wanting it to end, not wanting to leave the gorgeous castle in Italy in the spring. There were a few little love stories that I wasn't expecting. The characters, particularly the four women, became real, and I grew to like them all. Her prose put me right there, feeling the sun on my face, and smelling the flowers all around me, even watching the moon at night, as the lights came on down in the village below. This was a fantastic escape read, and I highly recommend it. I'm adding it to my favorites shelf. ETA: I feel the audio narration really enhanced this book. I couldn't have asked for a better performance by Eleanor Bron."}, {"userName": "Amaranta", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/34720769-amaranta", "userReview": "Non mi capitava di addormentarmi leggendo un libro dai tempi delle elementari. Potrei dire che sono stanca, che non dormo la notte, che ero così rilassata da abbandonarmi a me stessa. Oppure potrei semplicemente dire che è stata una noia mortale. L’unica delizia le descrizioni del giardino, uno splendido castello italiano in cui mi piacerebbe passare non un mese, ma tutta l’estate!A mai più Mrs von Armin. Due tentativi mi sembrano più che sufficienti."}, {"userName": "Grace Tjan", "userReviewDate": "Apr 20, 2010", "userURL": "http://www.goodreads.com/user/show/1889855-grace-tjan", "userReview": "What I learned from this book (in no particular order):1.\tSpring in Hampstead is depressing. Italian trains are always late.2.\tEating macaroni with a knife, even though it is of the wormy, stringy variety, is an insult to a proper Italian cook.3.\tOther people’s chills are always the fruit of folly, and the worst thing that could happen is that if they are handed on to you, who had done nothing at all to deserve them.4.\tBeing too sexy for your own good is hazardous to your mental health.5.\tClothes that are infested with thrift make you practically invisible.6.\tIt is difficult to be improper without men around.7.\tThere were in history numerous kings who had had mistresses and there were still more numerous mistresses who had had kings.8.\tYou shall only write books that God would read. Books about long-dead mistresses are NOT something that HE would read.9.\tThere are miserable sorts of goodness and happy sorts --- the sort you’ll have at a flower-bedecked medieval Italian castle by the sea, for instance, is the happy sort.10.\tA flower-bedecked Italian castle by the sea can repair the most broken of marriages and induce you to fall in love with a random person.BUT SERIOUSLY, I liked this book until the men show up at the villa; I can appreciate how Mrs. Wilkins and Mrs. Arbuthnot have been changed by their time there, but the men just basically show up at the end of the book and suddenly (cue swelling music) IT’S AMORE. Everything is suddenly hunky-dory again between the estranged married couples, although Mr. Wilkins is still steeped in his miserly, ambulance-chasing mentality, and Mr. Arbuthnot originally came not to see his wife, but to make a grab, both personally and professionally, at Lady Caroline Dester the Flapper heiress. And Mrs. Fisher’s icy crotchetiness suddenly melts for, of all people, Mellersh Wilkins, a man who still primarily thinks of her as a walking cash cow for his solicitor firm. Briggs, the villa’s owner and perhaps the most sympathetic of the men, is incredibly fickle. Having come for Rose Arbuthnot, whom he thought to be a widow, he immediately transfers his affections to Lady Caroline once he laid eyes on her supernatural prettiness. And, despite protesting against the unwanted attention from men barely a dozen pages ago, including Briggs, the author tells us, conveniently, that it’s amore for them too.I guess I just have difficulties with accepting the villa as a sort of deus ex machina for all the characters; or perhaps I was just having a bad day when I finished the book. Or perhaps I’m secretly a repressed housewife who desperately needs a life-restoring, love-enhancing holiday at an impossibly beautiful Italian villa on the Amalfi Coast. Yeah, that’s it. Now I’m going to pester hubby about blowing out our hard-earned nest egg on some charmingly dilapidated pile somewhere sunny in Italy."}, {"userName": "HBalikov", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/929238-hbalikov", "userReview": "The Enchanted April is a comedy in the true tradition of Shakespeare. Though written as a novel, it has been easily converted to a play and a film. It is a book about time and place and the effects that those things have on our thoughts and deeds. As the book begins we find ourselves in London on a cold and wet winter day post-World War One. We quickly meet Mrs. Wilkins and Mrs. Arbuthnot who both are members of a “women’s club” that serves as a refuge when they are out and about fulfilling their duties and chores. Both women chance to see an advertisement in The Times concerning an Italian villa (castle) that could be rented for the month of April. Each finds herself unusually drawn to the possibility, and with Mrs. Wilkins' initiative, they form a friendship and write for further particulars. We are taken through the thoughts of both women leading up to the trip and during the month at San Salvatore.The author offers us a study of character and mores at a time in England when the Church of England was coping with the stirrings of gender emancipation and women were considering how they might have a life beyond “God, Husband, Home and Duty.” The other two women are a study in contrasts. The young and beautiful one (Lady Caroline), for whom everything has been easy and there has been no need to consider others. And, the quite old one (Mrs. Fisher), for whom the past and her encounters with the intellectual and the famous dominate any conversation in which she participates. None of the women are friends before agreeing to take together this April retreat to an Italian villa. We get to see them evolve in Italy both through their conversations and their innermost thoughts.There is both advantage and disadvantage in viewing this from about 100 years distant. It gives one the perspective of where things would be going socially and culturally, but it also tends to temper the immediacy of those issues of gender, class and religion that were so important then. This is much the same reaction that I have to reading G.B. Shaw. I thoroughly enjoyed my re-immersion in this story. It managed to do its magic on me very much like the villa was able to work its enchantment on these characters. (This book has been republished many times since its initial date in 1922. I acquired the illustrated Kindle edition. It has the most inviting drawing on the cover and the other illustrations were helpful in showing the regional charm that served as a background to the story.)"}, {"userName": "Bruce", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/1207684-bruce", "userReview": "Elizabeth Von Arnim (1866-1941) was born of English parents in Australia but soon returned to England where she grew up. She subsequently lived a somewhat peripatetic existence in Europe, finally settling in the US. This is a beautifully written novel. Von Arnim’s descriptions are evocative, her sense of pace perceptive and compelling. Her four main characters are distinct and individuated, although they are perhaps unrealistically stereotypical and a bit two-dimensional, as if created to prove a point or illustrate a type. The setting is idealized and unrealistic, unless one views it not objectively but either through the subjective judgments of the protagonists or as a fable. The author’s sense of humor is as acute as it is gentle, and the interactions among the ladies are often quietly hilarious. The main setting is floral, a place almost out of time itself, an Eden in which the characters can shed their usual lives and allow themselves to be remade.The story is about four unhappy English ladies, not even acquaintances at the onset, who rent an Italian castle for the month of April, each desiring to take a break from her present unsatisfying circumstances. The beauty of the location triggers profound changes in perspective in one after another of the heroines, gradually drawing other people into the healing ambiance of the experience.All of this does require the willing suspension of disbelief, not necessarily a bad thing. The trajectory of each of the women is from a situation of sadness and frustration to a state of fulfillment and happiness. At a deeper level it is a journey from sad self-absorption out of herself into a broader and more loving and accepting view of the world around them and especially of those with whom they usually live. If much of this comes across as contrived, that is beside the point. The changes that occur happen because of a radical change of perspective, an opening to possibility. The lovely setting in Portofino acts simply as a catalyst, and a beautiful one.This is a book that might be easy to dismiss as overly simple, cloyingly sentimental, and superficial. That would, in my opinion, be a mistake. There are several different levels to this narrative, and to explore and ponder them will reward the thoughtful reader. This is a charming little book, one very hard to resist. Don’t even try, and then it will be able to speak to you."}, {"userName": "Gabrielle Dubois", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/28233498-gabrielle-dubois", "userReview": "\"Oh, but in a bitter wind to have nothing on and know there never will be anything on and you going to get colder and colder till at last you die of it—that's what it was like, living with somebody who didn't love one.\"That’s why Lotty Wilkins decides, one day, to use her savings to take holidays in a medieval castle in Italy, near the sea, and share the rent of this wonderful place with three other English women whom she meets them by newspaper classifieds.Of course, the castle, the view on the sea, the mountains around, the flowers of the gardens are amazing, beautiful, divine. But what makes that this place will change Lotty’s life, and the one of the other women, is that they are, at last, ready to be happy, ready to change their lives, each one at her time, it’s their will to change. One must decide to be happy, then the world around becomes beautiful:“When Mrs. Wilkins woke next morning she lay in bed a few minutes before getting up and opening the shutters. What would she see out of her window? A shining world, or a world of rain? But it would be beautiful; whatever it was would be beautiful.\"Few details bothered me, like, it’s the very beginning of April in Italy — fig fruits will be matured end of August or September — and the author writes:“the fig-leaves were just big enough to smell of figs”I went down in my garden, to breath the fig leaves of my fig tree: it smells nothing, at least not figs, that’s what I thought. I know I focus sometimes on tiny details…!This said, the author has very well observed her characters’ lives. Each woman knows that something in their life goes wrong, but until they decided to go to Italy, none of them wanted to think about it: they had closed their eyes on their lives:“For years she had taken care to have no time to think.”But so far, see this fact is just the first step:“San Salvatore (the castle) had taken her carefully built-up semblance of happiness away from her and given her nothing in exchange.”The stories of these women, are stories of inner quest. But when you’ve already done it —getting rid of all what was wrong in your childhood and education; realize who you really are and what you really want — even if you still don’t have what you want yet, it’s no use reading again and again about this subject, unless…Unless you let yourself carried by the story, the flowers fragrances, the deep blue of the Italian sea and sky, the sharp British humour, love, and some well thought quotes:“How warm, though, things like admiration and appreciation made one feel, how capable of really deserving them, how different, how glowing. They seemed to quicken unsuspected faculties into life.”Once again, it’s something I do for a long time now, starting with my children: I’ve always told them they’re beautiful and intelligent, so that they feel beautiful and intelligent. (Of course, I think what I say, which is easier: my children are the best! Forgive me, I’m a mother!)Unless you wish you were in Italy, having time to do what seems nothing, but what is what we should have time to do:“The women sat on the low wall at the end of the top garden after dinner, and watched the enormous moon moving slowly over the place where Shelley had lived his last months just on a hundred years before.”"}, {"userName": "Duane", "userReviewDate": "Jul 31, 2014", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "One of the real pleasures of reading is discovering those hidden gems, those novels that I had never heard of, that turn out to be perfectly enjoyable. The Enchanted April is somewhat of a fairytale, a fantasy that could happen, probably has happened somewhere before. It's the story of four English women, Londoners, who are unhappy with their personal lives, especially with the romantic side. They see an advertisement in a London paper for the April rental of a castle in an Italian fishing village and the magic begins. Mrs. Wilkins (Lotty), Mrs. Arbuthnot (Rose), Mrs. Fisher, and Lady Caroline Dester (Scrap), are the four vacationers, not friends, just acquaintances, each with their personal reasons for wanting to get away, to reflect on the past and renew their outlook for the future. Elizabeth von Arnim so beautifully describes the setting and the characters that you feel part of the story. The characters are wonderful, I especially liked Lotty and Rose, and the descriptions of the flowers and gardens surrounding the castle made the setting seem capable of changing the lives of the characters. Change them it did, the magic happens and how it affected each one of them is what makes the story so enjoyable."}, {"userName": "Jesse", "userReviewDate": "Sep 02, 2011", "userURL": "http://www.goodreads.com/user/show/1432036-jesse", "userReview": "April is apparently the cruelest month, but my nomination would probably be those four weeks or so spanning the middle of October on up to Thanksgiving; I can't speak for anyone else, but for anybody on an academic calendar it's an interminably long period with not even a single three day weekend for some kind of brief respite, and Thanksgiving break is reached more or less in a state of exhaustion. It was during this period that I realized that if I couldn't actually take a vacation I was going to take a literary one, and I took this off the shelf, which I had been saving for just such an occasion. And it pretty much did the trick. It's a lovely novel, and I took a long, leisurely amount of time to read it, picking it up on occasions when I just couldn't bring myself to read anything else (even though there was always so much more that should and needed to have been read) or during bouts of insomnia caused by incessant thinking over what I still needed to get done. There's not much I feel like I can say about this novel, not that I feel much needs to be said; it's more or less how four British women, similar only in a vague but profound sense of dissatisfaction with their lives, on a whim rent a villa on the Italian coast for the titular month. But what seems like an indulgent lark quickly blossoms into four weeks of rapturous transformation for all four women (as well as several individuals they are close to). Once the women arrive in Italy the narrative is sustained through the type of problems such as \"oh, how is Mrs. X going to respond to Mrs. Y doing Z?\", but that's a great part of its appeal—it's not a matter of if a character is going to undergo positive mental, emotional and even physical transformation, but a matter of how much. Really, Von Arnim manages to do a whole lot with material that many other writers would have a hard time using to sustain a short story (though Von Arnim doesn't realize that a little landscape description goes a long way). In a curious coincidence, in 1922 Eliot proclaimed April \"the cruellest month,\" while the very same year Von Arnim declared it enchanted. Though the traditional literary canon would disagree, I have to side with Von Arnim on this one. \"Rose clasped her hands tight round her knees. How passionately she longed to be important to somebody again—not important on platforms, not important as an asset in an organisation, but privately important, just to one other person, quite privately, nobody else to know or notice. It didn't seem much to ask in a world so crowded with people, just to have one of them, only one out of all the millions, to oneself. Somebody who needed on, who thought of one, who was eager to come to one—oh, oh how dreadfully one wanted to be precious!\""}, {"userName": "Marialyce", "userReviewDate": "Apr 11, 2012", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "Loved, loved, loved it.This was a perfect peaceful book. There were no major issues nor were we trying to solve the problems of the planet. This was just a book where the important message was to be selfish, to allow yourself to get back to the things that are always the most important, that of your love for each other. Yes, it does sound oh so maudlin, but this sweet, kind book is just what I needed. It made me say ah at the end (and really mean it!)Our story follows four woman thrown together in the rental of a property in Italy. Their lives are all awry and going in various directions that was not good for them nor their psyches. So, this house is rented first by one and then the next until a compliment of four ladies, who did not know each other from a hole in the wall, move in together to spend their quiet alone time. They, particularly two of them, do not want to be disturbed but the charm of the house and that of the other two ladies breaks down their barriers and they become loving people willing to take on all that that word connotes. Enter this home in Italy and life, and of course things Italian like food and flowers and oh yes, the wine, start to change the attitudes and the love life of these women (well really the love life of only three of them!) It makes the ladies realize that their lives need that four letter word and how they do find it is the glory of the novel. All of them change in the way in which they view themselves and perhaps more importantly in the way they view others. It is a simple yet elegant story that was gentle as a Spring breeze on an April day."}, {"userName": "piperitapitta", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/35550351-piperitapitta", "userReview": "Ingannevole è Aprile più di ogni cosa.Oggi il cielo è azzurrissimo, terso, luminoso.Probabilmente è lo stesso cielo che le quattro donne protagoniste del romanzo, Rose e Lotty, Mrs Fisher e Lady Caroline, hanno guardato a bocca aperta spalancando le finestre del castello di San Salvatore.Ma partiamo dal principio, cioè da quando a Londra, in una giornata grigia e piovosa, la timida e insoddisfatta Lotty Wilkins legge sul Times l'annuncio dell'affitto del castello di San Salvatore in Liguria, per gli amanti del glicine e del sole recita l'annuncio, e vincendo il suo stesso impaccio, tanto forte è il desiderio di sottrarsi per un mese ad un ménage matrimoniale spento e insoddisfacente, propone a Rose Arbuthnot, sconosciuta frequentatrice del suo stesso club, di dividere le spese e partire con lei.Non bisogna ignorare il fatto che il romanzo è scritto nel 1922 e che se oggi può apparire normale che due donne sposate decidano di \"abbandonare\" i mariti e regalarsi una vacanza in Italia, anche nella modernissima Londra è necessario ricorrere a qualche piccolo sotterfugio per vedere realizzato il proprio desiderio; piccoli inganni ai quali anche Lotty dovrà ricorrere, ma non Rose che, invece, annullata nel volontariato e assorbita da una fede bigotta, ha un matrimonio che marcia nel disinteresse di entrambi i coniugi su binari paralleli.E così, una volta sistemati i mariti e trovate per mezzo di un altro annuncio sul Times l'anziana e nostalgica \"dei tempi andati\" Mrs. Fisher e la giovane e affascinante Lady Caroline con le quali dividere le spese per l'affitto, dalla piovosa Inghilterra, ci troviamo anche noi, come d'incanto, a spalancare le finestre sulla riviera ligure inondata di sole, colori e profumi.Ed è lì, completamente rapite dalla bellezza della natura, estasiate dalla vista del mare, stordite da profumi inebrianti, sedotte da un tripudio di colori e dal continuo avvicendarsi di glicini rose e fiori mai visti prima, come l'albero di Giuda che ammanta la terra di petali color rosa intenso, che Lotty e Rose, Mrs. Fisher e Lady Caroline, iniziano lentamente a fare i conti con se stesse e a far pace con il proprio mondo, a partire da quello interiore.È un romanzo in cui al silenzio esteriore, alla pace in cui si trovano immerse e assorte le quattro donne, si contrappone con intensità il brulichio dei pensieri di ciascuna di loro. Sembra quasi di sentire il ronzio delle loro menti, di vederne crescere, come fiori nei campi, il desiderio di pacificazione, di armonia e di vedere innaffiare, ogni giorno che passa, i teneri germogli che stanno spuntando.Ed io, all'inizio, mi sono lasciata inebriare e convincere da questo potere della Natura, perché io stessa ne sono \"vittima\".Quante volte davanti ad un tramonto, o sulla spiaggia delle Maldive dov'ero fuggita ormai più di quindici anni fa in cerca di silenzio e tranquillità, mi sono trovata ad abbeverarmi della bellezza che mi circonda e a dire a me stessa come si può essere infelici di fronte ad una spiaggia dalla sabbia bianca e finissima, ad un gatto che si rotola al sole, ad un campo di lavanda, al sole che si tuffa nel mare! Quante volte mi sono detta che se io amo il mondo, se io amo una persona, quella persona e il mondo non possono che ricambiare il mio amore?Eppure non è così, non è vero, per questo credo che la bellezza della Natura sia ingannevole, per questo mi sento truffata.Così, proseguendo nella lettura di «Un incantevole Aprile» in cui, invece, tutte le tessere del mosaico si incastrano alla perfezione ed ogni più piccola asperità viene levigata semplicemente grazie all'incanto del luogo, per contrapposizione - o per rappresaglia? - ho iniziato a pensare, e a ripetere tipo mantra a me stessa, in una mente che brulicava anch'essa di pensieri, che Aprile è il più crudele dei mesi e che non è affatto vero che la bellezza, che la Natura, sistema ogni cosa.Al punto che sabato, nel consueto incontro con il mio psicoterapeuta, tra il racconto di un attacco di panico e di un sogno, gli ho parlato anche di questo.Patrizia - mi ha detto - ma lei confonde la bellezza della Natura con la ricerca dell'armonia! La Natura per mostrarle la sua bellezza deve sottostare ad equilibri che, se li osserva bene, possono invece apparire crudeli, come quello del leone che sbrana una gazzella!E allora, rabbrividendo al pensiero della povera gazzella, mi chiedo, come la mettiamo?Quest'Aprile com'è, incantevole o crudele?Alla fine penso che forse sia entrambe le cose, perché, ancora forse, per accettare che il leone sbrani la gazzella ho bisogno di vedere, come anche questa mattina sulla strada che da casa mi porta al lavoro in questa Roma ai margini, un volo di aironi sopra la mia auto, un volo che mi aiuta a credere che ad ogni Aprile crudele possa corrisponderne sempre, o quasi, uno incantevole.E io, almeno per questa volta, ho deciso, di lasciarmi incantare ed ingannare.Elizabeth von Arnim, il cui vero nome era Mary Annette Beauchamp era cugina di Katherine Mansfield Beauchamp.Se penso ai racconti che ho letto della Mansfield e li confronto con questo romanzo della von Arnim, mi accorgo che entrambe fanno della Natura un protagonista aggiuntivo delle loro storie, ma se nella von Arnim la Natura agisce da elemento conciliatore, nella Mansfield è sempre spettatrice di un dramma interiore celato.Come dire che se la visione della vita della von Arnim era romantica (ma avrò bisogno di leggere altro di quest'autrice per trovarne conferma) quella della Mansfield era di rassegnazione di fronte all'ineluttabile crudeltà della vita stessa.Chissà se la Mansfield, appena un anno prima che la sua giovane vita venisse stroncata, aveva letto e condiviso «Terra desolata» di Eliot piuttosto che \"Un incantevole Aprile\" di sua cugina Mary Annette? E la von Arnim, aveva letto Eliot? Ed Eliot aveva letto la Mansfield e la von Arnim?Aprile è il più crudele dei mesi, generaLillà da terra morta, confondendoMemoria e desiderio, risvegliandoLe radici sopite con la pioggia della primavera.L'inverno ci mantenne al caldo, ottuseCon immemore neve la terra, nutrìCon secchi tuberi una vita misera.(Thomas Stearns Eliot)"}, {"userName": "Chris", "userReviewDate": "Apr 15, 2011", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "I find Enchanted April to be an extremely difficult book to review. The book is too close to my heart. Not in the same way that Possession or The Lord of the Rings are, but in some secret hidden corner.Enchanted April is about four women who rediscover life. It is about four women who rediscover the meaning of friendship. It's about four women who learn to leave the prejudices behind. It is about the discovery and rediscovery of love. Above all, it is about Italy.The book is one those perfect books, nothing seems to happen but everything happens. The book is part fairy tale, part reality, and part oh so British magical Italy. It is old-fashioned, but current. It is a perfection of contradictions. It is a love sonnect in prose that smells of flowers and feels of sun and warm grass. Good food and wine are on offer.And everyone, regardless of age, size, or sex, is beautiful."}, {"userName": "Cristina", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/22024257-cristina", "userReview": "Per il mio personalissimo gusto questo libro è tollerabile solo perché è stato scritto nel 1922. Mi ha irritato dall'inizio alla sdolcinatissima fine, che mi è giunta ancora più intollerabile dopo che per un attimo avevo sperato (contro ogni speranza) che l'autrice avesse un colpo di coda e ci desse un bel sano divorzio invece di questo diabeticizzante finale in cui amore, amicizia e cuoricini e arcobaleni ci sommergono.Lo salva, parzialmente, lo stile delizioso di scrittura, davvero bello, e la meravigliosa descrizione del giardino, ma per il resto le ha tutte: sentimentalismo zuccheroso, quattro protagoniste antipatiche (se mi diceva ancora una volta quanto fosse bella e adorabile Lady Caroline Dester mi mettevo a urlare), mariti e ammiratori che si dovrebbero badilare e invece si accolgono a braccia aperte, un bel po' di stereotipi di stampo inglese sugli italiani (siamo così pittoreschi!).Oh, lo so di essere in minoranza, e giuro che i lati positivi li vedo, solo che a me mettono voglia solo di leggermi una di quelle cretinate in cui due manco si stringono la mano e già trombano come ricci. Quasi quasi stasera mi guardo Grey's Anathomy, che in quanto a trombare come ricci non scherzano nemmeno loro."}], "description": "A recipe for happiness: four women, one medieval Italian castle, plenty of wisteria, and solitude as needed.The women at the center of The Enchanted April are alike only in their dissatisfaction with their everyday lives. They find each other—and the castle of their dreams—through a classified ad in a London newspaper one rainy February afternoon. The ladies expect a pleasant holiday, but they don’t anticipate that the month they spend in Portofino will reintroduce them to their true natures and reacquaint them with joy. Now, if the same transformation can be worked on their husbands and lovers, the enchantment will be complete.The Enchanted April was a best-seller in both England and the United States, where it was a Book-of-the-Month Club selection, and set off a craze for tourism to Portofino. More recently, the novel has been the inspiration for a major film and a Broadway play.", "title": "The Enchanted April", "url": "https://www.goodreads.com/book/show/3077.The_Enchanted_April", "average": 3.96, "cover": "https://images.gr-assets.com/books/1162239197l/3077.jpg", "reviews": 1813, "authors": [{"url": "https://www.goodreads.com/author/show/2098.Elizabeth_von_Arnim", "name": "Elizabeth von Arnim"}], "type": ["Romance", "Fiction", "Classics", "European Literature", "Travel"], "outlinks": ["http://www.goodreads.com/book/show/3077.The_Enchanted_April", "http://www.goodreads.com/book/show/398352.The_Enchanted_April", "http://www.goodreads.com/book/show/6619188-the-enchanted-april", "http://www.goodreads.com/book/show/24940946-the-enchanted-april", "http://www.goodreads.com/book/show/11216255-the-enchanted-april", "http://www.goodreads.com/book/show/1586995.The_Enchanted_April", "http://www.goodreads.com/book/show/785078.The_Enchanted_April", "http://www.goodreads.com/book/show/8476051-the-enchanted-april", "http://www.goodreads.com/book/show/20565684-the-enchanted-april", "http://www.goodreads.com/book/show/25214277-the-enchanted-april", "http://www.goodreads.com/book/show/6430532-the-enchanted-april", "http://www.goodreads.com/book/show/13570126-the-enchanted-april", "http://www.goodreads.com/book/show/32201946-the-enchanted-april", "http://www.goodreads.com/book/show/14623575-un-incantevole-aprile", "http://www.goodreads.com/book/show/19439014-the-enchanted-april", "http://www.goodreads.com/book/show/1140698.Elizabeth_and_Her_German_Garden", "http://www.goodreads.com/book/show/2999223-the-solitary-summer", "http://www.goodreads.com/book/show/1294375.Vera", "http://www.goodreads.com/book/show/1035708.Mr_Skeffington", "http://www.goodreads.com/book/show/1003617.The_Pastor_s_Wife", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}