{"ratings": 42, "userreviews": [{"userName": "Fran", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/12653120-fran", "userReview": "Guangdong, South China 2015. Fedor Cohen is the primary owner of The Tiger Shoe Factory. The factory consists of an administration building, two production plants and two dormitories. Fedor, a Jewish Bostonian, runs his business with precision and order, resisting change. Alex Cohen, Fedor's twenty-six year old son, is being groomed to take over the family business. A father-son conflict of ideas is on the horizon.Upon scrutiny, Alex realizes that maintaining the bottom line and increasing productivity comes at a cost. In addition, he can compare and contrast the lifestyle he and Fedor experience living in the Intercontinental Hotel with the dormitory living of migrant workers. The workers wait in long lines to shower. Hot water is available only at 8 AM or 8 PM. Cohen, the elder, tells Alex that he has poured his life's blood into the factory for the sake of the family. A hefty dose of Jewish guilt!Enlightenment comes slowly to Alex through his association with Ivy, a stitcher in the sample room. He learns that managers supervise their workers and assess any wasted movements during the work day. A worker could cost the shoe factory perhaps eight minutes of work in a week. Totally unacceptable! Alex has ideas. He has compassion. Should he, could he, risk expressing his ideas to his father whose profit margin is achieved through hard work, corruption and bribes? Ivy, in her own way, tries to shape Alex's path.\"The Emperor of Shoes\" is a work of literary fiction which shines a spotlight on doing business and change, as a byproduct of technology and societal awareness in South China. \"The Emperor of Shoes\" by Spencer Wise is an excellent debut novel.Thank you HARLEQUIN-Hanover Square Press and Net Galley for the opportunity to read and review \"The Emperor of Shoes\"."}, {"userName": "Jennifer ~ TarHeelReader & Traveling Sister", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/32340179-jennifer-tarheelreader-traveling-sister", "userReview": "5 exciting stars to The Emperor of Shoes! 👠 👞 👠 👟 👠 The Emperor of Shoes is an unexpectedly delicious read. Alex Cohen is a twenty-six-year-old Jewish expatriate living in southern China. He is needed there to run his family’s shoe factory. Alex is reluctant in taking this role, and once he does, as he travels the floors of the business, he is shocked by the exploitation and corruption he witnesses therein. Alex then meets Ivy, a seamstress in his factory, who is secretly a political organizer, threatening to pull the rug out from under his family’s business if she can get all the laborers on the same page. I absolutely loved Emperor of Shoes. It’s a cross-cultural story with emotionally and politically charged issues, along with the threat of vast systems’ changes as society, technology, and social mores evolve. I enjoyed observing the dynamic between Alex and his father, and also the changes within Alex, as he figures out his own ethics; a coming of age for him, really. Overall, Emperor of Shoes is an original story about change on different levels and how explosive it can be to relationships. Thank you to Spencer Wise, Hanover Square Press, and Edelweiss for the ARC. Emperor of Shoes is now available! My reviews can also be found on my blog: www.jennifertarheelreader.com"}, {"userName": "Linda", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "Last words......Dad said, \"On his deathbed, Rabbi Akiba told his son, 'Wear a decent pair of shoes.' Those were his last words.\"And in keeping shoes worthy of Rabbi Akiba, Alex Cohen, via Boston to southern China, assists his father in a family-owned shoe factory in Guandong. Being Jewish and living in China doesn't necessarily make you a citizen of the world. According to Alex, being Jewish, alone, always makes you an outsider.Alex embraces his newly acquired life with a bit of intrepidation. But Alex embraces Ivy far more. Ivy's given name is Hanjia Liu. She works as a stitcher in the sample room of the factory. Ivy's talents are multi-faceted as she is a former organizer at Tiananmen and secretly delivers pamphlets for organizing a workers' union. Ivy lives up to her newly dubbed name as she weaves cautiously in and out of the dark corners in order to bring the light of a pro-democratic Chinese party. It is Ivy who opens the dulled eyes of Alex to what is really going on in his father's factory.With the winds of revolutionary ideas swirling around him, Alex realizes that something is amiss in his father's usual day-to-day operations. He is repeatedly stepping back and allowing Alex more say in the company without Alex being properly groomed for the responsibilities. Money seems to pass readily from hand to hand. It is these transactions that prompt Alex into pulling back the silken curtains.Spencer Wise creates a beautifully crafted novel with fine-tuned main characters surrounded in the upheavals of social and technological change. The old ways no longer benefit neither the citizen nor the craftsmanship of the present day worker. Revolutionary ideals may even wedge their way between personal relationships including father and son. The answers we seek may not be the answers we welcome. Deftly written, The Emperor of Shoes is one to watch.I received a copy of The Emperor of Shoes through Goodreads Giveaways. My thanks to Hanover Square Press and to Spencer Wise for the opportunity."}, {"userName": "Marialyce", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "My reviews an be found here: https://yayareadslotsofbooks.wordpres...Life always seems to be in a state of flux. As we grow, we develop relationships, some of them tenuous which have a pull and tug connection between our selves and our world in which we live. Alex Cohen is a young Jewish man living in Southern China. He and his father own a shoe factory and have a relationship that can be considered at times contentious. Alex's dad is the boss. His word is law and though at times his words to Alex are funny, they often hurt. Alex is in a relationship with a Chinese revolutionary, a young girl who works in the factory. She and others are looking to change China. They want a more democratic form of leadership and as Alex assumes and becomes the head of the company, he sees how the workers are being exploited. Alex loves his father and yet when he sees the climate the workers are forced to be in, and their plight, it sets him on a collision course against the father who has always been his rock. Alex runs up against the idealism of what he wants to see happening and the love of a father and the heritage he carries. He also finds himself in a dangerous situation with the powers that be.Alex's father is ambitious, wanting success to be theirs, always striving for more, often disregarding how one does acquire that more. China is portrayed, twenty five years after Tiananmen Square, as being a place ripe for democracy yet controlled by a few who would use any means to keep their position. It is a place ripe for change and as Alex himself fells change coming, he witnesses not only a country, a people wanting to so embrace human rights and needs, but he himself grabbing onto change within the person he strives to be. Beautifully written, this story unfolds among a world that is changing too fast for some. Can Alex find that freedom he longs for, freedom from his father, freedom from heritage, and freedom that will not shatter everything? Can he save the relationship he has had with his father and with the young Chinese revolutionary, Ivy? \"Relationships are like glass. Sometimes it's better to leave them broken than try to hurt yourself putting it back together.\" Can China also find their way in recognizing the human in every person who lives and works within their massive country? Thank you to Spencer Wise, Hanover Publishing, and Edelweiss for an advanced copy of this book. It was quite an interesting look into a world where freedom is not really free."}, {"userName": "Sue", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/16761562-sue", "userReview": "“Only the wearer knows if the shoe fits.”President Xi JinpingOne of the most marvellous things about reading is that one can be transported to another world. Here, the reader is virtually transported to two. The eponymous ‘Emperor of Shoes’ is an aging Jewish Bostonian and part-owner of a shoe factory in Guangdong, Southern China. His 26-year old son Alex, the narrator, is being groomed to follow in his formidable father’s footsteps. Unusually and without recourse to flashbacks, Spencer Wise interweaves the historical Jewish threads of his story with the current communist/capitalist dichotomy of modern China. This is handled with tremendous tenderness, subtlety and insight. But also with grit.Alex has fallen hook, line and sinker for a Chinese woman who works in the factory. Ivy is different to most of the other workers, she’s fluent in English for one thing. She’s also committed to an underground revolutionary group fighting for fairer work practices in China. Alex - so used to pleasing his arch-capitalist father - now finds himself swayed by the influence of his socialist squeeze. With his conscience sorely tested, the Jewish guilt bubbles up nicely. But things are about to get really complicated for Alex when the corruption inherent in the Chinese system of doing business comes into play.Turning a two-dimensional design of a shoe into a three-dimensional object to wrap around something as complex as the human foot is a complicated process requiring a great many stages of development. Likewise, turning a callow young man into a mature thinking adult requires several degrees of nuanced fine tuning on the part of the author. Spencer Wise achieves this growth of character with conviction, empathy and humour. A terrific debut and an interesting new voice. Warmly recommended.My thanks to No Exit Press for the ARC via NetGalley."}, {"userName": "Creager", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/31294748-creager", "userReview": "In the Emperor of Shoes, Spencer Wise, dares to ask for a little more buck for the bang. 26 year old, Jewish expatriate Alex has a lover and is being groomed to take over his father’s shoe factory in China. Shouldn’t that be enough? Amidst the fine line of a woman’s instep, his living father as the voice in his head (oh vey), and the bribing of officials, Alex awakens to the subjugation of a people in its totality.Snippets:The father/son relationship is alive/patronising...realIvy, as far as I'm concerned manipulated/used/took advantage him, and I'm okay with it.Die Jo was the bees knees"}, {"userName": "Thebooktrail", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/25264586-thebooktrail", "userReview": "Three words for now:Insightful, thought-provoking and evocative"}, {"userName": "Swati", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/2992522-swati", "userReview": "In 'The Emperor of Shoes' set in Guangdong, China, Spencer Wise tells us the story of Alex Cohen, a 26-year-old heir to a thriving shoe business. Of course, the shoe business thrives on the backs of underpaid Chinese workers, which Alex begins to see slowly.Wise turns the spool unhurriedly, the various threads interleaving beautifully. There is the father-son relationship, which is about the proverbial young son trying to match up to his father's expectations, and go from being constantly controlled and dismissed to being noticed. Laced with wry humour, there is a certain tenderness about Alex's relationship with his father although it looks abrasive, and a bit heartless at times, on the outside.There is the romance with Ivy, which also brings up the angle of foreigners in China, an American Jew to be specific here, and their perspectives of the country. \"Forced outside, I imagined us all walking aimlessly down the street in a herd, scrutinizing signage we couldn't understand, ignoring the plosive tongue-clack of cabdrivers, a slow barnanimal procession down the highway...\"Well, Alex is not just another white man as he wants to prove to everyone and, above all, to himself. He begins to force himself to come out of his father's shadow, and out of the cocoon of his own mind. This is where things get interesting. And also a little dangerous.This is also where Wise tells us about the inner machinations of Chinese business politics, and the all-important guanxi that can mean life or death. We already know enough about the lives of Chinese workers, thanks to media bombardment, and Wise talks appropriately to us as informed readers by bringing in aspects of the issue where needed.I thoroughly enjoyed reading this book. I just wish the ending was a bit more toned down, and not so easily resolved or understood.I will end this review with the \"old lines of Rabbi Hillel, 'If I am not for myself, who will be for me? But if I am only for myself, who am I? If not now, when?'\"Thank you to NetGalley and NoExit Press for giving me this ARC for a review."}, {"userName": "Amy Meyerson", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/66817773-amy-meyerson", "userReview": "I had the pleasure of meeting Spencer Wise at the ALA (American Library Association) Midwinter Conference and knew from the way he discussed his novel that I was in for a treat. The Emperor of Shoes follows Alex Cohen as he navigates taking over his family's shoe factory in southern China while trying to create a fairer work environment for its employees. To complicate matters, Alex is torn between his growing feelings for an outspoken worker, Ivy, and his complicated desire to please his father. Alex's first-person narration is deeply compelling and deeply human. His perspective, coupled with details only an insider–Wise's father owns a shoe factory in China where Wise spent time living in the dormitories–could know, creates a complex and dynamic image of modern China. I simply loved following Alex through his decision-making process. Alex makes unexpected connections between the plight of the Chinese factory worker and that of his own Jewish family in ways that promote empathy, both within his character and the reader. Though this book grapples with some grim realities, it's inherently optimistic and definitely worth a read."}, {"userName": "Eric", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/40622204-eric", "userReview": "My wife read this one and had nothing but good things to say about it. Great writing style, interesting plot, and fascinating characters."}, {"userName": "Alex Wise", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/31592994-alex-wise", "userReview": "I'm biased because Spencer is my cousin but this is a terrific page-turner that develops compelling characters and educates the reader about the shoe biz - all while covering an enormous amount of socio-economic terrain as well. Highly recommended!"}, {"userName": "Natalie", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/4770340-natalie", "userReview": "This book really has it all - humor, compassion, morality, politics - all rolled in to a wonderful story with wonderful characters who all had depth and complexity and conflict. It spoke of big and small issues on a variety of levels, all thought-provoking and real. I really, really liked this book."}, {"userName": "Lizzie", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/68753062-lizzie", "userReview": "More than a story of a father running the family owned shoe factory in China. Extending beyond his strained, unconventional relationship with his son Alex. In working with his father at the factory, Alex uncovers deception in his personal life and business. He observes the volatile relations between factory workers and government. And a country's people desperate need to stand up, be heard and to matter, has Alex questioning what side is he on....."}, {"userName": "Leslie", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/5415323-leslie", "userReview": "Angsty, immature Alex Cohen takes over his father's shoe factory in Foshan, China in this clash of cultures, coming-of-age story by debut novelist Spencer Wise. Alex connects romantically with older worker Ivy who initiates him into the political struggles of the Chinese migrant class, recalling Alex's own Jewish history of struggle heard from his grandmother. Rich discussion possibilities here include themes of the American abuse of the labor force in developing countries, cultural traditions (Chinese and Jewish), heritage and family, and class. Suspense keeps this story moving along, and it is truly a unique tale bringing modern China into focus. (Thanks to Edelweiss and HarperCollins for the advance copy.)"}, {"userName": "Clarissa", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/7438355-clarissa", "userReview": "I thoroughly enjoyed this read and I recommend it to each and everyone. I’m usually a big reader of historical fiction, but this one was different for me; it was more of a literary tale but I didn’t mind it.I love how Mr. Wise’s knowledge of shoemaking came out and I adored his rich and thorough descriptions of everything. By everything, I mean, everything. His is a talent that shouldn’t be ignored. This is a vibrant book; one that will literally create a world around you. The message of enlightenment and change are uplifting; the descriptions of how poorly treated the employees of the shoe factory are treated is heart-wrenching. Can you imagine someone standing over you and giving you a hard time for an unnecessary movement? Those may cost time; precious production time! Yes, you’ll read about that. I felt for Alex, our protagonist, who is dealing with not only trying to live up to his father’s standards, he’s an expat living in a new country and he’s also Jewish, which makes things a challenge.Seriously, you should read this. I’m not doing this justice. And this just a debut novel. If Mr. Wise can spin a novel like this now? How much more fantastic can he get as time goes on?[ ARC was provided from the publisher in exchange for an honest review; thank you! :) ]"}, {"userName": "Kathleen Gray", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/16056426-kathleen-gray", "userReview": "Read this for insight into the struggles of a young American who takes over his father's factory in China. Alex discovers early on in the novel that things aren't what he always thought they were and that his dad isn't the man he thought he was. Some of the best scenes involve the mechanics of making shoes (the tannery comes to mind). His relationship with Ivy, a worker who wiggles his way into his heart and head, is the linchpin. I wanted to like this more than I did but I was unable to connect with (or rather relate to) Alex. Thanks to Netgalley for the ARC. Wise is to be commended for bringing the issue of workers in China to light and for his writing, which is quite good."}, {"userName": "Janet", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/31697783-janet", "userReview": "First let me be honest, I didn’t finish this book. I made it a little further than halfway. But I cannot go any further. It’s just not for me. I love stories about people and their passions and struggles but I could not relate to any of the characters in this one. Thank you to NetGalley and the publisher for allowing me to read an advance copy for my honest review."}, {"userName": "Jackie Rogers", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/33443462-jackie-rogers", "userReview": "This is an interesting read. Is about a Jewish young man in his dad's shoe factory in China. He falls in love with a chinese girl who has radical beliefs. As time passes he sees her beliefs have merit and wants to help the people to better treatment in his factory. Sets he and his father against one another and the heads of China. This book is on sale June 5. Thanks to Godreads"}, {"userName": "Melissa Dee", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/32345791-melissa-dee", "userReview": "Wow! With a profound respect for two ancient heritages, and a clear fascination with modern China and Judaism, Spencer Wise has written an atmospheric and timely story of a “shoe dog” in China. Alex Cohen is a young man in an old world. He is an idealist in a deeply cynical world. I was hoping for him to find his way, even while I was wincing at his naivety."}, {"userName": "Jayne", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/40954263-jayne", "userReview": "Received this as an ARC from Westwinds Bookshop, Duxbury, MAWanted to like this but......I found the writing style very disjointed and jumpy. Great subject matter, social and moral issues - just not executed in a manner that would appeal to this reader"}, {"userName": "Debra Schoenberger", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/28788977-debra-schoenberger", "userReview": "The story is good but not a very clean read."}, {"userName": "Chaya Nebel", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/25951739-chaya-nebel", "userReview": "Ok novel about a Jewish Bostonian expatriate dealing with his father's Chinese shoe factory, and all the difficulties therein."}], "description": "From an exciting new voice in literary fiction, a transfixing story about an expatriate in southern China and his burgeoning relationship with a seamstress intent on inspiring dramatic political change Alex Cohen, a twenty-six-year-old Jewish Bostonian, is living in southern China, where his father runs their family-owned shoe factory. Alex reluctantly assumes the helm of the company, but as he explores the plant's vast floors and assembly lines, he comes to a grim realization: employees are exploited, regulatory systems are corrupt and Alex's own father is engaging in bribes to protect the bottom line. When Alex meets a seamstress named Ivy, his sympathies begin to shift. She is an embedded organizer of a pro-democratic Chinese party, secretly sowing dissonance among her fellow laborers. Will Alex remain loyal to his father and his heritage? Or will the sparks of revolution ignite? Deftly plotted and vibrantly drawn, The Emperor of Shoes is a timely meditation on idealism, ambition, father-son rivalry and cultural revolution, set against a vivid backdrop of social and technological change.", "title": "The Emperor of Shoes", "url": "http://www.goodreads.com/book/show/36961134-the-emperor-of-shoes", "average": 4.17, "cover": "https://images.gr-assets.com/books/1516208119l/36961134.jpg", "reviews": 22, "authors": [{"url": "https://www.goodreads.com/author/show/17430333.Spencer_Wise", "name": "Spencer Wise"}], "type": ["Fiction", "Literary Fiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/36961134-the-emperor-of-shoes"]}