{"ratings": 107, "userreviews": [{"userName": "Ms. Yingling", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/2636606-ms-yingling", "userReview": "ARC from the publisher at ALAMarjorie Campbell is trying to navigate junior high in Detroit in 1954. Her best friend Bernadette is frequently absent with earaches, and things are odd at home. The family has taken in a high school boy, Frank, whose parents are dead, and her father suffers PTSD from being in WWII. Her mother is hiding books that the public library was going to burn because of their \"Communist\" themes. When a new girl sits by Marjorie during class, she is friendly, but doesn't want to be friends with Inga because she is clearly German, although she claims to have moved from Canada. With all the talk about Communist sympathizers, Marjorie doesn't want to get drawn into friendships that may make her look suspect and put her father's job in jeopardy. Strengths: Wow. I don't know that I've ever read a book that drew me so clearly to a particular time. The details of every day life in 1954 Detroit are exquisite. The thing that really blew me away, however, was the depiction of a time when almost all of the fathers had fought in the war. We don't think about that aspect of the Baby Boom, but it's true. Kurlansky's Battle Fatigue talked about it a little, but this really brought the concept home. It made the whole idea of fighting Communists in the public library seem a little more plausible to me. The other thing that I've not read in another middle grade book is the idea of rampant prejudice. Bernadette (whom I'm assuming is Catholic) isn't allowed to have Lutherans in her home. Negroes live south of 8 Mile Road. We just fought the Japs and the Krauts, so we certainly don't want to hang out with them. I grew up hearing this sort of talk from my aunts and uncles, and being appalled by it, but it was certainly a part of the culture. Given the current circumstances, I think this is important to find out. Children today really don't understand why people were opposed to Kennedy-- hopefully, it won't take 50 years for other prejudices to work themselves out! We clearly need more books about the Baby Book experience! (I missed that generation by 6 months!)Weaknesses: The print is a bit small, and there's not a huge general plot. Not that I minded-- Marjorie's relationship with Inga would have been enough for me. What I really think: This is worth buying if only for the scene where Marjorie and Inga's fathers get together for coffee and talk about their experiences during the war-- fighting on opposite sides. Chills. So good!"}, {"userName": "Barbara", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/1222379-barbara", "userReview": "This wonderful piece of historical fiction is set in Detroit in 1954, a year before I was born. Although I grew up in the rural South, I could still relate to many of the events the author describes here as well as the xenophobia that plagued her school and neighborhood, and dare I say, our nation. As I read the book—and I don’t know how I managed to miss it earlier—I couldn’t help but think about today’s political climate and the hatred and fear that are fomented toward those that are different from the rest of us or who we have learned to call “the enemy.” The book covers a lot of territory and cuts a wide swath in examining how many of the citizens of this country as well as others often give blind allegiance to their leaders and elected officials. If this all sounds familiar, it just be that in some respects we’ve returned to the days of the Cold War, the red scare, and the witch hunt led by Senator Joseph McCarthy in those days. The narrator, twelve-year-old Marjorie Campbell leads a life not far removed from most youngsters in those times. Her father suffers from PTSD as the result of his military service, and many Americans still bear grudges toward the Nazis and Germans after WWII as well as harboring fears about Russians and communism. Marjorie is no exception to this rule, but a small crack in her veneer occurs when her teacher assigns her to befriend a new student. Inga Scholtz may have recently arrived from Canada, but it is clear that her origins were in Germany. Marjorie is torn between acting kindly to the girl and staying in the good graces of her best friend, Bernadette Ferguson. Unfortunately, often she shuns Inga because the rest of her classmates are, as they belittle Inga and make fun of her culture and clothing. Things escalate as Bernadette suggests that the girls write in a slam book through which they will ask and answer questions about Inga. Although this might seem to be a trivial matter, it is intended to be cruel and to align the girls even further against the young German girl. Eventually Marjorie does the right thing, but it takes almost the entire book before she does so, and seeing her father’s willingness to move past the wounds of the war and his awareness that the men on the other side of the conflict were humans just like him, caught up in a war machine. I thoroughly enjoyed this exploration of an ethical dilemma from the aisles of a typical American classroom as well as the plotlines about book banning and her mother’s college education, which seemed somehow to set her apart from others—and not in a good way. While it might seem that we’ve come a long, long way, baby, in other respects, we seem to be going backward in time. If this story seems personal, in many ways it is as the author based some of the characters and experiences on those of her own family. Like many, I’ve always enjoyed Sara Holbrook’s poetry so I am delighted to see her first novel. There are many passages that made me laugh as well as some that made me wince, and others that left me troubled as I pondered how I might have behaved if I had been in Marjorie’s shoes. While this novel covers territory not usually explored in books for young readers, it does so through a narrator with whom most of them can relate. I appreciated the inclusion of complex characters and subtle references to the economic differences among the families in Marjorie's neighborhood as well as the examination of life after a war or a conflict ends."}, {"userName": "Kimbra Power", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/3220608-kimbra-power", "userReview": "Where has Sara Holbrook been hiding her talent for fiction all these years? I've only known her as a poet, and an outspoken and wonderful one at that, so to pick up her brand new novel and finish it in one setting has blown me away; what a page turner. The book has an easily accessible lead character, Marjorie, who is struggling with her surroundings, her family and her friendships. Marjorie is growing up in turbulent 1950's America, and battles prejudice in its many guises. The book, although set 60 years ago, is EERILY relevant today in, I mean seriously-references to the Orwell classic 1984, talk of taking down the enemy and the toxic mentality of fear permeate as a theme, then, and now. I can easily see this novel being used as a reference book for this turbulent period in time, the 1950's, and imagine it will be popular as a classroom text used in book groups from 5th grade and up. Read this book today."}, {"userName": "Kim", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/4200087-kim", "userReview": "Marjorie lives in Detroit in the 1950s, a decade that has been depicted as placid and \"normal\"--when the wars were over and America was Great, but M's life is pretty full of confusing things. Her best friend is pulling all kinds of stunts, her mom is hiding \"subversive\" books under the bed, and there seem to be enemies everywhere. Sara Holbrook's first novel, based on her own experiences as a young girl in a world as complex as the one we have today. Terrific!"}, {"userName": "Dotty", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/128471-dotty", "userReview": "Transported to another timeFamiliar but different, my story but another's storyNancy Drew, bomb drills, frenemies Underachieving mothers and kind but struggling fathersWandering and wondering down memory laneWith side trails that now beckon to exploreMcCarthy witch hunt, Red scare, bomb buildingFear of the other...a festering wound breeding hate and crueltyWhen will we ever learn?--------------------------Ok, Sara Holbrook, haven't attempted much poetry of late, but how could I not respond to a poet's novel without at least trying. Thank you for the captivating characters and story, engaging, thought provoking quandaries! \"The Enemy\" was time travel at it's best and yet reflects our current lack of ability to step outside of fear and our ignorance of history that could so help us understand the present. This book will be in my next book talk and I'll be telling my students I want to give your book a 6 star rating! And then I want to find people to read with and talk about this book. I'll insist this book be on our middle school Book Madness for next school year."}, {"userName": "Gary Anderson", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/2799121-gary-anderson", "userReview": "From her “Chicks Up Front” days to a recent piece on how one of her poems was botched by a Texas standardized test, Sara Holbrook has always been in the right place, saying what needs to be said. It’s no surprise that her first novel for young readers, The Enemy: Detroit 1954, is perfectly in sync with our troubled times.Holbrook’s main character Marjorie Campbell is twelve years old as the atrocities of World War II are still etched in the minds of Americans, although children of her age have no direct memories of them. Many are also preoccupied with the Cold War fears of creeping Communism. For Marjorie and other children, these perceptions are playing out for real in their Detroit neighborhood when books deemed subversive (1984, The Grapes of Wrath) are removed from library shelves, and newcomers are treated with suspicion. When Marjorie is assigned to share a desk with the just-arrived Inga, she is torn between her instinct to be friendly and her classmates’ intentions to be unwelcoming.Holbrook respects her readers by presenting the complexity of Marjorie’s situation. Members of her family and community have been directly affected by the war, and they harbor negative attitudes toward Germans and DPs (displaced persons). Others are concerned with over-reaching attempts to limit freedoms in the name of safeguarding against Communism. Marjorie takes it all in, and then relies on her heart to make decisions about how she will navigate her neighborhood and her world.Marjorie’s voice in The Enemy is charmingly innocent, smart, and vulnerable. Here is her description of one of the local librarians: “Mrs. Pearson has her arms crossed tightly, the way she always does. Crossed arms are as natural to her as breathing. It makes me wonder how she opens a car door or flushes a toilet. I imagine she was born with her arms crossed, telling the doctor to keep it down as soon as she opened her eyes.” Sara Holbrook definitely knows how kids think and speak.Today’s middle school and high school students are well aware of what is going on around them. They see the protests and hear the inflammatory rhetoric. Reading The Enemy: Detroit 1954 in a time when our government is focused on creating a classes of “others” through harsh characterizations and targeted immigration policies will give adolescents a context for processing their own roles in today’s swirling events, and considering whether “the enemy” is outsiders or dark impulses closer to home.Cross-posted in slightly different form on my What's Not Wrong? blog"}, {"userName": "Mary Lee", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/221992-mary-lee", "userReview": "I think this is the first children's/YA book I've read that's set during the Cold War. Through lots of specific details, Holbrook gives the reader a good feel for the time and the place (Detroit).The scary thing is, this is a story for today -- racism, fear of immigrants, threat of nuclear annihilation (without the air raid sirens...so far), bullies, PTSD. But it is also a story filled with hope. When Marjorie's father welcomes a Inga's father, a German immigrant, into his home to compare war stories, it gives her the courage to stand up to her neighbor/friend/the main bully and do the right thing for Inga."}, {"userName": "Cindy Mitchell *Kiss the Book*", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/19521241-cindy-mitchell-kiss-the-book", "userReview": "Holbrook, Sara The Enemy, 243 pages. Highlights (Calkins Creek), 2017. $18. Language: G (swear count 0); Mature Content: PG; Violence: PG.It’s 1954 in Detroit, Michigan. Cold-war McCarthyism has a grip on the city and twelve-year-old Marjorie doesn’t know what to think. What’s a Nazi? What’s a Commie? Who is our enemy? Where are they hiding? Why are books being pulled from the library shelves? Her father served in World War II and now works for Chrysler Corporation. Her mother went to college during the war and now stays at home to take care of Marjorie and her sister. Then there is Frank, the teenager who comes to live with them after his father, also a veteran, dies of “unnatural causes.” Life is complicated enough before the arrival of the new immigrant family in the neighborhood. Her classmates make fun of the new girl with her different hair, different clothes, and different accent. Through it all, Marjorie finds the courage to be a true friend and stand up for what she believes is right.Drawing on personal experience, author Sara Holbrook creates a work of historical fiction that is still relevant today. At times a bit slow, the book tries to capture the feeling of paranoia that spread across American society as the Soviet Union began to rise as a global power. The reader can sense Marjorie’s curiosity and confusion as she tries to understand why some families reject cultures and religions that other families embrace. The dilemma of inclusion versus exclusion as it related to European immigrants in the 1950’s parallels the current political debates about immigrants from Middle Eastern countries. Holbrook also manages to bring in the tween girl experience about true friends, family secrets, and crushes on boys that even the modern reader can relate to.EL, MS – OPTIONAL. LMA, future elementary school teacherhttp://kissthebook.blogspot.com/2018/..."}, {"userName": "Karen Silverman", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/24894530-karen-silverman", "userReview": "I loved this book! Set in the 1950s and told through the lens of a middle school girl. Marjorie is dealing with some big issues -- the Cold War, McCarthyism, banned library books, her father's PTSD, mean girls with slam books, a new student from Germany, and a new older brother living in the basement her family took in when he was orphaned. My favorite character was her strong mother who went to college in an era when many women did not and when jobs for women were listed separately in the classified section.From page 25:\"My mother's a college graduate.It's true.It happened during the war because her daddy didn't want her hands turning dirty in a factory helping the war effort, so he sent her off to a safe place with ivy all over it. She never lies about going to college, but she doesn't bring it up either. Probably because, like Dad says, it doesn't help her do the dishes any better than the next woman. It's almost a family secret, like a birthmark or my grandpap's horse-thieving uncle who had his name cut out of the family Bible. Something we don't talk about.\"And I loved her mother's commentary on the importance of books!From pages 188-189:\"She talks fast. 'You asked me why I went to college and the answer is because Grandpa Henry told me to go. But you didn't ask me what I learned there. I learned this: Books, like the books upstairs, they stretch your brain, so there's enough room for lots of ideas: good ideas, bad ideas, ideas different than the ideas you grow up with. From those ideas you can make your own ideas, different ideas. Different is a good way to be. Don't let anyone tell you otherwise. When people try too hard to be the same, that's when the shooting starts.\"This book is on the 2018-2019 Maine Student Book Award list and we have it in our Learning Commons collection thanks to Junior Library Guild."}, {"userName": "Valerie McEnroe", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/4294664-valerie-mcenroe", "userReview": "I've been reading a lot of books about the Cold War lately and this is one to read if you have an interest. It describes the anti-German sentiment that permeated American culture in the 50s and 60s. There was much less tolerance for cultural differences back then and Detroit was one of the melting pot cities. This book is based loosely on the author's own experiences growing up in Detroit.Marjorie is very aware of the anti-Nazi/anti-Communist atmosphere around her. Communists are called Commies and immigrants are called DPs for displaced persons. WW2 is still fresh in people's minds and they have no tolerance for Germans. When a new German girl named Inga joins her class and she is instructed to share her desk since there are no others, Marjorie is faced with a moral dilemma. She wants to be nice to Inga and help her learn to read English, but she knows it will jeopardize her friendship with the popular, but intolerant, Bernadette. Her father, a retired military man, who works for a company with ties to the military, is socially aware of the importance to not appear to be a Communist sympathizer. So it's interesting that at the end of the book he invites Inga's father over to their house to talk about the war. In the end, Marjorie stands up to Bernadette. Her father's message is that war is bad, not people, so you must forgive and forget."}, {"userName": "Dawn", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/40626880-dawn", "userReview": "\"Set in 1954, this compelling historical novel tells the story of a young girl’s struggles and triumphs in the aftermath of World War II. The war is over, but the threat of communism and the Cold War loom over the United States. In Detroit, Michigan, twelve-year-old Marjorie Campbell struggles with the ups and downs of family life, dealing with her veteran father’s unpredictable outbursts, keeping her mother’s stash of banned library books a secret, and getting along with her new older “brother,” the teenager her family took in after his veteran father’s death. When a new girl from Germany transfers to Marjorie’s class, Marjorie finds herself torn between befriending Inga and pleasing her best friend, Bernadette, by writing in a slam book that spreads rumors about Inga. Marjorie seems to be confronting enemies everywhere—at school, at the library, in her neighborhood, and even in the news. In all this turmoil, Marjorie tries to find her own voice and figure out what is right and who the real enemies actually are.\" Another powerful reminder for life in these times -- how do we live with the choices that are before us? How do we live confronting our enemies or our supposed enemies? What do we do when family members disagree? What about our assumptions and prejudices towards others? This was not a hard read, but it is an important read."}, {"userName": "Mary", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/1460812-mary", "userReview": "Okay, four and a half stars, really. I had a few minor quibbles. For example, Ferguson is not, in my experience, an Irish name. It's Scotttish. But Bernadette Ferguson and her mother are absolutely believable characters--bullies, both, and very punctilious.12-year-old Marjorie, the main character, is best friends with Bernadette. So she worries when she's stuck sitting next to the new girl, Inga, from Canada. Inga is a German refugee, and many in Detroit, including Marjorie's father, still bear the scars of the war. What's more, the red scare is in full swing. It doesn't take long for Bernadette to start plotting against the new girl, and she expects Marjorie to join in. But Marjorie starts to realize that, German or no, she likes and respects Inga.Marjorie is a very real young girl, and I loved the family relationships and the difficult early adolescent friendships. Marjorie's mom is a real heroine!Summing up, this is very well crafted historical fiction that will also appeal to fans of realistic fiction and family stories. There's drama and tension and humor and some very positive messages that arise naturally from the story. And the characters are memorable. I also appreciated the author's note explaining her childhood in Detroit and the similarities and differences from the novel. Well done."}, {"userName": "Erikka", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/8109706-erikka", "userReview": "I had the honor of meeting Sara Holbrook at the Ohioana Festival in Columbus this spring. She was a delight and this book really caught my eye. There isn't a lot of middle grade Cold War fiction, so I wanted to check it out. I'm really glad I did. Marjorie is a fun MC. She learns to accept others even when they are decidedly different from you. More importantly, she learns to stand up for what's right even if it's unpopular. I think that, even though this is historical fiction, there are many applicable lessons for today's kids. Also, a nagging aggravation: why are middle grade books filled with good parents, but in YA your hard-pressed to find enough to make a library social media post for mother's/father's day?? Do parents randomly get worse as soon as their kids become teens? Or, and this just came to mind, are YA parents awful bc teens have a shifting view of their parents? At Marjorie's age, she still recognizes their value and their intelligence. Maybe at 16, she would begin to think they are nothing more than stupid burdens who limit her horizons. Maybe that's why you see so many good parent relations in adult fiction--adults have shifted the pendulum back to respect for their parents. Hmm. Worth thinking on."}, {"userName": "Joan Marie", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/23154392-joan-marie", "userReview": "Holbrook does a wonderful job of placing the reader in the atmosphere of The Cold War. Fear is rampant. Suspicion abounds. Prejudice predicts judgement. I love the mantra - \"Lead, follow, or get out of the way.\" It was true for twelve-year-old Marjorie's father during the war, and true for Marjorie as she decides whether to befriend the new girl in her class, who is clearly a German refugee. Inga. So many things to consider. Her father, a WWII veteran who was lucky enough to make it home but could possibly lose his job if associating with Nazi sympathizers. Frank, the teen who lives with the Campbells, who hates all Germans. Her mother, who hides books deemed subversive from the library in their own house, something that could get her jailed if found. Her best friend, Bernadette, who sees all Germans as Nazis. With all the fears and prejudices swirling today, this middle grade novel couldn't be more timely. Kudos to Holbrook for tackling this issue with finesse. Another fine book published by Calkins Creek under the guidance of editor, Carolyn Yoder!"}, {"userName": "Erin", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/3561481-erin", "userReview": "I thought I knew where this story was headed, and found it engaging but predictable. Until the plot gently veered off-course and I found myself pleasantly surprised by the direction it had taken. Marjorie is super average, nothing special, just your everyday tween/teen dealing with friends, bullies, teachers, and family struggles. But lightly layered on top of all that typical stuff is her father's PTSD, a new girl in school who may (or may not) be an (ex)Nazi, Communist threats at her local library, a young man who comes to live with her family because his father committed suicide, and underlying all this is the never-entirely-straightly-asked-question about what it means to be American.I wish the library plot thread didn't fade into the background, but other than that, I am a big fan of this story."}, {"userName": "Cindy", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/2511660-cindy", "userReview": "A fascinating read for older elementary or middle school students. This book is set in Detroit in 1954. The main character is a 5th grade girl who has much to be worried about. Besides the usual friendship troubles, she is worried about spies or communists living in her neighborhood. She deals with her father's PTSD after he returned from WWII and books being banned because they are thought to be encouraging communism. While this is a work of fiction, the book is modeled after the author's life as a child growing up in that era. I think it would work well as a read-a-loud or for parents to read it with their child, as there are many things to discuss. The book 1984 by George Orwell, is referenced in the book as well as issues of prejudice."}, {"userName": "Abby", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/1032428-abby", "userReview": "Really inhabits Marjorie's world, contains some language and behavior we would not accept in 2018 (chastising women for going to college/thinking, public librarians censoring collections voluntarily) but also others that are sadly unchanged and unchallenged (criticism of displaced immigrants), leaves out half the city of Detroit (brief mention of the city's racial makeup and redlining to explain segregation). Not sure how many 12-year olds would pick this title up (or stay with it) but it had an interesting amount of edge--I was always thinking it was going to veer into really deep water."}, {"userName": "etherealdragons", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/48045412-etherealdragons", "userReview": "Yass I think my grandmother grew up in Detroit in this time period also in the book it mentions places I know like eleven mile and Coolidge and Woodward and in the authors note thing it mentions she grew up near twelve mile AND SHE MENTIONS OAK PARK HELLO DATS WHERE I LIIVVVEEEE (also it mentions that Oak Pakr was very hebrew speaking. It and Southfield do happen to be the main thriving Jewish community here)"}, {"userName": "Beth", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/7189665-beth", "userReview": "Since the protagonist and her friends are in 6th grade, I don't see many of my 8th graders wanting to read this book. 4th-6th grade is more of the target audience. Still, it is a good example of historical fiction from the 50's. I liked Holbrook's bibliography at the end. It could help with further research of the decade."}, {"userName": "Allison", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/54208041-allison", "userReview": "Set in Cold War Detroit, aa young girl struggles with the pressure of fitting in and a complicated home life. Historical fiction that reads like contemporary. Great short read. Excellent for MG readers."}, {"userName": "Alice", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/3905385-alice", "userReview": "1954 Detroit: McCarthyism invades even the school playground as Margie has to decide whether to be nice to new student Inga from \"Canada\" and defy the playground queen, Bernadette. Nothing is as simple as it seems."}, {"userName": "Alice", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/2807748-alice", "userReview": "This is definitely another \"junior level\" book. Rating it at that level, it is a very good story. It takes place during the cold war era. It does a good job showing the fear felt by both adults and children during that era, and standing up for what you believe it right."}, {"userName": "Chris", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/21505458-chris", "userReview": "Historical fiction set in 1954 in Detroit and based loosely on the author's childhood. A young girl navigates through understanding the Cold War, bomb drills, bullying best friends, and a new German family that moves to town, and must choose between being a bystander or an upstander."}, {"userName": "Aprilj328", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/3451839-aprilj328", "userReview": "Marjorie is twelve years old in 1954 Detroit. She must navigate a confusing world of post WWII and the cold war. When new girl Inga comes to town; Marjorie must choose between being kind or falling in line with the local bully. ES/MS Post WWII, Bullying, Prejudice, Censorship"}, {"userName": "CarlyK_D2", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/70467244-carlyk-d2", "userReview": "This book is about 12 year old Majorie and her struggles with friendship and family. It is set in America during the Cold War, which is why Majorie faces many dilemmas regarding trust in the story. You would enjoy this book if you like reading historical fiction."}, {"userName": "Kim Bahr", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/12552593-kim-bahr", "userReview": "Interesting look at life after WWII and the many stereotypes"}, {"userName": "Jennifer", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/33234099-jennifer", "userReview": "The Enemy is a historical fiction book with good characters. The author an often neglected era as the setting, which makes this book stand out more for me."}, {"userName": "Deborah Peterson", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/15318086-deborah-peterson", "userReview": "It was a fabulous book. First novel by a poet! It really captured what it was like, felt like, to grow up in the 1950s."}, {"userName": "Katrina", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/6991868-katrina", "userReview": "I very much enjoyed this book. The characters were relatable, especially considering the historical setting. The ending will really encourage the reader to think about what comes next."}, {"userName": "Michelle", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/1186146-michelle", "userReview": "It is 1954 and the Cold War is heating up. For twelve-year-old Marjorie Campbell this means an uncertain future. The transition from child to young adult is difficult, but it is far more complicated when it seems that enemies are lurking around every corner. A new girl in school, Inga, seems like a potential new friend. But her strange clothes, hairstyle, and mannerisms mark her as a target for bullies. Marjorie’s pushy, overbearing best friend is especially cruel and makes it clear that anyone associating with Inga will receive the same treatment. At home, her father struggles with PTSD from his time in WWII, while her forward thinking mother hides a box of ‘rescued’ banned books under Marjorie’s bed. Marjorie must sort through the changes in her world to figure out who she is and in what she believes.Holbrook examines the difficulty of coming of age when prejudice and fear are escalated in a politically charged environment. This timely story is well-developed and a solid choice for those interested in the McCarthy era. The issues examined will definitely resonate with readers as they connect it to today’s social issues."}], "description": "Set in 1954, this compelling historical novel tells the story of a young girl’s struggles and triumphs in the aftermath of World War II. The war is over, but the threat of communism and the Cold War loom over the United States. In Detroit, Michigan, twelve-year-old Marjorie Campbell struggles with the ups and downs of family life, dealing with her veteran father’s unpredictable outbursts, keeping her mother’s stash of banned library books a secret, and getting along with her new older “brother,” the teenager her family took in after his veteran father’s death. When a new girl from Germany transfers to Marjorie’s class, Marjorie finds herself torn between befriending Inga and pleasing her best friend, Bernadette, by writing in a slam book that spreads rumors about Inga. Marjorie seems to be confronting enemies everywhere—at school, at the library, in her neighborhood, and even in the news. In all this turmoil, Marjorie tries to find her own voice and figure out what is right and who the real enemies actually are. Includes an author’s note and bibliography.", "title": "The Enemy: Detroit, 1954", "url": "http://www.goodreads.com/book/show/31212941-the-enemy", "average": 4.17, "cover": "https://images.gr-assets.com/books/1473587732l/31212941.jpg", "reviews": 40, "authors": [{"url": "https://www.goodreads.com/author/show/198492.Sara_Holbrook", "name": "Sara Holbrook"}], "type": ["Historical", "Historical", "Childrens", "War"], "outlinks": ["http://www.goodreads.com/book/show/31212941-the-enemy", "http://www.goodreads.com/book/show/798108.I_Never_Said_I_Wasn_t_Difficult", "http://www.goodreads.com/book/show/981902.Wham_It_s_a_Poetry_Jam", "http://www.goodreads.com/book/show/8314758-zombies-evacuate-the-school", "http://www.goodreads.com/book/show/1687888.Walking_on_the_Boundaries_of_Change", "http://www.goodreads.com/book/show/501958.The_Dog_Ate_My_Homework"]}