{"ratings": 4507, "userreviews": [{"userName": "Artemas", "userReviewDate": "Dec 10, 2014", "userURL": "http://www.goodreads.com/user/show/6751111-artemas", "userReview": "[ Cassandra (Deirdre), Lot, and Uther's deaths left me feeling a bit unfulfilled. I know we are in Merlyn's POV, and he wasn't present for these events, but still. (hide spoiler)]"}, {"userName": "Benjamin Thomas", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/4209082-benjamin-thomas", "userReview": "Once again I am marveling at this series known as “The Camulod Chronicles,“, the vast epic story of the Legends of King Arthur, but told as historical novels rather than fantasy. This is a series to savor over time rather than rush through from one book to the next, tempted as I am to do so simply because of the fantastic storytelling and pure reading enjoyment.This third volume starts a new “chapter” in the series as we have moved on to a new generation in the larger story. The first two books are told from the viewpoint of Publius Varrus, but now we turn to events from his nephew’s perspective, Caius Merlyn Britannicus. That’s right…the Merlin of legend is now the narrator of the story but this is not the long white bearded old wizard we often think of, at least not yet. He is a warrior and leader of men, much like his cousin and best friend, Uther Pendragon.This novel is a transitional book in the series as it takes us through the lives of the young Merlyn and Uther and ends with the discovery of a young 7-8 week old infant by the name of Arthur. But more than that, the largely idyllic story heretofore of the building of the Colony of Camulod (Camelot) and the advancement of ideas and invention has morphed into the inevitable war torn strife of our heroes defending against the invading Saxons and others. Much more about wars and battles in this one, and consequently more brutal than the first two, culminating in the final battles between Uther and Lot of Cornwall. It’s also transitional in other ways as Merlyn’s encounters with influential people he meets during his travels alter his perspectives on religion, culture, and the motivations of countries. He comes to realize, for example, that the invading Saxons, whom he has always thought of as inherently evil, are really no different than his own ancestors, the Romans, who also invaded the British Isles. No doubt these sorts of realizations will greatly affect his influence on Arthur.I love the way the author presents a wonderful sweeping saga of a story, building in all of the familiar aspects of the legend but keeping it all at such a rich personal level. A hint of magic does sneak into this one in the form of a few Merlyn’s dreams but they are more prescience than sorcery. I really want to know how these same events unfolded from Uther’s perspective but alas I will have to wait, for Uther doesn’t get his own book until #7 in the series. Meanwhile I greatly look forward to the next installment, The Saxon Shore, wherein I hope to discover just what sort of adventures Merlyn will be having with his new ward, baby Arthur."}, {"userName": "Lisa (Harmonybites)", "userReviewDate": "Apr 23, 2010", "userURL": "http://www.goodreads.com/user/show/2596042-lisa-harmonybites", "userReview": "This book is part of a series of books based on the legends of King Arthur. I've read quite a few books based on Arthurian lore, but this series is unique. It doesn't stand out for the quality of the writing, which is no more than decent. It does stand out for the imagination and verisimilitude with which it uses history. Few Arthurian books I've read written in the last few decades are unabashed fantasy in the tradition of T.H. White's The Once and Future King with a Merlin that lives backwards and changes Arthur into various animals, but most have some fantasy aspects. Even Mary Stewart's Merlin Trilogy, which carefully does build in a solid historical context, still has a large element of magic. Those two works are my favorite Arthurian tales by the way--both Stewart and T.H. White are wonderful writers. What makes Whyte's series different, at least so far, is the complete lack of magic (aside from some prescient dreams.) The first novel was The Skystone--referring to a meteorite from which was forged Excalibur.That's what I mean about imagination. Used not to build a magical system and a fantasy world, but a Camelot (or rather here \"Camulod\") that truly might have existed within the cracks of what we know of Dark Age Britain. Strictly speaking, this is not fantasy at all but well-grounded historical fiction. The narrator of the first two books is Arthur's great-grandfather, Publius Varrus, and is set in the decades before Roman legions withdrew from Britain. In this book, the narrative baton is passed on to a name right from the legends--Merlyn, his nephew. Merlyn, King Lot, Uther Pendragon are the characters that drive this story. And Uther especially has an fascinating ambiguity and complexity. I love good historical fiction, especially those that show me a side of history I didn't know. One work of historical fiction, All Things Are Lights, is a favorite precisely because I knew nothing before reading it about the Cathars and the Albigensian Crusade. Before reading it, I had thought Europe monolithically Roman Catholic during the Middle Ages. I had no idea so much of France held with the Gnostic Cathars before they were wiped out by a Christian crusade called for by the Pope. Similarly, I enjoyed in The Eagles' Brood the picture of early Christianity, particularly the picture of the British Pelagius and his belief in free will and conflict with the followers of Augustine of Hippo. I had never heard of Pelagius nor known that his teachings were widespread in Dark Age Britain. It made me wonder if history might have taken a very different path had his ideas won out. The book's picture of history is also interesting in many other ways. This may not be historical fantasy, but it is (among other things) military fiction--the invention of the stirrup and the flail are important elements in the story.The novel does have its flaws. I mentioned that I don't think Whyte's in the same league as T.H. White or Stewart. His sex scenes particularly struck me as none too graceful. And god, the coincidences! Two incidents in particular struck me as implausible as some of the more ludicrous plot points in Shakespearean comedy where brothers who didn't know of each other's existence just happen to bump into each other. I thought some parts frankly dragged, which is the main reason this book is rated one star less than the first book in the series. But this novel does get rated as high as it is, because I do find Whyte's picture of Dark Ages Britain, and the way he finds credible realistic ways to render the familiar Arthurian legend, fascinating."}, {"userName": "David", "userReviewDate": "May 21, 2010", "userURL": "http://www.goodreads.com/user/show/938229-david", "userReview": "The Eagle's Brood brings this pre-Arthurian tale to an important junction-- the birth of King Arthur. Along the way, Caius Merlyn suspects his cousin, Uther, of an act or outrageous barbarism upon a young woman. He brings the woman to his secret hideaway (nicknamed Avalon) and there nurses her back to health and eventually to love. In the meantime, the question burns-- DID UTHER DO THIS THING?? The question in my mind-- Was Whyte watching pornography when he dreamed up the conflict between Uther and Merlyn's eventual love interest? IN other words, it got very explicit and I felt a bit degraded trying to get through it. In other novels, the sexual conquests, etc. all played an important part in the plotting, but this time Whyte departs from what seems to be a simple conjoining to move the plot along in favor of describing a full-scale orgy... He makes his point, but not before offending the most sensible of his readers-- who, I imagine, can recognize the stretch of reality's fabric as a plot mechanism that was poorly contrived, and poorly developed, and in poor taste.I don't want to offer any spoilers-- but much of this novel deals with the relationship between Merlyn and his love-- but along the way we meet King Lot's evil magician/assasins. Whyte provides a real-world explanation for their supposed magic (as well as how it fell into the hands of Merlyn- likely to be used in later books)... and winds the novel up without really answering the question about Uther's act of criminal rage or his actual character. Uther remains in the story, the most poorly developed character ever. Whyte never moves the reader to love or hate-- leaving him to float forever in apathy. That Merlyn loves his cousin is never in doubt.The author manages to leave the reader hanging at an awkward place in the storyline. I applaud Whyte's efforts to discuss economic and religious culture, the effects of technology upon the changing of the land from Roman to Briton, and the writer has a wonderful style that at times, forces me to use a dictionary to assay a clever a turn of phrase to see if it makes sense... Merlyn has become the focus of this series, and likely shall be as we see young Arthur grow up (as he is doing in the SAXON SHORE) which I am now about halfway through. Still, this reader would be more comfortable if the author stopped trying to be pornographic and just continued to be graphic in his wonderful descriptions of the land, the people, the culture, the weapons, the technology of forging materials and candle making, and so on. Sex most certainly has a place in this story-- it just doesn't need to be so vivid to make its point."}, {"userName": "Carrie Slager", "userReviewDate": "Feb 10, 2014", "userURL": "http://www.goodreads.com/user/show/8854256-carrie-slager", "userReview": "For me, The Eagle’s Brood was such a sad book. I had to say goodbye to some of my favourite characters from the previous two books: Picus, Publius Varrus and Equus. Although Caius Merlyn doesn’t have the flair and sense of humour of Publius Varrus, I really did grow to love him as a narrator.The characters were great in this. We see everything through Merlyn’s eyes, with all of his judgments and flaws. He’s a good person but not a perfect character and gradually realizes his flaws. He can be more than a little judgmental and arrogant at times, but I love how the perspective is told from his older self looking back on his youth. It brings a little more balance to the equation and I loved Merlyn all the more for it. Uther was an okay character, but we didn’t really get to see much of the good side of him at all. That’s why I feel I need to reread Uther (the standalone Jack Whyte later wrote from Uther’s perspective) to fully understand him better.The plot wasn’t the most fast-moving at the beginning, but the last few hundred pages went fast. The familiar Arthurian mythology we all know and love is now present almost all of the way through the novel and combined with the other events like the war with Lot, this made for a fast read. If you’re just picking this book up without reading the first two in A Dream of Eagles you won’t appreciate it as much, but each of Jack Whyte’s books can stand on their own.I can’t and won’t really comment on the historical accuracy of The Eagles’ Brood. Although the main events of the novel are correct: the Romans withdrew from Britain, the Saxons started raiding the shores, tribes squabbled for control while the remaining Romans in the province tried to restore some order. I have a feeling that most of Jack Whyte’s novel is historically accurate because of what I know of ancient Rome as well as how he really sucks you into that period of time. You really do feel like you’re there and that’s something I’ve always admired in him as a writer.Despite some rather graphic, disturbing scenes I really did enjoy The Eagles’ Brood. I’d highly recommend A Dream of Eagles series to anyone who enjoys the Arthurian legends, with or without magical elements.I give this book 5/5 stars."}, {"userName": "Beorn", "userReviewDate": "Mar 28, 2014", "userURL": "http://www.goodreads.com/user/show/11220897-beorn", "userReview": "Initially a one-star review may seem harsh, hostile or something else vindictive but hopefully I'll elucidate on why I felt that the only realistic score for me personally.The frustrating thing about Jack Whyte is that you only have to dip into one of his books to recognise that he has an undeniable talent at creating believable, realistic & tangible characters and an atmosphere that is rich in detail & immersive.... He just believes fervently in burying all that positive plus points beneath rhetorical tonnes of bland greyness and wistful meanderings, to the extent that all enjoyment and thrill is utterly sucked out of the story, leaving nothing but a dessicated husk of what could have been.This book in particular is arguably where the author feels most at liberty to pontificate, ruminate and generally bore the brains out of the reader. Wistful thinking, eulogising, pondering and theologising - yes, ruminations on spiritual discourse! - make up the bulk of this book, to the extent where you can skip whole pages and still feel weighted down and sinking fast.Another element that seriously undermines the authors abilities is his obsession with randomly using obscure over the top words like 'propitiate' or 'concupiscent', so that if and when you finally build some sort of momentum in the story, you feel like you've stumbled and tripped over and have to start all over again.I'll reiterate, the author is clearly a talented writer with the depth of detail and ability to weave an immersive atmosphere. It's just such a shame that he feels the need for bury it beneath such banal frills and pompous adornments.I truly admire anyone who will be able to make it to the nearly five hundred page end of this book as getting to page 200 alone was an epic feat of effort which felt like double the distance.This was the book that broke the series for me. Strongly doubt I'll bother with any of the rest.(As this is a 'prequel', I've read it out of publishing order to fit in with the storyline's chronology)"}, {"userName": "Jonathan", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/12116649-jonathan", "userReview": "Recommended for: Lovers of Arthurian Legend, Lovers of Feasible Historical FictionThis third installment in Whyte's \"A Dream of Eagles\" series eclipses the first two. It skips a generation from the previous narrator, smith Publius Varrus, to Caius Merlyn Britannicus, a very particular -- and believable -- take on the Merlin character.While the story lacks a tidy development arc, there are subplots that keep it interesting. The bread and butter of this book, though, is the writing itself. There are some fiercely elegant passages that beg to be read aloud and flow off the tongue. One such, in the Penguin edition I read, begins on page 402 and does not let up until page 405. It is a one-sided conversation between two very different men who both have reason to be critical of each other, and the language used, the pacing of it, could easily be taken out of reality. It is the caring criticism of one friend to another, coloured ever so slightly by infuriation and jealousy, by defense of ego and a tragic sense that one will never be as great as the other. It is beautiful. This passage alone made the book worth reading to me.The only thing I can fault in The Eagle's Brood is a short range of characters. Not the characters themselves, mind you--most of them are well-rounded enough to be curious and engaging. It's more that too many of the characters are too alike, to the degree that they don't have their own voices, and at times it seems like one's words are flowing through another's mouth. I would've liked a little more distinction there.Otherwise, the scenes are painted beautifully, the characters are breathed to life with description, action, and powerful words, and the action is sufficient to not let the epic lag."}, {"userName": "Robert Risher", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/3485835-robert-risher", "userReview": "As wonderful as the previous books in the series were, this has far surpassed in quality and content anything that Whyte conceived previously. His mythos grows ever richer with each passing story, and this in particular was truly spectacular. The Eagles' Brood is one of the few stories that I have so longed to hear since childhood, yet never suspected I would, and certainly not so grandly. Though his work may not currently receive the credit it so duly deserves, I hope that history will boldly mark Whyte's work amongst the most revered tales in the accepted canon of Aurthurian lore where it belongs. How could it receive anything less than 5 stars?"}, {"userName": "Helen", "userReviewDate": "Jul 16, 2011", "userURL": "http://www.goodreads.com/user/show/5809296-helen", "userReview": "(I'd love to edit it, but it's not here to edit.) The three books that take us from the Roman legions to the birth of Arthur are enthralling. Every time I thought there was an historical point to note, Whyte noted it, everything I ever learned about the Eagles in Britain was there and a lot I never learned. This is what historical fiction should be. Now that I've got as far as Arthur's birth I'll have to go through the pile of books here and find the rest. Everyone thinks they have the best take on Arthur but very few make it logical. Whyte's is so believable you'd almost think he was there and knew it all to be true."}, {"userName": "Julie", "userReviewDate": "Mar 18, 2011", "userURL": "http://www.goodreads.com/user/show/5145759-julie", "userReview": "I just finished it this weekend, I had goosebumps when I read the ending. This series is a MUST read all the way so far, for anyone who's interested in Arthurian stuff!I love how Jack Whyte \"humanized\" and \"rationalized\" the iconic symbols of the legend: Avalon, the Round Table, Excalibur and such, even Merlyn. But at the same time, he managed to keep them all magical all the same. Again, a must read! The whole series is a must read!"}, {"userName": "Karen", "userReviewDate": "Jul 20, 2014", "userURL": "http://www.goodreads.com/user/show/10926363-karen", "userReview": "This is the third book in a row I've read in this series and they are amazing! His research is fantastic as is his writing. I'm going to read everything by this author."}, {"userName": "Anita", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/26748174-anita", "userReview": "Excellent series - hard to put down, and this book is no exception!"}, {"userName": "Joe Rohaly", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/68664814-joe-rohaly", "userReview": "If ever there was a story of immigration The Eagles Brood in the Camulod Chronicles series of books I am currently reading describes it in detail. The era was 300-500 A.D. and the story takes place in what is now known as England. In those  years the land belonged to the Roman Empire. As all empires go, the politicians got greedy and the tax money lined their pockets instead of paying their armies to keep law, and order in the territories. Reading about the society of that era is much like reading about our own society today. Our politicians all prosper while our status in the world, and even at home suffers. Masses of people all looking to get a piece of our heavenly land flock across the borders to flee oppression in their native lands.One huge difference between 400 A.D. and 2018 A.D. is that immigrants aren't being led by egomaniacal leaders who do not want land alone, but power as well. A second difference is in the way immigrants fought wars. Land was won by the group that could slay the weaker one. Literally, battles ended when there were no more soldiers of the other side to kill. Bodies piled up every where, wounded were triaged into the savable and those to be put out of their misery. WOW!The author, Jack Whyte has not let me down yet, and the story continues for another four volumes. His characters are strong and human. Some are pure evil and desperate for control. The family blood line is what drives his narrative, and at this point he is in the fourth generation.The historical period is fascinating, and Jack Whyte is a master historian of the time.  His dialog, description of living conditions, and customs makes the reader become one of the characters."}, {"userName": "Helena R-D", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/5661042-helena-r-d", "userReview": "I was tired of the fantastical tales of Arthur and decided to try the more realistic take on the tale and Jack Whyte doesn't disappoint. I really loved Merlin's voice and the way that his voice was quite amused as he told his tale through the book. Cassandra was heartbreaking and lovely at the same time and it just showed how a man can become a tale and a legend.I also liked the sympathetic take on Uther, since we don't get to see that very often."}, {"userName": "Dean", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/42400999-dean", "userReview": "I am not a fan of fantasy and never been a big fan of King Arthur however this series is so realistic, if there were a King Arthur then this series is about as close to realism as you will get...I have become a huge fan of Jack Whyte, I have read all his books. This book/series is no different than the others. Always he has great characters and lots of action. The historical events are always well researched."}, {"userName": "Megan", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/51565455-megan", "userReview": "3.5* I liked all the individual parts, but looking back on the book as a whole, I can barely say what it was about, or how it moved along the greater story of the series. Merlyn grows up and Uther grows up and they have experiences... but what does it mean? Other parts of the book were obviously meant to be important, but then they were very suddenly over and I felt I must be missing something. I'll continue the series, though. I'm still liking this post-Rome Britain development."}, {"userName": "Mandy", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/23526095-mandy", "userReview": "I'm enjoying this book series, but this one had a lot more fighting and descriptions of battle, which isn't my favorite, but the story is so well done and I'm enjoying the way it is told that I can hardly wait for the next chapter."}, {"userName": "Francesca", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/8941232-francesca", "userReview": "Coinvolgimento: 4/5Stile: 4/5Personaggi: 4/5Vicenda/Narrazione: 4/5"}, {"userName": "Vickie L Burkhouse", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/31277673-vickie-l-burkhouse", "userReview": "Entertaining, Enthralling I am truly enjoying this series. I read totally for entertainment and the series does not disappoint. I can't wait to start the next book."}, {"userName": "Aaminah Rose", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/68934005-aaminah-rose", "userReview": "DNF because the smut left me disgusted."}, {"userName": "Debbie", "userReviewDate": "Mar 29, 2014", "userURL": "http://www.goodreads.com/user/show/1698579-debbie", "userReview": "The Eagle's Brood is book three of the Camulod Chronicles and the story continues in great style.This book revolves around the eagle's offspring - Caius Merlyn Britannicus (grandson of Caius) and Uther Pendragon (grandson of Publius), both born at the same time on the same day and as close as brothers.Merlyn is a scholar and a thinker as well as a soldier. Brought up in Camulod his childhood is greatly influenced by Caius, Publius and Luceiia, and as he grows older, by his father Picus.Uther is much wilder and uninterested in book learning, but no less able and a very good soldier. His time is spent divided between the Pendragon lands in Cambria and Camulod. Britain is in disarray with all its institutions breaking down after so many years without Roman rule. The countryside is being constantly plundered by people from outside Britain, some of whom have started to establish settlements. Old Roman towns such as Londinium are scenes of anarchy and pestilence, while British chieftains across the land do whatever they can to secure their homes. In the Northeast, Vortigern, King of Northumbria has made a pact with some of the Outlanders, inviting them to settle on his lands in return for their protection from other invaders. In the South, Lot of Cornwall has built himself an impregnable fortress and proceeds to terrorise the surrounding countryside by land and by sea, and in Camulod they remain continually on alert, patrolling against and repelling invaders, and trying to keep their colony intact and well-governed. During one of these encounters Merlyn takes hostage a teenage boy, Donuil, son of Athol, High King of the Scotii. Donuil will be kept as hostage for five years and will be kept safe as long as the Scotii do not attack Camulod.Later Camulod comes under severe attack from Lot's forces and suffers great damage. Merlyn and Uther assume responsibility for the colony, but when Merlyn suspects Uther of a heinous crime against a woman he comes to love their relationship is compromised. Circumstances seem to clear Uther of the suspicions harboured by Merlyn, but those suspicions return later in far more damning circumstances.The Christian beliefs of the colony are also under attack, as the colony are followers of Bishop Pelagius who has been declared a heretic by the Christian Church. When an important Bishop's debate is scheduled to be held at Verulamium, Merlyn leads a contingent of the colony's finest soldiers there so that he can defend the colony's position. Merlyn's men end up rescuing the warrior-priest Germanus, Bishop of Auxerre, and his fellow priests and saving their lives and thus Merlyn strikes up a friendship with Germanus. Merlyn also meets Vortigern, King of Northumbria, and a disconcerting young man called Ambrose of Lindum. The Bishop's debate is too theological for Merlyn to take part in but he is able to successfully plead the case with Germanus that Alaric should not be proscribed because he followed the teachings of Pelagius. The trip to Verlamium also proves to Merlyn what a terrible state most of Britain is in.Returning to Camulod Merlyn becomes aware that Lot is amassing a vast force that is looking to sweep over the countryside, including Camulod. Attempting to get back to Camulod before Lot, Merlyn's troops are trapped and almost slaughtered until saved at the last minute by Uther and his men. Uther saves Merlyn's life but not before Merlyn's flail is used against him and he is smashed in the head with it. He spends the next two years at Camulod with total memory loss.When Merlyn recovers his memory he learns that Deidre, the woman he loved who was pregnant with his child, had been killed. Once again the circumstantial evidence points at Uther. Merlyn sets out to find Uther and confront him, but Uther is once again battling Lot, and by the time Merlyn gets there it is too late. Amidst the slaughter Merlyn finds a baby on a boat. Arthur, the 8 week old baby son of Uther Pendragon and Ygraine, daughter of Athol, High King of the Scotii, sister to Deirdre and Donuil. When Merlyn regains his emotions at finding the baby he realises that the boat has drifted to the mouth of the bay."}, {"userName": "Katie", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/31483116-katie", "userReview": "This is actually the same book as The Eagles' Brood, book 3 of Camulod Chronicles."}, {"userName": "Tonino Mangano", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/26631390-tonino-mangano", "userReview": "Concluso il libro 3/8.Con questo terzo romanzo della serie de Le Cronache di Camelot, si inizia a intravedere lo scorcio della leggenda. I primi due romanzi avevano timidamente aperto la strada a quella che è la famosa leggenda del ciclo arturiano per come si conosce, sebbene con le relative trasformazioni dovute a una trasposizione letteraria della leggenda in una versione dal taglio più storico. È per questo motivo che Merlino, protagonista e narratore in prima persona delle vicende, sminuisce la sua nomea di mago che è andato conquistandosi con il tempo, per quanto questa sua considerazione sia una metalessi del suo presente narrativo, quello in cui scrive la sua storia, da distinguersi dal passato che è narrato.Anche in questo terzo volume sono molti gli accorgimenti minuziosi di tipo storico per ciò che riguarda la storia della Britannia. Le riflessioni che vengono di volta in volta sviluppate da Merlino sono molto chiare e precise.Il solito problema di Whyte risultano essere le descrizioni prolisse dei fatti, che si svolgono in modo costante, ma con una lentezza che spesso tende all’esasperante e, almeno in questo romanzo, ha liquidato con una certa facilità più personaggi, senza soffermarsi sulla dinamica della loro fine come aveva fatto con eventi che, a mio parere, sembrano rivestire un’importanza inferiore.Eviterò spoiler, quindi indicherò come “un personaggio che doveva essere importante e risaltare maggiormente” non sia stato analizzato né sfruttato al meglio delle sue potenzialità, non sia comparso spesso e non abbia dato le stesse emozioni degli antagonisti dei libri precedenti.Ad ogni modo, è notevole come Whyte riesca a far prendere una forma meglio definita nella storia a quella che a tutt’oggi viene ancora considerata leggenda. Quelli che si considerano essere veri eroi divengono improvvisamente delle semplici persone, con capacità straordinarie, è vero, ma pur sempre persone che smarriscono spesso la retta via, che sono tormentati da dubbi, paure, perplessità e stupore, come mai sono stati dipinti da nessun altro.La prosa di Whyte, nonostante la pecca della prolissità già citata, risulta molto equilibrata nella sua forma. Non una parola sbagliata, tutto è sempre al posto giusto, tanto che la lettura ne risulta fluida e piacevole in svariati passi.In questo caso, non so cosa sia stato veramente a colpirmi di più, ma questo libro l’ho trovato molto più ricco di eventi, intrigante – almeno nella prima parte -, e guardare la realtà con gli occhi di Caio Merlino Britannico ha reso al meglio quella che è a tutti gli effetti l’esperienza di sentirsi un uomo inserito nel contesto storico di un’epoca di declino, ma che non ha arrestato il proliferare di idee, invenzioni e della ricerca di trovare dei mezzi per riconquistare la stabilità e la pace che si viveva sotto i tempi d’oro dell’Impero Romano e della sua pax.Quattro stelle su cinque!"}, {"userName": "Gary", "userReviewDate": "Sep 18, 2014", "userURL": "http://www.goodreads.com/user/show/11699631-gary", "userReview": "I was first introduced to the tales of King Arthur, whose realm is made magical by the intriguing wizard Merlin at six or seven. And in my teens I was very much impressed by the 1981 John Boorman movie Excalibur starring Helen Mirren, Nigel Terry and Nicol Williamson, starring a rather sinister and hard to like Merlin. Later I saw the more sympathetic Merlin in the highly engaging 1998 TV series Merlin starring Sam Neil. Have read Queen of Camelot by Nancy McKenzie which I loved and its sequels. The mediocre Pendragon cycle by Stephen Lawhead, the intriguing if drawn out Mists of Avalon by Marion Zimmer Bradley, the Bernard Cornwell Arthur trilogy and the somewhat disappointing Guenevere, Queen of the Summer Country by Rosalind Miles. Mary Stewart's Arthurian Saga is an absolute epic as good as Tolkien, together with Nancy McKenzie's works they are my very favourite historical fantasy series.I had not read any of the previous books in the Camulod Chronicles but Eagle's Brood is a great stand alone novel.This retelling is rich on history, dispels with actual magic in the sense of sorcery but does include some premonitions and telepathic knowledge through dreams, something intelligent people know to exist.Merlyn as Caius Merlynus Britannicus grows up with his cousin Uther Pendragon in the self contained colony of Camulod in Britain, a former Roman town, soon after the Romans have left Britain. Britain is threatened by SAxons, Angles, Jutes and Danes from the continent in the East, Picts from Caledonia the North and Irish and Scots from Hibernia to the West . Uther and Merlyn are of Roman patrilineage and Celtic matrilineage. Merlyn is the narrator of the story speaking in first person. As the story begins Merlyn;s father is the general and procurator of the colony which is still heavily Romanized and run and lived according to Roman ways.Merlyn grows up with Uther who is the same age They are adventurous and in their teens meet Lot, Prince of Cornwall who becomes their eternal and mortal enemy.They are trained from little to become soldiers and are commanders by their twenties. Arthur meets and falls in love with a beautiful mute girl who they call Cassandra, later revealed to be an Scots Irish princess. A hideous and evil crime puts strain between Merlyn and Uther and several mysteries and twists and turns and adventures provide the meat of the book.A Scots Prince, at first a captive becomes Merlyn's loyal follower and lieutenantIt takes us up to a great war between Uther and Lot who has become KIng of Cornwall and Arthur's procurement of the baby Arthur.My quibbles with the book are also a few. It is good, even gripping but didn't entrance me like Nancy Mckenzie' s Queen of Camelot books or Mary Stewart's Arthurian Partly because I prefer more of a Celtic feel to my Arthurian literature than a Roman one (and this one is Roman to the core)Whyte also in part rambles on a little but most of the book is exciting"}, {"userName": "Jason Munson", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/28267281-jason-munson", "userReview": "This author is quickly becoming another favorite of mine. I love this series so far and look forward to getting into the fourth book. I did not see the end coming in the second book, did not see the end coming in the third book and was sadden by the event that took place in this book. To me, as a reader, that is bordering on the line of greatness as an author. I am still not wanting however to give this book five stars becasue to me, that is left for great books and I think that early books in the series were better but still not great. Often in this book I found myself saying that this chapter does not progress the story but I understand why Mr. Whyte included it because it gave better understanding to a character and who they were. This allows the reader to understand who they are reading about better but often I said, this did not have to be here and I felt at that point much was becoming page filling. This makes me slightly weary to proceed on because I did not notice this as much in the first two books. All this being said, a great tale and spin on what might be our greatest modern day myth. If you are a fan of history this is a book for you or a fan of military history, Mr. Whyte exceeds other authors in his knowledge of the tactics of this period and including them in his writing. If you love Arthor and his legend, meaning the man himself, do not expect what you have known, this is a new tale and up and through this book, this is the tale preceeding Arthor. I liken it to another book series that was 9 books long that was very successful, the middle three books being made into movies and a stand alone set, then the first three being made at a later date. I feel the first three here are their own set and have a feeling that the next three could be a stand alone set in themself. The only way I will find out is to proceed forward and get to reading book four. I highly reccommend this to history lovers and lovers of the tale of Arthor. More importantly, if you love Arthor without the magic, this is for certain, the story for you."}, {"userName": "Rusty", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/3379953-rusty", "userReview": "Book 1, Hatchlings, and Book 2, Fledglings, were about the childhood and youth of two friends - Caius (who will become known as Merlin or Cais Merlin) and Uther. In addition, their uncle tells Caius about the making of Excalibur. His uncle fashioned Excalibur using a little known process to make it. Caius is told that he will become the keeper of the sword when his uncle dies.Uther and Cais Merlin know each other well based on their boyhood ether. Each can anticipate the actions of the other. Both have lost their fathers and both grieved deeply. Uther has become King, replacing his father, Uric, and Merlin heads his home, Camulod. Lot is an enemy beyond par - evil, devious and very intelligent and intends to rule Britannia. Uther & Merlin both vow to kill him.Merlin falls deeply in love with a young woman who has been brutally beaten and raped. He fears that Uther was responsible. He names Cassandra, recognizing that she cannot speak. When his aunt meets her, she informs him that the young woman is carrying his child. She is convinced to move from her hidden valley to Camulod for the wedding. When Marlin' budding adjutant sees her he falls to his knees. The young woman is his sister who he has believed dead. She tells the story of her survival through sign language.The tale moves on until Arthur is born. Rather than provide more details, I urge readers to pick up this novel for themselves. Very nice read."}, {"userName": "Elaine", "userReviewDate": "Feb 23, 2011", "userURL": "http://www.goodreads.com/user/show/2717045-elaine", "userReview": "The third in the excellent Whyte Camelot series-and once again, he has struck gold. Although the major \"players\" are there, he focuses more intently on the ordinary members of the community. It's fascinating series examining the social and political foundation of Camelot, and as such is hugely speculative. Yet in some repsects it reads like a factual work. Am limiting myself to an aoocasional \"fix\" to make the series las as long as possible! So it might be quite some time before I get around to book 4!Having concluded p3, I was delighted to see that previous form was maintained. Rather a lot of time was devoted to the religious upheaval, and the controversy surrounding Pelagius and his resultant apostasy. At the same time, this gave a good and solid foundation to move the novel onwards and start to direct Merlin towards religion/healing, rather than being mainly a warrior. Many of the characters only make fleeting appearnaces-like Ygrain, for example. Yet none have quite such a brief cameo as the babe Arthur who appears on the second last page! This sets the scene nicely for book 4, which I'm sure won't disappoint. I'm so glad that Arthur will finally reach centre stage-it's been a long time in coming."}, {"userName": "Shane", "userReviewDate": "Sep 16, 2009", "userURL": "http://www.goodreads.com/user/show/974537-shane", "userReview": "Having read the first two books, I was slightly unimpressed by this third one. The plot endpoints were good, but getting there was somewhat droll. I've always been more entertained by the building part of a story and this just wasn't a part of it. It will lend a lot to the rest of the story and provided quite a bit of character reference for later as well, but there just wasn't much for world building or any major plot building (aside from the very end.) One thing that I must give Whyte credit for, is the extraordinary re-imagining of the Arthurian legend. I, like most boys, was always fascinated by the Arthur stories and that hasn't waned a whole lot as I've grown older. I found distinct pleasure in the previous book as both Merlyn and Uther were introduced and of course, at the end of this book when Whyte begins to reveal the tryst between Uther and Ygraine and their offspring, Arthur. I look forward to reading the rest of the series. I could never recommend this book as a standalone novel, but it serves very well as a bridge book for the series to get us from the upstarts of Camulod to the entrance of Arthur."}, {"userName": "Aaron Althuizen", "userReviewDate": "Sep 06, 2012", "userURL": "http://www.goodreads.com/user/show/12568195-aaron-althuizen", "userReview": "Another amazing series by Jack Whyte. If you enjoy being immersed into the story, these tales will certainly provide you with the right tools.From Wikipedia:'The novels are a rendition of the Arthurian legend that attempt to propose a possible explanation for the foundation of Camulod (an alternate spelling of Camelot), Arthur's heritage and the political situation surrounding his existence. The setting series begins during the Roman departure from Britain and continues for 150 years ending during the settlement of Britain by the Germanic Angles, Saxons and Jutes.The Skystone - 1992 Publius Varrus, Roman-occupied BritainThe Singing Sword - 1993 Publius Varrus, Roman withdrawal completeThe Eagles' Brood - 1994 Uther and Merlyn control CamulodThe Saxon Shore - 1995 Merlyn raises ArthurThe Fort at River's Bend (The Sorcerer, Vol 1) - 1999 Arthur grows to manhoodMetamorphosis (The Sorcerer, Vol 2) - 1999 Merlyn becomes a sorcererUther - 2001 Stand-alone novel about Uther (covers same time period as Eagle's Brood)Clothar the Frank - 2004 Lancelot arrives in Arthur's courtThe Eagle - 2005 Concluding novel, Arthur's reign ends'"}, {"userName": "bkjunkie", "userReviewDate": "Sep 21, 2009", "userURL": "http://www.goodreads.com/user/show/2762637-bkjunkie", "userReview": "This story like the two before it continues to introduce the background of the characters behind the camulod story. This book is mostly told from the perspective of the character who becomes Merlyn. It has less story and more military scences which for me is where I checked out a for a bit. But, at the end picks up the ongoing story and has a climatic ending leaving me wanting to immediatley pick up the Saxon Shore to see what will happen next. This is why I gave it three stars. If you are really into detailed fighting scenes and military strategy, this book has a lot of that inside it. If you are not, it is necessary to read anyway to become familar with Caius aka Merlyn. Each author has his own version of this ageless tale and you must know what Caius has gone through in order to understand where the rest of the series is going. This book is his story and a lot happens to him. It is his growing up time including childhood but also his 20's where he slowly becomes who he is ultimatley to be."}], "description": "The Eagles' Brood continues the saga of the Colony known as Camulod, and the tale of the descendants of those brave Romans who forged a new way of life for the Celt and Roman peoples when the Roman legions departed Britain.Most know the new leader of the Colony as Merlyn; all call him Commander. Cauis Merlyn Britannicus is responsible for their safety, and all look to him for guidance, leadership, justice, and salvation. It is a harsh life but a good community, and Merlyn is dedicated to spreading the influence of Roman culture beyond the Colony's borders.Uther Pendragon, the man who will father the legendary Arthur, is the cousin Merlyn has known and loved since they were birthed, four hours apart on the same day, the year the legions left Britain. He is the tireless warrior--the red dragon to Merlyn's great silver bear--and between the two of them, the Colony knows few enemies.As different as they can be, they are inseparable: two faces of the same coin. In a world torn apart by warfare and upheaval, each is the other's certainty and guarantee of the survival of the Colony . . . until a vicious crime, one that strikes at the roots of Merlyn's life, drives a wedge between them. A wedge that threatens the fate of a nation . . . .", "title": "The Eagles' Brood\n      \n          (Camulod Chronicles #3)", "url": "http://www.goodreads.com/book/show/372494.The_Eagles_Brood", "average": 4.25, "cover": "https://images.gr-assets.com/books/1440243992l/372494.jpg", "reviews": 122, "authors": [{"url": "https://www.goodreads.com/author/show/45309.Jack_Whyte", "name": "Jack Whyte"}], "type": ["Historical", "Fantasy", "Fiction", "Mythology", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/372494.The_Eagles_Brood", "http://www.goodreads.com/book/show/481842.The_Eagles_Brood", "http://www.goodreads.com/book/show/21033890-merlyn", "http://www.goodreads.com/book/show/372495.The_Eagles_Brood", "http://www.goodreads.com/book/show/35061769-la-stirpe-dell-aquila", "http://www.goodreads.com/book/show/18981871-the-eagles-brood", "http://www.goodreads.com/book/show/10320685-la-stirpe-dell-aquila", "http://www.goodreads.com/book/show/151723.The_Skystone", "http://www.goodreads.com/book/show/372493.The_Singing_Sword", "http://www.goodreads.com/book/show/151722.The_Saxon_Shore", "http://www.goodreads.com/book/show/128202.The_Fort_at_River_s_Bend", "http://www.goodreads.com/book/show/151718.Knights_of_the_Black_and_White"]}