{"ratings": 2386, "userreviews": [{"userName": "Carol. ", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "Find this review (and others) at https://clsiewert.wordpress.com/2015/...Oh apocalypse, how you fascinate us. There’s probably been doomsayers since the beginning of time, but it seems like you’ve really come into your own in the era of climate change, burgeoning population and widespread weaponry. The End is Nigh is the first book in a three-part series edited by John Joseph Adams and Hugh Howey (of Wool fame) is centered around the events leading up to apocalypse scenarios. I came at this series backwards, beginning with the end book and moving on to The End is Nigh. These stories mostly felt like teasers, world-builders with ambiguous endings which will lead up to the events in The End Has Come.See Althea Ann’s excellent summary for a brief description of each piece.Five-star: Tananarive Due’s story, “Removal Order” is about a young woman taking care of a cancer-ridden grandmother as her community is evacuated. Haunting atmosphere, interesting angle on the approaching devastation, it was one of the small, quiet, haunting stories of the apocalypse. David Wellington contributed a straight-up infectious-zombie story as it was beginning to break, a classic take that was well done. “Goodnight Moon” by Annie Ballet is about seven astronauts and was an absolutely perfect bottle story of impending disaster and loss. Will McIntosh’s “Dancing with Death…” has a fascinating premise of an infection that causes a locked-in syndrome. Perfect. I should look up more McIntosh. “Love Perverts” by Sarah Langan dealt with teenagers coping with changes as the end of the world approaches, and how one teen’s sexuality might have lead his parents to abandon him. Emotionally real. Another author worth checking out.Four-star: Robin Wasserman examines the irony of an experience con artist leading an end-of-the world cult, reunited with a believing teenage son. Jake Kerr’s “Wedding Day” wonders what would happen if we knew about an eventual asteroid impact from the perspective of an unmarried lesbian couple. It’s a modern twist on what it means to be connected. Tobias S. Buckell contributed a buddy-movie scenario where two friends are trying to make money catching a hacker. Unbeknownst to them, the hacker has specific future plans. It had a snappy pace. Seanan McGuires “Spores” was a nice character piece about a scientist with OCD. Heavy on the message, it excelled in atmosphere and character. Howey’s contribution, “In the Air” was notable for centering on a government worker who has foreknowledge of the upcoming disaster but doesn’t share his knowledge, and how it plays out in his personal life. Ford’s period piece on a Chinese man working in San Francisco during Haley’s Comet was atmospheric, just seemed to suffer from choppy writing.Three-star: Desirina Boskovich experiments with aliens who want to transport Earthlings to a heavenly paradise. Heavy-handed in its religious and social themes, I did enjoy the budding relationship between two main characters. Charlie Jane Anders has an interesting beginning to her apocalypse; a couple of outcast kids and a camera becoming Youtube sensations in “Break!Break!Break!” Examines viral media and society but again, thematically heavy-handed. The voice of the teenage daredevil felt very real with interesting sentence structure–the author has a gift for characters. I was a bit underwhelmed by Ken Liu’s “The Gods Will Not Be Chained,” considering his reputation. While it definitely provided the needed foundation for his story in the last installment, it was equally heavy-handed in building artificial intelligence and bullying. On the up side, it gave me some fun ideas for emoji communication.I liked Kress’ story about a single mom struggling with raising two kids on a shoestring budget. The conclusion was a little… hmmm, and I didn’t quite see where it fit in with the apocalypse, but it was well-told and felt real. While I loved Ben Winter’s The Last Policeman series, he tries an interesting approach with his piece, about a world who suddenly starts hearing the ‘voice of God,’ except a young girl. The parents, worried that she will not be saved, struggle with what to do. It creates a nice horror feeling but feels heavy-handed as well. Jonathan Maberry’s story about a man who specializes in extracting people from cults was competently done but felt slightly didactic.A few completely missed me. Megan Arkenberg tries to incorporate concepts with virtual reality and art in the face of disaster. I found it mostly confusing and had little connection with the characters. Scott Sigler’s story about an annual dudes’ hunting trip was a miss, which was partially my fault. I knew where it would end from reading book three, so I wasn’t interested in the “first contact” exploration in book one. Matthew Mather’s “Enlightenment” on a literal interpretation of eating the body was just Concept Yuck, but I have little horror tolerance. It didn’t really fit with the collection. Paolo Bacigalupi’s piece on water shortages and journalism was a ‘meh.’ McDevitt gave a terribly ironic twist to his professional astronomer who wants so desperately to be named after an astronomical feature.Really, the collection excelled as character pieces, apocalypse or no apocalypse. The authors often used impending events as a backdrop to exploring emotional and philosophical issues. On to the middle book of the series, where we see if this book acted more as foundation pieces for action in the next.Three and a half stars."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Apr 01, 2014", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "[Introduction—John Joseph Adams, read by Lex Wilson\"Post-apocalyptic fiction is about worlds that have already burned. Apocalyptic fiction is about worlds that are burning.The End is Nigh is about the match.\"The Balm and the Wound —Robin Wasserman, narrator Jack KincaidEnd times and a preacher rises up.Heaven is a Place on Planet X —Desirina Boskovich, narrator Folly BlaineAliens forcing humans to be enforcers of their own people, in preparation for a worldwide move to Planet X. You can read this story on Wired.com.Break! Break! Break! —Charlie Jane Anders, read by James KellerTeenaged film makers The Gods Will Not Be Chained —Ken Liu, read by Anaea LayCommunicating with the past through emojiWedding Day —Jake Kerr, read by Folly BlaineWhat does it take for gay marriage not to be an issue? How about an earth-destroying asteroid? Sounds campy but isn't, very present-day pending doom.Removal Order —Tananarive Due, read by Laurice WhiteA very sad story that left more questions than answers and I hope it continues in the next anthology of the triptych. The narrator was perfection for the tone of the story.System Reset —Tobias S. Buckell, read by Jack KincaidA post-Snowden, pre-apocalypse hacker wish fulfillment story. :)This Unkempt World is Falling to Pieces —Jamie Ford, read by Rajan KhannaComet story. Honestly I forgot it already! BRING HER TO ME —Ben H. Winters, performed by a cast that includes Kate Baker, Mur Lafferty, Anaea Lay, Tina Connolly, Rajan Khanna, Lex Wilson, and Jack Kincaid as GOD VOICECreepy. I hope God never speaks to me. A must-listen in audio.In the Air —Hugh Howey, read by Lex WilsonIn the same world as Wool, a father elects not to go to the silo even though he knows the world is ending. This story is the last day with his family.Goodnight Moon —Annie Bellet, read by Tina ConnollyAstronauts facing certain death. No really, certain. I thought it was lovely.Dancing with Death in the Land of Nod —Will McIntosh, read by Norm ShermanA decently interesting virus premise, a drastically mundane setting.Houses Without Air —Megan Arkenberg, read by Anaea LayIn this pending apocalypse, the world is running out of oxygen, which will be certain doom. One person's roommate responds with art.The Fifth Day of Deer Camp —Scott Sigler, read by Scott SiglerOh my gosh, you must get the audio for this one. The author does a great northern Minnesota accent for this of what would make a great story from deer camp if these guys can survive.Enjoy the Moment —Jack McDevitt, read by Sarah TolbertThe first of two stories that include a the interruption of the earth's orbit. This one is more connected with a physicist and an important discovery.Pretty Soon the Four Horsemen are Going to Come Riding Through —Nancy Kress, read by Mur LaffertyA major volcano blew unknown substances across the world 5-6 years before this story takes place. The effects on the unborn children of the time are just now starting to be noticeable. I'm glad the author is continuing the story in future volumes because non-violence doesn't seem like the end of the world to me!Spores —Seanan McGuire, read by the incomparable Kate BakerThe end is near and it is a FUNGUS. Of course. Not quite as creepy as her Parasite novel but has more heart, and really more about living with OCD than it is about the end of the world.She’s Got a Ticket to Ride —Jonathan Maberry, read by Ralph WaltersAnother story about the earth's orbit, this time with more cults!Agent Unknown —David Wellington, read by Jack KincaidThis story feels very much like straight zombies, but okay, we can call it a virus.Enlightenment —Matthew Mather, read by Kate BakerThis one can only have an emotional response. I was driving when I listened to it and I almost threw up. Horrifying but would have been more believable if the characters had more to them. The relationship between the most important two never made sense. Shooting the Apocalypse —Paolo BacigalupiA story about a reporter and a photographer covering the water crisis on the border between Arizona and Texas, which are now separate countries.Love Perverts —Sarah Langan, read by Lex WilsonMad Max and an apocalypse lottery. (hide spoiler)]"}, {"userName": "Althea Ann", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "If you liked John Joseph Adams' 'Wastelands' anthology; then this one is a must. The stories range from good to excellent.This is an independently released anthology, but it's got the right names behind it and I'd expect it to succeed, because this is a fully professional, high-quality collection. **** The Balm and the Wound—Robin WassermanA cult leader is adept at providing platitudes and fleecing his flock. But after his young son is dropped off at his place; the leader, along with the rest of the doomsday cult, finds himself swept along in a survivalist current, with the boy at the helm. Very nicely done. I really enjoyed the ironic tone.**** Heaven is a Place on Planet X—Desirina BoskovichAliens have arrived; and informed the planet that at the end of the month; everyone will be zapped into oblivion/transported to a distant paradise planet. Everyone, that is, who continues about their business as usual. Enforcers are nominated to shoot anyone who acknowledges that the end is at hand. Eliminating their fellow citizens is hard; but paradise is at stake... or so they believe.**** Break! Break! Break! —Charlie Jane AndersStarts off feeling like a high-school-memoir, telling the story of a nerdy stuntman's kid and an aspiring filmmaker to team up to create a viral Internet sensation. And then it becomes a cautionary tale about how art can be co-opted for political gain... and it gets a lot better.*** The Gods Will Not Be Chained—Ken LiuNot bad, but I feel like I expect better from Ken Liu. As far as themes, it starts out with cyberbullying, and has some interesting insights into the uniqueness of communicating with emoji - and gets into the nature of human intelligence vs. AI - rolled into a story that I found a bit more sappy than genuinely moving.*** Wedding Day—Jake KerrA super-contemporary feel to this one. A long-term lesbian couple want to get married, but their long-deferred plans go awry when it's announced that an asteroid impact will soon devastate America - and only some of our citizens, determined by lottery, will be able to travel to safety in time. Again, a bit sappy, and I really didn't agree with the conclusion, either.*** Removal Order—Tananarive DueWhat this story made me think about is how very peculiar it is that our society values keeping people alive when they have no hope of recovery from illness, and they are in horrible pain. This story has that situation: a young woman has stayed in an evacuation zone to care for her dying grandmother. The situation is believable, and is dealt with in a sensible manner, but I don't think I had the empathy with the main character that the author intended.*** System Reset—Tobias S. BuckellA hacker and his buddy try to stage a citizen's arrest of another hacker - one with terrorist tendencies. But they screw things up, an the situation ends up worse than they imagined.**** This Unkempt World is Falling to Pieces—Jamie FordHalley's Comet is scheduled to sweep by Earth in 1910, and doomsday fever has swept society. Darwin Chinn Qi is a young Chinese man working a menial job at a fancy comet-themed party. Few of the sophisticated partiers seem to really believe the end of the world is at hand... But telling more would be spoiling. Really liked it.**** BRING HER TO ME—Ben H. WintersTwenty-odd years ago, pretty much everyone on earth started hearing the voice of God inside their heads, telling them what to do. And what God wants everyone to do now is to commit suicide by poison. However, one girl has been 'deaf' to this voice since birth. One of her parents wants to 'hide' this defect and give her the poison. The other wants to turn her in to the authority... A much more horror-genre feel to this than most of these stories. The ending is a bit ambiguous - but that's OK, 'cause it was good and spooky.*** In the Air—Hugh HoweyA government agent was privy to the knowledge that the government planned on blowing up the vast majority of humans via nanomites in the bloodstream. But he remained silent, and said nothing - and opted to try to save his family. Nice exploration of ethical issues, but the story itself could've had a bit more...*** Goodnight Moon—Annie BelletNo relation to the Margaret Wise Brown classic kids' story! A team of seven researchers on an international moon base discover a huge asteroid heading straight for them. Their emergency shuttle can only hold three, at a pinch. The team must decide who has a chance at life; who will die, and face their fate. It's an emotionally wrought situation, but stops just short of sentimentality. Still, I wished there was some sort of new twist to this familiar scenario.*** Dancing with Death in the Land of Nod—Will McIntoshA pandemic brings an unlikely couple together. Forty-something Johnny helps his aging dad with his failing drive-in theater. Twenty-something Kelly, who never completed nursing school, bonds with him over their mutual inability to get out of their stifling small town. Together, they try to care for the townspeople who've been struck by a new, incurable illness. *** Houses Without Air—Megan ArkenbergRoommates Beth and Fatima deal with the approaching end of the world through their vocations. Volcanic explosions mean that everyone will soon be suffocating. Beth has been working on an immersive virtual reality experience. Fatima is a well-known artist who creates memorials. OK, but I wanted a little more from it...*** The Fifth Day of Deer Camp—Scott SiglerFive buddies on a camping trip are snowed in to their hunting cabin - when a UFO lands right near them. The news lets them know that it's a large-scale alien invasion. They prepare to try to defend themselves.*** Enjoy the Moment—Jack McDevittPhysicist Maryam Gibson is desperate to get her name on a major discovery and cement her scientific reputation. But does anyone really want their name applied to the phenomenon that will be responsible for the end of life on earth?**** Pretty Soon the Four Horsemen are Going to Come Riding Through—Nancy KressSophie and Cassie's mom might not be educated herself, but she's gone out of her way to make sure that her two girls go to a good school. It's not surprising that her kids get picked on for their old clothes and obvious lack of wealth. The teachers may think that aggressive, older Sophie is the problem, with her tendency toward fighting. However, mom knows that younger, sweet but passive Cassie might be the real problem - and that it could be a bigger issue than anyone's guessed. The story's a very effective illustration of how revelations don't have to come from the halls of academia, but can come from native intelligence and common sense. Not that that will save the world...***** Spores—Seanan McGuireLab worker Megan is known for being paranoid. Her OCD means that she's always cleaning, and her co-workers and loved ones are on the lookout for her 'episodes.' However, just cause you're paranoid doesn't mean there's nothing to worry about. Megan works in a bioengineering lab... and not all of her colleagues share her focus on safety and caution. Excellent, truly horrific story. (I've really got to get around to reading Seanan McGuire/Mira Grant's other work...)*** She’s Got a Ticket to Ride—Jonathan MaberryA hired 'deprogrammer' specializes in getting young people out of cults. But one particular assignment: extracting an heiress from a doomsday cult, might cause him to see things a bit differently.**** Agent Unknown—David WellingtonStraight up zombie medical-thriller. Really very good - it's a prequel to an upcoming novel, and I just might go out of my way to read it when it comes out.*** Enlightenment—Matthew MatherHey! There's no end-of-the-world here! This is a horror story about a sort of religious group that likes to throw very special dinner parties. It's quite disturbingly horrific, but it also sounds quite a lot like the premise of Graham Masterson's 'Feast' (aka 'Ritual.')**** Shooting the Apocalypse—Paolo BacigalupiOne of Bacigalupi's favorite topics - water shortage. A border conflict, a corpse hung up a a fence, left to animals and the elements. A drug war casualty, or superstitious sacrifice? Two journalists are in search of the story, in hope of a scoop. As always with Bacigalupi, this is really, really well done. The different, contrasting motivations here are played against each other really well - from petty personal arguments to decisions that will have far-reaching consequences - and the agonists are, always, all too human. However, I had mixed feelings about the depiction of journalism as utterly predatory and ultimately selfish. It's an argument I've seen a lot of lately, and I'm on the other side of it. **** Love Perverts—Sarah LanganAn asteroid is heading for Earth. The chosen few have been issued tickets to get into underground bunkers, where they hope to live and survive for generations. Teenage Tom Crawford's wealthy family had tickets - but they left him behind. He thinks maybe it's because he's gay. His best friend, Jules, never had a chance. A nicely crafted tale of different kinds of love - and how some love is real and true, even when the kinds of love we expect to receive turn out to be false."}, {"userName": "Steve", "userReviewDate": "Jun 23, 2014", "userURL": "http://www.goodreads.com/user/show/2314568-steve", "userReview": "This is an excellent anthology with an interesting premise: it's the first of three planned anthologies, but with a twist. All the stories in this one (the first) are set in the time just before an apocalyptic event. The second anthology will be continuations of the first set of stories and will be set DURING the above-mentioned apocalyptic events, while the third anthology will be the end of the stories, set AFTER the events. So in effect, this is the first book in a trilogy of trilogies. Kudos to John Joseph Adams in coming up with concept!The stories in this volume a mostly very good, with a couple of outstanding entries and a couple of not-so-good entries.The ones that stood out to me, really capturing the mood/feel of pending doom were, \"In the Air\" by Hugh Howey, \"Spores\" by Seanan McGuire, \"Removal Order\" by Tananarive Due, and \"Houses without Air\" by Megan Arkenberg.The ones that didn't work for me were, \"Love Perverts\" by Sarah Langan and \"Enlightenment\" by Matthew Mather. Didn't care for these two at all.Overall, a good set of stories, and I'm looking forward to the next in The Apocalypse Triptych, \"The End is Now\"."}, {"userName": "Roz", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/7706990-roz", "userReview": "Let's just say I've finished this book. I haven't read all the stories, I had to give up after reading so many bad ones.. I've been trying to get through this book for a week, so I decided what I read was enough.One of my favourite story was Removal Order by Tananarive Due, it broke my heart and then I had nightmares, my favourite combo.. I have to check out her other works! My absolute favourite was - not surprisingly - Spores by Seanan McGuire. I will have to get the other two books just for her stories. Rating this was hard, because I gave so many stories 1 star in the end, so I'm not counting the rating for the latest stories, I was too impatient at that point.."}, {"userName": "Carolyn F.", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/2624012-carolyn-f", "userReview": "Anthology. I'm going to reach each author's work in this triptych. Starting with Volume 1, then Volume 2 and lastly Volume 3. I'm hoping that each story will give an extension of the beginning story. 3.89 stars average. Most of these stories were 4 or 5 stars. I would definitely recommend this book.1. The Balm and the Wound by Robin Wasserman. A con-man is right and his unknown young son ends up being just what his cult needed. Loved this story, which I didn't think I would because I thought it would ridicule religion but nope. It ends with may he was right all along. But we'll see. I'm so glad I can keep the story going. 5 stars2. Heaven is a Place on Planet X by Desirina Boskovich. Aliens came and said everybody will be vaporized and moved to another planet but you MUST go on as usual or you'll be misted (kind of vaporized but not to another planet) by the chosen enforcers. Good story, it was sad which people were chosen to be misted. 4 stars.3. Break! Break! Break! by Charlies Jane Anders. A teenager and his friends make movies a la Harold Lloyd while he runs from bullies and his brother prepares to join the Army all in the middle of a \"conflict\". Good story. 4 stars. 4. The Gods Will Not Be Chained by Ken Liu. A push for a kind of immortality isn't going as planned. Another really good story. 4 stars5. Wedding Day by Jake Kerr. An asteroid is going to hit North America and some of the other countries are accepting refugees. There's a lottery to see who gets to go. Sad/sweet story. 5 stars.6. Removal Order by Tananarive Due. A deadly flu has evacuated a city leaving a granddaughter caring for her dying grandmother. Great story. 5 stars.7. System Reset by Tobias S. Buckell. A techo nut sets off an EMP so that the world will be reset with him and his kind as the leaders. The people that try to stop him have another idea. Really good story. 4 stars.8. This Unkempt World is Falling to Pieces by Jamie Ford. A party, a false alarm, then the read thing. Sad ending. Good story. 4 stars9. BRING HER TO ME by Ben H. Winters. An already dystopian world with a power and a final solution. I really liked this story.5 stars.10. In the Air by Hugh Howey. A Wool prequel about a man who has three choices and hopes he picked the best one. 4 stars.11. Goodnight Moon by Annie Bellet. A group of scientists prepares for the worst. Really sad story. 4 stars.12. Dancing with Death in the Land of Nod by Will McIntosh. Neighbors try to help others with a paralyzing disease. Super sad ending. 4 stars.13. Houses Without Air by Megan Arkenberg. Somehow the world is running out of oxygen - smog, volcano? And one roommate works on a computer game and the other works on a diorama. I was still confused by the end of the story. 2-1/2 stars14. The Fifth Day of Deer Camp by Scott Sigler. A group of friends on their annual hunting trip find out Earth has been invaded. Good story. 3-1/2 stars15. Enjoy the Moment by Jack McDevitt. A physicist discovers an anomaly which will eventually change everything on Earth. 4 stars.16. Pretty Soon the Four Horsemen are Going to Come Riding Through by Nancy Kress. A mom tries to raise two very different daughters. 4 stars17. Spores by Seanan McGuire. A practical joke goes wrong. I would have been beyond furious and would come at them for blood. The reaction seemed pretty tame to me. 2-1/2 stars18. She's Got a Ticket to Ride by Jonathan Maberry. A man tries to save a girl from a cult and find out she doesn't need saving. For a short story, it's kind of weird to complain about it being too long in parts. When the protagonist goes on, and on, and on about kids going bad and then does the same about planets to the point where I start being bored at page 1-1/2, something is wrong. Maybe it's me but 2 stars for this story. 19. Agent Unknown by David Wellington. A 20 year incubation time has expired. 4 stars.20. Enlightenment by Matthew Mather. Okay, that was weird & gross. 2 stars21. Shooting the Apocalypse by Paolo Bacigalupi. A photographer and a reporter discover a story that could kill millions. 4 stars22. Love Perverts by Sarah Langan. Horrible parents have a miracle kind son who will sacrifice everything for his family. Wonderfully sad story. 5 stars"}, {"userName": "Kathy", "userReviewDate": "Mar 01, 2014", "userURL": "http://www.goodreads.com/user/show/8778491-kathy", "userReview": "Some people may think what I have written are *spoilers*. Gave a very brief overview and my thoughts on the stories. This anthology is the best I have read. In any book with so many stories, some hit the mark, some don't. There is a little bit for everyone. I feel lucky that the first few stories I chose to read were really great. That is what kept me involved and reading \"just one more\" before putting it down for the night.Although I am still working my way through, I wanted to comment on certain stories as I go along. With anthologies I enjoy seeing what stories people liked the most. So far:Goodnight Moon by Annie Bellet is my favorite. A tear jerker about astronauts on the moon and an impending asteroid and life and death decisions. Beautifully written.Spores by Seanan McGuire was really great. Creepy good and it has to do with mold!She's Got a Ticket To Ride by Jonathan Mayberry. At first I was thinking it was a rip off of the Hale-Bopp Heaven's Gate people. But after that was mentioned in the story, it went beyond that idea and will have you re-thinking what a \"cult\" really is. I enjoyed it very much.In The Air by Hugh Howey. Let me just say this: If only Shift was this compact and short...Shooting The Apocalypse by Paolo Bacigalupi. I was really looking forward to this one and maybe I will re-visit it but I thought it was a mess and I completely was not interested in this one.Update:Dancing With Death in the Land of the Nod by Will McIntosh and Wedding Day by Jake Kerr are very different types of stories but both have an ironic twist that makes these two really special. Dancing With Death involves an incurable disease that puts its victims into a paralysis but they can still think clearly. One of the main characters in the story is a caretaker for his father who has Alzheimer's. When only 3% of people in areas affected by the Nodding disease are spared, our main character who may escape the dreaded disease thanks good genes. In Wedding Day, a to be married lesbian couple could have possibly escaped certain death from an impending meteor strike if only the government didn't halt all marriages. Update:Removal Order by Tananarive Due. With no real explanation of what has caused the world to go into its demise, the story jumps right in with Nayama who is taking care of her Grandmother who has cancer. A story about sacrifice and love. Caring for a loved one outweighs the fact that the world is dying around you.Heaven is a Place on Planet X by Desirina Boskovich. A strange but interesting story about an alien invasion. The aliens are going to zap the whole world into dust but promises a new heavenly life on a new planet that will occur on a certain date at an exact time. First though, random people around the world are chosen as enforcers to eliminate anyone who doesn't follow instructions given by the aliens. I am hoping this story has a continuation in the next book, the end is filled with foreboding of the ultimate fate of the enforcers. A story that warns about Propaganda and blindly following those that use power and violence to get people to submit."}, {"userName": "Bogdan", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/2537876-bogdan", "userReview": "The ideea of this three volume Anthology is great, to have three storie connected and to report the things before, in, and after a special apocalyptic event, but the texts, unfortunately, aren`t on the same level.The first half was quite boring and I was very close to let it go.But, in the end, I could find some interesting texts, but, still, I don`t thing that it will be a powerful factor to convince me to try the second volume of the series.Dancing with the dead in the land of Nod, Will McIntosh - Was the first one that was an easy and interesting read.The fifth day of Deer camp, Scott Sigler - A real prelude to the next story so nothing big happened here, but still easy to get into. The aliens are here. What will we do?!Pretty soon the four horsemen are going to come riding through, Nancy Kress. Quite a long title. This one was also interesting. There are some special kids with that, after a big event, have lost some of their senses.Spores, Seanan McGuire - Maybe the scariest and the most thrilling one. About a fungus type spore that spreads and spreads...She`s got a ticket to ride, Jonathan Maberry - About a cult for the end of the world that is closer to the truth that anybody could be thinking.Agent Unknown, David Wellington - Vampire like end of the world. in a way originalEnlightenment, Matthew Mather - The creepiest one here. Some cannibalistic rituals included.Overall, I enjoyed only seven stories from twenty two. Not such a good number, eh!?"}, {"userName": "Kate Jonez", "userReviewDate": "Jun 30, 2014", "userURL": "http://www.goodreads.com/user/show/2640164-kate-jonez", "userReview": "Wonderful anthology and a great idea for a collection. While some stories were stronger than others, no story was a miss. Recommended for readers who enjoy apocalyptic fiction. I can't wait to read the next installment!"}, {"userName": "Amber", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/3795626-amber", "userReview": "[ The Balm and the Wound - 4 starsI like the idea that a con man who preaches about the approaching apocalypse to get people's money actually ended up predicting right. It is funny to think that this cynical con artist will likely be regaled by the survivors as a prophet, martyr, and hero, while in reality he is skipping town with their money. The loss of a star isn't really because of anything wrong with the story (not one I can put my finger on, anyway), but because I felt I could have liked it more. Maybe if we had gotten to know the kid a little deeper or if there had been a touching moment between them or something. They were mostly just kinda reserved and distant around each other, and I wish they had warmed to one another a little more. Some emotional element was missing. Otherwise, excellent story.Heaven is a Place on Planet X - 4 starsThis was a creepy little dystopia, and I liked the uniqueness of this apocalypse. While I don't mind the classics, it is always nice to see one that breaks the mold a little. And I liked how the source of this apocalypse was rather ambiguous: are aliens really going to kill us/save us, or is this a government conspiracy put in place so we weaken ourselves for invasion/hostile takeover/whatever? The tanks in the end and the fact the countdown clock turned out to be rather meaningless points to the latter. The docked star is, again, because I felt I could have cared for the characters even more if we had explored them deeper. Break! Break! Break! - 3 starsThis one was just okay. I really liked the characterization of the narrator and how he wasn't really an active player in the apocalypse. He was just some hyperactive high school kid who wanted to make videos and perform crazy stunts. He could care less about the politics that were tearing the world apart. This really made him feel like an actual person. However, a lot of the world-building and plot were rather murky. Like, I get that the government is drafting younger and younger people into their war, and the red bandanas are the resistance (I think). But why would the red bandanas shoot up a peaceful anti-war rally? Aren't they themselves anti-war? And why does being a red bandana allow one to beat the shit out of a teacher in public with no consequences whatsoever? Shouldn't the government or the cops or someone put a stop to that? And why is that one guy always called a \"robot\"? Does he have robotic parts, or does he just act like one? And if he is just acting, WHY?! Had these questions been answered thoroughly enough so I could tell what the hell was going on, the story would have been a lot better. I also hated the ending. It goes from this serious, sad moment to a childish \"This would make a great set piece.\" He almost had a character arc there, because he was actually being serious for once, but he just reverted right back to being ridiculous. This ending could have been an emotional, impactful moment, but instead it was rendered meaningless and silly. The Gods Will Not Be Chained - 3 starsI love the whole \"AI taking over the world\" apocalypse, and the concept of this one really reminded me of Joss Whedon's Dollhouse show, which is a definite plus. Basically, certain human's are being downloaded into computer programs, making them more powerful than the human mind or a simple computer program can ever hope to be on its own. Then, of course, it is hinted that these new AI people will take over the world, \"will not be chained,\" by their human masters. However, I didn't so much like the execution of this story. The whole thing is just really info-dumpy. Even worse, the info-dumps (and dialogue, which are really the same thing) were bogged down in incomprehensible computer jargon. If you are literate in computer programmer terminology, this may not be a problem. But to me it was so much gibberish. So there were entire chunks of this story that I didn't really understand. This just seemed really unnecessary, considering the fact not all your readers will have PhD's in computer programming, sir. So you can cut the pomposity and just tell the damn story, thank you kindly. Wedding Day - 2 starsThis one marks the first of many incoming comet stories. It also wasn't very good. I think it was supposed to be heartbreaking and bittersweet, as the characters were finally getting their long awaited wedding as the comet was beginning to hit. However, the characters and their relationship were so cheesy and artificial that I just didn't care. In fact, I think I actually laughed out loud more than once at their interactions. They were always drinking wine together and looking deep into the other's eyes and touching each other's faces gently and UGH. They weren't given deep or unique individual characterizations outside of their relationship, and the actual relationship was just so cliché that the whole thing felt fake. So instead of being heartbreaking, this story just felt contrived and generic.Removal Order - 2 starsI don't know. This one seemed somehow…pointless. A good 3/4ths of it was just the main character taking care of her grandmother (with some unnecessarily detailed descriptions of bed sores and groin washing that I could have done without). Then the grandma is killed, and Nayima just kinda shrugs and moves on. I mean, she was definitely sad about it, but she wasn't as affected by it as she should have been. She didn't rant, rave, feel lost, or reconsider what to do with her life. She wasn't even mad at the guy who killed her. She just immediately packed up the car and left without actively showing she was affected by, you know, the fact someone just shot her grandma in the face. Well, and the grandma was basically dying anyway. Her death would have been a little more meaningful (from a storytelling perspective. I'm not saying the death of a person is ever meaningless or unimportant) if she had perhaps been making a recovery, so her loss would have been more impactful. Thus, very little mattered in the end. The grandmother would have died anyway, and the granddaughter wasn't affected in any meaningful way by her death. So what was the point of this whole farce? System Reset - 5 starsFINALLY! At last, we get a good story after a long stream of crap. The characters were actually likeable and felt like real people, and the story was intelligent, intriguing, and relevant. I mean, I've seen the \"EMP wiping out all technology\" apocalypse done many times before, and this story could perhaps be called simple, as it didn't really add anything new to this concept. But I really have no concrete complaints and was so grateful for the relief of a decent story that I don't even care. Five stars for you, System Reset!This Unkempt World is Falling to Pieces - 4 stars\tI loved how this one was a steampunk apocalypse, which is something I don't see too often, and I thought the world-building was well done, if a little simple. But I actually kind of appreciated that. I've seen many steampunk worlds overdo the world-building to the point where it just feels absurd, so the simplicity of this one made it more believable and genuine. Liked the characters. Liked the plot. Again, I guess these elements are also somewhat simple, but the story was amusing, unique, and got the job done. It was the second comet-apocalypse, but I wasn't tired of it yet, so overall, a good little story.Bring Her to Me - 5 starsThis is the first in the anthology that I can say I truly loved. The apocalypse was very unique and intelligent. Some years ago, God's voice began speaking to everyone in their minds, and instructed them that on a certain day they should all eat poisoned meat and ascend to join him. One girl, however, has never heard his voice, and everyone around her is told the same cryptic message: \"Bring her to me.\" There are so many interesting questions raised in this one. Like, is it really God speaking to everyone, or is it something else? Why can't Pea hear this voice? What does it mean, \"Bring her to me\"? As in, physically? As in, kill her? GAH, I WANT TO KNOW! I really hope this story is continued in the later anthologies, because it had excellent characters, an intelligent plot, and a very intriguing apocalypse. And I really need to know what happens next!In the Air - 3 starsThis was my first Hugh Howey (I have Wool sitting in my pile, but haven't read it yet), so I'm sad this one felt so meh. It was certainly well-written, but I had some problems with the unanswered questions. Okay, so the government has been filling everyone with nanobots, and now they have decided to use these to kill all their citizens but a privileged few. But, um, why? How does it benefit them that all their citizens are dead? Is this some kind of insane power play, so they can be kings of the wreckage? But without people to govern, you really wouldn't have power at all. I can walk into an empty room and proclaim \"I AM QUEEN HERE!\" But that really doesn't mean shit, does it? Queen of what? Nothing. The answer is nothing. And is the rest of the world on board with this? Do they even know? If not, won't they be like \"Um. America now consists of like 100 (or however many) people\" and either take over, kill the madmen who did this, or both? Or did the U.S. government take out everyone else in the world too? In which case, again, they have made themselves kings over a whole lot of nothing. I have a feeling Howey will probably write stories for the next anthologies, since, you know, he is also the co-editor, so maybe these things will be answered later on. But these stories are supposed to be standalone, so it is shitty that this was left with so many murky motivations and loose threads.Goodnight Moon - 4 starsThis one was very sweet and heartbreaking. I cared about all the characters, so I was genuinely sad when death was fast approaching for them. The ending made me tear up a little, which is always a sign you have succeeded in making me care. The loss of a star is just that the plot was a little simple besides the emotional characterization and, by this point, I'm starting to get a little weary of the comet-apocalypse. But still a decent story for all that.Dancing with Death in the Land of Nod - 5 starsLoved it. Again, loved that it had a unique virus rather than just a generic people-are-dying one. Here, people become paralyzed and cannot move unless someone initiates the action. The onset of the disease begins with a seizure, one which begins in the neck and makes its victim nod uncontrollably. Combine this to genuine characters and a sweet/sad plot, and you have yourself an excellent story.Houses without Air - 5 starsI thought this apocalypse was particularly creepy. It is scary to think of a world where we are quickly running out of oxygen. I thought the world-building and characterizations were especially good, and the little \"Houses\" they burned as a monument to our dying world was a very emotional ending. My only question is whether they actually burned their little Houses or not. They put lit matches in all of them, but it kept saying they guttered out. Some of the Houses even had water in the bottom, so those couldn't have burned. Was this just a symbolic gesture, then, or did the Houses really burn? Not knowing didn't detract from my love of this story, just makes me curious. Overall, though, a very good story.The Fifth Day of Deer Camp - 3 starsI thought this one was well-written and the characters were fleshed-out and likeable, but…I don't know…I'm just not a fan of the whole \"rednecks see a UFO, oh my God!\" plot. I mean, I like spaceships and aliens and smart science fiction, but the whole \"flying saucer\" thing seems like a really cliché alien invasion. It felt like something you would read in a tabloid magazine. I don't know. I just find legit flying saucers to be predictable, simple, and cliché. Just wasn't my thing.Enjoy the Moment - 3 starsBy this point, the incoming comet apocalypse is starting to be really frustrating. And I really didn't like the main character. She was jealous and far too concerned with becoming famous. I think that was the point, but those just aren't goals that I understand of sympathize with, especially when she lets these things rule her life. I was also super annoyed that everyone was blaming her in the end. I mean, she is the one whose actions led to finding out there was an approaching comet that would fuck Earth up, but it would still have been coming whether she discovered it or not. She just helped give everyone warning; she didn't make the comet's trajectory come so close to Earth. So everyone needed to calm the hell down. Overall, just a mediocre story. Pretty Soon the Four Horsemen are Going to come Riding Through - 4 starsAnother unique apocalypse. It wasn't a particularly exciting or climactic one, but it makes you think. What if part of the population was suddenly being born super passive and incapable of violence? I can't decide which is the scarier future, one where these peaceful beings are abused and persecuted or one where everyone has become passive and non-violent (I mean, we wouldn't exactly be \"human\" anymore without our inherent violence, would we? It would become some sort of everyone-is-overly-friendly universe.) Either way, Earth wouldn't be the same. The characters, again, were also likeable and felt real.Spores - 5 starsYou know, there are only a handful of things that well and truly freak me out. Fungus, in all its various forms, is one of them. Fucking fungus. So a fungus-apocalypse is just about the scariest thing I can think of, especially when it is a fungus that is resistant to bleach and anti-fungals and poisons. A fungus that is highly contagious and spreads quickly. A story that can freak me the eff out this much (I still feel like washing my hands compulsively) is a 5 star, especially when combined with good characters and plot.She's got a Ticket to Ride - 4 starsA decent enough story. I liked how the \"cult\" was actually shown to be a rational, science-believing organization. The main character (and I) went in expecting a bunch of religious zealots, but found a normal, intelligent girl in her right mind. However, I didn't really fall in love with any of the characters, even though they were likeable enough to get the job done, and yet again we get another damn comet apocalypse. These weren't terrible flaws, but they warrant the loss of a star.Agent Unknown - 3 starsMeh. This one was just your typical zombie apocalypse. I mean, I like zombie apocalypse stories, but the plot of this one was your basic \"What is this new virus? Shit, it's zombies!\" with almost no innovation or anything to make it stand out from the hundred thousand \"Shit, it's zombies!\" stories out there. I will give it props for the whole \"incubation period is 20 years\" thing. It is creepy to think about not knowing who is infected and who isn't, as the symptoms don't show up until it is too late. I feel, though, it would have been better served in the End is Now anthology where we could have seen the quarantine camps and felt the heighted paranoia. In this story, it is just an interesting concept only dealt with in passing. And none of the characters were deep enough to carry the story. Not that they were unlikeable, but they were just bland enough that I didn't really care.Enlightenment - 1 starNot good. My main problem is that the narrator bought into cannibalism WAY too easily. I understand she was going through some shit, but she shouldn't have bought into it so fucking fast. Some dude feeds her his arm, and she (rightly) flips shit and runs out. But then, a short time later, she feels guilty about ditching his dinner party and being rude. Um, no. He effing fed you his arm. Your response was justified. Then she begins to believe his BS and starts eating herself. She thinks it isn't so bad because she isn't eating anyone else, but it is still human flesh, which is always a no no. And she was vegan. If she thinks eating animal flesh is wrong, she should have a qualm or two about eating fucking people, no matter whose flesh it is. The speed and ease with which she bought into this bullshit is just unbelievable. And what the hell kind of apocalypse is this going to be, anyway? Are you telling me the entire planet is going to buy into becoming cannibals? I very much doubt that. This whole story just rubbed me the wrong way.Shooting the Apocalypse - 5 starsAs always, Paolo Bacigalupi is amazing. I thought it was particularly clever to create a world where Texans are constantly looked down on for border crossing, as they are usually the ones dealing with that in reality, so it was kinda funny seeing that turned on its head. It was also rather scary seeing a world dying from drought; reading about it made me extremely thirsty. Good characters, good plot. It's Bacigalupi, so I didn't really expect any different.Love Perverts - 1 starIt's rather sad that the anthology ended on such an unsatisfying story. I wish this one and Bacigalupi's had been switched, so my last impression could have been a higher one. Anyway, my main problem with this one was the protagonist, who was both annoying and moderately psychotic. He was always bragging about being in physics and knowing when to use whom and the fact he reads Faulkner and so on. Yeah, you're such a hotshot. Simmer down. But, even worse, he was constantly fantasizing about drowning puppies (and people), peeling the skin off of people, and he would get erections when people died. Literally. Those are all literal examples. I think the author was trying to make him seem like the \"young man angry at the world\" type, but instead created a character I'm pretty sure would have grown into a serial killer had he been given more time. Also, this was yet another comet apocalypse, which I was beyond tired of at this point. I actually rather liked the ending of this story, but it didn't make up for the fact the main character was just so effing weird and unlikeable. (hide spoiler)]"}, {"userName": "Laura", "userReviewDate": "Mar 18, 2014", "userURL": "http://www.goodreads.com/user/show/1381519-laura", "userReview": "this is a great collection of short pre-apocalyptic stories, and i love the concept of the triptych. there were a small number toward the end that didn't appeal to me personally, but i could easily see them appeal to others. overall this collection is well curated and the breadth of end-of-the-world topics is impressive. like, really impressive. these aren't really spoilers, but some plot lines are vaguely outlined within these individual reviews so if you don't want to know anything stop reading now. individual story reviews follow so I remember which authors I want to read more from:'The Balm and the Wound' by Robin Wasserman - What happens when a doomsday conman is actually right? This story happens. I dig Wasserman's writing style.'Heaven is a Place on Planet X' by Desirina Boskovich - An alien invasion with a twist. Aliens that no one has ever seen promise to carry all of humankind away in a paradise as long as they continue to go about their normal daily lives until the set date of the event, with enforcement by a select group of other humans.'Break! Break! Break!' by Charlie Jane Anders - This may be the most unexpected story in this collection (in a good way). It follows a kid whose main interest in life is to be a stuntman, and leads up to what is likely the ignition point of civil war within the context of a world war. 'The Gods Will Not be Chained' by Ken Liu - I see a lot of potential in the continuation of this ghosts-in-the-machine type story. In a lot of cases I feel the lead up to the apocalypse is the most interesting part of the story, but with this it did a good job pulling me in but leaves me feeling like the best is still yet to come. Really hope this is one that continues.'Wedding Day' by Jake Kerr - An asteroid hitting the earth is the backdrop for this heartbreaking/heartwarming story about the engagement and love between two women and their quest for a meaningful wedding. 'Removal Order' by Tananarive Due - The larger story here is about an outbreak but mostly this story is about a sense of duty and connection to a place. I look forward to what comes next.'System Reset' by Tobias S. Buckell - The events leading up to the failure of the power grid, but also a surprising rich history between two friends within the framework of a short story. Another that I feel will be a solid story to follow if it does continue.'This Unkempt World is Falling to Pieces' by Jamie Ford - A story set 1910, about a pass of Halley's Comet. So good!'Bring Her to Me' by Ben H. Winters - Possibly my favorite? I'm most anticipating the continuation of this. Set in a world where everyone hears the voice of God(?) one girl doesn't. On the eve of a mass suicide that is supposed to transfer everyone to heaven(?) she, her mom, and her dad all separately struggle with what to do.'In the Air' by Hugh Howey - Prequel to 'Wool' as told from outside the Silos. Yes. So much yes.'Goodnight Moon' by Annie Bellet - Whoa, this one was emotional for me. I totally cried on the subway. The writing itself wasn't my favorite at first, but this is a really beautiful story about a group of astronauts facing death, set on the moon.'Dancing with Death in the Land of Nod' by Will McIntosh - Another tearjerker. Another outbreak. Very unique and touching. 'Houses without Air' by Megan Arkenberg - Breathable air is almost gone. Kind of parallels 'The Little Matchgirl'. It didn't manage to quite grab me, but I can easily see it pulling someone else in.'The Fifth Day of Deer Camp' by Scott Sigler - I think this is the most straightforward, familiar story in this collection and also my least favorite. It's about a group of guys playing poker and drinking in the middle of nowhere during the beginning of an alien invasion. There's potential for an interesting twist if this story continues, but as a standalone story it didn't do much for me. 'Enjoy the Moment' by Jack McDevitt - A story about ambition and the desire to leave a mark. In this case, the person is inadvertently tied to the end of the world. Another that was not my personal favorite, but also not bad. 'Pretty Soon the Four Horsemen are Going to Come Riding Through' by Nancy Kress - So good! I really enjoyed this one. It's about delayed evolution, triggered by an event mistakenly delayed, as figured out by a poor, single mother trying to give her girls the best life possible. One of her daughters is affected, the other is not.'Spores' by Seanan McGuire - Super haunting. Really good. A story of a woman with severe OCD that oversees a bioengineering program, the tension between her and her colleagues, and the affects it all has on her wife and daughter.'She's Got a Ticket to Ride' by Jonathan Maberry - About a doomsday cult, but also about what's most important when the world dies. Didn't love it, didn't hate it, and feels wrapped up at the end.'Agent Unknown' by David Wellington - Zombie outbreak with a scientific emphasis. Long incubation period is really intriguing.'Enlightenment' by Matthew Mather - I can't say I really \"enjoyed\" this one, but it was captivating and held my interest. It's another cult one, with a disturbing twist.'Shooting the Apocalypse' by Paolo Bacigalupi - Bacigalupi is hit or miss with me and this one was a miss. This story exists within his world of extreme drought, which is just not that interesting to me personally. Not bad writing, just not for me.'Love Perverts' by Sarah Langan - This story examines what really makes a family in the face of known disaster there has been some time to prepare for, and while it didn't draw me in at the beginning, it had me by the end."}, {"userName": "Captain Doomsday", "userReviewDate": "Feb 23, 2014", "userURL": "http://www.goodreads.com/user/show/25572985-captain-doomsday", "userReview": "Please note that this review is a modified version from my blog After The Last Day.The End Is Nigh is an anthology of short stories by some very talented writers, edited by anthology guru John Joseph Adams and independent author Hugh Howey (of Wool fame - which I'll hopefully get around to recommending one day). Here's the full list of writers :Robin Wasserman, Desirina Boskovich, Charlie Jane Anders, Ken Liu, Jake Kerr, Tananarive Due, Tobias S. Buckell, Jamie Ford, Ben H. Winters, Hugh Howey himself, Annie Bellet, Will McIntosh, Megan Arkenberg, Scott Sigler, Jack McDevitt, Nancy Kress, Seanan McGuire, Jonathan Maberry, David Wellington, Matthew Mather, Paolo Bacigalupi, and Sarah Langan.You might recognise some of the names in that list and you might not, but I can almost guarantee that you'll be looking out for more of these contributors' work in the future.What’s so great about it?I don't, as a rule, like anthologies. Often there are a handful of great stories sown amongst a sea of unreadable ones. I've never read an entire anthology through from cover to cover.Until now. John Joseph Adams has done something grand, putting these stories together. The quality of contributors is amazing and the works themselves complement each other nicely. Some of the stories stand out from the rest, of course, and some fall flat (and some I didn't enjoy) but every single one is well-written and thought provoking, which is exactly the way apocalyptic fiction should be. Nearly all of them break your heart at some point, in ways that you just don't see coming.Some of the standout contributions in The End Is Nigh (in my opinion) include a girl trying to keep her grandmother alive in an evacuation zone in Removal Order, a couple of bounty hunters trying to foil a plan to take the world back to the dark ages in System Reset, scientists facing death on the moon in Goodnight Moon, and a con-man preacher who accurately (and accidentally) predicts the End of the World in The Balm and the Wound. By no means am I suggesting they're the only standouts - just the few I have time to name without going into detail about all the entries.I'll have to let you discover the rest for yourself. There's comedy, drama, and darkness here, sometimes all in the one story, and there's a lot of variety to the End of the World.What’s not great about it?If I had to nitpick, I'd have to say it would be great to have an End of the World anthology devoid of religion. I know I'm never going to get that (I can still dream) but it would be nice. I'm also not crazy on the current trend of gay relationships in literature - not because of any homophobia but because I dislike the way its used as a 'twist' to the story.Recommended by Captain DoomsdayNot all of the entries to this anthology hit the mark dead-on. But every single one of them gets you to invest in the story in the short time they have to capture your interest. Every single one of them will resonate and stay with you. If this is just the beginning of the End of the World, then I for one can't wait until it's coming down around us. Bring on the next book and soon! I want more!There's a lot of talent to discover in this anthology, and a lot of talent that put it together. Some unique doomsday scenarios will make you think and some breathtaking moments will keep you turning the pages."}, {"userName": "Geoffrey", "userReviewDate": "Mar 21, 2014", "userURL": "http://www.goodreads.com/user/show/3171383-geoffrey", "userReview": "The End is Nigh edited by John Joseph Adams and Hugh HoweyPublished by Broad Reach Publishing, March, 2014I picked this book up as my March prime selection since I’ve read various collections edited by Adams in the past and I like Howey as an author. In the end, I’m glad I did.This is a collection of short stories about the apocalypse – about many different apocalypses – about just about every conceivable type of apocalypse out there. There are religious based ones, pandemics, asteroids, nuclear wars, aliens, The Singularity, and everything else out there. This book is the first in a trilogy – or a triptych – in which book one is set before the apocalypse, book two during and the final book in the aftermath. Most authors committed to three short stories comprising an overall story arc across the three books. So, then there are continuing stories to look forward to across the three books. What I like about this collection is these aren’t the usual stories but are often skewed versions of the stories one would expect. For example, “HEAVEN IS A PLACE ON PLANET X” by Desirina Boskovich is a story set in a world where humans wait to be teleported en masse to a far of heavenly planet by benevolent aliens before they destroy the earth. There all dreams will be fulfilled. Until then, no one is allowed to change their lives or behaviors in any way as they wait for the clock to count down – or they will be instantly vaporized.“IN THE AIR” by Hugh Howey is a story of the world when the government decides it’s time to activate the nanotech seeded in most everyone on the planet to instantly win a war that hasn’t been declared yet.“PRETTY SOON THE FOUR HORSEMEN ARE GOING TO COME RIDING THROUGH” by Nancy Kress addresses the next level of human evolution and how it first appears in today’s elementary school children.\"SPORES\" by Seanan McGuire is the story of genetically modified fruit rushed to market.The authors are a mix of new, upcoming authors and established ones. The stories themselves were all highly entertaining and not the usual mix of decent stories with one or two really good ones that are often found in a short story anthology. Instead, these are all really good stories with a few fantastic ones in the mix. I thoroughly enjoyed this book and I will be reading the next two books as they are released."}, {"userName": "Lea", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/3397530-lea", "userReview": "Uniformly wonderful anthology of stories dealing with the time shortly before the apocalypse. Each author tackles the subject with his or her own unique vision -- if you'd told me there would be so many different ways to envision the world ending, I'm not sure I would have believed you. Every single story is good, although some resonated with me more than others. \"Wedding Day\" by Jake Kerr is a favorite for personal reasons -- I'm married to the author. That in no way takes away from the praise I'll be heaping on it, though -- it's a moving look at personal connection in times of chaos, as well as an exploration of how prejudice (especially the institutionalized kind) genuinely harms people. This one brings me to tears every time I read it.I found \"Love Perverts\" by Sarah Langan and \"Spores\" by Seanan McGuire genuinely frightening -- Langan's story was disturbing due to the all too real sense of chaos and despair pervading it, while McGuire's protagonist is so fully realized that I couldn't help but panic with her as she sees the end coming. I could really rave about nearly every story -- the ones that I didn't like (very few) weren't lacking in any way, they're well written and interesting, they just didn't really move me as much as the others did.I believe some of these stories will be continued in the next book in this series, The End is Now -- I'm hoping to see what happens next in these various worlds.Highly recommend!"}, {"userName": "Michael Adams", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/14903006-michael-adams", "userReview": "Creepy tale of a an ancient form of decay made pestilential by modern scientific means."}, {"userName": "David", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/8455312-david", "userReview": "Uneven (as is common for collections.)I think I might have given it 5 stars if we weren't living in such a dark timeline right now. The ones that were about disease, war, and general uprising by the masses were a little on the nose to be truly enjoyable.The creeping moss and astroids were good fun though.Probably will tune in to the next one too...but not for a while."}, {"userName": "Traci Loudin", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/4851555-traci-loudin", "userReview": "[I wouldn't be 100% sure it was an apocalyptic ending... (hide spoiler)]"}, {"userName": "Bryan Alexander", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/679134-bryan-alexander", "userReview": "Why does the end of the world appeal to us so strongly? It may be the sheer aesthetic jolt of wiping away civilization, or the schadenfreude of witnessing the suffering and defeat of those you despise (cf Tertullian). There's a Robinson Crusoe adventure aspect, too, where we envision how we'd fare in extreme circumstances. And the politics of seeing a hated order collapse.The The End Is Nigh anthology takes us up to that spectacular point, then pauses. Stories begin in our world or a related one, then push on to the brink. This is intentional, since Adams' collection is the first of three such books, The Apocalypse Triptych. The second one will uncover the world's end, while the third sends postcards from the aftermath.Overall the collection successfully provides what it promises. Each story imagines a different catastrophe, offering a nice variety of perspectives, themes, problems, and characters. Most fall into the hybrid disaster-sf genre, although several push the boundaries into horror, satire, and even comedy. They kill the world through a variety of methods: asteroid, nuclear missiles, disease, hacking, alien invasion, and (thankfully, only once) zombies.Naturally, some of the stories are more effective than others:\"Enjoy the Moment\" (Jack McDevitt) (nicely podcasted by Escape Pod) is a hard science/sociology of science miniature about a scientist desperate to make her mark, and succeeding all too well. \"The Balm and the Wound\" (Robin Wasserman) bases itself on the experience of an end-of-the-world con artist, and works well both as satire and character journey. The guy spends his life predicting sham apocalypses, and for once gets it right.\"Removal Order\" (Tananarive Due) is one of the most affecting stories, following a young woman as she tried to simultaneously cope with a family member's impending death by cancer and the megadeath by plague growing around her. That micro-macro balance worked very well. “Dancing with Death in the Land of Nod” (Will McIntosh) succeeds along similar lines, paralleling a young man's struggle to help his father die with dignity with the rapid onslaught of a plague. Both of these stories confront physical disgust and emotional despair convincingly.“Spores” (Seanan McGuire) has a strong horror flavor, courtesy of William Hope Hodgson. A vicious mold starts to end civilization, seen from the point of view of a medical worker and her family. Touches of body horror are strong here.“Pretty Soon the Four Horsemen are Going to Come Riding Through” (Nancy Kress) gives us the point of view of a poor woman - unusual in modern American fiction, and welcome. In dealing with her two childrens' issues at school, she stumbles upon a transformation just starting to alter humanity.By the end of The End I confess to becoming jaded. My emotional engagement with characters had dropped, and I became more of a catastrophe connoisseur, calmly assessing each doom's merits and formal characteristics. Other reviewers (for example) had the opposite experience of being overwhelmed by cumulative grief. Perhaps my graduate research into British Romantic stories of doom has jaded me, or living with a doomsday prepper wife has accustomed me to thoughts of collapse, or my current politics are too grim, or I'm simply warped (probably all four in combination). But I agree with the sadder reviewers that you might not want to read all of Nigh at once, in order to get a better experience from each tale.I recommend it, and have hopes for the next volume."}, {"userName": "Timothy Pecoraro", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/7842027-timothy-pecoraro", "userReview": "Just didn't hold my interest, can't remember when I stopped reading this but it was quite a while ago. It makes a great start but doesn't deliver, at least it didn't for me."}, {"userName": "Aaron Bellamy", "userReviewDate": "Feb 03, 2015", "userURL": "http://www.goodreads.com/user/show/35580990-aaron-bellamy", "userReview": "As far as collections go, the End is Nigh is one of the better non-best-of-year ones that I’ve read. The stories are consistently good, with no outright fails, and many that stand out as exceptional. Conceptually, the Apocalypse Triptych, of which the End is Nigh is volume one, is ingenious. I especially liked the promise that several of the authors would have stories in the other two volumes, detailing the ‘during’ and ‘after’ timelines. However, this backfired somewhat… though not abysmally so, but at times I was indeed bothered. I haven’t read the others in the triptych yet (and I do plan to) but several of the stories here have such a clear lack of resolution that they feel incomplete. I have no problem with a good Flash Gorden-esque cliffhanger, and some go that route, but others just kind of stop, as if a longer story had been divided into three volumes. I feel nitpicky pointing this out, but I think it’s important to acknowledge. In the long run, I may double back and decide that, in fact, judging the triptych as a whole, this turned out to be very effective, but as a single volume, some of the stories are simply incomplete. To end on a positive note, I wanted to highlight some of the stories I enjoyed the most. ‘Shooting the Apocalypse’ by Paolo Bacigalupi has an impressive style, creepy but tangible, and a setting simultaneously unique and familiar. ‘Love Perverts’ is definitely perverted, and I hope Sarah Langan has another story in the next volume, she must! ‘The Fifth Day of Deer Camp’ by Scott Sigler is absolutely a day time read, unless you plan on waiting out the night armed by a boarded up window. And ‘BRING HER TO ME’ by Ben H. Winters covers territory I haven’t ever read before, and I hope and expect to see more of him later in the triptych as well. All said and done, this is a good solid start to a great idea. John Joseph Adams and Hugh Howey did not let me down."}, {"userName": "Emily", "userReviewDate": "Jan 07, 2015", "userURL": "http://www.goodreads.com/user/show/11168164-emily", "userReview": "Wow! This was a great idea for an anthology. I love reading short stories, but with the best of them, there's always that moment where you ask, \"But then what?\" Here there's some hope of an answer as several of the contributors agreed to write two more related stories, so the books are pre-apocalypse, mid-apocalypse, and post-apocalypse. I'd already read short stories from most of the writers having read several of John Joseph Adams' other anthologies, and I was pleased with the overall quality of the submissions. That's not to say there were a few I didn't like (go home Jamie Ford), but mostly they were fantastic, and when I finished this one, I immediately picked up The End is Now.As to the stories in this one, I loved Seanan McGuire's \"Spores,\" notable since I'm just tolerating Symbiont. Being a Texan from Wichita Falls (current lake levels 22.1%, catastrophic drought), Paolo Bacigalupi's \"Shooting the Apocalypse\" was terrifying for me. Tananarive Due's \"Removal Order\" was excellent, and her follow-up story in the next book is even better. I liked the creepiness of Ben H. Winters' \"BRING HER TO ME\", and thought that Annie Bellet's \"Goodnight Moon\" and Sarah Langan's \"Lover Perverts\" were fantastic.If you're into apocalyptic stories, I can't recommend this one highly enough. 4.5/5 rounded up, that half star is for the couple of stinkers."}, {"userName": "BigJohn", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/4845311-bigjohn", "userReview": "The End is Nigh is the first of what is called The Apocalypse Triptych - three anthologies that each cover three apocalyptic points in time - before, during, and after \"the apocalypse\" that affects the world as we know it. Some of these apocalypses (?) are modern-day; some are in the future. Thankfully, the stories tend away from zombie and robot, but there are definitely technology and medical apocalypses (is that a word?) that are portrayed.The genius of this anthological series is that the editor, John Joseph Adams, has recruited authors who contribute one story to each of the three anthologies, so they can play their hand through to the end game. Necessarily so, there are some WICKED cliffhangers in these stories.There is a great variety of authors represented in this series. Adams seems to cultivate writers like S.S. McClure, gathering talented writers and giving them exposure through his varied and plentiful anthologies. Because each story tells of its own apocalypse, the stories themselves are not connected in any way to one another - though we can expect the follow-up anthologies, \"The End is Now\" and \"The End has Come\" will continue some, if not all, of the storylines.After reading this first book, I've put in my pre-order for the next one and can hardly wait to see what happens next to these poor unfortunate suckers. I mean souls."}, {"userName": "Charles", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/9628169-charles", "userReview": "This is a neat little set of apocalypse stories. While I haven’t read the two subsequent books, my understanding is that most of these stories are continued in the later books, but they are also stand-alone stories, about the time and moments right before the end (or effective end) of the world. Some are clever, some are a bit obvious, but most are worth reading.My only caveat is that several of the stories suffer from the usual major defect of modern science fiction, since 1990 or so—monolithic, un-ironic conformity on social issues, always beating the reader over the head with whatever today’s liberal cause is. Here, naturally, it being 2014, gay characters (all of whom are wonderful heroes) abound. It being 2014, though, trans characters are lacking, and gender fluidity is not portrayed. So my conclusion is that the authors are evil bigots, and I hope they rush out stories focusing on the apocalyptic tribulations of the gender dysphoric, ASAP. And, of course, Christians are never portrayed positively; all conservative types are bad; etc. On the other hand, no story has global warming as the cause of the end of the world, so that’s something.But if you simply ignore this, which you have to do anyway every day just watching the news, you can enjoy the stories."}, {"userName": "Michelle Morrell", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/127000-michelle-morrell", "userReview": "This set of short stories makes up the first book in a planned trilogy called the Apocalypse Triptych, with the premise that most the authors of the stories in this installment, right before an apocalypse, will continue on with their stories in the second (during) and third (after). I think the idea is clever and most the stories are quite strong enough to deserve the treatment. While there are the general apocalypii of asteroids and plagues, zombies and climate change, there is always a fresh angle or approach that keeps most of the stories from treading too familiar ground. One that particularly stands out is Seanan McGuire's unsettling story about a biologically engineered mold that even bleach won't kill.I will definitely continue on with the rest of the series."}, {"userName": "Andrea McDowell", "userReviewDate": "Jul 31, 2015", "userURL": "http://www.goodreads.com/user/show/5863458-andrea-mcdowell", "userReview": "Overall it was good. The story about the self-cannibals I could have done without, but most of them were solid and a few stories were outstanding. Paolo B. was the only one who, to my mind, tackled the kind of apocalypse we're actually likely to face (climate change/permadrought). Most of the others were takes on old standards like asteroids, aliens, artificial intelligence and germs; one or two were more original (the mould one--eww). But this detracted from the stories for me: the world is already ending. In slow motion, granted, but it's pretty well here. You don't need to strain yourself coming up with some plausible way of killing everything off. Just look at Syria and go from there."}, {"userName": "Jeff", "userReviewDate": "Mar 29, 2014", "userURL": "http://www.goodreads.com/user/show/1976637-jeff", "userReview": "This is the first collection in The Apocalypse Triptych, which will consist of stories set before, during, and after the apocalypse with the same writers contributing a story in all three volumes. I liked John Joseph Adams' prior Wastelands anthology, and he added Hugh Howey of Wool fame as an editor for these three collections. I was surprised how many of the authors I was familiar with from novels I've read or short stories I've heard on fiction podcasts. A couple of the stories toward the end of the collection did not appeal to me but overall the collection was really solid. I would highly recommend to any fans of dystopian or apocalyptic fiction."}, {"userName": "I'm Booked", "userReviewDate": "Apr 07, 2014", "userURL": "http://www.goodreads.com/user/show/22298251-i-m-booked", "userReview": "4.5 starsI enjoyed almost every single story in this collection and I am very much looking forward to the continuation of these stories in the next anthology.The End is Nigh introduced me to several authors whom I was previously unaware of and I will definitely be checking out in the near future; I actually picked up The Last Policeman and read it in one sitting after I finished BRING HER TO ME.If you are a fan of apocalyptic fiction then I highly recommend this collection. If you aren't but appreciate a well crafted story then you will find more than one story in this book that is enjoyable.Bonus: You can borrow it for free if you are an Amazon Prime member."}, {"userName": "Frank", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/3141514-frank", "userReview": "Wow! This is one of the first anthologies I can remember where every story was a solid read. Usually, I find that anthologies sell copies based on a few high-list authors and the rest of the book is filled with runner-up material that is of lower (sometimes _much lower_) quality.The anthology has an additional interesting point; it's the first of three collections. This collection focuses on the setup of the apocalypse (i.e. the beginning/source) and the following two focus on the event itself and it's ending. IOW, the stories will be fleshed out in the upcoming collections. I can't wait."}, {"userName": "Emma", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/5685809-emma", "userReview": "I pinched this book from JD's to-read shelf because I'd run out of books for the first time in years. I'm glad I did because although it's not the kind of book I usually read I really enjoyed it. The stories are very different in style and plot but with a joint theme about the end of the world. Short stories are great!"}, {"userName": "Leah Polcar", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/5963463-leah-polcar", "userReview": "Must say, I expected a bit more out of this anthology given Adams was editing. This is no The Living Dead. While there are some inspired choices for contributors -- for example, Ben Winters -- none of the stories stuck out as special. Two mehs up."}], "description": "Famine. Death. War. Pestilence. These are the harbingers of the biblical apocalypse, of the End of the World. In science fiction, the end is triggered by less figurative means: nuclear holocaust, biological warfare/pandemic, ecological disaster, or cosmological cataclysm.But before any catastrophe, there are people who see it coming. During, there are heroes who fight against it. And after, there are the survivors who persevere and try to rebuild. THE APOCALYPSE TRIPTYCH will tell their stories.Edited by acclaimed anthologist John Joseph Adams and bestselling author Hugh Howey, THE APOCALYPSE TRIPTYCH is a series of three anthologies of apocalyptic fiction. THE END IS NIGH focuses on life before the apocalypse. THE END IS NOW turns its attention to life during the apocalypse. And THE END HAS COME focuses on life after the apocalypse.THE END IS NIGH features all-new, never-before-published works by Hugh Howey, Paolo Bacigalupi, Jamie Ford, Seanan McGuire, Tananarive Due, Jonathan Maberry, Robin Wasserman, Nancy Kress, Charlie Jane Anders, Ken Liu, and many others.", "title": "The End is Nigh\n      \n          (The Apocalypse Triptych #1)", "url": "https://www.goodreads.com/book/show/18870640.THE_END_IS_NIGH", "average": 3.89, "cover": "https://images.gr-assets.com/books/1392378542l/18870640.jpg", "reviews": 245, "authors": [{"url": "https://www.goodreads.com/author/show/1161372.John_Joseph_Adams", "name": "John Joseph Adams"}, {"url": "https://www.goodreads.com/author/show/3064305.Hugh_Howey", "name": "Hugh Howey"}, {"url": "https://www.goodreads.com/author/show/735413.Ben_H_Winters", "name": "Ben H. Winters"}, {"url": "https://www.goodreads.com/author/show/4606262.Annie_Bellet", "name": "Annie Bellet"}, {"url": "https://www.goodreads.com/author/show/2938554.Will_McIntosh", "name": "Will McIntosh"}, {"url": "https://www.goodreads.com/author/show/2978423.Megan_Arkenberg", "name": "Megan Arkenberg"}, {"url": "https://www.goodreads.com/author/show/114504.Scott_Sigler", "name": "Scott Sigler"}, {"url": "https://www.goodreads.com/author/show/73812.Jack_McDevitt", "name": "Jack McDevitt"}, {"url": "https://www.goodreads.com/author/show/21158.Nancy_Kress", "name": "Nancy Kress"}, {"url": "https://www.goodreads.com/author/show/2860219.Seanan_McGuire", "name": "Seanan McGuire"}, {"url": "https://www.goodreads.com/author/show/72451.Jonathan_Maberry", "name": "Jonathan Maberry"}, {"url": "https://www.goodreads.com/author/show/24827.David_Wellington", "name": "David Wellington"}, {"url": "https://www.goodreads.com/author/show/21981.Robin_Wasserman", "name": "Robin Wasserman"}, {"url": "https://www.goodreads.com/author/show/6151827.Matthew_Mather", "name": "Matthew Mather"}, {"url": "https://www.goodreads.com/author/show/1226977.Paolo_Bacigalupi", "name": "Paolo Bacigalupi"}, {"url": "https://www.goodreads.com/author/show/37182.Sarah_Langan", "name": "Sarah Langan"}, {"url": "https://www.goodreads.com/author/show/3095883.Desirina_Boskovich", "name": "Desirina Boskovich"}, {"url": "https://www.goodreads.com/author/show/4918514.Charlie_Jane_Anders", "name": "Charlie Jane Anders"}, {"url": "https://www.goodreads.com/author/show/2917920.Ken_Liu", "name": "Ken Liu"}, {"url": "https://www.goodreads.com/author/show/4648176.Jake_Kerr", "name": "Jake Kerr"}, {"url": "https://www.goodreads.com/author/show/23417.Tananarive_Due", "name": "Tananarive Due"}, {"url": "https://www.goodreads.com/author/show/107891.Tobias_S_Buckell", "name": "Tobias S. Buckell"}, {"url": "https://www.goodreads.com/author/show/1421619.Jamie_Ford", "name": "Jamie Ford"}], "type": ["Short Stories", "Science Fiction", "Apocalyptic", "Anthologies", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18870640-the-end-is-nigh", "http://www.goodreads.com/book/show/21429434-the-end-is-nigh", "http://www.goodreads.com/book/show/20898210-the-end-is-nigh", "http://www.goodreads.com/book/show/6390031-the-improbable-adventures-of-sherlock-holmes", "http://www.goodreads.com/book/show/3302568-the-living-dead", "http://www.goodreads.com/book/show/1705697.Wastelands", "http://www.goodreads.com/book/show/8305839-the-living-dead-2", "http://www.goodreads.com/book/show/8966218-brave-new-worlds", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}