{"ratings": 5241, "userreviews": [{"userName": "Robert", "userReviewDate": "May 30, 2012", "userURL": "http://www.goodreads.com/user/show/607415-robert", "userReview": "I do not want to do reviews of all the series, so I will have my say here about book 2 & 3. Don't worry, I won't post any spoilers.This week I have listened to the audio book versions of books 2 & 3 and I have to admit I am really enjoying this series. Depending on how the series turns out I may have to rethink the 4/5 stars I gave books 1, 2 and 4, and give them all a 5/5 star rating.Book 2 and its McDonalds story had me laughing my a** off and I had to pause it and regain my composure to continue. Some people, in their reviews have stated there is too much comedy attempted and failed within these pages. Like I said before, the authors sense of humor stands out in these books. But. To me it is mostly the main character's nature, a sarcastic nature that helps him to deal with all the high stress situations he is constantly in.Starting book 4 today. Can't get enough :)"}, {"userName": "Angie", "userReviewDate": "Sep 20, 2012", "userURL": "http://www.goodreads.com/user/show/10674028-angie", "userReview": "Still a great series, just read online that the rights have been sold for a series either movie or tv - hope they do it justice!!"}, {"userName": "Fangs for the Fantasy", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/5912634-fangs-for-the-fantasy", "userReview": "Pulled back from the brink of death, Michael Talbot is determined to protect his loved ones against not only the zombie plague, which has taken over the planet but the threat that Eliza, the vampire holds. Even a reinforced military base may not be enough to keep her at bay. The government may have Humvees, heavy artillery and helicopters loaded with missiles, but Eliza has an ace up her sleeve. Talbot depends on Tommy to give him the right information at the right time, but their pop tart loving guide, who hears Ryan Seacrest in his head, might not be as innocent as he seems.I cannot believe I made it through all three hundred and fifty-five pages of this novel. I am telling you right now Fangs readers, you owe me one. Michael Talbot continues to be an epic Gary Stu. Everyone around Talbot exists to constantly prop him up, and follow his lead. Even Alex and Paul, who have decided to travel in a different direction than Talbot, in order to find their families and avoid Eliza's clutches, spend their time chastising themselves for leaving Talbot, while talking about how amazing the trained marine is and alternately angsting about their disloyalty for abandoning Talbot in his hour of need. Brendan even pays for his abandonment of Talbot and the questioning of Talbot's leadership with his life. No one even bothers to try and think up any kind of plan on how to survive because they are all sure that somehow, Talbot will pull their asses out of the fire. Of course, Talbot has to get up to some practically superhuman shenanigans (that is when he isn't being saved by the family dog) but he somehow constantly manages to save everyone because that's what a man does - save his family. I spent much of the book hoping that a zombie would eat Talbot.There were quite a few female characters in this book but luckily, there really is no real need for them to be strong characters, when they can depend on Talbot. Tracy, Talbot's wife, is still alive and kicking but she never really gets into the action. Why would Michael bother to teach Tracy a practical skill like shooting a gun, when he can take his teenage sons out on missions against the zombies. Surely, a teenage boy has to be competent than an adult woman and besides, it teaches the young men that their job is to protect the womenfolk, just like dear old dad. Mike constantly acts like he is afraid of his shrewish wife but at no point does he bother to consult her for advice. Tracy exists to give Talbot something to save and is only humanized when dealing with her mother Carol, who has suddenly become frail and in need of Michael's protection, despite surviving by herself on a farm at the beginning of the apocalypse and her son Justin, who struggles to fight back against his link with Liza. Carol however does end up earning her keep, by pushing Mike's sister Lyndsey out of the kitchen. Everyone complains loudly about Lyndsey's cooking and none louder than Mike but since his job is saving the world, actually entering the kitchen and cooking for himself is inconceivable. Besides, it gives the women something to do while they are waiting to be saved.Then we have Nicole, who from the sounds of it is about six weeks pregnant. Nicole at this point is practically an invalid, who spends most of her time puking and expressing some kind of weakness. Nicole is in a sense nothing more than a walking womb but she's precious because she carries the future of the Talbot line. Nope, I couldn't make this shite up if I tried. This is par for the course because daughters are trouble - something Mike knows all to well.Rachael is 10 and she is my only daughter.” “Be thankful for that.” The doc wouldn't understand the backhanded compliment at least not for another two and a half years when his daughter turned from a sweet daddy’s little princess into a multi-headed demon from hell, as all teenage girls must. “She is without a shadow of a doubt, the strongest personality in our house. She is the most wonderfully devious of children. If there is trouble to find, she's not only in it but in it to win it.”  I had learned the hard way after punishing my own boys way too much, that my daughter not only sought out trouble but was usually the root cause of it.  “Rachael's very smart but loves to tell you that she's not (the better to get away with things). She is a mini version of her mom, entirely too cute to be as cunning as she is. She scares the hell out of me because she is going to need to be locked in a closet VERY soon.” Maybe that secret desire of all fathers to be able to lock their daughters away from testosterone infused boys could now be realized. So maybe a zombie invasion wasn’t all bad. Women in this series exist to be shrews like Tracy and Mrs. Devereaux, wild precocious teenage girls in need of taming and weak victims in need of propping up like Carol, that is when they aren't in the kitchen doing their biologically mandated job. Yes, join me in a good eye roll.Read More"}, {"userName": "Balkron", "userReviewDate": "Jan 21, 2014", "userURL": "http://www.goodreads.com/user/show/27874245-balkron", "userReview": "My Rating Scale:1 Star - Horrible book, It was so bad I stopped reading it. I have not read the whole book and wont2 Star - Bad book, I forced myself to finish it and do NOT recommend. I can't believe I read it once3 Star - Average book, Was entertaining but nothing special. No plans to ever re-read4 Star - Good Book, Was a really good book and I would recommend. I am Likely to re-read this book5 Star - GREAT book, A great story and well written. I can't wait for the next book. I Will Re-Read this one or more times.Number of times read: 1A promising series that failed to meet expectations. This is not even worth reading. Characters - The characters have become ridiculous. The first 2 books were entertaining, the remaining have been painful to read. This is the last book in the series that I intend to read.Story - Not much to say. Fart jokes, stupidity, bad planning, impossible escapes (I mean there is no way the escape used could have ever worked). Just a really bad book. If I hadn't enjoyed the first 2 books I would have never finished this book.Overall - Don't read it, don't touch it or it may infect you with stupidity."}, {"userName": "Timothy Ward", "userReviewDate": "Apr 04, 2016", "userURL": "http://www.goodreads.com/user/show/4867952-timothy-ward", "userReview": "I am afraid my interest in this series has declined with each book, though each one has managed character and plot revelation moments and enough of the humor to keep me moving on to the next installment. Some of the prose gets on my nerves, from the excessive dialogue tags with adverbs and actions to excessive time with the main character bemoaning smells and his germophobia. I bought the fourth book pretty soon after finishing this, partly because the ending was good in book three, but also because I don't have any other zombie series that I enjoy as much as this. The main character is more likable that any new series I try, even if he annoys me sometimes with his complaints about dog farts and touching dirty surfaces."}, {"userName": "Hana", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/5200387-hana", "userReview": "The haters of this series crack me up almost as much as the books do. It's hard to imagine that there are zombie snobs out there, but...I find Mike Talbot's narration of his often absurd tales of survival too much fun. I have listened to the audiobooks since book 1 and they couldn't have picked a better narrator to bring his (and all the other) characters to life.If you're looking for a deep, dark scientifically accurate zombie tale, this series is not for you. But if you want an action-packed series that has you cracking up at every turn (and far too often relating!), then you should enjoy the Zombie Fallout (so far, I have). If you can, listen to the audiobooks - it's worth it!"}, {"userName": "A. Hunt", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/14150982-a-hunt", "userReview": "Read this while in holiday, in the U.K. Review to come."}, {"userName": "Todd Menesses", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/39659881-todd-menesses", "userReview": "Can't get enough of the Talbot's and this series! Another fine addition to the collection. As always I went with the audiobook version of this one."}, {"userName": "Joe", "userReviewDate": "Feb 12, 2014", "userURL": "http://www.goodreads.com/user/show/9649644-joe", "userReview": "Don’t let the title fool you. I think the series is up to seven books, not including the third half step. Michael’s zombie saga continues. Rather than provide a summary of what happens, go back, read the first book in the series, and enjoy. The crazy thing is that as much as I think I won’t like the next addition, I always do. It’s a solid 5 stars for me, because somehow, you can’t help but fall in love with the family and root for their survival. It’s zombie with a quirky twist. Yes, you should read from the beginning. Tufo does not do the best job at creating standalone titles, and no, don’t read if you have a weak stomach. Violence? Maybe, but it’s more the gory aftermath that’s an issue for weak abdomens. Tufo never goes excessive unless it has an impact. Read it if you’re a zombie fan! You will not be disappointed, but again, start from the beginning of the series."}, {"userName": "Sara Pestell", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/4670804-sara-pestell", "userReview": "Once you get sucked into the story, you just can't put his books down, it's like reading someone's diary that you found in the attic..... from long ago.... You get so involved in the characters and when something happens its like watching a mixture between the greatest horror movie to the greatest action adventure movie ever made...except your picturing the story in your imagination, because your just so involved in the book! You are just gripping the edge of your seat and all tensed up waiting for the action/horror moment from the first page.....and they just keep coming...all the way until the end of the book! The books also brings out all your emotions, Laughter, Fear, Sadness, Happiness...... I could keep listing but then I would take forever.... I can't wait to start on book 4 to see what happens next....!!!!!!!"}, {"userName": "Gloria chavarria", "userReviewDate": "May 13, 2011", "userURL": "http://www.goodreads.com/user/show/5435914-gloria-chavarria", "userReview": "i love these books; very descriptive and emotional. i had to put it down a couple of times just take a breather, the events are so vivid. i love the final chapter, when he makes fun of the guy who found the first book and kept complaining about the grammar and misspelling. was this on purpose? lol. i'm thinking yes, considering his writing style. the first book might have some misspelled words and grammatical errors but the plot is really good and the story really does flow easily. bad spelling is different from bad writing. i cant continue a badly written book because it really interrupts from the story line like the writer is just struggling to get a point across. that is definitely not a problem here, besides u have to expect a little misspelling with self published authors. i just hope that doesn't deter anyone from reading these books, i think they will be pleasantly surprised."}, {"userName": "Richelle", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/32937334-richelle", "userReview": "I'm still listening to this series on audible & loving it ! I can't believe this one is over already.. it seemed really short!! another kick ass, HILARIOUS, zombie filled, action packed book by the one and only Mark Tufo! Book 3 was spent trying to evade Eliza.. there was some back story.. and quite a few shocking discoveries !! I didn't enjoy this one as much as book 1 and 2.. but I'm glad I did listen to it because there was a lot of vital info revealed about characters and plot... downloading book 4 right now ..I passed for not on book 3.5 because I can justify spending 10 dollars on a 2 hour book!maybe later ... on to the next..can't wait for Talbot & company's next adventure!! let's find Tommy!!"}, {"userName": "Annie", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/12534351-annie", "userReview": "LOVE THIS SERIES!!! ON TO BOOK 4...SEE FIRST LISTEN FOR REVIEW!"}, {"userName": "Diane T.", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/3957112-diane-t", "userReview": "Mark Tufo's Zombie Fallout series just keeps getting better and better. A sense of humor and a deep streak of sarcasm help keep Mike Talbot (our very relucant hero) moving. That and the fact that if he let's anything happen to one of his kids, his wife will make the zombie hordes seem like girl scouts in comparrison. If you haven't tried this series yet, you are really missing out. I read each one within a day because I have trouble putting them down. Action packed to the point that you find yourself on the edge of your seat, these tales will keep you devouring them one after the other."}, {"userName": "Annie", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/12534351-annie", "userReview": "I adore this series...Mike and his family are all awesome...this book is darker than the first 2 and some secrets are revealed...so it is a very important installment....I think it is just going to get darker from here on out...and I cant wait to listen to the next one...I love this series and if you like zombies and the end of the world books, you will too...2 thumbs up, would give it 3 if I could!! :)"}, {"userName": "Jeanne", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/8559735-jeanne", "userReview": "I can't wait to read the next in the series. This story gets better and better. Just when the reader thinks there is no way Mike could get out of the existing situation, he has some big huge luck thing happen to save him again. Always entertaining."}, {"userName": "Tippsy", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/28742307-tippsy", "userReview": "This one put me off the rest of them :( I wasn't quite in for the supernatural twist to a zombie setting, and this was a bit much for me. Might pick up the series again later, butEliza just doesn't fit in anywhere, I don't even know why she's in it..."}, {"userName": "AudioBookReviewer", "userReviewDate": "May 10, 2012", "userURL": "http://www.goodreads.com/user/show/7365795-audiobookreviewer", "userReview": "Please find my review here: http://audiobookreviewer.com/Audioboo..."}, {"userName": "Trish  Franks", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/42140077-trish-franks", "userReview": "New favorite authorStarted with a free download with book 1. Now I can't stop reading. Love these books! On to book #4!!!"}, {"userName": "Kate", "userReviewDate": "Feb 29, 2012", "userURL": "http://www.goodreads.com/user/show/6496897-kate", "userReview": "good book, would definitly recommend , but read them in order, the continuity would be awkward if you didn't"}, {"userName": "Krish", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/10105562-krish", "userReview": "I laughed so hard, if I had been drinking a soda, it would have come out my nose"}, {"userName": "Megan", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/50356618-megan", "userReview": "And The Hits Keep Coming alla Michael Talbot Style!Book 3 was a worthy addition to the ongoing Fallout series. Ha, when i told my husband the name of the series, he asked, \"We're the zombies falling out of the sky?\" Somehow i think Mike would appreciate that bit. Tufo - you know what you are doing, please never stop cranking them out. I'm not sure you can stop with a character like Talbot in your head 24/7.For fans - don't hesitate. Pick up book 1 of the series and hang on. Incredibly readable, enjoyable, cringe worthy... you'll laugh, cry, grip the sis atm, laugh twice as hard, shot coffee out your nose and feel guilty about it, well, you get it. Now I'm getting on to ZF 4. Can't keep Mike, Gary, Tommy, BT, Tracy, Coley, and the whole gaggle waiting..."}, {"userName": "Gretchen Haraldson", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/43769388-gretchen-haraldson", "userReview": "I just love this series! They books are fast and fun. One thing I can’t get over though is how unlikeable Tracy is. The biggest B out there. My guess is that the author didn’t intend to make Mike’s wife such a nag, ready to jump down anyone for even the slightest offense and that he instead thought Tracy would come off as a spunky feisty gal. I keep hoping for her demise. Makes me wonder if the author’s own wife is like Tracy."}, {"userName": "Sherron Capitano", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/43117873-sherron-capitano", "userReview": "I'm Completely Hooked on this Series I have read these first few books in just 2 days. I am hooked. Character development is superb! I am in love with Talbot and his family and can't get enough of their story. I highly recommend this series to anyone who is a fan of this genre. I am purchasing the next book in the series as soon as I hit submit on this review!"}, {"userName": "Ruth Fabiano", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/6053115-ruth-fabiano", "userReview": "i understand being attached to Tommy, but my god, thousands have died at this point for him. why the absolute man crush? amso wayyyy too much vomiting. also i find it hard to believe almost every thing that happens spares Mike and his family. Also, i agree with the other reviewers....no likable females."}, {"userName": "Deborah", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/10069865-deborah", "userReview": "Once again Mike kept me entertained with his witticisms. This series has been more fun. I loved that we got to see where Paul and Alex are before the end of the book. I’m looking forward to the next one!!!"}, {"userName": "w1ndsor", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/10101439-w1ndsor", "userReview": "I think adding a vampire was a mistake."}, {"userName": "Jessica Pratt", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/35565205-jessica-pratt", "userReview": "The entire series so far has been great. I laugh out loud so many times. The twist to the normal zombie novel in #2 was really nice to see."}, {"userName": "William", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/62104280-william", "userReview": "I enjoy the talbit story but i don't care for the prologues nor the switching between first person diary entries and 3rd person other characters."}, {"userName": "Donna Mensing", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/49716158-donna-mensing", "userReview": "This is a hard book to read...sometimes it's gruesome and hard to continue, but at the same time it's so good it's hard to put down!"}], "description": "Continues Michael Talbot's quest to be rid of the evil named Eliza that hunts him and his family across the country. As the world spirals even further down into the abyss of apocalypse one man struggles to keep those around him safe.Side by side Michael stands with his wife, their children, his friends and the wonder Bulldog along with the Wal-Mart greeter Tommy who is infinitely more than he appears and whether he is leading them to salvation or death is only a measure of degrees.", "title": "The End\n      \n          (Zombie Fallout #3)", "url": "https://www.goodreads.com/book/show/21624668-the-end", "average": 4.32, "cover": "https://images.gr-assets.com/books/1412292508l/21624668.jpg", "reviews": 195, "authors": [{"url": "https://www.goodreads.com/author/show/2990843.Mark_Tufo", "name": "Mark Tufo"}], "type": ["Horror", "Horror", "Apocalyptic", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/21624668-the-end", "http://www.goodreads.com/book/show/13587397-the-end", "http://www.goodreads.com/book/show/10867262-the-end", "http://www.goodreads.com/book/show/15760119-the-end", "http://www.goodreads.com/book/show/8167001-zombie-fallout", "http://www.goodreads.com/book/show/15756383-a-plague-upon-your-family", "http://www.goodreads.com/book/show/12855784-the-end-has-come-and-gone", "http://www.goodreads.com/book/show/13506310-alive-in-a-dead-world", "http://www.goodreads.com/book/show/15742853-till-death-do-us-part"]}