{"ratings": 3774, "userreviews": [{"userName": "mark monday", "userReviewDate": "Apr 28, 2012", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "[as the novel progresses, the reader comes to understand that the beings on this surprisingly verdant future-earth are aliens who have inherited human bodies. the humans themselves have left, or at least their consciousness have transcended to some great beyond, leaving their bodies and all of their works behind. these new humans must wrestle with genetics and the need to breed viable children, their original 3-gender existence, the human legacy itself - running the gamut from myths to music to old hollywood films to radiation - both positive and negative in impact, and their own mysterious potential. things are changing on this farflung earth: strange new abilities are developing and radically new ways of living must be learned; true understanding of their own natures must take place for progression to happen. (hide spoiler)]"}, {"userName": "Forrest", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/811928-forrest", "userReview": "I would be a liar if I said I could map out the plot to this novel in any kind of linear fashion. One read through is definitely not enough. So, is it even permissible to give the book my highest rating when I cannot, admittedly, lay the plot out in a plain diagram for you?Oh, heck yes!This book will play tricks with your mind, no doubt. But if you enjoy strange dreams that hold their own internal logic - unexplainable in the waking world, but somehow making perfect sense to your sleeping self - you might just love this novella. When I finished it, I felt like I had just woken up from a very deep, sad, meaningful dream, still slightly intoxicated and a bit confused.I even struggle to clearly outline who or what the main antagonist, Kid Death, is. I seriously considered the following options as I read . . .1. Alternate personality of Lobey, the main character2. Computer generated \"being\" enabled by ancient humans3. Supernatural being4. Result of bad head wound to Lobey. . . and concluded that none of them were correct, though each of them could have been. And this seems to be at the heart of what Delany has written here: A Godelian \"possibility space\" that cannot be deciphered from within, but must be understood on an intuitive, subconscious level by the reader, who is completely outside of the character's possibility space. The reader is, in essence, the \"Einstein Intersection,\" encompassing the possible limits of what the characters, plot, and setting fundamentally are because she or he is beyond the limits of the internal understanding of those in the book. Though this can be the case for just about any book, Delany is particularly deft at getting the reader \"into\" the book and world, through the use of bread crumbs strung along to pull the reader \"out\" of their own metafictional reality, convincing the reader that she or he can understand the book's world on its own terms. Again, though, the reader, being a real human being, is, in reality, above all that and is capable of objectifying the text as a piece of fiction. This doesn't mean that the reader will or can fully understand what is \"going on,\" because that would imply that the reader fully encompasses what is in Samuel R. Delany's head. Rather, reading the novel is a lot like having a conversation with a native speaker of a foreign language that one is in the early stages of learning: The reader \"understands\" some of the vocabulary and the easier stretches of grammar, without knowing the nuances of the language and, most importantly, without knowing what the speaker is feeling or thinking in any meaningful way.But this does not mean that there aren't connections being made. Some aspects of the conversation are carried from one person to the other by way of the subconscious absorption via context, others by the intuitive reading of body language; communication that is not formally spoken or, in the case of reading Delany's novel, the evocation of feelings and thoughts, some rather complex, that arise from the author's prose. In other words, I can't get into Delany's head, but I can have some notion of what he's getting at, regardless of whether I fully understand the entirety at once or not.What, then, do I think Delany is getting at with The Einstein Intersection? I think he's getting at the tenderness of human longing and the co-mingled loneliness and pride in being \"different\". I think he's sharing, on a very visceral level, how lonely one often feels when one is not \"in the norm\" but acknowledging that walking alone can be, in some small way, a victory march over \"normalcy\". Lobey, the main character is, if nothing else, vulnerable and, to some extent, innocent. But he is also powerful, able to plunge through death and hell for the sake of (misplaced? spurned?) love.That's a story worth struggling to understand."}, {"userName": "Megan Baxter", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "I had never read any Samuel R. Delany before, so I wasn't sure what to expect. And I don't think I was expecting this lyrical, mythical, entrancing science fiction. Delany weaves together new and old myths into a science fiction story about a race living in the ruins humans left behind, trying on their lives and living out their stories until they work through them and can finally move on to their own.Note: The rest of this review has been withdrawn due to the changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Stuart", "userReviewDate": "May 16, 2013", "userURL": "http://www.goodreads.com/user/show/9456990-stuart", "userReview": "The Einstein Intersection: New Wave SF with style but story lacks disciplineOriginally posted at Fantasy LiteratureIt doesn't get any more New Wave SF than this very slim 1968 Nebula-winning novel (157 pages), and it's hard to imagine anything like this being written today. It's a mythical retelling of the Orpheus and Eurydice story in a far-future Earth populated by the mutated remnants of humanity. Being a Delany book, the writing is disjointed, jazzy, lyrical, playful, and tantalizing. The surface events are fairly obscure, but it's clear that the real narrative is buried beneath, and in case you didn't catch on, every chapter has several obscure (and fairly pretentious) quotes from intellectuals, not least of all the author himself, who inserts between chapters snippets of his journals from his artistic travels in the Mediterranean while writing this book, in classic meta-fiction style. Even in a longer book I’d view this literary device as fairly self-indulgent, but when the entire story is 157 pages, it’s seems downright insulting to the reader. It’s very clear that reader expectations and tastes have changed dramatically in the last half century.The plot, to be charitable, involves Lo-Lobey, a humanoid mutant in the far future who sounds more like a Neanderthal with great brute strength but limited brain capacity. He is a musician who plays his sword like a flute, and when his love Friza disappears one day, he sets out on a quest to find her. His nemesis is a fearful super-being called Kid Death, a mutant with the power to kill seemingly at will who is intent on wiping out other mutants (which makes you wonder why he doesn’t dispatch them all with a flick of the wrist).One of the key themes of the book is the mythical overtones of the Lo-Lobey’s Orpheus-like quest into the underworld, and by far the most amazing and intense part of the book is the extended sequence in which Lo-Lobey hunts down a massive minotaur underground and battles him. The writing is fantastic and if the book had been able to sustain more passages like this, I would have liked the novel much more. As it is, I felt that was the high point and the narrative collapsed afterward.The other major theme is mutation as a metaphor for being “different”, and when we consider that Delany himself was a gay black poet growing up in Harlem, that makes sense. He married high-school classmate poet Marilyn Hacker after high school, but they experimented with polygamy and had affairs with both men and women, and Marilyn later declared herself lesbian after their divorce. So it’s fair to say Delany would consider himself different. The underlying theme of the story also strongly identifies with the mutants, and at the end of the story Lo-Lobey realizes that instead of imitating the traditions of the extinct human race, the aliens (for that is what they are) need to embrace their differences and live on their own terms. This may make sense thematically, but to shoehorn such a complex idea into the fragile vessel of this story is really over-reaching in my opinion.Nonetheless, it's hard to believe this book won the Nebula and was nominated for the Hugo, since it wouldn't even get a consideration now and might only count as a novella. I wish I could have been in on the award committee deliberations. There must have been an old-guard group supporting Golden Age writers, and a much younger, hipper, coffee-house social activist group on the other side, locked in a deadly struggle for supremacy. Tracking the Hugo and Nebula winners through past decades is a fascinating barometer of the changing times and SF readership, something that an MA thesis could be devoted to."}, {"userName": "Jonfaith", "userReviewDate": "Jul 28, 2016", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "As morning branded the sea, darkness fell away at the far side of the beach. I turned to follow it. So ends The Einstein Intersection. My own interest in Delany may be terminated as well. The novel began as Orpheus and became Red River and ended as David Copperfield. All that without Walter Brennan. Delany lards his fiction with ideas, with theory. Unfortunately he can't stop acknowledging that. A future grimdark place where the humans have left. Mutants remain, clinging to our myths. This novel appeared to be all sprint. I do not wish to end this Delany endeavor. We shall see. 2.3 stars"}, {"userName": "Ian Farragher", "userReviewDate": "Jun 21, 2007", "userURL": "http://www.goodreads.com/user/show/140286-ian-farragher", "userReview": "Dude. I was about 3 chapters into this book and some guy flat out stole this book from me.Nastyguy: 'Do you mind if I read this?'Me: 'Yes, I'm reading it.'Nastyguy: 'Can I take a look at it at least.'Me: 'Ummm, okay. But I'm in the middle of it, so don't leave with it.'Nastyguy: 'Okay.'-- About 2 hours later, after Nastyguy leaves ---Me: (searching all over) Did anybody see the book I was reading?Sister: I think I saw Nastyguy leaving with it. He said you let him borrow it.Me: Awwwh, #@*%!It must be so good it makes people steal. That's what I get for putting it down."}, {"userName": "Ben Loory", "userReviewDate": "Jan 31, 2011", "userURL": "http://www.goodreads.com/user/show/171197-ben-loory", "userReview": "if neil stephenson wrote this book, it'd be 157,000,000 pages long. delany does it as a novella and somehow it contains the whole world.i wish they'd let him keep the original title, though: a fabulous, formless darkness was much better."}, {"userName": "Jim", "userReviewDate": "Dec 19, 2007", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "This is the only book by Delany that I've ever cared for & I love it. He blends SF & mythology, a post-apocalyptic world filled with wonders & monsters. Our hero journeys through this world, discovering more about it, himself & the human race. He shows mankind's greatest failures & achievements through the eyes of something else. A very interesting read & re-read.I read it again & although the words are very familiar after all these years, still they move me in different ways & make me think of different things. Certainly a classic."}, {"userName": "Manny", "userReviewDate": "Jan 01, 2009", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "Psychedelic 60s SF version of the Orpheus and Eurydice myth, quite nicely done. The Orpheus character is sympathetic and well-realized, as is his demonic opponent, Kid Death. Eurydice is suitably beautiful, tragic and mysterious, but doesn't have much of a personality. Not a serious problem, however, since she's dead for most of the book."}, {"userName": "Rob", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/10743961-rob", "userReview": "This is a really short book and I didn't really care for it, so I'm forgoing my usual format to just include a few words.I've never read anything by Mr. Delany before, and if this is an indication of his work, I likely won't read anything else.My understanding however is that this is one of his earlier works, so maybe I'll like his later works better.This was the January 2014 pick for Sword & Laser and I've had pretty good luck with the Sci-Fi picks in 2013, sadly the trend hasn't continued to kick off 2014.I read this all in one sitting in an airport/on the plane to Vegas. I'm now trying to recall what I liked/disliked about this story a long sleep deprived weekend later.My only recollections were that \"thankfully this is short\" and \"I'm glad I'm done with this.\" This is really a story about the journey and not the destination I guess, but I just found it strange and mostly pointless. There are universal themes of love and loss in a post-apocalyptic type setting.The one highlight for me was the ancient lore of \"The Beatles\". They are one of my favorite bands so the notion of them being used as some kind of parable was amusing to me. I will however point out that Ringo DID sing some Beatles songs albeit much fewer than the other three. I'm not sure if Mr. Delany did that on purpose because of bad information discovered/passed down from generation to generation or if he simply got it wrong. It still irks me though. Overall I think this is one of those books whose enjoyment will vary largely from person to person. It just really didn't work for me."}, {"userName": "Jon", "userReviewDate": "Dec 12, 2008", "userURL": "http://www.goodreads.com/user/show/899665-jon", "userReview": "3 stars"}, {"userName": "Daniel", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/31814285-daniel", "userReview": "Interesantna postavka, veoma lepa proza na momente i sa finim ritmom price. Ali na zalost meni je sve ovo bilo dosta konfuzno i priznajem da na kraju polovinu stvari najverovatnije nisam skapirao. Ako sam uopste nesto skapirao :PMoracu kasnije jos jednom da procitam pa mozda bude drugacija ocena."}, {"userName": "Jim", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "This is one of my favorite books of all time, rather odd since I've never cared for anything else that Delany wrote. None of his other books hooked me at all & I've tried several over the decades quite a few times. I've often wondered at his popularity until I found out he's black & gay (Who cares?) so put it down to political correctness especially after attempting to read Through the Valley of the Nest of Spiders which is such gross gay porn that I wonder how anyone could get through more than a few pages.Well, even a broken clock is right occasionally, but he made a true masterpiece with this story book. No, it isn't really a story, so much as a mood piece filled with great imagery and some of the best bits to ponder. I'll never say I understood them, but I enjoy them all the same. It's myth-SF-fantasy. A futuristic Orpheus clashing with wild West & other myths along the way.While Stefan Rudnicki does a great job narrating this, I don't think audio is the best format for any save a first read. It would be great for that, but it requires subsequent reads in text format. In Fahrenheit 451 a character says that \none of the best things about books is that you can shut them when you need to think. \n True & this book requires that. Sometimes my hands were busy, so I couldn't pause fast enough. Fleeting thoughts & connections are sometimes too fragile to survive even a few seconds more.Still, I loved it & I think it's a great addition to my audio library. Highly recommended."}, {"userName": "Negativni", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/17687674-negativni", "userReview": "Kako dosad nisam čuo za Samuela R. Delanyja?! Čitao sam Sirijuse, Future, poneki roto (sf) roman, pa čak i Politikin Zabavnik odakle se i danas sjećam dvije priče, jedna o tome kako pakao može biti i previše dobre stvari, gdje glavni lik do vjeke vjekova mora gledati svoj omiljeni film sa Jane Fondom, i druga o prljavoj masnoj krpi koja je stojala dugo iza radijatora i onda oživjela, ta me se priča toliko dojmila da sam odmah potom pospremio sobu.Gaiman u odličnom predgovoru kaže da je autor roman htio nazvati A Fabulous, Formless Darkness i to bi svakako bilo bolje od ovog pulp naslova. Teško mi je napisati nešto smisleno o ovom originalnom, kratkom, ali kompleksnom i vrlo čudnom romanu. Uglavnom da krenemo redom...Sviđa mi se stil pisanja, sa malo riječi kaže puno. Opisi i usporedbe su zanimljivi (npr: \"Spider was seven feet of bone slipped into six feet of skin. Tightly.\"). Sviđa mi se i ubacivanje pop referenci i što je glazba bitan dio i kako je zanimljivo upletena u radnju. Opisi glazbenih improvizacija su majstorski - zamišljao sam si Iana Andersona (iz Jethro Tulla) koji svira i nogama (glavni lik svira flautu i ima i na nogama odvojene palčeve). Neki dijalozi i scene su dobro napisani, a neki zvuče kao da ih izgovaraju likovi na kazališnoj pozornici, zajedno sa prenaglašenim govorom tijela i sa gotovo karikiranim melodramatičnim ispadima. Autor je dekonstrukcijom mita o Orfeju htio istražiti što su to mitovi, što nam oni znače i zašto nove generacije odbacuju stare mitove i pokušavaju stvoriti nove ili barem stare preoblikovati na način koji se njima sviđa - Mit o Ringu je easter egg za fanove Beatlesa. I nije to loše ispalo, ali moglo je i bolje, jer sama radnja je konfuzna, a i ne dešava se tu baš puno. Također nema baš ni nešto puno znanosti, samo jedno spominjanje Einsteina i Gödela, ali i to samo u službi promoviranja spiritualizma. A tu su i zmajevi. No, svejedno ovo je zanimljiv roman i autor kojeg ću svakako još čitati.Ocjena je između 3 i 4, ali dajem 4.Inače, u ovom romanu je vjerovatno i najkraće poglavlje ikad, citiram u cijelosti:\"She is with me evenings.My ear is funnel for all voice and trill and warble you can conceive this day.She is with me mornings.\""}, {"userName": "Wealhtheow", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/76129-wealhtheow", "userReview": "[ All I got was that he was a sort of new Christ-y figure? IDK! (hide spoiler)]"}, {"userName": "Ivan Lutz", "userReviewDate": "Dec 30, 2014", "userURL": "http://www.goodreads.com/user/show/22753764-ivan-lutz", "userReview": "Razmontirani Orfej na Delanijev način uz primjesu Isusa, Sotone i izdajice Jude. Vrlo neobično štivo, zahtjevno do krajnjih granica. Toliko kompleksno da sam nekoliko puta vraćao poglavlja i mrštio se ne bih li uhvatio niti. Strašno je kako se stilski razlikuje od bilo koje SF knjige koju ste pročitali, opije vas i udavi već nakon prvog paragrafa, ali oni strpljiviji(a rekao bih i načitaniji i svakako nije za početnike) će uživati i na kraju dobiti zasluženu nagradu. Uklapa sve poznate religiozne motive u priču na jedan potpuno degenerirani način, a time i pop(ali više rock en roll) kulturu u svaki dio romana, pogotovo na dijelovima gdje naš Lo Lobey svira i izvrće svoje note prvo malo rock pa onda malo roll. Opet kažem, vrlo vrlo čudna knjiga, zapravo mi fali riječ kako bih objasnio pravu njezinu narav. Kratko o sadržaju: U dalekoj budućnosti jedna rasa je došla na Zemlju jer su joj se svidjela zemljina dobra, kultura i način života te uzimaju formu ljudi i pokušavaju se ponašati poput nas. Nakon nekoliko generacija došlo je do mutacija, poprilično nepredvidljivih, pa je i njihova rasa u problemima jer je sve više hemafrodita. Glavni junak Lo LObey(Orfej) odlazi u potragu za svojom Frizom (Euridikom) i kroz putavanje iz malog mjesta u velebni grad promatra promjenu društva i svijeta. Na tom putu sreće sve one gore nabrojane likove i kroz njihovo ponašanje uviđamo da svijet u kojemu žive nije ono na što smo naviknuli. Lo Lobey kreće u potragu za identitetom, i svojim, i svoje vrste, ali kroz šumu likova i scena(od kojih su neka bizarne i nerazumljive) dolazi do spoznaje o tome kakvi su ljudi i što, zapravo, njihova ostavština jeste. Nakon čitanja predlažem pročitati neki trač magazin :) ili nešto slično jer se mozak mora ohladiti."}, {"userName": "Jessica", "userReviewDate": "Mar 08, 2009", "userURL": "http://www.goodreads.com/user/show/1123577-jessica", "userReview": "I give some Samuel Delany books 4 stars where I would give someone else 5, but only to be able to distinguish the whole-nother-plane ones like the einstein intersection, which gets its eerie effect by literalizing the impression that one's culture and language sometimes feel as though they might be a strange dead shell left by another people in another place. it uses that classic scifi trick that, in this alien world that humans colonized, the thing we refer to as a \"dog\" may turn out have spines (the trick that allows Anne McAffrey and SHeri S. Tepper and Marion Zimmer Bradley and Joan D. Vinge's books to be both medieval and scifi*), and takes it to its logical extreme: what if every ordinary thing (tree, horse, familial duty), could be counted on to behave in unexpected ways and have only a slippery resemblance to their name, because there is a false veneer of our culture over a totally alien one?"}, {"userName": "terpkristin", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/3392444-terpkristin", "userReview": "I don't know what to say about this book. It very obviously wasn't for me. It was obtuse. It regularly put me to sleep, even though it was only ~130 pages long. The best part of the book was the introduction written by Neil Gaiman, and even then....I felt like he set the book up to fail. Because what he painted was not what this book was. It was myth, metaphor, an attempt at telling a story but telling it in a way that was purposely confusing. I dunno, I guess I'm not smart enough to get it. I recognized classic characters from various myths around the world, but I still couldn't wrap my head around it. I hope the next S&L pick is better, this wasn't a great start to 2014."}, {"userName": "Vderevlean", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/4777832-vderevlean", "userReview": "O ciudățenie de carte în stilul new-wave. foarte mainestream. Ca roman sf, nu e mare lucru de capul lui - 2,3 stele. Ca roman de graniță e genial, provocator și cu adevărat speculativ. Amestecând mitul lui Orfeu și diverse trimiteri pop, realitatea din viitorul lui Delany e stranie, poetică și deseori inaccesibilă.Suntem la multe mii de ani de prezentul nostru, planeta noastră a fost părăsită de oameni sau omenirea a dispărut (nu știm sigur), dar e locuită de o rasă extraterestră mutantă. Comunități mici, unele mai mari, aparent urbane. Însă totul se desfășoară pe ruinele civilizației umane. Lo Lobey (particula lo înseamnă că e un membru funcțional al comunității, altfel ar sta închis într-o Kușcă) cântă la sabia sa și păzește animalele ptr mica lui comunitate. Iubita lui, care simte ca și el că e diferită cumva de ceilalți, moare în mod misterios și Lo Lobey pornește într-o călătorie inițiatică pentru a o răzbuna și poate a o reînvia (nu știm cum, însă trimiterea către Euridice e clară). Călătoria e presărată cu diverse aventuri (de pildă, înfruntarea minotaurului într-un labirint subteran) și Lo Lobey e nevoit să-și învingă teama, dar și să îl confrunte pe Puștiul Moarte, aparent autor al mai multor crime, a cărui victimă a fost și Friza, iubita lui Lo Lobey. Deși există un fir narativ, miza cărții pare să fie tocmai în a reconstrui miturile omenirii și nu în a da viață unor personaje extraterestre. Miturile și poveștile pop sunt refăcute, dar distorsionat, deformat, asemeni formei mutante a rasei care locuiește planeta.Clar, roman de recitit."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Jan 13, 2014", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "When this was the first Sword and Laser pick of the year, I was thrilled. After all, one of my 2014 reading goals was to finally read Delany. I'm not sure what to think of this particular book as an introduction to his work!I think I need this book to be a graphic novel. It is brief, just over 150 pages in my edition, but is chock full of ideas. At first they seemed random but as the parts of the story filled in toward the end, they became more obviously intentional. I'm certain Delany knows more than I do, and that it would take me months to untangle all the references, both named and unnamed, in what is really more of a novella. Genetic mutation, alien invasion, ancient history of western 1960s culture, Einstein and Gödel, the limitations of humanity, the future of the universe.... this isn't even scratching the surface.If this were a graphic novel, I could try to grasp the human mutations created by an alien race millennia after humans have destroyed themselves. Lobey, the hero (Orpheus, yes. Jesus? Maybe not. And other things) who hears the music others have in their heads, ends up going on a quest after the ... girl (?) he loves dies. More and more \"people\" are dying, actually, and he seems to be around for these deaths, and eventually he is warned that this might be a repeat of how humanity died off before. If there were pictures, I could understand the three accepted genders and the non-accepted creatures kept in kages. I could see the bull, the super computer, and the dragons. Delany seemed to really enjoy writing the fight scenes, and really one ended each of the three major sections of the story.Some of the writing stuck me, just little bits like:\"Dragons swarmed in sunlight.\"\"Who wants to take part in an orgy of artificial insemination?\"\"A fly bobbed on a branch... and thought a linear, anthropod music. I played it for him, and he turned the red bowl of his eye to me and whispered wondering praise. Dragons threw back their heads, gargling. There is no death. Only music.\"Going back to Gödel, here's an interesting quotation from Judy Jones and William Wilson about his incompleteness theorem, which is an important concept in the book:\"And it has been taken to imply that you’ll never entirely understand yourself, since your mind, like any other closed system, can only be sure of what it knows about itself by relying on what it knows about itself.\"I think that's how I feel about the book - I will never entirely understand it, because it's relying on Delany's knowledge and what Delany connected together. I'm not Delany, therefore my understanding can never be complete, and he did that on purpose.Don't despair, fellow readers, just bask in the blissful non-understanding of the book. \"It's still the wrong maze, baby.\"This book was also discussed on the Reading Envy Podcast Episode 01."}, {"userName": "Phil Jensen", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/14413650-phil-jensen", "userReview": "Hyper-intelligent and cryptic. Some readers compare it to a Roger Zelazny novel, but it reminds me more of Gene Wolfe or Viriconium. Delany explicitly states throughout the novel that myth exists to tell us basic truths that are unutterable otherwise. Very well, what are the unutterable truths he is expressing in this book?*SpoilersWHAT I THINK I JUST READLo Lobey is a descendent of aliens who took over the vacant bodies of humans. Several generations prior, humans used technology based on Godel's theorems to move across the universe, leaving their \"souls and bodies\" behind. The aliens have three sexes: male, female, and androgyne. Lo Lobey gets freaked out by the androgynes, but it's not clear why. And what are they, anyway? Do they slip back and forth between male and female? Are they asexual? At least one of them had a child, so they're capable of reproduction.Anyway, Lobey goes on a hero's quest to kill Kid Death. Kid Death is a nigh-omnipotent character who kills people who are different. \"Different\" in this case means something so fundamental that the characters themselves don't understand it. It includes varying psychic powers, but it's more than just the powers.In addition to the psychic powers, all future humans are physically mutated to greater or lesser degrees.Then it gets weird.Apparently, one of the mutant psychic powers some of the \"differents\" have is the ability to resurrect people that they have killed.When Lobey gets to the city, one of the other \"differents,\" Green Eye, is tied up to a tree in what might seem like a Christ reference, but seems more like an Odin reference to me. Then Lobey stabs him through the leg. Why?At this point, a computer announces that they are all incorporeal aliens. I thought, ah, that means that their human bodies are only holding them back, and that \"death\" is actually a release. Therefore, Kid Death is doing them a favor. But then Lobey kills Kid Death anyway. Why?MY QUESTIONS1. What exactly is an androgyne? 2. Why does Lobey freak out when he meets an androgyne?3. What does Kid Death represent? Why does he want to kill off the differents?4. What's with blurring the line between life and death?5. Why does Lobey stab Green-Eye?6. If their bodies are really just awkward cages that don't even fit them sexually, then isn't Kid Death doing them a favor? When he releases them, don't they just float off the way the humans did generations before?"}, {"userName": "Tamahome", "userReviewDate": "Dec 26, 2013", "userURL": "http://www.goodreads.com/user/show/2768410-tamahome", "userReview": "*shrug* Maybe Jenny would understand this novella. UPDATE:This guy seems to understand it. http://yellowedandcreased.wordpress.c..."}, {"userName": "Nate D", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/406701-nate-d", "userReview": "Fall 1965 through Spring 1966 was a significant period for Samuel Delany. The gripping but somewhat limited The Ballad of Beta 2 had just come out. In September 1965 he finished writing Babel-17/Empire Star, which would win him his first Nebula, and first major award, when published the following year. Babel-17 remains possibly his greatest achievement pre-Dhalgren, but the work immediately following it were on a similar level. He spent the rest of September writing two novellas, the fantastic \"The Star Pit\" and slightly longer, mythic \"Empire Star\", blasted out in a week in order to finance the coming months. Because he would spend the coming months traveling Europe. During that time, he'd write the entirety of The Einstein Intersection, as well as another story, \"Dog in a Fisherman's Net\". All of these last three are about myth, but in very different ways. \"Dog\" written while in Greece, is a strictly real-world treatment of the background tension of mythology in that part of the world, while \"Empire Star\" is itself a myth in the oral yarn-spinning tradition. The Einstein-Intersection is something else entirely, both embodying mythic archetypes at every turn, even while it dissects and interprets their significance within its own discussion and narration. (The details of Delany's travels are also useful here, as the journey of the novel becomes mapped to his own travels, even incorporating bits of his own journals as self commentary.So. That's the context. Delany was concerned with myth, poised for much greater recognition, traveling, traveling to places concerned with myth. To those layers, add some kind of unknowable event that leaves apparent aliens attempting to carry forward the remains of an earth vacated by humans, occupying seemingly vacated human bodies, even, though the race has begun to mutate wildly. Computers of the past comment from a seemingly world-spanning vestigial labyrinth (complete with minotaur, no less), while those on the surface struggle to maintain some semblance of normality and viability in a three-gendered system (in a plaintive variation on the ill-judged fight for normality in the Ballad of Beta-2), and an even greater \"difference\" seems poised to rewrite all the myths. How exactly the world came to be, and how exactly it works, may be lasting mysteries, while the archetypal guideposts of myth are warped, misinterpreted, and outright contradicted: if anything, they are unreliable guides, even by their own admission. Even so, the density of ideas, the sheer strangeness, the odd elegance and humanity that creep in all point to greatness."}, {"userName": "Jeremy Kohlman", "userReviewDate": "May 21, 2009", "userURL": "http://www.goodreads.com/user/show/2078792-jeremy-kohlman", "userReview": "I'm not sure what to say about this book. It's one of those stories that, having read it, I know has changed me. But changed me how? That I do not know. I am different from having read this story. (that's actually quite an ironic statement, you'll get, if you read it!)This is a very short story. Just 143 very short pages. It doesn't take much time at all to finish. But again, I know there's far more than 143 short pages of meaning lying here. I might just start to understand what this book is saying and doing to me, if I read it a few more times. Short of that, I don't know how else to speak of it.Do I recommend it? I don't know. I can imagine there are many who read it, that find it a waste of time. For those who focus all their energy on what a story is saying, and not enough on what it is TELLING you, this book WILL be a waste of time for them. There is definitely no spoon feeding of meaning in this one.Don't read it if you are looking for answers.\"Endings to be useful must be inconclusive.\" I think that says it best.I'm glad I read it. I hope I read it again someday. Should you read it? That is for you to decide."}, {"userName": "Jlawrence", "userReviewDate": "Jan 28, 2014", "userURL": "http://www.goodreads.com/user/show/92292-jlawrence", "userReview": "[I liked the mutant 'minotaur' in the underground cavern 'maze', but the coy computer whose acronym spelled PHAEDRA seemed too cutsey. Likewise, Spider's sudden transformation, once Lobey finds him in the city, into the info-dumping gatekeeper of the underworld seemed awkward. I mean, it was very useful for clarifying what Delany was playing at, but in terms of story and character, clunky. (hide spoiler)]"}, {"userName": "Stephen", "userReviewDate": "Oct 21, 2008", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "3.5 to 4.0 stars. Nominee: Hugo Award for Best Science Fiction Novel (1968)Winner: Nebula Award for Best Science Fiction Novel (1968)"}, {"userName": "sologdin", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/5610133-sologdin", "userReview": "Almost surreal at times, this reworking of Orpheus and Theseus narratives is set on Earth after humans have moved along elsewhere (dead? gone? no idea) and some other wierdos have taken over. It has the normal far future/dying earth conventions: chatty old cryptic computers still running, mutants everywhere, decayed urbanicity, radiation, pastiche of surviving mass culture, &c.Novel is structured by Foucault's political dream of a pure community, embodied by the leper colony: \"non-functionals, idiots, mongoloids, and cretins\" (6) are sequestrated in cages until they die. \"Difference\" regarding phenotype is not tolerated generally. Narrator is \"different,\" but is not functionally impaired. Is involved with another \"different\" person, and when she is killed, narrator is off to take revenge. Villain is also \"different.\" Later, at an ultra-urban place, \"difference\" is disregarded as provincial bigotry. So, something there.Lots of barely comprehensible action and exchanges--it's a Delany book, after all.Intellectual core of the book, eponymous intersection, arises out of the confrontation of Einstein, \"who with his theory of relativity defined the limits of man's perception by expressing mathematically just how far the condition of the observer influences the thing he perceives\" (128), with Godel, \"who was the first to bring back a mathematically precise statement about the vaster realm beyond the limits Einstein had defined\"--with an explication of incompleteness/undecidability--boiling down to \"there are an infinite number of true things in the world with no way of ascertaining their truth. Einstein defined the extent of the rational. Godel stuck a pin into the irrational and fixed it to the wall of the universe\" (id.). Thereafter, \"the visible effects of Einstein's theory leaped up on a convex curve, its production huge in the first century after its discovery, then leveling off. The production of Godel's law crept up on a concave curve, microscopic at first, then leaping to equal the Einsteinian curve, cross it, outstrip it. At the point of the intersection humanity was able to reach the limits of the known universe\" (id.). So, yeah, damned interesting. I repsectfully contend that this is the real story, and Delany missed it by writing a neo-mythical love story about a pack of mutants. Delany would respond that I have given an Einsteinian rather than Godelian criticism, and that'd be a fair riposte.Recommended for readers haunted by their million year old fantasies, persons in wrestling matches wherein the loser would be dinner, and those who must keep the genes mixing, mixing, mixing."}, {"userName": "Paul,", "userReviewDate": "Sep 24, 2014", "userURL": "http://www.goodreads.com/user/show/2318453-paul", "userReview": "Hmmm ... this book reminds me of Orson Scott Card's analysis of James Joyce's Ulysses \" pretentious twaddle ... which can only be understood with the magic decoder ring which Joyce thoughtfully provided to friends, and which they passed on to the professors ... when we finish learning how to read and understand Ulysses, most of us realize that it's twaddle. Whatever insights into the human condition James Joyce had to offer were trivial compared to the labor of receiving them.\"Now I don't want to say that about this book. I don't know if it is pretentious twaddle or not. I know that I don't have the requisite background knowledge and I don't feel like looking it up. If you are like me, a regular person who understands what is meant by Einstein and Godel and their intersection, who catches the allusions to Greek mythology, but misses all the other cultural referents, this book doesn't have much to offer. I guess I'm not smart enough or widely read enough. The plot is vaguely interesting, the characters are interesting only in their \"archetype-ness\". But the messages at the bottom that I got were: People don't like other people who are different, even if they can't really define \"same\". It is impossible to understand everything. Oh yeah, and some of the sentences were pretty. But I wouldn't read it again or recommend it."}, {"userName": "Andreas", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/20379307-andreas", "userReview": "Delany wrote this brainfood with humanistic background in 1965. So, there are clumsy computers, 33' and 45' records, there are Beatles, Bob Dylan references etc. But the archaic touch doesn't matter at all - the concepts are important, here. Probably, this isn't for one who doesn't know Orpheus and Eurydice. It's more fun having a wikipedia nearby to search all the catchwords. So, it will be a slow read and second read might bring even new dimensions of insights - though I won't re-read it. References to Einstein's and Gödel's theorems are a little bit explained but you have to figure out connections by yourself.There is space and time travel and all is interleaved with Delany's travel log in the mediteranean sea.Delany writes in an advanced literaric prose which doesn't provide easy answers, clear plotlines and trivial characters. It's simply a little bit more complex than your usual bread and butter SF. And it is a novella with less than 150 pages where newer authors would take a couple of hundred pages to bring the same message over."}, {"userName": "Stephanie A. Higa", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/686879-stephanie-a-higa", "userReview": "Delany is totally fascinating. His hallucinogenic style, his obsession with orgies, his anti-transitions, which make you think you must have gotten knocked out for at least a few seconds...fascinating. But I think it's difficult to say how good he really is. Yes, he expresses such deep ideas in such beautiful language, but what does this mean? Do I like him because he is actually legitimately good or because his writing makes me feel all fuzzy inside, like the world finally makes sense? It doesn't matter. What I mean to say is that Delany is an intensely personal taste for me. The Einstein Intersection has many missing variables, and at least twenty missing pages, but I loved it all the same. It was also pretty uncanny to read about multisexed/androgynous aliens after researching every single genetic disorder of sexual development, as if I were merely reading the psychedelic continuation of those Wikipedia articles."}], "description": "A nonhuman race reimagines human mythology.", "title": "The Einstein Intersection", "url": "http://www.goodreads.com/book/show/11549412-the-einstein-intersection", "average": 3.58, "cover": "https://images.gr-assets.com/books/1328342187l/11549412.jpg", "reviews": 321, "authors": [{"url": "https://www.goodreads.com/author/show/49111.Samuel_R_Delany", "name": "Samuel R. Delany"}], "type": ["Science Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/11549412-the-einstein-intersection", "http://www.goodreads.com/book/show/2442061.The_Einstein_Intersection", "http://www.goodreads.com/book/show/145354.The_Einstein_Intersection", "http://www.goodreads.com/book/show/756823.The_Einstein_Intersection", "http://www.goodreads.com/book/show/1902144.The_Einstein_Intersection", "http://www.goodreads.com/book/show/38399679-the-einstein-intersection", "http://www.goodreads.com/book/show/33836559-intersec-ia-einstein", "http://www.goodreads.com/book/show/6621469-the-einstein-intersection", "http://www.goodreads.com/book/show/1199688.Babel_17", "http://www.goodreads.com/book/show/85867.Dhalgren", "http://www.goodreads.com/book/show/85863.Nova", "http://www.goodreads.com/book/show/85861.Stars_in_My_Pocket_Like_Grains_of_Sand", "http://www.goodreads.com/book/show/145356.Babel_17_Empire_Star"]}