{"ratings": 76643, "userreviews": [{"userName": "Cory", "userReviewDate": "Jan 21, 2011", "userURL": "http://www.goodreads.com/user/show/3254923-cory", "userReview": "How to Write a Best Selling YA Novel1. Make sure you write the book in a POV that distances us from the narrator. If you have no idea how to write 1st Person Present, do it any way. It makes the book confusing and fun for your reader to plow through. Also, make sure your narrator's POV is very boring. Boring enough to put Plato, Jane Austen, and Shakespeare to sleep. 2. Make your narrator a selfish, boring girl with little to no life outside of her love interest and one singular hobby. Whether it be loving the ocean, loving books, or loving to whine, make sure it's only one hobby. We can't have her be interesting or three dimensional. That would make her complex and intriguing. Also, make sure she has a best friend that she can envy, and a boy that adores her. It gives her more reasons to angst and whine. Then top it off with a tragic past. Often both parents should be dead and she should have a relative that hates her. That way if a reviewer says she's whiny and annoying, someone can refute this by saying she has reasons to be whiny and annoying. 3. Love triangles are a must. If you can, make sure that you give no reason why the romantic leads are in-love with each other. And then give the heroine a love-interest that absolutely adores her. Make sure that both boys love the girl, but the girl just loves one for no particular reason. Actually chemistry isn't necessary. See Hush, Hush, Twilight, and Fallen for abusive love triangles. They're just so much fun. But if you want to deprive your reader of that delicious voyeuristic experience, make both love interests as boring and bland as you see fit. 4. Research popular trends. This is a must. If you see vampires are popular, don't write about them. You're and original creative being. Choose angels instead. Or better yet, demons. If you're feeling really adventurous, pick up a copy of Fantastic Beasts and Where to Find Them. Then randomly flip to any page. But make sure your beast has lips and is capable of having abs like a chiseled Greek god. Disregard the fact that most Greeks gods actually raped women when they wanted sex. That part isn't important. If you're stuck, skip to step six.5. If you can't find something totally awesome, pick up a popular adult book. Or better yet, a movie. Make sure it's a really bad movie. One that bombed at the box office so no-one will know where you stole your plot. If you're trying to find really bad movies, search M. Night's catalog. Pick The Village. Don't research the history behind the movie. If you can, avoid the fact that M. Night was sued for plagiarism over that script. Your story can stand on its own. It just needs that one special thing.6. If you don't know what special creature needs to be in your book, don't fret. Pick a number between one and ten. If you picked anything above five, you've got zombies on your hands. Anything below five, and you're wrestling with unicorns. If you picked five, you've got a boring contemporary novel on your hands. Human boys suck.7. Use a plot generator. And make your story very predictable, but annoyingly ambiguous so you can leave room for a sequel. 8. Don't spend a few weeks developing your characters.9. Try your hand at being Dan Brown for a day. Create some lame conspiracies. 10. Research is the bane of your existence. You don't have to actually read about your subject matter. Why read a fantasy novel if you're writing fantasy? That's just stupid. If you're writing about a post-apocalyptic world forget about logic. Don't even touch any other books. You're much better than those writers. Why spoil your creative juices with inspiration. What a disgusting word that is. If you're writing about angels and demons, don't you dare touch the bible. Stay far away from Paradise Lost, the Divine Comedy, or any of that sick canon that stunts your creativity. Same thing for zombies. Don't read or watch anything related to zombies. In fact, barely focus on the zombies at all. Your boring love triangle is much more interesting.11. Think up an awesome title. Remember, that's the most important part. Once you've got the reader hooked on that, nothing else matters. 12. Spend one week writing the novel. Better yet, take a page out of John Hughes book. Spend one day finishing that bad boy. 13. Don't get anyone else to read it. They'd just give you that nasty thing called criticism. Just send it through spell check two or three times. That's all the editing you really need. 14. Spend three weeks on the query. Make sure you only tighten the first page of your manuscript. Those are the most important parts. After all, teens these days just don't need decent literature. You're in this for the paycheck, remember?15. Once you have your agent and your three book deal, make sure to suck up to your cover artist. Your book needs to look awesome for it to sell. 16. Write up a few thin outlines for the rest of the trilogy and give it to your ghost writer. If you can, squeeze out a spin-off series.17. Give ARCs to everyone you know. Make sure you bribe them to write good reviews.18. Sit back and bathe in the awesomeness of having your book debut on the New York Times bestselling list. Watch the royalty checks come in and pad your pockets.19. Sell your movie rights as fast as possible. 20. Now that your book is mega-popular, take the time to read it over for the second time. Yes, this is the second time you've read that novel. Don't be embarrassed. It rocks. Disclaimer: For the record, I stopped reading this book two-thirds of the way through. This was satire if any of you are actually thinking of using this as a guide to become the next Stephanie Meyer."}, {"userName": "Kat Kennedy", "userReviewDate": "Mar 17, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "See this family?Or this family?Take a good long hard look at all of their faces. See how happy, how healthy, how loving they are. Imagine you've known them your entire life and that you love each one more than life itself.Now imagine if you were one of the people in that photograph with them. Now imagine that I told you and all those other people standing and smiling with you that I was going to kill you all so that I could go for a trip to the beach...Okay, now you know the basic plot of The Forest of Hands and Teeth.I've mentioned before that I have a love/hate relationship with zombies. On one hand, I love reading zombie books and watching zombie movies. On the other I will then spend two weeks wide awake clutching a baseball bat while waiting for the shuffle of feet and the moans of the undead outside my bedroom door.I actually have something like this in my house...I love the chase as things fall a part and slowly people are picked off one by one. That's the thing that's almost a constant in the Zombie genre - is the psychological breakdown of the group. Usually in a zombie group, you'll find the differing personalities and human flaws are what slowly kills the group - not so much the zombies.The difference between most of the zombie media, and this book, is that usually you watch things unfold from the sole sane person who is trying to keep all the crazies from turning themselves into meat patties and throwing themselves to the horde.In this story you get to watch the gradual mental breakdown of a woman until she's willing to sacrifice anything and anyone just to live out a damn fantasy.Okay, so I know the point of it is that there are dreams and dreams are important like freedom is important and you must always follow your dreams blah de blah blah!Sorry, I'm a very pragmatic person. Kill zombies first, fulfill life long dream of of seeing ocean second.Yet, despite my utter hatred of the main character by the time I finished this novel, I still can't give it less than five stars.I can't give it less than five stars because I spent most of this book gripping the bed covers in suspense. The characters were all great, realistic and interesting. Mary's decent into madness was COMPLETELY understandable and very well documented and this book was very well written and paced very well.Then, of course, I had the satisfaction of knowing that if it had been me - I totally could have survived better than them. And that, my friends, is the biggest satisfaction you can get out of the zombie genre.Oh yeah, baby.My Zombie Plan totally beats the crap out of their Zombie plan.So what's YOUR zombie plan?"}, {"userName": "Meghan", "userReviewDate": "Feb 23, 2009", "userURL": "http://www.goodreads.com/user/show/1652196-meghan", "userReview": "Synopsis: Sometime in the future, the world is overrun by zombies--people infected by an unknown virus that causes them to return as the undead and feed on human flesh--called the \"Unconsecrated\". Mary lives in a village surrounded by the Forest of Hands and Teeth, where the Unconsecrated are kept out by a chain-link fence, and to the villagers' knowledge, they may be the last bastion of uninfected humanity. Mary's little world is ruled by fear and the people have turned to a Medieval-like religious fervor to give them hope. Mary grew up with stories of Outside the Forest and fences and her latent desire to uncover the truth eclipses everything when Mary finds out a dangerous secret. However, a blooming romance further complicates matters, and Mary will have to make a choice...My review:The story sounds promising, right? It does have potential and the idea is rather unique (especially with the deluge of vampire-related YA novels that has been happening) but, ultimately, it didn't do it for me. The writing was fine and moved at a nice clip, but lacking in detail. So much so, that there were times when I wasn't even sure where the action was oriented! I never got a real feel for the setting. I also found myself not caring for the characters, and there didn't seem to be much character development (one of the pitfalls of first-person narrative?). Travis, the love interest, had no discernible personality and so I had no idea why our narrator was so in love with him. And for all her suffering, I had a hard time drumming up sympathy for Mary.The biggest problem was that the author had too many ideas going on at once, and would completely drop story lines altogether. No questions were really answered by the end. And while I assume the author is planning one (or more) sequels, I have no compulsion to follow Mary's story. Because so many (seemingly important) threads were cut in this book, I don't know how they can be picked up again (if they would be at all).Oh, and a chain-link fence? Come on!"}, {"userName": "Kiki", "userReviewDate": "Mar 15, 2011", "userURL": "http://www.goodreads.com/user/show/4074594-kiki", "userReview": "Dear Mary,You went full Shane. You never go full Shane.Hugs and kisses, Kikixoxo"}, {"userName": "Tatiana", "userReviewDate": "Apr 30, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "I was very much looking forward to reading this book. Great premise, rave reviews. Unfortunately, I was disappointed. First of all, I truly disliked the writing style. Present tense writing can do wonders in skillful hands (see Wake, Fade by Lisa McMann), but in this case this style was mishandled, it didn't add any kind of intensity to the story. Quite the opposite, I was extremely irritated by it. I don't think this book was in any way original. It read mostly like kind of Village/Dawn of the Dead/I Am Legend combo, just worse than either of those stories. Then there were these multiple fumbling romances that had no depth to them and only added a thick layer of unnecessary angst to already boring narrative.Finally, too many things in this books were left untold. I do like it when an author leaves you thinking and allows you to come up with answers on your own, but in this case, so much was left to my imagination, that there was simply not enough information in this book to like the story and get attached to the characters. What kind of secret knowledge did the Sisters possess? Where did the zombies come from? Why was Gabrielle the fast one? Did Mary consummate her relationship with Harry or Travis? These questions were endless. Too much was left untold or just hinted at to truly enjoy the book. I know the sequel is in the works, and I am positive I will not be reading it."}, {"userName": "Wigs", "userReviewDate": "May 23, 2012", "userURL": "http://www.goodreads.com/user/show/4719641-wigs", "userReview": "More filler YA garbage. It had potential I guess but the writing quality, the plot quality, the dialogue quality, I just can't. It was like the author lost a bet over how minimal a vocabulary she could use to write a book. Ocean. Ocean. OCEAN. OCEAN OCEAN OCEAN I swear to god stop saying ocean talk about something else anything else. Seriously. Do not hit your readers over the head with a hammer we GET IT. WE GET IT DON'T REMIND US EVERY CHAPTER I AM DROWNING IN YOUR SEA OF OCEANS.All the main character Mary cared about was going to the ocean. And told us constantly. There was almost nothing else in her empty head and her characterization was so one dimensional it was putting me to sleep. Then there was her love for Travis, lets put \"love\" in quotes because even though she told us she loved him it seemed nothing more than a childish obsession with something she couldn't have. When she finally did get to live with him, she ignored him, she barely talked to him, neglected he was around her, didn't even tell us what was going on. (I mean are they kissing? Are they having sex? Are they doing nothing? I don't know. I'm so glad she filled us in on what it was like living with her supposed ~love of her life~ hold on let me stop to roll my eyes okay there we go.) Because her character is so flat we don't really hear much of what goes on save for her tunnel vision over the ocean and nonsensical diatribe. She's one of those famous characters that makes odd jumps in logic for no reason whatsoever and you're like wait how did you get from that thought to the other? I hated the book from the outset when we were launched right into a long stretch of her living in the nunnery and I was just like please attempt to find less ways of boring me and it didn't seem to be getting better. In fact it got worse, with the whole ridiculous two girls that are engaged to the wrong brother and in love with each other's finace thing. Then they finally leave the village and things started to get better, but only barely. As I mentioned I thought there was one part that was kind of scary that I enjoyed being creeped out by.But then we got to the part where Mary puts on the dress and goes nuts about existentialism and then I was right back to bitter searing author hatred. Please authors of YA, please give up this vague nonsensical writing you're all so fond of about the ~outside and the ~others and ~more and the ~future, it always just sounds like babble specifically from first person point of view.The main death in the book was about as predictable as what day of the week tomorrow will be, seriously. There was this one conversation scene where it felt like the character was signing their own death certificate. Don't worry, you're no longer needed, sign here, here, and here okay great come back in the next scene and we'll get it taken care of, thanks!Anyway yes I finished the book, and of course the ending gives us that YA first book in the series ending where there's not enough closure to create any sort of satisfaction. And since the second book is about this main character's daughter I guess any lingering questions on the fate of the people who weren't mentioned how they ended up at the end are probably answered barely in passing in book 2. And guess what I don't care, not reading it, bye.(Okay yes Wigs stop reading YA I know I know I'm trying to get rid of the ones I've purchased and then no more.)"}, {"userName": "Aj the Ravenous Reader", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "I don’t think I’ve read a zombie book that I didn’t like. Sorry about the spoiler because yes, The Forest of Hands and Teeth is as story about zombies but it’s very gracefully written, you sometimes forget there are zombies in it. Carrie Ryan definitely has an effortless way of bringing art out of her words. Her writing seems to have this hypnotic effect on me and I just had to keep reading.Writing aside though, I think the plot is also very commendable and I think very original. The utopian world is literally juxtaposed with the dystopian world and I was very impressed with the idea. The main characters live safely in a “Pleasantville-ish” village and believe they are the last humans on earth while outside the fence where lies the  Forest of Hands and Teeth, the “Unconsecrated” surround them keeping the people inside and leaving them no choice but be content with how they live. But Mary, our main character is a curious (sometimes too curious it’s annoying) girl and couldn’t accept that all there is to life is their sorry one in the village. This is where all the conflicts in the story shall arise.Perhaps one of the setbacks of the novel is the heavy romance despite not being really romantic. I’m not particularly sure why Mary earns a lot of affection from the boys since she’s not a very likable character to begin with. I didn’t find real chemistry with any of the matches and I don’t like how Mary is too indecisive of her feelings. I also find it weird that these sinister Sisters are the ones imposing these weird rules and rituals among the villagers. I don’t think this will be addressed in the sequel because WTH, I checked it and it has nothing to do with these characters. But I want answers on why the Sisterhood rules the village. What are these secret passages they’re hiding in their cathedral? What’s their connection with the Unconsecrated? What happens to the people left behind? To Mary? To Jed? Overall, it’s still a gripping post apocalyptic read and I would have been eager for the sequel if it would answer all my questions but I guess it won’t so bummer. Guess I’ll just have to find out what the sequel is about.P.S. I hear this is going to be adapted into a movie starring Maisie Williams. That would be so awesome!^^"}, {"userName": "mark monday", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": ""}, {"userName": "Anne", "userReviewDate": "Jan 21, 2009", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "I just finished reading, and I'm not sure if I liked it or not. To be honest, I feel sort of drained and depressed now that I am done. However, I've never really read any other stories about zombies, so I don't have anything to compare it to. The plot held my interest, and it is not a very long book, so that is a plus. I can't really say that I sympathized with any of the characters in the story, though.It is told from Mary's point of view, but I didn't really like her very much. I found her obsessive need to see the ocean a little annoying. I know, I know. Without it, there would be no plot. Still. She didn't come off as an adventurous young woman who wouldn't settle. She came off (to me, anyway) as a girl who's single-minded selfishness caused everyone around her nothing but pain. Ok, maybe that's too harsh. I think she did care about the other people in her life, just not enough to think about them until it was too late.Her love interest, Travis, seemed one-dimensional and flat. I couldn't understand why they were attracted to each other to begin with. It was like she had to pick someone to fall in love with and he was the only one who was sort-of acceptable. Even at the end, their love story seemed like it was lacking something substantial. I was also disappointed at the lack of answers that the ending provided. I suppose that is because this is only the first book in this series? Still, I would have liked at least one or two things cleared up. Having said all of that, Forest of Hands and Teeth was different enough to make me feel good about having read it."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Jan 11, 2010", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Mary is a shit. Let's get that straight from the beginning. As a main character I tried to like her. I really did. Did NOT happen. The story starts off in a small town that Mary lives in. It's ruled by the Guardians and the Sisterhood. The sisterhood:\nThe book never really explained why the Guardians existed nor much of what they did. I actually want to know more about the creepy Sisterhood that everyone listens too. I don't get why they were in charge. Mary ends up in the Sisterhood due to several of the characters in this book being asses. I hate to spoil things so you have to read the book if you want to see why. What I did not like about this book:I didn't really like any of the characters. I kept thinking I would. Nah. Jacob and the dog about the only two that showed sense enough to get out of a paper bag. The ocean theme. Damn Mary just stepped on everyone to get her ocean. I hope she gets this.\nThings I did like about the book:The zombie baby. I hadn't seen much of infant zombies and this bit was pure genius. Yep, I'm sick like that.So why is this book getting four stars?? Because I couldn't put the stupid thing down. I kept turning pages wanting more. I'm so sad for myself. Thanks to my enabler Khanh for recommending this to me."}, {"userName": "Emily May", "userReviewDate": "Feb 04, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Ok... personally, when I see a book rated 3 stars I tend to avoid it, 3 stars to me seems a very poor rating. However, I want to stress that I think this book is worth the read and the story is very intriguing, even so far as that I am looking into getting the next book in the series.So why did it get 3 stars? Well, it was more than 'ok' and I did like it, but there were just enough elements that annoyed me to not reach the 'really liked it' marker, especially when I compare it to other books that I've said to have 'really liked'.For one, and this has been said a lot about this book, the protagonist was a pain in the ass. She was selfish and weak and pathetic. She constantly wanted to be saved by Travis or Harry or Jed, and yet she repeatedly shows a complete lack of emotion at others' problems and even the death of those she supposedly loved. I did feel her frustration when she was forced to choose between two lives that she didn't want, but it soon turned into resentment. Also, was she losing her mind? The author's style was confusing, was she trying to portray a girl slipping into insanity or just a selfish individual? And what was the feminist deal in the novel? The village is seemingly ruled by women, the 'Sisterhood', who make all the decisions for the village and it's inhabitants... but then it is the men who choose the women to marry and if they refuse they face a life of religion because they are suited for nothing else. Plus, the protagonist's constant search for male approval and even permission at times is cringy.Then there is the zombie issue. I've never been a fan of zombie fiction - slow moving dead people who can be killed with a sharp knife aren't my idea of a huge scary threat. Plus, I'm fairly immune to horror. My parents are horror fans and so they relaxed the censorship on scary films even when I was a little kid - the oversaturation at a young age has left me pretty hard to scare (with the exception of The Woman In Black). This meant I never gelled with the main element of the story, the unconsecrated never sent chills up my spine and the point of the novel was slightly defeated.BUT. The story is interesting, you want to know what happens. You feel angry and frustrated at times but this just shows that the story has absorbed you. And the non-scary zombies is just me, I'm sure this book would actually achieve it's purpose with many people and prove to be a very frightening novel.AND the title is pretty awesome."}, {"userName": "Yan", "userReviewDate": "Nov 30, 2008", "userURL": "http://www.goodreads.com/user/show/1350957-yan", "userReview": "“In Mary's world there are simple truths.The Sisterhood always knows best.The Guardians will protect and serve.The Unconsecrated will never relent.And you must always mind the fence that surrounds the village; the fence that protects the village from the Forest of Hands and Teeth.But, slowly, Mary’s truths are failing her. She’s learning things she never wanted to know about the Sisterhood and its secrets, and the Guardians and their power, and about the Unconsecrated and their relentlessness.When the fence is breached and her world is thrown into chaos, she must choose between her village and her future—between the one she loves and the one who loves her. And she must face the truth about the Forest of Hands and Teeth. Could there be life outside a world surrounded in so much death?”Review: I had high standards for this book. While the summary less than caught my eye when I first heard about it, I expected it to be captivating based off of so many positive reviews and awards. Sadly, I may be the few and the only ones who did not come to love this book. So just tally this up with The Hunger Games, and John Green, because I have a feeling I shall face many comments about my review (or will you all avoid this train wreck waiting to happen?)The Forest of Hands and Teeth had too much going on at the same time. The romance had no true beginning, it was a mess of nothing. It was mentioned that she craved for Travis, but no real background as to why. She later pushes through the story without explaining anything between the two. Mary keeps mentioning how much she loves Travis but yet, I saw no actual development between them. Yes. They had a few scenes where they connect but I feel like I still do not understand why they are so love with each other. Harry was, however, a better match I felt at times. Granted, not always but I got a deeper connection between the two (Mary and Harry) rather than Travis.This brings us to the characters. I thought that while Mary was the main character, she was one of the weakest. I felt that her drive, her motivation was superficial. She only thought of the ocean, of Travis, of her survival. To me, she was selfish. Granted, she may have some tenderness and care in certain scenes but overall I just was not all that fairly compassionate towards her. To say the least, the majority of the character I felt no true sense of connection. They either died too quickly before anything really big started, or they just fell. Hard. However, I did feel like Mary’s brother Jed, was great. I liked his depth, his emotions, and his desire. I love his need to protect Beth but also his reaction to the turn of their mother and how the situation was ironical similar.The plot in general I had issues with. The plot sounded wonderful but the execution lacked. The author tried to do too many things all at once. She tried romance, thriller, mystery, action, and adventure. This only created an awkward situation together. I felt if she focused on some of these genres then she would have succeeded, but for now, I felt she rambled on at certain areas trying to contain it all. It was only about how way through the novel did the story finally picked up—that the actual Unconsecrated (just a fancy term for zombies) attacked. Every now and then, there were golden scenes that was perfect and that was one of the starting points for me. Another was the Sisterhood and Mary’s short time confinement with them. I actually happened to love that. The secrets, the crazy loons, and the secret rendezvous. I guess what I love most about it was that Mary had more dimension while she was there. It was where it was mostly centered on one action or genre which made the most sense in my mind.The background information that the story provided was in the first half. I felt that it was great she (Carrie Ryan) included it all in there, to inform the reader of the world before. It gave great insight, great detail, and a better understanding of the village and the causes of the entire Forest of Hands and Teeth. However, I did felt that there some things in there that could have been taken off. Again, it was the ramblings that dragged the story on too long.The ending. It was, I guess it was an ending if you can call it that. I felt it was more of a hastily ending to keep the reader wanting more for the sequel. It was too abrupt, left too many unanswered questions.Besides all of that, the writing was beautifully done—great analogies, detailed descriptions of scenes, and a brutal and honest tone, albeit sometimes dull. Carrie Ryan created a post-apocalyptic world that fulfills every fantasy lovers dream. With its intricate world, detailed plot, and gruesome action, Forest of Hands and Teeth will captivate many.Overall: Sad and disappointed. Will still keep this in my bookshelf because it is a series, so that means I will hopefully read the next part and maybe a lot of my questions will be answered. Like the Luxe series, I’m crossing my fingers that this series will progress in a better direction."}, {"userName": "Cait", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/5254851-cait", "userReview": "Warning: some spoilers do run about freely in this novel; like carefree little bunnies. If you are afraid of spoilers and/or bunnies, do not continue on. Awwww! Sooo cute! Let's look at just  one  more before I start my review.Sooo..... Cute.... Kind of weird to see little baby bunnies if you know what this book is about. Probably just my ADHD kicking in.Bunnies..............Ahem...... alright, so before I get to what I didn't like about this 3.5 star book, let me start with what I absolutely  adored:  Mary is fucking badass, plain and simple. I can't even use nice words to describe her because; really, it would be an insult to use anything less. Just one example of many of her total badassery is when they make it to the next village over and climb into a house where they thought they would be safe. It never seems to work out for Mary, though, and zombies start bashing in the door, windows, and swarm inside, but she can't make it up to the safety of the attic in time. So do you know what she does? Instead of cowering there and dying in what looks like a lose-lose situation, she goes and grabs a freaking axe and starts running around, whacking zombie's heads off, and making them like they're a bunch of pussys for even stepping into the room with Mary and her Axe of Death. Then towards the end of the book, when all seems lost yet again; Mary, instead of letting fate do with her what she wished, takes that fucking bull by the horns and jumps into the river (which she had really know idea what was in there or what would meet her at the end) that eventually leads to her safety. Long story short, Mary pretty much screws fate. If she's going to die, she's going to do it on her own terms, hopefully still survive, and damn anyone or anything else that gets in her way. And was this book ever scary. Ryan wasn't going to shy away from the blood, guts, and gore; which I was definitely happy about. She was kind of like her own character, in a way. If you didn't like the content that was in the book, then screw you and don't read it. We need more YA dystopian fiction like The Forest of Hands and Teeth and The Near Witch that isn't about some weird government that's obsessed with love-pairings or separating people into factions of society based some really weird, abstract emotion or opinion; which just about what everyone copied after The Hunger Games. Maybe it's just me, but I like it sometimes when the government isn't some huge, global, power and it's just set in these small villages who are hiding a lot more than previously thought, like The Near Witch and The Forest of Hands and Teeth. Another thing that I really did enjoy about this book is how deeply you could feel the agony and throbbing longing from Mary, because it follows her around like the plague. I'm going to come right out with it and say that this is not a happy book; not even the ending is exactly your picture-book happily ever after. Many books that you read who try to do the same thing you just never really connect much with because either the characters comes off as whiny or unemotional. Damn, though, Ryan must have been an amazing tightrope walker in a former life, because she pulls it off  perfectly.  Mary is an unemotional robot when she needs to be in order to deal with everything that is happening to her, but then Ryan keeps on adding that deep need for the ocean and to have a life other than the one that she was born into; I really connected with her in that retrospect. Sure, she may be Mary with her Axe of Death, but she still has feelings, hopes, and dreams just like everyone else, and that's what made her a special character for me. One of the feelings that I didn't like, that I thought ruined the book somewhat for me, was her conflicted love feelings between Travis and Harry; it just halted the flow of some otherwise  great  scenes because all of her other thoughts-the ones I wanted-were swamped by those two. And I'm not saying that I didn't like the characters; not at all, but I thought it would have been better if a love-triangle hadn't been introduced. Maybe one of the two guys could have been the love-intrest, and the other one just a friend who *gasp* didn't have feelings for her like many books seem to think is what happens. Let me tell you one thing: I have guy friends, and not every single one who knows me, and many have for years, are hiding some secret, all consuming love for me, and although Ryan's wasn't nearly as awful to read as many authors; it was still there, so I had to mark it down. The only other reason why I didn't like it was the prose and style. Sometimes, I just couldn't follow as well as I wanted to, and, trust me, I  wanted  to. Desperately. I had to re-read several parts just to understand what happened sometimes, and at first I didn't mind, but it just really started to wear down on me as I continued. Again, that might just be me; I read it a while ago and I could have read it in the middle of the night or something so that could have caused my re-reads, but it happened enough that I don't believe that it was a coincidence.Sadly, I also found the ending a little anti-climactic and too short. I wanted to see at least a little bit of what she experienced in the ocean town and how she felt after all that was done; maybe experience a weird sort of PTS after all that she experienced, but it just.....ended, and I know that the next book doesn't really continue her story, so I was kind of disappointed.So, in the end, I would still recommend this book to my fellow goodreaders if you like dystopia, guts, gore, and badass female characters with Axes of Death, but if you really don't like any of those things; then this won't be your cup of tea. Before I end this review, I'm going to impart upon you a picture of  one  more bunny before you leave this review, so here we go:Bunniessss......"}, {"userName": "Arlene", "userReviewDate": "Apr 10, 2009", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "I really wanted to like this book because the premise sounded interesting and somewhat original and it was recommended by one of my fave authors. I was looking forward to being \"creeped out\" as some of the reviews said would happen. Well, I wasn't creeped out and I didn't care for the book at all. Mary lives in a confined village surrounded by fences to keep the Unconsecrated out. The Unconsecrated are zombie like beings that thirst for human flesh/blood. They came after The Return which brought the demise of civilization through an undead plague. Weird? Yeah I agree. The story seems a little too choppy and maybe that's why it didn't take over my imagination. For example, how did they become infected? Where did it start? What's the back story on Mary's village and how did they come to be? What happened to Mary's parents? Gabrielle? The meaning of the numbered gates? I was a little confused, so I just plowed through it to finish it. There was one scene that I found disgusting and unnecessary. The Unconsecrated baby that Mary found in the crib. What she did was disgusting IMO. Overall, I don't recommend it. There's better books out there to enjoy. Don't waste your time."}, {"userName": "Liz", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/14811808-liz", "userReview": "The name of this book... When I read it I knew I had to read this book! The name was just promising...After finishing the book I was like: Promising name, beautiful cover...and a lame plot with lame characters inside. I was more than just disappointed in the end. The plot is not thrilling, neither is it creepy or fascinating or dark. It is long-winded, somehow depressed and the protagonist is annoying. Too many question stay unanswered in the end, the write style is boring and it feels forced...Maybe the second book is better, I don't know. But I doubt that I will read the second book. This one was depressing and boring enough..."}, {"userName": "Charlie", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/68156989-charlie", "userReview": "Nooooo!!!! I had such high hopes! WARNING: This is not a review! This is me ranting and pouring out my all too many emotions at 1:00 in the moring!I did not finish this, and ended up just flipping around pages to see what would happen. Okay, pretty sure everyone is dead by the end of this book, no lie. And I know who Mary \"ends up with\" in the end. But guess fucking what??! Everyone's dead. DEAD DEAD DEAD!!!!! This book could have had sooooo much potential!!!! Had the romance not been a complete crapptastic catastrophe, I would have continued reading, loved it soo fucking much, and then cried to the point of my eyeballs drying up and falling out of my god-damn head, once he died!Harry!!! I got some flash back moments of him and Mary, but for some bullshit reason, she'd rather have Travis, Harry's brother, boning her instead!!! I got nothing, nada, of Travis, but she still pours all her love towards him!?!!? WTF??!!???!! I wanted a slow-burning, heart-wrenching, sub-plot romance, but that is NOT what I got!!! Then things started to get good, what with zombie action, and I thought Mary could grow to love Harry, but NOPE! In comes boring, pointless, lump on a log boy- I bet you know who it is. Travis!!! *insert squelching noises of me gouging out my very much moist eyeballz* He had no substance, no character, he just \"loved\" Mary, but I have no idea why!!! There is no foundation for the two of them!! It's like in minecraft, and you can place blocks in mid air, with nothing stabilizing them on the ground, but somehow it stays up there, therefore deeming it UNREALISTIC!!! Just no. Uh uh. Stop it.From the way Mary describes Harry, and her memories of the 2 of them, you'd think her feelings were aimed towards him. But no. I don't understand! Someone please explain this craziness to me!!!You're probably thinking, \"Charlotte quit being a whiny, little biotch, and stop just honing in on the romantic elements.\" Well, I could if that wasn't the majority of my damn narrator's thoughts! There were times when Mary wasn't drooling over Travis, and that was nice. There was even a sorta, kinda, not really moment with Harry, which gave my heart a lil' flutter, but that was all. That part just made me even more depressed, because I got the feels of something that would never fucking happen!!!! Does anyone understand how I feel??!!!?!!?!Anyways, I am truly happy for (and extremely jealous of) you if you were able to enjoy, love, whatever this book! I just couldn't push on just to be extremely disappointed by how it continues and ends.P.S.Ahhh!! I'm not okay!! I know I sound really angry in this \"review\" but in reality, my heart is breaking in two over what could have been:'("}, {"userName": "Lucy", "userReviewDate": "Jun 01, 2010", "userURL": "http://www.goodreads.com/user/show/3813315-lucy", "userReview": "This book dedicates the first third of it to a complicated love triangle/square and the set up of a society that's completely disregarded for the other two thirds of the book. The love triangle is complicated and oh so important. The main character has barely another chance to find a mate before she's tossed to the nuns who are cruel and mysterious. Breeding is also extremely important. Producing children is the main goal for everyone. She's in love with one brother but the other brother has spoken for her... AND THEN nothing happens. I can't even describe how quickly all those important things are utterly abandoned. The author forgets she's structured a society and removes you from it and the love story for a run through the woods. None of the big secrets the main character asks herself are ever really answered, which makes you lose faith in the author because she clearly didn't have the answers for herself. She just kept shoving the story forward without a direction or real, viable characters. It was just gore, running, gore - which I'm not against. I love horror movies, but I expect a lot more out of a book. The zombies are flat and unalarming. Frankly, I wouldn't have cared if the lot of living characters got eaten. The main character was shallow, selfish, flighty, and utterly dimwitted... none of which were intentional. You were supposed to think she was brave and fierce. Really, she was just selfish and none too bright. She costs just about everyone dear to her their lives. It was ridiculous and I got fed up. I can deal with a lot but when I want to kick the main character in the face repeatedly I am not doing the sequel."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Mar 11, 2009", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "3.5/5.0 stars.Why Not a Higher Rating?*Ultimately this was a rather unsatisfying read for me. It took me a while to get engaged in the story, and to care about the characters.*When that finally happened, then things got rather tragic. I realize that it wasn't Mary's fault, and she showed true heroism, but part of me wanted to blame her for how things unfolded. Probably not fair, but kind of how I felt.*Mary was a bit too wishy-washy for me. She wanted Travis more than anything. No, she wanted to leave to find the ocean. No, she felt really close to Harry. What did she want? Maybe I'm being hard on her, but I just found her frustrating. *The secondary characters seemed kind of one dimensional. The only person I saw clearly was Mary. I don't think that can solely be blamed on the 1st person POV, either. Honestly, Travis came off as wishy-washy, and less than reliable in his affections. He was the man of Mary's dreams, but he wasn't strong enough for her. He knew that though. We don't really find out what makes Travis tick until too late in the story for my tastes. Before that, he was too far in fickle-land for me. Harry had some really good traits, and I would have liked to see more of him in the narrative. I realize that Mary is all about Travis, so I can see why Harry doesn't get much screen time through her eyes, but since they were best friends growing up, I could have done with more filling in of his character.*We are never told some aspects of the setting. I felt there was good detail in some instances, but a decided lack in other ways.*But, I think the number one factor in my rating is the feeling of disatisfaction I had after finishing. I wondered what the point was. That hope means nothing in the end. Sacrifice ultimate counts for absolute zero? Yeah, not my kind of novel theme.In all fairness, I think Ms. Ryan is a good writer. Her writing has an elegance I appreciated. I couldn't put this book down, although some aspects were a bit off-putting. She does zombies well. The focus on the emotional horror of zombies, and its cost on the hearts and souls of those who face this epidemic, instead of the gross-out factor. I really appreciated that, and I certainly had some hold my breath moments. I think that I would have enjoyed this story more if there was a more focused feel to it, as if the destination I was headed to counted for more than it did. If I feel this way, than I can only imagine how Mary must feel."}, {"userName": "Carol (StarAngel's Reviews) Allen", "userReviewDate": "Aug 26, 2014", "userURL": "http://www.goodreads.com/user/show/6294320-carol-starangel-s-reviews-allen", "userReview": "WTF......WTF......WTFI don't know if I can rate this book right now.....I'm fuming....I'm ready to throw this fucking computer against my cubby (if it didn't belong to my work).How could this possibly end this way??? Well, it wouldn't have mattered it there was a fucking sequel but ...... what is that? NO NO NOI go to the next book to read the synopsis...and it doesn't mention Mary (even though I hated her)- NO instead this is more of a companion book....So....we are left with:What happened to Mary?Is Jed dead or alive?What happened with Cass, Harry, Jacob and Argos?WTF, man....I'm so disappointed right now....UGH so many unanswered questions!Maybe after I calm down I'll come back and rate it."}, {"userName": "Nikoleta", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/13362307-nikoleta", "userReview": "Μόλις τελείωσα το \"Το δάσος με τα χέρια και τα δόντια\" κ πραγματικά μου άρεσε πολύ. Για την ακρίβεια δεν μπορώ να καταλάβω γιατί δεν έχει μεγαλύτερη βαθμολογία από τους αναγνώστες του. Έχει έντονη δράση, γρήγορη πλοκή, αγωνία, προσεγμένη υπόθεση, μυστήριο και καλοφτιαγμένους χαρακτήρες, πολυδιάστατους και με βάθος. Διαβάζεται γρήγορα και ξεκούραστα. Είναι πάρα πολύ καλό και το προτείνω σε όλους τους φαν της δυστοπικής λογοτεχνίας."}, {"userName": "Kristi", "userReviewDate": "Aug 03, 2008", "userURL": "http://www.goodreads.com/user/show/1310688-kristi", "userReview": "I’ve been trying to write my reviews soon after I read a novel why the emotion of the story is still fresh within me, but with The Forest of Hands and Teeth, I needed a few days to digest. I particularly enjoyed this novel. The writing was beautiful, it was one of the best written novels I’ve read in a while. The plot itself, while it did remind me of a mix of the movies The Village and I Am Legend, I still found it to be original in context. It was captivating and suspenseful, I had a very hard time putting this novel down. Carrie Ryan has crafted an outstanding debut novel. The depth of Mary’s character was also uniquely portrayed. You almost feel the anguish and entrapment as much as she does, although at times I felt she was a very selfish character.There were so many questions that were left unanswered, some that were touched upon, but not fully divulged. Although the theme of hope was mentioned several instances in the novel, I found the emotion lacking. If anything I thought the novel was depressing. Impressive, but depressing. I mean it is a zombie apocalypse! You can’t really be too happy about that. I also wasn't too happy with the ending, I think that is my biggest complaint. Overall The Forest of Hands and Teeth is a notable debut novel. I will absolutely be tuning into the future works of Carrie Ryan."}, {"userName": "Flannery", "userReviewDate": "Apr 12, 2010", "userURL": "http://www.goodreads.com/user/show/652877-flannery", "userReview": "This book is the embodiment of so many things I hate. Here are some examples:1. The movie, The Village, by M. Night Shyamalan. I could rant about that piece of trash for hours. If you hated that movie, you will hate this book2. Creepy religious groups3. Nuns that remind me of the Nurse Ratched character from One Flew Over the Cuckoo's Nest4. The fact that, even though this story presumably takes place sometime in the future, people have reverted to quasi-pagan ritual practices5. One girl, two guys in love with her. (brothers!)6. It seems to me that if you could kill those *&^$ers, YOU WOULD BRING A LOT OF AMMO/ARROWS/WHATEVER to kill them! Where are the guns? This is in the future! Why do they only have axes and arrows? This technology is not lost.7. Do the Unconsecrated have to be decapitated to die? We don't know because it is never really explained. And, if yes, why the frak are they shooting them with arrows?8. This book has no ending. I will read the Wikipedia entry for the following book/s because I don't think I can bring myself to keep reading."}, {"userName": "Morgan F", "userReviewDate": "Dec 24, 2009", "userURL": "http://www.goodreads.com/user/show/2941288-morgan-f", "userReview": "I was really excited to read this book when it first came out. But being short on money (like always), I had to wait an entire year for it to come out in paperback. You should have seen my face when I spotted it's cover at Borders. It immediately went to the enormous pile I was lugging around (sadly, I had to put half the books back, because it would be called stealing otherwise). This book is told from the perspective of Mary, a young woman growing up in a small, isolated village surrounded by a fence that keeps the unrelenting zombies out. But they are not called zombies in this book (in fact the word zombie never mentioned), but rather the Unconsecrated. Trust me, they are true zombies. They eat flesh and babies and everything. Anyway, Mary grows up believing that her village, run by the dubious Sisterhood that claims that their little pocket of humanity amidst the formidible forest is the last of mankind. Mary, of course, questions this and is not content with her future as a member of the Sisterhood or married to man she doesn't love. Instead, she dreams of the ocean and the other stories her mother used to tell her of generations long gone. From the first chapter, Mary's life is turned upside down. Her father walks among the dead, and her mother goes to join him. She is turned away by her brother and is sent to live in the Cathedral with the Sisterhood, which has well-kept secrets in every room. This book is very well-written. Fluid and suspenseful, I had a hard time putting it down. While it did have some zombie-slaying action, it wasn't the focus of the book. Instead what kept me going was the sense of mystery and doom. Nothing good ever happens to Mary and the questions just kept coming with little-to-none answers. Mary was an unreliable narrator and a little crazy. All what the reader sees is first filtered through her eyes. She selfishly clung on to her dream of the ocean and refused to settle for anything less, even when it cost her the people she cared about. But hey, she is still one of the few chracters alive at the end, and the only one with a chance at a life, so she must have been doing something right. The rest of the characters wouldv'e gotten eaten long ago if Mary wasn't there to drive them.This book is severely creepy, what with zombies relentlessly moaning in the background. I got skeeved out in a couple scenes (zombie baby). Like I said earlier, nothing good really happens at all. This book isn't for the faint at heart as it can be somewhat depressing. But I still found it intelligent and refreshing. It's so nice to read a young adult novel without a saintly narrator and a perfectly happy ending.My least favorite part of it though was the love triangle? rectangle? I don't know what to call it. But the gist of it is Mary is in love with Travis. Travis is in love with Mary, but is engaged to Mary's best friend, Cass. Cass is in love with Harry, but Harry is engaged to Mary. Harry likes Mary, but I wouldn't call it love. I think he just wants a wife. Oh, and Travis and Harry are brothers. It's just a mess of duty and love. No one wants to marry who they are supposed to, but feel like they have a duty to do so. So, its complicated without ever being really interesting. I never really saw what was so great about Travis. Mary nursed him and her previous crush on him turned into full out love (or so she says). This might sound weird, but I could never tell when they were kissing or not. The scenes between them were written oddly, and I kept thinking they were kissing, but later on in the page I was proved wrong. Their lips were just really close together and they were almost kissing. My bad.Anyway, despite some personal preferences and little annoyances, this book was really good. Not for everyone, but I recommend everyone try it. I'm sooo looking forward to The Dead-Tossed Waves, where some questions might finally be answered."}, {"userName": "Sarah Mac", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/4490376-sarah-mac", "userReview": "Suffice it to say I was underwhelmed. While I don't read many zombie novels, I do watch a lot of zombie movies. And alas, I have to say this particular story doesn't stick in my mind. One thing I do know: Mary is a fine example of the uber-selfish heroines that are common in YA, particularly paranormal/dystopian fiction. I'm fine with reading a selfish, unpleasant narrator -- but what I don't like is when selfishness is portrayed as a positive trait. Selfishness isn't mental strength. As with many other YA heroines, I was rolling my eyes at her navel-gazing. It's not always about you! ...Except, apparently, it is. Why are these two brothers so madly in love with her? Why is she so special? I didn't see any outstanding features in her personality, unless you count obsession with the ocean & an extreme aversion to contentment. She's determined to be unsettled in whatever choice is offered -- simply because it isn't the ocean. The ocean is her religion, her idol, her emotional talisman. It gets old really fast -- mostly because everyone in her life ends up dead or emotionally maimed by her refusing to accept that she can't have her cake & eat it too (by the ocean, natch). Even at the end of the novel, she's driven by her own desires. She's learned nothing about that eternally appropriate Vulcan mindset: the needs of the many outweigh the needs of the few (or the one :P). People continue to throw themselves in harm's way to protect her, & it's not until they're dead that she has a glimpse of how she's trampled them to chase her selfish childhood dreams. But then she remembers the ocean & off we go. What good is a beach? How will a beach help them survive?! As one character dares to contradict her, it's not as if they can drink the water. And yet everyone follows Mary to see the ocean because....why?? As I said, I couldn't unravel their devotion.Instead we're subjected Mary's constantly rehashing her love triangle -- and her craving to see the ocean. The ocean drowns most potential subjects of mental conversation, including important ones such as Why can't I manage to look beyond myself for two minutes together? or How can I indulge my angsty love triangle analysis when we're in a life-or-death situation? or What gives me the right to withhold potentially important information from my fellow survivors? That's precisely what the Sisterhood does & I despise them for it -- but when I do it, it's because I know better than to offer false hope. *facepalm*These questions are never answered, at least to my satisfaction. Whether that's to lure the audience into reading the sequel or an example of \"sort it out yourself,\" post-mod storytelling, I'm not sure. All I know is that it annoyed me. Comes to that, very few of the questions in this novel are answered. The Sisterhood is never explained. Gabrielle's story is a mystery. The village's fate is left open. Jed's fate is never clearly defined. The remaining survivors are (quite literally) left at a fence in favor of the ocean view. It's a supremely unsatisfying book in that regard. (And what's the deal with present-tense narration? I can stomach first-person-present in certain circumstances (mainly short fiction), but this wasn't one of those times. The first-person tense added no immediacy to the story.)There were a few things I liked. The isolated village had intriguing social dynamics & the Sisterhood was an interestingly sinister twist on conventional religion. The descriptions of zombies were vivid. I liked Gabrielle's repeated appearances. I liked Harry & Jed (bonus points for Harry finally telling her she was selfish); I also appreciated that the dog survived. ...But I won't be reading the rest of the books."}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "It's Zombiefest July! I've been reading zombie books with my MacHalo sisters and felt I needed something a little more, so decided to read this one on my own, in-between other reads.It's the end of the world as we know it. Civilization has long been decimated and no one knows about things like skyscrapers or oceans anymore. All that is known is the forest. The forest is where the \"Unconsecrated\" are. They have pretty much taken over the world and people have been forced to build huge fences and whatever other types of fortresses they can come up with to keep the \"Unconsecrated\" out. Mary's village reminded me of the M. Night Shyamalan movie The Village.The Sisterhood is sort of like the law and also provide spiritual comfort and guidance. But they're secretive and a little, well, some of them are just plain old bitches. Mary is one young girl who lives in one of these villages, surrounded by a fence the Guardians must patrol and maintain. Her best friend, Cass and two boys they grew up with, Harry and Travis are about to get married. Only the boy Mary wants is pledged to someone else. And their lives are about to get ALL fracked up.I won't go into the story anymore, but WOW! I loved this. My feels got all crazy and I even CRIED!What a GREAT zombie book. At first, I felt like Mary was really meh and then she turns out to have some smarts and spunk in her. At times, it was a bit annoying to be in her head because she obsesses about one particular boy and her dreams of finding the ocean. I'm deducting one star because I did have to skim a few paragraphs were she kept going on and on about her romantic life. She gets all like this about the guy she wants:But thankfully, those sections didn't go on endlessly. This is more of a plot driven story than character driven, so the characters weren't fleshed out all that great, but it works for a book like this. I thought it was an excellent, creepy, dystopian zombie book. I tore through this and it was a page-turner. I am so going to read the rest of the series!"}, {"userName": "Merna ", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/16392157-merna", "userReview": "I still haven't finished reading this book. But I felt it would be necessary to write as I go along reading the ‘Forest Of Hands And Teeth’. Just to make the book to some extent more bearable. Props to the writer who faintly has beautiful way with words, but also has a way with boring me to tears. Yet, I can't tell if I'm bored stiff because of the way it’s written that causes my eyes to go heavy with sleep, or if perhaps it’s the plot. It could be the characters in addition. Or, possibly it’s all three combined together to make tremendously dreary story. Here’s a little blurb about what the book is about.The forest of hands and teeth is about a village under the leadership of the strict and enigmatic sisters. This village happens to be surrounded by zombies who continually attempt to break through the fences in order to devour the people. Mary’s great-great-great-great-great grandmother saw the ocean and her story has been passed down five generations. This becomes Mary’s bothersome and egoistic dream to see the ocean. Wait, sorry did I say that was a blurb or the WHOLE plot? It’s puzzling because I truly can’t tell the difference between the plot and the blurb. You can almost just predict what's going to occur in the story from merely the blurb. Fence + Zombies = that adds up to them finally managing to break through the fence, suddenly... doesn't it?Mary + her ocean dream = her going through a boring journey to see the ocean.I want to introduce to you the most selfish character in the book.Of course it is none other than the main character Mary.Here are some quotes to support my point. “Going down that path would kill us all, Mary,” Cass says. “You're selfish to want to sacrifice all of us for your own whims.” (Thanks Cass for pointing how much a selfish bitch Mary is). “You are a Guardian. Killing the Unconsecrated is what you are trained to do. You've put us all in danger by keeping her alive. You know the rules.” (This is what Mary says to her own brother to convince him to kill his wife. She says as if it was so simple). “I have known love,” I whisper, as much to myself as to my brother.He lifts a corner of his lips, almost smiling. “You can't ever have known love.” I am about to protest when he holds up a hand to stop me and continues, “Because if you had you wouldn't be telling me to kill my wife as if it were an easy choice.” (You just got slammed Mary). Cass (her best friend) is sobbing because virtually she has lost everything in her life. Travis attempts to comfort her, while Mary stands there getting jealous because he is. I have nothing against selfish characters. It makes them human. But Mary is just abusing how selfish you can be. I’ll finish the review after I complete the book. If I can. *EDIT*Okay, I'm officially through with this book. I've lost all hope for finishing it. Mary was growing out to be a little bit more selfless, but it wasn't sufficient to make me continue reading the book. Here’s a random quote:\"Travis, whose breath I measure as we sleep, whose heartis the cadence to my life.\" *gag* I don't know about you Mary, but if I was being haunted or tracked by zombies, I would try to save my energy to fight them off the next day if they ever attack. I wouldn't be wasting my sleeping time measuring someone's breath. Edward much? I also realized the two characters can’t take responsibility for their own faults and blame God constantly for their obligation. One of the characters slipped and fell. He thought it was god’s punishment for being unhappy with the choices he had made (What choices? Oh you mean the ones you never really made). Mary is too selfish to comprehend it was her mistake and not god. It’s ironic because she doesn't believe in god any longer, but she blames him still. I dislike characters who can’t take the fact it was their responsibility and no one else. I found out what happened at the end. WORST ENDING EVER. Completely done with this book."}, {"userName": "Misty", "userReviewDate": "May 03, 2009", "userURL": "http://www.goodreads.com/user/show/1124284-misty", "userReview": "This seems to be one of those books that gets really mixed reactions. I've read more than a few rants that complain of the writing style (present tense), the love aspect, the originality aspect, and Mary herself, saying she's selfish and unlikeable. And most of the things that seem to bother people about this book help me to love it.I found Ryan's writing beautifully and painfully evocative, and the present tense lent an immediacy to the narration that really worked. There are times when the things that Mary says in the novel are so perfectly phrased as to make me actually stop reading and just dwell on them. I could see everything so clearly, and sometimes just ached with it. It was lovely in a heartbreaking way.Much like the romance between Mary and Travis. I loved every moment of that, and bought it all. This bit is a teensy bit spoilery, so if you haven't read it, look away.I know there are people who find the relationship unbelievable, and think that Mary was selfish for a) choosing Travis over Harry for no reason (? did they read the same book I did?), and for feeling like there was something more even than Travis. I understand why people were frustrated by this and thought Mary selfish -- so many people read YA for the easy romance and the lies. I hate to say it, but it's true. I respect Ryan so much more for not making things easy like that. I absolutely loved that, although Mary loved Travis, she realized there was more to the world, and since she lives in a pretty effed up world, there most certainly is. Mary is a woman on a mission, and she doesn't let anything sway her from that. It's a bit maniacal, maybe, but understandably so, and it makes for a much more complex, nuanced, adult novel than people typically get from YA. I appreciated that. Same goes for the ending. Some people were really upset about the lack of resolution in the end, and I personally loved it. (And even though I know there is a sequel (and 3rd!), and fully intend to read them, I would have been content with 1 open-ended but powerful book.) It would have been a cop-out to have everything wrapped up neatly. I like a book that makes you wonder and makes you think, and even that makes you uncomfortable. It means the writer was working and doing their job, not just churning out some schlocky mess for $$.This isn't to say I thought it was a perfect book. There were times when the prose was a bit purply, and I was worried on occasion that it was about to go over the top. I originally rated it a 4 on Goodreads, but as time passed, I found myself craving it, and thinking about Mary and the things she went through, the choices she had to make, and respecting it more and more. It's one of those books that I know I will reread and appreciate in different ways, but that I would reread even if that wasn't the case, just to get back to the beauty of Ryan's writing."}, {"userName": "Angela", "userReviewDate": "Mar 11, 2009", "userURL": "http://www.goodreads.com/user/show/1027031-angela", "userReview": "I can solidly say that my acquisition of The Forest of Hands and Teeth is entirely the work of John Scalzi's Big Idea posts that have been prominently featured on his blog. This book was just recently featured, and as soon as I saw the post go up I knew I had to check this one out. I don't read a lot of YA, but this one had all the right elements for me: a young heroine anxious to explore beyond the confines of her restrictive world. A post-apocalyptic setting, where what's left of humanity has had to cobble together a civilization out of the ashes of the old. And, most importantly, zombies!Because, as I have expressed before, I do love me some zombies.But here's the thing. This is a zombie novel, yes, but it's an oddly haunting and lyrical one. The title alone captures this and is in no small part what drew me to the book; then, too, you've got the cover art. Mary, the girl on the cover, stands looking pensive in front of a bleak woodland. This captures the mood of the book perfectly, because this story isn't about the zombie outbreak; it's about the tiny society that's arisen seven generations after, and the few remnants of the pre-outbreak life they've managed to cobble together into a village. What happened to create the Unconsecrated, as Mary's people call the zombies, is never called out. Instead, the zombies are a constant background detail, a shuffling, shambling mass of unlife beyond the fences that surround the village.Mary is the heart of the story, a young woman who's grown up on her mother's tales of the ocean, which no one in their village has ever seen. When Mary loses her mother to the Unconsecrated, it puts her on a path between having to decide between two young men, challenging the long-held secrets of the Sisterhood that rules her village, and ultimately, to finding that mythical ocean. It's an excellent story overall and well worth checking out for YA and adult readers alike. Five stars.ETA 11/3/2014: On a reread I find that yep, I still like this story a lot. I have a couple more quibbles with it than I did on the first read through, but I was very happy to revisit it by way of preparing to read the rest in the series."}, {"userName": "Michael", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/1036930-michael", "userReview": "Can we talk about zombies? I mean, let's really think about these guys for a minute, because the whole idea of zombies is where my problems with this book begins. I for one am not concerned about the zombie apocalypse. And, if it happens, I have complete faith we can kick the asses out of some stupid, slow versions of ourselves. We'll start with the basic idea of a zombie. Theoretically, these are corpses that get up, walk around, bite people and infect them. Great! Those will be really scary for a little bit. But what is causing them to rise? Is it a disease that only affects humans? Okay, lets assume it is. IF THIS IS THE CASE, all of the dead bodies that are ALREADY dead will NOT be attacking anyone. Thus, we have to contend with people who are infected and dying in the present, and who will decompose. After all, there's no logic to the assumption that zombies just don't decompose. Do maggots not want to eat them? Are they impervious to the elements of rain, wind, dust storms, cold, heat, and everything else that makes living people uncomfortable? NOBODY who is arguing FOR zombies can use logic and argue that any of these things could be the case. It makes no sense at all. These motherfuckers would be falling apart left and right, and after about two weeks, the original batch would be non-existent.Okay, maybe a month.On the other hand, perhaps the already-dead humans will raise up. As I've ranted about before, this makes no sense, because dead humans are simply decomposing matter, just like dead dogs and dead trees and the non-silicone parts of Michael Jackson. If dead humans start walking around because dead matter is getting reborn, we're also going to have dirt golems and sentient dead trees, and shit is gonna get really ugly. We'll be fighting against our own dead cells that are trying to eat our living cells, and we will simply be screwed. Thus, zombies won't even matter in this scenario. Thus, as my very scientifically grounded argument illustrates, dead bodies will not all start digging their ways out of the ground as zombies. So we'll stick to the disease hypothesis. The idea of zombies getting up and walking around and actually being a long-term threat doesn't make sense. In fact, I think it's a stretch to say zombies are a global threat on even a short-term basis. . . zombies taking over the world requires faith in what is basically a pyramid scheme: one zombie bites three people, each of those people bites three people before they get decapitated, and eventually the hordes of zombies overwhelm the normal people. We all know pyramid schemes are bullshit because eventually some people just don't follow through with it. One group of marines or ultimate fighters kills off 90 of them. A bomb blows up hundreds. We can't say exactly what factor will keep the scheme from working, but we know from experience dealing with people--ALIVE ONES with functioning brains--that pyramid schemes don't work.So, I have a lot of trouble buying this idea that zombies will become some huge threat if they are (a) only raised after an infected person comes back from the dead; (b) relying on a pyramid scheme to take over the world; and (c) slower, stupider versions of humans. As we have seen in many wars in the past, numbers matter less than strategery. And if there's one thing we humans have figured out how to do in our many years of living on this planet, it's kill other humans. I mean, c'mon! With weaponry from five hundred years ago we could handle any zombie uprising we come across, unless we ignore the zombies until they have swept through more than half of the human population. Since this is highly unlikely in the age of blogging and ratings-governed news coverage, I again would like to point out zombies will NOT be a problem.When it comes to this book, though, these problems get even more accentuated. We're starting the story many, many years after the zombies first started attacking people. They're on the other side of a frickin' chain link fence, moaning and lumbering, as zombies are wont to do. Why have we not simply started stabbing them all through the head with sharp sticks through the holes in the fence? Why don't we fight their pyramid scheme with one of our own? If everyone goes out to the fence every day and stabs two zombies in the head, eventually none of them will be moaning and groaning around our village. It doesn't totally end the problem, but that's where protective body armor, helmets, and artillery comes into play. Zombies don't know how to engage in guerilla warfare, but we do. These zombies--in case you've forgotten--are trying to kill people with their teeth. Their fucking TEETH. If some random-ass dude comes at me with his teeth, I'm gonna come at him with something OTHER THAN MY TEETH. . . basically any weapon wins against teeth. . . and I'm going to win. If this person also doesn't have a functioning brain, I'm guessing that will bump my chances up even further. So, there's THAT logical hole. Even if zombies have a heyday because of a ridiculously successful beginning--for instance, the disease starts simultaneously in several places that don't have oil, and every zombie is very diligent about biting three people before getting decapitated--they're gonna be less of a long-term threat than the Spice Girls. We're going to suddenly recognize that we ought to be killing these slow, stupid humans, and we will develop strategies for doing so. My vote in the contest between smart, fast humans and slow, stupid ones has always been on the former. This is why I'm not a Cardinals fan. Zombies are a fun kind of mob for characters in horror movies to fight, and it's fun to watch these people get torn apart in hilarious ways. But when the idea of zombies is converted into a book that tries for more than just slasher goofiness, the holes in the whole theory start to pop open like holes in a maggot-ridden corpse. Thus, I must admit I was much more critical while reading TFHT than I have been when watching Dawn of the Dead, Day of the Dead, Night of the Living Dead, High Noon of the Dead, Tea Time of the Dead, and a variety of other influential zombie flicks. However, I feel Ryan's attempt to place the events in this series quite a bit after the actual zombie apocalypse begs her audience to ask these questions about how possible this whole scenario really is. And, following my usual pattern of ranting for a long time and then briefly mentioning the book in question, here are a couple other thoughts on The Forest of Hands and Teeth: it's appropriately eerie, and an entertaining read. However, the secondary characters are only occasionally likeable, and this is a problem that carries over into the second book of the trilogy. Although you don't necessarily want these people to get eaten by zombies, you do kind of wish many of them would abruptly depart from the storyline so you didn't have to read about the annoying things they're saying/doing any longer. And the series suffers from a thematic issue that most zombie literature is likely to struggle with: in a world where humanity has been bested by stupid, dead versions of ourselves, how can you give your reader a genuine sense of hope?"}, {"userName": "Shannon", "userReviewDate": "Jul 14, 2009", "userURL": "http://www.goodreads.com/user/show/2016128-shannon", "userReview": "The Forest of Hands and Teeth instantly reminded me of the movie The Village and it also made me think of the movie Dawn of the Dead as well. But even if you didn't like those movies or never saw them, don't let it detract from wanting to check out this book.Mary, the main character, lives in a village some time in the not-so-distant future where civilization has been set back by hundreds of years, because of something called \"The Return.\" The village is surrounded by a fence which holds back the Forest of Hands and Teeth. Within the forest are Unconsecrated, or really, zombies. The inhabitants of the village live their lives while the Unconsecrated moan, push their fingers through and shake the fence. But Mary has dreams of the ocean. She remembers a photograph that her mother showed her of her great-great-great grandmother standing in the ocean. She can't shake the image and she longs to see it for herself. But leaving the village means death or becoming another of the unconsecrated so Mary has to be content with dreaming.Until the fence is breached and she's forced to leave the village and survive.This novel was at times frustrating, heartbreaking, and horrifying, but it's one of those books that you just have to read that next chapter to find out what happens. That part that was frustrating for me was the first part of the book when Mary is still in the village. Women have two choices; either be spoken for by a man or join the Sisterhood. If a man doesn't speak for you, you default to the Sisterhood. The Sisters and the Guardians are a bunch of Puritanical crazies, but I can see how they'd want to create order in a small village that could be the last of humanity.There's a heartbreaking love story told throughout this book as well. I can't really say anything without giving something away, but this aspect of the novel really adds something to the story and it makes you care that much more for the characters.There's a lot of gruesome parts to this book and if you're squeamish about decapitation and things of the sort, you might want to look for another book. It's not too graphic, but there are some disturbing scenes.At the end, there's still a lot of unanswered questions. This chapter of Mary's life has ended, but her story is not over. Now I can't wait for The Dead-Tossed Waves. I read the description, don't read it unless you don't mind spoiling yourself, and it sounds just as good as The Forest of Hands and Teeth. There aren't that many zombie books around, but this is definitely one of the best."}], "description": "In Mary's world there are simple truths. The Sisterhood always knows best. The Guardians will protect and serve. The Unconsecrated will never relent. And you must always mind the fence that surrounds the village; the fence that protects the village from the Forest of Hands and Teeth. But, slowly, Mary’s truths are failing her. She’s learning things she never wanted to know about the Sisterhood and its secrets, and the Guardians and their power, and about the Unconsecrated and their relentlessness. When the fence is breached and her world is thrown into chaos, she must choose between her village and her future—between the one she loves and the one who loves her. And she must face the truth about the Forest of Hands and Teeth. Could there be life outside a world surrounded in so much death?Book Details:  Format: Hardcover \n   Publication Date: 3/10/2009 \n   Pages: 320 \n   Reading Level: Age 14 and Up", "title": "The Forest of Hands and Teeth\n      \n          (The Forest of Hands and Teeth #1)", "url": "https://www.goodreads.com/book/show/6468718-the-forest-of-hands-and-teeth", "average": 3.59, "cover": "https://images.gr-assets.com/books/1487343693l/6468718.jpg", "reviews": 8535, "authors": [{"url": "https://www.goodreads.com/author/show/1443712.Carrie_Ryan", "name": "Carrie Ryan"}], "type": ["Young Adult", "Horror", "Science Fiction", "Horror", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/6468718-the-forest-of-hands-and-teeth", "http://www.goodreads.com/book/show/3432478-the-forest-of-hands-and-teeth", "http://www.goodreads.com/book/show/9472032-the-forest-of-hands-and-teeth", "http://www.goodreads.com/book/show/6518042-the-forest-of-hands-and-teeth", "http://www.goodreads.com/book/show/15981850", "http://www.goodreads.com/book/show/7001361-the-forest-of-hands-and-teeth", "http://www.goodreads.com/book/show/6555517-the-dead-tossed-waves", "http://www.goodreads.com/book/show/8535273-the-dark-and-hollow-places", "http://www.goodreads.com/book/show/13533758-foretold", "http://www.goodreads.com/book/show/23281652-daughter-of-deep-silence", "http://www.goodreads.com/book/show/13356177-divide-and-conquer"]}