{"ratings": 14462, "userreviews": [{"userName": "Elyse", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Audiobook- read by David SedarisOverall I really liked listening to David read his diaries. I liked it a lot...but it grew on me. I only listened to about 1 or 2 hours of it a day. It was 13+ hours long in length. I would have gone crazy listening ‘or’ reading this type of book without breaks. There ‘is’ a tedious feeling when David reads a date of a diary entry - followed by another date/location and paragraph type diary entry...on and on and ON!Some of it didn’t feel any more personal than calling off names at a High School graduation, but after awhile - something happens. And we feel EMOTIONS. Then I remembered:David gave a clear warning at the start of what this book was anyway. He almost didn’t publish it. It’s from years ago. 1977-2002 just as the title says. I doubt if this were a first book, that any major publishing company would have touched it. But..., given who David is, that changes things. I experienced another side of David....., tender, sweet, soft spoken, and he ‘felt’ years younger & vulnerable. There was much sadness - especially the first half.His funny bone shines brighter in the second half. David shares about poverty - sex - racism - drugs - ( he really paints a vivid picture of the 70’s), religion - a moving experience with 911-and lots daily random things from his life. When people say the expression “that guy could read the phone book and make it interesting”...well, somebody must have been thinking about David Sedaris.I ended up enjoying my time listening to David’s tedious dairy entries - his dry wit - and his child like being in the world. He’s adorable!"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/Before I even begin this ramble, I feel a disclaimer should probably be provided regarding these 4 Stars. If you have not yet had the privilege of experiencing David Sedaris’ essays, you most definitely should not begin with Theft By Finding. Pick up any one of his other collections and read that first. Then repeat. Repeat again until you reach superfan status and you’ve started fantasizing about how delightful it would be to wear him around like a skinsuit as a beck-and-call-boy for your constant amusement. That’s totally normal, right????\nRight. When you reach that point of fandom, you’re ready for this.Theft By Finding: Diaries 1977-2002 is exactly what the title states – various diary entries that span several decades. Sedaris himself said this book should be read in snippets. If you are of the ilk, this would be a perfect selection to have readily available whilst sitting on the throne. Since my gastrointestinal system is of the “all or nothing” variety (TMI??? Naaaaaah!) and I wouldn’t dream of defiling my lobster’s work in that manner, I can’t confirm or deny if this is the way to go. I can, however, confirm that the early years are a rough read as you follow Sedaris from his 20s in Raleigh where he more than dabbled in methamphetamines and underemployment as a starving artist while consuming daily feasts at the local IHOP. You LITERALLY read the phone book as well as random recipes and lists of what he got for Christmas and various other nonsense like what happened that day on As the World Turns or the off-color joke a co-worker told him that day.If you can get through the first 20% or so, it becomes smoother sailing. David puts down the meth pipe and details his initial successes as a playwright in New York City all the way to becoming a best-selling author and residing in Paris. He lets you in on his family history – including his mother’s death and his sister’s battle with mental illness and includes some truly poignant entries . . . . . \n“Last night under the stars in a pasture in our sleeping bags, I poured my guts out and said things I was afraid to admit even to myself. And you know, it felt good and not as hopeless as I thought. All that had been inside for so long.”\nWhile I could have lived without the never ending submissions regarding his various French classes, unforgettable moments in history are documented within its bindings . . . . \n“There is a new cancer that strikes only homosexual men. I heard about it on the radio tonight.”\n\n “Hugh and I awoke to the news that Princess Diana has been killed, literally hounded to death by photographers.” \n\n “Last night on TV I watched people jump from the windows of the World Trade Center.” \nAs well as monumental moments in his personal history . . . . \n“This spring I am, if I’m not mistaken, in love.”\nMost importantly, around the 25% mark Amy moves to the same town and made my life complete when her various antics began being included . . . . \n “Amy and I went to Hoffritz to find Dad a Father’s Day gift. Our original idea was to buy him a knife, but in the end we spent $72 on a vibrator. It’s a Panasonic with a long stem and a thickish disk on top, designed so you can reach behind yourself and work out the kinks in your back and shoulders. We also figured he’ll use it on his dog. “Our father’s going to love this,” Amy said to the saleswoman as we laid the vibrator on the counter. The woman smiled. “The next time we see him, though, I bet his front teeth are all chipped.” The smile faded. ”\nAmy is the kind of asshole I dream of becoming one day. Hysterical with absolutely no filter. David and I both tend to be more of the “George Constanza” variety when not in writing . . . . .\nThere was little to no doubt in my mind when I requested an advanced copy that I would be denied so I immediately put myself on “pre-hold” at the library well before the release date. Words cannot express how happy I am now that I did not read this early, since it allows me to quote the story that caused quite the embarrassing moment at work . . . . \n“Lisa told me that the previous day she’d accidentally put a used Kotex through the wash. It went through the dryer as well, and when it came out, Bob held it up, saying, “These aren’t supposed to be laundered on their own, are they?” Lisa said she guessed not, and Bob asked why she’d washed just one of them. “I looked for the other and couldn’t find it anywhere.” “The other?” Lisa said. “Shoulder pad,” Bob said. “Isn’t that what we’ve been talking about?” He handed here the fluffy clean Kotex, still warm, and she put it in her dresser drawer until he left the room.”\nI read that during lunch yesterday and while I was trying to muffle my laughter, my supervisor confused the noise for hysterical sobbing. At that point there was no way I was going to be able get myself back under control and, well . . . . \nDue a combination of Sedaris’ epic rise in fame here in flyover country along with my crippling phobia of strangers in crowds, I most likely will never be brave enough to attend one of his readings and officially declare us besties for the resties. But we’ll always have our mutual love of America’s best television program as an unbreakable bond . . . . \nAnd he won’t have to bother getting one of those pesky restraining orders against me. Winner winner chicken dinner. You’ll always be my lobster, though, David. Always . . . ."}, {"userName": "Toni", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/27298436-toni", "userReview": "Dear Diary, I read this book recently that was completely in diary format since the author had, in fact, published 25 years of diary entries, (Volume I apparently), that started when he was about 20-21 years old and has continued on ever since. He started off with brief statements and observations of his day. I guess 1977 to 1983 are his really \"bleak\" years. Which are typical when you're young, broke and no real goals in life. I think many of us could relate. He's starting to sound a little humorous.\"The diary lightened up when I moved to Chicago, partly because I was in a big city and because I felt better about myself.\" David attended and graduated from the Art Institute here, where many fabulous entries; particularly his writing times at his favorite IHOP near his neighborhood. Bountiful years And he's still alive.In 1990 David moves to NYC and the world really opens up to him. Tons of cleaning jobs to earn some cash, millions to observe, and times to write, day or night. He meets Hugh here, thank goodness, gets himself together a bit more, and starts to become the success he is today. You know, that quirky little guy that a reads his books out loud at all different venues; and we pay our hard-earned money to buy tickets to go listen to him, willingly. What a racket! He's really funny though and we all like him. I myself have all his books in print form and audio. Personally, I like sarcasm.So diary, it's worth it, I get my own copy today! Amazon is going to drone it over. I'm lying, I pre-ordered it. But I am going to also listen on audio, so much better when David reads it to you. Still, what a racket! Met David at the Aronoff Theatre in Cincinnati, OH. The show was great and he signed my book. He told us his next book will be published May, 2018. Okay Netgalley, I hope it'll be available for request. I'm really disappointed that there are not any pictures in this book. That \"New Yorker\" article recently got my hopes up for pictures. Oh well. Thanks to Netgalley and Little, Brown and Company for the ARC.Yay, got tkts to see David in October at the Aronoff Theatre."}, {"userName": "Julie", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/5211606-julie", "userReview": "David Sedaris explains in the Introduction of his new book that “in the U.K., if you discover something of value and keep it, that's theft by finding.”Thus a great title was born, and it suits the general theme of David's diaries. But, I have a suggestion for two alternative titles for this collection, one borrowed from Garth Brooks: \"Friends in Low Places\" and the other stolen from William Shakespeare: The Comedy of Errors.Before I proceed, I want to clarify: I am a Sedaris lover, not a hater. I love the guy's writing. I've read all but one of his books of published essays.But, I feel compelled to say this: If you are not an established reader of Sedaris's work, I would not recommend that you start here. Go read When You Are Engulfed in Flames or Dress Your Family in Corduroy and Denim.Start where Sedaris writes with some polish and some humor, not with the origins of his writing, the “bare bones,” if you will. These are stark observations, and they may or may not appeal.It's not that this book isn't often hilariously funny; it is. It's not that this book isn't sometimes poignant; surprisingly, it's that, too. It's just that. . . if you don't know David's writing, I'm not sure you're going to make it past page 75.Frankly, David's diary entries from the late 1970s/early 1980s are fairly disgusting. He was a hard core substance abuser at the time, and I found it depressing to read about someone so desperate, down on his hands and knees, snorting an unknown white powder he has found, in the hopes that it is cocaine, or sniffing bags of glue and tempera paint because he has run out of money for better drugs. Also, he shares many anus-focused ruminations (I don't know how else to say this politely!), and these entries contain almost ridiculous amounts of the “n” word, the “p” word and the “c” word. I don't mean to suggest that David himself is “using” these words (both racism and misogyny disgust him); he is just surrounded by the absolute dregs of humanity in scenario after scenario, and these losers love these words, and David reports them.For me, the highlight was the center of the book, the mid-80s through the mid-90s, when David starts to get his act together, meets the love of his life and stops living on the total fringe of decent society. This is where the diary entries are laugh-out-loud funny, and I was actually taking pictures of passages and sending them to my sister, who is a Sedaris fan who has not yet received her copy. Ironically, once his life becomes really stable, his regular observations became somewhat boring and my feverish reading slowed, though he did take me to a tender place regarding the premature loss of his mother. That aspect of his writing has always been relatable to me.For established Sedaris fans, this is a mostly fun read, despite the degrading and loathsome accounts of humanity it reveals, but, personally, I'm holding out for new material. Come on, David, let's hear about life in the U.K.! Crawl under an overpass if you need to, but give us something new!"}, {"userName": "Rachel León", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/21291796-rachel-le-n", "userReview": "David Sedaris is funny. And he's funny in his own way. It's like his humor comes in its own flavor that you can't find anywhere else. Which is why when he has a new book come out, it's an event. This book is a collection of Sedaris's old diaries. I winced at the idea for a minute, then decided it'd still be worth reading. I wasn't wrong. This book is funny, introspective, and interesting. It's not the best intro to Sedaris for new readers, but fans will enjoy it."}, {"userName": "Trin", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/113980-trin", "userReview": "[Sedaris, as he himself points out in the introduction, very casually mentions the first time he meets his long-time partner/love of his life Hugh, noting that he's \"handsome and gay\" but really being more focused on the $20 he's making helping another friend move a ladder. (Of course.) Then, just TWO DAYS LATER, he applies for the Macy's elf gig that the time-traveling reader knows would soon truly launch his career with \"The Santaland Diaries.\" Holy cow. Everything about this guy's life changed (for the better) over the course of three days in October 1990, and at the time he had no idea. This gives me a lot of feelings that I can't adequately describe, but which there is probably some German word for. (hide spoiler)]"}, {"userName": "Shawn Mooney", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/50408211-shawn-mooney", "userReview": "It's a free country. Anybody can write about any old thing they want in their diary, of course. But it is beyond me why in this highly selective published version of his Sedaris would choose to include so many—dozens and dozens of—entries that record in great othering detail his observations of disabled and mentally ill strangers. I have long had a complicated relationship with his writings; now I'm turned off of him probably for good."}, {"userName": "Matthew Quann", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/22699228-matthew-quann", "userReview": "I think this is my first Goodreads review of a Sedaris book, but I've been a fan for a good while before that. My first exposure to Sedaris was with the excellent When You Are Engulfed in Flames audiobook. With his black humour, wry observations, humanist stories, and morality that never feels cheesy, Sedaris had me hooked. So I was pretty excited when I saw there was not one, but TWO new Sedaris books dropping this year.A bit of a disclaimer that should have been evident to me from the book's cover. This is not a series of essays that follow any arc, nor are they stories, Theft By Finding is a collection of diary entries. Some days are quick snippets, the earlier stories are rougher, and the later entries hew more towards the Sedaris I first met. We follow Sedaris as a young adult dabbling in every drug imaginable, we see him meet many people who would become instrumental in his life, and we see the nuggets that would eventually become his well-known stories.If you're like me, then you'll find a lot of common ground with Sedaris. His professional people watching and documentation of his ludicrous encounters is always spot on. He brings up situations in which I've found myself and has thoughts I've had too. It's always nice to know there's other humans with whom you share some cognition. With an eye for the absurd and a knack for making me laugh, I'm just about guaranteed an enjoyable venture with Sedaris. This would never be my recommendation to a Sedaris newbie--When You Are Engulfed In Flames is my suggestion!--but it still ends up being a pretty enjoyable listen. It functions extremely well as something to put on during the commute, dishes, and was a steadfast companion for my fiancé and I during a recent move. It is the audiobook equivalent of the book that's easy to pick up and put down. So, if you know you like Sedaris, I'd recommend it highly!"}, {"userName": "Enid", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/2226355-enid", "userReview": "I gave the audiobook a try, but quit after a couple of hours and returned it to Audible- I think I was up to 1984. It is too bleak and filled with tiny little details about everyday life, but without the insights I expect from a Sedaris book. I don't really want to hear about the crazy stuff he did while on meth- that isn't entertainment for me."}, {"userName": "britt_brooke", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/1136632-britt-brooke", "userReview": "\"I'm not a misogynist. I'm a misanthrope. I hate everyone equally.\" This is a book for established Sedaris fans. I say this because I'm not sure one can truly appreciate if they haven't read his other work (or at least some of it). I love his style of humor. Very intelligent, but also so silly and twisted. I was captivated even by the most mundane stories. He has a way of making anything interesting. Looking forward to the next volume!"}, {"userName": "Giss Golabetoon", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/43915571-giss-golabetoon", "userReview": "The only reason it took so long to finish this is because I bought it on iBooks and the only time i had to read it was on the bus to work, anyways, it was worth it. Sedaris manages to be funny writing his diary and recounting daily routine to himself, he's very good with sarcasm and self sarcasm. Loved it"}, {"userName": "Rebecca Foster", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "I’ve read six of David Sedaris’s humorous collections of personal essays; a college friend first recommended him to me in 2011. When I heard he was publishing his selected diaries, I wasn’t sure I’d read them. I knew many of his essays grow out of episodes recorded in the diary, so would the entries end up seeming redundant? I’d pretty much convinced myself that I was going to give Theft by Finding a miss – until I won a proof copy in a Goodreads giveaway. This is the first volume, covering 1977 to 2002; a second volume from 2003 onwards is planned.What I most liked about this book is the sense you get of the sweep of the author’s life: from living in his North Carolina hometown and doing odd construction jobs, hitchhiking and taking drugs to producing plays, going on book tours and jetting between Paris and New York City, via an interlude in Chicago (where he attended art school and taught writing). Major world events occasionally make it in – the Three Mile Island disaster, Princess Diana’s death, the Bush/Gore election, 9/11 – but for the most part this is about daily nonevents. It’s a bit of a shock to come across a serious moment, like his mother’s sudden death in 1991.One thing that remains constant is Sedaris’s fascination with people’s quirks. For instance, nearly every night for nine years he visited his local IHOP for coffee, cigarettes and people-watching. He seems to meet an inordinately large number of homeless, hard-up and crazy types; perhaps, thanks to his own years-long penury (\nOctober 6, 1981:\n “I’ve paid my rent and my phone bill, leaving me with 43 cents”) and addictions (he didn’t quit alcohol and marijuana until 1999), he feels a certain connection with down-and-outs.By the last few years of the diary, though, he’s having dinners with Mavis Gallant, Susan Sontag, and Merchant & Ivory. This isn’t obnoxious name-dropping, though; I appreciated how Sedaris maintains a kind of bemused surprise about his success rather than developing a feeling of entitlement. He acts almost guilty about his wealth and multiple properties (“I’ve fallen deeper into the luxury pit”). Time spent abroad keeps him humble about his linguistic abilities and gives him a healthy measure of doubt about the American lifestyle; I especially liked his reaction to a Missouri Walmart.The problem with the book, though, is that the early entries are really quite dull. Things picked up a bit by the early 1980s, but it wasn’t until the late 1990s that I realized I was actually finding the entries laugh-out-loud funny like I expect from Sedaris. The book as a whole is too long and inclusive; Simon Cowell would surely call it indulgent. I tried to imagine what would have resulted if an outsider had reduced the complete diaries to a one-volume selection. A cast list and photographs of Sedaris and his family over the years would also be helpful; I’d be interested to know if any supplementary material was added to the final product that did not appear in my proof.Ultimately I think this is only for the most die-hard of Sedaris fans. I will certainly read the second volume as I expect it to be funnier and better written overall. But if – as appears to be the case from the marketing slogans in my proof – the publishers are hoping this will introduce Sedaris to new readers, I think they’ll be let down. If you’ve not encountered him before, I suggest picking up Me Talk Pretty One Day or trying one of his radio programs.Some favorite passages:October 26, 1985; Chicago: In the park I bought dope. There was a bench nearby, so I sat down for a while and took in the perfect fall day. Then I came home and carved the word failure into a pumpkin.October 5, 1992; New York: The new Pakistani cashier at the Grand Union is named Dollop.October 5, 1997; New York: Making it worse, I had to sit through another endless preview for Titanic. Who do they think is going to see that movie?June 18, 1999; Paris: Today I saw a one-armed dwarf carrying a skateboard. It’s been ninety days since I’ve had a drink.October 3, 1999; Paris: I said to the clerk, in French, “Hello. Sometimes my clothes are wrinkled. I bought a machine anti-wrinkle, and now I search a table. Have you such a table?” The fellow said, “An ironing board?” “Exactly!”I won a copy in a Goodreads giveaway.Originally published on my blog, Bookish Beck."}, {"userName": "Michael", "userReviewDate": "Apr 24, 2017", "userURL": "http://www.goodreads.com/user/show/53450768-michael", "userReview": "I don't listen to NPR, and I'm not a huge David Sedaris follower. I have read 3 of his books after this one, and seen him live once - so I do know his stuff pretty well.Theft by Finding is classic Sedaris form, wry, witty, fully of oneliners and based on his extraordinary powers of observation. It deals with the mundane for the most part, but makes that mundane interesting with remarkable stylistic affect and a fantastic sense of voice.Especially if you listen to this one, you will notice how Mr. Sedaris has a great talent for voices, spoken and written. His impressions are on point, whether it is southern drawl, russian spy, bronx born native, or jewish grandmother. He really does have a voice for radio, and I was astounded that he even remembered the precise tone of voice and accents in this book - given that it is simply a collection of his diaries from the past 20 some odd years.As for cons, the book gets a little too mundane at points and definitely ventures into familiar Sedaris territory. If you have read his previous works you may see some repetition in content here, but delivered differently. It's also interesting to observe his transition from feeble and down-on-his-luck meth head to relatively self-obsessed member of the literati. The beginning of the book as such is more interesting than the end, as I imagine the comforts afforded by his success have made juicy anecdotes harder to come by."}, {"userName": "Book Riot Community", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "I am a die-hard David Sedaris fan. I’ve read all of his books, and I want to keep it that way. So when I heard last month that he had a new book coming out, I knew I had to read it ASAP. Lucky for me, Book of the Month club offered it as an add on. I snapped it up right away, hit ship immediately, and watched for my box. Theft by Finding had me laughing out loud. Since it’s an edited down version of Sedaris’s diary from 1977 to 2002, it revisits many of the antics and obsessions is readers will be familiar with. What makes Theft by Finding different is its slice of life quality. I got to follow my favorite funny weirdo through his day-to-day, and I couldn’t get enough. I’m in for another installment. Gimme 2003 to 2017!— Rebecca Rennerfrom The Best Books We Read In June 2017: https://bookriot.com/2017/07/03/riot-..."}, {"userName": "Jason Koivu", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "Theft by Finding is like a b-sides and rarities album, a retrospective that includes a bunch of old stuff, rough cuts, alternative versions of the hits, etc. It's designed for preexisting fans of the artist. They're the ones yearning for this sort of material. I'm one of them.This might also be enjoyable for non-fans, who just like a good salacious diary, something that feels gossipy and gives you the sense that dirt has been properly dished. Most of this dirt however is on himself and the dirt-poor. Theft by Finding covers Sedaris' early years when he was a down-and-out drug addict. There were times when he was a few bucks away from being homeless. But rest assured, he brings out the funny in it all.The early years are fascinating when his struggle was hampered by personality and bad habits. Many will not enjoy this because of that. Or I should say, many do not enjoy this because of that. Source: I've read reviews of his previous books that touch upon this era of his life.If nothing else this is an interesting rags to riches story, which ends about the time that his life turns into one unending book tour. There's only so much one can write about that life style before it bores. However, there's PLENTY of juicy diary material prior to that, so dig in!"}, {"userName": "da AL", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/50966750-da-al", "userReview": "If you're looking for Sedaris' typical style of book, this isn't it. It begins with his usual poking at the absurdities of life but soon turns from dark to bleek. He writes with sincerity about grappling with the many challenges of life, from bigotry to death, family to success. Thank goodness for Hugh. Twentyfive years is a huge chunk of life, in his case dealing with the making of his career, then of navigating it, and of finding one's place in the world as well as love. His writing and reading are so personal and likeable that, if he chooses to fill us in about his subsequent years in a later book, I can't help hoping that he's gained his footing."}, {"userName": "Amber", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/234533-amber", "userReview": "I thought maybe this book would be slow going because it's 500 plus pages of diary, but it didn't. I found his life mostly interesting and enjoyable. He sees the world in a unique way that I somehow identify with. This book will probably be something that Sedaris fans enjoy more than someone who hasn't read any of his work. If you are new to Sedaris, I recommend starting off with \"Me Talk Pretty One Day.\"In this diary collection, David Sedaris finds everyday life circumstances entertaining. I think we all do that, but I really think he sits back and enjoys the ride (especially of mundane things) more than most. It doesn’t seem like he takes life too seriously and that’s refreshing. This book takes place when David is 21 and poor, starting out on his own and it is interesting as a big fan of his to see how he gets from there to having his books published and living in France in 2002. The one thing that struck me in this diary collection is that David mostly describes his life without emotions getting in the way. I know when I was young and kept a diary, it was full of my emotions and opinions and judgements, more so than what was actually happening in my life. He includes enough funny and strange observations to make this a fun read, but I guess that is his what made him famous and what we all love him for. David’s relationships with his family members were my favorite parts of the book. Reading this makes me want to go back and re-read all of his memoirs. It was really good to “visit” with him again.Thank you Little, Brown and Company and NetGalley for providing me with a copy."}, {"userName": "Krista", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "“In the U.K., if you discover something of value and keep it, that's theft by finding,” she told me. “You're supposed to investigate whether it was lost or stolen, though in this case – five pounds – of course you're fine.”Theft by finding. It was, I thought, the perfect title for this book.I've read quite a bit of David Sedaris and his collections of wry and biting essays, and I think it was in Let's Explore Diabetes with Owls that I first learned his work method: Walking around every day with a notebook in his pocket, Sedaris listens in on conversations, interacts with strangers, and otherwise attempts to live a life worth recording; writing it all down in his notebook. At the end of every day, he rewrites these snippets into his diary, and eventually, combs these entries for those stories that would make for wry and biting essays. Theft by Finding: Diaries (1977-2002) is the first of two compilations of forty years of such diary entries, and as Sedaris warns in the foreword, he edited the diaries himself – leaving out the pages and pages of early meth-fueled rants, but otherwise attempting to provide a fair picture. I guess we'll need to take him at his word. Although Sedaris demurs that he can't imagine anyone reading this book straight through, I did and I found it to be very interesting – a quite satisfying, if somewhat sketchy, method of memoir. \nIn order to record your life, you sort of need to live it. Not at your desk, but beyond it. Out in the world where it's so beautiful and complex and painful that sometimes you just need to sit down and write about it.\nProbably what I liked best were those entries that marked something I was familiar with from Sedaris' earlier writing – the day he first met the acidic downstairs neighbour, Helen, in New York; casually noting when he first met his partner Hugh; when he first attended the French lessons in Paris that became the title piece in Me Talk Pretty One Day – but nearly as satisfying would be all that I didn't know: the early days of poverty and drug- and alcohol-fueled debauchery; that he began his career as a visual artist; that he and his sister Amy made a splash Off-Broadway for years. Sedaris also notes in his foreword that he has never been interested in recording self-reflection – this is a very outward-facing narrative – yet he still tells a tale of hard work (days spent as a handyman or furniture mover followed by evenings reading at the IHOP) and the evolution of his art to the written word. And because he's writing to himself, Sedaris never feels the need to explain anything – in one of his books I had read why he and Hugh moved to France, but here they are just suddenly there; you need to infer when he's on a book tour or just back home visiting family; and it all works.The tone of the book, naturally, evolves over time: Sedaris himself grew from a hitch-hiking dropout to a world-famous, polished writer, and by the end, the entries feel like they're meant to be read by others. Compare an early entry from October, 1977:\nAfter a hotel for $8.50 a night, Ronnie and I found an apartment that's $30 a week for the both of us. I worry about money, but when it's gone, it's gone. I smoked my first cigarette. It's embarrassing, but you do get a buzz off it. I did, anyway, on Davie Street.\nAnd one from December, 2000:\nApparently I don't have AIDS. The French bank received my blood test and approved my mortgage, so, though I haven't yet read it on a piece of paper, I'm guessing I'm negative. This is sort of major, as, for the past fifteen years, I've just naturally assumed I was infected. Every time I sweat at night, every time I get a sore or run a fever, I think that it's finally kicked in. It wasn't always at the front of my mind, but it was always there. It sounds goofy, but it's going to take a while for the news to sink in. I'm not disappointed; I just need to figure out what to do between now and the time I develop cancer.\nI will allow that I might have found this more interesting because of my prior dips into Sedaris' writing, but I'm happy to have read the first volume and am looking forward to the second; I wonder if there will be so many people named Pee Wee and references to wheelchairs in it?"}, {"userName": "Book of the Month", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/46126209-book-of-the-month", "userReview": "Master of the humorous essay (and Book of the Month Judge), David Sedaris has built a career based on his witty observations about everyday life, and his diaries contain a treasure trove of raw material that shaped his distinctive writing. Theft by Finding is a 24-year spree of notes, recounted conversations (that ear for dialogue as honed as ever!), Christmas lists, overheard jokes, recipes, and straight up hilarity. A must-read for any Sedaris fan, this is the perfect book to flip through at random, looking for a gem of a sentence or two to catch your eye and tickle your funny bone.— Book of the MonthRead more at https://www.bookofthemonth.com/theft-..."}, {"userName": "Kiki", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/612857-kiki", "userReview": "A MUST-READ for Sedaris fans. This sort of feels like a behind the scenes look at David's life. It's truly admirable that he's been keeping a journal all these years and explains how he writes his fabulous, funny stories. Not to mention he's honest, observant, kind, and a humble guy."}, {"userName": "T.D. Whittle", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/6051061-t-d-whittle", "userReview": "This is worth reading if you are a die-hard Sedaris fan. For me, it was also poignant because my young adult life in NYC overlapped with Sedaris's own, and I worked in the book world at the time. We moved in overlapping circles, in overlapping neighborhoods. I attended his readings, hosted him at our shop, and passed him on the street from time to time. The upshot of this is that much of what he wrote about during the 1980s and 90s reminded me of some events and experiences in my own life that I'd long since forgotten. This was a nostalgic pleasure for me.Having said that, I would agree with some other reviewers that the early years of the diaries are fairly boring (I say \"fairly\" because Sedaris is never completely boring, in my opinion) and much of what he writes is already better said in his other books. And by better, I mean funnier; whether or not the diaries are a truer reflection of how his life unfolded is irrelevant to me. I read Sedaris for two reasons: he is an excellent writer, and he is hilarious. I rarely laughed aloud reading these diary entries, which is unusual. Usually, I half suffocate myself at least once before getting to the end of his books. Still, I am glad I read this one, if only for the satisfaction of keeping up with his work."}, {"userName": "Debra Komar", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/28593062-debra-komar", "userReview": "4.5 stars. I adore Sedaris and this is a strange and wonderful view into his life. It starts slow - as he warns us it will - but once he moves to New York and becomes serious about writing, it is magical. Watching him fall in love with Hugh and become a writer is a joy. There are the usual brilliant one liners and the cutting observations of odd people. It never feels mean-spirited, Sedaris always finds the humanity. On a side note, I have seen Sedaris read a number of times over the years and have stood in line for hours to get him to sign books. He is spectacular. In the past, however, the readings were always free. This year, if you want to see him in Toronto, you have to pay $40 - 95 to see him at the Air Canada Centre. While I have no doubt he will be brilliant as always, that seems a bit stiff for what is essentially a long commercial for a book. I love you David, just not $95 worth."}, {"userName": "Greg", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/39346323-greg", "userReview": "I'm a big fan of David Sedaris, an author who takes the chaos of the world, sometimes even the worst challenges, and spins it into a unique view. But, you know those fiction books that pretend to be, say, \"found manuscripts which prove grandpa was a vampire...\"? Some of these \"Diaries\" sort of feel that way, as some entries (toward the end of this book) are constructed so beautifully, leading to a typical Sedaris punchline, that you just gotta remember what Sedaris tells us in his introduction: that there was indeed some editing. But so what. The first half is pretty boring but things get funnier as Sedaris hones his skills and gets richer, so maybe he just has more time to write funnier stuff. This is just the first half of his \"Diaries\" and I'll read the rest as well as his next \"real\" book. This is probably Sedaris at his weakest. but I've excused lesser authors, certainly, for even lesser quality works."}, {"userName": "Ren", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/875657-ren", "userReview": "I feel so bummed out having finished this because I know I won't read something else this good for a long time."}, {"userName": "Joyce", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/1650596-joyce", "userReview": "My introduction to Sedaris was as a reference librarian. A patron had heard a piece on NPR and wanted to track down the author and title. This was, of course, pre-Internet, and even calling our local public radio station didn't elicit the answer...until I heard Sedaris myself reading Santaland Diaries on NPR as I returned to work from a dentist appointment. He'd find that ironic, I think. And thus began my love affair with Sedaris reading his own work, including a chance to see him perform live. His voice is distinctive, to say the least, and his deadpan delivery simply highlights the absurdity he observes in everyday life. These are excepts from early diary entries, mostly before his success and fame, but all absorbing. Santaland is here, in diary form before it was enlarged into a longer piece and even a play, and it's interesting to imagine how it could have grown from those few notes and incidents. I've never tried reading one of his books, but I can't imagine that the impact and my pleasure would be as great as listening to him recount his adventures and the way he elevates the ordinary."}, {"userName": "Jenni", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/5808727-jenni", "userReview": "Update 3/8/18: I gave this book another try and listened to it on audiobook instead. Much better choice! The author narrates, which I always enjoy. The first half was still a bit more tedious, but the second half is closer to his other essays. It was fun to witness the transformation from Sedaris as young, broke and frequently high to older, wealthier and extremely successful in his career. Some of the entries were less interesting than others, but it was easier to \"zone out\" listening to the audio book.I love David Sedaris' other works, but this book is just a collection of diary entries that are neither interesting or entertaining (to me). I'm abandoning before I spend another minute on it."}, {"userName": "lp", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/442333-lp", "userReview": "A little dark and very funny. Sedaris is the master at observing others and picking out the humor. THE MASTER. I want him to live inside my brain and point things out to me twenty-four hours a day."}, {"userName": "Angie Six", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/27907310-angie-six", "userReview": "I received Theft by Finding: Diaries as an ARC from Little, Brown.Bedtime is safe again. For several nights in a row, my poor husband would be almost asleep when I would bust out laughing while reading an entry from one of David Sedaris' diary entries. Let's just say he was not amused. I've been a David Sedaris fan for nearly 20 years and have been looking forward to this book for months. For that reason, I'm not the most unbiased of reviewers. If you've read and enjoyed previous Sedaris books, or if you've had the chance to hear Sedaris read from his diaries before, you'll enjoy Theft by Finding. You'll recognize elements of other stories in the diary entries, but it doesn't feel repetitive to me. Instead I found it interesting to learn the beginnings and back stories of Sedaris stories I've previously loved. The reader will also get insight into some of the harder, not funny parts of Sedaris' life. You can't fault the author for the early diary entries dragging a bit. It's not as if he knew in 1977 that one day these would be shared with the world. The format takes a few years (in book form!) to get used to, and I made a note that the book finds its groove and takes off around 1984. If you've never read Sedaris before, don't start here. However if you are fan, Theft by Finding: Diaries is a must-read.\"In order to record your life, you sort of need to live it. Not at your desk, but beyond it. Out in the world where it's so beautiful and complex and painful that sometimes you just need to sit down and write about it.\"I'm so glad that Sedaris lives out his thoughtful, quirky, observant life and writes the details down for us."}, {"userName": "Sue", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/1182891-sue", "userReview": "I read this book purely to see how a writer sources material by being more observant than the rest of us – or at least more observant than I am.And I wonder what it would be like to read Theft by Finding if you had never read any of David Sedaris’ writings. This book of selected diary entries seems without question to be for those who know his work and are curious to know more about how the work came to be. As a personal essayist, Sedaris has gleaned material from many episodes in his own life – and probably does some serious embellishment to ramp up the comic factor. Could his life have really been as outrageous as the essays suggest? Well, maybe. The diary selections show the observant writer in his daily record-keeping of things seen and experienced, not infrequently from his booth at the IHOP.Sedaris claims that he began keeping a diary without a clear goal in mind. He records the mundane, but he has an eye for the bizarre. One may suspect that he lived in gritty neighborhoods for the material they yielded. In the years after early diary entries fed the essays, and the essays found an audience, his diary writing appears to become more attentive, because the observations grow much more detailed. The diary becomes a journal, if I may make that distinction. I surmise that he has learned its value to the task of finding and passing on stories.His raw exposure of family members makes some readers cringe. Others laugh helplessly because they recognize utterly human failings they may even claim themselves. Count me among both the cringers and the laughers. I know that I keep listening to his audio books because of his wild sense of humor, and because I have liked observing him grow older, more appreciative and finally even sober. The diaries tell me how much he truly loves his family. They must love him back to allow some of their outrageous stories to go public.My favorite episodes have centered around learning a foreign language as an adult. When Sedaris lived in France, he attended the Alliance Française to learn French. I could relate thoroughly because of my own foreign language struggles as an adult learner. I’ve never read a funnier account of the way a new language surely turns all of us into children. Ergo that was my favorite part of the diary as well.And now I digress:My first look into this book sent me searching through my bookshelves for a book called “When Found, Make a Verse Of,” by Helen Bevington. I still can’t find the book, which does not speak well for my organization system. But I remember it well. Bevington kept journals, notating things she saw but also things she read or heard. Many of these notes made their way into her light verse. In “When Found, Make a Verse Of,” she placed the original journal note beside the verse it inspired. I remember finding the journal entries even more interesting than the poems. Like Sedaris, Bevington was a note taker with a writer’s ear and eye and an awareness of a good story, though her treatment could not be more different. I loved having a window into her writer’s talent.Bevington’s book title was inspired by Charles Dickens. “When found, make a note of,” said Captain Cuttle in “Dombey and Son.”Good advice. I’m guessing that the fictitious Captain Cuttle might also have made a writer since he seems to know that life is curious, and there is inspiration everywhere."}, {"userName": "Tom Franklin", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/661076-tom-franklin", "userReview": "One of the things I always look for in an autobiography is what the person chooses to leave out. Those items are usually more interesting than some of the things they chose to include.With David Sedaris' book of cherry-picked diary entries there are many things I wanted to know more about that were mentioned tangentially but never directly addressed. These include his decision to quit drinking and drugs; the creative/writing process he went through with his sister Amy when they were writing/acting/producing plays; how he relationship with his long-time boyfriend Hugh went from initial flirtation to moving in together...That said, Theft by Finding is an enjoyable, quick read. His diary entries are, for the most part, very short and presented much like an idea left as a story prompt for the reader to finish. It was one of the few books that I've read where at one point I really wish I had the audiobook version with Sedaris reading it.The catch here, though, is while the entries are brief and usually reports of thoughts or people seen/conversations overheard, there's not a great sense of Sedaris himself here. Sedaris is, at best, a passive observer of his own life. We aren't allowed to see/read how any of the life-changing events personally affect him. There is much humor, yes, but little emotion."}], "description": "David Sedaris tells all in a book that is, literally, a lifetime in the making.For forty years, David Sedaris has kept a diary in which he records everything that captures his attention-overheard comments, salacious gossip, soap opera plot twists, secrets confided by total strangers. These observations are the source code for his finest work, and through them he has honed his cunning, surprising sentences.Now, Sedaris shares his private writings with the world. Theft by Finding, the first of two volumes, is the story of how a drug-abusing dropout with a weakness for the International House of Pancakes and a chronic inability to hold down a real job became one of the funniest people on the planet.Written with a sharp eye and ear for the bizarre, the beautiful, and the uncomfortable, and with a generosity of spirit that even a misanthropic sense of humor can't fully disguise, Theft By Finding proves that Sedaris is one of our great modern observers. It's a potent reminder that when you're as perceptive and curious as Sedaris, there's no such thing as a boring day.", "title": "Theft by Finding: Diaries 1977-2002", "url": "http://www.goodreads.com/book/show/32498038-theft-by-finding", "average": 3.94, "cover": "https://images.gr-assets.com/books/1492298272l/32498038.jpg", "reviews": 2004, "authors": [{"url": "https://www.goodreads.com/author/show/2849.David_Sedaris", "name": "David Sedaris"}], "type": ["Nonfiction", "Autobiography", "Humor", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/32498038-theft-by-finding", "http://www.goodreads.com/book/show/34866105-theft-by-finding", "http://www.goodreads.com/book/show/35179701-theft-by-finding", "http://www.goodreads.com/book/show/34402092-theft-by-finding", "http://www.goodreads.com/book/show/33347026-theft-by-finding", "http://www.goodreads.com/book/show/4137.Me_Talk_Pretty_One_Day", "http://www.goodreads.com/book/show/4138.Naked", "http://www.goodreads.com/book/show/10176.Dress_Your_Family_in_Corduroy_and_Denim", "http://www.goodreads.com/book/show/1044355.When_You_Are_Engulfed_in_Flames", "http://www.goodreads.com/book/show/4136.Holidays_on_Ice"]}