{"ratings": 39, "userreviews": [{"userName": "Ronda  Tutt", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/2216375-ronda-tutt", "userReview": "Beautiful Story!This was such a sweet short fast pace story. It was so touching how the Familiar Witch Aisleen’s stayed strong and honored her vow with the Mother Goddess even when she was faced with taking care of one of her enemies (Lucien) from long ago.I loved the smooth writing and only craved more in the end. The story isn’t really a love story but the Familial Witch Aisleen and Eternal Lucien end up together in the end as he asks to stay to make up for all his wrong doings in the past. The attraction between the two of them is evident in both their actions towards each other. I loved Aisleen character for it showed a strong independent woman who did everything herself to survive on her own without a man. I truly admire women like that.The story in the end is left open to insinuate that Aisleen and Lucien will become a couple and part of the plot of catching Alistair, whom is a traitor of his own kind as he purchases liquid silver in order to freeze vampires and others like himself in order to break the alliance between the species and start a war. This is definitely a story that has captured my interest and I can hardly wait for the next book to follow.Great Read!"}, {"userName": "Sapphyria  ", "userReviewDate": "Apr 04, 2012", "userURL": "http://www.goodreads.com/user/show/5499564-sapphyria", "userReview": "In Bri Clark's mythical world, the Mother Goddess is the creator with her creations being made in an alternate realm from earth. Ethical and responsible behavior displayed by Eternals is what allowed them to walk among the humans.The first rule of Eternals is that they must only mate within their own kind. The half-breed creations of a mating outside their own kind resulted in abominations that were a threat to society. Not only that, they were not bound by the same rules as the Eternals, making them a very dangerous group.Lucien, the leader of the Eternals, discovers that his second-in-command, Alistair, has committed treacherous acts against the clan. Alistair also had his minions create a new weapon in the fight against Lucien and his people; Liquid Silver. Once injected and allowed to be distributed throughout the body, it renders the victim helpless and unable to move--a fate worse than death. While spying on Alistair, Lucien is discovered and shot with an arrow full of liquid silver. He flees his enemies as fast as he is able and comes across Aisleen, in the forest. Aisleen, a witch, takes him into her home, cleans him up, heals him, and protects him from whatever monstrosity that wounded him. But then their pasts collide head-on. Will either one survive when secrets are revealed?Bri Clark weaves a very descriptive tale in the mere 34 pages of this novella. For example: Page 7: \"The first fifty feet was just bark before full branches spread out like the intricate folds of a woman's skirt.\" Bri's descriptions of everything, from material/physical items to emotions, is well expressed without going overboard. Lucien is a strong hero with a past that is tied to Aisleen and her coven but he also has other secrets. Aisleen, the last of her kind, lives alone in the forest surrounded by nature, since her husband left her high and dry. She is very independent and has inner strength and the will to endure and survive on her own. The novella is well thought out and I enjoyed the interactions between Lucien and Aisleen. The ending was a bit abrupt and a few loose ends were left flapping in the wind so I'm hoping there will be another story in the series.(Review copy provided at no cost in exchange for an honest review)."}, {"userName": "Melissa ♥ Melissa's Eclectic Bookshelf", "userReviewDate": "Mar 17, 2012", "userURL": "http://www.goodreads.com/user/show/6008941-melissa-melissa-s-eclectic-bookshelf", "userReview": "I absolutely loved the lush descriptives that Bri Clark uses in this novella. I could completely picture the woods and the characters that make up this short tale. I loved the aspects of earth magic and healing that made up Aisleen's person but unfortunately the plot and the character development fell short for me. The romance seemed too similar to insta-love and the conclusion felt a bit too abrupt and it left too many questions for my taste. All in all: Beautifully descriptive but lacking in substance."}, {"userName": "Kiki", "userReviewDate": "Feb 08, 2011", "userURL": "http://www.goodreads.com/user/show/1697919-kiki", "userReview": "This is a wonderful short story. Ms. Clark elegantly depicts a new world of her own creation, one elaborate and different, but easy to follow, thanks to her magical gift for description. The setting comes alive, as do the characters and lore. Warning: This one will leave you wanting for more :)"}, {"userName": "April", "userReviewDate": "Mar 03, 2011", "userURL": "http://www.goodreads.com/user/show/1329728-april", "userReview": "Full review coming this week!"}, {"userName": "Vanessa", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/5084918-vanessa", "userReview": "The Familial Witch is probably one of the most captivating novellas I’ve ever read. I read it in just one sitting but it left me wanting for more. The story was so well-written that it never occurred in my mind that I was reading a novella.The story started out with a quick intensity as Lucien finds himself at the mercy of his once-trusted comrade, Alistair. Badly wounded and weary, he retreated deep into the woods and is found by a witch, Aisleen. Since this book is a novella, I reckoned I shouldn’t go beyond giving out any more details for fear it would eventually contain unintended spoiler. However, I should say that from the very beginning, author Bri Clark drew me in with her excellent narration and proper use of grammar and vocabulary. I’m certainly not an English teacher but after reading a book that had been written perfectly and so beautifully, it’s definitely something worth mentioning. On top of that, I also loved the fact that the author hadn’t left out any details to support her story. From the emotions of characters to the rich smell of woods where Lucien and Aisleen take refuge, everything was pretty vivid and imaginative. They captured my mind and transported me to a whole magical realm.Bri Clark wrote her story in third person perspective but alternately featured Aisleen’s and Lucien’s view of the story which I liked rather than featuring just one person’s. Despite the switching, the story transition was smooth and flawless and didn’t seem to lacking its momentum. Lucien as an immortal is absolutely hot while Aisleen as a lone woman who lives in the forest, shunned by her husband and the society, is undeniably a strong and inspiring character. She is an epitome of all unfortunate yet resilient women out there who are abandoned by their husbands and sometimes rejected by their own birth societies, but still living their lives in hope, love and forgiveness. I was glad that Bri Clark presented her that way rather than as a typical seductive and vengeful witch.The Familial Witch mostly revolves around the budding relationship between Aisleen and Lucien as both secrets unraveled. However, I’m dying to find out what was really going on between Lucien and Alistair. The book somewhat ended in major cliffhanger so I guess there would be a sequel to all those unanswered questions and thought it would interesting to finally find out about their conflicts. And hopefully there will be more sweet romance as well to cater to readers’ softer side."}, {"userName": "April", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/1329728-april", "userReview": "The Familiar Witch is a wonderful and delightful tale that takes the reader on a journey to another time and another place.Bri Clark has an amazing talent for painting vividly beautiful and truly realistic scenes through her words and descriptions. Her story is brought to life from the first sentence and quickly and easily seduces the reader into the lives of these two wonderful characters.I simply loved the writing style of Ms. Clark and have to say that her characters are written in a way that made me truly care for them and anxious to find out what would happen next for them. Aisleen is a woman with powers who knows goodness and love, as well as the powerful pain of loss and abandonment. Her life has been anything but easy, though she knows no self-pity and lives her life as it must be lived.It is Aileen's inner and outer beauty, which endows Lucien to her.Lucien is a strong leader of his clan and knows strength, as well as pain and heartbreak. Now he knows true betrayal after being injured by someone once trusted. He is close to a fate worse than death, when he and Aileen meet in the forest. Aileen takes Lucien in and cures his body, yet once she discovers exactly who he is, she is torn between what is right and what is desired.Both Lucien and Aileen have pasts filled with pain. Their lives are intertwined, though they do not realize just to what extent, and destiny must decide whether their spirits and souls can be cured, as Aileen once cured Lucien's body.The Familiar Witch is an engrossing story of destiny, love, pain, forgiveness and trust. With an essence of the paranormal and mythical lore, this is a story that will leave the reader hooked from the first page to the last. My only complaint is that the story was so short. I would love to see Bri Clark expand on the story and see where the lives of the characters take them.I truly recommend The Familiar Witch for anyone looking for a quick, engrossing and delightful escape. Lovers of the paranormal will particularly enjoy this story!"}, {"userName": "Aislynn ", "userReviewDate": "Mar 03, 2012", "userURL": "http://www.goodreads.com/user/show/4156074-aislynn", "userReview": "As I reached the end of this novella, I was left wanting more. The author has created such an incredible story in such a short period of time (and pages), we are introduced to a world of eternals, witches and magic. And of course the gorgeous cover!We are introduced to Lucien, clan leader and one of the most revered. He is betrayed and barely escapes with his life. He stumbles on Aisleen (LOVE the name!) as he wanders through the forest. He begs for help and thankfully she doesn't hesitate. These two seem to be drawn to one another.When Aisleen finds out what Lucien is, she isn't sure what to do. Her first thoughts are of revenge, but knows she is must help and heal as she is bound to. I don't want to give away too much of the story, as it is short! The story flowed well, I really enjoyed the author's style of writing.The story is filled with wonderful descriptions and has so much potential. I hope that Bri will expand the story and we will get to see more of Lucien and Aisleen! For someone who likes paranormals, or stories of immortals and witches this is definitely something that will interest you."}, {"userName": "Jessica Gibson", "userReviewDate": "Feb 15, 2012", "userURL": "http://www.goodreads.com/user/show/6811094-jessica-gibson", "userReview": "Ok, let me start by saying, the cover alone had my interest piqued, so I was excited to read this book. I would really call it more of a short story, just when I thought the story was going to get going, it ended. I was left feeling sort of let down, I'm really hoping there's going to be a sequel so I can see what's going to happen next.I did enjoy the story, I loved the two main characters. Aisleen is such a strong woman, to be able to help a man who was responsible for the death of her entire family. I would be interested in her back story, like when the genocide happened. Lucien of course was amazing, I mean, what's not to like? He's got it all, brains, and looks, plus a conscience, and a sense of duty.I think Bri Clark has real promise, if the book was longer, I would have really liked it. The story needs to be developed a little more, so it's easier on the reader. I'm interested enough to read the next book in this series when it comes out. She did a great job developing the characters, now I just want to see where the story will take them. If I rated books traditionally, I would give this a book a strong 3 1/2 out of 5. Since there is no 3 1/2 on here I'm giving it 4."}, {"userName": "Romancing the Book", "userReviewDate": "Oct 31, 2011", "userURL": "http://www.goodreads.com/user/show/5328566-romancing-the-book", "userReview": "Reviewed by Valerie: It’s official for me, novella = extra long teaser. This was a stunning paranormal novella introducing us to the world of immortals and witches. While many novellas are written to expand on characters from other storylines, this one is a stand alone (fingers crossed there will be more from this author).I loved the descriptions of the world that Lucien and Aisleen inhabit. I was taken in by her ability as a healer and his kindness despite being a warrior. When he is betrayed and their paths cross, their destiny is decided for them...yet all is not as it seems. Aisleen knows Lucien’s true identity which causes her unspeakable sorrow. As these characters spend more time together, you can’t help but root for them to get to know each other better and try to figure out a way to make amends – as impossible as it seems.The ending of the novella certainly leaves us wanting more and wondering how both of these characters will handle betrayal and attraction and what other obstacles they will face before they find happiness, if ever."}, {"userName": "Avid Reader Amy's Reviews", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/3482519-avid-reader-amy-s-reviews", "userReview": "For a short story this one packed a lot of info. The author's story is clean but leaves a lot to the imagination. The story flows very well and the character terms are easily understandable. I enjoyed reading about Aisleen. She is a character that can be easily related to. She has dealt with pain and loss in the past and now is confronted with the man that caused the loss she experienced. While Lucien is unconscious she has to make a choice to either mend his wounds or extract her revenge. She chooses the higher ground, and in doing so I think she mends more that just his physical wounds. I think she mends his and her emotional ones too.What I loved about this story is it drew me in quickly. The author created strong characters that are not lacking. What I wasn't happy with was that we did not learn more about the guys that Lucien was running from. One of the guys was Alistair, his second in command. I wanted to know more, so I hope that there will be more stories following this one so I can find out.Great story. I will have to check out more works from this author."}, {"userName": "Jenny needham", "userReviewDate": "Mar 04, 2012", "userURL": "http://www.goodreads.com/user/show/5623467-jenny-needham", "userReview": "I loved this novella from the very first chapter, the characters are amazing and well written. I loved the fact that i really wanted to hate Lucien but i found that as the story progressed i actually loved him and all his flaws. Aisleen shows amazing character and strength,with a whole back story to the relationship between them i can't wait to see what else is in store for the pair. There is only one downside i found to this and that was that i wanted more and it ended too quickly for me, i was left looking to see if i had lost the rest of the book. I will be heading to check out the next installment of this when it is released. I urge all paranormal and paranormal romance readers to get a copy of this and read it. All i can say is thank you to Bri Clark for this amazingly engrossing and captivating read."}, {"userName": "Dolce Amore ", "userReviewDate": "Feb 29, 2012", "userURL": "http://www.goodreads.com/user/show/4861531-dolce-amore", "userReview": "Reviewed for Confessions from RomaholicsLucien Lemoine’s second in command betrayed him and the rest of the immortals by procreating with humans in order to create an army. This is taboo, the mortals and the eternals, created in a dream realm, are never meant to mix. And then he finds out that Alistair, his second-in-command, has made a pact with some vampires, enemies of the eternals, so he could find a way to kill Lucien.(full review)"}, {"userName": "Melissa", "userReviewDate": "May 15, 2011", "userURL": "http://www.goodreads.com/user/show/4900212-melissa", "userReview": "How many times can a person say “Just one more page” to themselves? I found myself doing that thee whole book! (Thee) lol. I loved the way this whole book was set up, this author really found her talent. Beginning draws you in, plot/storyline and pace teams up on you, never letting you put it down! Ending will leave you wanting the whole series. This original story is definitely one I will recommend over and over. A Must buy!"}, {"userName": "Shy The WidowMaker", "userReviewDate": "Mar 02, 2012", "userURL": "http://www.goodreads.com/user/show/5713324-shy-the-widowmaker", "userReview": "Review to follow."}, {"userName": "Tishia (Paperback Opinion)", "userReviewDate": "Apr 08, 2011", "userURL": "http://www.goodreads.com/user/show/2162476-tishia-paperback-opinion", "userReview": "Please read my review here:http://paranormalopinion.blogspot.com..."}, {"userName": "Kimberly", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/9152704-kimberly", "userReview": "Loved the story but there were so many unanswered questions. It's almost like it't the intro of a book. I WANT MORE! Guess I'm too use to reading epic long stories."}], "description": "Lucien Lemione the clan leader of the feared and revered Eternals is faced with the ultimate betrayal. His second in command for two centuries has not only created the most grievous of offenses but also commissioned the creation of liquid silver. When poisoned by this toxin, an immortal suffers a fate much worse than death, frozen in an internal prison. After being wounded when found spying, he hides deep within the eerie woods that encircle the Triad Mountains. Desperate and in pain, he prays to an offended mother goddess for help. Her answer: a woman, but not just any woman. A witch. After losing her entire coven at the hands of the Eternals, Aisleen is the last of her kind. She retreats from the world to Trinity Forest where she is giving the opportunity of a lifetime, or perhaps a test of principles. It’s there she discovers the man she heals is the Eternal that wiped out her people. Although she is bound as a healer, she could be creative in her revenge. Aisleen knows who and what Lucien his…but does not speak of it. There can be no future with Lucien for she can only be with a mortal man. Even if she wanted to be with him, can she forgive the man that caused the genocide of her people?Lucien must act quickly for the survival of his clan is at stake. However, Aisleen’s ethereal beauty and emerald eyes keep pushing those thoughts far from his mind. Determined to find out what secret she hides, he prolongs his time with her. When his people need him most what will he choose…duty, desire, or will he make his own fate?You can choose love but you can’t choose destiny.", "title": "The Familial Witch", "url": "http://www.goodreads.com/book/show/10371751-the-familial-witch", "average": 4.0, "cover": "https://images.gr-assets.com/books/1327971809l/10371751.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/4621205.Bri_Clark", "name": "Bri Clark"}], "type": ["Fantasy", "Romance", "Romance", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/10371751-the-familial-witch", "http://www.goodreads.com/book/show/10577898-the-familial-witch", "http://www.goodreads.com/book/show/12046262-glazier", "http://www.goodreads.com/book/show/12992269-scent-of-a-witch", "http://www.goodreads.com/book/show/10410615-caffe-seduzione", "http://www.goodreads.com/book/show/36537712-witch-s-eternal", "http://www.goodreads.com/book/show/11099718-improvised-digital-short-story-blood-bond"]}