{"ratings": 776, "userreviews": [{"userName": "Adam Nelson", "userReviewDate": "Feb 20, 2012", "userURL": "http://www.goodreads.com/user/show/2377841-adam-nelson", "userReview": "Probably my favorite Michener novel yet (I've read about 5, I think). This is the ambling, sometimes rambling, story of a young man's experience growing up in the midst of the development of the notion of Americana (I can't think of a better way to put it--it's not the typical American experience, necessarily, but as he dabbles in vaudeville and running a con game at a ticket booth on a boardwalk and editing and publishing pulp trash, I think Americana is a safe way of putting it). It's about his loves and losses, affairs of hormonal passion, defeat and disappointment on top of one another and alway this persistent but not necessarily superhuman ability to rise above his circumstance. In all ways, he's average, and that's what I like about him. He has an average heart with dreams that are too big for his circumstances, just like any of us. What made this novel soar was his realization, in the novel's final act, that he has a story to tell, and doggone it, he's going to tell it his way. I could see Michener's heart here, very clearly. His conversation with an editor and his defense of his writing style against her changes and admonishments is a triumphant passage. It's not a show-stopping monologue but a conversation that I'm sure many author has either had with an editor/publisher or has dreamed of having. I loved this book. It is an examination of the pre-war artist's heart, and you can see shades of what the upcoming war is going to mean for the heart of the artists as the world will change forever. This book achieves a poetry that surprises very much because of its ordinary beginnings. While it's not epic in length, it's epic in heart. Great read!"}, {"userName": "Josiah", "userReviewDate": "Mar 22, 2016", "userURL": "http://www.goodreads.com/user/show/1914201-josiah", "userReview": "\"Maybe books are best, because you don't have to have money to read... A man can travel all over the world and come back the same kind of fool he was when he started. You can't do that with books.\"—Old Daniel, The Fires of Spring, P. 42One might wonder after reading this book if the great James A. Michener missed his calling as a novelist for teens. The Fires of Spring is his lone young-adult offering, and it's as sincere and soul-revealing as anything by Mabel L. Robinson, Walter Dean Myers, or John Green, a personal epic on par with the multigenerational adult sagas for which James A. Michener is known. Though in many ways crafted along lines of conventional adult storytelling, The Fires of Spring holds the most good for readers just starting to figure out what life is about, tinkering with their own emotional clockwork to learn what keeps the pendulum moving. Michener was in his forties when The Fires of Spring debuted in 1949, but he understood the ecstasy and sorrow of youth as if he'd been a teenager that same year, and his explanations of adolescence are brilliantly telling. Charles Dickens had David Copperfield, a fictional incarnation of himself by which to disclose his most important revelations regarding life, and James A. Michener had David Harper, though The Fires of Spring may not be all that David Copperfield turned out to be. From his childhood in the poorhouse to his pursuit of relational fulfillment and artistic success in the years ahead, David gradually becomes comfortable in his own skin, able to stand proud in the world and find his niche in its intricate framework. David learns the crucial nuances of life from a dazzling array of homespun, authentic people that surround him always, going from one incredible surrounding cast to another, each distinct, evocative, and richly rewarding as they influence David for good and bad. If this book's chief strength isn't its sterling philosophical core, it's the bounteous assortment of characters we mingle with for its four hundred eighty pages. \"But thinking is something different, altogether! Think always as if the hot hand of hell were grabbing for you. Think to the limit of your mind. Imagine, dream, hope, want things, drive yourself to goodness. Whatever you do...do it to the absolute best of your ability. Never take the easy way where thinking is concerned.\"—Old Daniel, P. 42David is an orphaned eleven-year-old in the poorhouse as the story opens. His Aunt Reba is sort of his keeper, residing in a room of her own in the women's wing, but David is raised by the poorhouse men more than Reba: sage Old Daniel, flawed Toothless Tom, Luther Detwiler the mad Dutchman, and others. The men enthusiastically support David in everything he does, and Old Daniel won't let him get away with slacking off in school. It's too easy for a good man to land in the poorhouse and bleed out the remainder of his days there, and Old Daniel isn't having that as David's future. There will be no cradle-to-grave care for this bright, talented boy. There comes a day when Old Daniel is no longer around for David, his frail body giving out under the strain of ill health and inadequate medical attention, but David stored up carefully the advice of this elderly man who so cared for him, and Daniel's words never cease to echo in his thoughts. \"But in spring, of course, any place is beautiful, because in spring fires leap from your heart, and you can see things that aren't there.\"—Old Daniel, P. 42As he becomes a teenager, David intentionally differentiates from his ruthlessly frugal aunt. Reba sees no use in education for a boy at the bottom of the social pyramid, and plots to remove him from the school system as soon as the law allows and force him into a minimum wage job. David believes there's more to life than breaking his back for a few grimy dollars; Old Daniel impressed that deeply on him, so David heads off his aunt's effort to get him a dead-end job by landing a summer gig of his own at the local carnival. There David learns the universal struggle between the haves and have-nots, in the form of the continuous con war waged between paid ride attendants and carnival executives for the money the place rakes in daily. Nearly every employee at the carnival has a system for skimming money off the top to keep, but they can't steal too much or the bigwigs bust them. It wouldn't behoove David to lose his livelihood and wind up in jail at fourteen. David meets Mary Meigs while employed by the carnival, a mover and shaker a few years older than he who looks to be going places as a showbiz star in the boom economy. He meets Nora as well, also a few years older, who has limited marketable skills other than in the world's oldest profession. Nora earns her cash in a darker part of the carnival grounds, under the proprietorship of a dealer in vice named Max Volo, a guy with an eye toward a future in organized crime. It isn't with the alluring Mary Meigs that David has his first carnal experience with a girl, nor is it the quiet Quaker girl Marcia Paxson, whom he's known since his days in the poorhouse. It's Nora he has intimate knowledge of first, Nora who teaches him more about relationships than anyone before or after her, a girl he plays house with before understanding what it means to be a man and shoulder the attendant responsibilities. With Nora there's a spark that never flared with Marcia Paxson, a joie de vivre that draws him further into her lifestyle of debauchery for pay. It is here at the carnival, wrapped in the arms of Max Volo's star call girl, that David learns the most aching lesson of his life, a lesson destined to color the rest of his days. \"We all hurt other people, especially those we love...civilized people were the ones who had learned to hurt according to rules.\"—The Fires of Spring, P. 248\"Never be ashamed of anything! If you've made a fool of yourself, just don't do it again. But being ashamed is only being a fool twice for the same reason.\"—Mona Meigs, The Fires of Spring, P. 218David's roller coaster doesn't end at the carnival. He's a basketball high-roller in high school, sinking shots as the team's top scorer beside enforcer Harry Moomaugh, primary rival for the affections of Marcia Paxson. David miraculously is awarded a full college scholarship after graduating twelfth grade, though he has no idea who fronted the money for a poor kid's higher education, and he sets off for the hallowed corridors of fair Dedham. University immersion is enthralling and constantly challenging despite the majority of teachers not caring enough to rise above the pabulum of their curriculum, but David encounters a few who are willing to put their careers on the line to further the education of the young minds in their care. It's at Dedham that David's concepts of literature and philosophy are tested, fresh light shed on tired academia. David finds he has a talent for writing, one hinted at a few times earlier, such as in his brief encounters with legendary March King John Philip Sousa, who led the band at the canal near David's carnival. It's different to be a talented boy, not a mere ticket taker or one of many hoping to graduate Dedham in four years. The handful of committed teachers do their best to prepare David for success, but even the best of professors can't totally brace their students for the jungles of the real world once they've departed the sheltered halls of learning. \"A lot of nonsense is spoken about work. Some of the finest men I've known were the laziest. Never work because it's expected of you. Find out how much work you must do to live and be happy. Don't do any more.\"—Old Daniel, P. 42\"I never found a way to tell a good man from an evil one except by what he did. It's popular now to say all men are good and evil both. But I don't believe that. Men are on one side or the other. Of course, sometimes a good man will do an evil thing. But he regrets it. And so will you, whenever you do wrong. And if you do wrong too often, regrets come so easily that you forget what wrong is. Then you've become an evil man, and you're all tied up inside, and you work and fight against others. And do you know why? Because you have no peace in your heart to satisfy you when you are alone.\"—Old Daniel, P. 40Whether he's joining a farewell vaudeville tour and giving nightly performances alongside an outrageous group of personalities (who will ever forget the Gonoph, or Wild Man Jensen?), scrambling to find honest labor as the Great Depression descends on America (Morris Binder and Tremont Clay being as memorable of employers as anyone is likely to have), or winding his way past the pitfalls of romantic entanglement, David never stops learning. His mind is a prism of wondrous observation, prompting insights worthy of a Pulitzer Prize winner. Even as he struggles to get on his feet and solidify his reputation as a writer, David hangs on to the poignant realizations of his youth, slowly drifting away from past mistakes. There's a lot to grasp in one short life, so many vital stray ideas to graft into one's central philosophy, and no one learns it all before the grim reaper comes knocking. But it's a life brimming with riches beyond our craziest fantasy, more exotic than the human mind can conceive, and the elements that contribute to this overwhelming wealth are beyond our ability to numerate. In destitution and affluence, bottomless grief and the affirmation of being toast of the literary world, David learns this paradoxical truth: life doesn't nearly measure up to what he expected, the goals he set and the greatness he determined to fulfill, the experiences he set his mind on having. Yet somehow the dim shadow of the glorious life he envisioned has more substance than he ever imagined, is sweeter and more enjoyable than he thought life could be. How does life fall short of our every expectation, yet outlandishly exceed them all? That's life's mystery: the crazy, wonderful, painfully exhilarating detour we couldn't possibly replicate if given the chance to live it over from the start, the life we recognize in these pages because James A. Michener presents it just how it feels. We can't see that life coming as kids because it's beyond our ability to comprehend until we've been through it. The Fires of Spring is a savory banquet of that life as few but Michener could prepare it. \"For this is the journey that men make: to find themselves. If they fail in this, it doesn't matter much what else they find. Money, position, fame, many loves, revenge are all of little consequence, and when the tickets are collected at the end of the ride they are tossed into the bin marked FAILURE.But if a man happens to find himself—if he knows what he can be depended upon to do, the limits of his courage, the positions from which he will no longer retreat, the degree to which he can surrender his inner life to some woman, the secret reservoirs of his determination, the extent of his dedication, the depth of his feeling for beauty, his honest and unpostured goals—then he has found a mansion which he can inhabit with dignity all the days of his life.\"—The Fires of Spring, P. 474\"(I)f you did not read when you were young, you might never catch the disease and then what would be the use of living?\"—The Fires of Spring, P. 117This novel is such a treasury of wisdom that I haven't the room to discuss it all here, but I want to cull as many deserving passages as possible. When eleven-year-old David learns that the Greeks won the Trojan War, he indignantly pens a version of the story where the opposite occurs. Old Daniel's response? \"But the good people don't always win, David.\" But David is adamant. \"When I write a story, they win\". Isn't that the crux of writing, clarified so early in Michener's first novel? Writers write to create what they believe is the proper ending. They have power to reverse injustice with a flick of the pen, a power that shouldn't be discounted. The indomitable spirit of the writer cannot be stolen away. David doesn't mind the drabness of the poorhouse throughout his youth because he isn't confined there in his mind. In the books he reads and the anecdotes of the other men he adventures elsewhere, without care for what privileged members of society think of him. Not until the poorhouse men gather their meager resources to buy him a nice suit to attend Quaker meeting with Marcia Paxson's family does David feel the deprivation in which he lives. \"In his old poorhouse clothes he had walked with kings, fought at Troy, wandered across Arabia, lived in a mill with Rembrandt, and made a dozen friends. It was the new coat that put him in a poorhouse.\" The prejudices of the outside world have a way of crashing in like that, though we keep them long at bay. \"(N)either a man's greatness nor his goodness can be measured by the happiness he has attained.\"—The Fires of Spring, P. 194David entertains heartfelt advice from orchestra leader Klementi Kol more than once, though their friendship has its tension. Mr. Kol's words to teenage David about love are invigorating and inspiring. \"A young boy who has not fallen desperately in love has missed getting started in the world of feeling. At any age love is wrong only if it means nothing... You must be the criterion of any love...There's only one test, David. Does the love you feel make you a bigger and a stronger person?... (I)f any love makes you stronger and more determined to share, then it's much finer than most people ever attain.\" Mr. Kol also has practical counsel on relationships. \"If a relationship is spiritually sound, a minor question still remains. Can it hurt you in some other way? Will it cost you your job? Will it prevent you from getting ahead? Might it alienate your friends?... There's nothing more difficult in life than answering those questions about a sexual relationship that is spiritually very right... You'll see more men kill themselves spiritually that way than any other. They love a girl but feel she won't help them to get ahead, whatever that phrase means. And so they make the terrible compromise, and when they're fifty, they're ahead...and they are desolate.\" But there's more extraordinary insight from Mr. Kol. \"I am sure old men forget what it was to be young and to be wholly in love. Not even I can remember those breathless moments. That's why they give old men important jobs and big salaries and orchestras to lead. To pay us back for the terrible loss we have sustained.\" Wow. That certainly goes to the heart of things. A little later David has a similar epiphany of his own, which could be deemed the cornerstone of The Fires of Spring. \"He wondered how men could live till they were seventy if they endured such passions as he had known that fifteenth summer, and although he knew many things...he did not even guess that men are able to live because slowly, one by one, they snuff out the fires of spring until only embers burn in white dignity, in loneliness, and often in cold despair.\" Enormously powerful. Is that the tradeoff for adulthood independence, losing the emotional tenor of youth? Must one's sensitivity and fervor ebb as spring transitions to summer? Such a bereavement seems too awful to consider for those in the throes of young love. David recalls more advice on love and zest for life from Mr. Kol a few pages later. \"If you see a picture you like, stand before it until your head swims. You can never see enough beauty. Play music that you love a thousand times. Take all experience into your heart. That's why, with Nora, you have a right to love her as long as she brings meaning to you. Because even if love is unsatisfactory, or ridiculous, it's still the best thing we know.\" In a book packed with philosophical highlights, Mr. Kol's musings on love may be the crème de la crème. \"And wherever you go on the face of the earth have the humility to think that a thousand years ago someone pretty much like you stood there and a thousand years from now a boy like you will be there. And in two thousand years boys and places and people will have been pretty much the same.\"—Old Daniel, P. 42  David's thoughts are often a bastion of clarity, such as when he finally understands the depth of his friends' influence over him. \"With profound shock he realized that of himself he was nothing... By his friends he had been taught to understand music and art and logic and sportsmanship and even the rudiments of honesty. He had been a formless thing until the affectionate interest of others had made him into a sentient being.\" Friends uncover the good in us and let us know it's worth sharing with the world. In similar fashion David observes the connectedness of all mankind. \"They were all prisoners together... They did frightful things to one another in their fear, and even a man like David might consider fleeing the burning tent to save himself while others perished, but they were all members of the same companionship... He...saw the world for the first time as a superb flowing organization of people of which he was not the selfish center. Whether he lived or died was of no moment; and that discovery—which many young men never make—was the threshold by which David passed from callow youth to manhood. He was unimportant; therefore he was free.\" But of all David's discoveries, his final realization of love is paramount. \"He found that love is never to be defined, that it grows and changes with every year of life, that each person knows it as a different miracle... Nothing can shame it. Nothing can make it more splendid than it already is. Shared, wantoned or hidden forever, it can fill a life. There is no understanding love, and there is no defeat so precious as trying. No aspect of life is more complex, and none so simple. A look, a word, and the heart is torn forever; a touch, and it is mended. Love is brave and cowardly. In the same person it is secret and garrulous. But above all, love establishes its own rules and no man can know its complete manifestation in the heart of another.\" I want to call that the centerpiece jewel of this book, but there are several equal candidates. Who can fathom the human heart in its splendid complexity?\"That's the world that matters. The world where people glitter like diamonds with a million facets. Where people are like pearls, luminous as nacre on the surface but each with a speck that would destroy it if you were looking only for specks.\"—Morris Binder, The Fires of Spring, P. 375\"Poets are simply people who see things two ways. Like children, as if they had never seen them before. Like old men, as if they would never see them again.\"—Claude, The Fires of Spring, P. 451The Fires of Spring is good enough to be an all-time YA classic, an overflowing casserole of human experience baked to near perfection. Veterans of life will recognize its impossible-to-counterfeit charms all through the novel. I give The Fires of Spring three and a half stars, and I'll round that to four; I can't praise it enough for what it is. Whether or not James A. Michener missed his calling as potentially the greatest young-adult writer in American history, we're fortunate to have one teen novel by which to wonder what could have been had he devoted his career to the genre. I'll sure never forget The Fires of Spring."}, {"userName": "David (דוד) ", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/5431286-david", "userReview": "Rating: 3.33 starsThe Fires of Spring by James A. Michener is a coming-of-age story of a poor kid, raised initially by his 'evil' aunt in the United States of America, and set in the early times of the twentieth century (1910s-30s). The story is about everything that he learns and the ways in which he learns them with different means. Starting with his life in a poorhouse, working at Paradise Park, his way into the university, working in the theatre, and his ambition to write a book. The above is integrated with various kinds of people in his life, from people who help to people who cheat and several in between, his love and professional life, ambitions, his philosophical understandings of life and arts, understanding his own self, and such.I liked the book, but I did not enjoy it as much as I wanted. This book is unlike the author's historical sagas. But, we do come to know a bit of life in the Americas in the early part of the previous century. Since I come from the East (South Asia), I could not connect directly to much of the things, due to the cultural differences, and due to my differing views about \"discovering oneself\", which probably is the reason that I could not enjoy the book as much. I was expecting a bit more of discovering oneself from a spiritual point of view, and this book contained absolutely nothing nonetheless so. Also, it seems that the book is dated, although I am not sure I should say that since it is a bit of an historical fiction. Despite this, I think readers may like reading this book, especially fans of the coming-of-age genre, and also if someone is interested in the setting. Michener's writing style is amazing as usual. Quite a few good quotes and paragraphs within the text. A few things to ponder upon here and there.A passable read. Probably can be skipped. Yet it is not bad."}, {"userName": "Chuck", "userReviewDate": "Jun 24, 2009", "userURL": "http://www.goodreads.com/user/show/1829239-chuck", "userReview": "The first Michener novel I ever read - over 30 years since I picked up my sister's paperback copy. Found a hardback edition online. An opportunity to relive this great coming-of-age story, which hooked me into Dostoevsky and several other classic authors whose works are discussed and quoted in the book. A big influence on my life at the time."}, {"userName": "Lisa", "userReviewDate": "Jan 27, 2010", "userURL": "http://www.goodreads.com/user/show/3185665-lisa", "userReview": "I enjoyed it. Early Michener, filled with his usual philosophical observations and anticipatory exclamations. It was before he wrote the research-oriented books, and I'm sure it's semi-autobiographical. In any event, he is so good at describing where he is that it does give the reader a great sense of life in the U.S. circa 1920-1934."}, {"userName": "Sonia Reppe", "userReviewDate": "Dec 04, 2014", "userURL": "http://www.goodreads.com/user/show/455200-sonia-reppe", "userReview": "It's the first James Michener book I've read and one of the best books I've ever read. I have mixed feelings about the end, about the girl David ends up with, but I mostly loved the story and the writing, which is so alive."}, {"userName": "Agbonmire", "userReviewDate": "Jun 09, 2010", "userURL": "http://www.goodreads.com/user/show/3314371-agbonmire", "userReview": "In my list of top ten books. I read it as a youth and it moulded my life and gave me understand myself better - because in many ways I am like Harper.I reread it recently and I still felt it's beautiful sting."}, {"userName": "joan", "userReviewDate": "Jul 11, 2011", "userURL": "http://www.goodreads.com/user/show/5607729-joan", "userReview": "One of my favorite books. Have read, and re-read many times. Michener draws me in without fanfare or drama."}, {"userName": "Wally8541", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/2643659-wally8541", "userReview": "Still one of my favorite books. This novel was the launching pad of my reading all the books I read as a youth and that I emerald even to this day."}, {"userName": "Jackie", "userReviewDate": "Oct 29, 2008", "userURL": "http://www.goodreads.com/user/show/1666562-jackie", "userReview": "I love Michener. Whether it's something he wrote in the '60s or in the '90s, he always engages me with his storytelling abilities."}, {"userName": "Deb", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/5914367-deb", "userReview": "Only Michener book I truly adored. I really liked seeing the world through the eyes of the protagonist. I recommend this one."}, {"userName": "Elaine", "userReviewDate": "May 23, 2008", "userURL": "http://www.goodreads.com/user/show/355366-elaine", "userReview": "I read this book in High School and then again a few years ago. I really enjoyed it, both times. It was actually one of the only books I fully read in High School."}, {"userName": "Steve", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/1355442-steve", "userReview": "Finally finished this…only took me three years!!I actually liked this quite a bit, but I felt that young Michener was a little draconian in his declarations. In theory this is a semi-autobiographical look at how he grew up to become a writer. While elements are certainly relatable (the poorhouse, Doylestown, his orphan status), I'm not sure about the rest of it…for instance, I'm not so sure he was a carny. But I could be incorrect. Anywho, the book follows an orphan from the poorhouse through his marriage (and presumably entry into adulthood). It's broken into four sections…his life as a young boy in the poorhouse and high school years as an athlete as well as a scam artist at a carnival; Life as a college student outside Philly; Life as a traveling actor with a troupe and finally life in the early depression years of struggling to find work and be a writer. I enjoyed all four parts, but in each I found myself agitated with the actions of the main character - specifically why he spent time with the people he did. David routinely indicates that he never disliked anyone, except his Aunt. Yet, while he liked everyone, they mostly ultimately treated him like crap and he responded by doing things for them and giving them money. Mona is probably the prime example of this. She started okay, but by the end she was more loathsome than Ruth in Of Human Bondage. It just seemed like he was a little too giving and I found it irritating. The real story here, however, is the path that he follows to find himself. Some questionable decisions are included but ultimately he winds up where he was destined to be, with only a few bumps in the road, proving along the way that he was a good person.So…a couple of things. Lots of sex in here. Michener, David and my Grandfather were all the same age. Everytime David talked to a girl he basically molested her as soon as possible. Frequently this was uninvited and ultimately repulsed. I'm okay with sex and whatnot, but David was a little sad in his advanced. Frankly, it bordered on uncomfortable. Given the time (1925 or so) it seemed out of line. I can't imagine my grandfather doing that and it doesn't fit with my impression of the era. I know, I know…\"we need a man like Herbert Hoover again.\" They weren't angels in the twenties, but this seemed like something I'd see on a high school kids instagram page (apparently the kids don't use Facebook any more. Secondly, the cover. I actually cut out of a piece of paper and covered this for my committing trips. The creepy dude (actually somewhat fitting) and the girl was just embarrassing to carry around. The title doesn't help either. Shame on me for not springing for a different copy with a better cover - but pretty sure I got this for a dollar.So, ultimately, this book got a 3 star mark, borderline 2, because of the thesis at the end. Spoilers. What I gathered out of the last thirty pages with David's ultimate decision to write and Marcia belief in him is not a personal struggle, but a belief that if you don't write, paint or make music you've given up. I find this to be utterly ridiculous. Essentially, David was able to survive in the hardest part of the depression because he stumbled upon a women who was willing to let him live for free. Marcia managed to let a room from a family who had no income, but let her live there for apparently nothing. Effectively, they are saying that you should chase your dreams no matter the cost, or your life is a waste. Look, that's great, but there are several problems here. Not everyone has a generous neighbor willing to let them try their passion. In 1933, most people would be freezing and starving to death in a hooverville. Today, you'd be in a cardboard box. Hard to type with frostbite. Also, there are other pursuits that are worthwhile. Raising kids for one…and frankly starving in a cardboard box isn't feeding my animal of a two year old. Lastly, not everyone is inclined with ability or desire for the arts. Truthfully, I'd love to be a writer. If you told 20 year old me that there was a 25% chance you'd make it and 75% chance you'll wind up dead in a gutter - I would have at least thought about it. And I've got a pretty great family support system that might have let me run with it for a while. But, I don't think 25% was even likely, so I worked my butt off in soulless corporations. Is it awful and horrible - yes. Are the companies bad - yes. Would I rather be pouring my heart out on paper…yes! At the same time, I got to travel through Europe and the US as well as provide a good life for my kids. Was I playing the percentages - yes! But given where I'm at, I'm happy of the decisions I've made. My life isn't perfect. But I haven't quit and given up and lived a pointless existence because I didn't pick up the pen. I found the insinuation I little insulting. Plus…I get to rant and write here! Damn Quakers. I digress…still love you Minch…No idea where I picked up this copy. But its been on the bookshelf for a while. Actually, I've never, ever seen another copy, so glad I grabbed it. Was probably a dollar. Back in 2012 or 2013 I finally moved Hunchback out as my \"car\" book and in as a regular book. This replaced it and I promptly read the first 20 pages over the course of probably two years. At one point, I took it to work and read about 20-30 pages in one commute…only to promptly replace it with something else that I became enthralled with - not sure which. So, it went back in the car. After finishing the \"google\" book I was looking for what to read - I thought of this sitting lonely in the glove compartment. Gave it a whirl. Sort of a monkey off my back. Now, if I can only finish off Tristram Shandy."}, {"userName": "Sharman", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/9290194-sharman", "userReview": "His first published novel. No one writes like Michener. Wonderful."}, {"userName": "Donald Schopflocher", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/9911544-donald-schopflocher", "userReview": "First coming of age novel I remember reading."}, {"userName": "Mark Oppenlander", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/2138167-mark-oppenlander", "userReview": "This book is the rambling, somewhat melodramatic rags to riches tale of a young man who grows up in a poorhouse and eventually becomes a professional writer. Along the way he finds somewhat dubious work in an amusement park, is anonymously sponsored with a scholarship to go to college and then wanders the country with a group of traveling actors before finally settling down in NYC editing pulp magazines. There are a lot of characters of ill repute who appear along the way, and the protagonist, David Harper, makes several questionable choices himself. He comes across as a bit callow, which is part of the point of the book, I suppose.As I read this, I suspected that it might be at least partially autobiographical, a fact later confirmed by several reports I read on-line. As a fictionalized account of real events, it works well enough, although as in many narratives taken from the real world, it does wander a bit. I think Michener could have been a touch more selective or focused with this novel.I also felt that Michener elevated too many elements of the story - characters and incidents - to the level of highest importance, ultimately weakening the book. If everything is highlight reel material, there really can be no peaks and valleys, right? The literary flourishes used to draw attention to the major themes of the book are also distracting, and seem the work of a young writer who has not yet learned the gift of understatement (this was only Michener's second book and his first novel).Nonetheless, Michener is a good storyteller, and the tale kept me reasonably attentive through all five hundred pages. This is an interesting glimpse into certain aspects of early 20th century life and a decent coming-of-age story - although you may at times wish that Harper would come of age more quickly!"}, {"userName": "Philip", "userReviewDate": "Aug 22, 2010", "userURL": "http://www.goodreads.com/user/show/348969-philip", "userReview": "Published in 1949, this was Michener's second book and first novel (\nTales of the South Pacific\n was actually a collection of connected stories, and was the first winner of the \"Pulitzer Prize For Fiction,\" which until then had been known as the \"Pulitzer Prize For the Novel\") and is largely autobiographical.A 'bildungsroman' is defined as \"a type of novel concerned with the education, development, and maturing of a young protagonist\" and \"a novel concerned with a person's formative years\" - \nThe Fires of Spring\n was certainly Michener's 'bildungsroman' - while Michener was raised in a large foster-family rather than the poorhouse, it's obvious that many of the experiences attributed to David Harper in this novel were probably Michener's. There are many colorful characters in this novel, and Michener focuses on them (once he began writing his epics, he was often accused of paying more attention to the landscapes than the characters who populated them).It's interesting that a hot-shot agent agreed to represent Michener, and then advised that \nThe Fires of Spring\n wasn't publishable, and that Michener should look for another like of work (he was actually still employed as a textbook editor at Macmillan)!The novel begins just after the first World War, and as it closes, in the midst of the Great Depression, the show of war is once again cast."}, {"userName": "Hoyt", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/4363879-hoyt", "userReview": "A surprisingly philosophical coming-of-age story, that made me mark passages in a book for the first time in ages. Much of the book is a pretty standard tale of a kid growing up, making mistakes, trying to find himself. Every few pages though, you are presented with some deep philosophical musings on people, art, morality, love, conflict, etc. At several points, I had to stop reading and just think about my own life, which really doesn't happen often with my normal reading choices. After finishing, I now feel inspired to read some classics, and maybe try to do some writing myself. Recommended for aspiring writers. (Warning note: this was published in the 1940s, so can be a bit racist in its descriptions of certain characters. I don't think it was done in a mean-spirited way, it's just a product of its times..)"}, {"userName": "Julie", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/1607944-julie", "userReview": "This is early Michener -- a coming-of-age novel about a boy growing up in the Midwest during the Depression. My father often told me that it was the closest description he ever read of what life was like during that time. Dad's early childhood was in Oconto, Wisconsin. It's been on my to-read list for a long time, and now, even though I can't discuss it with him, I'll read it with him in my heart.I'm nearly finished. I'm enjoying the story, but don't really see what Dad must have seen. The book seems to be at least semi-autobiographical with a story that does not match at all what I think my father's experience was like. I don't think the writing is all that great, either; it's not terrible at all, but it bugs me from time to time.But I settle into bed and open the book thinking, \"Ok, Dad, let's see what happens next.\""}, {"userName": "Christopher Sutch", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/2475981-christopher-sutch", "userReview": "To say that Michener's first novel is unreadable goes a bit too far. In fact, the style is smooth if not very artful (people \"beam\" at each other, or \"smile\" or do other things that lack any sort of real description). The problem is, rather, that everything that happens in the plot is utterly banal and boring. The novel is semi-autobiographical; I suppose that it may even be a story that Michener felt he must tell (or that he adhered too closely to the advice, \"Write what you know\"). Worse, these banal things keep merely happening; there is nothing at all reflexive or enlightening about them, or that gives any sort of commentary on life more broadly considered. Everything happens and yet nothing really does. This book is entirely forgettable and can be skipped even by Michener's fans."}, {"userName": "Chesleyorama", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/1213889-chesleyorama", "userReview": "Drawn to the book by the quote (gender neutralized from he to they): 'For this is the journey that humans make: to find themselves. If they fail in this, it doesn’t matter much else they find. But If a person happens to find oneself- if they knows what the can be depended upon to do, the limits of courage, the positions from which they will no longer retreat, the degree to which they can surrender their inner life to someone, the secret reservoirs of their determination, the extent of their dedication, the depth of their feelings for beauty, their honest and un-postured goals-then they have found a mansion which they can inhabit with dignity all the days of their life\"James A. Michener - The Fires of Spring"}, {"userName": "David Miller", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/30543495-david-miller", "userReview": "\"The Fires of Spring\" is Michener's second book: a somewhat autobiographical bildungsroman. The story follows our hero from early boyhood in a country poorhouse to the eve of his marriage. I like Michener's personal books very much: I call them personal because they follow specific people and the main character is the author's alter ego... as opposed to his cultural or place books, that follow a whole country or a whole people. This book is a real page turner. I love that Michener is not an ideological writer: he writes about real people undergoing the messiness of real life. And of course Michener learned to write before TV became the national educator, so his books are not TV plots."}, {"userName": "Tress Huntley", "userReviewDate": "Jul 16, 2011", "userURL": "http://www.goodreads.com/user/show/4428489-tress-huntley", "userReview": "Read this on a friend's recommendation, though I was admittedly put off by the age of the book. I think as a narrative, it holds up extremely well over time. I didn't dwell too much on the qualities of style, characterization, etc. Because it seemed beside the point. It's pretty typical Michener: historical fiction rooted in an American setting, although in much less of a \"hit you over the head\" way than his many other geographically named works. I think this was only his second novel, so I guess maybe he was still warming up to his full blown History of America quest. I would recommend it as a quality \"coming of age\" read, especially for male readers. Do men read? I can't seem to find any that do anymore."}, {"userName": "Aditya /", "userReviewDate": "Jan 02, 2012", "userURL": "http://www.goodreads.com/user/show/1977739-aditya", "userReview": "This book started as a 5 star book, then became 4 stars, then 3 stars, then 2 stars, then 1 star. Throughout the book, the writer's talent was amazing. Initially I thought this book was nobel-prize worthy, but then it just got worse and worse and worse and worse! The talent was still there, the book just became unpleasant to read. I think it should be split into 4 novellas and that noone should read past the 2nd novella, or that everything past the 2nd one (everything after Dedham) needs to have some scenes changed here and there."}, {"userName": "Mathew", "userReviewDate": "Sep 28, 2008", "userURL": "http://www.goodreads.com/user/show/202888-mathew", "userReview": "One of Michener's early novels, and for all it's flaws it's really astonishingly good. You don't really find stories like this any more.It's the story of a young man who grows up essentially an orphan, not too long after the turn of (19th) century. You could call it a coming-of-age novel, and it is, but that doesn't really begin to capture the energy and vitality of the characters.As well as a good read, it's a pretty insightful portrait of an America that no longer exists. And that is probably for the best, yet the portait is fascinating all the same."}, {"userName": "Robert", "userReviewDate": "Mar 21, 2012", "userURL": "http://www.goodreads.com/user/show/5977125-robert", "userReview": "I've read most of Michener but somehow didn't run across this. Initially, I had difficulty getting past the temporal references and general antiquated wording, but once you commit (as it appears impossible not to), the journey is very worthwhile. Expectations are continually ... deferred, and once you understand that you cannot micromanage reading Michener, his pace of development of character, plot, and style take over. Must read. Give to all your young friends and relatives."}, {"userName": "Art Denn", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/34942936-art-denn", "userReview": "As close as you can come to an autobiography, though fictional. It is the story of David Harper, literally from a Pennsylvania poor house to his first writing in New York. Lots of insights into Mennonites, to working in an amusement park, to the delights of the Chautauqua circuit, to growing into an admirable man."}, {"userName": "Richard", "userReviewDate": "Dec 22, 2012", "userURL": "http://www.goodreads.com/user/show/12496455-richard", "userReview": "His first novel I believe. Not a historical novel in the sense of what he later became famous for, but seemed like it was autobiographical. It's been a while since I read it, but I know I liked it a lot."}, {"userName": "Derik Scudder", "userReviewDate": "Feb 29, 2008", "userURL": "http://www.goodreads.com/user/show/952979-derik-scudder", "userReview": "Michener's second book. Thus far it's been about an orphaned boy who grows up in a poorhouse under the tutelage of some wise poor-men, a couple good teachers, and a basketball coach... A feel-good coming of age story thus far, I'm looking forward to seeing where Michner takes it..."}, {"userName": "Marinelle", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/55333476-marinelle", "userReview": "An all time favorite of mine. He presents it as fiction, but underneath that façade is e a poorly disguised autobiography.One has to read more of his later books like Memoriam to really appreciate this."}], "description": "\"A warm-hearted, readable story, crammed with lively incident and remarkable characters.\"THE ATLANTICDavid Harper was an orphan, loney and impoverished. But his longing to embrace the world that abandoned him was stronger than the harsh realities. And even though he's a con man and petty thief at a carnival, he still dreams. For it was there that David learned about love and about women--all of whom taught him the riches of himself. Here is a rich segment of American life--a magic blend of longing and wisdom, saltiness, simplicity, and compassion.", "title": "The Fires of Spring", "url": "http://www.goodreads.com/book/show/431203.The_Fires_of_Spring", "average": 3.89, "cover": "https://images.gr-assets.com/books/1328038348l/431203.jpg", "reviews": 46, "authors": [{"url": "https://www.goodreads.com/author/show/7995.James_A_Michener", "name": "James A. Michener"}], "type": ["Fiction", "Historical", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/431203.The_Fires_of_Spring", "http://www.goodreads.com/book/show/1107908.The_Fires_Of_Spring", "http://www.goodreads.com/book/show/1656560.The_Fires_of_Spring", "http://www.goodreads.com/book/show/6124695-the-fires-of-spring", "http://www.goodreads.com/book/show/573390.The_Fires_of_Spring", "http://www.goodreads.com/book/show/3074960-fires-of-spring", "http://www.goodreads.com/book/show/12658.Hawaii", "http://www.goodreads.com/book/show/12657.The_Source", "http://www.goodreads.com/book/show/133430.Centennial", "http://www.goodreads.com/book/show/12661.Chesapeake", "http://www.goodreads.com/book/show/12663.The_Covenant"]}