{"ratings": 3212, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "3.5 I read her novel The Lace Reader so long ago, I remember little. This book is too difficult to summarize the plot, but the blurb for this book does a fairly good job. The setting and the subject holds a big attraction for me, Salem, Massachusetts, the witch trials and modern day Salem. I also love the character Rafferty, the police officer, and his wife Towner, who has a tragic past of her own. Modern day Salem, the past always present, so intriguing. This book is not without its flaws, there is really too much going on at times, but it makes for a fast paced novel and I avidly kept turning the pages. Also fascinating was the character Callie, music therapy and the treating of pain with singing bowls. Again fascinating, had never heard of this but definitely want to learn more. The location of the hanging tree, and other reality based facts are included in the author's afterword. I was surprised at how much was actually true. Good storyline, interesting setting and characters, family secrets but will admit my rating was influenced by my interest. Look forward to her next though and hope its not too long a wait.ARC from publisher."}, {"userName": "Rita", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/22264452-rita", "userReview": "Modern day witch huntI have been dying to read this book ever since I read an excerpt several months ago. I have always been drawn to the idea of witchcraft and people possessing special powers in books, movies and occasionally TV shows. Brunonia Barry weaves an excellent tale of witchcraft past and present in where else but Salem Massachusetts.It is Halloween night in 1989 and three beautiful young women also known as The Goddesses have just been brutally murdered. There is a five year old girl hiding in the bushes, the daughter of one of the victims. In her hand she is clutching a strange wooden rosary with a flower with five petals. When she is discovered and they remove the rosary, the impression of the flower is embedded in her hand. The only other witness is a woman named Rose Whelan, a noted historian who is now incoherent except for babbling about the banshee.The three women and one other who cannot be found, were descendants of women who were hung as witches in 1692. The four of the petals stand for the four Goddesses but who is the fifth petal for? We jump ahead to Halloween night in 2014 and another death. A group of young boys are bullying Rose Whelan who is now unkempt and homeless. One of the boys has drawn a knife and is threatening Rose to the point that he actually cuts her. Suddenly there is an earth shattering screaming noise and the boy drops dead. When the police arrive all Rose can say is that the banshee did it. A modern day witch hunt is started by many of the people of Salem who believe that Rose murdered the boy and the three young women in 1989. When Callie Cahill, the woman who was the five year old girl, hears what has happened in Salem, she returns to be with Rose. With this new death and Callie Cahill back in town, the Chief of police, John Rafferty is forced to reopen the Goddesses murder case. Witchcraft is alive and well and living in modern day Salem.This book has love, sex and witches. What more could anyone want? The Five Petals is well written and paced fast enough to hold a reader's interest. There is a new development around every corner. I would have given it five stars were it not for the fact that I guessed who was the fifth petal and the murderer at least three quarters of the way through the book. I don't feel that it detracted from my enjoyment of the book. There's even a wonderful love story to hold your interest. I had been waiting to read this book and I was not disappointed.Posted on Goodreads and Amazon 9/3/2017"}, {"userName": "Bam", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "My rating falls somewhere between 3.5 and 4 stars. The story kept getting better and better as it unfolded.Brunonia Barry returns to Salem, MA in book two of her Lace Reader series. Chief of Police, John Rafferty, has two murder mysteries to solve--one a cold case that happened in 1989, before he came to town, which involved three young women who called themselves the Goddesses, and another that happened on this Halloween night and involved the death of a young boy. The common factor? A banshee and a woman named Rose--are they one and the same? Callie Cahill, Rose's 'niece,' returns to Salem after she learns that Rose has been hospitalized and may be implicated in the murder. Callie was just five years old and a witness of sorts when her mother, one of the Goddesses, was brutally murdered back in 1989. Callie is an interesting character who still suffers from nightmares and flashes of violent memories. She has been trained as a music therapist but also works with sound therapy to help patients who are in pain, sometimes using music recordings, sometimes using a singing crystal bowl which sets up a sound vibration, soothing to various chakras. That is a very interesting part of the story, something I knew nothing about. For one woman with cancer, Callie has her relax while she plays a recording of Yo Yo Ma performing Bach's Cello Suite No. 1 in G Major, which Yo Yo Ma had said is 'all about flow.' (There's a great recording on youtube of Yo Yo Ma performing six cello suites by Bach at the Royal Albert Hall that is superb to listen to while reading. In the recording, Yo Yo Ma himself says the music can be helpful when going through hard times 'to feel part of a greater whole.' https://www.youtube.com/watch?v=Nu9MD...)She also learns about the solfeggio scale used by the ancients--and experiences the medieval Hymn to John the Baptist in Latin, composed in the solfeggio scale--a healing service. \"It was one of the simplest and deepest meditation experiences she'd come into contact with--and definitely healing.\" Solfeggio recordings can also be found on youtube for those interested: https://www.youtube.com/watch?v=fVgWb...The mysteries come to a very satisfying conclusion with some dogged police work and a little help from magic. I am enjoying this series and look forward to book three.Thank you to NetGalley, the publisher and author for the opportunity to read an arc of this book."}, {"userName": "Maya", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/22343553-maya", "userReview": "I really enjoyed this story. It's not what I usually reach for but I'm so glad I got to read it. The story starts off with this mysterious wibe and that immediatelly catched my attention till the end of the book. When you start reading, you simply have to find all the answers and unravel the hidden secrets these people try to hide. I felt like a woman on a mission and it felt wonderful. I'm not giving away any plot but it's safe to say this story doesn't disappoint. What a great read!"}, {"userName": "Susan Johnson", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/5172713-susan-johnson", "userReview": "I wish I could have liked this book more than I did. It's the second book in the series but the first came out over seven years ago. My memory is sketchy and I can barely remember what I read last month let alone seven years ago so I think the author could have given us a better rehash of the first one so things would have clearer. On top of that, the plot is quite convoluted so I was lost quite a few times. In the 1980's three young women were found brutally murdered. They were called the Goddesses and were involved in some type of sexual arrangement. One of their daughters was found crying in a thorn bush the next day with a rosary in her hands and the image burned into her palm. These girls were all related to five women hung as witches in Salem in the 1600's. There is also an older woman, Rose, who acted as the Goddesses caretaker, who has turned into a homeless woman who talks to trees. A murder of a young boy believed to have been killed by Rose brings Callie, the young girl, back to town. She has not been there since she was removed by the nuns after her mother's murder. Enough mystery? No, indeed. Rose is talking to trees to discover the correct tree the witches in the 1600's were hung from. Why this matters is beyond me. There is also a feud between two long standing rich families. There are several modern day witches who keep their fingers in the pot. There is a home for abused women who have assorted problems. I begin to wonder just how many separate plot story lines I can keep track of at one time. Finally I breath a sigh of relief. The book is over. I really don't care about any of them by this time. I think editing 75 pages and reducing the number of plots would have helped this book immensely. It's too bad because the parts about Salem in the 1600's were quite interesting but brief. I was really disappointed in this."}, {"userName": "Wendy", "userReviewDate": "Mar 25, 2017", "userURL": "http://www.goodreads.com/user/show/1418580-wendy", "userReview": "I have always been fascinated with witches and the story of Salem. In Brunonia Barry's \"The Fifth Petal\" (the 2nd book in The Lace Reader series) we are, once again, transported to that town where she fully captures the essence of present day Salem and its dark and mysterious history. In 1989, three young women are brutally murdered and the crime hasn't been solved. The victims were believed to be witches and their descendants were women who were hanged for being witches in 1692.Callie's mom was one of the women killed that horrific night and 25 years later Callie returns to town to see if she can figure out what happened. With the help of the police chief together they uncover haunting secrets, discover missing pieces to the puzzle and end up involved in the supernatural.This story is a blending of mystery, suspense, romance and family drama.An intriguing and well-researched novel about the history of the Salem witches and their influences in present day Salem.Thank you to Net Galley and Crown Publishing for an arc of this novel."}, {"userName": "Thomas", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/24360539-thomas", "userReview": "This is a book of multi generational wrongs and revenge. It starts with a triple murder in 1989 Salem,Mass. and moves to present day Salem. The book makes periodic references to the Salem witch trials in 1692. A teenager dies after threatening Rose Whelan, considered to to be the local crazy lady. She was one of two survivors of the 1989 triple murder. She was found covered in blood and while some suspected her to be the murderer, this was never proven. The other survivor is Callie Cahill, then a 5 year old daughter to Olivia Cahill, one of the three victims. Callie is living in another town and was told by nuns who adopted her that Rose was dead. When she finds out that Rose is alive, she returns to Salem. Callie is a musical therapist,i.e., she uses music to heal people.Rose talks to trees and claims a banshee living inside her killed the teenager. Rafferty is the local police chief and believes that the 1989 murder case should be reopened. Rafferty is a recovering alcoholic and is dealing with his own problems. But he is a very good cop and keeps digging into the unsolved 1989 case.I thought that the plot moved along very well and the ending tied up all the threads. I did not suspect the killer until toward the end. There is a hint of paranormal throughout the book. Several characters have powers to see things in visions/dreams.Two quotes: Rose--\"Those young women the banshee had killed had been like her own daughters.\"Callie's music therapy: \"Callie circled the rims of the rubber bowls with a rubber wand, the vibrations building as they began to sing, softly at first. then louder, until they were singing in harmony.\" Salem was a thriving commercial shipping/fishing port in the 18th and 19th centuries. Today it capitalizes on its witch history for tourism dollars. The Salem police have a witch on a broom on their shoulder patch.Thanks to Crown publishing for sending me this book through the Goodreads giveaway program.4 stars"}, {"userName": "Marjorie", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/32379875-marjorie", "userReview": "This book has some of the same characters as in “The Lace Reader” though you don’t necessarily need to read the first book in order to enjoy this one. There are some mention of things that happened in the first book. Apparently, more of what has happened between the first and second books will be contained in the author’s next release “Bone Lace”. Although I did read “The Lace Reader”, I don’t remember it all that well so I didn’t quite remember what they were talking about in the mentions of previous happenings but it didn’t take away from the present book.As said, I don’t really remember much about the first book and I feel that a few months from now, I won’t remember much of this book either. I enjoyed the overall ambiance of the setting in Salem, Mass and all the background information about the Salem witch trials, although I’ve read most of that before. Also interesting was to learn about present day Salem and the effects the past has had on it. As for the two witch stories contained in this book, the first surrounded the murder of three young woman known as the “Goddesses” in 1989 and the present-day murder of a teenage boy. Rose Whelan, a respected expert on the Salem witch trials, was the prime suspect in both murders. She claimed that a banshee was to blame.I did like each of the characters in this book and I enjoyed reading the story. However, it was very drawn out and a lot of the book seemed to be just fill in. I had trouble keeping my attention on the book and it never really hooked me. But I did enjoy the basic story and I’m sure anyone who enjoyed “The Lace Reader” will welcome this newest addition.This book was given to me by the publisher through LibraryThing in return for an honest review."}, {"userName": "CL", "userReviewDate": "Dec 18, 2016", "userURL": "http://www.goodreads.com/user/show/10871763-cl", "userReview": "A little bit of madness, a little bit of witchcraft, a little bit of mystery. Callie Cahill witnessed her mother and friends murdered and could not remember any of it. She has lived in another town most of her life raised by the nuns under another name. She returns to town after another murder and thinks she begins to remember what happened. Rose Whelan is accused of Callie's mother's and friends murder when another murder happens of which she is also accused. Most of the residents of Salem believe she killed Callie's mother and friends but Callie knows Rose was protecting her. Now she is up against a force she is not sure of and will need to prove who killed her mother and her friends. I would like to thank the Publisher and Net Galley for the chance to read this ARC."}, {"userName": "Vikki", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/11294629-vikki", "userReview": "\"God will give you blood to drink. \"—SARAH GOOD, 1692Callie was 5 years old when her mother along with her two friends were killed on Halloween when performing a blessing at Proctor's Ledge, the real site of the hanging of the Salem Witches. Named the Goddesses, the woman were the descendants of the original Salem witch hanging victims and had a reputation of bewitching men in Salem. Rose, a historian and mother-figure of the group, hid Callie during the murders and gave Callie a rose rosary, the imprint of which is scarred on Callie's hand due to Callie squeezing it so hard when hiding. Callie went to an orphanage and Rose lost her mind and went to a mental institution. The murders went unsolved for 25 years and became part of Salem's spooky history until a boy mysteriously dies after Rose curses him. Callie who was unaware that Rose was still alive until she saw the news report, comes back to Salem to care for Rose and see if she can get some answers about her past. Callie begins to have visions of her past and tries to help Salem's chief of police, John Rafferty, solve the murders but sometimes leaves more questions than answers. There were suppose to be five people there, a descendant for each of the five accused witches that hanged, so who was the fifth person? Rose keeps ranting that a banshee was released that night 25 years ago and killed the 3 women and the boy she cursed. Were they killed by an evil spirit or something more human in nature? This book is a very slow read. It seems like a lot of people that did not read the first book in the series, The Lace Reader, had the same issue and did not finish it. The plot did not require you to read the first book but the problem may be that you were not invested as much in the characters than you would be if you did. This book went into a lot of mythology and ancient history and New Age medicine so if you are not into any of these or have no previous knowledge of them, I would avoid this book. I was attracted to this book by the Salem witch trial theme to the book but I feel that the author did a good job fleshing out the story with the mythology, history, and the back stories of the characters. What kept me going through the story that the gradual unraveling of the mystery of the murders and what actually lead up to the murders and how all the backstories and the history is connected. I felt it was worth the read and now want to read The Lace Reader. I gave this 4 out of 5 stars on Goodreads. I received an advanced copy of this book from NetGalley for review consideration."}, {"userName": "Jess", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/28497722-jess", "userReview": "When the last sentence of a novel gives you the chills... good lord.. what a read! Fans of the Lace Reader will enjoy a return to Towner and Rafferty's story. However, Towner is more of a secondary character in this one as Rafferty takes the lead in solving the recent murder in Salem that has ties to an unsolved case many years ago. My Reactions: -I need to plan a Salem trip. Barry's descriptions of the town, its revitalizations, and the atmosphere have elevated it on my vacation dream list. -Music therapy bowls and note tones causing effects on the body frequency? Fascinating! Adding this to a future Google search. I love how Barry melds traditional medicine with holistic alternatives. Initially, I was skeptical and worried she'd take it too far; but overall, I think it was tastefully handled. -Banshee lore is interesting, spooky, and deeply tragic. May the poor souls of the destitute women rest in peace. -I was completely hooked, entertained, and absorbed in the story. My laundry pile, carry out container, and hungry animals can attest to that. (No fears, all animal babies were fed with extra \"hammies\" added in restitution). -Read The Lace Reader before this book. You could wing it and get by as a stand alone. I promise you that it will be more impactful is you start from the beginning and know the history. What's It About:  In 1989 Salem was rocked by \"The Goddess Murders\". A triple homicide in which the victims were promiscuous descendants of the original Salem witches. Two survivors of the murders were forever changed. Respected historian, Rose Whelan, has become a shell of a woman. Babbling, incoherent, talking to the oak trees, and essentially homeless. Callie Cahill was five when it happened. The daughter of one of the victims, she was shoved to safety under a bush and marked with a five petal symbol in her palm. Present Day: A juvenile delinquent dies suspiciously on Halloween night. The town calls for Rose Whelan's arrest as the murderer. Rafferty cannot condemn an innocent to prison regardless of the evidence and hearsay. Callie returns to Salem with the intent of helping Rose and discovering the truth of what happened that night. Did a banshee kill those women as Rose insists? Or was there a more sinister human force at work? As Rafferty and Callie get closer to discovering the truth, the lies, the cover ups, and the implications this has on Salem's finest, they realize they might be in over their heads. Highly recommend! And the ending will leave you wondering what will happen next!"}, {"userName": "Bj", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/27341466-bj", "userReview": "4.5 \"A Destiny Intertwined w/ Witches, Trees & A Killer\" Stars!The Fifth Petal is a thoroughly enjoyable jaunt back to one of the most turbulent times in our nation's history: the Salem Witch Trials, as well as, an interesting fictional account of the influence that the horrific events of those times still has on our modern society hundreds of years later. The central theme of this novel is a cold-case, a triple homicide that occurred on the night of Halloween in 1989 and which is tied both to the past (the Salem Witch Trials) and the present day (2014-2015). Set primarily in Salem Massachusetts, The Fifth Petal, also gives us a realistic view of this quaint town, and the tourists it still allures to this North Shore community in search of a piece of history. My reading of this novel was especially timely given that I read most of it on a recent trip to the North Shore of Boston adding an extra spine chillingly effect to this haunting and symbol rich tale.Also for those of you who are wondering whether this book can be read as a stand-alone, it absolutely can. In fact, I haven't read the first book in the Lace Readers Series and had no trouble following the storyline. If you did read The Lace Reader, however, the hero (Sheriff John Rafferty) and the heroine (Towner Whitney) of that book play a central role in this book (although they are not the hero and heroine of this book). As I primarily review romance novels, I also think its worth noting that while this book is mostly a mystery/thriller, there is a romantic spin that is sure to appeal to readers of romantic suspense titles. Therefore don't let the classification of this book discourage you from giving it a try if you like at least an element of romance in your reads.John Rafferty has been asked to reopen a 25-year old triple homicide case with ties to the Salem Witch Trials after another homicide occurs on a Halloween night. The chief suspect of this new murder is none other than a woman named Rose Whelan who survived \"The Goddess Murders\" that fated night in 1989. Since then, Rose's life has taken a serious turn for the worse. Once a highly respected historian--whose major accomplishment was establishing the true location of where the hanging of the Salem witches actually occurred--Rose is now homeless and lives on the generosity of others (including Towner who frequently provides her shelter and meals). Many believe that her involvement in The Goddess Murders has rendered her mentally unstable. The fact that she claims she turns into a banshee who can kill clearly doesn't help convince the residents of Salem that she wasn't the one who committed the murders back in 1989 and thereby by extension in 2014.But Rose wasn't the only survivor of The Goddess Murders. Callie Cahill then just a small child and the daughter of one of the victims of these murders also survived. Surviving this ordeal but marked with a mysterious five petal rose imprinted on her palm from the rosary she clutched that night, many believe she is marked by an evil omen. As a result it is no surprise that she was unable to find someone to adopt her after her mother died and instead lives her childhood years in an orphanage. As an adult, however, she returns to Salem stunned to find out that Rose (who was like a second mom to her as a child--before The Goddess Murders) is still alive--having been told by the nuns at the orphanage that she died that night. Finally having been given back a family member Rose is determined to help prove Rose's innocence and help her reclaim her sanity. In furtherance of her her first goal, Rose enlists the help of Sheriff Rafferty to help her solve The Goddess Murders so that Rose can finally be free of the accusations and stigma that have plagued her the past 25 years. What follows is a whirlwind of clues and slow reveal of a decades old mystery with ties firmly entrenched to the Salem Witch Trials, including that each person involved in the murders that fated night of Halloween in 1989 was a descendant of one of the witches that was hanged. Discovering just how those ties match up is part of the clever way that this mystery is unraveled. But there are many other entertaining and intriguing aspects of this novel, including a prominent man in Salem who is the son of one of the most influential families who seems to take an interest in Callie. But why is he interested and what are his true intentions? In the end, is he truly interested in Callie's best interests or does he have some other ulterior motive? Last but definitely not least, watch for some serious symbolism tied to trees in this unique read.All in all, I really enjoyed every aspect of this one-of-a-kind read. From the difficult to solve mystery, to the witch and magic ties and symbolism, to the unraveling of complicated relationships and complex motivating desires, this book had me firmly entrenched to my seat until the last page had been turned!Source: Review copy provided in exchange for an honest review."}, {"userName": "Monnie", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/6277675-monnie", "userReview": "4 stars out of 5To really enjoy this one, readers will need a taste for the occult. I'm sort of a mugwump on that topic, so I can swing either way depending on the time of day, whether or not I've had my morning coffee and how intriguing I find the material. To the latter end, I had few issues with this book; what happens stretches a bit beyond my conception of possibility, to be sure, but the whole thing was bewitching all the same.This book is connected to another of the author's books, The Lace Reader, although the witching art of telling people's fortunes by looking at images in lace isn't the focus here. Towner Whitney, featured in the first book, appears in this one as well - together with her husband, John Rafferty, who is the chief of police in Salem, Massachusetts. While Towner plays an important part, it's her husband - called in when a teenage boy dies on Halloween night under suspicious circumstances - who takes the lead here.Towner does, however, get the crystal ball rolling by wondering if the boy's death is in any way connected to the horrific murder of three young women in 1989; dubbed \"The Goddess Murders,\" the trio were related to \"witches\" who were accused of witchery in Salem's early years and killed.The daughter of one of the 1989 victims, Callie Cahill, a music therapist, has returned to town. She witnessed her mother's murder back then (she was 5 years old), and was found clutching a wooden five-petaled rose that left its mysterious mark on her palm. At the time, she recalls being saved from likely death by local historian Rose Whelan, a rather strange woman who many believe actually committed the 1989 murders (neither Callie nor John are among them, but they seem to be in the minority). Considered at best to be mentally unstable, Rose's mission in life always has been, and still is, to find the oak tree at which the original witches were hanged in the 1600s; those bodies simply disappeared, never to be found.As the story progresses, lots of skeletons (mostly figurative) are unearthed in the history of prominent area families. Along the way, Callie meets an intriguing young man (and heir to a substantial family fortune) named Paul, who's helping restore ancient churches in Matera, Italy. She's enchanted, but her strange dreams make her wonder if he's really who he seems to be. Scenes shift from Salem to Gloucester, overlooking the beautiful Cape Ann (one of my all-time favorite places to visit, by the way) to Italy to the unbelievably ornate home of Peter's parents. An abundance of Salem's history is woven into the story, and the ending - which wraps things up in an almost too-tidy fashion, IMHO - nevertheless is exciting.I did find it a little difficult to keep all the characters and their relationships (potential and real) straight in my mind. And at times, the story seemed a bit disjointed - jumping from place and time and character with little or no warning. Much of the latter, though, may well be because I read an advance copy (thanks to the publisher and author, via NetGalley, for that opportunity in exchange for an honest review), and the formatting was not what I expect will be in the finished product. It's a thoroughly enjoyable book, though, and I'm giving notice now that I want on the list to read the next installment."}, {"userName": "Catherine ♡", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/48622339-catherine", "userReview": "Actual Rating 2.5Hmm...this book is pretty hard to review as well. The first half was painfully boring, but the second half really picked up and got me interested. Either way, this definitely was a complicated story.The Fifth Petal is a blend of fantasy, mystery, and history. Twenty-five years ago, three women - all descended from Salem witches - were murdered. There were only two survivors: a fourth woman, Rose Whelan, and a daughter of one of the victims, Callie Cahill. The girl was only five-year-old. Then, another murder takes place, and the prime suspect is Rose, bringing Callie back to Salem and throwing her back into the midst of another mystery.The writing style was okay - there were some good scenes, and some boring scenes, but for this book I really think that the writing and plot were very much interrelated. I've read a few books without plot but with amazing writing, but for this one, the writing had to be supplemented by the plot. In the first half of the book, where the book was slow, I felt as though the writing was flat and boring; it wasn't until the story picked up did I start to appreciate a few memorable lines.The plot for this was full of twists and turns - I tried telling my friend about it, and it made both our heads spin. With that being said, I did really enjoy how it was done, but when I got to the reveal, I was a little confused because it felt as though the story had previously been going in an entirely different direction. I had guessed half of it, but - and I'm not sure if this was the author's intention - the other half of the reveal was sudden and a little confusing because it just seemed so out of the blue. Basically - I had no idea that that character was even important in the story.The characters for this were okay, for the most part. After reading it, I definitely still feel a disconnect with most of the characters. (Spoilers here) I really enjoyed Paul and Callie's relationship in the beginning, and I liked them as friends; then they got together and said \"I love you\" and I still thought that was cute. And then he proposed a few pages later and I went:Other than that, I also felt a little disconnected with most of the characters - I think the only one I understood was Callie.But this may have been because of this: I've never read The Lace Reader, and although I don't think I had any problem with this book, I do wonder if I would have enjoyed it more with a little more context about who the characters were.I'm still debating on whether or not I should try to read the first one to see if I can gain a little more background, but for the time being I really don't have the motivation to do so."}, {"userName": "Becky -  Pug and Books", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/50308366-becky---pug-and-books", "userReview": "The Fifth Petal by Brunonia BarryStar rating: ★☆☆☆☆ 1/5Format: ebook galleySummary: When a teenage boy dies, an old cold case in Salem is reopened over the death of three woman referred to as the Goddesses. They were attempting to consecrate the ground that their ancestors, condemned as witches, were hung when they were murdered. The only survivors were a five year old girl and an older woman who was blamed but never had any charges brought against her after she went into a non-responsive state. Review: I received a copy of this book from Crown Publishing via NetGalley for an honest review. I did not like this book for so many reasons. One of the first things that really made me start to to dislike this book is when Callie thinks about how she is really good at reading people which is why she isn't friends with any women. Um?? Excuse me? First of all, what does one have to do with the other? Like it would be one thing if she was like that's why I'm not friends with a lot of people but then the next thing she says is that she's only friends with men. I cannot stand female characters that dislike all other women. That doesn't make your character likeable or relatable. And it honestly wasn't even true because the whole book Callie made friends with a lot of women and only like one man if we don't count love interests? She never made mention of this as a change so I feel like it just wasn't true to begin with and not growth. This book was also super predictable. I figured all the big mysteries out half through and then the book seemed to just drag on forever. I kept feeling halfway that the book should have ended long before. It was slow and boring, often confusing too. It often brought in supernatural elements but didn't really embrace that aspect of the story. There was always skepticism surrounding it so it was never clear. It kept going off into side stories and tangents rather than focusing on the main plot line. Oh! And then Callie describing her mother as having g*psy eyes. What does that even mean? I found one meaning on urban dictionary (only place I could find one) that it describes eyes that change color but Callie later says her mom's eyes were just brown? So I don't understand at all, why use a racial slur to describe eyes? If you used bohemian I'm sure you would have the same effect without using a racial slur. It was just unnecessary and gross.What else was gross was Paul's on and off thing with Ann. He was 25 and she was in her 50s, which wouldn't be anything IF THEY HADN'T STARTED SLEEPING TOGETHER WHEN HE TURNED 18. That's gross. And borderline sexual predator. That was completely creepy and grossed me out. I didn't blame people that tried to avoid her.Ahhh, there's just so many things that bugged me and I disliked that I'm not even sure I'm going to get them all down but you know. I already was fed up with book about 30% the way through and I finished reading it out of pure spite. I wasn't letting this book beat me.There were a couple of terrible tropes I couldn't stand in here. Like why does every story with someone that was in foster care have to say the standard thing about how most families only had them for a paycheck and then the classic \"foster father that showed all the wrong sort of attention\". Like really? I know people that do foster care and it frustrates me that every story has to paint this same picture. The second trope that really grinds me gears that was used in this book was nightmares suddenly disappear when Callie starts sleeping with Paul. Right, sex totally cured your night terrors.. I'm so sure. But I suppose that logic follows the rest of the pseudoscience homeopathic nonsense it was advocating. The police work in this book was absolutely ridiculous and laughable. Most of all the leads that Rafferty followed for the case were dreams Callie had. I'm sorry but you're going to follow dreams of someone who was five at the time? Seriously?There was nothing that redeemed this book for me, it was boring and ridiculous. Recommendation: Skip."}, {"userName": "Heather A", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/5316154-heather-a", "userReview": "I received a copy from Penguin's First to Read site.This is a murder mystery set in Salem. The premise was a fairly interesting one, 20 or so odd years ago three women were murdered on Halloween night during what appears to be some sort of ritual, there were two survivors, a little girl and another older woman. The older woman turned slightly nutty, the little girl remembered nothing and was shipped off to an orphanage run by nuns.Now in 2014 something has happened involving the surviving lady Rose, from the original case, someone is dead under weird circumstances, Rose has gone rather loopy. A detective who has dealt with Rose before comes into the picture to investigate, and the little girl, who survived, Callie, all grown up now, comes back to town. There's a connection to the ancestors of the original Salem people who were accused of witchcraft and executed, something to do with the hanging tree and the real location, and missing bodies, consecrating the ground.It's definitely an interesting idea, however, 84 pages in and it's very boring and long winded. This one is just not getting my attention and I'm not all that interested in anymore really. One for the DNF list, unfortunately. Not for me at all."}, {"userName": "Amy", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/727334-amy", "userReview": "I really enjoyed Brunonia Barry’s first two novels (and I met her during her tour for her second novel) so I was eager to read this one. And it was rather good. I would say the rating would fall between 3 and 4 but I’m rounding up because I really did enjoy the book quite a bit. There is character overlap between this one and her first novel, The Lace Reader. If you read that one, this is a nice revisit to some of the characters. If you didn’t, this one is perfectly good as a stand alone! This is a mystery that plays with the historical witch trials and current life in Salem, MA. I really like the subtle magical touches that are at play throughout the book. Those touches gave the book a little something special for me. Overall, the mystery (well, mysteries) were really well done and I thought the conclusion was thoughtful and satisfying. I will say that the pacing was imperfect. It felt like it took me a longgggg time to get through this novel. It wasn’t fast paced. I was never bored but it didn’t fly by or anything. That’s not a big issue for me but if you need something with fast pacing, this might not be the right book for you. If you love a good mystery, especially one that is connected to witches and the witch trials; this is definitely one you should pick up!NOTE: Thank you to the publisher for providing me with an advanced reader copy for an honest review."}, {"userName": "Jan", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/13116274-jan", "userReview": "After reading The Fifth Petal it was completely apparant to me that the author has grown and really sharpened her skill since the first installment in this series. Discovering that this was a \"book 2\" I decided to read The Lace Readers first. While I enjoyed it, I felt it was a little uneven. But I did not have that problem with this book!! This was a completely enthralling story that kept me interested from beginning to end and could very easily stand well on its own. What I loved about this book was that it instantly grabs your attention, drawing you immediately into a very intriguing mystery. We then journey with Callie as she tries to unravel a traumatic event in her past, taking us on many twists and turns, including the events of the Salem witch trials and the affect that slice of history has had on this small town of Salem. This was a very satisfying read for me! And I was completely fascinated with how Callie used the power of music to heal, making me want to read more on the subject of music therapy. Many thanks to NetGalley and the publisher for an advanced copy and the opportunity to review this book. I loved it and highly recommend it."}, {"userName": "Kelly Schnorrbusch", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/17629777-kelly-schnorrbusch", "userReview": "2.5 or 3, so I'll round up. There's an audience for this book - it just isn't me. A modern day murder with ties to the 1989 murders of three young women who have ties to the Salem Witch murders. Whew! That's a lot of ties. We have Rafferty the sheriff (or detective or cop or what have you...) who investigates the death of a rather snotty teenage boy that leads to a lot of fingers pointed at Rose Whelan, who was a suspect of the 1989 Goddess Murders of her friends. Rafferty finds out that the daughter of one of those scandalous, young ladies is alive and hopes she can shed some light on the case. Callie was five years old when it happened, so forgive her if she's a bit foggy on the details. (Suprisingly, she ends up remembering more than I figured.) In the years since being deemed a murderer around town, Rose has gone the way of a 2007 Britney Spears, though she hasn't taken to wielding a Lady Bic just yet. Callie was told she was dead so she's happy to see her old friend and \"aunt\". There's a whole slew of other people introduced and it just feels tedious. This book would benefit from the editing of about 100 pages. Some of it was good, some dragged, but ultimately the case dragged on and I couldn't help but wonder if no one in Salem, MA was a damn internet hacker or troll to find some information much quicker. It almost seemed inept. There also wasn't much \"witchcraft\" if that's why you are thinking of reading this book, but there was a bit of music therapy, too much time with singing bowls, and lace reading (What the shit is that?! No really, I have no clue and I refuse to let Google have the satisfaction of \"lace reading\" popping up in my history.) Not really my cup of tea. I nearly quit halfway through, but when halfway through is over 200 pages, I didn't want that time to go to waste. This book just missed the mark for me. I didn't read the first book in The Lace Reader Series and while I don't feel that I missed much, I didn't feel a connection to the characters. I found myself wondering why I was sitting at Thanksgiving dinner with some of these people for chapters! Yes, CHAPTERS! Why are we in Italy with two characters when it seemed like it didn't really move the mystery along."}, {"userName": "Sarah Anne", "userReviewDate": "Jun 24, 2016", "userURL": "http://www.goodreads.com/user/show/10643985-sarah-anne", "userReview": "The Fifth Petal felt like a warm Salem homecoming: haunting, compelling, gorgeous, (a little sexy). I was greeted by old friends and introduced to new ones, and the narrative arc was masterfully paced. The story was so full and interconnected and rich (the true mark of a Brunonia Barry novel). What a delicious read -- highly recommend!"}, {"userName": "Stephanie", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/8593845-stephanie", "userReview": "The Fifth Petal is a good book that had a great flow and that can be hard to find in a book like this. I was very surprised that the pacing of this book was fantastic! This book did not disappoint at all, but it did not give anything away until the very end."}, {"userName": "Debra", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "I'm teetering between a 3 and 3.5 stars hereI am no more a witch than you are a wizard, and if you take away my life, God will give you blood to drink.-Sarah Good, 1692Twenty five years ago 3 women were murdered. Their homicides were dubbed \"The Goddess\" murders. The women were descendants of witches killed in Salem during the Salem witch hunts.Surviving that night was the 5 year old daughter of one of the victims named Callie and a woman named Grace. Their murders remained unsolved.John Rafferty, Salem's chief of Police begins investigating this cold case after a young boy dies while bullying Grace (one of the survivors and an initial suspect in the Goddess Murders). Grace is now a homeless mentally ill woman who talks to the Oak trees in Salem hoping she can find the original hanging tree of the Salem witches in 1692. She is known around town for her strange behavior and predicting the death of townspeople. She has always stated that a banshee murdered the woman and that she, Grace, has imprisoned her inside of herself in order to save the town.Now an adult, Callie has returned to town and is surprised to learn that Grace is still alive as she tries to put together her past, she has visions at night and little glimpses into her past and that Halloween night that her Mother was murdered. She is also feeling a growing attraction to a man who has the same eyes as a man she saw years ago.This book sounded so intriguing. I love Salem! I have visited there numerous times when I lived in Massachusetts. All of my visitors wanted to go to Salem and do all of the touristy things to do there.There are parts of this book that are very good. This book needed better editing in my opinion. I have to agree with the other reviewers who said that this book had a lot of \"filler\". I will be the first to admit, that I did not read \"The Lace Reader\" but I do not feel that is necessary in order to read and appreciate this book, but I do feel that some of the filler in this book, is tying up things from \"The Lace Reader\". There were parts that dragged. I think this book would be a 4 star book for me if about 60 pages had been edited out. I actually found myself thinking about this book around 3 a.m. when I could not sleep. This book has a lot to offer: witches, history of witches in Salem, murder, mystery, magic, romance, family secrets, etc. I thought of all the ways this book could have been better and it did keep coming back to the filler. I also thought of some things I would have liked to have seen answered as to who was the old witch that was visited by the killer? Did I miss something thereI'm still teetering between a 3 and 3.5 as I type. I will ponder this book a little more today.Received this book from the publisher and NetGalley in exchange for an honest review.See more of my reviews at www.openbookpost.com"}, {"userName": "Amy", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/17792052-amy", "userReview": "3.8? The perfect Halloween tale. Set in Salem, where the author lives, this book features characters from her earlier work, the Lace Reader. Truth be told, I didn't remember the Lace Reader well, nor any of the characters, except that I found it dark, vague, and eerie. But there are references to the dynamics in the relationship of Towner and Rafferty, and others like Ann Chase, and May, are clearly making a reappearance. But it stands on its own - one does not need to be familiar with these characters or their story to pick it up and dive right in. I received this book as a giveaway in early 2017, maybe February, and had felt bad that it took me this long to pick it up and review it, as the giveaway program is meant to create a buzz for the author upon their release of the novel. I hope my review helps to do that, as I really enjoyed myself. But my delay was timely, as I finally picked it up right at Halloween, which couldn't have been more perfect. But, much like one does not need to know the characters from the first book, it need not be Halloween time to enjoy this tale. In this tale, a young girl who had survived a terrible tragedy, the Goddess Murders of 1989, comes home to be with a beloved Aunt who is now 25 years later accused of the same crime. The Aunt, who is disoriented, speaks tales of witchery, spells, banshee's, and oak trees that hold the history of ancestral connection to the original 1692 hanging of accused witches. Its fun, fast paced, intriguing, and full of connections to the town's unique and powerful history. The Fifth Petal refers to a rosary in the shape of a five petaled rose that is burned into Callie, the child survivors palm, and this image is central to the story. One interesting feature to me about the story, is that Callie, the central character is a music therapist. I thought it was really interesting to hear about singing bowls, and the relationship of sound vibration to healing. This is one of Callie's gifts, and I thought it was a fascinating side theme. I found it fascinating, and a bit of real-life magic. It was clear to me, to give the book to my local dear friend who is a teacher and superstar in the music therapy world, as I thought she might enjoy it. And I would add, living about 45 minutes from Salem, there is nothing like Salem at Halloween. I deeply regret that we couldn't make it work to get up there this year. Brunonia Barry is right about one thing - you can't park up there in October, at least not on the weekends. She wove a fun tale, with characters worth rooting for. I enjoyed it and it hit the spot."}, {"userName": "Darcia Helle", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/2439410-darcia-helle", "userReview": "I've long been fascinated by the story of Salem and its witches, partly because I grew up in Massachusetts and partly because I'm intrigued by supernatural possibilities. This book perfectly captures the essence of Salem, transporting us to that town with its dark history. I think it's important to note that, while this is a murder mystery, the author's writing style has a strong literary feel. The pace is fairly slow, with a heavy focus on mood, emotion, and relationships. If you go into this book expecting a fast-paced mystery with a lot of suspense, you might be disappointed. This is an expansive, sweeping tale, encompassing many characters whose separate stories intertwine over the years. The present-day story unfolds over a two-year span, but also reaches back to the unsolved murders in 1989, which then links all the way back to 1692 and the 19 witches killed then. While complex, the plot is laid out well and I had no problem following along.The supernatural aspects are gradually woven in, blending modern-day witchcraft and healing with more otherworldly possibilities. We also have romance, mystery, and suspense, set against a backdrop of family drama.I had no problem making the leap in believing the supernatural parts of the story, but I did find some other parts too convenient to buy into. The glaring problem for me was the ease with which Callie settled into Salem, from her housing arrangement to her total absence of money concerns while she didn't work at all until the very end of the two-year span. I suppose I am more inclined to believe in the possibility of witchcraft than in the possibility of wealthy people opening their home and, essentially, their wallets to a virtual stranger. I did figure out the whodunit aspect about midway through, probably because the slow pace allowed me a lot of room to consider the suspects. Still, I enjoyed spending time with all of the characters and untangling the lies and deceit. When I requested and read this book, I didn't know it was the second in a series. I had no problem at all understanding the characters and their relationships, so this works exceptionally well as a stand-alone.*I received an advance copy from the publisher, via LibraryThing, in exchange for my honest review.*"}, {"userName": "Katiria ", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/6553210-katiria", "userReview": "Ohh wow this was such an amazing and fantastic book I thoroughly loved and enjoy it so much. It is actually the first time I read a book by Brunonia Barry, but it won't be my last book that I will read by her. This book is a great book for Halloween because it is about witches and folklore. The author did amazing job going through the history of the Salam witch trail, the history of witches and folklore. I absolutely love reading the rich history of the witches and folklore, I also love the history of some of the religious background as well. They all were quite intriguing and fascinating to me to read I just couldn't get enough reading about it! I also love the fancy, delicious and rich food that the fifth petal had my mouth just water while reading the amazing food the had in this book. I don't want to go into any details about The Fifth Petal because I don't want to spoil it for anybody. But I will say the beginning chapters does start of slow because it is setting up for the plot. Which the plot line is absolutely fascinating to me that I had to read way into the wee late night just to read one more chapter, because I couldn't get enough of it. There is also a murder mystery in the plotline as well which you all know I love a great murder mystery. That I tell you I so didn't see who the culprit was at the end. I mean the clues where all in front of my face while I was reading it, but it left me guessing until the very end on who was the killer all along. And I was really surprise on who the real killer was. All the characters were all amazingly well rounded and develop I especially love Callie and Paul. I actually loved all the characters yes I also love the villains as well. The writing style was very expressive and descriptive that I just love reading every details and expressions in the fifth petal. All and all The Fifth Petal was an amazing and fantastic book for me that I can't wait to read more books by Brunonia Barry in the near future.*** I received this book through Blogging For Books Program in exchanged for an honest review, thank you so much to Crown Publishing Group for the opportunity to read and review The Fifth Petal! ***"}, {"userName": "Kelsey", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/6882848-kelsey", "userReview": "This book would have benefited from cutting about 100 pages, and, quite honestly, better storytelling. The story that Barry has come up with had so much potential, but I feel that it was squandered because the writing wasn't that good. We never get a true sense of what any character was really like, most of all Rose, who was the one driving the whole story, and basically, the readers are told what happens, rather than reading it for themselves.For example, Rafferty, Salem's chief of police, had a hard time throughout the entire story trying to weave together the murders that occurred on October 31st, 1989. We know this, because that's all we're told. Rafferty had a hard day. It had been long, and he was tired. He made himself a cup of coffee, and then his cell phone rang. It was Callie. For over 400 pages, I couldn't get past the fact that I basically wasn't reading anything. I was being told a story, from writer to reader.I also didn't like any character in the novel, besides Ann Chase (who we’re supposed to dislike, apparently, because we’re told that Callie hates women so we should too, except Ann is the only one she hates because she’s jealous..?), and Towner. Rafferty was ok, if a little boring, and kind of lame. The main characters, Callie, Rose, and Paul, were given almost no agency, and Callie, a 33 year old woman, acted like a high schooler for the most part. Rose, probably the most important character to the story as a whole, is in the background the entire time, rarely talks, and offers nothing to cracking the mystery. Paul, on the other hand, is told to be charming and irresistible, except, we never see this.. He likes Callie, and is doing work in Italy. That's..all I know about him. Do you know how hard it is to read a book over 400 pages when you don't like the main characters? Hard. It's very hard.What did keep me reading was the mystery. That's also why I gave this two stars instead of one. I was intrigued with the mystery, and how the story was going to come together. Yet, again, this is why I gave it two stars, instead of three or four. Why? Nothing really comes together, at all. Our questions are answered, but were they satisfying? Not really. This is also why I said it should lose 100 pages. There's just too much story.Almost every single character in this book, including Callie, Towner, Rafferty, Paul, Finn, Emily, Marta, Rose, Ann, the Goddesses, etc. have their own plot aside from the main one that encompasses the book. There's just SO much going on. Did we need to learn all about Emily's house on the tour? No. Did the Thanksgiving dinner need to happen? Not really. When Paul and Callie go to Italy, was anything gleaned from it? Sort of, but it could have been condensed. Towner and Rafferty's secrets, too..were they used for anything? No. Absolutely nothing about it contributed to the story, and it fell so flat that I was mad it had been dragged out for over 300 pages. It literally amounted to nothing.And then, important parts to the actual mystery, like Callie talking to the nuns, and figuring out her childhood, was given no more than a chapter, and never touched on again. When one of the most important characters die, that's literally it! They die, and then two months go by and almost no one thinks of them, when there was basically a witch hunt for them all throughout the book. We also learn next to nothing from this death, except a few little connections that didn't even need to be there, because the whole plot was wrapped up by...Callie's visions. The event that the story was leading up to, again, was never acted out. It was a scene played in Callie's mind, a scene that was told to us from Callie's point of view, and then when it ends, that's...pretty much it. Did we even learn what happened to the murderer? I literally can't remember.Unfortunately, this book fell completely flat for me. I was so excited to read it, because I've always been fascinated with my country's history, with witches, with Salem, a place I love to go to. However, I found that I was being told a story that doesn't wrap up fully, and what does get answered, left me 100% unsatisfied. Most of all, I just feel confused. The history between the Hathorne's and Whiting's was drawn out to the point that I barely knew what was going on, I still don't quite understand what the Goddesses even were, because every single character had a different story about them, I don't know what their relationship to Rose was like, I don't understand the banshee part and why it was such a big deal, I don't understand how Callie was making the banshee call, (side note..she realizes it was her, and then, that’s it..? She doesn’t inform anyone? She legitimately says, “it was ME!” and cries, and it never gets touched on again), but then Rose got the banshee inside of her..? And I don't understand the closing line, a line that was repeated by Rose. I am a cipher.... A cipher of what, exactly? What is the cipher? Is the story not finished? It shouldn't take 400+ pages to tell this story, and to have all these questions after it is...unsettling. Is there going to be a third part to the series? It's open ended enough for there to be one, but honestly, I have no desire to read it, even with all the questions I still have."}, {"userName": "Jordan", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/31258408-jordan", "userReview": "I received a copy of The Fifth Petal without realizing, initially, that it was book #2 in The Lace Reader series. I've never read anything by Brunonia Barry before but I was so intrigued by the description on the back of The Fifth Petal that I went out and bought myself a copy of book 1, The Lace Reader, thoroughly enjoyed it and immediately read The Fifth Petal right afterwards. I was equally pleased and impressed with the second book in this series. Its a book that I find is very difficult to define, as far as genre goes because there are so many different categories it could fit into ...there's a bit of mystery/suspense, a bit paranormal/New age/magic, some romantic/contemporary aspects, all thrown into it in equal measure making it impossible for me to classify into just one category. The novel is about a series of murders, one incident from over 20 years prior in which three women were killed and a little girl was spared and a second incident years later, when a teenager died under questionable circumstances. The common link in both is Rose, a local historian turned crazy person who was present at both incidents and claims a banshee killed the victims with its screams. The general assumption of the town is that Rose committed the murders and her crazy ramblings are viewed as proof. Detective John Rafferty, along with Rose's psychiatrist, and Call I, the little girl now grown who witnessed the first murders and has now returned to try to get the truth from Rose, all try to uncover the truth of what really happened.I loved the mix of reality and magic in this book but it was magic that didn't seem all that unbelievable especially when set in Salem, Massachusetts with its notoriety for witches and witchcraft. It was also a nice follow-up to The Lace Reader with reoccurring characters like Rafferty and his now wife, Towner, yet the storyline was completely new and honestly I think this could be read as a standalone and still be very much understood, although it's great to have the backstory of the characters and a better grasp on their development so I would definitely recommend reading these books in order. Being from New England myself I felt Barry did an excellent job capturing the feel and charm of a northeast coastal town filled with hard-working, three dimensional characters that were easy for me to understand and relate to. This book also did a great job illustrating the effects of trauma and grief over the course of many years in the lives of several individuals and how differently it can affect different people. I highly recommend this to anyone who enjoys murder mystery detective novels, or new age paranormal romances because this book truly has a little bit of something for everyone. I'm giving The Fifth Petal four out of five stars.I received an advanced readers copy of The Fifth Petal from Netgalley in exchange for an honest review."}, {"userName": "Samantha", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/706208-samantha", "userReview": "Popsugar 2017 Reading Challenge: A book involving a mythical creature.This is a prepub, so I shouldn't judge it too harshly based on typos, grammar -- things like that, according to Netgalley. However, there are two particular points from this book that I could not suspend my belief enough to get past to enjoy the story -- one a major point, the other a slightly less important one.1. The author has \"[tried] to keep things as real as possible when it comes to Salem and vicinity,\" and does leave a kind of apology/excuse in her author's notes for anything that could be wrong, but my peeve cannot be overlooked. This book takes place in modern day Salem, Mass. Her story is about a group of women who in 1989, and in 2014, tried to consecrate the place where the accused witches where executed in 1692, at Gallows Hill, she writes. Barry even writes in her end notes \"A special thank you to the members of Gallows Hill Project who have finally proven, once and for all, the real location of the 1692 hangings.\" While she does not confirm here in the notes that location, the assumption can be made that it is where she writes in the book, in Salem.I am a librarian, and have done my genealogy research. I am a direct descendant of Mary Towne Estey, a woman who was accused of witchcraft and hung in Salem in 1692. Doing my research, I know that following the witch hysteria, the town of Salem changed its name to Danvers (http://salem.lib.virginia.edu/Danvers...). Today's Salem is not where the trials happened, let alone where people were hung. Barry has a particular character in this book who is an historian, acclaimed by the Smithsonian. I read the entire book, hoping at some point someone might mention that they were looking in the wrong place, that Danvers was the true location. It never happened. Anyone not familiar with the history of Salem and Danvers would probably enjoy this book, but I could not get over this glaring omission in a book where the characters are meant to be authorities and the author took great pains to \"keep things real.\"2. My second problem with this book is very different from the first. One of the main characters has very dark hair and decides to color it to disguise herself. In chapter ten: \"The color on the L'Oreal box was a very light blond. \"Is it even going to take?\" She gestured to her dark curls.The real answer is no, it wouldn't take. It would, at most, turn the character's hair an orange color, but more likely that not, it wouldn't change the hair at all. Box hair color, like L'Oreal, doesn't have any developer, or lift. It's color depositing only. In order to make dark hair blond, like what happens in the book, you would need to bleach the color out completely, then tone the hair, and then deposit blond color. Again, not something other readers might even pick up on, but I did, and it bothered me."}, {"userName": "Jennifer Gallagher", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/5951363-jennifer-gallagher", "userReview": "OMG y'all. Run, don't walk, to get this book. First off Deborah Harkness thinks it's amazing, so that right there... but SERIOUSLY!!! This one was SO GOOD!!! Layers of stories, different perspectives, twisty mysteries, modern day witches... this book has it! Ooooh, I did NOT see the end coming. And, note for the readers. Make a note of the drawings. Rafferty \"puts\" them throughout the book to keep up with the case... they do help you follow things."}], "description": "Could a witch hunt happen again in Salem? For readers of Deborah Harkness's A Discovery of Witches, New York Times bestselling author of The Lace Reader Brunonia Barry returns to Salem with this spellbinding new thriller, a complex brew of suspense, seduction and murder.When a teenage boy dies suspiciously on Halloween night, Salem's chief of police, John Rafferty, wonders if there is a connection between his death and Salem's most notorious cold case, a triple homicide dubbed \"The Goddess Murders,\" in which three young women, all descended from accused Salem witches, were slashed on Halloween night in 1989. He finds unexpected help in Callie Cahill, the daughter of one of the victims newly returned to town. Neither believes that the main suspect, Rose Whelan, respected local historian, is guilty of murder or witchcraft.But exonerating Rose might mean crossing paths with a dangerous force. Were the women victims of an all-too-human vengeance, or was the devil raised in Salem that night? And if they cannot discover what truly happened, will evil rise again?", "title": "The Fifth Petal", "url": "http://www.goodreads.com/book/show/29741905-the-fifth-petal", "average": 3.67, "cover": "https://images.gr-assets.com/books/1462933247l/29741905.jpg", "reviews": 772, "authors": [{"url": "https://www.goodreads.com/author/show/886869.Brunonia_Barry", "name": "Brunonia Barry"}], "type": ["Mystery", "Fiction", "Historical", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/29741905-the-fifth-petal", "http://www.goodreads.com/book/show/30982029-the-fifth-petal", "http://www.goodreads.com/book/show/34474871-the-fifth-petal", "http://www.goodreads.com/book/show/1951125.The_Lace_Reader", "http://www.goodreads.com/book/show/7005509-the-map-of-true-places", "http://www.goodreads.com/book/show/21081216-banshee", "http://www.goodreads.com/book/show/28627395-author-in-progress", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}