{"ratings": 17401, "userreviews": [{"userName": "Flannery", "userReviewDate": "Jan 30, 2011", "userURL": "http://www.goodreads.com/user/show/652877-flannery", "userReview": "This is a fictional story based on an actual 1965 killing of a teenage girl in Indiana. The girl, Sylvia Likens and her sister Jenny were put into the care of a single mother by their carnie parents. The woman, Gertrude Baniszewski, several of her children, and some neighborhood children tortured and eventually murdered Sylvia. She was forced to endure unbelievable atrocities like scalding baths, the carving of words into her body with needles, repeated beatings, eating feces, and worse. Ketchum describes, in graphic detail, what those events might’ve been like, from the point of view of the next door neighbor boy. Teenage Davy lives on a dead-end street and has been hanging out with the same neighborhood kids for his entire childhood. One day, while catching crayfish, he meets Meg, who has just moved with her sister into Davy’s next door neighbor’s home. Meg and Susan’s parents were killed in an auto accident and the only relative to take them in is Ruth, a single mother of three boys. There’s not too much need to go into the plot from here because you all know where it is going. I knew where it was going as well, but that didn’t make it any easier to read. A few weeks ago, I saw a story on the news about two 48-year old twins in Houston who lived with their mother’s decomposing body after she passed away. I watched in horror as the newscasters described how the grown men frankly told police officers that she had tripped and fell while they were watching the BCS championship and then they just left her there, conscious and able to speak, until she passed a few days later. And the reason that they gave for not calling anyone after her death? Inability to pay for burial expenses. (a judge has not ruled on their mental ability to stand trial as of 5/5/11) What made me think of this story in relation to the book was my wondering about how the hell anyone could ever passively watch someone tortured or slowly dying and do nothing about it. Davy knows that Meg is being tortured and I was fascinated with his reasoning about why everything was happening and whether he should do anything about it. Ruth and other perpetrators of such atrocities must just be mentally unstable...at least I hope that is the case. But there were/are just so many other people involved in crimes like this--are they all mentally unwell? I’d love to be able to say that a crime as atrocious as this could never happen nowadays but it just did again. Angela McAnulty starved, abused, tortured, and eventually killed her own daughter in Eugene, Oregon just last year. There were other people living in the house at the time. HOW? How can these people not report what is going on? In terms of the book, loosely basing a story on real life events really gives an author an out. I want to say that x,y, and z didn’t seem realistic or probably didn’t/couldn’t happen but I haven’t gone through the notes on the trials so maybe they actually did. I always get a horrible feeling in my stomach when characters tell the police about something and then the police either (1)don’t take them seriously; (2) brush it off; or (3) don’t trust a child and then turn them back over to their abuser. I can’t pretend to know how much work police men and women have but it is horrible to hear of events like this happening and to know that they were absolutely preventable if someone had intervened.This is a hard book to stomach. I recommend it to no one and everyone at the same time. No one will “enjoy” reading it. A lot of people probably won’t make it through the whole book. It is filled with sick, sick things. But sick things that happened and are still happening, which makes it all the more painful to read. There is a special place in hell for people who torture children."}, {"userName": "Stephen", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "WARNING: For those of you that still have a tattered, fragmentary scrap of optimism for the inherent goodness of people, this book may well rip it from you and shred your faith in mankind. This book is as disturbing as anything I have ever read. This is mostly because the novel slammed all of my soft/weak spots when it comes to violence, including:1. Torture; 2. Sadism;3. Violence against children;4. Violence committed by children; and5. Prolonged mental abuse.…and worst of all, this is based on a true story and the most horrific aspects of the story actually happened. Pardon my colloquialism but are you fucking kidding me? What kind of a world do we live in and who do I talk to about a serious dereliction on duty. Whoever is in charge of this “show” we all act in needs to GET INVOLVED and start doing a much better job of bouncing the scum out of this establishment because there are far too many people dancing at this global party that belong at the bottom of cesspool. The book description and other reviews have done a great job of describing the basic storyline, especially Flannery's review which can be found here: http://www.goodreads.com/review/show/.... Therefore, I will just briefly summarize the story. The book is a fictionalized account of the real life torture and murder of a teenage girl in Indiana. In the book, Meg and Susan are placed under the foster of a woman named Ruth after they lose their parents to a car accident that has left Susan crippled. During the course of a summer of slowly escalating depravity, Ruth, her children and a group of neighborhood kids under Ruth’s direction brutally torture and murder Meg. The story is narrated decades after the fact by one of the neighborhood boys, Davy, who suffers extreme guilt because he was aware of the torture but didn’t do anything to stop it until it was too late. I think Davy is the perfect metaphor for an apathetic society. The story is horrific, graphic, disturbing and as far from a pleasurable experience as you are likely to get. However, I do want to make this very, very clear...this is NOT TORTURE PORN or gratuitous violence for its own sake (which I call movies like Hostel and Saw, etc.). Ketchum has a reason for this story and it is not to titillate. It is to horrify. His deftly accomplished escalation of the horrors suffered by Meg is masterful and allows the reader to “see” through Davy’s eyes as he constantly convinces himself that everything is okay or not as bad as it looks. Thus we see Meg’s ordeal begin with occasional insults that are shrugged off. This escalates into constant verbal abuse and harsh spankings which are seen by Davy as \"the way things are for kids.” When the abuse finally escalates into severe emotional and physical abuse followed by captivity, torture and finally death, Davy sees the wrongness but by then is caught up in the fervor of “The Game” as it is called. Throughout this unbelievable ordeal, Ketchum makes the narrative seem so “authentic” that the horror is made even worse because the reader KNOWS that this…could...(and did)...happen. One of the tougher parts of this book for me was that it made me confront something I find somewhat troubling about myself, but that I know will always be a part of me. I have a wife and two daughters, 6 and 11, who I love more than I can possibly put into words no matter how hard I try. It is just a different order of magnitude though I am sure my fellow parents and spouses can understand. When I read this story, I was reminded of two things about myself. First, if anyone ever brutalized one of my loved ones and I was able to get a hold of them, the perps would SUFFER…BADLY for the rest of their miserable time on this planet. Call it a “primal” or \"vengeful\" aspect of man, but I would certainly unleash it in that instance. At times like that I always think back to the “post-rape” scene in Pulp Fiction when Ving Rhames say:   \"What now? Lemme tell you what now. I'm gonna call up a couple a hard, pipe-hittin' niggers and go to work on the holmes here with a pair of pliers and a blowtorch. You hear me talkin' Hillbilly boy? I ain't through with you by a damn site. I'm gonna get medieval on your ass….. This shit is between me, you and Mr. Soon-to-be-living-the-rest-of-his-short-ass-life-in-agonizing-pain, rapist here.\" \n ...Yes, it would be like that!!! Oh, and the second thing is that I am completely, 100%, okie dokey comfortable with the above. It is just how it wouild be. To sum up, this is a tough, tough book to read. However, it is also an excellent book and one that I think has an important lesson to impart about the depths of human depravity and the need for good people to confront the brutality when they see it happening. It is certainly memorable and will stay with me forever. HIGHLY RECOMMENDED!! 4.0 to 4.5 stars."}, {"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "Κύριε των δυνάμεων!!!Αποκλείεται να συνέβησαν αυτά τα αποτρόπαια βασανιστήρια σε δυο κοριτσάκια ανήλικα που το μόνο που τα βάραινε ήταν η ορφάνια τους και η γλυκιά αμαρτία της νιότης τους. Κι όμως μιλάμε δυστυχώς για μια αληθινή ιστορία τρόμου και ψυχασθένειας -σκληρότητας και βασανιστηρίων. Πολυτάλαντος ή διαταραγμένος σε σημείο πνευματικού οίστρου και δημιουργίας ο συγγραφέας ξεκινά την αφήγηση τοσο όμορφα και ειδυλλιακά με υπέροχες εικόνες καλοκαιρινής ξενοιασιάς σε κάποιο προαστειο της Αμερικής σε μια συνηθισμένη γειτονιά. Εικόνες σαν όνειρο προβάλλονται η μια μετα την άλλη περιγράφοντας την καθημερινότητα παιδιών και των οικογενειων τους με γλαφυρό τροπο και αφήνοντας μια ευχάριστη και οικεία αίσθηση στον αναγνώστη- που να ξέρει ο άμοιρος τι φρίκη και σοκ θα δεχτεί στις επόμενες σελίδες. Έχω δει εκατοντάδες ταινίες τρόμου. Έχω διαβάσει πάρα πολλά βιβλία σκοτεινά φρικιαστικά σοκαριστικά. Η διαφορά εδω είναι πως ο αναγνώστης πρέπει να αναρωτηθεί τι συμβαίνει με την άβυσσο της σκοτεινής μας ύπαρξης και την διαταραχή της ανθρώπινης ψυχής. Γιατι; Για έναν απλό λόγο. Τα κίνητρα και οι λόγοι για ολα αυτές τις φρικιαστικές και απάνθρωπες πράξεις, για ολα αυτά τα γεγονότα που σου κόβουν την ανάσα και σε συγκλονίζουν έχουν θύμα ένα κοριτσάκι και θύτες μια ψυχασθενή ή ανώμαλη ή συνειδητοποιημένη η οποία επηρεάζει και βάζει στο \"παιχνίδι\" τους ανήλικους γιούς της και σχεδον όλη τη γειτονιά. Οι λόγοι όμως και τα κίνητρα καθαυτά δεν αποσαφηνίζονται δεν ξέρουμε γιατι όλοι αυτοί αντιδρούν τοσο κτηνώδη και απάνθρωπα. Επομένως πρέπει εμείς να ερμηνεύσουμε αυτό το σκουλήκι στην ψυχή της ανθρώπινης φύσης. Και να αναρωτηθούμε μπορεί να συμβεί οπουδήποτε στον οποιονδήποτε;; Εδώ ειναι η ειδοποιός διαφορά που κάνει τον συγγραφέα \"ιδιαίτερο\" αλλα και αναμφισβήτητα άρρωστα ταλαντούχο. Δεν έχει κανένα θέμα να περιγράφει σκηνές βίας και πόνου χωρις να σε κάνει να νιώθεις αβολα,δεν τις λογοκρίνει, σε αφήνει απλά να ζεις τον εφιάλτη. Δεν ξέρω αν μπορεί να διαβαστεί απο όλους πάντως εμένα με ταρακούνησε.Καλή ανάγνωση. Πολλούς ασπασμούς."}, {"userName": "Edward Lorn", "userReviewDate": "May 13, 2012", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "There's going to be some personal information in this review. If you feel uncomfortable reading about child abuse of a sexual nature, you might want to skip this one.The Girl Next Door was one of the first Leisure paperbacks I recall buying. I don't know what I was expecting, but what I got was a kick in the teeth. This book is brutal and unapologetic. And, in my opinion, Ruth is one of the scariest characters to be found within the pages of the book. What makes this all the more terrifying and unsettling is that the story is based on true events. This time around, I decided to listen to Jack Ketchum read the book to me via audiobook. The one criticism I have is that Ketchum, like Ruth, is a heavy smoker. You can hear evidence of this in the way he breathes. I constantly felt myself drawn out of the story and and wondering about Ketchum's health. His voice isn't unpleasant, but his breathing is. You likely won't notice, but I did. He reminded me of my father, who was on oxygen during the final years of his life.Here's where the personal info comes into play. You can skip to \"In summation\" if you like.Growing up, I lived down the street from a pedophile named Eddie. The guy was arrested after a neighbor walked in on him molesting his mentally-impaired son, Jamie. Jamie's brother Ryan soon confessed that, yes, Eddie had been messing with both of them. After that, all the kids in the neighborhood came crawling out of the woodwork with stories of how Eddie had been at them. I recall very clearly playing hide and seek with Ryan and group of our friends. Ryan and I hid in a closet. While we were in there, Ryan unzipped his pants and pulled out his penis. He said, \"Put it in your mouth.\" I was ten and he was a year older than me, but even then I knew there was something wrong with what he was asking me. I mean, you pee out of that thing. Why would I want to put my mouth on it? I called him nasty and he laughed. He put his dick away and said he'd only been kidding. We played the rest of the day and never mentioned it again.That was my only odd experience with that family, meaning Eddie never got a hold of me. Although there were stories about how my sisters offered themselves up willingly so he would leave me alone. To this day I'm not sure if that's true. It's not something I feel comfortable asking them, because we're not that close. Soon after he was caught, one of the girls on the block came up pregnant. Rumors flooded the street about how the father was Eddie. The girl's mother had had a thing for him and used her daughter as a bargaining chip to win Eddie's attention. Years later, I remember thinking, what kind of woman would do such a thing? Reading The Girl Next Door hit me that much harder because of all that. Monsters come in all shapes and sizes. They come in all genders. Unfortunately, people like Ruth exist. Trust me. I know.When Eddie got out of jail a few weeks later, he would park on the cross street and walk up and down our block. He'd point at houses and nod his head. He'd wave at anyone he'd happen to catch in their yards or looking out their windows. This was years before sexual predators had to register on a national list, and it was months before a restraining order was put into effect. Some of you might recognize parts of this story because I put a different version of these events in one of my books. Looking back, I know how lucky I was. In summation: Rereading this wasn't a bright idea, but I don't regret it. I'll never say that I enjoy reading it, but I feel everyone should experience it at least once.Final Judgment: Utterly horrific."}, {"userName": "Dan Schwent", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "When a pretty girl named Meg moves in next door, young Davy is smitten. Soon, however, Meg's aunt Ruth begins mistreating Meg and invites her children to help. Can Davy help Meg escape? Or will he join in her torment?This is the twentieth book in my Kindle Unlimited Experiment. For the 30 day trial, I'm only reading books that are part of the program and keeping track what the total cost of the books would have been.This is one brutal damn book. At the beginning, it felt like Stephen King's coming of age horror, like The Body or It. Then it became darker and darker until it was physically wearing me out to read it.The Girl Next Door is a story of abuse, torture, and helplessness. Like I said, it's a pretty brutal read. Davy is torn between fitting in and trying to save Meg from the progressively more hellish life at Ruth's house.Ketchum paints a horrifying picture of life in an abusive environment. The book became increasingly more uncomfortable to read because of his skill at depicting the horrors going on in the basement.In the end, this was a hard book to rate. I thought it was very powerful but I can't say I actually enjoyed reading it past the halfway mark. The torture was too much but I had to see the book through until the end. The most horrifying thing about the book is that it was based on an actual incident.I'm giving it a four because of the impact the story and the writing had, not because of any enjoyment or entertainment I got out of the story. I doubt I'll be reading more Ketchum any time soon.Current Kindle Unlimited Savings Total: $115.39."}, {"userName": "Maciek", "userReviewDate": "Apr 03, 2012", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "The most horrifying thing about Jack Ketchum's The Girl Next Door is that it is based on a true incident - horrendous abuse, torture and eventual murder of the 16 year old Sylvia Likens in 1965. Sylvia's parents, carnival workers who moved often, left her and her sister in Indianapolis under care of their acquaintaince, Gertrude Baniszewski. Baniszewski was paid to care for the girls, but as the payments were late she began to abuse the young girls, focusing the torrents of her anger on Sylvia. Details of this abuse are too horrible to recount, but what is horrifying is that Baniszewski openly encouraged her own children and those of the neighbors to indulge in tormenting Sylvia on their own, imprisoning her in the basement. Although Baniszewski's daughter, Paula, would not only brag about it in public but also beat Sylvia in front of the neighbors, nobody did anything to stop it or help her in any way - Sylvia eventually died from her extensive injuries.I did not know about this before I read the book - in fact, I approached it without knowing anything about it. I have only read one novel by Jack Ketchum before, Off Season, which is a visceral, gruesome horror novel featuring a tribe of cannibals and some very unlucky vacationers somewhere in remote woods in Maine (the same state where Stephen King lives and sets most of his work). Although it has plenty of intense and graphic violence, Off Season lacks pretty much everything else, which made it a rather disappointing reading experience for this reader.The Girl Next Door is a much better book, because in it Ketchum does what he didn't do in Off Season - develop a proper build up and characters, and establish tension which lasts almost all throughout the novel. The narrator of the novel, David, writes it down as a recollection of events which happened a long time ago, when he was growing up in a small town. Although David is a successful financier on Wall Street, he has two failed marriages behind him already, and is at the eve of the third - he is filled with sadness, regret and guilt, haunted and gradually destroyed by events which took place thirty years ago. To an outsider, David's childhood was a relatively normal experience of a young boy growing up in a small town in the 1950's. Although he can see that his parents have marital troubles and knows of his fathers's affairs, he has a circle of friends who live right next door to him - the Chandler boys who live with their mother, Ruth. Their father left the family for another woman, leaving Ruth alone to take care of the three boys. Everyone at the street loved to hang out at Ruth's place - even though she kept her boys in line, she also gave them beers and let them enjoy themselves; David and his friends felt good at Ruth's place, because it was a place where they could be themselves, and feel natural - in David's case more so than at home. Although David does not consider his childhood to be special in any way, there is no suggestion that he is unhappy - he camped with his friends in a real tent, listened to Elvis on a record player, smoked cigarettes and drank beers in secret. In another life his childhood recollection would be much more in tune with the novel's idyllic opening image: a young boy lying down next to a clear brook in a picturesque forest, catching crayfish on a bright, sunny day.The woods and the brook are both the opening of the book, and the end of David's childhood: this is where he meets Meg Loughlin, whom he declares to be the prettiest girl that he ever saw. David is smitten with Meg, and confused by her - she is older than other girls that he knows, and his feelings towards her are different. He longs and yearns for something when he sees her, but doesn't exactly know what; Ketchum manages to capture the butterflies of youthful infatuation in his net - David learns that Meg is a distant relative of the Chandler's, and that she will be moving in with them together with her younger sister, Susan, after they both lost their parents in a car accident. The accident left Meg with a scar, and Susan crippled - unable to walk without her crutches. David is even more impressed with Meg as a survivor: he manages to overcome his shyness and ask her to go to the local carnival with him, where they share several sweet and memorable moments. In another life, these moments could develop into a beautiful romance; here, they are a prelude to a great tragedy.The problem with novels based on real events is that we know what will eventually happen, and it is no great surprise when it finally does. This is also the case with The Girl Next Door, but does not ruin the book. Ketchum does a very good job with establishing a slow buildup, with proper foreshadowing in all the right places. The specter of horror hangs over the book, and when it finally descends it begins slow, but quickly becomes almost unimaginable. The fact that The Girl Next Door was inspired by the murder of Sylvia Likens does not cheapen it, or make it exploitative - Meg is not Sylvia, and Ruth is not Gertrude. There have been hundreds, if not thousands, of such cases all over the worldThere are two big Whys in this book - why did Ruth begin abusing Meg and her sister? Was she jealous of her youth and beauty, which painfully reminded her of her own age and hardships which tore away at her looks? Did Meg remind her of her husband, who ran away with a woman who could have been her? Did she think that her boys might become interested in Meg more than they were in her? Did she not want her authority questioned, both as a parent and a woman? I think this question is not adequately answered - but then again we see Ruth only from David's perspective, and although he sees her at her house he mostly spends time with her boys, and does not live with them. David acknowledges that he does not understand why she did what she did - destroyed a young girl.The other big why regards the Chandler children and David - why did they participate in the abuse and grew increasingly more ferocious, and why did David do nothing to stop them and stood idly by? How could the Chandlers horribly abuse and torture Meg, and at the same time go on with their lives as if this was a perfectly ordinary thing to happen?Although David does not take part in the abuse of Meg, he does not do anything to stop it or tell his own parents - until it is too late. Besides Meg and Susan who are both obvious innocents, David is the only decent character in the entire book - yet he is not without his flaws and desires, which he himself acknowledges: he peeps on Meg with the other boys, waiting for her to undress in her room, and when she doesn't even show up he is furious - and begins to hate her for it, as if she disappointed him, owed him her nakedness. When he does see Meg naked and in captivity, he is overcome with desire to touch her.His saving grace is that he doesn't touch Meg, but his condemnation is that he doesn't stop others from touching her, and doing worse things. Of all the youths in the book, David is the only character who is at first taken aback by Meg's treatment, and eventually sees what is happening to her as something terribly wrong. He is the only boy who sympathizes with Meg, and who feels ashamed at what is happening and his own role in it - but this knowledge, or conscience if you will, makes him even more guilty than those who took part in her abuse. The Chandler children did it all under the watchful eye of their mother - if she would order them to stop, they would stop immediately. If she'd forbid them from hurting her, they would not hurt her. But Ruth did not only not stop her sons from torturing Meg, she actively encouraged it and took part in it herself. David acknowledges that this torment was Ruth's show - her presence hangs above them like a ghost, even when she is not in the room with them. Although Ruth set a series of rules which would justify the abuse -as much for the boys, as for herself - these rules eventually collapsed together with her sanity, and all the bets were off. Still, even then, she watched over everything - and everything was possible because she allowed it to be so.Should we hate David? Condemn him for not helping Meg, not telling others about her torment? It is easy for us to be outraged, even furious with him, by being entirely removed from his position and enriched by hindsight. Could David possibly know what would happen to the sweet girl he first saw at the brook? David does not have anyone to talk to - he understand that talking to other kids is pointless; although they knew that something was happening at Ruth's house - some vaguely, others with specific detail - not a single one of them had any opinion about it. It was like a force of nature; there was no point in discussing something that can't be influenced.In fact, it was not the torment that was a force of nature, but the fact that it took place under the watch and guidance of an adult. In the small, suburban community in the 1950's, adults controlled all aspects of lives of children: adults were the ultimate authority, and what they said could not be questioned. This was the social order on which many today look fondly upon: children wouldn't even dare to challenge the actions of their parents and other adults, and corporal punishment was not only openly accepted but actively encouraged. This was the whole point of it: kids were supposed to be punished by adults; they were supposed to be subservient to them, and obey them unquestioningly. Parental love was not supposed to be easy and selfless, but exactly the opposite. It was supposed to be tough love, which would adequately prepare children for many hardships which would await them in the world. Kids had to be straightened out, made into proper men and women. At one point David acknowledges that kids belong to their parents, \"body and soul... we were just kids. We were property\". David is conflicted. If Ruth is an adult, a parent of his best friends and now a parental figure for Meg, then who is he to judge that what she is doing is wrong? How can he know that what she is doing to Meg now will not turn out to have been right in the future after all? He still feels attracted to Meg, but Ruth and her children are his old friends, who were always good to him. In a memorable scene, David sees Meg approach a police officer to complain about her mistreatment. Along with the other kids who witness the scene, David feels a sense of betrayal - how could she tell on them, and to an adult? - and peculiar, scared excitement - how could she upset the social order, and tell on an adult on another adult? - but the police officer brushes her away; he is a part of the society, and in this society children do not question their parents, much less tell on them to others. He tells Meg she should think of Mrs. Chandler as her mother, and that her mother would probably treat her the same way. Who's to say?\", he asks, and does precisely nothing - for which Ruth mocks and torments Meg later, telling her that she deserves punishment for trying to snitch on her. Shouldn't snitches be punished? David tries to talk to his father, but he is no good. When David asks his father if it is ever right to hit a woman, he realizes that with his evasive and non-committal answers his father is trying to justify his own lashing out at his mother, which led to the coldness and distance between them. It becomes apparent that David's father does not know his own son, and that David is unable to connect with his father; mostly he feels nothing for him, and if he does feel any emotion it is usually contempt. Later in the book, David tries to tell his mother - but realizes that he cannot; although she is the only person he can tell, he realizes that by his own indifference he also took part in Meg's torment, and is unable to tell this to her. He realizes that he has betrayed Meg, and sees himself as evil - Does he fear that this is how his mother will also see him, or does he fear that this is who he actually is?We were juveniles, writes David at the end of the book, as if legal classification could offer any explanation. By now it is obvious that this entire writing is not really meant for any reader, but for himself; he confesses to everything that happened now because he did not then, but just as then there is no person who can help him now. He is alone and realizes this, plagued by recurring nightmares of his own failure to act, which destroy his relationships and life. This is where the true horror of this book lies - not description of torture and abuse. They actually are not as graphic as I expected them to be - they are horrific, but Ketchum doesn't focus on them. I can easily see many instances in which this book could have easily turned into simple, schlock horror, but violence is limited to an effective but not overbearing level. The actual horror is the gradually emerging sense of complicity in something terrible - and the fact that David uses as a poor attempt at consoling himself at the beginning, but which makes things infinitely worse: \"That it was happening all over, not just at Ruth's house but everywhere.\""}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Aug 11, 2014", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\nHave you ever read a book that you could not (with a clear conscience, at least) recommend to anyone? Ever read something that made you feel like you should turn yourself over to the authorities because only psychotic criminals would be interested in the subject matter you just exposed yourself to? If so, then you've probably already read The Girl Next Door. When Meg and Susan’s parents die, they are taken in by their aunt rather than becoming wards of the state. Moving into a relative’s house in a quaint little suburban town with safe schools and a neighborhood full of other kids to play should have been the best case scenario for two orphans. Yes, it should have been – but there is a darkness inside the Chandler family home that is brought to light with the addition of two girls to the household. These are the types of stories you see blips of on the evening news (or massive months-long coverage by “respected journalists” like Nancy Grace or Jane Velez-Mitchell). They are the stories you claim to watch only because you care so much about the fate of the missing/found victim. They are stories that if you follow too closely make you feel like a sociopathic voyeur. This book takes you into the torture chamber and insanity that you know exists each time you see another story like that of Michelle Knight, Amanda Berry and Gina DeJesus. It’s a book that totally goes there with a no holds barred attitude about what could happen if a young girl was placed in the home of a complete nutter. The author breaks every barrier of what is “okay” to write about, but does it so well that you can’t stop turning the page. EVERYTHING that is horrible and taboo is covered in this story, so don’t say you weren’t warned if you decide to pick it up. As for me? I’m going to go finish the rest of my “forgetting medicine” now . . ."}, {"userName": "Fabian", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "Great, cruel cautionary tale. The type that valiantly finds the Sad in Sadism. This one's about the hideousness of child abuse, about Miserable Psychopaths & their deep punctures that leave nothing but death and devastation behind...Herein THAT form of evil, which is regularly found, sprinkled, Disneyfied previously in such forms as Cinderella, To Kill a Mockingbird, The Body/Stand By Me, Misery...Jewels, really, all of them, to our culture. It is a summer idyll worthy of Lord of the Flies (!!). And the children come directly from the same mold that made Stephen King's Children of the Corn (but nothing so corny to be found here). & the parents are not as good or sympathetic as we would expect. It is a devastating type of realism that I have not come to expect outside of true snuff-stuff or the superb, undervalued film by Peter Jackson, Heavenly Creatures. \"Girl\" is actually pretty terrific."}, {"userName": "Char", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "Before reading this book, you need to prepare yourself.Yes, it's going to be disturbing.Yes, it's going to turn your stomach to knots.Yes, it's going to make you very, very angry.I won't go into the plot since several reviews and the book description already do that. I will say that to me, this book reveals the ugliest possible sides of human behavior, the worst being when good people do NOTHING to help. Even the author is disgusted by what happened, according to his note at the back of the book. READ AT YOUR OWN RISK!"}, {"userName": "Sadie Mother Horror", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/28225370-sadie-mother-horror", "userReview": "DNF.I’m out.I just can’t with this book anymore. You think this is as bad as it will get and then it just gets so much worse. The writing is great, yeah, yeah, blah blah. I don’t give a shit.*update an hour or so after I quit*Listen, I'm not \"faint of heart\" I'm not a \"gentle spirit\". Horror is my favorite genre and I love my stories bleak and dark but sometimes we have to know our limits. Is nothing off the table? No. We have to be true to ourselves. As much as I think Ketchum is a powerful, brave writer who drew me into this story even as I was dragging my heels, I just couldn't hang with those details anymore. I was angry, upset, exhausted and I just didn't want one more image to enter my brain. As it is, from what I read, I won't forget.My heart breaks for the real 'Meg' who endured this horrific violation and for the boys who got drunk and stupid off their game of power led by an adult who was insane. It's really the sickest story of human depravity and honestly, I don't recommend it to anyone--you just don't need to know."}, {"userName": "Paul O'Neill", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/17331573-paul-o-neill", "userReview": "Check out all my reviews on my blog page: http://constantreaderpauloneill.blogspot.co.uk/All hail the king of horror. No one makes me squeamish quite like Ketchum. To my horror, half way through the book I realised that it’s loosely based on the true story of the tragic Sylvia Likens. The story is about two teenage girls who are left in the care of their aunt after a horrible accident. It tells the story of the escalating abuse both of them suffer at the hands of their aunt and her children. The story is told through the view of David, who finds the abuse compelling as well as horrific and tells the story of his struggle with it as he comes to terms with what is really happening. WritingThe book is short and the writing is crisp. It does its job, moving the story along nicely. I thought the use of older David looking back at the events, commenting on them whilst flashing back to the past was very effective. The events clearly play a huge part in his later life and as he reflects as older David, it only adds to the emotional side of the story. So here’s my check, overdue and overdrawn. Cash it in hell…Ketchum does an excellent job of making you hate Ruth, the evil aunt. I can’t remember a character I’ve hated so much. Final thoughtsI don’t agree with this being categorised as a ‘crime thriller’. To me, it’s very much a horror.I can’t really say too much more without giving anything away. Ketchum is a must read for all horror fans. This, and Off Season, are fantastic and horrifying. You know you’re doing well when Stephen King answered the question “Who’s the scariest guy in North America?” by saying “Probably Jack Ketchum.”.What happened next, was the basement…"}, {"userName": "Johann (jobis89)", "userReviewDate": "Jun 29, 2016", "userURL": "http://www.goodreads.com/user/show/50893023-johann-jobis89", "userReview": "\"My mom says Meg's the lucky one,\" he said. \"My mom says she got off easy.\"In 1950s suburban America, two teen girls are left in the care of their aunt following the death of their parents. The story is told through the eyes of David, the boy who lives next door and who is witness to the escalating abuse and torture that these girls endure at the hands of the aunt and the rest of the children in the neighbourhood.First of all, I need to explicitly warn potential readers that this book is very graphic and detailed, and it is NOT for the faint of heart. That being said, I can categorically state that this is the most brutal, disturbing, upsetting, traumatising book that I have ever read. I did not enjoy reading this book, it made me angry, upset, and downright incredulous that people are capable of such inhumane actions, because this is not just some sick and twisted idea that Ketchum came up with, it it based on a true story. For those who are not familiar, this case is based on the murder of Sylvia Livens at the hands of Gertrude Baniszewski and her children/kids in the neighbourhood. I read up on this case after finishing the book and somehow the events that actually happened are even worse.Ketchum's writing in this is not flowery and beautifully written - it is full of short and abrupt sentences that just cut right to the chase. And this suits the type of story that he is trying to tell and the reaction that he is trying to provoke. And boy, does he succeed. It's not an easy read by any means, at times I just wanted to shut the book and throw it in the bin - but it's also an important book, because these things DO happen. People DO torture children (and adults for that matter). But at the same time, in the light of such acts of violence and human depravity, we need people who will act out against it. Granted, not everyone wants to read about it, but I think it's something we all need to be aware of. Sometimes not doing anything is almost as bad as those taking part in such crimes.David is an interesting character, we learn everything that happens through his recollection of events. Although he never actually partakes in any of the abuse, is he complicit because he is aware of it, even though he is only a 12 year old boy? At times I just wanted to scream at him to tell someone, to tell his parents, but he goes through a range of different thought processes - from not thinking he's doing anything wrong as he PHYSICALLY isn't doing anything, to considering the fact that maybe Meg deserved it, to getting mixed up with his pre teen sexual angst and curiosity. The girl who bore the brunt of the abuse, Meg, is heroic in my eyes. She endures abuse and torture that you cannot even fathom, and yet she manages to hold onto her dignity - no matter how much they try to take it away from her. Any opportunity where she is close to giving in, all they need to do is threaten her sister and Meg will endure whatever they put her through. How I cried for this young girl. Rating this book was tough, as I cannot say I \"enjoyed it\". However, I found it hard to stop reading, and it evoked such a strong emotional reaction in me that can only be gained from solid writing and a well-executed story, with empathetic characters (in this case, Meg and her sister). It's a powerful book, one of the most powerful I've ever read, and Ketchum has achieved exactly what he set out to do: to horrify. 5 stars."}, {"userName": "Elizabeth Sagan", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/53505099-elizabeth-sagan", "userReview": "I honestly don’t know how to rate this book. One star? Five stars? Throw it away? Is it a great book? Is it a pile of shit?There are a few stages of reading it:1.\tOh, great, it drew me in from the first page, that’s great.2.\tInteresting character development. So logical. Great introspection.3.\tOh, the tension is building even in the smallest scenes.4.\tOh, shit is starting to happen. I can’t put it down.5.\tThis is so great. It sends a great message. All that is necessary for the triumph of evil is that good men do nothing. Always step in for what is right. Don’t be a coward. When you don’t participate, but watch, you’re equally guilty.6.\tOMG WHAT IS THIS WHAT7.\tDUDE WTFAnd then you reach a certain point when you’re like: why am I reading this book? Why would anyone write a book like this? What am I getting from this book?Nontheless, it’s a great book.P.S. The main character is equally guilty. And I have no sympathy for him."}, {"userName": "Evgnossia O'Hara", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/43416866-evgnossia-o-hara", "userReview": "I've seen the movie a couple of days ago. It gave me nightmares. I don't think that I have the courage to read the book. I'm pretty sure that it'll drive me insane. Won't happen any time soon."}, {"userName": "Paul Bryant", "userReviewDate": "Apr 02, 2010", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Here's another long lingering gaze upon our inhuman humanity for everyone who is still labouring under the delusion that there might be a tiny shred, maybe just a single thread, something, anything, of common decency to be found in the vast majority of ordinary people. Jack Ketchum's here to tell you - sorry. There's not. This novel is based on a real crime which took place in 1965. JK relocates it to 1958 and, creepily, as if this tale needs more creep, which it doesn't, to his home town - to his home street. To the house next door, in fact! I'll give you the gist of the whole thing so you can see that this is another book you don't need to read, which since they've made a movie of it, is also a film you don't need to see. The time I'm saving you all!The story is based closely on the Sylvia Likens case, which I hadn't heard of, and now I have, and I wish I hadn't. So anyone with any desire to maintain their delusions of common decency and humanity should look away now. Sylvia was 16. Her parents were carnies, always moving, always parking the kids with relatives. In this case they parked her and her sister with an acquaintance, no more than that, called Gertrude Baniszewski who lived in Indianapolis and had a whole bunch of her own kids and was dirt poor, an asthmatic, a depressive, and as it turned out, deranged. Sylvia very quickly became the concentrated scapegoat hate-figure for this sadistic woman. But more than that, Gertrude encouraged her own sons and their punk friends to join in with the torment. It took them a few months to torture Sylvia to death. They were reasonably creative. No one in the merry group of torturers told anyone in authority, neighbours didn't notice a thing. When Sylvia died one of Gertrude's daughters finally freaked out and dropped a dime otherwise I guess we would never know. The whole family was rounded up and Gertrude was given life. She got out in 1985 and died in 1990.JK introduces an explanation of Gertrude's psychology (in his novel she's called Ruth Chandler) which is that she was a pathological hater of young women because they tormented her with their innocence and prettiness to such a pitch that she had to hand out lessons in how the world really is, what sort of suffering women have to endure, how they're all really sluts, and so forth. So something must have occurred in her own life to drive her to this pitch of malignity, clearly. It's clear to me that the right people never go to therapy :Patient No 1 : I keep having flashbacks to when my mother used to give me cheese sandwiches for my school lunch when she knew I hated cheese. Therapist : Okay, that's it, get out of my office.Patient No 2 : I have all these fantasies about chopping guy's heads off. Therapist : Do you think that's because your mother gave you cheese sandwiches when you were a kid?Patient No 2 : That's right doc - I didn't remember that until just now - this is a real breakthrough.Therapist : We're doing great work, Jeff. I'll see you next week - and remember - no more dismembering young gay men!Patient No 2 : (grinning somewhat shamefacedly) Aw, okayyyy... Er - back to the book. So this story is a horrible one, but it has so many resonances, (leaving aside the mythical older-woman-seeks-to-destroy-younger – this cruelty rings and chimes and vibrates down through the centuries past the Countess Bathory all the way to Snow White and Cinderella and beyond). But take Stanley Milgram’s famous electric shock experiment, which was inspired by the Eichmann trial, and sought to investigate how regular ordinary people would inflict terrible pain and suffering on other humans because someone in authority told them to – simple as that. A guy tells you to turn up the dial to 500 volts and zap the wrongdoer, and you know this will seriously injure him, but hey, the guy asking you to do this is wearing a white coat, and you’re in a laboratory, so sure, turn the dial and hear the guy scream! We can connect that with Christopher Browning’s brilliant investigation of who actually shot all those Jews in all those Polish forests – his book is called “Ordinary Men” – of course, because that’s who it was. And on a more Girl Next Door level, I remember the movie River’s Edge (1986) in which some 16 year old guy kills a 14 year old girl and brags about it to all his friends and takes them to see the body. After a few days one of them called the cops. That was based on a real case too. Oh, of course, there’s “Whatever Mother Says” which is very similar to the Girl Next Door and which I reviewed already. There's a pattern I'm seeing here.You’re never going to prevent deranged individuals doing cruel things. But what troubles our sleep and poisons our dreams is that it’s so easy, it seems, for them to get us, average us, friendly us, to join in."}, {"userName": "Έλσα", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/63862566", "userReview": "Συγγνωμη αλλα δεν μπορω να κανω κριτικη... ειμαι σοκαρισμενη.."}, {"userName": "Bark", "userReviewDate": "Feb 11, 2010", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "This is a disturbing book and a difficult one to read if you know beforehand how it ends (and it's pretty easy to figure out the outcome from the narrator's early comments).Knowing so much about this book before I picked it up (I read about the real life case it is based upon on crimelibrary.com), I figured I'd be able to handle the content but it was so unrelentingly brutal near the end that I had to put it down and watch a silly movie (The 40 Year Old Virgin, if you must know) to help me temporarily forget. This is one of the most tragic books I've ever read.I can't bring myself to pick it back up to read the two short stories that follow \"The Girl Next Door\".Later:Okay, I did manage to work up the courage to read the two short stories and of them I enjoyed the last \"Returns\" (I think?) the most. It tells the story of a dead man's return from the dead for one last visit with his wife and cat. It's a sad story about lack of compassion that will hurt any animal lover's heart.The other \"Do you love your wife?\" didn't move me nearly as much and I can't remember much about it at this point."}, {"userName": "Amber Rose", "userReviewDate": "Sep 29, 2013", "userURL": "http://www.goodreads.com/user/show/11143936-amber-rose", "userReview": "This is the hardest book for me to rate. I want to rate it a 5 star because it was greatly written. I want to give it 5 stars because I couldn't stop reading. I did have to put it down once, and step away from it. It  almost  became too much for me. I knew what I was getting my self into before I even downloaded this on my Kindle. It is based on a true story. I read about the story on line and knew how it ended. If you are looking for a happy ever after with this book your not going to get it. It's brutal, it tears me apart. When starting this book there is no looking back. I had to finish it knowing how horrible it was going to end. It was fucking unbelievable how suck fucking twisted some people really are in this world. I think what really got me with this book is that it was  ALL TRUE . Based on a true story doesn't get any realer then that. When reading all my fiction dark books I love them. But for some reason when it hits me that this shit I am reading is real, it pushes me to my limits that I didn't even know I had. Your in a 12 year old boys POV on his side of the story. On how he watched all of things happen to this little girl 14 years old right in front of him, living next door to this type of shit. He is a by stander, a victim. Guilt and desires mix with him, that was just to real. But I will rate this book 5 stars because it was a fucking horrible amazing book that I will never forget. I am sure I will be thinking about this book forever. It cuts it that deep for me. Would love to read more from Jack Ketchum but I think I will need to read him in long breaks. He terrifies me now. LOL"}, {"userName": "Jack Jordan", "userReviewDate": "Sep 26, 2015", "userURL": "http://www.goodreads.com/user/show/37897404-jack-jordan", "userReview": "This is the most fucked up, heartbreaking, traumatising book that I have ever read. It's four in the morning. I had meant to read a few chapters before going to sleep. Instead, I stayed up all night and finished the book. It's impossible to like this book because of how disturbing it is, yet it is equally impossible to put down because you have to see how it ends. The fact that this book is based on true events is the most traumatising - yes, traumatising - factor of all. Jack Ketchum writes very well. I want to read more of his work, but I fear that The Girl Next Door may have scared me off."}, {"userName": "Debra", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "3.5Read previously"}, {"userName": "Παναγιώτης Δεληγιάννης", "userReviewDate": "Jul 19, 2016", "userURL": "http://www.goodreads.com/user/show/39266943", "userReview": "Οταν ξεκινας να διαβαζεις Κετσαμ ξερεις τι εχεις να αντιμετωπισεις. Ο Κετσαμ ειναι αυτο που ελεγε ο Βλαδιμηρος Κυριακιδης στις Βαρβαροτητες: Αρρωστια.Η καθε του λεξη μια σουβλια με πυρωμενο σιδερο στα πλευρα.Ωμος και συντομος. Δεν χρειαζεται πολλες λεξεις για να σε σοκαρει.Ο καθε χαρακτηρας του ειναι ολοκληρωμενος.Το κοριτσι της διπλανης πορτας ειναι το τεταρτο βιβλιο του που διαβαζω. Ριγησα, εκλαψα, φοβηθηκα, μισησα, ενιωσα οικτο. Ενας πρωτογονος τρομος για το πολιτισμενο τερας που λεγεται ανθρωπινο ον, ξυπναει μεσα μου καθε φορα που τον διαβαζω. Διαβαστε τον συνειδητα, εχοντας πρωτα αποφασισει οτι το μυαλο σας θα παραμεινει κλειστο στις κτηνωδιες που περιγραφει. Διαβαστε τον με παρωπιδες. Ποτε μα ποτε μην πιστεψετε οτι ολα οσα γραφει βασιζονται σε αληθινα περιστατικα (και ας ισχυει).Ο Κετσαμ ειναι μαστορας στην αποκτυπτογραφηση της ανθρωπινης τρελας. Και δεν εχει ορια. Περιμενω πως και πως το επομενο βιβλιο του στα ελληνικα. Ο Κετσαμ ειναι σαν την κοκα κολα λαιτ. Δεν εχει θερμιδες αλλα σαπιζει τα εσωτερικα οργανα"}, {"userName": "Zoeytron", "userReviewDate": "Oct 23, 2014", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "The Game. It started off innocently enough, kid stuff. It rapidly segued into something else altogether when Mama, with her empty glittering eyes, joined in. This is as disturbing as anything you ever want to read."}, {"userName": "Chrissa Vasileiou", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/18434544-chrissa-vasileiou", "userReview": "3/5 (με το ζόρι). Αυτό το βιβλίο δεν θα επέλεγα ΠΟΤΕ να το διαβάσω προσωπικά ως Χρύσα. Αναγνωρίζω το ταλέντο του Ketchum ως συγγραφέα, αλλά αναγνωρίζω και τις δικές μου αναγνωστικές προτιμήσεις και όρια. Το διάβασα μόνο και μόνο γιατί έπρεπε, εξαιτίας του review.Το να γράψω πως είναι από τα πιο αρρωστημένα βιβλία που έχω διαβάσει ποτέ δεν νομίζω να 'ναι κάτι πρωτότυπο. Διαβάζοντας τα υπόλοιπα σχόλια, καταλαβαίνεις περί τίνος πρόκειται και πως η πλειοψηφία συμφωνεί με αυτό. Πραγματικά έσφιξα τα δόντια για να το τελειώσω, μιας και σε κάθε σελίδα ήθελα να... μπουκάρω μέσα και να κάνω στη Ρουθ και τα παλικάρια της τα τρισχειρότερα απ' όσα έκαναν εκείνοι.3 αστεράκια με βαριά καρδιά, ΜΟΝΟ και ΜΟΝΟ επειδή είναι καλογραμμένο μέσα στην ασχήμια του και γιατί ο Ketchum είναι αναμφίβολα μαέστρος στο είδος του. Και πολλά είναι, για όσους με ξέρετε και μένα και τα γούστα μου. Λυπάμαι, αλλά δεν το απόλαυσα καθόλου. Αν δεν έχετε γερό στομάχι, αν δεν είστε ούτως ή άλλως φαν του Ketchum κι αν δεν σας αρέσουν τα αρρωστημένα στόρυ, μην το προτιμήσετε. Περισσότερα στο site \"Book City\" και τον παρακάτω σύνδεσμο: Το κορίτσι της διπλανής πόρτας"}, {"userName": "Chris_P", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/44309339-chris-p", "userReview": "So, I sit here wondering... What is it that makes one devour a book like The Girl Next Door? Because, I have to say, I didn't just read it. I had to work hard to get my eyes off its pages. So, given that it is by no means pleasant but on the contrary disturbing as hell, not because it's scary or gruesome in a splatter-y kind of way, but due to its very subject which is totally real and possible, what sort of perversion was it that kept me hooked on it? Just before I reached the middle was when I first saw the elephant approaching me and I kinda figured what was coming. When I passed the middle, I started feeling the pachyderm making its first attempts to get comfortable and by 50 or so pages to the end, it was already enjoying the view sitting on my chest. Big, bad-ass elephant that one. You know how some people have had the wrong idea about something since they were kids and this misunderstanding causes them to not be able to enjoy certain things in life or even makes them hurt themselves and those around them? The world is full of such people. Usually, the problem concerns only their love life and their relationships with other people. This is not the case with Ruth Chandler, the tormentor of 14-year-old Meg Laughlin. She and her perverted, schizophrenic view of herself, her sex and the beauty she wasn't allowed to possess made her not only a manipulative bitch, but also purely evil. It's hard to understand such a person, especially when you feel pure hatred for them, so let's talk about feelings.I'm famous for my soberness when it comes to crimes and punishment. I believe more in preventing than in punishing. I find no actual point in getting revenge and I think that anger is a bad advisor. That said, I couldn't help but want Ruth and her whole family dead. Not just dead actually, but suffering more than they made Meg suffer. I have never felt anything similar for a character, either real or fictional, before. I wanted Meg to disembowel each and every one of them and feed them with their own intestines. With this book, I learned to appreciate motivation. We are used to being given a kind of reason even for the worst crime one might commit. It's not that it justifies the action, but rather makes it somewhat easier to swallow. Here, there is no such thing. The fact that Ruth is deranged doesn't make it any easier. Nor that the other participants are kids. Which is another issue Ketchum brings forth. Are kids ever responsible for their actions and to what extent? Sure, they were delicately manipulated by an adult but should doing the right thing be expected from them? I think you see now in how many ways this book fucks with your mind. It's not just the extremities it portrays. It's what they mean. It's also that they actually happened once and may very well happen again while in the meantime other, similar extremities occur every day, only those are more or less wrapped in shiny cellophanes making sure noone will be making any connections as to who is responsible for the scumbags (all sorts of scumbags) that wander the earth.What I liked most in this book was the fact that it felt like its purpose was not just to shock as is the case in many of the genre. On the contrary, it was like the shocking wasn't avoidable. Also, thumbs up for the building up during the first 15 or so chapters and the emphasis on the kids' psychologies which makes it differ from so many books with similar themes.Still no clue about what's wrong with me though..."}, {"userName": "Mark Matthews", "userReviewDate": "Aug 14, 2014", "userURL": "http://www.goodreads.com/user/show/5519555-mark-matthews", "userReview": "Maybe the hardest book I ever read. Tough to finish. I wanted something traditional to come rescue me, something heroic, like a vampire or ax murder or even a cannibal. I needed that to take away the pain of the reality. But, no, you won't find that here. You'll find a narrator who is just like you as an adolescent, and who eventually takes part in heinous abuse, facilitated by an adult, and the worst of humans is portrayed in stunning reality. This is what people slip to. People like your neighbor. When I was around ten years old, I played with matches with an older neighborhood boy and set a field on fire. I went fishing with him once and watched with wonder as he slammed the Minnows up against a tree until their guts came forth. Thank God there was no Ruth on our street.Who is the scariest woman in America? Probably Ruth from The Girl Next Door.And knowing that this is based on a true story, and that the author stated he had to actually take out some of the more graphic elements, makes me try to forget this novel. But I can't. Makes you wonder if there's a God. Makes you want to be Meg in the story and take away her pain. Makes you want justice.I am waiting for the sequel. Meg's soul feels touched by Ketchum's understanding and empathy. Her restless spirit, scarred from all the visceral abuse that went beyond her body into her soul, takes root inside Ketchum. Possesses him. And he lets her in willingly (think, \"come into me\", at the end of The Exorcist). Ketchum lights a cigarette. Puts on a long overcoat. Bangs of his black hair tease his forehead. His eyes change colors. Meg is inside of him, using him to plot her revenge. Together, they gather supplies: scissors, rope, a lighter, a bottle (or something similar to sodomize) some dog shit for food... the combination of Ketchum and Meg's wounded spirit will surely be more creative than I can be.Then it is off to visit the houses of Meg's abusers (are they still alive? I surely hope so.) They get a knock on their door at 8:48 pm on a Sunday. It is Ketchum himself, but they can call him Dallas, for they will know him personally over the coming months, for the abuse will be brought back upon them tenfold.But that's not how the world works. God is Dead, and we have killed him(?) Maybe. This book makes me wonder."}, {"userName": "Scarlet Cameo", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/19169870-scarlet-cameo", "userReview": "Lectura con el grupo 221 b Baker street\n\"Pensé en lo facil que era herir a una persona. No tenía por qué ser algo físico. Lo único que tenías que hacer era darle un buen golpe a algo que le importase.\"\nEsta es la clase de historias que, una vez las terminas, van a acompañarte durante algún tiempo. Es difícil, más bien imposible, racionalizar lo que sucede y entender a aquellos que los realizan. Es brutal la sensación que te deja conforme lo vas leyendo y es imposible mantenerte indiferente, de hecho David, el narrador, es uno de los personajes que terminas detestando por su falta de acción, pero al mismo tiempo sabes que es el menos dañado. Ruth, la tia de Meg y Susan que queda a su cargo, sus hijos y el resto de los niños de la cuadra están jodidamente locos, algo que queda demostrado aun antes de que comience el tormento de Meg.La historia es perturbadora, los personajes son enfermos, la sociedad en que se encuentran muestra el desinteres que se puede mostrar ante la anormalidad de sucesos que, en otro escenario, podrían no haber sucedido y la narración que hace el autor no hace más que intensificar lo que va sucediendo. Lo peor es que realmente sucedió, en otro momento histórico y con una situación menos favorable para el captor (los vecinos escucharon los gritos, pero no hicieron nada) y para la Sylvia Likens, la chica abusada, que sufrií peores abusos que los presentados aquí.No me atrevó a recomendar este libro, no es fácil digerirlo a pesar de que se lee muy rápidamente. De hecho, estoy segura que muchas personas pueden no terminarlo, o bien, finalizarlo y odiarlo por completo, es complicado estar con la podredumbre que aquí se maneja."}, {"userName": "Kristen", "userReviewDate": "Apr 25, 2008", "userURL": "http://www.goodreads.com/user/show/1116185-kristen", "userReview": "Rating this book is one of the most difficult ratings I've done. On one hand, this is an extremely well written book. The characters feel real, you care about the ones you are supposed to care about, and genuinely loath those you aren't. The scenes are set well and it is very clear as to what is happening. Your mind will have no trouble picturing exactly what is transpiring, and that is precisely why this book is so hard to rate. You don't want to picture what transpires in this book. You don't want to believe it, you don't want to feel what you will feel, and you certainly won't want to know that it is based in truth. The story itself is horrible. No, not horrible, there isn't a word for what occurs in this book... \"sick\" doesn't cover it, \"wrong\" is nowhere near strong enough, \"loathsome\" can't even summon up the proper amount of disgust. When I was done reading I was a mix of emotion, I was appalled, disgusted and enraged. Actually I was furious, furious enough to want to find someone like the people in this book and truly harm them. I stormed around the house and informed my husband that he needed to start the fireplace so I could throw the book in it. \"But it's a gas fireplace, honey\" he told me... \"Then hand me some matches\" was my reply. The packrat in me took over, and the book was not burned. It's sitting on the floor where it was tossed. Perhaps it's just an emotional topic with me, but the rape, torture, and murder of children should be a difficult thing for anyone to swallow. \"The Girl Next Door\" takes it to another level, and has the atrocities being carried out... lead and orchestrated by an authority figure, a mother figure, the person we should all go to for protection as children, the person who is supposed to make everything okay with the world, the person who should guide us and love us. Ketchum follows Ruth's decent into madness through the eyes of the little boy next door. As her mind slowly melts leaving behind any sense of reality, morality and love, she takes with her the three boys she has raised, and eventually drags several of the neighborhood children into her insanity. The focus of her madness is her nieces, and she projects her self loathing, disgust with her sex, and fury with the world into a sick and twisted fantasy of torture and rape on the two little girls that are to look to her as their mother. Her fantasy turns to reality carried out by both her children and her own hand. The reader is spared few details of the goings on... and it is hard to deal with. It is even harder to deal with knowing that this story, though fiction, is based on something that actually occurred. Deciding to read this book is something that is not a casual decision. This book WILL affect you; if it does not then I don't want to know you because you are too close to the people characterized in it. Back to how do I review this book? Do I rate it on the skills of the writer? If so, then this is a 4-5 star novel? Do I rate it on how well I enjoyed the read? Then it is a 0-1 star novel. Am I glad I read it? I don't know... I was certainly affected by it. Due to the fact that it was successful in evoking such strong emotion from me I will have to give it a 4, but I will certainly not give this book to anyone I know and tell them that it is a \"Must Read.\""}, {"userName": "Phils Osophie", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/33567746-phils-osophie", "userReview": "Einfach nur erschreckend. Ohne Worte. Überlegt euch zwei mal, ob ihr dieses Buch wirklich lesen wollt."}, {"userName": "Ιφιγένεια", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/9718223", "userReview": "Αυτό το βιβλίο θέλει γερό στομάχι κυριολεκτικά . Οι σκηνές που περιγράφει είναι εξωφρενικές , αηδιαστικές , σκληρές και απάνθρωπες . Είναι φορές που έπιανα τον εαυτό μου να λέει \"φτάνει , το παρατάω εδω ! \" . Αλλά δεν άντεχα στην ιδέα να μη μάθω πως τελειώνει το μαρτύριο της Μεγκ .Πάντα με τρομάζει περισσότερο στα βιβλία όταν τα τέρατα είναι οι άνθρωποι και όχι κάποια υπερφυσικά πλάσματα . Και στη συγκεκριμένη ιστορία σε τρομάζει περισσότερο ότι ο συγγραφέας πήρε την ιδέα απο πραγματικά γεγονότα . Σε κάνει να αναρωτιέσαι γιατί στο καλό να είναι έτσι κάποιοι άνθρωποι .Και γιατί κάποιοι άλλοι να περνάνε ότι πέρασε η Μεγκ ; Σίγουρα δεν είναι ένα βιβλίο που θα το ανοίξει κανεις για να περάσει καλά .Ήμουν έτοιμη για πρώτη φορά να μη βάλω αστεράκια γιατί δεν ήξερα με ποιο τρόπο να το βαθμολογήσω . Στο τέλος του βιβλίου υπάρχει συνέντευξη του Ketchum . Το βιβλίο είναι γραμμένο σε πρώτο πρόσωπο και την ιστορία την αφηγείται ο Ντέιβιντ . Είναι ένα αγόρι πάνω στην εφηβεία που ήξερε για όλα τα μαρτύρια που περνούσε η Μεγκ και δεν έκανε τίποτα . Παρατηρούσε σιωπηλά και είχε φτάσει σε σημείο να του αρέσει όλο αυτό . Ο συγγραφέας διάλεξε αυτό τον τρόπο να γράψει αυτό το βιβλίο για να σε κάνει κι εσένα να νιώσεις ένοχος . Ο ίδιος λέει πως όταν το βιβλίο είναι γραμμένο σε πρώτο πρόσωπο η φωνή του αφηγητή καταλήγει μετά από κάποια στιγμή να είναι η δική σου φωνή . Και έχει δίκιο . Ήθελε να καταφέρει να κάνει τον αναγνώστη να νιώθει ένοχος κάθε φορά που γυρνούσε σελίδα και να μπει στη θέση του Ντέιβιντ. Και πάλι έχει δίκιο . Αυτό ένιωθα απο την αρχή του βιβλίου μέχρι το τέλος . Πως αν διαβάσω παρακάτω θα είμαι συνένοχη κι εγώ στο επόμενο βασανιστήριο της Μεγκ , πως ειμαι εκεί σε μια γωνία και τα βλέπω όλα αυτά αλλά δεν κάνω τίποτα . Ο συγγραφέας τα καταφέρνει όλα αυτά στο 100% . Είναι αυτά που λέει , οι απλές και καθημερινές λέξεις που χρησιμοποιεί και ο τρόπος αφήγησης που διάλεξε που σε βάζει 100% μέσα στην ιστορία . Για αυτό και μόνο αξίζουν τα 5 αστεράκια .Αν τύχει να το διαβάσετε μπείτε κι εσείς στη θέση του Ντέιβιντ και μη βιαστείτε να βγάλετε τα συμπεράσματα σας .Είναι ένοχος κι εκείνος . Ίσως ηθικά να είναι και περισσότερο απο τη Ρουθ , αλλά είναι άνθρωπος . Και οι άνθρωποι είμαστε έτσι . Το λογικό απο το παράλογο δεν απέχει πολύ στο μυαλό του ανθρώπου ειδικά όταν μιλάμε για ένα έφηβο αγόρι . Δεν δικαιολογώ μια τέτοια πράξη απλά ζητάω απο όποιον το διαβάζει να μπει στη θέση του και να αναρωτηθεί τι πραγματικά θα έκανε αν ήταν ο Ντέιβιντ ."}, {"userName": "Cameron Chaney", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/40648249-cameron-chaney", "userReview": "\"Oh, my... how how HOW am I going to rate this book??\" That is what I've been asking myself ever since yesterday afternoon when I finished listening to the audiobook (narrated by the late Jack Ketchum) of The Girl Next Door. My eyes were red and puffy from crying, my heart was heavy, I felt depressed as hell, and I was disturbed to my core. I still don't know how to even review a book like this, but I'll try.The Girl Next Door by Jack Ketchum is a deeply disturbing cautionary tale based on the real-life murder of Sylvia Likens. It is about horribly deep psychological and physical child abuse at the hands of a seriously deranged woman who manipulates the town's children into joining in on the torture of this poor girl. And what's scarier is that she doesn't even have to convince most of the kids to do these things; they want to do it already. And it's sick and twisted and there were things in this novel that made me think I would never be able to get through it. But I did, and I'm glad I did.As disturbing and heart-wrenching as it is, Ketchum is deeply sympathetic and makes a very important point: how much are you going to let yourself see before you stand up and do something for someone? How far is it going to go? Ketchum goes as far as it can go, honestly. He pounds you over the head with it and makes you feel guilty for any times you might have looked the other way after witnessing some kind of abuse. He holds you accountable and asks what you would do. And let me tell you, after reading this book it will be very hard for anyone to walk away from someone who clearly needs help. That's why this book is so important. But yikes, is it brutal.I have to give The Girl Next Door by Jack Ketchum five stars. It is sick and twisted and I can't recommend it to everyone for that reason, but it made a serious impact on me and left me trembling. A book that does that deserves every star in the world. Now, will I be watching the film adaption? No way. I'm done. I can't endure anymore. This is it for me."}], "description": "Suburbia. Shady, tree-lined streets, well-tended lawns and cozy homes. A nice, quiet place to grow up. Unless you are teenage Meg or her crippled sister, Susan. On a dead-end street, in the dark, damp basement of the Chandler house, Meg and Susan are left captive to the savage whims and rages of a distant aunt who is rapidly descending into madness. It is a madness that infects all three of her sons and finally the entire neighborhood. Only one troubled boy stands hesitantly between Meg and Susan and their cruel, torturous deaths. A boy with a very adult decision to make.", "title": "The Girl Next Door", "url": "http://www.goodreads.com/book/show/179735.The_Girl_Next_Door", "average": 3.96, "cover": "https://images.gr-assets.com/books/1298460378l/179735.jpg", "reviews": 1813, "authors": [{"url": "https://www.goodreads.com/author/show/90070.Jack_Ketchum", "name": "Jack Ketchum"}], "type": ["Horror", "Fiction", "Thriller", "Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/179735.The_Girl_Next_Door", "http://www.goodreads.com/book/show/13530070", "http://www.goodreads.com/book/show/27159529-the-girl-next-door", "http://www.goodreads.com/book/show/2926476-the-girl-next-door", "http://www.goodreads.com/book/show/39963130", "http://www.goodreads.com/book/show/13189153-la-chica-de-al-lado", "http://www.goodreads.com/book/show/1422112.Evil", "http://www.goodreads.com/book/show/1122009.The_Girl_Next_Door", "http://www.goodreads.com/book/show/179734.Off_Season", "http://www.goodreads.com/book/show/179742.The_Lost", "http://www.goodreads.com/book/show/179738.Red", "http://www.goodreads.com/book/show/179737.Offspring", "http://www.goodreads.com/book/show/2176891.Triage", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}