{"ratings": 1279, "userreviews": [{"userName": "Michael Fitzgerald", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/151004-michael-fitzgerald", "userReview": "A nice historical fiction story. I'm not sure I agree with the choice of cover images, since it is a spoiler (the first 50 pages or so have us wondering about what this \"great wheel\" could possibly be). Lawson's drawings of Conn seem to make his head too small."}, {"userName": "Amber Scaife", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/64987691-amber-scaife", "userReview": "A sweet little story about a young man who helps build Ferris' big wheel for the Chicago World's Fair.The details of the wheel's logistics were neat, and the parallel story of the young man immigrating to the U.S. was a nice complement."}, {"userName": "Preston", "userReviewDate": "Jun 04, 2015", "userURL": "http://www.goodreads.com/user/show/41911846-preston", "userReview": "Early this year I came across a list of \"100 Books Every Boy Should Read\". The Great Wheel was one of the books on the list that I had apparently been deprived of as a boy, so I decided to correct the situation. This was a great find. Although it is written for younger readers, the story was uplifting and fun to read. The life of a young Irish immigrant is changed in many ways when he is employed by Mr. George Washington Gale Ferris in the construction of the first Ferris Wheel for the 1893 World's Columbian Expostion in Chicago.I was surprised to find insights which would probably only be fully appreciated by more mature readers. One of the characters is a Scottish ship rigging master who was severely injured in a fall. Although still able to perform his work exceptionally well, the fall left his body bent and crooked, which forces him to walk sideways; \"crab-like\". He shares his despair that any woman would ever consider such a man as a husband.As a retired engineer, I was also surprised to find at a very insightful statement of my own feelings. Mr. Ferris says, \"...you see we engineers, supposedly so hard-boiled and practical, are great dealers in dreams and visions. As much so as poets and artists. for everything we build is first only a dream-then we make the dream come true. Instead of brush or pen we do it with steel and concrete, with slide-rule, bolts and rivets-but first was the dream.\" And finally, as the story comes to a conclusion, it is apparent the main theme is one of faith. Faith to accomplish that which is based on true principles, but has not been seen before. It was summed up in a tune the workers sang as they walked home in the twilight after work:Ezekiel saw the wheelWay in the middle of the air.And the little wheel ran by faithAnd the big wheel ran by the grace of God.It's a wheel in a wheelWay in the middle of the air."}, {"userName": "Story Revolution", "userReviewDate": "May 09, 2009", "userURL": "http://www.goodreads.com/user/show/2303240-story-revolution", "userReview": "Your fortune lies to the west. Keep your face to the sunset . . . and one day you’ll ride the greatest wheel in all the world.” When Aunt Honora reads this fortune in his tea leaves, Conn Kilroy knows he is destined for greater things than his small Irish village can offer. A letter from his uncle Michael in America offering Conn a partnership in his New York contracting company sets Conn on his western adventure. Just a few short months later Conn’s Uncle Patrick lures him even farther west to Chicago, where they join the hardworking crew building what some called Ferris’s Folly—the first Ferris wheel—then  the largest wheel in the world and the showpiece of Chicago’s 1893 World’s Columbian Exposition."}, {"userName": "Janell", "userReviewDate": "Aug 18, 2016", "userURL": "http://www.goodreads.com/user/show/1635254-janell", "userReview": "Enjoyable JF on the building of the first Ferris Wheel for the World's Fair in 1893. Admittedly, I've read other books on this Ferris Wheel so I'm not sure whether I'd have enjoyed this book as much if I didn't already have background on the events surrounding its construction. Enjoyed this one, though, and wish I could have taken a ride on this Ferris Wheel myself!"}, {"userName": "Julie", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/5912773-julie", "userReview": "I really enjoyed it. Loved learning so much about the design and engineering of the ferris wheel. Also about irish immigrants, mr. Ferris, and the chicago world's fair. Loved the way the author wrapped it up too, but won't say more so as not to ruin the book for someone else."}, {"userName": "Jadd H", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/59246100-jadd-h", "userReview": "This book was SO hard to read. This book is 180 pages long, and probably some of the most boring 180 pages of my life. This book is about these main characters who help Mr. Ferris with his upcoming book project. Unfortunately, the people do not have enough money to fund the wheel, so they have to build it themselves. This book spends a lot of the time describing the \"adventures\" of working on the wheel. The wheel later gets finished and people start celebrating and enjoying themself. And thought was really all there is to this book. I felt so frustrated reading this book because I thought that this would be so much better because it is a Newbery Honor Book. The average rating for this book is a 3.81, so I may be a bit picky, but the dull vocabulary is really killing it. There are so many complicated words that do not make sense, there are boring illustrations, and this book such is bad. This book was made in 1957 so maybe that is the reason. Thank you for reading!"}, {"userName": "Jarm Del Boccio", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/8819386-jarm-del-boccio", "userReview": "\"Your fortune lies to the west, lad. Keep your face to the sunset and follow the evening star.\" From Ireland to New York to Chicago to a farm in Wisconsin, this classic award-winning tale slowly revolves and resolves as Conn follows his dreams and destiny: to work for Mr. Ferris on his fantastic wheel at the World's Columbian Exposition, and find Trudy- the girl with the blond braids, blue eyes and Dresden-doll complexion he met in steerage on his immigrant's journey to a new land. The center portion of this book is full of minute details of the process of planning and building the world's first Wheel, which was tedious for me, but fascinating for anyone interested in wrought-iron construction. It did end on a sweet note, though!"}, {"userName": "Nann", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/17409191-nann", "userReview": "I first read this charming story about 55 years ago. Upon rereading it yesterday I found that I remembered some of it but had forgotten a lot. Of course I now know much more about the historical context of the 1893 World's Fair and about late 19th-century immigration. That added to my appreciation of the tale about a young Irishman's experience as a crew member who built George Washington Gale Ferris's great wheel, one of the marvels of the World's Columbian Exposition.Robert Lawson's pen-and-ink illustrations are wonderful."}, {"userName": "Maximilian Lee", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/60088299-maximilian-lee", "userReview": "I might of not liked this book because the first Ferris Wheel might have been crudely built (at least I think so). I also think the Ferris Wheel was a big wastes of time (in a way) because some people destroyed it after the world's fair. This book was about a boy named Conn and his fortune in the U.S. Overall, this book is very informational about the time when the first Ferris Wheel was getting built."}, {"userName": "Jenelle", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/4241738-jenelle", "userReview": "Very interesting story about the construction of the first Ferris Wheel for the Chicago Exposition. My children and I thoroughly enjoyed the characters and the historical information, as well as the charming story woven throughout about a young man in search of his destiny."}, {"userName": "Kathleen", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/4807258-kathleen", "userReview": "I had never heard of this book before we got it with Sonlight E. My daughter and I both thought it was very interesting. It was a little hard to read aloud in places due to the dialect, but over all it’s a great story of hard work and not being afraid to follow dreams that others may call crazy."}, {"userName": "Jenny Yahn", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/68092782-jenny-yahn", "userReview": "This was a good read that required a little bit of Irish background information to get going for my 5th grader. Armed with that information, the book was a delight, full of interesting information and story about the first Ferris Wheel. It was a great read in our homeschool."}, {"userName": "Jersc", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/4615768-jersc", "userReview": "A young adult historical fiction telling of how the first Ferris Wheel came to be at the Columbian Exposition in Chicago at the turn of the century. Parts of the book were slow, but overall it was a nice little story with a budding romance worked in. My sons both liked it (ages 10 and 12)."}, {"userName": "jwadams19", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/74707132-jwadams19", "userReview": "At first it was boring... Then it turned out a great book!"}, {"userName": "Rachel", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/15994364-rachel", "userReview": "3.5 stars"}, {"userName": "Christa R", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/44012257-christa-r", "userReview": "It was interesting to see how much things had progressed just since the Civil War. Having visited Chicago, it was interesting to learn this history."}, {"userName": "Gloria Russell", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/27155189-gloria-russell", "userReview": "I really liked this immigrant tale about the first Ferris wheel. So did my boys (read aloud for homeschool). One star off bc sometimes it was hard to follow the descriptions of the construction."}, {"userName": "Rebecca", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/14558328-rebecca", "userReview": "An enjoyable read about the construction of the very first Ferris Wheel and the story of a young man woven through it."}, {"userName": "Laura Verret", "userReviewDate": "Nov 30, 2012", "userURL": "http://www.goodreads.com/user/show/2511187-laura-verret", "userReview": "I thought that this story would be from the perspective of an attendee of the 1893 Chicago World Fair. Instead, it tells the story of one of the men who helped build the Great Ferris Wheel!The Story.Cornelius Terence Kilroy has never dreamed of going west – but the west is calling his name! His Uncle Michael has offered for Conn to cross the Atlantic Sea, leaving his home in Ireland to live and work in New York City.Conn agrees and the next day begins his journey to New York City. He enjoys his life there – living with a doting aunt and friendly cousins is pleasant and makes him feel at home. But one day, Conn’s Uncle Patrick comes to stay with his brother. A passionate man with flaming red hair, he loudly and proudly describes the work of his friend, George Washington Gale Ferris – the marvelous Ferris Wheel that is being built for the 1893 Chicago World Fair. Conn is strangely stirred by Uncle Patrick’s description. He decides to accompany him to Illinois.The work is hard, but fulfilling. Each day substantial progress is made with the building. But will the Great Wheel be built in time for the fair? And will it actually work?Cautions.The most troubling aspect of the story has concerns a prophecy which Conn’s Aunt Honora made. Here is the passage.When Conn was twelve years old, Aunt Honora read his fortune from the leaves in his cup. She was very old, even then, and the village considered her a Wise Woman.“Neil, lad,” she said, peering into the cup, “mind well what I’m telling you now. Your fortune lies to the west. Keep your face to the sunset and follow the evening star, and one day you’ll ride the greatest wheel in all the world.” [pgs. 1-2]This prophecy is referenced around a dozen times in the one hundred eighty page book (which isn’t too bad) and was used mainly as a plot device to make the story seem more Irish. Aunt Honora’s methods of fortune telling – reading a person’s fortune in tea leaves! – is not detailed. The troubling thing is that the prophecy came true. A broken clock is right twice a day?Conn develops an affection for a young Dutch girl named Trudy while at sea. Because she does not know what her address will be when she gets to America, he is unable to obtain it. During the course of the book he thinks about her and sometimes writes letters to her which he cannot mail. At the end of the story, *SPOILER* she attends the fair where the meet up and agree to marry one another.Far from being a problem, I thought Conn’s relationship with Trudy to be a sweet addition to the story – none of their interaction or conversations are inappropriate. I thought that (apart from not knowing each other very well) they had a solid foundation for their relationship; they were both level-headed and spoke practically about what their future would be like.When Uncle Patrick sends some money to Conn’s mother, he specifies its use, adding that whatever money is left can be used to buy masses for her dead husband. Other than one reference to the Saints, this is all the religion in this story.Uncle Patrick declares that Mr. Ferris “has as great a knowledge of the ways of iron and steel as the god Vulcan himself.” [pg. 33]Conn’s cousin, Agnes, writes a letter to him, saying,“Now I will tell you a great secret but you must not breathe a word of it to anyone. Mamma and Stella and I are going to begin to work on Papa to take us to the Fair this summer, instead of that tiresome old Brighton Beach. Won’t that be exciting? Lots of our friends are planning to go but Papa says it is a waste of money. He says that there will not be much to see that is worth while and he wouldn’t ride on the Ferris Wheel if you paid him. He says that he can’t see why this great Fair us being made to honor Columbus who was only an Italian sailor anyway. If it was for Robert Emmet or George Washington there’d be some sense to it he says.But we will bring him around, never fear, and by the time our trunks are packed he will think it was all his idea.” [pg. 78-79]Conn later imagines what it will be like for Agnes to be “working” on her father. He chuckles at the idea but considers her to be a bossy girl.‘By gorry’ is used twice; ‘wish to God’ and ‘holy saints’ are each used once.Conclusion. Definitely worthwhile, The Great Wheel approaches the story of the Chicago World Fair from a perspective rarely mentioned – the worker’s.Visit The Blithering Bookster to read more reviews!www.blitheringbookster.com"}, {"userName": "Becky B", "userReviewDate": "Jun 10, 2016", "userURL": "http://www.goodreads.com/user/show/12785148-becky-b", "userReview": "Our story starts with Conn, a young man in Ireland, who is told by his aunt that he will journey west following the evening star and ride a great wheel. Conn soon does find himself going west, called to join his Uncle Michael in a successful sewer and drain business in New York City. Conn quickly learns the trade and is a great help to his uncle who starts talking about making him a partner, but Conn isn’t sure he wants to make drains all his life. He keeps thinking of his aunt’s fortune for him and the German immigrant Trudy headed to Wisconsin he met on the boat over. When his Uncle Patrick shows up looking for workers for Mr. Ferris’ new engineering project for the Columbian Exposition in Chicago, Conn jumps at the chance. He is soon working on what others are calling Ferris’s Folly, a great wheel that people will ride at the fair. Many say it won’t work and will fall to ruin, but Uncle Patrick has great faith in Mr. Ferris’ designs and drives all the workers hard to make sure it is a success. Conn learns new skills as he helps put the giant wheel together. When the wheel is finally finished, it does work and visitors come in droves. Conn wonders if Trudy will show up at the fair because he can’t get her out of his mind.This reads a bit like a mixture between a 1940s romantic comedy musical and a documentary on the technical details of building the first Ferris wheel. The first part comes from the fortune told Conn by his aunt and the following series of coincidences that happily get Conn to the right place and impossibly reunited for a happily ever after with Trudy (though the reader is always pretty sure that will happen…even though he doesn’t know her last name, only that her uncle is a dairy farmer and his first name is Otto). I’m guessing the sticker on the front is largely due to the popularity of such romanitic comedy musicals and the nostalgia of the older generation in the 1950s who could have witnessed this first wheel's unveiling. I like the old musicals, but in book form it came across as a bit too ridiculously serendipitous. Really, we should view Conn as in love with a fantasy and needing to get snapped out of his delusions. He’s planning his whole future on hopes of a chance encounter! The second feel comes from the numerous chapters dedicated to describing Conn and Uncle Patrick’s work on the wheel and exactly what they were doing at each step. This part I found hard to follow, not being up on mid 1800s engineering terms. Either study up on steel working methods prior to reading this or be ready to skim. There are some pictures, but not enough. I’m sure most modern young readers are going to ditch the book after getting lost in this quagmire. Though, I must add after reading Larson’s The Devil in the White City: Murder, Magic, and Madness at the Fair that Changed AmericaDevil in the White City it seems a fairly accurate historical description of the building process, so Lawson appears to have done his own research. It’s just not riveting fiction material. Another thing likely to turn off many modern readers are the antiquated terms (primarily \"negro\") used of African Americans, which, though it may have been used by those of the time period in which the book is set, come off offensive today. One last challenge for modern readers will be the vocabulary and vernacular used, from 1800s Irish slang to deep Southern drawls. It is a great exercise in puzzling through heavy vernacular, which can be fun, but can also completely lose readers. Overall, I’m not even sure if this would get published today. There are merits to the fictional recounting of the building of the first Ferris wheel, but I’m guessing it’s going to be mostly adults today interested in the time period or trying to read all Newbery Honor books who are willing to slog through the entire book. I don’t see many modern middle graders enjoying this one.Notes on content: No swearing. Some racial language not ok today. No sexual content. The construction requires some dangerous situations, but no one is hurt."}, {"userName": "Beth", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/4063913-beth", "userReview": "The Great Wheel is the story of Conn, who helps build the world's first Ferris Wheel. It's also the story of his family, friends, and fellow immigrants, and each character is distinctive, colorful, and lovingly drawn. Take his Uncle Patrick, who assures Mr. Ferris that for every 1/16 of an inch wrong in the measurements, that amount should be sliced off his nose. Or Martin Brennan, master rigger, who jumps aboard the derrick raising the largest piece of steel ever forged - the size of which was never raised before. Or Mr. Zillheimer, the pork magnate, and his family, and his lawyer Mr. Peabody. Or Mr. Ferris himself:He did not appear especially unusual or impressive: of medium size, well but quietly dressed and rather young - in his thirties, Conn guessed, although a heavy mustache made him look somewhat older. The only striking things about him were his keen, piercing, deepset eyes and his air of quiet but absolute confidence. \"If he was to be telling you the world was square you'd be believing him - and he'd be right, likely,\" Conn thought.It's amazing how this book of steel and rivets and terrifically hard work is really a book of hope and ambition and starry-eyed dreaming. Mr. Ferris puts it best:\"It may surprise you, Conn, but you see we engineers, supposedly so hard-boiled and practical, are great dealers in dreams and visions. As much so as poets and artists. For everything we build is first only a dream - then we make the dream come true. Instead of brush or pen we do it with steel and concrete, with slide-rule and tape and transit, bolts and rivets - but first was the dream.\"Out there right now there is just a messy field of frozen mud and some slabs of concrete. But there is also a vision. Close your eyes and think hard and you can see it - the great wheel turning slowly, majestically, soundlessly. Lifting people up for a little while into the clean upper air, out of the dust and noise of their everyday existence. Giving them a glimpse of wider horizons than they have ever known - perhaps a closer sight of the evening star. I wonder if Ferris's Folly is as foolish as it seems, to some?\"Needless to say, it was a tremendous success - and along with that greater engineering success comes a no-less-satisfying personal success, a lovely resolution to Conn's story. The Great Wheel is a beautiful, funny, moving story of many of the forgotten people who populate our history. (Including the singers. Not many writers incorporate other works well. This is a wonderful example.)"}, {"userName": "Christopher Bunn", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/4636657-christopher-bunn", "userReview": "Robert Lawson is a superb children's writer, responsible for books such as Smeller Martin, Ben and Me, and Rabbit Hill. He's consistently good. The Great Wheel does not deviate from his high standards. It follows the story of a young Irish immigrant who comes to America and ends up working on the construction of the world's first Ferris Wheel at the World Expo in Chicago.Part coming-of-age, part romance, delightfully humorous and full of colorful, finely crafted characters, this book is a keeper. I first read it when I was around twelve. I've re-read it recently, curious to see if it maintained allure over the decades. I was not disappointed.There's a freshness and an innocence in Lawson's writing and it's front and center in The Great Wheel. I would strongly recommend this book for children, particularly if you need something to keep them from the avalanche of zombies and witches that have inundated today's literature. However, this story isn't just for children. Adults might very well enjoy it as well.Five stars and definitely a book I want for my physical library, not just on Kindle."}, {"userName": "Lisa", "userReviewDate": "Mar 31, 2008", "userURL": "http://www.goodreads.com/user/show/42390-lisa", "userReview": "I picked this up totally on a whim because it was sitting on an endcap, and had that bright, shiny Newbery seal on the cover. It was a new version with a celebrity foreward by Richard Peck, and I didn't realize until I cracked the cover that it was actually written in about 1950. I found it pleasant enough, but without much of a hook. It's the story of an Irish boy of about 18, circa 1900, who goes to America to seek his fortune, first working with his uncle laying sewers in New York, then recruited by another uncle to work for Ferris and build the first Ferris wheel for the Chicago World's Fair. There was a lot of engineering stuff, which would probably appeal to a small and specific group of kids, and a little romance, which would appeal to another group of...okay, I'll say it, girls, except that that particular set of girls wouldn't have much interest in the main part of the story, and the romance probably wouldn't interest the kids in it for the engineering. I didn't find either all that satisfying."}, {"userName": "Alicia", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/877481-alicia", "userReview": "This fun book from 1957 is about an Irish immigrant who comes to America and helps build the giant Ferris wheel for the 1893 world's fair. This is my favorite type of read aloud: we enjoy the story, learn some history, learn about amazing people who were not afraid to try the \"impossible\", and follow an innocent romance. It's amazing what men could accomplish back then without all of our bulldozers and modern technology. This was Robert Lawson's last book, and it was named a 1958 Newbery Honor after Lawson's death. Sidenotes: We also love \"Ben and Me\" by this author. I will never forget Robert Lawson's \"Rabbit Hill\", but I shudder when I think of it. It was while I was reading aloud \"Rabbit Hill\" to my older 3, 11 years ago, that 3-year-old Rachel chopped off (to the scalp) her beautiful long blonde curls (as well as her friends' curls) so that she could \"be a boy\" like her newborn baby brother. Robert Lawson was the first (and so far, the only) person to win both a Caldecott Medal and a Newbery Medal."}, {"userName": "Jill", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/253379-jill", "userReview": "Not terribly impressed. The author throws around engineering vocabulary when explaining the building of the Ferris wheel without explaining the meaning or function of those parts. And I didn't find it interesting enough to want to learn the meanings. Granted, I read this on the heels of several Newbery Honors by Holling C. Holling, who is peerless in his explanations and illustrations of machinery, among other things. Still, there was nothing particularly gripping about the story or characters."}, {"userName": "Susan", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/1076410-susan", "userReview": "I think this is supposed to be a children's book. It's on reading level 5, but there were many engineering words in it that I didn't know, so I'm wondering if a 4th or 5th grader would understand.This book is about a young man who comes to America from Ireland and ends up helping to build the world's first ferris wheel.I really liked learning the history of the ferris wheel. I liked the first part of the book and the last part, but I got kind of bogged down in the middle where it told a day-by-day account of the building of the wheel."}, {"userName": "Rose", "userReviewDate": "Nov 14, 2015", "userURL": "http://www.goodreads.com/user/show/44437635-rose", "userReview": "This is a superb book about Conn, an Irish emigrant who crosses the great ocean to build sewers with his rich uncle and perhaps take over the business because Uncle Michael has no sons. But when big breezy Uncle Patrick comes and tells Conn of a better way to work, Conn decides to follow his star. Perhaps even as far as Wisconsin, and ride the greatest wheel of all. Well written and entertaining, with delightful illustrations by the author."}, {"userName": "Monica Fastenau", "userReviewDate": "Jan 24, 2016", "userURL": "http://www.goodreads.com/user/show/36045909-monica-fastenau", "userReview": "Read the full review here: http://newberyandbeyond.com/newbery-b...This Newbery honor book was a pretty interesting look at the 1893 Chicago World’s Fair. It follows Conn, a young Irish man who moves to Chicago to help his uncle build the first Ferris wheel in time for the fair. I do wish women weren’t relegated only to a romantic role throughout the book, but it’s still a fun read."}, {"userName": "Thomas Bell", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/4307633-thomas-bell", "userReview": "Pretty good book. The story of the building of the first Ferris Wheel for the 1893 Chicago World's Fair was really good. The story of a boy traveling to the United States on a prophecy and a dream and then working hard for that dream was good. The story of falling in love with a beautiful german woman he met once as a boy and then saw her again as a rich girl and married her was not really that good."}], "description": "\"Your fortune lies to the west. Keep your face to the sunset . . . and one day you'll ride the greatest wheel in all the world.\" When Aunt Honora reads this fortune in his tea leaves, Conn Kilroy knows he is destined for greater things than his small Irish village can offer. A letter from his uncle Michael in America offering Conn a partnership in his New York contracting company sets Conn on his western adventure. Just a few short months later Conn's Uncle Patrick lures him even farther west to Chicago, where they join the hardworking crew building what some called Ferris's Folly—the first Ferris wheel—then the largest wheel in the world and the showpiece of Chicago's 1893 World's Columbian Exposition.", "title": "The Great Wheel", "url": "https://www.goodreads.com/book/show/1124117.The_Great_Wheel", "average": 3.84, "cover": "https://images.gr-assets.com/books/1316728046l/1124117.jpg", "reviews": 73, "authors": [{"url": "https://www.goodreads.com/author/show/98320.Robert_Lawson", "name": "Robert Lawson"}, {"url": "https://www.goodreads.com/author/show/22414.Richard_Peck", "name": "Richard Peck"}], "type": ["Historical", "Fiction", "North American Hi...", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/1124117.The_Great_Wheel", "http://www.goodreads.com/book/show/1975851.The_Great_Wheel", "http://www.goodreads.com/book/show/13155851-the-great-wheel", "http://www.goodreads.com/book/show/2195710.The_Great_Wheel", "http://www.goodreads.com/book/show/333735.Rabbit_Hill", "http://www.goodreads.com/book/show/827430.Ben_and_Me", "http://www.goodreads.com/book/show/198784.Mr_Revere_and_I", "http://www.goodreads.com/book/show/198783.They_Were_Strong_and_Good", "http://www.goodreads.com/book/show/911910.The_Tough_Winter", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}