{"ratings": 264, "userreviews": [{"userName": "Craig Pittman", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/4640029-craig-pittman", "userReview": "What a brilliant, deeply researched, beautifully written book this is. I've lived on or near the Gulf of Mexico almost all my life, and covered environmental issues in Florida for 20 years, and still this book taught me a lot that I did not know. My hat's off to University of Florida professor Jack E. Davis for this stunning achievement, and highly recommend this book to anyone who cares about the Gulf or its coastline.Davis starts off the book in an unusual way, showing us how painter Winslow Homer, in visits to Homossassa Springs in Florida, came to regard the vast body of water on which he frequently fished. Then he rewinds back to the ancient people who lived along the coast in harmony with nature, takes us through the Spanish and English and French invaders and colonists, then tackles the efforts to map the coastline. Over the decades and generations he introduces us to Louisiana Cajuns, Texas roughnecks, and Florida oystermen and shady developers, and we come to see the Gulf from their particular perspective in each era. In addition to Homer, such celebrities as novelist Randy Wayne White, hotel and railroad magnate Henry Plant, Tabasco progenitor Edward McIlhenny, inventor Thomas Edison and the incomparable Ernest Hemingway show up. I was particularly happy to see him include the story of Dewey Destin, the shipwrecked New England fisherman who founded the Florida town that became known as \"The World's Luckiest Fishing Village.\"By charting the change from when the Gulf was seen as a source of a natural bounty full of tarpon to catch and other blessings, to our modern day habit of regarding it more as an industrial area full of oil rigs and commercial fish stocks, he shows how humans have abused the massive sea. He takes pains, too, to show how we have frequently underestimated its ability to strike back through hurricanes.My one quibble with the book is that I thought the BP oil spill of 2010 deserved more space. Davis makes the completely accurate point that the Deepwater Horizon disaster is just one of many indignities visited upon the Gulf, and perhaps not the worst one overall. But I think that he missed a good chance here to point out -- as many oceanographers have told me since Deepwater Horizon -- that until that disaster occurred, there was little scientific study of what was IN the Gulf that could be lost because of such a disaster and thus no baseline for knowing what Deepwater Horizon inflicted upon this American Sea. The money BP has spent trying to make up for what it did wrong has actually aided a massive advance in our knowledge of what lives in the Gulf and where and how -- studies that should have taken place before the first drilling occurred, but of course did not.That said, I must add one more thing. This is not a quick read. Davis' book is rich in vivid prose and compelling stories, and that means a smart reader will take it slow, and savor every page like a sunset over rippling waters."}, {"userName": "Lee Irby", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/1124408-lee-irby", "userReview": "I managed to procure an advanced copy of this breathtaking book and it is brilliant and important work--highly academic yet completely accessible and filled with the kinds of insightful vignettes that Davis was a keen eye for. This body of water defines the lives of millions of people, and here is a work that manages to capture the complexity and contrasts of an American tragedy in the making. It reads like a novel--a very fine novel. Davis is one of the finest writers of prose in the English language, an author who labors over each word with the mastery of a surgeon. Considering how much Davis fits in, it's a remarkable achievement of storytelling and analysis."}, {"userName": "Tom", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/2225001-tom", "userReview": "The Gulf of Mexico used to be a bounteous habitat of sea life and birds, but the oil industry, pollution, and overfishing have changed that, according to the author. Davis is an engaging writer, but the last half of the book is a drag to get through. Also, this is a book about the northern Gulf; he doesn't explore the southern Mexican coast."}, {"userName": "Peter", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/17131437-peter", "userReview": "Gulf: the Making of an American Sea (2017) is Jack E. Davis’s history of the Gulf of Mexico, a body of water overlooked in most histories of America’s growth and of growth’s consequences. Davis, a professor of environmental history at the University of Florida, has written a masterpiece. For those of us who live in the southwest Florida, the Gulf is an all-important body of water, and Davis’s history is both relevant and enlightening. The book is filled with information new to many of us, and it is written in an openly breezy style that pulls us into the political, commercial, and social history of the Gulf of Mexico. Gulf HistoryContrary to popular thought, the Gulf of Mexico was not formed by the arrival of an asteroid, though one did arrive off Yucatán long after the Gulf was formed; rather, it was created by the breakup of the original supercontinent called Pangaea, itself surrounded by a single ocean called Panthalassa. During this process the Yucatán Peninsula broke off from Florida and drifted southwestward, allowing water to rush into the new basin and flood the land as far north as Illinois. Since than the water level has fallen to create the much smaller Gulf of Mexico. Davis begins his history in southwest Florida between Charlotte Harbor (north of Fort Myers) and the southern tip of Florida (though it effectively ends at Everglades City in the Ten Thousand Islands). He breaks into that history with an 1895 archeological find on Marco Island by William D. Collier, owner of the island who settled there in 1870 and no relationship to Barron Collier who developed a huge swath now called Collier County. Marco Island is about 40 miles south of Charlotte Harbor and ten miles north of Everglades City, both large estuarial areas. And it is the estuaries that defined early Florida and determined its future.In the estuaries fresh water from inland rivers meets salt water from the Gulf to create a perfect marine environment for fish and birds; fish can find optimal salinity, currents feed the fish, and the fish feed the birds. The first known human beneficiaries of the estuary’s largess were the Calusa Indians, who emerged in 500BC to create the Caloosahatchee Culture and disappeared by 1750. They created ancient shell mounds from the detritus of the abundant oysters and fish that fed them. These mounds were sufficiently high to create small islands on which the Calusa could live. The Calusas were discovered in William Collier's find at Marco Island. Frank Hamilton Cushing, a Smithsonian Institution archaeologist, was brought to Marco Island to investigate Collier’s discovery. He concluded that it was the remnants of an ancient Indian village. This changed the image of the southwest Florida coast—no longer was it simply the place of a few hundred mean and hungry post-Civil War settlers; now it had a long history of occupation and an ancient culture.When the Spanish arrived in the early 16th century they described the Calusa as “giants:” the Calusa diet—heavy on fish, with few vegetables and little meat—made them several inches taller than the Spaniards. The Calusa lived in inland vallages often reached by canals they dug. Canals were also dug to create shorter routes for canoe travel; the longest is a 2½ mile canal on Pine Island in Charlotte Harbor. At their peak they formed a population of about 20,000 scattered throughout the region from Punta Gorda at the north end of Charlotte Harbor to Everglades City.The first European known in the area was Ponce de Leon, who entered Charlotte Harbor only to be driven away by the Calusa. In 1521 de Leon tried again but was hit by a poisoned dart and died in Cuba. Where force could not prevail, perhaps religion could—the first Spanish missionary arrived circa 1560. He could drum up no interest in the new ideas he brought (a new god with a strange message of resurrection, cloth clothing, renunciation of the pagan rituals that had served the Calusa well for centuries). The Calusa population disappeared by the 1750’s. Their demise, mirrored in the decline of Indian populations all along the Gulf Coast, was the consequence of European disease and European enslavement; to be fair, the Indians enslaved Europeans, but Europeans were just better at it. By the time of the American Revolution the Gulf Coast was under the influence of three powers: the British, the French, and the Spanish—the French and Spanish in the west; the Spanish and British in the east. In its early days Florida was split into two parts: prior to 1763, western Florida (the Panhandle) and modern Louisiana were under Spanish and French control. After the 1763 British victory in the French and Indian War the area was ceded to the British, along with eastern (peninsular) Florida. The British split it into two territories: West Florida (the Panhandle and Louisiana) and East Florida (the Peninsula). So it remained until 1781 when Spain invaded West Florida and Britain—bogged down in the American Revolution—ceded both Floridas back to Spain. Border disputes between Spanish West Florida and America led to the formation of the Republic of West Florida in 1810; it was quickly annexed to America. In 1819 America purchased the remainder of West Florida and all of East Florida, and in 1822 the two Floridas were merged as the Florida Territory of the United States. Interestingly, Davis argues that at the time of the American Revolution there were really 15 colonies even there were no Founding Fathers from the two Floridas. Jefferson’s 1803 Louisiana Purchase—so helpful in financing the Napoleonic Wars, the main thorn in Britain’s side—was prompted less by his interest in the American west than by his belief that the new U. S. should control both the Mississippi River, an important trade and strategic path into the U.S., and New Orleans, the most important port in the south. This meant controlling the Gulf passage to the Mississippi and New Orleans. Jefferson also advocated bringing Cuba under the American umbrella, a view shared by Polk who, in 1854, offered Spain $100 million for Cuba. Polk was soundly rejected, at which American anger led to a view that having been rejected, the U.S. was now free to wrest control of Cuba from the Spanish. That, of course, had to wait until the Spanish American War in 1898. Gulf Commerce: Fish, Birds, Hospitality, Real Estate, and OilThe Gulf’s early commercial history is spelled FISH. In the 1880s two fish were “discovered” that changed the Gulf. The first was the red snapper, a fish with a delightful taste that found fans in the far north. Called the “snapper” because it snapped greedily at bait, the Red was soon followed by other snappers—Mangrove, Lane, Yellow, Hog, and so on. Mullet—a fish eaten by the poor—were so abundant that they jumped into boats. Oysters, a bottom feeder that cleansed the shallows, were abundant all along the coast—William Collins’s oyster dredge at Marco Island was a significant source of oysters until it closed in 1910. Shrimp became a popular commercial catch, first the brown shrimp and then the pink. Much of the early fishing catch was from the shallow estuaries, easily reached by rowboat or light sailboat. The arrival of the powerboat increased the fishing range, and with it the type of fish sought: swordfish, marlin and other deep sea fish began to arrive on platters. And as the quantity and variety of aquatic life claimed from the Gulf exploded, the technology improved: boat size and range increased, the types of nets used changed, and so on. The arrival of refrigeration and the flash-freezing method kept caught fish fresher for longer and increased the demand for Gulf fish. The second fish—the tarpon or \"Silver King\"—brought sport-fishing and tourists to the Gulf. An international fish found in abundance around Pine Island Sound, tarpons feed in shallow waters and have no practical use other than to become fertilizer (fine bones woven throughout its meat make it edible only for the very poor). But the tarpon is a glorious fighting fish known for its tail-walks on the water and for its fierce resistance to line and rod. The first known tarpon catch was in 1885, a 93-pounder near Tampa—and with it began a flood of tarpon-seekers: for many years there was an annual tarpon tournament at Boca Grande Pass on northern Charlotte Harbor; it was recently terminated when it became so congested that it produced more fights than fish. At the apex of the tarpon-fishing hierarchy is the fly-fishing devotee, a remarkable skill given that a 150-pound tarpon is common and the record is 280 pounds. (Davis’s discussion of the tarpon relies on the famous fishing guide and crime-thriller author Randy Wayne White, whom Davis seems to think is dead; Mr. White, a Pine Island resident—might disagree.)The delights of Florida—warmth, beaches, a relaxed life style, and the Silver King—became popular when the railroads to the west coast were constructed and northerners flooded Paradise; railroads were much later in serving the west coast of Florida and the Panhandle area. To serve them, a hotel industry began with emphasis on the Silver King. Once again, Charlotte Harbor was the seminal location: Punta Gorda on the mainland, Boca Grande on Gasparilla Island, Pine Island, and Fort Myers were particular sites. A small but powerful site was Useppa Island near Boca Grande where John Roache, a Chicago streetcar company owner, built the Tarpon Inn and welcomed the glitterati as his guests. In 1911 Barron Collier, who instituted the idea of advertising on Roache’s streetcars, bought Useppa Island; much later it would be used to train for the ill-fated Bay of Bigs invasion in 1961. In the 1920s Collier would move his interests southward to the Ten Thousand Islands, building Everglades City into his company town. At his Everglades City Rod & Gun Club he would fete Presidents and industrial tycoons like Firestone and Edison.Tarpon, oysters, snapper, grouper and others that once populated the Gulf would be taken in such abundance that eventually the population dwindled and the pickings became sparse. The same would happen to another species—the birds that migrated along main migration paths from the Yucatán Peninsula and further south to the northern U. S. Entire rookeries were destroyed in a single day, some of it in the area of Everglades City but also along the entire coast up through Texas. As many as five million birds were killed annually for plumes at the height of the put-a-feather-in-your-cap fad of plumage in ladies hats. The large wading birds—egrets, heron, ibis and so on—were particularly favored for their long feathers. A name often associated with this is Jean Chevalier, a bird hunter who started destroying rookeries around Tampa when plumage became valuable in 1870 and moved down the coast, killing birds in the Ten Thousand Islands in the mid-1880s. As tourism increased, the Gulf Coast—especially — very large resort and spa hotels sprouted along the Gulf coast especially the Mississippi and Louisiana coasts. The hospitality industry blossomed. One hotel clocked in at 860,000 square feet. Interest shifted a bit from fishing to the health benefits of warm salt water, mineral springs, and a day on the beach. But it was not all balmy winds and calm seas—roughly every eight years the northern coast of the Gulf was hit by a major hurricane. In 1893 and 1898 hurricanes swept spas and hotels away under storm surges up to 16 feet, and in 1900 a major storm obliterated Galveston, Texas. The 1900 storm remains the most devastating American natural disaster, with up to 12,000 dead and all of Galveston Island destroyed. In 1910 a hurricane hit the Ten Thousand Islands with much damage; another in 1927. But fortunately, there wasn't a lot to damage in the Ten Thousand Islands.Tourism brought with it a land rush. Men called “binders” sat at street corners selling real estate: the binder was a transferable contract to buy property with a ten percent deposit. Most buyers planned not to occupy the land but to sell the binder at a higher price; it was a tool for speculation. Land prices increased until the Florida Land Bust of 1925, of which Grouch Marx remarked, \nYou can get anything you want in Florida. You can even get stucco. Boy, can you get stuck-o.\nThe next miracle growth medicine for the Gulf Coast was oil. Prospectors had a simple way of finding oil—look for salt domes, of which there were 500 along the Gulf coast. Salt domes were land upthrusts from that vast ancient sea that had once gone up to Illinois—the dome was a sign of pressure from below, possibly from natural gas, pushing upward on an impervious layer of salt, forcing the subsurface rock to rise and creating ridges on the earth’s surface. The primary locations of salt domes were Texas, Louisiana, and the Gulf itself. The first salt dome to be exploited was near Beaumont, Texas. The flood of oil found there in 1890 at a hill called Spindletop did not last long, but it began a flood of oil rigs to the area. The rigs soon went farther afield and into the Gulf itself, first as shoreside rigs located on piers and later, as technology improved, as stand-alone platforms well out into the Gulf. By the 1930s oil was the Gulf's growth industry. It was discovered just in time to fuel the growth of the automobile industry, repower the shipping industry, and replace coal a the primary source of fuel. Davis reports that during World War II German submarines marauded the Gulf and the light from blazing oil tankers and rigs was a common sight along the shore.This synopsis carries Gulf from its earliest days through WWII and into the modern era. It is long—reflecting the depth of information in the book, and its length (550 pages). But it masks the delightfully breezy style that Davis brings to the people and events that drove the Gulf coast through its remarkable periods of growth and decline. It also masks the primary message of the book: each phase of growth created ecological consequences that moved Florida further away from it origin as a coastal paradise. Anything less than five stars would be an unwarranted insult. This history is destined for the bookshelves at homes and universities for a long time to come, long after it leaves its well-earned spot on bedside tables.Five Stars!"}, {"userName": "Ray", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/17822108-ray", "userReview": "Along the same lines as the \"Atlantic\" and \"Pacific\" books by Simon Winchester, this book by Jack E Davis tackles the history of the Gulf of Mexico from Aboriginal settlement, European exploration (and often devastation) to modern day growth, over-growth and ultimately pollution.I loved the historic tales of the bounty of fish within the Gulf and the irony of European explorers starving and resorting to cannibalism as they sight to oppress the \"savages\" who had grown strong on the local catch.And as usual, the tales of modern day exploitation and pollution is depressing but essential."}, {"userName": "Steven", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/975391-steven", "userReview": "This book took me forever to read -- more a function of too many outside distractions than anything to do with this book.Davis is a Florida historian who specializes in the environmental history of the Gulf states. The book covers the geology, natural history, weather, and human history of this body of water that much of America outside of the region doesn't give much of a thought. Living just 130 miles from the Gulf myself, it doesn't seem to affect me much. Or so I thought.I confessed I preferred the early chapters about native people's who lived along it's edge and the early explorers. Davis makes the point that up until the late 19th century, the sea was considered something to be feared, so only those who made their living on or near it tend to settle along it's shores, but all that changed with the rise of sport fishing, accessible automobile travel and the leisure/retirement industry. But even heavier than the pressure put on the Gulf by development for housing and recreation is the extreme impact of heavy industry, from the oil and gas exploration that takes place both offshore and inland, and the Gulf drainage of a large part of the nation's farmland and all that we pour onto it downstream. It's not all gloom and doom. Thank goodness for the artists, writers, birders, fishermen and environmentalists who are doing their best to keep the Gulf alive. I want to take a drive and just go stare at it for a while.."}, {"userName": "Nicholas Bilka", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/1357351-nicholas-bilka", "userReview": "This is an important and challenging look at the Gulf with a particular focus on the Gulf Coast of the United States and the human impact on this body of water. The Gulf offered native populations and later European invaders an unsurpassed natural bounties in its sea life, wild life and its petroleum resources. As American's became more comfortable living by the sea, the Gulf's Coast was exploited by developers who saw an opportunity to sell the landlocked middle class the dream of living in a warm climate with views of the water. Though there is a certain democratizing aspect of these development of expanding the coastal dream to the middle classes it might not otherwise be available to, it came at a high cost that we will deal with for some time to come.The book in my view drags towards the last couple of chapters, the overall book is quite good and an achievement that earned Mr. Davis the Pulitzer Prize. Don't go in expecting a chronological history that covers all of the Gulf story (or all of the Gulf for that matter as this focuses mostly on the parts adjacent to the US), but rather a book that covers different pieces of the Gulf that the author (and most of the time, this reader) finds particularly interesting and important in understanding the importance of this body of water and region."}, {"userName": "Beth", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/3897175-beth", "userReview": "Choosing read this later this year."}, {"userName": "Gayla Bassham", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/127212-gayla-bassham", "userReview": "This is a well-written and researched book, and I recommend it, but I didn't get as much out of the second half as I should have because (a) I am terrible at geography and (b) it's not really my subject. For me it felt long and a bit repetitive, but were I as interested in ecology and conservation as the author is I think I would have loved it. (The writing really is top-notch.) This is a Gayla problem, not a book problem!"}, {"userName": "Kem White", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/1376431-kem-white", "userReview": "The Gulf is a lengthy work on one of the world's great natural resources. Davis covers all aspects of this American sea: cultural history, natural history, ecology, and destruction. The history is first rate as he discusses the Gulf's exploration by Europeans and their interactions with the indigenous populations. The natural history is wonderful, too, as Davis describes the birds, fish, mollusks, reptiles, amphibians, and mammals that inhabit the Gulf's varied ecological zones. He concludes the book with a lengthy description of how mankind has abused the Gulf, its estuaries, and the rivers that feed it. This last section is not for the fainthearted environmentalist as case study after case study is presented describing over-fishing, pollution by the petrochemical industries, and deluges of poisonous run-off from agribusiness and suburbia. The Gulf as it exists today is probably moribund. I can't see how this body of water can sustain such disregard forever. Nor does the author, evidently, as his concluding chapter ends pessimistically. Given that a majority of the natives of the Gulf states abhor environmentalists and government - and greatly support the current administration's anti-environmental agenda - there's no hope or reason to think that the residents of the Gulf care about its health and sustainability. The writing is overall very good though there are sections that have a \"cobbled-together\" feel to them. I could have used a few more maps as the author hops around the Gulf in his discussion quite a bit. And a few more photos from days-gone-by would have been fun. Highly recommended for fans of American natural history. Recommended for everyone else."}, {"userName": "Richard Thompson", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/3501898-richard-thompson", "userReview": "I found this book after reading THE DEATH AND LIFE OF THE GREAT LAKES when I went looking for other books by Dan Egan. I didn't find any other Egan titles but I noticed that the same publisher, W. W.Norton and Company had recently published a book about the Gulf of Mexico. The public library, at my request, graciously purchased a copy.An excellent book looking at the natural and cultural history of the Gulf. (A quick heads up: this book deals only glancingly with the Deepwater Horizon disaster. You will be treated, however, to many many stories of the egregious recklessness and stupidity of the oil and industries that have fouled the waters and coastline of the Gulf.)Like, the Great Lakes book, the take-away message, though, is it that human beings should not be allowed to play with technology more complicated than fire and sticks. Maybe rocks if they are well regulated.You cover a lot of territory traveling from one end end of the arc of the Gulf to the other. More — and more detailed — maps would have been nice. You'll want to have quick access to Google maps while you are reading this book."}, {"userName": "Charles Stephen", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/5342833-charles-stephen", "userReview": "This comprehensive study of human activity on and around the Gulf of Mexico is a valuable addition to scholarship. Further, it will delight all persons with any connection by birth or geography to the Gulf. I lived near the Gulf in Mobile until my twenties, and many of my family and friends still claim that connection to the waterfront. My list of persons for whom this book would be a treasured gift keeps growing. Davis also traced the growth of an environmental consciousness among people who make their home near the Gulf. Whether you believe in climate change or not, this book will help you understand the human causes of the tragedy unfolding in Houston in the aftermath of Hurricane Harvey.This book will give its readers essential background and talking points for the debate that will deadlock Congress in the weeks ahead as the bankrupt federal flood insurance program comes up for renewal at the end of September, 2017."}, {"userName": "Samantha", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/16891475-samantha", "userReview": "This is very well researched and competently written, but as narrative nonfiction, it fails badly. The chapters don't flow well from one to the next. The number of pages dedicated to various subject matter doesn't seem to match the topics' importance, and certainly not its ability to draw interest. But mostly, the problem is that while set up as narrative nonfiction, it reads more like a textbook. And I say this as someone who generally likes dry nonfiction. Seems like the Pulitzer committee is really struggling with a lot of the nonfiction categories of late. Last year's Barbarian Days (the winner for biography), was also a huge dud.This isn't a \"bad\" book by any stretch. It's just that reading it felt like work."}, {"userName": "Brad Syverson", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/1295885-brad-syverson", "userReview": "Very interesting and very well written history of a body of water from the American perspective. The author knows how to dig into the facts but still tell a story whether sweeping or minor. I always knew most of the Texas Gulf Coast was somehow lacking in soul but now I understand why. It’s the great American story really - often successful in sustaining a middle class but increasingly distorting wealth toward an entrenched elite and slowly destroying the land and sea upon which it is built. I would love to know more about the Mexican andCuban side of the story. But read this as a primer in how to write history, tell a story and how to understand the American Sea and the American story."}, {"userName": "Adam Calhoun", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/3536312-adam-calhoun", "userReview": "The Gulf is an ecological history of the Gulf of Mexico. What starts off as an interesting human history of how early Amerindians and Spanish conquistadors interacted with the unique ecology of the Gulf eventually turns into a slow, repetitive explanation of different ways the animals and climate of the gulf shaped the Americans who lived there - and how they shaped it. The second half of the book is in no way as good as the first half of the book, slowly drawing out each and every point without contributing much new. This half could have been half as long, or twice as filled with information. But the first half should be required reading for understanding the history of the region."}, {"userName": "David Hensley", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/28158066-david-hensley", "userReview": "Anyone who loves the Gulf as much as I do (and I love it a lot) must read this book. It's absolutely essential reading if you really want to comment on the Gulf ever again, to be honest. Davis comprehensively covers the American Gulf Coast to Key West. I have visited every place accessible by land on that entire coast, and looked as far as I could through binoculars and off ferry decks and from airplane windows as I could at the rest, and he faithfully mentions at least every locale at least once.In fact, I thought he was leaving out one of my favorite stretches of coast, Cedar Key, but it turns out he was saving it for the very end, in the epilogue! Truly a tour de force."}, {"userName": "Amanda", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/2937472-amanda", "userReview": "A comprehensive and in-depth treatment of life on the Gulf of Mexico from Spanish exploration in the 1500s to today’s fight to save the coastline. The content and style reminded me a bit of Bill Bryson (though with significantly less humor) in terms of sheer quantity and breadth of information covered. Chapters are generally divided thematically — covering topics like the development of various fishing industries, the history of seabirds on the Gulf, sand reclamation projects, hurricanes, seaside tourism, the oil industry and much more."}, {"userName": "Gene Coatney", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/5777039-gene-coatney", "userReview": "Not knowing what to expect from this, I was pleasantly surprised by how much I enjoyed it. I learned way more than what I usually do from a history book, partly out of a lack of knowledge of the area, but also from how much information he crammed into it. There was a few people that he spent more time on with a sense of hero worship than I liked, but even those were interesting. There were times that I thought he was very heavily biased against progress, but generally he laid out good reasons for it and even went out of his way to show both sides with fairness. would defiantly recommend."}, {"userName": "Trinad", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/10185387-trinad", "userReview": "Excellent read! All you ever wanted to know about the history of the Gulf of Mexico and its surrounding coastline. Not a happy read but illuminating and sometimes depressing in that the Gulf waters and its shoreline surroundings are being destroyed. But there are some silver linings. But not enough of them. Please read this book! Every citizen can do something to help save the Coast. Stop fertilizing your lawn for starters. Really. Loved this book. Kudos to Jack Davis!!"}, {"userName": "JQAdams", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/35657160-jqadams", "userReview": "I wasn't quite on board with all the rapturous reviews this received -- a little lyricism about the power and beauty of nature goes a long way for me, and the mini-hagiographies of people who appreciate the environment aggressively rejected any dictum of \"show, don't tell\" while flattening the people involved into kind of boring unidimensional characters. But it was a solid history of the Gulf of Mexico, notwithstanding the lack of maps."}, {"userName": "Jacqulyn", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/22660912-jacqulyn", "userReview": "Attention High School Library Media Specialists, this book is a must for your collection. It is an excellent history and environmental resource, that is also well documented, with a very comprehensive index. \"The Gulf\" is beautifully written. I had expected it to be a dry report of information, but it was incredibly interesting. The book has given me a greater appreciation for the history of the area, and how society has affected this very important ecosystem."}, {"userName": "Kim", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/6766668-kim", "userReview": "This books tells the story of and is a call to action to protect the Gulf of Mexico. Beautifully written and researched, it shares vignettes of the key moments of history of the Gulf, intersections of environment, humans, big industry and local economies, and the critical role the Gulf plays not only for the American economy- but its connections to the watershed that flows from Canada until the Gulf - and the currents that run from the Gulf and effect a large part of the world."}, {"userName": "Kevin Moynihan", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/63604822-kevin-moynihan", "userReview": "Interesting. Pays homage to Braudel’s Mediterranean using the Gulf of Mexico as the subject. Different and enjoyable. Somewhat leftist slant to be expected of American educators today. Certain sections are pretty thin, particularly chapters that focus on individuals. If I have to read one more, ‘so and so is the real deal...’ ugh."}, {"userName": "Tom Rose", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/66576892-tom-rose", "userReview": "FABULOUS BOOK beautifully and clearly written with an emphasis on environmental history about the states that abut and those that drain into the Gulf. The chapters on fish and birds are phenomenal, and despite all the horrors to destroy the Gulf, Jack Davis ends on a hopeful note. This should be required reading for every high school and college student in Florida."}, {"userName": "Scott", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/63979167-scott", "userReview": "Although the book seemed to have been a basic history regarding the Gulf, it does the walk in an informative manner.A note regarding Audible's reader Tom Perkins' pronunciations of local names were consistently wrong. For example Biloxi, it's not Bih-LOCKS-ee. It's Buh-LUCK-see. Homosassa needed help too.  Although not a name, aquatic is soft and does not quack like a duck."}, {"userName": "David Barney", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/25910655-david-barney", "userReview": "This book covers a multitude of aspects about the Gulf of Mexico. I lived in Florida and reading about the areas made the reading more enjoyable. The book is a rich history of the Gulf. Very enjoyable."}, {"userName": "Tom W", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/843887-tom-w", "userReview": "Great read. A history of the land, water and culture. Ends with a litany of damages we have done to this wonder and resource. There is hope that we can stop trying to dominate nature and thus extend our stay on this planet."}, {"userName": "Tricia Rutledge", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/51215185-tricia-rutledge", "userReview": "I would give this book 10 STARS!! I couldn’t put it down..., something I can usually do with a nonfiction. Beautifully written and chocked full of incredible research and history. No one gets an out of jail free card!"}, {"userName": "Geoff Walling", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/47517440-geoff-walling", "userReview": "Really good book. The history is given in great detail, as is the explanation of everything humans have done to wreak havoc on the land and animals. If you weren't an environmentalist before reading this, you probably will be afterwards."}, {"userName": "Curt", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/13337512-curt", "userReview": "Highly informative. Detailed. Entertaining. The last section regarding the workings of the American government and corporations was interesting and highly infuriating. However like the man said, if you're not pissed by now you haven't been paying attention."}], "description": "When painter Winslow Homer first sailed into the Gulf of Mexico, he was struck by its \"special kind of providence.\" Indeed, the Gulf presented itself as America’s sea—bound by geography, culture, and tradition to the national experience—and yet, there has never been a comprehensive history of the Gulf until now. And so, in this rich and original work that explores the Gulf through our human connection with the sea, environmental historian Jack E. Davis finally places this exceptional region into the American mythos in a sweeping history that extends from the Pleistocene age to the twenty-first century.Significant beyond tragic oil spills and hurricanes, the Gulf has historically been one of the world's most bounteous marine environments, supporting human life for millennia. Davis starts from the premise that nature lies at the center of human existence, and takes readers on a compelling and, at times, wrenching journey from the Florida Keys to the Texas Rio Grande, along marshy shorelines and majestic estuarine bays, profoundly beautiful and life-giving, though fated to exploitation by esurient oil men and real-estate developers.Rich in vivid, previously untold stories, The Gulf tells the larger narrative of the American Sea—from the sportfish that brought the earliest tourists to Gulf shores to Hollywood’s engagement with the first offshore oil wells—as it inspired and empowered, sometimes to its own detriment, the ethnically diverse groups of a growing nation. Davis' pageant of historical characters is vast, including: the presidents who directed western expansion toward its shores, the New England fishers who introduced their own distinct skills to the region, and the industries and big agriculture that sent their contamination downstream into the estuarine wonderland. Nor does Davis neglect the colorfully idiosyncratic individuals: the Tabasco king who devoted his life to wildlife conservation, the Texas shrimper who gave hers to clean water and public health, as well as the New York architect who hooked the “big one” that set the sportfishing world on fire.Ultimately, Davis reminds us that amidst the ruin, beauty awaits its return, as the Gulf is, and has always been, an ongoing story. Sensitive to the imminent effects of climate change, and to the difficult task of rectifying grievous assaults of recent centuries, The Gulf suggests how a penetrating examination of a single region's history can inform the country's path ahead.", "title": "The Gulf: The Making of An American Sea", "url": "http://www.goodreads.com/book/show/30231749-the-gulf", "average": 4.23, "cover": "https://images.gr-assets.com/books/1464994820l/30231749.jpg", "reviews": 65, "authors": [{"url": "https://www.goodreads.com/author/show/115983.Jack_E_Davis", "name": "Jack E. Davis"}], "type": ["History", "Nonfiction", "Science", "Environment", "Environment"], "outlinks": ["http://www.goodreads.com/book/show/30231749-the-gulf", "http://www.goodreads.com/book/show/34569310-the-gulf", "http://www.goodreads.com/book/show/198924.Race_Against_Time", "http://www.goodreads.com/book/show/4742587-an-everglades-providence", "http://www.goodreads.com/book/show/336519.Paradise_Lost_", "http://www.goodreads.com/book/show/7538324-make-way-for-tuggy-with-attached-3-d-vinyl-figure", "http://www.goodreads.com/book/show/9907136-aesthetic-plastic-surgery-v2", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}