{"ratings": 107103, "userreviews": [{"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Fanfreakingtastic! 🖤🐾🐺"}, {"userName": "Markus", "userReviewDate": "Dec 18, 2013", "userURL": "http://www.goodreads.com/user/show/26681101-markus", "userReview": "“Ravens and crows. Rats Mists and clouds. Insects and corruption. Strange events and odd occurrences. The ordinary twisted and strange. Wonders!The dead are beginning to walk and some see them. Others do not, but more and more, we all fear the night.These have been our days. They rain upon us beneath a dead sky, crushing us with their fury, until as one we beg: \"Let it begin!\" -Journal of the Unknown Scholar, entry for The Feast of Freia, 1000 NE”Tarmon Gai’don is looming. War, death and madness have become part of day-to-day life in the Westlands as the final struggle with the Shadow is at hand…The Gathering Storm is the first of the three books written after the Creator’s passing. Brandon Sanderson does not disappoint, especially because his influence is practically invisible. There are differences, of course. But apart from the minor change in writing style, this is still very much Robert Jordan. Light be praised.Storylines are finally moving towards an end. A couple of major revelations are dropped. And Egwene al’Vere is the obvious star of the show. Who would have thought?\n“The end is near,\" Moridin said. \"The Wheel has groaned its final rotation, the clock has lost its spring, the serpent heaves its final gasps.”\nWheel of Time reviews:#1 \nThe Eye of the World\n#2 \nThe Great Hunt\n#3 \nThe Dragon Reborn\n#4 \nThe Shadow Rising\n#5 \nThe Fires of Heaven\n#6 \nLord of Chaos\n#7 \nA Crown of Swords\n#8 \nThe Path of Daggers\n#9 \nWinter's Heart\n#10 \nCrossroads of Twilight\n#11 \nKnife of Dreams\n #12 \nThe Gathering Storm\n#13 \nTowers of Midnight\n#14 \nA Memory of Light"}, {"userName": "Richard", "userReviewDate": "Dec 15, 2009", "userURL": "http://www.goodreads.com/user/show/2933081-richard", "userReview": "I first picked up the Wheel of Time series fifteen years ago while a freshman in college. I remember being totally caught up in the series, consumed by the characters and taken in by the world. I looked forward to every page, couldn't decide on my favorite character and couldn't wait for the next book. That changed as the series went on. Wandering plotlines, characters that became so unlikeable that I loathed when they appeared for more than a chapter at a time, and so much of the plot taken up with unimportant throwaway characters that I felt like I needed a separate book just to keep up with all of the characters. I remember clearly the moment I decided I was done with the series, after an entire book searching for the bowl of winds, only to reach the end of the book and with bowl in hand, the characters... do nothing. It was another half a book before the artifact was finally used. So it wasn't until Robert Jordan died that I went back and picked up the last few books that I hadn't read, in anticipation of Brandon Sanderson's writing the final novel. I was pleased to find that the books resolved some of the issues as they went on, even though, as I picked up the 'last' of the Wheel of Time books I learned it would be the last of three.The Gathering Storm renewed my love of the Wheel of Time. Sanderson's writing pays homage to Jordan just enough that the book doesn't seem disjointed, but it so many ways it is much better. Rare are the chapters where we follow a character through the minutia of walking from one place to another without the plot moving forward. Chapters told from the point of view of characters not central to the plot were revealing and concise. The plot moves forward at a satisfying pace and resolves many of the plotlines that we have been waiting years for. Even more satisfying is that the characters become likeable again. Even Rand by the end, is one step closer to being a sympathetic character. I totally recommend the Gathering Storm as a book that will renew the faith of Jordan readers like me, who became disenchanted over the years. I'm looking forward to the final two books of the 'A Memory of Light' and in the meantime I will be introducing myself to Sanderson's other books."}, {"userName": "Choko", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/27962805-choko", "userReview": "*** 5++++ ***Another buddy read with the Fantasy Addicts at BB&B! May the Wheel keep on turning!!! \n\"...\"“Pessimism, she is a fond friend of yours, yes?\" -That's uncalled for. I barely know her. Mere acquaintances, at best.”...\"\nWOW!!! Brandon Sanderson did Robert Jordan proud!!! What a ride! What an amazing series!!! The complexity of plot and characters are not comparable to anything else I have ever read in my entire life! It would be impossible for me to even delve into what happens in this book... How do you summarize the whole of everything that goes on around you at all times? Impossible! There was joy, there was pain, there was anger, grief, and there was hope! And Sanderson's stile of writing, although not the same as Jordan's, fits perfectly with the feel of the series, mostly in the ability to lace even the toughest situations with some humor and make us look on the bright side of the problem! Wow!!! Did I say WOW???!!!! \n\"...\"“The Wheel has turned, for better or worse. And it will keep on turning, as lights die and forests dim, storms call and skies break. Turn it will. The Wheel is not hope, and the Wheel does not care, the Wheel simply is. But so long as it turns, folk may hope, folk may care. For with light that fades, another will eventually grow, and each storm that rages must eventually die. As long as the Wheel turns. As”...\"\nTo all fans of Epic Fantasy, you guys have to give the series a try! It is soooo worth it!\n\"...\"“The end is near,\" Moridin said. \"The Wheel has groaned its final rotation, the clock has lost its spring, the serpent heaves its final gasps.”...\"\nWish you all Happy Reading and may you always find inspiration in the books you read!!!"}, {"userName": "Gavin", "userReviewDate": "Dec 27, 2016", "userURL": "http://www.goodreads.com/user/show/8192509-gavin", "userReview": "I guess the big question that counts when considering this 12th volume of the WoT is how did I feel about the switch from Robert Jordan to Brandon Sanderson? I was more OK with the change than I anticipated. I'm a big Brandon Sanderson fan but I had definitely been dreading the moment when he took over writing WoT. Mostly just because I like consistency and WoT books always had such a familiar and distinct feel to them. Some things were definitely different, but I think the most important thing of all was that Sanderson managed to capture the spirit of the story and managed to maintain that special \"WoT feel\". Sanderson's WoT was worse than Jordan's WoT in some ways but, surprisingly, better in others. The trade off worked out about level for me. The big plus Sanderson brought to the 12th WoT instalment was a dramatically improved pacing. There was no dull spots and no chapters that felt like filler or where if felt the characters were just treading water. Every chapter was engaging and interesting and a few of the more action packed and emotionally charged chapters were among the best WoT moments in the whole series. One of the most noticeable differences between Sanderson and Jordan was the tone and type of the humour. Jordan always favoured subtly and hilarious mishaps while Sanderson favours a more direct style which meant the humor came more in the form of witty banter. I'm not sure which type of favour I favour in general but did find the change in style in the context of this series to be a touch jarring at times. I also felt like Sanderson had a slightly different interpretation of some of the WoT characters than Jordan himself had. I know, not a big surprise considering we as fans all likely have a billion different interpretations of the characters from what Jordan himself intended! Still, I did find the change a little jarring. It was most noticeable in Mat, Nynaeve, and Elaida. Talmanes was also a bit different but Sanderson had more wiggle room there as Talmanes was only a minor secondary character in Jordan's books while in this one he was basically promoted to Mat's main sidekick. Mat and Elaida regularly acted \"out of character\" in my eyes while Nynaeve also had a few moments that felt wrong for her. The story itself in this 12th WoT book was actually pretty good. It was fast paced and quite engaging from start to finish. We got to see excellent progress in a number of the long term ongoing story arcs. The main focus of the story was on Rand and Egwene. Rand sought his alliance with the Seanchan, had more encounters with the Forsaken, tried to get his army ready for the Last Battle, and battled a lot of his own inner demons and increasing madness. Egwene sought to unify the Aes Sedai and deal with the Black Ajah. Both story arcs were pretty exciting. Mat and Perrin had a few moments of their own, especially early on, and their parts were entertaining enough. Elayne never appeared at all and was basically on the bench for this instalment. As always the main cast was helped out by some enjoyable back up from a few of the secondary POV characters. The pick of the bunch in this book was Tuon, Cadsuane, and Tylee. All in all this was a great read and a worthy addition to the fantastic WoT series. Rating: 4.5 stars. I was tempted to give it the full 5 stars as it really was that sort of quality by I'm hacking off half a star because of some moments that really annoyed me. Audio Note: We might have had a change of author, but thankfully we retained our fantastic WoT narration pairing of Micheal Krammer and Kate Reading. They are as good as it gets!"}, {"userName": "Kaitlin", "userReviewDate": "Jun 22, 2015", "userURL": "http://www.goodreads.com/user/show/19126246-kaitlin", "userReview": "So this is book 12 of the Wheel of Time series and this is the first one which is written after Jordan's death by Brandon Sanderson. I am not going to lie, Sanderson is the reason I began reading the WoT series (because I wanted to read everything by him) but along the way Jordan sucked me in, developed this stunning world of visionary, resentful, powerful and dangerous characters, and created a massively fun story. Some of the books are better than others. I liked most of the ones so far (although book 6 remains my favourite at the moment) and yet, getting to the Sanderson books still makes me feel so good. Not because I forced my way through the series or hated it, I didn't, but because I knew that I began 2 or so years ago with the series because I wanted to get to the Sanderson books, and now I have done so (and so far it's wonderful!)Book 12 is the beginning of the end. Whilst Knife of Dreams (book 11) was the start of Jordan's attempt to bring the strings back together book 12 is the beginning of the questions being answered and the characters forming up and resolving their problems/plotlines in order to be ready for the inevitable Last Battle. In terms of how Sanderson compares to Jordan as a writer I think he does a great job of not disrespecting the story which Jordan set up so well. He says in the introduction to the book that he never wanted to lie and try to emulate Jordan and have none of his personality come through, but equally he wanted it to be true to Jordan's wishes for the story and he wanted it to come out right in the end. Sanderson being a long-term fan of the series is also obviously a big help to him because he knew these characters and he knew who they were before he began writing them, and he does a fab job of emulating them and continuing their storylines in a way that makes them believable still. In terms of the plot this book is undeniably much better paced than some of the previous ones by Jordan himself. Whilst Jordan's books tend to be a steady and slow build with the halfway point being the turning point where the action really begins, Sanderson has a knack for instantly starting out with something that will not only interest you, but will also capture and hold your attention for the duration of the book. I flew through this book a lot quicker than any of the last few books in the series. I wanted, at all times when I was busy, to have the audiobook going or the physical book in hand. It was fun, it was fab, it was full of answers and resolutions which we've been longing for, and ultimately needing. The series has, in my opinion, benefited massively from Sanderson taking over, and that's no discredit whatsoever to Jordan, as he set everything up and planned everything out meticulously, but Sanderson is better at engaging you quicker. On the whole, I won't go into any details about what really happens in this book but just know that this is the second best of the series so far (with the first one being book 6 by Jordan himself) and that it really is a throughly good read. I would say that this has filled me with so much excitement for the final two books now, and I eagerly await seeing where they will take not only me, as the reader, but the characters that we follow in the story. I want to know who will win, how will they win, and what is going to happen in the end to the world of the Wheel of Time. There's so much originality which for a time became a little stale, but now I have nothing but anticipation for book 13 and 14.A wonderful 5* read with so many improvements to the character's storylines and the way they're progressing. Can't wait for book 13 very soon :)"}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "4.75 Someone Else is Driving the Car Stars\n\n\n“The end is near,\" … \"The Wheel has groaned its final rotation, the clock has lost its spring, the serpent heaves its final gasps.”\n\nThis is the first book that was written after Robert Jordan’s death by Brandon Sanderson. I got so emotional when I read the opening words in the Foreword.\nI have not tried to imitate Mr. Jordan’s style. Instead, I’ve adapted my style to be appropriate to The Wheel of Time. My main goal was to stay true to the souls of the characters. The plot is, in large part, Robert Jordan’s, though many of the words are mine…But this is a big project, and it will take time to complete. I beg your patience as we spend these next few years perfecting this story. We hold in our hands the ending of the greatest fantasy epic of our time, and I intend to see it done right. I intend to remain true to Mr. Jordan’s wishes and notes. My artistic integrity, and love for the books, will not let me do anything less. In the end, I let the words herein stand as the best argument for what we are doing. This is not my book. It is Robert Jordan’s book, and to a lesser extent, it is your book.\nI’m just going to give props to Sanderson for taking over such a massive epic fantasy. It couldn’t have been easy and yet I think that he did a fantastic job with this book. Yes there are some differences in the writing styles and a few of the characters change a smidge more than expected but overall it is amazing how well he did.The Best Parts: ♔ - The better pacing of the story. I don’t know if this is because we are coming to an end and so all the foundations that RJ set down and the arcs he built up are finally starting to tie together or if Sanderson’s style of writing has led to it but the pacing of this huge book is fantastic. I’ve been reading this series for a year now just a few chapters a day and this was the first time that it was actually really hard to put the book down after 2-3 chapters.♕ - Verrin just WOW. Look I’ve gone back and forth on Verrin and her goals in this series. Which team is she playing for? What is that woman up to? Can we trust her or is this just another Aes Sedea Plot? Do I like her, do I hate her??? Well I’m just going to say that whatever I was thinking what was actually ture was SO MUCH BETTER. ♖ - I’m going to give huge props to Egwene. She is really proving to be a very competent Amerlyn and I’m really interested in what she is going to do after this book. She could be the greatest Amerlyn in history if she keeps this up. ♗ - Min is always one of my favorite characters and I really like to believe that she and Rand are the true soulmate match and he is just going to sperm donor it up for Elayne and Avienda they are a cuter couple together than with Rand. I think this book shows just how much Min gets Rand and how she is the one that is going to support him through this huge undertaking. But Rand in most of this book was bleak and we find out why.\n“I continue to wonder,' he said, glancing down at Min, 'why you all assume that I am too dense to see what you find so obvious. Yes, Nynaeve. Yes, this hardness will destroy me. I know.' ...You all claim that I have grown too hard, that I will inevitably shatter and break if I continue on. But you assume that there needs to be something left of me to continue on. ...That's the key, Nynaeve. I see it now. I will not live through this, and so I don't need to worry about what might happen to me after the Last Battle. I don't need to hold back, don't need to salvage anything of this beaten up soul of mine.” \n♘ - The meeting with the Seanchen. Look I didn’t think that it would go well but Rand meeting Tuon….well I’ve been waiting for it for so long and now it has happened and I’m not sure where all the chips are going to fall. I semi-see both sides BUT the Seanchen collar and subjugate those who have the one power and I don’t see that being something that Rand will ever tolerate. ♙ - I loved all the different crazy happening with pockets of power. It is just amazing all the different ways the dark one is touching the land and how it is affecting different people in different places. The Town that Matt went to for instance well that is a huge disturbance and a very cool idea. ♚ - Last but not least Terminator Rand is dead. Look he has been pretty moody and bleak for the last few books and I get why but it was so nice to finally FINALLY have some resolution with that voice in his head. I’m glad that we got that out of the way. It has been an emotion trip with Lews Therin in Rand’s head but we definitely got some great resolution on that story arc and I’m really happy with it.The Worst Parts: (they aren’t really bad they are just different) BS did a great job with this but there are going to be a few things that are different that you notice.1 – Robert Jordan’s humor was more situational and Brandon Sanderson’s is more banter/wit type. I liked this change since I appreciate the banter/wit more than situational comedy. Still it is noticeably different especially in Mat’s character and Telmanus. Not really good or bad just different.2 – I think that RJ’s villains are a bit more subtle and Sanderson’s are more in your face. Elida is a prime example. She was a bit cruel before but in this she was flat out cray-cray 3- The flow of the story is a bit different. I like the change up and faster speed of things but you can definitely tell that someone else is driving the car now.Overall:This world/story have been amazing and I’m really glad we are wrapping everything up and going into the last battle. It is time and I do think looking at the last 2 books I read that it was probably worth some of the slow meandering of books 8-10 to get to 11-14. But I’ll know better if that is true at the very end."}, {"userName": "Evgeny", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/9340136-evgeny", "userReview": "Final rating: 3.5 stars.After an early and unexpected death of Robert Jordan somebody had to finish his magnum opus. A relatively new and unknown at the time author was chosen: Brandon Sanderson. Fortunately for the series' fans Jordan left enough notes regarding further plot developments and it is said the final chapters of the last book were entirely written by him. So did Sanderson succeed in continuing the biggest epic series in fantasy? It really depends on what you expect from Wheel of Time.The first and foremost complaint about Sanderson's writing was about the characters: they did not feel right and became somewhat two-dimensional; the latter is my own opinion. I will give a detailed picture of each of the major people below.Rand has his emo moments practically non-stop; I was reminded of Sazed in the last two books of Mistborn trilogy: he was in exactly the same mood most of the time. Rand's last development in the book came up completely out of blue and without any good reason or explanation. He has his moments, though.If you heard anything at all about the series and Sanderson's writing, you know that he completely missed writing the most interesting character in books 3-11: Mat. Basically Jordan's Mat used to be a lovable rogue, but Sanderson's Mat is a foul-mouthed rude. The less is said about him, the better.I am happy to say that Perrin felt exactly the same as before. The guy had his last exciting moment in book 4 before Faile firmly wrapped him around her finger: he cannot have two thoughts without one of them being about his wife anymore. Sanderson's Perrin is as boring as Jordan's, but this is really not his fault.Nynaeve became interesting when she decided to become useful. She does not have a lot of screen time, but she still keeps pulling her braid as usual. I really cannot say anything bad about her.Egwene spends first half of the book pretending to be a character from a BDSM themed book (the one with heavy spanking); she practically enjoys it. She started being fairly close to Jordan's vision; I feel as her plot-line developed, she became more and more distant from that vision. She also became quite hypocritical by the end, but I suspect it comes with having a lot of power. The majority of the book was spent with two Aes Sedai fractions: rebel and the White Tower which means we get to see a lot of Egwene. I was never a big fan of petty intrigues by obnoxious magic users who do not know the meaning of humility (there are only two exceptions for this), so this is one of the influencing factors the book did not get a higher rating from me.A couple of more notes on the characters: Elaida used to be a fairly complex character, but she became a psychotic while Tuon is a lovesick puppy all of a sudden. I also need to mention one of the biggest reasons I like the series was the sense of wonder when I read it: whether some ruins of the ancient forgotten cities, giant statues built in times forgotten, uncovered relics serving unknown purposes, some magic constructs - something was always there to stimulate my imagination. Even in the slowest book of the series - Crossroads of Twilight - one of the towns visited by Perrin impressed the hell out of me with its creepiness. Well, this sense of wonder is completely gone from the first Sanderson's book. I can literally feel him rushing to reach the end of the series and completely ignoring such trivialities along the way.I need to be very generic in this part of the review to avoid very big spoilers as I am about to talk about some of the plot resolutions. Some of them felt forced and way too simplistic after the monumental buildup. I am talking about the whole Verin help and the confrontation with one of the Forsaken. I could go on and on, but I cannot be more specific.The first part of the book was slow - slower than the last Jordan's book. In the second part the pace picked up considerably and different subplot resolutions kept piling on the top of each other.Do you expect a typical summer blockbuster movie: a lot of huge explosions, fast-moving plot and flat characters? You got it here. Do you want continue enjoying the world full of wonders at a leisurely pace, or interesting cases of character developments? Look somewhere else. Even with all the problems I mention the book is good enough to warrant 3.5 stars; the widespread opinion is that the last two books are improvement of this one, so I am eagerly await to continue with the series. This review is a copy/paste of my BookLikes one: http://gene.booklikes.com/post/832916...-"}, {"userName": "Jon", "userReviewDate": "May 30, 2009", "userURL": "http://www.goodreads.com/user/show/899665-jon", "userReview": "4 stars"}, {"userName": "Jonathan Terrington", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/6313408-jonathan-terrington", "userReview": "This twelfth volume of The Wheel of Time is one of the most famous of recent times. Simply because it was, at the time it was promised, expected to be the final volume of the (then) ongoing series. It was also the first volume written by Brandon Sanderson (then known simply for Mistborn: The Final Empire) with the aid of many, many notes left by Robert Jordan. When I picked up The Eye of the World three or so years ago I knew that this twelfth volume of The Wheel of Time (due at the end of that year) was by a different author. I had no inkling of how I should feel about that as on the whole I dislike novels by other authors. Yet a friend had recommended the series strongly to me so I decided to read it and I personally very much enjoyed the story all the way up to this twelfth volume. Then when I read The Gathering Storm I was impressed by how skilfully put together the story was and consider it to be one of the finest in the entire series.Brandon Sanderson, as an author, has several strengths which combat Jordan's weaknesses nicely in this novel. One friend recently posed that there are two types of writers. There are those who are natural storytellers, more concerned with the plot ideas and details. Then there are the technicians, those who focus more on prose and literary qualities over stories. Now, they stated, most authors are combinations of both by nature, yet they seem to have one aspect more strongly over the other. I would say that, while Sanderson is a writer with ideas and natural storytelling ability, that he is a stronger technical writer than Jordan.When I say that Sanderson is a stronger technical writer I'd like to consider it from this perspective. Do you believe, if their roles were reversed, that Jordan would be able to as effectively write Sanderson's stories? I personally theorise that Jordan would find it more difficult to adapt to Sanderson's style. Brandon Sanderson in this novel has done something that is ridiculously near impossible in copying Jordan's style and telling the story as Jordan wanted (more or less). Yes, there are flaws every so often when as a reader you realise that an expression or idea dropped by Sanderson does not quite fit into the logical confines of Robert Jordan's world yet for the most part he does a perfect job of capturing Jordan's writing style and the voices of the characters he fills this world with. If you disagree try writing a short story in the style of your favourite author and you will see how hard it can be to emulate writing.In calling Sanderson a stronger technical writer I would also like to point out that Sanderson typically uses a less 'wordy' style than Jordan. That is not to say that Sanderson is not lengthy when he writes, indeed some of his sentences occasionally prove a touch awkward and he himself readily admits that he is not the greatest author of all time. However, that said Sanderson has an economy of language that works, it seems to me that he understands his limits and the theories of writing to a strong degree. On the other hand I feel that Jordan at times writes in a style that is overly long and above what he should aim for. I personal feel that Sanderson's sense of economy adds pace and energy to this novel in addition to the strength of Jordan's worldbuilding. I also felt that Sanderson added degrees of humour and warmth which I haven't felt from the other books in the series. Now, I do not intend this to be a sign of disrespect for Robert Jordan. Indeed I think it would have been great if he had been able to finish the story himself. Yet Sanderson has clearly added something to this book that, for good or for bad, makes it a better and stronger story."}, {"userName": "Maria Dimitrova", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/15922517-maria-dimitrova", "userReview": "[Bryne told him, right in the face, that he is an idiot, something I've been screaming at the books for quite some time now! (hide spoiler)]"}, {"userName": "Manveer", "userReviewDate": "Nov 12, 2016", "userURL": "http://www.goodreads.com/user/show/19294597-manveer", "userReview": "Sanderson love <3Brilliant book. Fast paced, lots of shit happening. Couldn't spot any differences in the writing style initially, but signs were there.The beginning of the end!"}, {"userName": "Brian", "userReviewDate": "Oct 28, 2009", "userURL": "http://www.goodreads.com/user/show/1229285-brian", "userReview": "Dear Brandon Sanderson:I started reading this series around the time the 3rd book came out and I loved them to death. My copies of the first few books in the series have been read and read so many times that they fell apart years ago.As the series continued on, adding more and more characters, and becoming more and more cumbersome, I got more and more disillusioned with it and the overall grand vision. My complaints about the series seemed to increase with each passing book, ultimately hoping that Mr. Jordan would stop wasting so much time on tertiary characters and just tell the story. But even amongst my complaints, I kept on reading, hoping to see a glimmer somewhere of the thing that appealed to me from the beginning. Book after book I was disappointed, and yet stubbornly kept reading them, just to see the end to the story that I had invested so much time into.Knife of Dreams had a faint glimmer of hope, but this book is different. And it's not a glimmer anymore, it's there in full and complete vision, better than I could possibly have imagined. Every complaint I had about previous books is non existent in this book.So I thank you Mr. Sanderson, for restoring my faith and giving me renewed hope in the ultimate climax of this story. Your work here is stunning and quite honestly a revelation to me. I'll be purchasing the rest of your books in the near future to say the least.Thank you very much,Brian"}, {"userName": "Eon ♒Windrunner♒  ", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/3481302-eon-windrunner", "userReview": "[-\tHey Masema! So long, and thanks for all the fish!-\tRand finally meets Tuan-\tSeanchan attack the White Tower.-\tCadsuane spanks a Forsaken. Literally. Also, she gets exiled by Rand.-\tEgwene puts in a solid effort for star of this book. \"A woman in white stood atop the rubble a short distance away, a massive halo of power surrounding her, her arm outstretched toward the fleeing soldiers, her eyes intense. The woman stood like vengeance itself, the power of saidar like a storm around her. The very air seemed alight, and her brown hair blew from the wind of the open gap in the wall beside them. -\tVERIN. Wow. -\tEgwene gets rid of the Black Ajah in the Rebel camp.-\tTerminator Rand goes all out TERMINATOR.-\tRand sees the light, two become one, Terminator Rand is no more and Rand 3.0 arrives.NEXT BOOK PLEASE! (hide spoiler)]"}, {"userName": "Andrew", "userReviewDate": "Oct 18, 2010", "userURL": "http://www.goodreads.com/user/show/1658847-andrew", "userReview": "Superior to the last half-dozen Jordan books, Sanderson does The Wheel of Time better than its original author.Sanderson puts in so many things that Jordan alluded to for effect but never satisfactorily depicted: Aes Sedai politics, characters' scheming and ploys, Rand recalling all the women he killed.Characters reminisce about their past and other characters Jordan neglected, and refer to how they have changed; their emotions are more real and tangible, and demonstrated through actions. Egwene's struggle to unite the White Tower was actually involving; Rand's fury at his loss of freedom becomes disturbing and yet touching; Ishamael spells out why he went over to the Dark One, and it makes sense. One of the ex-second-tier characters reveals a big secret and gives context to Jordan's inept portrayal of the squabbling and ineffectual Darkfriends.Sanderson is a more diligent author, going back to refer to places and events that Jordan used and discarded. No doubt Sanderson is working for the legitimacy of his volume, but the added continuity brings out the epic nature of the series. In the more recent Wheel of Time books, Jordan lapsed into pointless politicking disconnected from earlier volumes. The fantasy aspect fell away, and there was no sense of progression towards an ending; the story was becoming a soap opera of endless one-off tasks.A couple of Mat chapters deserve special mention: here Sanderson incorporates humour and horror that touched me far more than thousands of Robert Jordan's pages.I don't know whether Jordan intended the direction Sanderson aims the series in raising the philosophical implications of prophecy, reincarnation and fate, but I'm really enjoying it.The book still is slow, but by Wheel of Time standards, a lot happens and does so much more convincingly. If you are a fan of the series, and have stuck with it this far, you're in for a treat."}, {"userName": "Phrynne", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Book number twelve in the series and I really think I liked it the best so far. What's not to like when my favourite characters are featured so much. Rand of course has been a favourite from the beginning but now I also find Mat to be interesting and very entertaining. Even Egwane redeems herself in this book and has some of the most exciting scenes all to herself. An awful lot happens in this particular volume and the story really feels as though it is progressing towards its ending. Brandon Sanderson's writing is easier to read than Robert Jordan's was in the earlier books and the pace overall seems better. Oh and Sanderson also knows how to finish a book with a brilliant ending. Go Rand!!! So only two massive tomes to go and I will have finished this excellent series. I think I must read them slowly as I will miss them when they are done."}, {"userName": "Nikola Pavlovic", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/52813923-nikola-pavlovic", "userReview": "Ohoho ha ha ha Dok nekome ne smrkne drugume ne svane. Meni je iskreno svanulo od kada ovaj serijal citam iz pera Brendona Sandersona. Hvala Dzordanu na idejama, mada ne znam ni sam koliki je procenat kljucnih stvari u ovom delu Tocka Vremena zaostavstina samog Roberta Dzordana. Info koji mi svi imamo jeste da je Dzordan na samrtnickoj postelji diktirao svojoj zeni sta sve treba da se odigra a ona je nakon njegove smrti nasla nekoga da to pretoci u roman/romane. A opet i da su sve ideje 100% njegove, Dzordanove, Sandersonova realizacija istih dize ovaj serijal u sam vrh epske fantastike. Stoga imalo je smisla muciti se kroz hiljade i hiljde strane koje sam do sada morao da procitam, dati desetom delu dve zvezdice i trpeti krvave Ais Sedai samo da bi se doslo do ovog velikog finala koje je podeljeno u tri toma. Ovaj prvi svakako zasluzuje pet zvezdica, prvih pet zvezdica za neku knjigu iz ovog serijala."}, {"userName": "Ashley", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/1343864-ashley", "userReview": "I kind of don't even know where to begin with this review. I've started half a dozen paragraphs while sitting here, and then deleted them all. Like, who wants to be the jerk who thinks one of their favorite authors took up another author's life's work and then did it better? But . . . UGH, I do think that! I do. I don't think it's any secret that I've had issues pretty much the whole way through the first eleven books of this series. But I've also enjoyed myself, particularly during books two through five, after Jordan stopped imitating Lord of the Rings and before he stopped moving his plot along in favor of endless details that didn't matter. But also, the whole way through, I've never really gotten it. For me, Jordan's writing was interesting in a sort of academic way, but I never felt it. (Except for annoyance. I felt that a bunch.) The characters were always at a remove for me, and they were always doing really dumb stuff and behaving in ways that seemed not great, and it was hard for me to distinguish between authorial intent with that stuff, and whether Jordan just wasn't pulling off what he wanted to pull off. Like, are these women characters all meant to be so belligerent and shrewish? Or is that something that just happened and we're supposed to like them and think they're awesome leaders? I could never be 100% sure. It just never clicked for me. But a hundred pages in to this book, I was like, oh! Okay. This is what other people must have been feeling this whole time. I feel like I finally get why so many people love the Wheel of Time. It's like Sanderson took all of the awesomeness of Jordan's characters and his world and finally wrote it in a way that I could appreciate it. I mean, like, there was actual plot movement! And character development! And people being smart and doing awesome things! Except Rand, who was suuuuuch an a-hole the whole time, but at least that was on purpose.Okay, but in all seriousness, I don't think anybody but people involved in the making of the book will ever know how much of this was Sanderson and how much was Jordan, all I know is that I really, really liked this book. Things that have been bothering me for so long were fixed or acknowledged or reframed. And Egwene has always been my favorite character, but here for the first time she gets to be the most awesome person, and also for the first time I found Aes Sedai stories interesting. Sanderson inherited a lot of plotlines (and problems) that needed to be tied up, and I think he handled all of them pretty well. And almost the whole time, it felt like I was reading WOT, and you could tell he was making a conscious decision to write like Jordan. (There was the occasional phrase that felt very Sandersonesque, but I didn't mind. There were A LOT of words in this book.) If Rand's storyline had ended any differently, this would be a different review, but finally, AT LONG LAST, Rand is realizing he's been doing this Dragon Reborn thing all wrong and that he has been a terrible leader. I would have appreciated less frustration leading up to it, but at least we got there in the end.Super excited to read the last two books.[4.5 stars]"}, {"userName": "Kerry *Soulcaster*", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/9274536-kerry-soulcaster", "userReview": "Brandon Sanderson was the perfect choice for finishing this epic series.First read November 2009Latest read December 2016"}, {"userName": "Lori", "userReviewDate": "Nov 28, 2009", "userURL": "http://www.goodreads.com/user/show/744602-lori", "userReview": "WARNING: THERE ARE MAJOR SPOILERS IN THE COMMENTS SO SKIP IF YOU HAVEN\"T READ THE BOOK!!!!!I said I wasn't interested. I said I wouldn't bother reading this until the whole series was done. But with all the great reviews, and also having really liked Sanderson's other work, I went back on my word as soon as I saw this at Costco! On top of that, I'm even ignoring some books I've been dying to read that I have on hand, notably Kingsolver's new one. I'm such a liar!Well, I've finished. I busted my ankle so since I was flat on my back I was able to have quite the marathon in this world.I am surprised how much I liked it, and alot more than the last books Jordan actually wrote! I felt that we are FINALLY gathering towards a conclusion, and instead of bringing yet more minor and extraneous players into the mix, we now focused only on the more major characters. In the previous books, I couldn't remember who half the characters were, but for this one, even with the looooooong break I needed no reminders at all. Even with my senioritis! The book was far more focused and back to concentrating on things that are essential. And the wonderful world that Jordan created but misused after the first few books is back!For all you action buffs who love battles, that is lacking here. There's lots more preparation for military action, but the real battles here are psychological for both Egwene, trapped in the White Tower, and for Rand himself. Finally, we get back in Rand's mind, and for the hero of the story, Jordan was doing his best to make us hate him. Well, no longer. He captures our sympathy, so much so that we may dislike what has happened to his character but we don't blame him at all, in fact we now understand and are very sad. BUT BUT BUT there is actual development here! Which I can't say because that would be a spoiler.There are not many books that would be so utterly engrossing that would make the hours fly while I was forced into utter inactivity on a couch with my ankle lifted all day long. This book made what would have been a hair-pulling experience into an utterly wonderful weekend."}, {"userName": "Sarah", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "Like a lot of fans of this series I was a little nervous going into The Gathering Storm because I wasn't sure if Brandon Sanderson would be able to capture the feel of the Wheel of Time series in quite the way Robert Jordan has created it. I'd never actually read a book by Brandon Sanderson before (although I'll certainly be buying some of them when I've finished this series!) so it wasn't a reflection on him as an author, just fears about a well loved series having a change in author. Of course I'm glad that Robert Jordan allowed someone else access to his notes so that the series wasn't left open ended but the nerves were definitely real when I picked up this book.Luckily that worry turned out to be unneeded though because this ended up being one of my favourite books in the series. Yes there are differences in the writing style between the two authors but overall I think the changes Brandon Sanderson made to some of the characters (and certainly the increased pacing of the story!) were for the better. The things that have irritated me more and more in the most recent books were markedly absent here and I enjoyed the book so much more because of that. It takes us back to the good old days when there was always something interesting happening, no more boring filler chapters and three thousand side characters being added in every instalment that had pretty much no relevant role in the overall storyline.The two characters who are really the main focus of The Gathering Storm are Rand and Egwene. Rand is on a difficult path and his storyline has been getting darker and darker as he tries to mold himself into someone who is capable of putting the greater good above the lives of individuals. It's completely against Rand's nature to allow people he considers under his protection, especially women, to get hurt in battle but he has come to the realisation that they won't be able to win at Tarmon Gai'don without casualties. It's quite sad to see Rand fighting against his instincts and also struggling with his madness in this book but his storyline is definitely interesting and I think he made a key realisation towards the end of the book that is going to make things a little easier for him going forwards.Egwene really shines in this book, she really started to show her strength in the previous instalment and that just continues here. She has grown so much since she was raised as the Amyrlin Seat of the rebel Aes Sedai and her wisdom and cunning shine through in this book. There is no doubt in my mind that she is going to make a fantastic Amyrlin and I can't wait to watch her bring all the ajas back together again under the white tower where they all belong. It's going to be an exciting time for the Aes Sedai and I'm particularly interested to see how they deal with the Seanchan after the betrayal in this book.It's obvious that various plot threads are being woven closer together now that the end of the series is approaching. I can't actually believe there are only two books left but I am more excited about this series than ever and I can't wait to see how each of the character's stories end.__________________________Buddy read with"}, {"userName": "Rob", "userReviewDate": "Jul 06, 2012", "userURL": "http://www.goodreads.com/user/show/10743961-rob", "userReview": "Executive Summary: By comparison to the previous books, this book moves at breakneck speed. It remains one of my favorite of the series, but isn't quite as good as I remember it being. I do think that Brandon Sanderson does an excellent job and picking up where Mr. Jordan left off however.Audiobook: Another fantastic performance by both Michael Kramer and Kate Reading. They really bring these characters to life, and I can't see myself ever picking up my paperback copies again when I could listen to the audio instead.\nFull Review\nWhen I finally got into the Wheel of Time, this book had just come out. By the time I caught up, it was out in paperback but Towers of Midnight hadn't been released yet. So this is where I had to join the fans in waiting for an end. Hardly a comparison to fans who have been reading this series since the beginning.This is the book that turned me into a rabid Brandon Sanderson fan, and I proceeded to consume nearly every book he had written to this point. I feel that Mr. Jordan had finally returned to form with Knife of Dreams, so it's not much of a surprise that this book moves at a much faster pace than some of the previous ones.For me the clear star of the book is Egwene. At first glance it might be easy to give Mr. Sanderson credit for making her into an awesome character, but in my opinion this book is simply the fulfillment of path Mr. Jordan setup in the last few novels of the series. Her chapters were always by far the most interesting parts, even over my those of my favorite character Mat's chapters.I remember reading a lot of criticism from fans that Mr. Sanderson didn't do a good job with Mat, and that he changed a lot from the way Mr. Jordan wrote him. During my first reading of the series I didn't agree. After a second reading however, I am inclined to agree somewhat. Mat did feel a bit off. I almost want to say a bit \"goofy\" compared to the previous few books. However, I still enjoyed his parts quite a lot, and I'm definitely looking forward to what I know is yet to come for him in the final two books.I don't remember being so annoyed at Rand this late in the series as I was during this reread. I think that's part of why I didn't enjoy this book quite as much as I remember. I don't put that on Mr. Sanderson however. Much like Perrin (who annoyed me even more even though his part is quite small), Rand is at a point in his story to be very unlikable. Mr. Sanderson must write the characters forward to their conclusion in a way that follows with everything that's going on.Both are dealing with a lot of baggage. I think I just have less tolerance for it than I did during my first read. Especially after how great Egwene (and to a lesser degree Nynaeve's parts) are. Overall things are finally moving towards a resolution, and even though I know what's coming I can't wait to read it all again."}, {"userName": "Roberta Jayne", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/21250003-roberta-jayne", "userReview": "Amazing! There are too many great things to keep track of and mention in reviews about WoT books at this point but, in general, all you have to really know is that it was amazing. It definitely felt weird at the beginning to have Brandon Sanderson writing. Yes, I could tell! The 30 page prologue gave it away. Oh how I do not miss Jordan's never-ending prologues.Scary Rand is brilliant. I loved Rand in this installment, damn. But I'm glad that despite the 'heaviness' and 'finality' of it all that the humour in these books is still sharp and witty and fantastic. Really glad that none of that was lost when Sanderson took over. And I've GOT to mention Egwene. EGWENE! Egwene slowly taking over The White Tower from the inside was one of the most engaging things to read DAMN. Can't wait for everything that's been predicted and promised and foreshadowed to happen in the final final books."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Dec 31, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "Okay, I've got to put everything else aside till I read this...it's nearly 800 pages and other people at the library are waiting for me to finish it.Well at least they finally killed *** ******. Yeah, I won't put in a spoiler, not that it would matter that much, but then Sanderson has continued Jordan's established pattern of actually tying up few plot points per volume. That is I suppose why it will (he says) take 2 more of these gargantuan tomes to complete this story. Okay (I seem to say that a lot), once I got into this my first reaction to the rambling narration was I just don't care anymore. But in a way I do care. The farther I got into this \"thing\" the more the overpowering feeling of sadness at what could have been overwhelmed me. I can't pick up one of these books without getting angry and frustrated. As has been pointed out before, this was originally planned as a seven (that's 7) book series...somehow it has bloated up to 12 volumes with 2 more to come. Let me say that the first 6 volumes of this series (by Robert Jordan) are some of the best writing I have ever come in contact with. This stood to be (I believe) one of the great fantasy series (and possibly great fiction works) of all time. But, for some reason (and all I can do is speculate what it was as the author did not tell us) it was turned into a rambling soap opera. I live in hope that some one in a future generation will take the entire 14 volumes (plus the prequel New Spring) and turn them over to a good editor.I know some of Mr. Jordan's fans are not happy with me here, I have seen the \"5 star ratings\" and believe me when I say I'm happy for you. I know that there are those of you who love the repetitive conversations, the accounts of the same events from several different people, the endless and pointless war of the sexes. The plot point where Nynaeve runs to Cadsuane probably thrilled you. And you probably \"felt\" that \"the one she sent\" to talk to Rand, and Rand's reaction are \"very important\". Okay... good. It took long enough to get there and what did we accomplish? Well, Rand ******* again.Actually I really mean it, I'm glad you are enjoying this.I'm not. I believe I've made my opinion of this volume and the series in general plain here. I know that a lot of you will disagree with me and some will point out that the books sell in huge numbers.The same can be said of Harlequin Romances.I have always wondered if the fact that the books were all \"best sellers\" may not have been their downfall. I always wondered (wonder) if \"somebody\" might not have said to Mr. Jordan, \"hey this thing is making tons of money, why wind it up at seven volumes?\" Of course as I said, no one can be sure of something like that. All we know is that like Frankenstein's monster this story just keeps stumbling along.I don't think I'll take the next two out of the library as soon as they're published. If I finish the \"series\" I may just wait till the last volume is finished and read it then. Maybe I'll even take time to reread the first volumes a second time once the thing is finished. The first ones (first 5 or 6) were really good even excellent. As I said, what might have been."}, {"userName": "Jeanne", "userReviewDate": "Dec 08, 2009", "userURL": "http://www.goodreads.com/user/show/1042102-jeanne", "userReview": "To be real honest, I actually think this is the best book of the series so far. Brandon Sanderson is a much better writer than Robert Jordan, and mind you I read all 11 books by Jordan so he's not THAT shabby! Harriet (Robert jordan's widow) picked the PERFECT writer to finish the series from Jordan's notes. He grew up with those books and is a huge fan boy of the series so he is ever so mindful to stay within the parameters of the world and the previous books in the series. He's paid a great deal of attention to be factually correct and to write more in Jordan's style than his own. But an alert reader who has also read Sanderson's work will see his style peek through from time to time.I really like the whole series but I'm overly fond of 1,000 plus page books. It's a huge commitment to take this series on now, but one I still feel is worth the commitment. I think it will always be known as one of the great epic fantasies of all time.I'll add more once I've finished!"}, {"userName": "Emerson", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/38007906-emerson", "userReview": "\"Two hands. One to destroy, the other to save. Which had he lost?\"Excelente. Estou muito impressionado com a qualidade desse livro. A narrativa sutil do Brandon Sanderson deu a acelerada que a série precisava. Não senti mudanças na personalidade dos personagens, e isso me agradou muito, era algo que eu receava...Muitos momentos tensos e agoniantes me fizeram ter diferentes sensações, da alegria a tristeza...Simplesmente fantástico.\"At the end of time, when the many become one, the last storm shall gather its angry winds to destroy a land already dying. And at its center,the blind man shall stand upon his own grave. There he shall see again, and weep for what has been wrought.\""}, {"userName": "JDR", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/24299015-jdr", "userReview": "The fact that I am rewriting this review is a testament to the greatness that the Wheel of Time can present to me.Obviously, you can see the rating, but you may not know that those 5-star ratings are rarer than you can imagine for me to give. Once GR gives the ability to half-stars, my ratings are gonna grow that much more rarer. But anyways, why do I love the Gathering Storm? You will definitely find out. Sanderson's Writing.  I do not know any person who has actually read this series who couldn't immediately tell that this was a different individual writing the story. In a way, it was a good thing that out of all the books that Sanderson had to jump in and write, it would be the climax. Because Sanderson couldn't have built the intricate world that RJ had created, at least not then. RJ crafted the world and something that Sanderson excels at is pacing because those battles scenes and confrontations were heart-pumping. Now that we had a developed world, we could go ahead and make it explode.  2. Gawyn.  I do not need to describe the stupidity and just WTF sort of crap that he makes you react to when I can just show you evidence like this:  Lelaine wasn't beautiful, but she was pretty, particularly when she smiled. Slender and graceful, without a speck of gray in her dark hair, an almond face with full lips. She looked up at him with eyes that were far too comely to belong to a woman of her craftiness. And she seemed to know. She understood that she was just attractive enough to draw attention, but not stunning enough to make men wary. She was a woman of the most dangerous type. One who felt real, who made men think they might be able to hold her attention. She wasn't pretty like Egwene, who made you want to spend time with her. This woman's smile made you want to count the knives on your belt and in your boot, just to make sure none of them had found their way into your back while you were distracted.  3. Perrin? Perrin who?  4. Controversial Mat.  Why is there so much controversy with Mat? Is it because he doesn't really sound like he is supposed? You know, I laughed a lot with this Mat and everything. We had action scenes, typical aes sedai confrontations, some Aludra hints. Yet, the tie-breaker is that Mat lacked the charm. He was too serious and that's why its hard to be fond of him in the same way. Especially when he breaks the record for longest \"Women are so complicated, I don't get them\" speech. Now, let us get on to the real meat. Egwene and Rand, first with Egwene. She was the cause of the problems in the White Tower, she was the one who caused division between rebels and loyalists. She had taken Rand captive and beaten him. She was a disaster!  5. Egwene.  OMG THE FIRST REAL CONCLUSION TO A MAJOR STORYLINE!!! Itwas pretty epic seeing Egwene face off the Elaida and the Seanchan! Like really, what does a woman have to do to be Amyrlin Seat around here? Although if Elaida and Egwene were running during a presidential election, Egwene would obviously have the best campaign. \"Can't you see it?\" Egwene asked. \"Don't you feel the pain? The agony of watching the Tower crumble around you? Could any beating compare to that?\" Also, she says that to Silviarin, the red ajah Mistress of Novices who also becomes the Keeper of the Chronicles because a) she should be and b) Its a brilliant political move to reestablish bonds with the Red ajah. It was interesting to see the relationship between Silviarin and Egwene progress, seeing each of them learn more about the other until eventually they garner a mutual respect for one another. Silviarin is the only one who stands up for Egwene and against Elaida! On the subject of an individual's character, the Siuan x Gareth ship has sailed, Bon Voyage! The one quote that i did want to mention was the one where Siuan mentions how Gareth will praise you with the same gratitude whether you are a servant or a soldier. That made me think on the Harry Potter quote of how you can tell a person's character by the way he treats his inferiors and he treats them with respect and honest gratitude. Go Bryne! Also, indirectly Racist Egwene quote: \"Siuan was deposed by the bare minimum number of Sitter required,\" Egwene said. \"One of them was Black, making her vote invalid. Damn.Now, the Battle of the White Tower aka \"THE MOST EPIC BATTLE SINCE FALME LIKE WHAT THE SHIT IS THIS SLICE OF GOODNESS!\" which had been following Verin's literally mimd-blowing revelation that she was Black...Ajah. I knew that but I didn't expect her to also help Egwene and give her the best solution to the problem of \"Who is Black Ajah? Is it you or is it you? IDK!\" Verin is the MVP.Then, the Battle scene. I swear if this isn't the concrete example of why world-building is so important, its like I was right there. In my mind, it was a mix of itself and the Two Towers LoTR (on a completely different note, the four core LoTR arrive in the mail today for me! So excited!). I saw serpents flying in the sky attacking Aes Sedai and Egwene fighting back. Honestly, I was kinda of imagining Egwene in the same light as Daenarys from A Song of Ice and Fire, except the dragons. Just the most badass female character like woah!! BADASS WOMAN ARE COOL. \"That's what I am,\" Rand said. \"A story. A legend. To be told to children years from now, spoken of in whispers.\" He shook his head. \"Sometimes, you can't turn back. You have to keep pressing on. And sometimes, you know this climb is your last. \"You all claim that I have grown too hard, that I will inevitably shatter and break if I continue on. But you assume that there needs to be something left of me to continue on. That I need to climb back down the mountain once I've reached the top. \"That's the key, Nynaeve. I see it now. I will not live through this, and so I don't need to worry about what might happen to me after the Last Battle. I don't need to hold back, don't need to salvage anything of this beaten up soul of mine. I know that I must die. Those who wish for me to be softer, willing to bend, are those who cannot accept what will happen to me.\" He looked down at Min again. Many times before, Nynaeve had seen affection in his eyes when he regarded her, but this time they were blank. Set in that same, emotionless face. \"We can find a way, Rand,\" Nynaeve said. \"Surely there is a way to win but also let you live.\" \"No,\" he growled softly. \"Do not tempt me down that path again. It only leads to pain, Nynaeve. I ... I used to think about leaving something behind to help the world survive once I died, but that was a struggle to keep living. I can't indulge myself. I'll climb this bloody mountain and face the sun. You all will deal with what comes next. That is how it must be.\" She opened her mouth to object again, but he gave her a sharp glance. \"That is how it must be, Nynaeve.\"  6. Rand.  Rand is such a special character to me because he is the closest representation of the MC of the epic fantasy that I am writing. RJ and I are really alile on that front when it comes to the struggles thay a person in that position would deal with and how they would respond.This Rand is not necessarily Evil but he is umbelievably cold. I just read the first chapter of freakin Zen Rand, but at this point, Rand was so dark that he was actually terrifying. He was straying from the hero's path so hard.The way he went about in trying to destroy Graendal was unbelievable. He was literally about to nuclear bomb them, I mean that is what Balefire is pretty much! Except worse because it erases them completely from existence. The climax with Tam and his own inner struggle was what elavated this from a 4star to a 5-star. The entirety if Chapter 47-50. I wish i could just copy the entire chapters onto here, but there just isn't enough space because honestly, I can't just quote a specific lart because ALL of it is gold and all of it adds on top of what came before it. Chapter 50 was the best shit from Rand I have seen since the battle in the sky in the Great Hunt. This was however, a very philosophical climax.Also, I LOVE how Lews Therin has not been confirmed yet. To me, he is a metaphor at this point and you can take the statement where Rand says he wont hear his voice again in many directions.In conclusion, bravo everything. But especially Rand. He is the reason why I love this series as much as I do and thank Sanderson for his beautiful execution and RJ for crafting every piece of the world and characters.+ Rand Al'Thor+ Egwne Al'Veara+ Battle of the White Tower+ Philosophical ClimaxBUY/SKIP/RENT: BUYFinal Score: 9.0 / 10Favorite Books from #1 to last The Gathering StormThe Great Hunt The Fires of Heaven The Eye of the WorldKnife of DreamsThe Shadow RisingThe Path of DaggersNew SpringA Crown of SwordsLord of ChaosThe Dragon RebornWinter's HeartCrossroads of Twilight"}, {"userName": "Shobhit Sharad", "userReviewDate": "Jul 24, 2016", "userURL": "http://www.goodreads.com/user/show/34286188-shobhit-sharad", "userReview": "\"The Wheel weaves as the Wheel wills.\"And it wove the best it could for this series. Brandon Sanderson writing the last few books is a definite gain for the Wheel of Time. Though this world belongs to Jordan, it needed Sanderson, for the pace of the story, for the added humor which is not just funny to the Aiel. Because by now, I really know what Seanchan armour looks like, I know what Choeden Kal is, and I don't want to be reminded about the appearances of every fricking person. All of this was acceptable up to a point. But now that we are approaching the end of all things, I would like the stories to converge and conclude. And that did happen, thank you Mr. Sanderson.Though there was a slight change in the writing-style, it was much close to the way Mr. Jordan wrote. Rand was certainly pitiful, though there is yet hope for him. A plus point was, for me, the absence of Elayne. There was too much of her in the previous few books. Egwene, no doubt, the star of the book, won over my heart."}, {"userName": "Eric Allen", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/6229358-eric-allen", "userReview": "The Gathering StormBook 12 of the Wheel of timeBy Robert Jordan and Brandon SandersonA Wheel of Time Retrospective by Eric AllenIn 1990 Robert Jordan published The Eye of the World and changed my life forever. At that time the series was to be a trilogy. Ten books, a prequel of significant size, and a companion guide later he died with the story unfinished and three volumes of the series left to be written by another writer from extensive notes, partially written scenes and extensive dictations that he gave during the final weeks of his life. Honestly, I'm touched that he cared enough about his fans that he spent so much of his remaining time on this Earth making sure that the groundwork was firmly set for another author to take the helm and finish the series. The writer chosen to complete the final volumes of The Wheel of Time was Brandon Sanderson. At the beginning, Tor wanted him to simply slap together an ending and have it out by the end of the year. Sanderson, a HUGE and longtime fan of the series, and Jordan's widow Harriet MacDougal, had to practically fight to get these final volumes finished in a way that Jordan himself would be proud of. But, luckily, Tor did eventually come around and see that their way was for the best. As he began writing, Sanderson found that the book was going to be nearly three times the length of the longest book in the series to date, and the fans were beginning to get restless, five years having passed since  Knife of Dreams, the previous volume, had been released. So, Sanderson and Harriet set to work splitting the final volume into three. This is all explained in the forward by Sanderson in far better detail than I'm giving here if you care to read it. This meant that a new volume to the series could be published almost immediately to sate the fans whilst the rest of the story was worked out and written. The fruit of all that dealing, cutting, splitting, and reworking of the plot was The Gathering Storm.The Wheel of Time is a series that, for me, started out as the best thing I’d ever read before in my life, but by the time it got to the sixth volume had grown overly long, somewhat boring, and stagnant. The last three volumes to be released in the series have made up for the several before them, in my opinion, by finally bringing some much needed resolution and action back to the series. Looking back on the story, those slow and boring books were needed parts of the whole, it just so happened that all of the boring happened to occur at the same time in the storyline and made for some very dull books in the middle.Jordan pulled the series out of it’s rut with Knife of Dreams, the final volume he completed before his death, and promised that the end was nigh, with a single volume left to be written. Reading his blog posts about this final volume it was clear that he knew he was running out of time, and he wanted desperately to get the series finished in one final go before he died, but, unfortunately he was unable to. The world lost a brilliant storyteller, and, by many accounts, a great man on that day. As the storm of the Last Battle gathers over the world, Rand finds himself desperate to make peace with the Seanchan, and bring peace and stability back to the land of Arad Doman, where he believes one of the Forsaken has taken up residence, sowing chaos and destruction. Meanwhile, captive by the usurper Amyrlin Seat Elaida within the White Tower, Egwene works to bring the crumbling order of the Aes Sedai back together so that they might stand with the Dragon Reborn at the Last Battle. The story mostly revolves around these two characters as they struggle with the destinies placed upon them, being dragged lower and lower into the depths of darkness and despair.Through constant beatings, a refusal to bend under Elaida, and wisdom far beyond her years Egwene manages to gain the respect of powerful Aes Sedai within the White Tower, working to mend the rifts between women who should be working together rather than showing open hostility toward one another. Slowly, and painstakingly she works to repair the damage that the Forsaken and the Black Ajah have done to the Tower, finally coming to realize what it truly means to be the Amyrlin Seat and an Aes Sedai of the White Tower.Rand has been broken, and beaten, and bloodied, and tortured, and maimed. He is haunted by the voice of a dead madman, and feels the weight of his duty as the savior of the world pressing down hard upon him. He has come to realize that he need not survive the Last Battle so long as he wins it, and has put everything he has into it. He sets aside love, honor and decency, willing to do anything it takes just to win, sinking deeper and deeper into darkness and insanity, using himself up with no thought of leaving anything behind after all is said and done. Cadsuane desperately works to teach him how to laugh again, but her efforts seem completely ineffective. When finally faced with what he has become, Rand runs to the peak of Dragonmount to find who he truly is and the reasons why he fights.The good? As Wheel of Time books go, this is one of the best, and as a follow up to Knife of Dreams, it was all WoT fans could have asked for and more. It has everything we loved about the first half of the series in it, with very little of the bad from the middle volumes that gummed up the works and slowed the plot to a crawl. I really enjoyed how the story narrowed down and focused on the struggles of these two characters. Some of the best books in the series have been the ones that focus on a smaller group of the characters rather than taking a broader view of the story. The way that they are both brought down as far as they can be brought and then finally find their redemption is very powerful. The character development is extremely good. You can really see how far these characters have come since the beginning of the series, and also, how much they are still the same. And it’s not just Rand and Egwene, other main characters that have been relegated to secondary roles in this book show how they’ve grown since the beginning as well. Nyneave, Siuan, Min, and many others to name a few.The scene at the end where Rand overcomes everything is probably one of the most beautiful moments in the entire series, especially with how long it’s been coming. Every book sees him lose a little more, be brought a little lower, be broken a little further. To have him finally overcome it all, and in such a powerful and beautifully written way was well worth the wait and many troubles that this book saw in finally making it to publication.The bad? Mat, my favorite character in the series, seemed a bit over the top and out of character. Oh, the parts with him were completely hilarious, I’ll give you that, but he wasn’t himself. He felt a bit off, like Sanderson was trying too hard to get his personality right and exaggerated his more notable traits a little too much. Thankfully this problem was mostly corrected in the next volume. And I do completely understand. This is not Brandon Sanderson’s book. He’s only finishing it. He was not the one that made these characters and he’s doing his best, and working very hard at it to make these books as good as they can possibly be.There are a lot of small errors that only the most avid of Wheel of Time fans will notice, details that are a bit off, characters not where they’re supposed to be, a few misspelled names, things of that nature. Though completely understandable under the circumstances, they’re still noticeable to anyone who has read the series as many times as I have.The ugly? Gawyn. To put it bluntly there are only two characters in this series that are bigger retards than he is, his sister and his mother. The amount of the story devoted to him and his stupidity was highly annoying to me. He’s been nothing but an oath-breaking, murdering tool that has shunned his duties, his family, his nation, and a hundred other things, to ride around on his horse and wave his sword around for attention so everyone around him knows how big his dick is. The only consolation is the constant ripping that Gareth Bryne does on him, never letting him forget that he’s broken his oaths, been a complete moron, and shunned his true duties for far too long. That Robert Jordan ever thought anyone could ever feel any sympathy for this idiot boggles the mind. You have this beautifully crafted, laid out, and written story with Rand and Egwene and through it all you keep getting interruptions with this jackass as if he thinks he’s important to the overall plot or something. He does do one or two important things in other books, I will give you that, but most of those are through stupidity that only made things worse for both sides, or things that easily could have been done by an unnamed bit player. In this book, he’s out of place, and breaks into the parts that I was really interested in far too often.Aviendha, one of my favorite characters in the series, keeps thinking to herself that she needs to be more like Elayne, my absolute least favorite character in the series. This was very hard to stomach. She’s better than that. She’s strong, stubborn and learns from every mistake that she makes. Elayne, on the other hand is weak, stupid, and hasn’t made a single millimeter of character development since the series began. To have Aviendha constantly thinking that she needs to be more like the character I typically skip any and all chapters about because the utter douchebaggery and stupidity of Elayne make my head hurt just trying to fathom seemed very wrong to me.After all of the rushing, the cutting, the rewriting, the splitting, and hasty editing, The Gathering Storm was still an extremely good book. In fact, I think that in the face of everything that stood in the way of this book's publication, it’s a miracle that it turned out half as well as it did. I loved this book. It has become my second favorite in the series right behind The Shadow Rising because of how well written and paced it is, and how beautifully sweet and long awaited the events at the end were. Though there are a few small errors that are perfectly understandable in the circumstances, this book is probably one of the best books I’ve ever read for Rand’s storyline alone. Brandon Sanderson has done an extremely good job at getting inside Robert Jordan’s head, and other than the few small things I mentioned, I couldn’t tell any difference in the tone or writing style between the two writers. I’m giving this book 5 stars. That the things I mentioned here were the only flaws that I could find in the entire book only speaks to how great a writer Brandon Sanderson is. That he was able to write something this good, and this beautiful with what he was given, while also writing a book of his own, and fighting to get enough time to write a book that Robert Jordan could be proud of is completely amazing to me. A few small errors can certainly be overlooked in the face of that. He deserves a perfect score for this book. He was given an impossible task and he’s exceeded all my expectations in the two out of three books that he’s completed and I eagerly await the final volume. He was definitely the right man for the job of completing Robert Jordan’s masterpiece. This is a book that I think Robert Jordan would smile on. Check out my other reviews."}, {"userName": "The Crimson Fucker", "userReviewDate": "Oct 31, 2009", "userURL": "http://www.goodreads.com/user/show/53674-the-crimson-fucker", "userReview": "Ok…. Here goes nothing:Let’s see this series been out for what? More than fucking 20 years now?? IDK I started to read it back in 2003... And this is fucking book #12!!!! That fat bearded bastard promised to finish the series in only one more book… but the leaches that are the publishers or IDK how the fucking book publishing industry works or nothing… but GOD DAMN! A retard like me can see that they water this shit down! Is book fucking 12! I know how the Seanchan helmets look like, I know what fucking Saidin and Saidar are!!! I know how the Domani women are all whores! I know how The Border Land Peoples are supposed to act! I know what Calindor is! I know all that fucking crap! God fucking damn it don’t spent half a fucking page explaining to me… I know.. Ahh but Alfonso its been so long since the last book came out they trying to refresh people’s memory! And make it easy for those who are just reading the last ones… FUCK YOU! FUCK YOU A FUCKING 1000 TIMES! I don’t wanna ruin any of the plot for anybody so I will not speak of anything plot related that annoy me, till in a few months… but I can however talk about the little things that annoyed me… mostly I think it was the bleak as hell fight scenes…. One thing I loved about Jordan was his fighting scenes… cold and controlled and yet you found yourself reading em like a freaking maniac… it was amazing… this guy just dropped form name after form name and called it a sword fight… I was dying to get done with it! I think at some point I may have mumbled something like “BOOOOOOOORINGGGGGG” also that town with the zombies was a little annoying… but whatever! It was kind of cool… a little desperate but entertaining to some point… the lack of epic battles! Dude! WTF! They don’t call it epic fantasy for nothing… give me something epic here! Something bigger that a few Novices bitching… but mostly it was how fucking ridiculous the re-explanations of things any person reading Book #12 is bound to know… you know when you listening to a radio show? You notice how the repeat the subject, the guest’s name, and all that bla bla bla that you already know? Well that’s cuz there is this rule about radio talk shows… you get a new audience every 15 minutes and you don’t want to feel lose and switch the station… that’s why the do that… this however is not a radio show is fucking book #12!!!!!! I felt like I was being treated like a retard… =( I want my money back! And those 6 years of my life too!!!"}], "description": "Now in development for TV!Since its debut in 1990, The Wheel of Time(R) by Robert Jordan has captivated millions of readers around the globe with its scope, originality, and compelling characters.The Wheel of Time turns and Ages come and go, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth returns again. In the Third Age, an Age of Prophecy, the World and Time themselves hang in the balance. What was, what will be, and what is, may yet fall under the Shadow.Tarmon Gai'don, the Last Battle, looms. And mankind is not ready.The final volume of the Wheel of Time, A Memory of Light,  was partially written by Robert Jordan before his untimely passing in 2007. Brandon Sanderson, New York Times bestselling author of the Mistborn books, and now Stormlight Archive, among others, was chosen by Jordan's editor--his wife, Harriet McDougal--to complete the final volume, later expanded to three books.In this epic novel, Robert Jordan's international bestselling series begins its dramatic conclusion. Rand al'Thor, the Dragon Reborn, struggles to unite a fractured network of kingdoms and alliances in preparation for the Last Battle. As he attempts to halt the Seanchan encroachment northward--wishing he could form at least a temporary truce with the invaders--his allies watch in terror the shadow that seems to be growing within the heart of the Dragon Reborn himself.Egwene al'Vere, the Amyrlin Seat of the rebel Aes Sedai, is a captive of the White Tower and subject to the whims of their tyrannical leader. As days tick toward the Seanchan attack she knows is imminent, Egwene works to hold together the disparate factions of Aes Sedai while providing leadership in the face of increasing uncertainty and despair. Her fight will prove the mettle of the Aes Sedai, and her conflict will decide the future of the White Tower--and possibly the world itself.TV series update: \"Sony will produce along with Red Eagle Entertainment and Radar Pictures. Rafe Judkins is attached to write and executive produce. Judkins previously worked on shows such as ABC's \"Agents of SHIELD,\" the Netflix series \"Hemlock Grove,\" and the NBC series \"Chuck.\" Red Eagle partners Rick Selvage and Larry Mondragon will executive produce along with Radar's Ted Field and Mike Weber. Darren Lemke will also executive produce, with Jordan's widow Harriet McDougal serving as consulting producer.\" --VarietyThe Wheel of Time(R)New Spring: The Novel#1 The Eye of the World#2 The Great Hunt#3 The Dragon Reborn#4 The Shadow Rising#5 The Fires of Heaven#6 Lord of Chaos#7 A Crown of Swords#8 The Path of Daggers#9 Winter's Heart#10 Crossroads of Twilight#11 Knife of DreamsBy Robert Jordan and Brandon Sanderson#12 The Gathering Storm#13 Towers of Midnight#14 A Memory of LightBy Robert Jordan and Teresa PattersonThe World of Robert Jordan's The Wheel of TimeBy Robert Jordan, Harriet McDougal, Alan Romanczuk, and Maria SimonsThe Wheel of Time CompanionBy Robert Jordan and Amy RomanczukPatterns of the Wheel: Coloring Art Based on Robert Jordan's The Wheel of Time", "title": "The Gathering Storm\n      \n          (The Wheel of Time #12)", "url": "http://www.goodreads.com/book/show/1166599.The_Gathering_Storm", "average": 4.35, "cover": "https://images.gr-assets.com/books/1442815923l/1166599.jpg", "reviews": 2769, "authors": [{"url": "https://www.goodreads.com/author/show/6252.Robert_Jordan", "name": "Robert Jordan"}, {"url": "https://www.goodreads.com/author/show/38550.Brandon_Sanderson", "name": "Brandon Sanderson"}], "type": ["Science Fiction Fantasy", "Fantasy", "Epic"], "outlinks": ["http://www.goodreads.com/book/show/1166599.The_Gathering_Storm", "http://www.goodreads.com/book/show/7141427-the-gathering-storm", "http://www.goodreads.com/book/show/8411648-the-gathering-storm", "http://www.goodreads.com/book/show/7303820-the-gathering-storm", "http://www.goodreads.com/book/show/6346420-the-gathering-storm", "http://www.goodreads.com/book/show/25895976-the-gathering-storm", "http://www.goodreads.com/book/show/12743267-the-gathering-storm", "http://www.goodreads.com/book/show/11203972-the-gathering-storm", "http://www.goodreads.com/book/show/228665.The_Eye_of_the_World", "http://www.goodreads.com/book/show/233649.The_Great_Hunt", "http://www.goodreads.com/book/show/34897.The_Dragon_Reborn", "http://www.goodreads.com/book/show/9539.The_Shadow_Rising", "http://www.goodreads.com/book/show/8253920-towers-of-midnight", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}