{"ratings": 1737, "userreviews": [{"userName": "Aditi", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/16069171-aditi", "userReview": "“Suffering is a gift. In it is hidden mercy.”  ----RumiTahmima Anam, an award-wining Bangladeshi author, has penned a soul touching and a highly poignant historical fiction surrounding a family torn between the after-effects of war, politics and family love in her book, The Good Muslim which is the second book in her Bangladesh series. This story opens with the daughter who goes into exile for seven long years to study medicine and to open up her own practice as a doctor, returning back to her hometown where her old mother is still waiting for her and her ex-soldier brother is vouching towards the narrow philosophy of his religion's preaching, thereby creating a gap stronger than their years of distance between the brother and the sister.Synopsis: In the dying days of a brutal civil war, Sohail Haque stumbles upon an abandoned building. Inside he finds a young woman whose story will haunt him for a lifetime to come. . . . Almost a decade later, Sohail's sister, Maya, returns home after a long absence to find her beloved brother transformed. While Maya has stuck to her revolutionary ideals, Sohail has shunned his old life to become a charismatic religious leader. And when Sohail decides to send his son to a madrasa, the conflict between brother and sister comes to a devastating climax. Set in Bangladesh at a time when religious fundamentalism is on the rise, The Good Muslim is an epic story about faith, family, and the long shadow of war. Maya has just returned back from the city after seven long years serving as a war doctor, only to find out that the war has changed so much in her family, despite of her brother's wife's death. Her mother has been waiting for her daughter for the past seven years is finally happy to have her daughter back. Whereas Sohail, Maya's brother has changed a lot, as he has become more of a religious man and finds almost no time for his little son, Zaid. Unfortunately Maya fails to reconnect with her ex-soldier brother who has found solace in the fundamentals of Islam, on other hand, Maya develops a bond of friendship with the little child who is hungry for a bit of love for his parents or from his elders. Maya also reconnects with her brother's long time ago friend, Joy, who used to live in the US during the war, and with the help of Joy, Maya reunites with all her friends. Little did Maya knew that she has to pay a heavy price for a grave mistake that will put a never-ending gap between her and her brother, when Sohail sends away his son to a madrasa in an isolated island, run by some religious fundamentalists. Although, in the mean time, during Maya's mother's sudden illness, it forces her to find peace in the beliefs and comfort of the holy book and its teachings, and also serving as an activist for all those who have suffered from the war.After reading this book that is midway between a family sag trilogy, I'm desperately vouching to get my hands on the first and the third book, as this book brought tears to my eyes. The author has penned the story with utmost brilliance and vividness and with such depth, that it opened my eyes, my mind and my heart towards a forgotten era and the pain of the people in those times. Even though this is a fictional story, but it is very much inspired from the real-life stories and it has left my heart bleeding from the pain that I felt after reading this book. In short, I call this type of books as \"masterpiece\" where the author serves as the lord, showing her readers, who are the shepherds, the right way back into the past.The author's writing is emphatic and extremely eloquent and it is laced with strong, heart felt emotions that will move the readers deeply. The narrative is inspired from the local dialect but that is easy to comprehend with for the readers of any mother tongue. Also the dialogues are catchy, engaging and free flowing. Right from the very first page, the story is so compelling that it will suck the readers into its deepest, darkest depth of the story line. The pacing is smooth and moderate, as there are so many events that unfold strikingly with careful descriptions that will help the readers to visualize and feel, right from the scenes to the emotions behind it. The author arrests the backdrop of Bangladesh and its landscape quite evocatively through her poetic prose and exquisite words. The readers are in here for a treat, if they have never before visited this simple yet fascinating land in their life, and will make nostalgic to those who live or used to lived there once upon a time. I think this book is strongly recommended to those whose mother land or the roots of heritage lies in Bangladesh, but had to leave this land after the India-Pakistan-Bangladesh partition. The author here paints a vivid and a charming portrait of Bangladesh during the late 20th century when it was under a dictatorship rule, with its rugged terrain, green flora, the grayish rivers that smell like home and its warm and homely people, with the then culture and religious limitations. The characters in this book are like diamonds in the rough, ordinary but shine with their uniqueness, honesty and realism. The main character, Maya, is a sad yet brave woman who during the 80s and in a land dominated by Islamic preaching, managed to live by her own rules by becoming a doctor and not settling down to the domestic responsibilities by becoming someone's wife. Maya's quest to befriend and find support in her brother is a journey with challenges, sorrow and grief, and her determination will keep the readers rooting for her till the very heartbreaking end. The rest of the supporting characters reflect their brilliance through their authentic and interesting demeanor. And the readers will find a strong connection to each and every character present in the book as their stories are real and extremely relatable. In a nutshell, this is an intriguing, enlightening yet painful story that will make the readers ache for the characters in the end, and will also fill their hearts with a sense of respect and love for their families, as the author strongly portrays the meaning of having a family through this story. Verdict:  A must read novel for one and all."}, {"userName": "Paul", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/4643325-paul", "userReview": "This is the second in a trilogy, the first being “A Golden Age” and continues the story of the Haque family and is again set in Bangladesh. It can be read as a stand-alone, but it does help to have read the first one. This part of the trilogy focusses on Rehanna’s two children, Maya and Sohail. It switches from just after the war and independence to ten years later. It charts the very different directions the siblings take as a result of their experiences during the war. Maya becomes a doctor and helps women traumatised during the war, performing abortions for many who were raped; she then spends time in a village as a medic, having left her home. She returns at the death of her brother’s wife and the switching backwards and forwards gradually fills the gaps. Sohail has become religious; Islam is now his focus and he is a charismatic teacher and preacher. He has followers and sometimes travels to spread the message. Their very different takes on life creates tension between the two and their mother Rehana is oftencaught between the two. Sohail has a son, Zaid, who also plays a significant role. The story is told from Maya’s perspective. She is essentially a non-believer. There are no purely good characters and some difficult topics are covered including child abuse, torture and cancer. Anam is not afraid to chart her way through chaos and crisis. I think this is a more complex work than the first in the trilogy. During the civil war there was a goal and those with differing opinions could work together. Now the war is over there are different directions that can be taken, upholding the old maxim that war is easier than peace. Maya has learnt a good deal about her country’s patriarchal mind-set in her work as a village doctor and so she finds her brother’s solace in religion very difficult. Anam manages to be fair to both siblings and resists the temptation to go for easy answers and solutions; although her heart clearly lies with Maya. The whole is well written and I will certainly look out for the third in the series."}, {"userName": "Kim", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/1519524-kim", "userReview": "So unfortunately I didn't find this story interesting until the last few pages. I hate when that happens. Just couldn't get into it until the very end."}, {"userName": "Tas", "userReviewDate": "Apr 18, 2012", "userURL": "http://www.goodreads.com/user/show/1008153-tas", "userReview": "I had high expectations from Tahmima Anam when I very randomly came across her second book tucked away in the corners of a bookstore in the Bangladesh airport. I thoroughly enjoyed Golden Age and had recommended it to many non-Bangladeshi friends. Imagine my surprise at finding out a quarter of the way through that this book is a sequel to Golden Age! I kept my frustrations at check about the glacial pace and the jumpy narrative and breezed through the pages. At the end, as much as it pains me, I have to say this is not a good book. With 'Golden Age' you got the sense that Anam was able to look inside the mind of Ammoo. But with this one, I never got a sense of why Maya does what she does and I don't think Anam did either. I wonder if that is why she (unsuccessfully) shifts her narrative voice in the middle. Other than a few sounds bites about the dichotomy of culture and religion among Bangladeshis, it falls short in writing, editing and finally saddens with a climax that could be foreseen a mile away."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Jul 22, 2011", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "A Golden Age introduced the widow Rehana Haque and her two teenagers, Sohail and Maya, as they participated in the 1971 Bangladesh War of Independence.The Good Muslim is the second book in the Haque family trilogy. It begins in 1984, thirteen years after the war. Bangladeshis are not necessarily much better off than before the war. The country has had two presidents assassinated and is now living under the thumb of the Dictator. Martial law is in effect, war criminals still have not been prosecuted, and religious extremism is building.Once inseparable, Sohail and his sister Maya were driven apart following the war. Sohail felt the need to atone for his part in the war by gradually falling into an extreme practice of Islam. Maya became a doctor and shunned religion. The two have had no contact since 1977, when Maya fled from Dhaka in anger at her brother's complete renunciation of all the worldly things he once treasured. She felt she had lost the brother she loved, her heart's companion.Maya returns to Dhaka in 1984. She is distressed at her brother's continued religiosity, yet she is seduced by its promises when disease threatens her mother's life. She quickly forges a strong bond with her motherless nephew Zaid. Sohail has other plans for the boy, deepening the rift between brother and sister. Maya finds it impossible to connect with her brother. His religious devotion is so intense that he neglects his son's needs and turns his back on old friends. As in the old days, Maya can't help finding ways of getting herself in hot water. She's an intelligent, bold, outspoken woman in a country that favors female submission.Tahmima Anam's strength lies in writing about the intricacies of familial love and loyalty. The political and religious climates aren't neglected by any means, but the real beauty here is in Maya's struggle to find a new way of loving her brother. Eventually she has to let go of her need to bring back the old Sohail, and love him from a distance for the good he has done.The Good Muslim stands strongly on its own, but it will have a lot more depth if you've first read A Golden Age. It helps to know the Haque family history, and to know the characters as they were in 1971---so hopeful and militant and in love with the idea of freedom for Bangladesh. It's interesting to note that the character of Rehana is based on the author's grandmother."}, {"userName": "Diana", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/6102316-diana", "userReview": "I want to tread lightly with my review, mainly because I don't want to offend anyone who is Muslim. The Muslim culture has always been a mystery to me and I always wondered about the complexities of the culture, as well as the every day life things. I felt like this book gave me a tiny glimpse into the culture, and I mean tiny, but it was significant all the same. This book really blew my mind. I had no idea it was a sequel but it reads like a stand alone book. Maya is a character that I found very difficult because I liked her, rooted for her, but at times found myself very exasperated with her. I found myself feeling so many emotions at once that I couldn't put the book down, and when I had to sleep, I thought about and picked it back up as soon as I awoke this morning. The ending is haunting and I liked that. I know this a book I will not soon forget."}, {"userName": "Claire McAlpine", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/2528841-claire-mcalpine", "userReview": "In A Golden Age, Tahmima Anam's first book in this Bangladesh trilogy the focus is on Rehana, the mother of Maya and Sohail and most of the book takes place from March to December 1971, during the Bangladesh War of Independence. It shows how families, neighbours, ordinary citizens coped with war, how they got involved and the effect it had on them all.Now, in The Good Muslim it is some years after the war and Maya has just returned to Dhaka, to the family home and over the course of the novel we discover her reasons for leaving, her disenchantment with how the war has affected her brother, who is not the same person as he was before. He becomes religious and inaccessible to her, any attempt to influence him, futile.It is the same family, but Rehana is more of a background figure, the home has been taken over by women wearing the bhurka, there are sermons on the roof and Sohail's son Ziad running around the place looking and acting more like the son of a servant boy (there is one scene where Maya takes him shopping for sandals and though his neglect is obvious, she is insulted when the shoeseller assumes he is the child of a house servant).Once she had given everything for her children. Now she was in retreat from them, passively accepting whatever it was they chose to do: turning to God, running away, refusing to send their children to school. There was nothing of the struggle in her any more.They are living in the newly independent Bangladesh, now under a Dictator and the shadow of war hasn't left them. There are men living among them who the population wants tried for war crimes, there are all the young women, shamed by having been made one of the spoils of war,viciously raped, many of them pregnant and unwanted, being put on flights to Pakistan.Bangabandhu had promised to take care of the women; he had even given them a name - Birangona, heroines - and asked their husbands and fathers to welcome them home, as they would their sons. But the children, he had said he didn't want the children of war.Maya has become a doctor and put her own personal life on hold, she has seen too much and doesn't feel capable of fulfilling any other role.She had told herself many times that marriage could not be for her. Or children. She saw them comin into the world every day, selfish and lonely and powerful; she watched as they devoured those around them, and then witnessed the slow sapping of their strength as the world showed itself to be far poorer than it had once promised to be.It's a sad picture of post-war trauma and the difficulties people have in returning to family life and love after all that they have experienced. It's not quite as engaging as A Golden Age, which was the novel of action, this is the novel of aftermath, a much more sombre undertaking."}, {"userName": "Lila", "userReviewDate": "Sep 22, 2015", "userURL": "http://www.goodreads.com/user/show/4656570-lila", "userReview": "This compelling novel is a follow up to A Golden Age. While The Good Muslim is a story on to itself, it definitely would be much better appreciated having read The Golden Age First. It has been over 10 years since Bangladesh won independence, however there is still no real democracy. The two young Golden Age protagonists, brother and sister Maya and Souhail, are now in their early 30s and have gone different ways. Maya is a medical doctor, secular and still holds her revolutionary beliefs that she had as a student. On the other hand, Souhail has renounced his past and become a religious fundamentalist. Their mother Rehanna does what she always has, devote herself to her family. I love Tahmima Anam writing because she enables you to live with her characters. You feel like they are real people and you know them, even when you don't always understand them or even agree with them.Honestly, I did not know much about the history of Bangladesh until I read these two novels. Reading these types of books is a window into learning about and understanding new cultures. I can only recommend it!"}, {"userName": "Mahmudur Rahman", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/55940395-mahmudur-rahman", "userReview": "১.১৯৮৪ সাল। যুদ্ধের পর কেটে গেছে এক দশক। আর এই এক দশকে পাল্টে গেছে অনেক কিছু। পাওয়া, না পাওয়ার হিসাব মেলাতে গিয়ে হিমসিম খাচ্ছে কিছু মানুষ, আর বাকিদের সে সম্পর্কে ভ্রূক্ষেপ নেই। তারা মেতে আছে তাদের নিজের দুনিয়ায়। এরই মাঝে এই দেশ আর তার মানুষেরা তাদের দুজন রাষ্ট্র-নায়ককে হত্যা করেছে। আর এখন চলছে সামরিক শাসন। সিলভির মৃত্যু দিয়ে শুরু হয় 'দ্য গুড মুসলিম'। এই উপন্যাসে দুটো সময় সমান্তরালে চলেছে, একদিকে ১৯৮৪ সাল থেকে, আরেক দিকে ১৯৭১ এর পরবর্তী সময়। ১৯৮৪ সালে মায়া সাত বছর পর বাড়ি ফেরে। এই সাত বছর সে ঘুরে বেড়িয়েছে দেশের বিভিন্ন প্রান্ত। শেষে থিতু হয়েছিল রাজশাহীতে। তারপর সিলভির মৃত্যুর খবর পেয়ে বাড়ি ফেরে মায়া।যুদ্ধ শেষে বাড়ি ফেরার পথে পরিত্যাক্ত এক ব্যারাকে এক নারীর সন্ধান পায় সোহেল। পিয়া নামের মেয়েটিকে সে তার বাড়ি পৌঁছে দেয়। ফিরে আসার সময় সোহেল তাকে নিজের ঠিকানা লেখা এক টুকরো কাগজ দিয়ে আসে। আর একদিন পিয়া এসে উপস্থিত হয় ধানমন্ডিতে। অন্তঃসত্ত্বা পিয়াকে তার পরিবার গ্রহণ করতে চায় না। রেহানা থাকে আশ্রয় দেন। কিন্তু পিয়াকে নিয়ে সোহেলের মাঝে কোন একটা দ্বন্দ্ব চলে। এমনিতেও সোহেল অনেক বদলে গেছে। তারপর একদিন পিয়া হঠাৎ করে চলে যায়, যেমন হঠাৎ সে এসেছিল।যুদ্ধের সময়েই সিলভি ধার্মিক হয়ে যায়। ধীরে ধীরে সে যোগ দেয় তালিমে। বোরখা ছাড়া বের হয় না সে কোথাও। পিয়া চলে যাওয়ার অনেক পরে সোহেলের সাথে সিলভির বিয়ে হয়। ততদিনে সোহেলের মাঝেও এসেছে কিছু পরিবর্তন। যে ছেলে মার্ক্স পড়ত, মাথায় থাকতো চে গুয়েভারার টুপি, সে এখন কুরআনের বানী আওড়ায়। এমনকি একদিন সে পুড়িয়ে ফেলে তার সব বই। আর সেদিনই মায়া বাড়ি ছেড়ে চলে যায়।মায়া ভেবেছিল, সিলভির জন্য তার ভাই বদলে গেছে। কিন্তু সোহেলের হাতে কুরআন তুলে দিয়েছিলেন রেহানা। যুদ্ধ-ফেরত ছেলের অস্থিরতা কমাতে সাহায্য করবে আল্লাহর বানী, এই ভেবেছিলেন তিনি। প্রথমে তিনি সোহেলকে পরে শোনাতেন, তারপর সোহেল নিজে পড়তে শুরু করে। একসময় সে কুরআন আর আল্লাহ ছাড়া কিছুই বুঝবে না, এ কথা রেহানা ভাবেননি।বাড়ি ছেড়ে দেশের উত্তর দক্ষিণ ঘুরে মায়া শেষে এসে উপস্থিত হয় রাজশাহী। সেখানেই থিতু হয়। নাজিয়া নামের এক মেয়ের প্রসবে সাহায্য করার পর নাজিয়া তার গ্রামে মায়ার প্রচুর প্রশংসা করে। মায়া আর নাজিয়া প্রায় বান্ধবী হয়ে ওঠে। তারপর গ্রামের মেয়েদের মাঝে সুস্বাস্থ্য, সন্তানের পরিচর্যা বিষয় নিয়ে কাটিয়ে দেয় মায়া। এর মাঝে নাজিয়াকে নিয়ে পুকুরে সাঁতার কাটাকে কেন্দ্র করে গ্রাম্য সালিশে বিচার হয় নাজিয়ার। মায়ার টিনের চালে ঢিল পড়তে শুরু করে। তারপর একদিন সিলভির মৃত্যুর খবর আসে।যুদ্ধের সময় নিয়ে সোহেল একদমই কথা বলতো না মায়ার সাথে। কখনও রেহানার সাথেও বলেছে কিনা, মায়া জানে না। সোহেল নিজের মধ্যে গুটিয়ে গিয়েছিল। যুদ্ধের পর মায়া আর রেহানা স্বেচ্ছাসেবকের কাজ শুরু করে। তখন, যুদ্ধ-শিশুদের গর্ভে নিয়ে মেয়েরা আসতে থাকে তাদের কাছে। কেউ নিষ্কৃতি পেতে চায়, আবার কেউ চায় সেই সন্তান। বঙ্গবন্ধু এদের বীরাঙ্গনা উপাধি দিয়েছেন, কিন্তু এদের প্রায় কাউকেই চায় না তাদের পরিবার। কিছু কিছু মেয়ে তাই, সব ফেলে যুদ্ধ-বন্দী পাকিস্তানী সেনাদের সাথে চলে যায় বারশ' মাইল দূরে।শহীদ মিনারে একদিন মায়ার সাথে জয়ের দেখা হয়। জয়, সোহেলের বন্ধু। যুদ্ধে সে হারিয়েছে নিজের ভাইকে, আর তার হাতের আঙ্গুল। জয়ের সঙ্গে মায়া একদিন একটা সভায় যায়। সেখানে জাহানারা ইমামের সাথে দেখা হয়। তখন স্বৈরশাসন চলছে দেশে। তারা কয়েকজন মিলে কিছু একটা করতে চান স্বৈরশাসকের বিরুদ্ধে। সেই সঙ্গে শাস্তি দিতে চান যুদ্ধাপরাধীদের।সোহেল এখন পুরদস্তুর একজন পাক্কা মুসলমান। জোব্বা পরিহিত সোহেল এখন অনেকের সম্মানের পাত্র। তাবলীগ জামাতের সবাই সোহেলকে চেনে। নিজেদের বাড়ির দ্বিতীয় তলাটা সে ব্যবহার করে তাবলীগ জামাতের আলোচনার জন্য। সেখানে বিভিন্ন দেশ থেকে নানা মানুষ আসে। সিলভি-আর সোহেলের একটি ছেলে আছে, জাইদ। সে বালতি বালতি পানি পৌঁছে দেয় দ্বিতীয় তলায়। পুণ্যবান পিতা থাকা সত্ত্বেও ছয় বছর বয়সী এতিম একটি ছেলে, যে প্রচুর মিথ্যা বলে এবং চুরি করে।যুদ্ধ শেষ হওয়ার পর সোহেল আর পড়াশোনায় ফেরেনি। মায়া ফিরেছিল। সার্জন হতে চেয়েছিল সে। জয় চলে গিয়েছিল আমেরিকায়। সেখানে ট্যাক্সি চালাত। জয়ের আমেরিকায় যাওয়া নিয়ে মায়ার ক্ষোভ ছিল। কিন্তু, জয় দেশ ছেড়েছিল বাধ্য হয়ে। কেননা, \"স্বাধীন দেশ কখনও জীবিত গেরিলা চায় না\"। জয়ের মাধ্যমেই মায়ার সাথে শাফাতের দেখা হয়। পুরান ঢাকায় সে এক ঘিঞ্জি বাড়িতে বসে স্বৈরশাসকের বিরুদ্ধে লেখালেখি করে। মায়াও যোগ দেয়। প্রথমে সে রাজশাহীতে থাকা অবস্থায় তার দেখা গ্রামের কথা লেখে।রেহানার ক্যানসার ধরা পরে। কেমোথেরাপি চলতে থাকে। জাইদের পড়াশোনার দায়িত্ব নিতে চেয়েছিল মায়া, কিন্তু সোহেল তাকে পাঠিয়ে দিয়েছে চাঁদপুরে কোন মাদ্রাসায়। রেহানা যখন অসুস্থ তখন একদিন মাদ্রাসা থেকে পালিয়ে আসে জাইদ। কিন্তু ফিরে এসে মায়া তাকে খুঁজে পায় না। রেহানা অসুস্থ থাকা অবস্থায় মায়া মাঝে মাঝেই তাবলীগের নারীদের মাঝে গিয়ে বসত। সে বুঝত না কেন সে সেখানে যাচ্ছে। কিন্তু খাদিজা নামের দলনেতা মহিলার আসেপাশে থাকলে তার নিজেকে নির্ভার মনে হতো।সোহেল ছিল মায়ার একমাত্র বন্ধু। পাকিস্তানে, তার চাচার বাড়িতে থাকা অবস্থায় সোহেল ছিল মায়ার বাবা, মা এবং ভাই। মায়া সোহেলকে চেনে তুখোড় বক্তা হিসেবে, তার্কিক হিসেবে, যোদ্ধা হিসেবে। কিন্তু ১৯৮৪ সালে এসে জোব্বা গায়ে আল্লাহ রাসুলের কথা বলা মানুষটিকে তার অচেনা লাগে। এই সোহেল কোন যুক্তি তর্ক বোঝে না। তার আছে কেবল বিশ্বাস আর গোঁয়ার্তুমি। আর সেই গোঁয়ার্তুমির ফলে শেষমেশ মারা যায় সোহেলের একমাত্র সন্তান, জাইদ।২.মুক্তিযুদ্ধ ভিত্তিক উপন্যাস, আমার যেটুকু পড়া, তার অশিকাংশই ১৯৭১ সালের কথা বলে। নিয়াজি, টিক্কা খান, ইয়াহিয়া। কিন্তু যুদ্ধের পরেও যে দেশে আরেকটা নীরব যুদ্ধ চলছিল সে সম্পর্কে আমাদের দেশে ক'টা উপন্যাস লেখা হয়েছে জানি না। যুদ্ধ পরবর্তী সময়ে একজন যোদ্ধার মানসিক অবস্থা নিয়ে মুহাম্মদ জাফর ইকবালের একটা উপন্যাস পড়েছিলাম, নাম সম্ভবত 'আকাশ বাড়িয়ে দাও'। আমাদের মুক্তিযুদ্ধ-পরবর্তী প্রেক্ষাপট নিয়ে লেখা হয়েছে, এর বাইরে আর কিছু পড়িনি। 'দ্য গুড মুসলিম', সেই যুদ্ধ-পরবর্তী সময়ের গল্প বলে।সোহেল ফিরে এসেছিল প্রচণ্ড একটা মানসিক টানাপড়েন নিয়ে। ফেরার পর যে আদর্শ সে মনে রেখেছিল, তার বাস্তবায়ন দেখতে পায়নি। একসময় বদলে যেতে শুরু করে সোহেল। আসলে সোহেলের বদলের মাধ্যমে ওই সময়ে দেশের বদলের কথাই বুঝিয়েছেন লেখিকা। শেখ মুজিবুর রহমানের মৃত্যুর পর দেশের পরিবর্তন, এই দেশের মানুষের মনের পরিবর্তন, এসব সোহেলের পরিবর্তন এবং পারিপার্শ্বিকতার বর্ণনায় রূপকের মাধ্যমে দেখিয়েছেন লেখিকা।আবুল ফজল তার 'পরাবর্তন' উপন্যাসে এক জায়গায় লিখেছেন যে স্বাধীনতার পর দেশের মানুষ আস্তে আস্তে ইসলামের দিকে ঝুঁকছে। এমনকি তাদের মুখের ভাষাও বদলে যাচ্ছে। 'দাদা' বলে এখন আর তেমন কেউ ভাইকে ডাকে না, বলে 'ভাইজান'। সত্যি সত্যি এরকম একটা পরিবর্তন এসেছিল। আচারে-বিচারে, বচনে পোশাকে। সেই গল্প লেখিকা বলেছেন, কিন্তু তার সবিস্তার কারণ আলোচনা করেননি। উপন্যাসে সে আলোচনা করার কথাও না।নাম পরিবর্তন বাংলাদেশের রাজনীতির অলিখিত নিয়ম। সরকার বদল হলেই নাম বদলের হিড়িক দেখা যায়। এই উপন্যাসে এরকম নাম বদলের কথা বলা হয়েছে। লেখিকার ভাষায় 'স্বৈরশাসক', ঢাকার বিভিন্ন রাস্তার নাম বদলে দেন। বদলে দেওয়া হয় ধানমন্ডি ৩২ নম্বরেরও নাম। এমনকি তিনি দেশের নাম 'ইসলামিক রিপাবলিক অব বাংলাদেশ' রাখতে চেয়েছিলেন বলেও উল্লেখ করা হয়েছে।বইটির নাম, 'দ্য গুড মুসলিম' কেন? তাহমিমা আনামের বই নিয়ে আমি ফেসবুক গ্রুপে কোন বিশদ আলোচনা পাইনি। তবে এক জায়গায় একজন 'দ্য গুড মুসলিম' নামটি নিয়ে আপত্তি করেছেন। তার কথা, 'গুড মুসলিম আবার কি জিনিস?' বইটি প্রকাশিত হয় ২০১১ সালে। এবং ইংরেজি ভাষায়। আমরা জানি ৯/১১ এর পর থেকে বর্তমানে ইউরোপ আমেরিকা এবং আরও অনেক দেশে মুসলমানদের অনেকেই একবাক্যে 'সন্ত্রাসী' বলে জানে। অনেকের ধারনা এরা সবাই 'প্রতিক্রিয়াশীল'। বেশি দূরে যাওয়ার দরকার নেই, এই উপমহাদেশেই প্রচলিত আছে যে 'ইসলাম কায়েম হয়েছে তলোয়ারের জোরে'। তাহলে মুসলিম মানেই যাদের কাছে 'টেরোরিস্ট', তাদের কাছে 'গুড মুসলিম'কে পরিচয় করিয়ে দেওয়া বোধয় নাজায়েজ হবে না।উপন্যাসের 'গুড মুসলিম' আসলে সোহেল। সে এমন একজন মানুষ, যে কেবল তার ধর্মে বিশ্বাস করে দৃঢ়ভাবে। সোহেল এবং তার সঙ্গী সাথীদের আমরা কেবল দেখি, নিজেদের বিশ্বাস, আর ইবাদতে মশগুল। ইসলামের বানী আরও অধিক মানুষের মাঝে পৌঁছে দেওয়াই তাদের কাজ। সেখানে তাদের মাঝে রাজনীতি নেই, অস্ত্রের কারবার নেই। এমনকি মায়া যখন তার মায়ের অসুখের সময় তাবলীগের মাঝে কেবল বসে থাকে, তার মনে বিশ্বাস জাগে যে তার মা বেঁচে যাবে। অর্থাৎ, কেবলই এক বিশ্বাস, যা আসে ধর্মীয় একটা পরিবেশের মাঝে, সেই অনুভূতি নির্মল। এরকম মুসলিম ছড়িয়ে আছে অনেক জায়গায়। সেই সঙ্গে, যে সময়ের কথা বলা হয়েছে সে সময়ে তাবলীগ জামায়াত বিস্তৃত হচ্ছিলো। এমনকি স্বৈরশাসক, যার একাধিক প্রেমিকা ছিল, তিনিও ইসলামের কথা বলতেন, সেই সময়ের গল্প এই উপন্যাস। ধর্ম বেঁচে খাওয়া চলছিল অনেক আগে থেকেই, তার মাঝেই থাকে কিছু বিশ্বাসী মানুষ। কিংবা শুধু মুসলিম নয়, মানুষ মাত্রেই তার ভেতরে একটা ভালো স্বত্বা থাকে। সবাই লালন করে না।মুক্তিযুদ্ধ নিয়ে অনেক বই পাওয়া যাবে, অনেক লেখা পাওয়া যাবে, কথা বলার মত অনেক মানুষ পাওয়া যাবে। কিন্তু এরশাদের শাসনামল নিয়ে কথা আসলে 'নূর হোসেনে' ঘুরপাক খাই। এই উপন্যাসে যে এরশাদের শাসনামলের ব্যবচ্ছেদ করা হয়েছে তা নয়, তবে কিছুটা চেষ্টা লক্ষ করা যায়। সেই সঙ্গে আছে জাহানারা ইমামের তৈরি ঘাতক দালাল নির্মূল কমিটির কথা। সেখানে এসেই উপন্যাস শেষ হয়, যখন মায়া এগিয়ে গিয়ে পিয়াকে আলিঙ্গন করে।এই বইটিও অনুবাদে পড়া। তবে, 'সোনাঝরা দিন'-এর চেয়ে অনুবাদ ভালো। মশিউল আলম ভালো কাজ দেখালেও কিছু হাস্যকর ভুল করেছেন। যেমন, মায়া জয়কে হঠাৎ দেখতে পেয়ে বলে, \"জয়, এটা তুমি?\" ইংরেজিতে, \"Joy, it's you?\" এর এহেন বাংলা আক্ষরিক অনুবাদ পড়তে হাস্যকর লাগে।"}, {"userName": "Marieke", "userReviewDate": "Sep 04, 2016", "userURL": "http://www.goodreads.com/user/show/1386971-marieke", "userReview": "I was right to wait to finish this. I could have finished it before bed last night, but I had a feeling that the ending should wait until morning. I was right. The end was magnificent and difficult. I needed the night of sleep and the strong coffee to fortify me against the heartache at the conclusion. Tears at 6:30am from a book? Yep. Tahmima Anam is quite possibly the greatest of my reading \"discoveries.\" I'm so thankful that my MENA reading group decided to branch out one year and dip our toes into some countries and cultures just outside the borders of our region. I might never have learned about this Bangladeshi writer...if you haven't read her, do! A GOLDEN AGE is the first in this trilogy, this is the second, and the third was just released. I must order it now...."}, {"userName": "Shannon (Giraffe Days)", "userReviewDate": "Jan 24, 2012", "userURL": "http://www.goodreads.com/user/show/395599-shannon-giraffe-days", "userReview": "Alternating between 1971 and 1984 The Good Muslim tells the story of Maya, a doctor who has spent seven years in self-imposed exile travelling the country, helping women and children survive childbirth and common illnesses, and her brother, Sohail, a freedom fighter in the war against Pakistan that ended in 1971. In the 70s, the young country was embracing a constitution and finding its feet, but Sohail is tormented by a girl he rescued from a barracks, Piya, and a man he killed on the road home. In his search for meaning he discovers the Book, and god, in a way he never had before. Maya, an independent young woman who helped in the war and spent her time afterwards helping women get rid of the babies of rape by enemy soldiers, struggles with this new Sohail. She's determined to bring back the brother she knew, a serious but loving brother who read Rilke and collected books. She blames his marriage to Silvi for turning her brother into a religious fanatic, and after Sohail burns all his books she leaves her home and her city for the countryside.Fast forward to 1984 and Maya has received a telegram informing her of Silvi's death. Now, she feels, she can return to her mother and the life she left behind. But things have changed even more in Dhaka, and with Sohail. He's now considered a holy man, and people - especially women - arrive from all over the world, climbing the ladder to the tin shack he built on top of her mother's house to hear him speak. He has a son, eight-year-old Zaid, who looks like a servant boy in tattered clothing, too-small sandals and grimy hands. He lies and steals but desperately wants to go to school.Picking up her life in Dhaka, Maya is confronted by the new Bangladesh in a different way from the country, where little much has changed. An old friend, Joy, returns from America and Maya resists his quiet determination to marry her. She struggles to unite the different sides of herself, between the old, fierce Maya who performed so many abortions for her country, and this new Bangladesh where everyone wants to forget what happened in the war, and what happened to the countless women who were raped and then shunned by their families. She sees Sohail as an embodiment of this determination to forget, and his seeming lack of interest in his son becomes yet another obstacle between him and Maya.I didn't know much about Bangladesh before starting this, and to be honest I still feel like I don't, even though this book is rich in Bangladeshi history and culture. All I knew about it before I learned from year 11 geography class, in which we used Bangladesh as a topic country - so my understanding of the country is one of high infant mortality rates, poor standard of living, low GDP, and rivers that flood routinely, depositing nutrient-rich sediment in which they plant their rice crops. That was back in 1996. In terms of history, I only learned when recently reading \nTropic of Chaos\n that Bangladesh is a really new country, relatively, separated from India like Pakistan was. But that's about it, and sadly I think I'm even more confused now.This book is rich in history, as I said before, but it either assumes readers will come to the book with a lot of knowledge, or it thought it was doing a better job of narrating events than it does, or Anam wasn't trying to teach us the details through this narrative. Whichever it is, I felt more confused than anything else. I understand that they were fighting the Pakistani army and that they won, but that's all. Several different religious and military leaders were named, but I couldn't follow who they were or what happened to them. And why Pakistan was fighting there I wasn't sure about - I couldn't remember from Tropic of Chaos but I had thought that Pakistan was an ally - two muslim countries on either side of India...When I'm confused about what's going on - especially when it's context like this - it really does detract from the story. I did my best to piece together what I could and ignore the rest, or just glide over it, but I always feel like I'm doing a book a disservice when I do that.The war is important to the story. There's so much conflict between Maya and Sohail, and the war is at the heart of it. It's rather like a third character - a hazy, ill-defined character that wields enormous power over the others but never comes into the foreground where it can be faced. Like a monster that remains in the shadows, in the guilt-ridden spots of the heart. That it changed Maya and Sohail, and everyone else too, is undeniable and a strong theme in the book. I liked that it didn't overshadow the human story, and it was present very much as an influence and a stage for some horrible, horrible stories, but I would have liked to have understood the scope of it better. Like the war, the landscape too was described in brief brush strokes, like random jigsaw puzzle pieces that turn up, giving you glimpses but not the full picture. I struggled with this less than the war but I still had a hard time picturing the different places in Bangladesh Maya travels to. In contrast, the people are quite vivid, and very much alive in the quick descriptions of stained teeth, or a heaviness of the body, or the narrowed, disapproving eyes of religious men, seeing Maya's uncovered face.Which brings us to religion. It's another strong presence in the novel, but like the war and the landscape and even the characters, it's not the in-your-face issue you'd expect from the title and the premise. Maya is not very religious, and feels betrayed when Sohail essentially leaves her for god. She wants him back, she wants him to be the young man he was before the war, without understanding what he faced or what he did during that time that changed him. Maya can be wilfully blind and definitely selfish, but she's familiar and relatable because of her independent and modern she is, especially in comparison to many other characters. In contrast, it's hard to care for Sohail until the very end, when we finally learn exactly what happened that made him feel lost, and made him turn to god at the exception of all else. Only at the end did I feel something more for him than Maya's anger and frustration, though I pretty much hated him for the way he treated his son, and I disagree with Maya that it was her fault, what happened to Zaid. But both of them were selfish. Both were caught up in their own wants, in their own ways.I didn't understand some of Maya's actions or motivations, especially around Zaid. When she goes to buy him new sandals and the shopkeeper thinks he is a servant, Maya becomes angry and doesn't buy the shoes. But what confused and bothered me was how she took it out on Zaid. The more pathetic he became, the more dismissively cruel she treated him. And yet, she tried to save him too. If she couldn't have Sohail, she'd take Zaid, but it was more than that: somewhere along the way, Maya had to deal with her own past, her own role in the war and her own guilt over all those abortions. It's complex but feels simple as you read it.Overall, I'm not sure how I feel about this one. As a story, I liked it and yet wasn't very satisfied by it. As a voice for Bangladesh, I liked it and yet was frustrated and confused by it. Maya is a strong character, but I'm not sure I ever really understood her. My emotions were engaged as much as my head was, but it mostly left me wanting more: a deeper story, a more engaged story, a clearer sense of being present rather than watching through a grimy window.[After writing this review, I discovered that this book actually follows on from Anam's previous novel, A Golden Age, mostly centred on Maya and Sohail's mother and set before and during the war. It would probably give better background and context for Bangladesh's war of independence from Pakistan.]"}, {"userName": "Emma Deplores Goodreads Censorship", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/5229326-emma-deplores-goodreads-censorship", "userReview": "I thoroughly enjoyed A Golden Age, so I had high hopes for this book. Sadly, like many sequels, it just isn't as good as its predecessor. The Good Muslim picks up in 1984, over a decade after the end of A Golden Age, which chronicled the experiences of a family during Bangladesh's war for independence. Now the country is ruled by the unnamed Dictator, religious extremism is on the rise, and the Haque family is divided by the son Sohail's adopting such an extreme version of Islam that even toothbrushes are forbidden. Anam is a good storyteller, and I still found the characters interesting here. Again, I learned something about Bangladeshi history. And the sense of place is stronger in The Good Muslim than A Golden Age. The novel's biggest weakness is that the pacing doesn't match the story. At under 300 pages, this is a very quick read, and made more so by the short scenes, jumping back and forth between past and present and among point-of-view characters. The problem is that this is ultimately a story about family relationships, and it doesn't benefit from so much jumping around; in A Golden Age, Anam let scenes and relationships develop more slowly, and it worked better. Other reviewers have criticized the more dramatic scenes here for being melodramatic, and I can see where they're coming from; everything happens so fast that there's little buildup. And then there's Anam's treatment of Maya, the main character here. In A Golden Age, there's a certain ambivalence toward Maya, which I put down to seeing her through Rehana's eyes, where Rehana is ambivalent about her daughter. Here, though, even from Maya's own point-of-view, there seemed to be a certain authorial discomfort with her determined, nonreligious, childfree, single-professional-woman ways, and she's rather heavily criticized for \"causing\" a couple of terrible events by meddling--where while that didn't help any, Sohail's conscious (and in my view, very poor) decisions are the direct causes of those events. Maybe Anam was just trying to be balanced or something, but even there, I could do without another book where a woman not previously interested in these things suddenly decides she needs a husband and babies to be happy after all--and the romance was weak and uninteresting, although fortunately it doesn't take up much time. Despite the criticism, though, this isn't a bad book; Anam does write well. And she has some interesting things to say about why people turn to extremism. But if you're only going to read one, go with A Golden Age instead."}, {"userName": "Beverly", "userReviewDate": "May 29, 2011", "userURL": "http://www.goodreads.com/user/show/876421-beverly", "userReview": "Heading: Peace Is Harder Than WarThe Good Muslim by Tahmina Anam is the story of two siblings, sister Maya Haque and brother Sohail Haque. Both have survived the 1971 Bangladesh War for Independence, yet are haunted by the things they did and saw. Before the war, Maya and Sohail were inseparable, but chose different roles during the war, Sohail was a guerilla fighter and Maya worked in a refugee camp. Now that the revolution was successful, brother and sister struggle on how to cope in this budding time of peace. Maya chooses to connect to her country by working as a “crusading” doctor in the rural villages and Sohail chooses his faith. It is these moral choices that cause a conflict between them. But soon things will escalate that will either allow them to accept each other choices or become a permanent barrier.The story unfurls gently from the intimate details in two main switching storylines; Sohail’s return from fighting in 1971, and Maya’s return from a northern village in 1984 to provide a full picture on how each of the characters evolve from the dark inner impulses of their souls. This format works well as the reader is privy to the building suspense of how this family will face some of their toughest struggles together. While there are brief attempts for Sohail to narrate the story, this is Maya’s story and it is her voice that informs the reader of the situations. Maya is a strong protagonist and there is much to admire about her, but at times she stumbles forward when a little more finesse may have worked a little better. But the characters demonstrate a strength and resilience that enables each of them to forge a new identity that they are comfortable with. While The Good Muslim is the second book in a projected trilogy, it stands on its own, but I do recommend reading, A Golden Age as it provides the historical background to the region. I enjoyed how Anam writes in an achingly loving voice, providing a powerful portrait of a family and a country adjusting to their independence, and the dismal aftermath of a war for independence.I recommend this book to readers who enjoy stories that cross geographical and cultural boundaries.This book was provided by the publisher for review purposes.Reviewed by BeverlyAPOOO Literary Book Review"}, {"userName": "Lara Zuberi", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/11413114-lara-zuberi", "userReview": "The Good Muslim is a very touching sequel to Anam's first novel, A golden Age. It takes the reader on a journey to post-war Bangladesh. Though the backdrop is political, it is woven into a very personal and real story of a family, and how they struggle, in their own ways to make sense of all the sacrifices they made. Rehana was the protagonist in The Golden Age, and The Good Muslim is written from the perspective of her daughter Maya. Since Rehanas character was based on Anam's grandmother, Maya's is likely based on her mother. The author has raised many relevant issues: the atrocities of war; the injustices that went unpunished and unrecognized; the radicalization that many freedom fighters fell prey to; the inevitable guilt a person must live with if they are responsible for someone's death; the way a daughter fears the loss of her mother; women's rights in the third world, minor subplot with a love story--but mainly it is a brother-sister story, and how the war took them in two very different directions, and how Maya struggles to rebuild this relationship which is so dear to her.The pace was slow at times, but the detailed descriptions of scenes made the story and the setting very real. I do worry that some readers may generalize the portrayal of religious Muslims in a negative way, specially in today's times. I hope they will read it with objectivity, and not forget that the story is fictional. Many lines were beautifully written, and managed to pierce the heart with their power. I enjoyed this book as much as the first one, and am looking forward to the next one, since we've seen a glimpse of the third generation. Tahmima Anam is an eloquent voice in the world of contemporary fiction."}, {"userName": "edj", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/1071295-edj", "userReview": "The book opens with Maya preparing to return to the home she had fled 9 years previously. She has been working as a doctor in a small traditional village, delivering babies and trying to educate the community. They turn against her after a woman delivers a Downs Syndrome child, and her husband assumes his wife has had an affair with a Chinese man. The wife is beaten to the point of requiring 3 months of hospitalization, and Maya, after receiving some very definite threats, decides to return home. Her arrival coincides with the funeral of her sister-in-law.Maya and her brother fought in Bangladesh’s brutal war of independence from Pakistan, both strong believers in their revolutionary cause and both returning with their idealism shattered. Maya became a doctor; her brother Sohail is unable to make peace with certain war events. He fall sin love with a young woman he rescues from sexual servitude in an army barracks. When she, unable to bear her own burdens, flees, Sohail flounders. His teenage crush from across the street, a rigidly devout Muslim, decides to marry him. Sohail moves further and further into a very extreme form of Islam, one that forbids books and even toothbrushes.Maya’s return home is painful in many ways as she struggles with her memories and the lack of interest from her once-close brother. She is drawn to Zaid, her 5-year-old nephew, now cast adrift by the loss of his mother, but Sohail doesn’t allow her to truly mother him as she would like and he runs wild, a thieving and lying little charmer. When Zaid is sent to a madressa, where he is abused, Maya has to act to save him, but her actions will have ramifications far beyond what she imagines.The Good Muslim is beautifully written, with layers and nuances that develop the characters. Although a typical American reader will spend most of the book very angry at Sohail and his cold, detached and even cruel religion, by the end the reader comes to understand at least in part what has motivated him. The story moves back and forth between the time immediately after the war and the “current” time of the early 80s. It offers a thoughtful look at war and revolution and religion and Islamic fundamentalism in the lives of a few specific people, characters you’ll come to love. I highly recommend this book."}, {"userName": "Regina Lindsey", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/6693237-regina-lindsey", "userReview": "The second in Anam's Bangladesh series, The Good Muslim picks up where A Golden Age ends. The Bangladesh War for Independence has ended and the country that has emerged hasn't lived up to the standards for which Maya, Sohail, and Rehanna thought they were fighting . Unlike the first book, this story is more about the relationship between brother and sister than from Rehanna's point of view. As the story opens there is open tension between the once close siblings. Maya still holds to her Revolutionary ideals but has left journalism and trained as a doctor. She holds to a purely secular point of view, blaming religion for the shortcomings in both the country's and human's flaws. \"Maya had always prided herself on remembering exactly who she had been before the war broke out. She remembered her politics, the promises she made to herself about the country.\" Sohail, however, has sought comfort in the Quaran and has become a holy man, attempting to assuage the guilt he feels over his actions during and at the conclusion of the war. \"I have committed murder. If he were to tell his sister about the war, this is what he would have to tell her. She wants stories of heroism...But he has no story of this kind.\" The tension culminates around both desire to save Zaid, Sohail's son and an opportunity to forgive each other and themselvesA Golden Age was Anam's debut novel and the strength of the second novel shows tremendous promise for this writer. Not only does she have a gift for language with beautiful prose, but she understands the complexity of human emotions and relationships. While A Golden Age's central themes center around the different kind of loves experienced by humans and to what length we will go for it, The Good Muslim is about family and faith. I would not recommend reading this alone. I think it is important to read the first in the series to appreciate the fullness of the characters relationships. I wish I had read this one in closer proximity to the first."}, {"userName": "Amy Lignor", "userReviewDate": "Sep 16, 2011", "userURL": "http://www.goodreads.com/user/show/6259268-amy-lignor", "userReview": "This is a truly powerful story that offers an in-depth look into war, family, and the strength and courage that’s needed to let go of the nightmares of the past and begin a brand new future.Maya and her brother Sohail Haque are the ‘stars’ of this incredible novel. These are two souls who have survived the war of Independence that birthed the nation of Bangladesh, and the revolution that finally has calmed down in their world. Maya wants nothing more than to begin again. Deciding to go the route of becoming a Doctor, Maya pursues her dream and trains to be the best medical woman she possibly can be. Her bother, however, chooses an entirely different path.Sohail is a young man who is literally locked in the fog of the war. The nightmares that came from pain and bloodshed have made it almost completely impossible for him to be at peace and begin a new life. What he chooses to do is embrace the life of a devout Muslim which drives a wedge between he and his sister.Not being able to deal with her brother’s transformation, Maya leaves her childhood home. When she returns, Maya tries desperately to reconcile with the family she absolutely adores, and finds herself inside the world that her brother has created. While she’s a part of Sohail’s life of faith, Maya meets and grows to love Sohail’s son, Zaid. But when her brother sends his own son elsewhere - opening up even more family difficulties and pain - Maya finds herself trying to deal with the fact that if she chooses sides she may lose her brother forever.This year is the 40th anniversary of Bangladesh’s war of Independence which was a revolution that was never spoken about in novels. What Ms. Anam began with her debut novel, A Golden Age, she continues with this next book - offering readers an in-depth look into the aftermath and strife that comes with the birth of a nation. As well as the inner-workings of a family, and their desperate attempt to hold fast to their faith. Startling and heartfelt, this author has put together yet another unforgettable story."}, {"userName": "Bibliophile", "userReviewDate": "Apr 26, 2012", "userURL": "http://www.goodreads.com/user/show/422087-bibliophile", "userReview": "The Good Muslim is a sequel of sorts to Tahmima Anam's first novel, A Golden Age; the main characters of the second novel are the children of Rehana Haque, the protagonist of the first novel. Maya and Sohail Haque have both been damaged in different ways by their exposure to the horrors of Bangladesh's 1971 war for independence and they both react differently: Sohail becomes a devout Muslim, using his gifts for oratory to build a following for a fundamentalist Islam that is completely foreign to his \"pre-war\" personality, while Maya becomes a surgeon and political activist who desperately tries to reclaim the soul of her beloved brother by mentoring his neglected young son, Zaid. The Good Muslim was a more difficult book to read, because the issues were more complicated, in many ways: after independence Bangladesh was subjected to a succession of military coups, political murders, and dictatorship and so the thrilling righteousness of the revolutionaries' cause has been dissipated to some degree (and reading the novel required frequent resorting to Wikipedia because I am sadly quite ignorant about post-1971 Bangladeshi politics). But I thought Anam did a wonderful job in depicting someone whose faith helps to heal him while also alienating him from his family - Maya's befuddlement at her brother's choices is mirrored by the reader, but Anam never takes the easy way out of making Sohail into an unmitigated bad guy. He's still a good man (in most ways, although I find his neglect of his son rather unforgivable and I truly don't think Maya can be blamed for her actions in regards to the child because Sohail never gives any impression of caring what becomes of his child!) Appropriately, the novel ends on a bittersweet note, that's somewhat mitigated by a hopeful epilogue."}, {"userName": "Marvin", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/2582387-marvin", "userReview": "This really fine novel is set in Bangladesh in the mid-1980s, with flashbacks to the defining years of the 1970s, when all of the major characters' lives were transformed by the events of the revolution against Pakistan, though the promise of those days has been mostly lost to dictatorial rule. Those transformative political events are crucial to the story, but they are very much a backdrop to an intimate family story. A young, independent, secular, woman doctor is estranged from the handsome, bookish, older brother she long admired as he returns from the war a battered soul who immerses himself in religious practice--a move she refuses to try to understand and resents. \"She thought of all the things he liked to do.… Cricket on the shortwave. Mangoes and ice cream. Dante and Ibsen. Jimi Hendrix and John Lennon. Her voice on the harmonium. Her voice.\" It's a story about how excruciatingly difficult it is to understand and forgive--ourselves and those we care most about. The novel is beautifully, vividly written throughout, with some exquisite passages. Here for example: \"On the third day she waded into a village pond. He watched, worried she would stray too far. The sun struck the back of her, catching her hands as they moved across the water, propelling her forward. When she was neck-deep she dipped her head under. Her sari floated to the top, flowering. And when she came up again, she was different, as though she had gone under and told all the bones of her to put themselves back in order. That was how she emerged: neat, organised.\" I highly recommend this beautiful novel about a place most of us know little about."}, {"userName": "Andrea", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/9582364-andrea", "userReview": "This is #2 in the Bangla Desh trilogy, and although I liked it well enough, it didn't seem to have as much emotional impact on me as A Golden Age (at least, not until a particular incident right at the end). It's a different book - a quieter book.Told against two alternating timelines - one immediately after liberation, and the other 10-12 years later - this is Maya's story. Rehana Haque, her mother, although still prominent, has taken a back seat, and her brother Sohail, the Good Muslim of the title, has become a distant, inaccessible character.The story begins with Maya returning to Dhaka, after years of self-imposed exile working as a village doctor. She is still the feisty, independent woman we know from before, but more mellow and with a few years of life experience that have given her a new maturity that allows her to stop and consider other people's points of view. The one person she can't work out is her brother, and that's because a key part of the story is still missing. Maya misses their former closeness, but compensates by getting to know her young nephew Zaid for the first time.By the end, the reason for Sohail's transformation is revealed, and we find that in a way, Maya is not entirely blameless. I thought this was a worthy sequel to A Golden Age, showing us the aftermath of the war. There are some fairly graphic scenes, but nothing in my view that was gratuitous. I look forward to reading #3."}, {"userName": "Lisa", "userReviewDate": "Dec 03, 2011", "userURL": "http://www.goodreads.com/user/show/1758411-lisa", "userReview": "I really liked this book: longlisted for the Man Asian Literary Prize 2011 it’s a superb example of writing that is both ‘domestic’ and ‘big picture’.It’s the story of Maya Haque, a young woman seeking an identity which fulfils both her intellectual and emotional needs. But, set in Bangladesh in two alternating time periods, 1972, just after the war of independence and 12 years later in 1984 when political disillusionment had set in, the novel does not only depict the conflicts that beset Maya in the early days of feminism in a traditional culture. The Good Muslim also explores the emotional and intellectual chasm between Maya, a secular religious sceptic, and her brother Sohail, newly converted to hardline Islamic Fundamentalism. And while the focus of the novel is on the clash between secularism and faith, it also raises that critical question of how – when both sides have committed war crimes – can a country achieve justice and reconciliation in a postwar period? What solace can there be, at a personal and a national level?To read the rest of my review please visit http://anzlitlovers.com/2011/12/04/th..."}, {"userName": "Denae", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/4763195-denae", "userReview": "I have not read A Golden Age and I know nothing about the Bangadeshi war against Pakistan. Both of these facts most likely decreased my appreciation for The Good Muslim: A Novel. I enjoyed the first of three sections very much, but somewhere in the second what had seemed like an introductory style began to feel very much like a lack of coherency. The lack of exposition contributed to my confusion about the setting and Maya, the primary character, began to repeat her thoughts and observations in a way that became irritating. I find it frustrating that this book was not better, because it very well could have been. It feels like there is a beautiful story that could have been told if only the author had more time or a more brutal editor to trim away the outer edges and reveal the center.Disclaimer: I received an advance review copy of this book for free through the Goodreads First Reads giveaway program."}, {"userName": "Momina Masood", "userReviewDate": "Jun 19, 2016", "userURL": "http://www.goodreads.com/user/show/17262906-momina-masood", "userReview": "Liked this one better than A Golden Age."}, {"userName": "Rifat Zahan", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/65886644-rifat-zahan", "userReview": "The book was unnecessarily long. The writer described so many things is details which seemed to be unnecessary, whereas, provided very small details in important sections. Therefore, it was a bit challenging to follow. I wanted to give just one star. Since the ending was good, that's why added another star."}, {"userName": "Birgitte Bach", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/16237436-birgitte-bach", "userReview": "Lærerig bog om et land og en del af verdenen, jeg ikke ved ret meget om. Men der mangler stadig noget og lige som med den første bog i trilogien, synes jeg der var en afstand til personerne, som gjorde at jeg ikke kan engagere mig i deres historie, selv om det er barske og meget grusomme ting det omhandler."}, {"userName": "Canadian Reader", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/2103966-canadian-reader", "userReview": "Anam is a competent writer, but if you've not read her previous book (as I have not), you may be at the same considerable disadvantage that I feel I was reading The Good Muslim. As another reviewer has commented, the author does not fill in cultural information (some of the incidents, conversations and references are too subtle for the average western reader to make sound inferences from), nor is there sufficient background information provided about the war fought in the early 70s. As well, sprinkled throughout the novel are numerous Arabic and Indian/Bengali(?) terms and words--e.g.\"mawlana\", \"pir\"...among many others. I am willing to do some work as a reader; however, a glossary and a few maps (say of Bangladesh and Dhaka) would've been much appreciated. Lacking these things, and faced with a cast of characters almost exclusively preoccupied with religion and politics, I did not enjoy this novel at all. While I admit to a general ignorance about the issues and history of Bangladesh, I was most disappointed that Anam's book did little to engage me. As a result, I am unable to recommend the book to general readers of literary fiction."}, {"userName": "Anam Shaikh ⚯͛", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/30620720-anam-shaikh", "userReview": "Oh my God this is amazing!!! Better than the prequel (A Golden Age). But I didn't understand. Was Khokha colluding with the police? (*spoiler*) Did Zaid commit suicide?"}, {"userName": "MeruChii", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/42766370-meruchii", "userReview": "My initial rating was 5 stars but I've decided to lower it to 3 stars instead . I've realized after reading a different book that this one wasn't as good as I thought it was , and even though I read this book four days ago , I can barely remember what happened which proves just how much it didn't leave an impact on me . I also just found out that this is actually a sequel . A lot of people praised the first book so I might pick it up and give it a chance and hopefully I'd enjoy it more than this book ."}, {"userName": "Shreya Vaid", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/27443174-shreya-vaid", "userReview": "From the award-winning author of A Golden Age, Tahmima Anam, comes another masterpiece, The Good Muslim, the story after the war. A story of survival, of hiding and never letting the past go.The Good Muslim follows the story of Haque family after the war, when in an abandoned building, Sohail Haque comes across a woman, shattered and ripped to pieces, showing the signs of war, gang rape, torture and seeds of hatred in her womb. A woman who will haunt Sohail for the rest of her life.After a decade, Maya returns home to Dhaka to find his brother converted and totally engrossed into religion and her mother who has lost the spark of her revolutionary days. While Maya has stuck to her revolutionary ideals, Sohail has now burnt all his books that once gave him inspiration, and has joined Tablighi Jamaat movement, building a new life in it. Maya blames everything on Silvi, who is Sohail's wife. Silvi, who before the war was married to a soldier, who lost his life during Liberation of Bangladesh and Silvi found solace in The Book. But Rehana defends her son, saying that he is just trying to heal his wounds of war, running away from shadows of people who were killed and destroyed in front of him. Maya also comes across Sohail's son Zaid, who is being raised as a Good Muslim, not going to school but a traditional Madrassa, not in a world of books but in the world of sermons and The One God. And ignorance towards his upbringing, turning him into a liar and a thief.The Good Muslim is a like a historical sweep that ranges from Liberation of Bangladesh to back to the central characters, Rehana, Sohail and Maya who are now trying to get back to their normal lives. But after a ravaged season of war, only Maya can live with her past. Both Rehana and Sohail have moved on, leaving Maya all alone to relive the glorious and adventurous days of the past, which in turn make her more frustrated.The ideological and core center of The Good Muslim lies between the conflict of Sohail and Maya, both trying to be the Good Muslim in their own way. Maya, giving up surgery and traveling to remote nooks and corners of Bangladesh, helping women deliver babies and even aborting the unwanted seeds of war, fighting for the rights of women, even at the risk of her life. Sohail, on the other hand, embracing a more cultish side of the religion, burning of books, giving up on the pre-war life, music, friends and liberal values that once made him fight for his country. At the end of the day, Maya realizes too late that his brother is only trying to heal his wounds via these sermons, only trying to survive the psychological ill-effects the war has left him with. She remembers her mother's words; That he is only trying to find solace through The Book, he is still the same.The Good Muslim is a book that will introduce you to a life of people after the war. Some of them bask in the glory of those days, some try to run away from the hideous memories of it. In the story of The Good Muslim, you come across both types of characters. As compared to A Golden Age, The Good Muslim may prove to be a little slow to read, a bit of action missing. But then it is a book full of emotions and after effects of the war, something that will attract you towards it. The story of The Good Muslim is pretty strong and will keep you engaged, and Maya's character will take a place in your heart. Eventually, when you read the book, you will miss the older Sohail and won't even like the new version of Sohail, but at the end of the book, you will embrace him more warmly than Maya.Both Sohail and Maya are dealing with the devils of their past. Maya, who never discusses why she came back so suddenly, indulges one her friends into the secret that she convinced pregnant women to take a bath in the village pond, making way for consequences that turned out to be dire for both of them. Maya tries to fight for her friend, but then gives up reluctantly when she realizes that the New Bangladesh is something different, being run by a dictator. She comes back home and even joins a newspaper, sharing her views on the new political situation of Bangladesh, but doesn't find solace in that, as her real piece lies with Sohail only, who she feels has abandoned her just like that for religion. Thamima Anam has done a wonderful job sharing both sides of the same coin via this brother and sister relationship. All in all, The Good Muslim is a pretty great book, something that you can devour into. Now looking forward to the last book in the series, The Bones of Grace."}, {"userName": "Mark Staniforth", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/4106933-mark-staniforth", "userReview": "For her second novel, following 2007's Commonwealth Writers' Prize winner 'A Golden Age', Tahmima Anam tackles the not inconsiderable, and certainly timely, topics of revolution and fundamentalism in her native Bangladesh. As the Arab Spring turns cold in Egypt, The Good Muslim begs the question of whether so-called liberation is ever entirely achieved by mass rallies in public squares or newsreel footage of toppling statues.In Bangladesh, which achieved independence after a short war with Pakistan that ended in 1971, the first decade-and-a-bit as a sovereign state were anything but liberal. War wounds festered, and a series of assassinations and attempted coups seemed designed to shatter hopes of stability. It is best described by Anam:\"Thirteen. Her broken wishbone of a country was thirteen years old. Didn't sound like very long, but in that time the nation had rolled and unrolled tanks from its streets. It had had leaders elected and ordained. It had murdered two presidents. In its infancy, it had started cannibalising itself, killing the tribals in the south, drowning villages for dams, razing the ancient trees of Modhupur Forest. A fast-acting country: quick to anger, quick to self-destruct.\"Anam's narrative is split between the immediate aftermath of the war, and the mid-1980s, when religious radicalism is on the rise and the concept of liberation is beginning to mean very different things to different people.Anam frames her story around a single family: primarily the headstrong Maya, returned from her war work as a nurse brimming with revolutionary principles, and harbouring disdain for those who pursue divisive agendas in the name of God; and Sohail, her beloved brother, whose harrowing wartime experiences have sent him down a fundamentalist path.When Sohail effectively reinvents himself as a prophet, and sends his young son Zaid to a madrasa, Maya is determined to convince him to see the error of his ways by any means necessary, but the dark secrets she digs up threaten to destroy her dream of some kind of united future.The narrow focus of Anam's novel is a clever one, turning the post-independence problems faced by nations both past and present into broadly personal ones, highlighting the raw emotions and paradoxes which prevail in every household; the difficulty of remaining true to one's principles when war wounds are yet to heal.It does, however, come at a price: the reader is afforded only perfunctory glimpses of daily life in Bangladesh during this period of tumult. These precious glimpses of a nation striving for some kind of normality - moments when Maya and her ailing mother prepare to watch an episode of Dallas, or when they share chilli-hot phuchkas by the roadside while an anti-government demonstration is dispersed by tear-gas close by - are too few and far between.At times, this lack of evocation can make Anam's writing seem strangely flat, and yet such drawbacks can be largely forgiven thanks to a blistering second half of the novel, in which Anam wrenches her characters towards a rousing, deeply emotional finale: Maya, in particular, evolves into a stunning paradox, her resistance to religion becoming more acute, yet still feeling its strange pull: wishing, in her darkest times, that she had \"surrendered to its practicality\".'The Good Muslim' is a brave and important book, and if the pertinence of its message lingers longer than some of the characters themselves, then that is not necessarily a bad thing. Anam is clearly a writer for the future: someone with lots to say, and the ability, and time, to say it. That, too, ought to be something to celebrate."}], "description": "From prizewinning Bangladeshi novelist Tahmima Anam comes her deeply moving second novel about the rise of Islamic radicalism in Bangladesh, seen through the intimate lens of a family.Pankaj Mishra praised A Golden Age, Tahmima Anam's debut novel, as a \"startlingly accomplished and gripping novel that describes not only the tumult of a great historical event . . . but also the small but heroic struggles of individuals living in the shadow of revolution and war.\" In her new novel, The Good Muslim, Anam again deftly weaves the personal and the political, evoking with great skill and urgency the lasting ravages of war and the competing loyalties of love and belief.In the dying days of a brutal civil war, Sohail Haque stumbles upon an abandoned building. Inside he finds a young woman whose story will haunt him for a lifetime to come. . . . Almost a decade later, Sohail's sister, Maya, returns home after a long absence to find her beloved brother transformed. While Maya has stuck to her revolutionary ideals, Sohail has shunned his old life to become a charismatic religious leader. And when Sohail decides to send his son to a madrasa, the conflict between brother and sister comes to a devastating climax. Set in Bangladesh at a time when religious fundamentalism is on the rise, The Good Muslim is an epic story about faith, family, and the long shadow of war.", "title": "The Good Muslim\n      \n          (Bangla Desh #2)", "url": "https://www.goodreads.com/book/show/11331177-the-good-muslim", "average": 3.64, "cover": "https://images.gr-assets.com/books/1348917288l/11331177.jpg", "reviews": 293, "authors": [{"url": "https://www.goodreads.com/author/show/429519.Tahmima_Anam", "name": "Tahmima Anam"}], "type": ["Fiction", "Cultural", "Historical", "Cultural", "Religion"], "outlinks": ["http://www.goodreads.com/book/show/11331177-the-good-muslim", "http://www.goodreads.com/book/show/25251129-the-good-muslim", "http://www.goodreads.com/book/show/9711586-the-good-muslim", "http://www.goodreads.com/book/show/19260956-the-good-muslim", "http://www.goodreads.com/book/show/12885816-the-good-muslim", "http://www.goodreads.com/book/show/15137199-the-good-muslim", "http://www.goodreads.com/book/show/823815.A_Golden_Age", "http://www.goodreads.com/book/show/29217381-the-bones-of-grace", "http://www.goodreads.com/book/show/20947700-six-shorts-2014", "http://www.goodreads.com/book/show/32188691-garments", "http://www.goodreads.com/book/show/32198538-bbc-national-short-story-award-2016", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}