{"ratings": 37036, "userreviews": [{"userName": "Rick Riordan", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/25375513-rick-riordan", "userReview": "I picked up this book after reading a thought-provoking article about the author in The Guardian: http://www.theguardian.com/books/2015.... I really liked what she said about coming to fantasy with no interest in maintaining the status quo. She's right that so many fantasy books are about restoring order to a kingdom, returning a rightful heir to the throne, or getting back to the good old days by defeating some dark power that threatens to unbalance society. Jemisin, as an African American female writer, says this simply doesn't resonate with her or interest her, and why should it? Instead, she writes science fiction which challenges those in power, threatens the ordered society, and questions whether the good old days ever existed. I like books that force me to rethink paradigms, so I decided to check out her work.The Hundred Thousand Kingdoms is a wonderful read. The first book of a trilogy, it introduces us to Yeine Darr, an outcast from the ruling family of Sky and the product of an unsanctioned biracial marriage, who is summoned home to the palace and suddenly made one of three heirs to the throne for reasons unclear. Soon she is locked in a cold war with her two cousins, both of whom have much more power and understanding of politics. But Yeine gains some powerful if unstable allies: the Enefadah, gods who were enslaved by the ruling family after those deities lost a war against the Lord of Light, the patron god of Sky.You know me. I can't resist a good book with gods knocking around, causing chaos among mortals. I loved the mythology Jemisin created, and how she turned the bright shiny castle with the glorious white king and the heavenly patron god into just about the most horrible place you can image. I'm looking forward to the next two books, though after that ending (NO SPOILERS, BUT WOW) I have no idea where she will go with the story!"}, {"userName": "Regan", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "3.5I dont even know guys"}, {"userName": "Patrick", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/922495-patrick", "userReview": "Very much enjoyed it. I have a great love of fantasy that does something a little different, and this book is a little different in a whole lot of ways.Good book. Recommended."}, {"userName": "Vinaya", "userReviewDate": "Feb 20, 2011", "userURL": "http://www.goodreads.com/user/show/4687823-vinaya", "userReview": "I think I may have read too much fantasy. I'm always apprehensive when I read a book everyone loved and can't get worked up about it. I was expecting this book to be radical and innovative and unusual. It wasn't.You've read this before.You're too harsh.This writing style- **********Makes no narrative sense. Seriously, what is it about this book I'm missing? What makes it worthy of being a Hugo and Nebula nominee? The choppy writing style felt weird to me- not because I didn't understand the transitions in time, but because there was no need for it. It felt more gimmicky than real. The plot line was standard, standard, standard. Orphaned warrior girl is thrust into the midst of a political war and named heir to her grandfather's kingdom, whereupon she falls in love with a god and finds out deep, dark secrets about herself. You want to know who wrote this plotline better? Trudi Canavan, that's who. Her Priestess of the White and the following books in the Age of the Five trilogy are teeming with gods and goddesses and deceit and political intrigue and romance and war and betrayal and life. The Hundred Thousand Kingdoms is a pale approximation of Canavan's vivid worldbuilding. Seriously, Australian authors kick ass, every time. The worldbuilding in this book was lacklustre. So many things were never explained; so many rules were pointless and unworkable. I never felt a strong connection with Yeine- so much of her time was spent wandering around aimlessly and hoping to bump into someone who would drop the information onto her lap. All the things we were told in the beginning- that she was a warrior, that she was the competent ruler of an entire nation, that she was trained by her mother in Amn ways... none of these things are actually reflected in her actions. And my other big pet peeve was with the whole sex scene. Seriously, all I got were weird allusions that weren't remotely moving or sexy. Mostly, I was going, WTF?!!! If sex with Nahadoth hadn't been built up to be such a big deal, I could have dealt with the way it was handled; as things stand, though, the description of the scene was florid and overblown and unconvincing. Don't get me wrong, I didn't HATE the book. It was interesting enough to have me reading till the end, but I know what good fantasy reads like, and to me, this book comes a poor second to the vibrant writing of authors like Trudi Canavan and Jennifer Fallon and even Melina Marchetta. Hmmm... they're all Australian, too!"}, {"userName": "N.K. Jemisin", "userReviewDate": "Aug 01, 2009", "userURL": "http://www.goodreads.com/user/show/2366515-n-k-jemisin", "userReview": "Just got the ARCs. Reading for typos and errors, and also for the thrill of READING MY BOOK YAY WHOA."}, {"userName": "Felicia", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/666892-felicia", "userReview": "Well, I really loved this book. Not since I've read Jaqueline Carey's Kushiel series have I been as enamored, in fact they are very evocative of each other, these series.I had no expectations of this book, in fact I've had an ARC copy by my bed for like a year and a half, and for some reason couldn't get myself to pick it up. I think the cover implies a more epic fantasy feel than it is, really it would appeal to most female-driven urban fantasy fans, but again, i guess it's smart not to slap a pretty girl on the cover and restrict yourself to just a female audience. Everyone can enjoy this book, the romantic arc is subtle and not cliched-ly prominent.But basically, this is a lovely fantasy with a strong female protagonist. Yes, she doesn't remain assertive and plot-driving as she should, and really that should have taken a star off, but the contemplative nature of the world-building, and layered motivations and mysteries involving the ensemble overcame that for me. I really felt like it was smart and avoided cliches. And I was totally hooked when the ending paid off SO WELL!Other series this is similar to are Sharon Shinn's Archangel series and Garth Nix's Sabriel. Highly recommended!"}, {"userName": "Carol. ", "userReviewDate": "Oct 03, 2011", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "[ and evil getting it's due  (hide spoiler)]"}, {"userName": "mark monday", "userReviewDate": "Mar 23, 2011", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "a pleasingly old-fashioned fantasy - and by old-fashioned, i mean the opposite of the dense, complicated, multiple perspective, incredibly epic mega-fantasies that have had the most popularity over the past couple decades. this is something different. the language is straightforward, for the most part, and certainly beautiful at times. although the mystery is a complicated one, and deals with rather large issues such as the making and unmaking of an entire world, it still feels somehow 'miniature'. for the most part it takes place within one setting: the fabulous floating city of Sky. it also deals with gods who are enslaved to mortals. and yet there is an almost underpopulated feeling to it - we get to know only a handful of Sky's denizens and only a handful of gods are introduced. at times, it felt like i was reading an adult fairy tale or a lengthy fable. despite a couple sex scenes, a couple graphic bits of violence, even intimations of rape and molestation, the novel somehow felt... quaint. and this is not a complaint. the novel was refreshing.i really liked the heroine: brave, sardonic, and no-nonsense. i also enjoyed the gods, especially child-god Sieh. loveable and strange little Sieh! a great character. many times when i've read about gods (similar to reading about aliens in scifi), i feel these are actually humans with unusual abilities - they talk and act and respond like humans. not so with Sieh, nor with the other gods. that is a true accomplishment. the mythology was complex in a way, but as with the best myths, there was also a simplicity there. the mythology was genuinely mythic, a far cry from the dungeons & dragons style of mythology that i've seen in many other novels. not many stereotypically human motivations appear when the actions of the various gods are described.overall it felt dreamy and arty and, somehow, minor note... and yet it is the first part of a trilogy describing the beginning and the ending and the renewal of all things."}, {"userName": "Bradley", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "I am and always will be a huge fan of Godpunk fiction.There's a bit of it floating around out there, but most of it is hidden behind the cloudy minds and bodies of mere mortals, only occasionally poking its bright sunny head out to dazzle and amaze.Sometimes it's the sun. Sometimes it's not. At the moment, I'm feeling the blaze.Fortunately for us, we've also got authors with great and deep understanding of the greater and lesser mysteries, the writing chops to pull off an entirely new mythos that can turn those mysteries into something brand new again, even if they've been so very, very old. Jemisin has taken us right back to our very beginnings, with the worship of the sun and the void and the great life goddess and given us a truly fantastic tale of revenge, freedom, and most importantly, of love.I sit in awe. I've been fortunate to read a number of really fantastic novels recently, and this one stands tall and proud among them, like a worldtree within a shining forest of worlds.The opening of the novel was unfortunately the weakest part for me, but I was able to feel our heroine's hopeless plight pretty much right away, enjoying her progression of defiance to acceptance as it all became so clear that her life was forfeit no matter what happened. Did I say enjoy? Actually, that part made me squirm quite a bit, but the fact that she was able to come to grips, retain her sanity, and even lose a little more of it in the process, was, in fact, truly enjoyable. I can't believe how tight the romance was, or how cleverly it managed to pull on my heartstrings. (I'm generally not that susceptible to romance on the page. So much of it is unbelievable crap.) In this case, I sank right into it and rooted for them both with all my heart. After finishing the novel, I can't quite see where else it might go except far away from the characters I've just enjoyed, but I've got the entire omnibus sitting right here. I was very satisfied by the end and truly floored by it. I almost want to leave it be and enjoy everything that this novel will eventually become to me.Can anything truly top this ride?"}, {"userName": "Stephen", "userReviewDate": "Apr 12, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "4.0 to 4.5 stars. I learned something while I was reading this excellent fantasy story by Ms. Jemisin that may seem obvious to most but still has changed my outlook on fantasy stories going forward. You see, I have always been a big fan of interesting world-building, compelling back stories and histories and unique magic systems and fantasy elements. The problem is that as you read more and more fantasy stories you start to recognize variations on all the well trod (and often trampled) ground and so it becomes difficult to find something that appears unique and ground-breaking and thus I have been somewhat selective in the fantasy series I have read and if the world/backstory/fantasy elements don’t have something that really catches my eye, I don’t rush it to the top of my reading list.With that said….here is what this wonderful book made me realize…. turns out I only THOUGHT that cool background elements were THE KEY components that drew me to read fantasy books. It turns out…and here is where everyone can smack me on the back of the head and say DUH!!!... it turns out that compelling characters and evocative writing and dialogue are the ESSENTIAL INGREDIENTS in all of my favorite stories and that the world-building, back stories and fantasy elements are just the SPICE that kick a really good story into the amazing category…BAM!! As I look at some of my all time favorite fantasy stories, most from very recently, they include: The First Law Trilogy by Joe Abercrombie (The Blade Itself, etc.), The Gentlemen Bastards series by Scott Lynch (The Lies of Locke Lamora, etc.) The Hari Michelson/Over World series by Matthew Stover (Heroes Die, etc.), A Song of Ice and Fire by George R.R. Martin (A Game of Thrones, etc.), The Fionavar Tapestry by Guy Gavriel Kay, American Gods by Neil Gaiman, and The Name of the Wind by Patrick Rothfuss, and my newest addition, the Troy series by David Gemmell (Troy: Lord of the Silver Bow, etc.). As different as all these stories are, they all have the following in common: (1) unforgettable main and supporting characters that draw you to the story and (2) superb, emotionally evocative writing (some poetic, some gritty, some dark and disturbing, some over the top and larger than life, but all of them MAKE YOU FEEL). Now don’t get me wrong, each of the series I mentioned above do in fact have superb world-building and back stories and that is probably what led to some of my inner confusion regarding what I was looking for in a great fantasy read. But then I had …..an EPHIPHANY. What would happen if STEPHANIE MEYER took over writing the next First Law trilogy from Joe Abercrombie? What if GRRM was unable to finish a Song of Ice and First and TERRY BROOKS was brought in to complete it? Thoughts like these caused me to lose sleep and drink WAY TOO MUCH. It also made me see pretty clearly (through blood shot eyes) that the writing and the character portrayals are what MAKE great fantasy and everything else is just a bonus. Conversely, a clever idea will not save poor writing in the execution of a story. Okay, having gone on enough about everything other then the book I am reviewing. how about I start including it in this discussion. Well, I THOUGHT THIS BOOK WAS TERRIFIC for all of the reasons that I explained above make fantasy great for me (see, there is a method to my madness). N.K. Jemisin writes beautifully and I was drawn to the main character Yeine immediately as she was smart, strong willed and self confident. Here is a summary of the back story (which I would hasten to add was excellent and very well done) and plot.BACK STORY/PLOT SUMMARY: In the beginning were 3 gods (for simplicity you can call them Order, Chaos and Balance). Well, by combining elements of Order and Chaos, Balance created the world as we know it and peopled it was humans as well as lesser gods. Eventually, the siblings squabbled and Order killed Balance and imprisoned Chaos (the how and why, I will leave to you to discover). Anyway, the story opens many years after the “god war” and the City of Sky is home to the Arameri who rule “The Hundred Thousand Kingdoms.” The Arameri were the most devoted servants of the god of Order and so he has given them the power to rule. This power is based on the ability of the Arameri to control and use the imprisoned god of Chaos and the lesser gods to do their bidding. These imprisoned gods (called Enefadah) are fully developed and realized individuals and are the most compelling characters in the story. Well the main character Yeine Darr, whose mother was the chosen successor to rule the Arameri and who instead abdicated and was exiled, is brought back to Sky in order to compete for the role of successor to the current ruler of Arameri (her maternal grandfather) and the intrigue, conspiracies, alliances and betrayals quickly ensue. So, overall, I found this to be a compelling first novel in what looks to be an intriguing new series. In addition, I will always be thankful to this story for being an effective catalyst in helping me see what it is I am truly looking for in a fantasy story. HIGHLY RECOMMENDED!!!"}, {"userName": "Rachel", "userReviewDate": "Oct 28, 2010", "userURL": "http://www.goodreads.com/user/show/4473627-rachel", "userReview": "This was a commendable first effort, but I cannot bring myself to rate it any higher. In view of all the positive reviews it has been receiving, I just expected more from this story, but, no, it fell completely short of expectations.The writing itself is certainly readable, but when it comes to portraying emotional turmoils, the author opts for \"Tell, Don't Show\" too often, so some scenes are filled with rather cringe-worthy descriptions of how a character \"feels\". The author might have been going for sensual, but because the writing lacks natural lyricism, it ends up seem forced than anything else. The world-building begins somewhat promisingly, but the exploration of that world ends up being more cursory than in-depth. The palace intrigues, also, begin with a promise of complex conflicts, but end up quite shallow, and a lot of the said conflicts are resolved via deus ex machina (literally) than through the strength of the nineteen-year-old protagonist.Not all of these issues are serious flaws (and I suppose things like world-building might occur in later volumes of this trilogy), so I might have enjoyed the story for what it is had the characters been more fully-realized. The protagonist, Yeine, does start off with lots of potential. She comes across as endearing and has strength of conviction and other right elements to become an interesting heroine, but in the end she comes off as a Mary Sue in all the wrong ways, especially when it comes to her romantic entanglements. The secondary characters were also imbued with attention-grabbing and flashy personalities, but none of them came across as truly genuine. I am sure I've read mangas with better character developments - actually, what with the detailed descriptions of characters' physical attributes, I did feel like I was reading manga in parts.It's possible I would have enjoyed the story better without the high expectation, but now that I have finished reading it, I simply cannot agree with all the glowing reviews. For years I've been reading as much as I could in this genre, so I know exactly what I want from a fantasy novel, and this, unfortunately, isn't it. Your mileage may vary, of course."}, {"userName": "Mayim de Vries", "userReviewDate": "Apr 04, 2016", "userURL": "http://www.goodreads.com/user/show/50424456-mayim-de-vries", "userReview": "If this is meant to be your first Jemisin book, go away. No, seriously, off you go. Read her masterpiece and only then come back for more. I am writing this thinking that should The Hundred Thousand Kingdoms happened to be my first encounter with Jemisin's writing, it would have taken a long time to approach her again (if at all). But the reversed order allowed me to see how much she matured and developed as a writer and I admire her for this even more.The plot is simple: a young woman is summoned to be officially recognised as an heir to her Grandfather, a de facto ruler of the world, who had previously disowned her mother due to a mesalliance. When she comes to the seat of power called Sky, she discovers not only the truth behind her mother's murder but also the fact that she is a pawn in a more sinister game between the people and the gods. The plot shows Jemisin \"obsession themes\", themes that she mastered in Broken Earth but only started playing within the Inheritance series. Admittedly, at times the book is a very clumsy playground.  First is her obsession with systems of power. The kingdoms are governed by something that could be called an authoritarian monarchy or perhaps a monarchist theocracy; the power is in the hands of one family called Arameri, and the status of each person within the family depends on blood (full, half, quarter and so on). Needless to say, Jemisin is a staunch believer that power corrupts and absolute power corrupts absolutely and vividly describes it in the book. We have exploitation, corruption, injustice, and institutionalised suffering including slavery, murders, pedophilia, and cannibalism performed in the full blare of authority. Welcome to the underbelly of humanity. On the other edge of the spectrum, there is a just matriarchy of the protagonist's indigenous nation, but I really had to laugh at the naivety and purely utopian quality of certain socio-political concepts (e.g. female superiority in the military). Truly, biology wins over ideology also in a fantasy setting. Secondly, the theme of race permeates Jemisin's writing. On the surface, it is not surprising given that the world is called the Hundred Thousand Kingdoms. But even then it is a bit too much for my tastes. Characters are constantly described and referred to via racial identity markers. Imagine something like: \"Asian eyes shone brightly in her pale Caucasian face although the unruly mess of her curls whispered of African ancestry. Only her smile remained Nordic in its coldness.\" Imagine something like that every second paragraph. I found this style tiring and I think I would find it unacceptable in contemporary fiction. Thirdly, Jemisin's writing is very sensuous. She does not shy away from all things body related. There is plenty of sexual references in her prose albeit not in a tacky Sarah J. Maas' way. This is fine (even if this pretends to be YA). What really bothers me is the way in which Jemisin explores threesomes. No, not love triangles, i.e. one of the most abused themes in literature, but polyamorous and transgender aspects of sexuality. I considered it ingenious in The Fifth Season where she truly created something new, instead of regurgitating offshoots of our mundane civilisations and moralities. However, The Hundred Thousand Kingdoms is basically a Greek Parthenon meeting the Christian Trinity with so many plotholes in the size of a maelstrom, that I huffed in exasperation very frequently. Finally, be warned that the plot is slow (Yeine comes to the Sky, wanders around, gallivants with gods, talk to few people, sleeps occasionally and weeps at times, discovers the truth and then proceeds to the grand finale), the narrative confusing and jerky (first person retrospective interspersed with short passages from outside the main current of the story), and the heroine problematic (a special snowflake alert). At least I had problems with warming up for her. Overall, a solid 3 stars, mainly for the rich texture of the world and a captivating intrigue. And also for Sieh.PS And if you liked Sieh, you need to try City of Miracles, a book of superior quality in every aspect imaginable. Also in the series: 2. The Broken Kingdoms3. The Kingdom of Gods"}, {"userName": "Brent Weeks", "userReviewDate": "Feb 01, 2010", "userURL": "http://www.goodreads.com/user/show/1741767-brent-weeks", "userReview": "[This review is based on an Advanced Reading Copy:]What if gods were real…and walked among us…enslaved…and were used as weapons…and were really pissed off about it?N.K. Jemisin is a gifted storyteller and The Hundred Thousand Kingdoms is a satisfying tale built on intriguing ideas. Buy this book if you love the flights of imagination only possible in fantasy. Buy it if you love stories of betrayal, murder, hard truths, and being in way over your head.The book is written in the first person. To be blunt, I usually hate this. Here, it works. There are scattered, apparent digressions: snippets of history, backstory. This may bother you. I thought it fit, and the digressions served a purpose. Though the story deals with politics at the highest level, the cast is small. For those who get lost and frustrated in a George R. R. Martin-sized cast, this is a boon. Jemisin's characters are clearly differentiated and easy to remember. Those who love additional complexity may wish the cast were larger and the book longer. This is the first book in a trilogy, so I'm sure we'll get to see more in later books. The world is fascinating, but we spend most of this book inside the central palace of Sky. The visuals are clear and cool.[Full disclosure: I have met Ms. Jemisin once, and she is published by the same company I am. However, neither she nor Orbit asked me to do this review.]N.K. Jemisin is a debut novelist who deserves the chance to write many more novels. But you don't care about that, and you shouldn't. The only question that matters to you is, \"Among all my other options, is THIS book worth my money and my time?\" Yes, and yes. Emphatically."}, {"userName": "Hannah", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/41788446-hannah", "userReview": "Books like this one are the reason why I read and love fantasy. N. K. Jemisin has a way of creating believable and exciting worlds that make me think about my own in a way that I haven't before. While the world in this series is (so far/ for me) not as impressive as the one created in The Fifth Season, it is still highly original and a wonderful basis for the type of stories she excells in.Set in a world where after a war between the gods some of those gods are enslaved by humans and one is revered, the main character, Yeine, is thrust into a court full of intrigue and subtlety and hatred when her estranged grandfather names her his potential heir. We follow Yeine trying to survive long enough to stand a chance to become Queen. She needs to learn who to trust and who to avoid, but mostly she needs to learn who she wants to be and where her loyalties lie. My absolute favourite part were the characters Jemisin created - Yeine is a wonderful example of how to create a heroine who is kickass without being abrasive, strong-willed without being a caricature, flawed without being unsympathetic, and most of all fully believable and somebody I just rooted for since the very first page. I love the relationships she forges, both with the imprisoned gods and with other humans living in the palace, but mostly I loved her relationship with Sieh - a trickster god so great he reminded me of Shakespeare's Puck Robin. Sieh is such an amazing and different character and Jemisin never lets you forget that he isn't human.So, yes. I loved it a lot. And I cannot wait to read the next book in this trilogy and I am beyond excited to see where this story goes next. N. K. Jemisin is fast becoming one of my favourite authors.____Having thought about this book some more, I have to give it five stars. Everything above still stands."}, {"userName": "Gergana", "userReviewDate": "Aug 23, 2011", "userURL": "http://www.goodreads.com/user/show/5312798-gergana", "userReview": "First read in 2010 Last read in 2016All images are drawn by me, for higher resolution visit gerynh.tumblr.comGODS! Yep, this series is about Gods.100 000 Kingdoms was my first \"what-the-hell-there-are-no-dragons-here-and-it's-not-Harry-Potter\" type of book. It was the first novel that introduced me to fictional politics and quiet mysterious dudes with power over darkness... that turned out to be one of my many many weaknesses...\n\n \n\n... damn you sexy shadow-wielding-men!There are a few reasons why you might enjoy this book:A. You're into mythology and legends, you like books about gods and their interactions with mortals.B. You're into philosophy, contemplating what would happen if part of humanity had control over divine powers.C. You would like to see another hot juicy romance between a simple mortal girl and a dude-controlling-shadows #437.D. You like the cover! (Best reason of them all!)~~~~~~~~~PLOT (Yeine's story)~~~~~~~~~~Imagine a world of a hundred thousand kingdoms... And one kingdom to rule them all. Muahaha!A kingdom that has actual Gods as slaves and the ruling family, the Arameri, can command them at will. This is the world of Yeine, a half-blooded Arameri and a leader of a small matriarchal tribe that is barely surviving in the jungles. One day she is summoned to the court of her grandfather, the King, in the city of Sky and named potential heir to the crown.Yeine Yeine comes from a tribe where women don't shy from battles and, as a leader, she isn't inexperienced in politics and back-stabbing. Yet, the whole situation doesn't make any sense to her: why is her grandfather interested in her now, after so many years. Why would he name her heir, when there are already two contestant competing for the crown. When Yeine arrives at the palace it doesn't take long for her to get in trouble with other Arameri and the Gods themselves. Sure, having a mass of darkness (aka. Nahadoth, the God of darkness) chase you around a floating castle, isn't an ideal first day for anyone, but Yeine soon manages to establish alliances with the majority of the Gods inhabiting the place, promising them freedom in exchange for their aid to become the next successor to the crown.~~~~~~~~~PLOT (The Gods' story)~~~~~~~~~~In this world of a hundred thousand kingdoms there is peace (most of the time). Wars cause too much chaos and change, something that the main deity of this world - Itempas, despises. Itempas - God of law, order and light.But it wasn't always like that.Long ago, there were three main Gods. Itempas - the god of law, order and lightNahadoth - the god (and sometimes goddess) of darkness, night and chaos. And Enefa - the goddess of twilight, dawn, life and death. One day Itempas, guided by jealousy and loneliness, slew Enefa and imprisoned Nahadoth and three of the children gods, to serve humanity. (More details in book 2 which is actually even better XD)Anyways, let's just say that most of the Arameri are kind of messed up in the head and even an ancient, all powerful and immortal being, such as the God of Darkness will do anything possible to \"misinterpret\" their commands and screw with them as much as possible. Nevertheless, it's not easy being a slave, being able to use your power only when you're commanded to and watching your children being tortured for centuries by the species you were part of creating.<Nahadoth~~~~What I liked~~~~The World - Sure, I can't say it was the most imaginative and complex fictional place I've ever been to, but it has its own charm. In terms of geography, it's nothing spectacular. The best part, of course, is the mythology and how the Gods fit into the whole story. It was interesting to see such powerful beings trapped into human existence, how people's mind can change when not even the majority of the Gods can oppose their will. Speaking of which...The Gods - They are massive, fathomless and incomprehensible. I loved it when they tried to act human for the benefit of Yeine (or when they were forced to by the Arameri), but then they would say or do something that will leave you feeling uneasy and shaky. Nahadoth is able to use only a fraction of his power during the night and you get a feeling that this book can only touch the surface of his character.Sieh - the God of childhood and lies, is probably my favorite character. He is the eldest of the godlings, yet, he appears (most of the time) as a nine-year old child - innocent, sweet and curious. Sieh is the first godling to befriend Yeine and he always tries to appeal to her motherly instincts. However even children are capable of cruelty and deceit. Sieh has planets and suns as his toys, he is capable of stealing away worlds and threatening to kill you in the most horrifying way. ~~~~What I didn't like~~~~Romance - the romance between Yeine and Nahadoth didn't really resonate with me. It wasn't bad, but I missed the emotional connection between the characters. The whole time, it felt like they were just using eachother to achieve their goals. And I liked that. I prefer to see them as friends with benefits ;)Yiene - I wasn't a huge fan of Yiene for some reason. She is supposed to be a strong and clever woman, but most of the time she spends running around and worrying about smaller things rather than looking at the whole picture. ~~~~The Final Verdict~~~~A Hundred Thousand Kingdoms is a unique, thought-provoking and imaginative book with intriguing politics, complex characters and sexy shadow-wielding-dudes ahem...amazing world-building. It's in my list of favorites and there is nothing I would love to do more than push this book in people's faces until they agree to read it. Unfortunately, I'm not an Arameri and I don't own any Gods to punish anyone who opposes my will...Would I recommend to a friend?My answer is... it depends. Do you like political fantasy (not too overly complicated)? Do you want a read a book about immortal, all-powerful beings trapped into human existence? Are you fond of romance (that didn't make a lot of sense for me, but it was still good). Do you have hundreds and hundreds of books in your tbr-shelf and wouldn't mind adding one more? If the answer is \"yes\" then go ahead. I hope you enjoy it as much as I did (hopefully, even more) :) More Recommendations:Books with sexy shadow-wielding-men:\n\n \n\nShadow and Bone by Leigh Bardugo is my favorite, A Court of Thorns and Roses is pretty popular too. Both are YA though, and focus more on the romance (which I didn't get, yet again).\nCloud Roads by Martha Wells - a book that was recommended by N.K. Jemisin and ended up becoming one of my top 5 favorites! It's unique and freaking amazing!"}, {"userName": "Chris ", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/1956959-chris", "userReview": "Original impression (April 2017): 2 stars - Meh...I'm burned out on spending a lot of time on stuff I don't want to spend time on.Revised impression (July 2017): 3 solid stars. It turns out this book wasn't finished with me yet. I thought I had put it behind me, but it kept creeping back to my mind and I couldn't help but want to see where it would go....All in all, I was pretty impressed by the end, and I might even continue the trilogy....if it calls to me again.."}, {"userName": "Matthew Quann", "userReviewDate": "Jul 04, 2016", "userURL": "http://www.goodreads.com/user/show/22699228-matthew-quann", "userReview": "Man, oh man, oh man, oh man...this book was PHENOMENAL.I honestly can't remember the last book that kept me so fastened to the couch, ignoring social calls and daily rituals just to read one more chapter. Okay, maybe just one more...you get the picture. This book is relentlessly fun, and for a first novel in a trilogy it moves at an unrelenting clip. I kept saying that I'd put the book down, only for the end of a chapter to beg a bit more reading. This book gave me a much needed defibrillation to my summer reading that has left me invigorated. The worst part? The trilogy collection sat on my shelf for months and months, always put off in place of a novel I thought might be more \"important\", challenging, or rewarding. I originally decided to pick up the trilogy for two reasons:a)Junot Diaz (a favourite author of mine) placed it on his world-building creative writing syllabus at MIT. A syllabus which highlights a diverse group of authors rather than just a bunch of white dudes. Check out that syllabus hereb)I got the entire trilogy omnibus for $13 or $15, which is a real steal for such a hyped fantasy author. But, as I mentioned, I kept putting the whole series off. Then, as I was finishing up with my last couple books, I decided to put my intended reading list on hold and test the waters with Jemisin's trilogy. If nothing else, I was sure that it would be a reprieve from the heavier stuff I've been into lately. As you may have already gathered, I couldn't get enough.Our story begins with a style that instantly caught me off-guard for a fantasy novel. First person narrative, sure. But the modern dialect and style? The asides directed (seemingly) at the audience? This book, right away, declared itself different from the pack. Yeine, a barbarian girl called from her country to live amongst her mother's royal family, gets to hang out with the gods. The rub is this: thousands of years ago there was a calamity and the gods were enslaved by Yeine's ancestors. Of course, there's a good bit of slavery going on with the general population in Sky, the city built for royals by their enslaved gods.Jemisin does something really great here: she makes a story about the myriad horrors of slavery using a really awesome fantasy narrative. As I was ripping through pages and Jemisin was battering down fantasy tropes, I had to pause every once and a while to admire the different type of story she was trying to tell. This book isn't all about sword fights, magic battles, and struggles for power (though there's that too). There's sex, thoughtful conversation, and a heroine whose strength demands to be admired. I was pleasantly surprised by Jemisin's ability to take what I worried would be a tired romance story and turn it into a series of cosmic, universe-bending sex scenes. It may sound crude, but Jemisin elevates the genre by touching on subjects and concepts that other authors shy away from, sex being just one of them.Of course, this is all stuff I love. I loved fantasy novels when I was growing up and I usually can take something from even the bad ones I read today. I mean, there's just something appealing about a dragon fight that doesn't need a lot of dressing up. But I can understand that not everybody has that same sense of nostalgia and affinity for a given genre. What makes The Hundred Thousand Kingdoms so great is that it refuses to play by the rules and tropes of fantasy, and instead offers a new type of narrative that feels important. The lore is unique, the writing modern and exciting, the characters vividly imagined (Nahadoth and Sieh stole entire scenes for me), and Jemisin's traded a pseudo-medieval Europe setting for something completely different. So, I totally recommend this one. I haven't had this much fun with a book all year. I loved uncovering the secrets of Yeine's family drama, I absorbed the history of the gods, and thoroughly enjoyed the Hogwarts-as-torture-castle setting of Sky. The story also ends in a way that sated my hunger for the story and characters but also, in a cute bit of narration, promises more to come. So, you could read this one and move on, but with such a cheap omnibus, why not keep on with it? I'll be reading the rest of the trilogy over the summer, using them as breaks between some of the more obtuse writing I have ahead of me. But enough time spent with me and my review. You've all got a book to read."}, {"userName": "Geoffrey Dow", "userReviewDate": "Feb 27, 2011", "userURL": "http://www.goodreads.com/user/show/1081264-geoffrey-dow", "userReview": "For the record, my copy of N.K. Jemisin's The Hundred Thousand Kingdoms came courtesy of a contest conducted by the writer Tricia Sullivan, whose novel, Maul, I read a few years back and which which has since stayed with me far more strongly than most. I wish I could say the same about The Hundred Thousand Kingdoms.\nStormwinds over a cardboard world:\nNebula-nominated first novel is epic failure\nI opened N.K. Jemisin's (now Nebula Award nominated) first novel, The Hundred Thousand Kingdoms, having occasionally read the author's blog and commentary elsewhere on the internet, and was well-aware the book had been getting a lot of positive attention since it was published last year. In other words, I was looking forward to reading at least a very good debut novel and hoping for even more than that.Instead, I find myself obliged to discuss a first novel about which I can find almost nothing good to say whatsoever — except to note that, on page 222, the author offers a striking and (I think) original metaphor for the female orgasm.The Hundred Thousand Kingdoms is a novel remarkable only for the lack of detail and verisimilitude of its world-building, the droning sameness of its characters (god or human — you can't tell them apart), the thoughtlessly anachronistic dialogue and banality of its prose.The Hundred Thousand Kingdoms is not the worst novel I've ever read (there are lots of bad books out there), but it might be the worst highly-praised science fiction novel I've ever come across (I say \"might\" because it has been many years since I read \nLord of Light\n).The basics include a number of standard fantasy tropes. A world not quite our own, shared by humans and a more ancient and powerful race; a heroine with a Special Destiny; a society with a pre-industrial technology (plus magic) and a feudal political order with a cruel and corrupt extended family at the top of the heap.There's nothing inherently wrong with re-using the familiar to tell a story, but there is a lot wrong with using those tropes so badly the reader never feels they are looking in on another world, let alone that they have actually entered into what Tolkien called a secondary creation.For a fantasy to succeed, it must convince the reader of not only the reality of its narrative but of that narrative's background. The author must pay attention to such things as his or her world's history and culture, to its tools and technology, as much as to character and psychology.To my ears, neither Jemisin's world-building nor her character-building convince, let alone provide cause to care. Worse, her prose is sophomoric and her dialogue painfully melodramatic.I did not answer, and after a moment Scimina sighed.\"So,\" she said, \"there are new alliances being formed on Darr's borders, meant to counter Darr's perceived new strength. Since Darr in fact has no new strength, that means the entire region is becoming unstable. Hard to say what will happen under circumstances like that.\"My fingers itched for a sharpened stone. \"Is that a threat?\"\"Please, Cousin. I'm merely passing the information along. We Arameri must look out for one another.\"\"I appreciate your concern.\" I turned to leave, before my temper slipped any further ...These are not words that sing, nor dialogue that breathes. Is there anything in this book that does? Click to read more."}, {"userName": "Laz", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/22313662-laz", "userReview": "“We can never be gods, after all - but we can become something less than human with frightening ease.”\nSuch a pleasant, pleasant surprise. I loved this so much.There may be some minor spoilers in this, so, go ahead & read at your own volition. No big, spoily spoilers, though! Just explaining things a little.I'm not sure where to begin. Should I may begin by how much well-written this was? N. K. Jemisin is one hell of an author, that is most certain. It was detailed without being tiring, it had many characters & each of them was well-made. I loved the world, it was nicely-crafted. The history was breathtaking & I loved every part of it. From Godswar to how it all came down to the Enefadeh being prisoners of the Arameri.Yeine Darr is an Arameri. Her mother was one & she's one by inheritance. She's called to the 'Sky' (a floating palace, that's a sight to build in your head) by her grandfather who's, in a way, the King though the Hundred Thousand Kingdoms are not ruled by just one person. There we'll see what a nice person her grandfather is & I'm sure you'll all despise him. Yeine is one of the three contenders for her grandfather's position. Two cousins of her are also in the run. The problem is that she is in danger, from the moment her grandfather got her in the competition. Her cousins are dangerous & will stop at nothing to destroy - kill - her.In her first day at the palace she meets the Gods. Let's go back a minute. It all stars when the God of Light, the Bright Itempas, killed Enefa, the Goddess of Twilight & Dawn & punished his brother, the Nightlord, Nahadoth & all the lesser Gods by confining them in human bodies. Let's just say that all the Gods, except for Bright Itempas, are bound to do whatever the Arameri want & must obey them at all costs. Scimina, Yeine's cousin, unleashes Nahadoth, one of the Three & the firs to be created for he is the very embodiment of darkness & chaos, & another God, Sieh saves her. Sieh is the God of Mischief. Yeine, at first, isn't even aware of who they are but when the feeling sinks in & they make her an offer she has to decide whether she should side with those who are prisoned or those who want to kill her. Though, the decision is easy to make she must not be quick to do so because she really doesn't know why the Enefadeh want to assist her.I won't delve more into this. I'll just say that Yeine is an amazing character & I loved her thoughts & I loved being inside her head & I loved the relationship she built with all of the Enefadeh, how she loved them & found friends & lovers in them. The romance was not a usual one, it was unusual, it was all about attraction & lust at first & it felt kind of weird but then I grew accustomed to it & the romance showed itself. From the Gods, I must say I loved Nahadoth the most. He was just so mysterious, he had so many aspects. He has lost all of his compassion towards any human and he's vulgar & hard at first & it's difficult to understand him. He's all kinds of fucked-up & there's so much to him. Including how at night, when the sun goes down, he goes into full kickass mode & loses every bit of humanity he has during the day. It's nice to see how Yeine gets through to him. Also, Sieh, that little boy-man, may be the cutest thing ever. He always wanted to hug & cuddle & he developed the most beautiful friendship with Yeine.The ending was satisfying & I can't wait to get into the second book & read more of this amazing, broken world & the characters. Don't be doubtful about reading this. Just grab & read it, I'm sure you'll relish this. Thanks for reading my review, bookworms. :)"}, {"userName": "Janina", "userReviewDate": "Nov 12, 2010", "userURL": "http://www.goodreads.com/user/show/3455554-janina", "userReview": "What did I expect from The Hundred Thousand Kingdoms? Honestly, I can’t tell. When I saw the translation of book two in a German bookstore some weeks ago, I simply was drawn in by the blurb on the back of the book. It sounded like a stand-alone – or at least like the first book in a trilogy – so when I went looking for the English version, I was surprised to find out that it was in fact not. Now, the summary of book one didn’t sound as intriguing to me at all, but I figured I would maybe not be able to enjoy the second instalment in its entirety if I didn’t read it. Let me tell you, the summary does not do this novel justice. It makes it sound pretty average in the field of epic fantasy:Parent dies under mysterious circumstances? Check.Heroine is thrust into a completely new and unfamiliar situation? Check.Heroine is presented with a seemingly impossible challenge? Check.You don’t know who is to be trusted and who plays fair? Check.And, most importantly, the summary includes the words political intrigue or power struggles? Check.But The Hundred Thousand Kingdoms is anything but average. It is fresh and original, and surprisingly different. I really don’t want to say too much about the actual plot because I think it’s best to go into this book not really knowing what to expect. I have to admit that some concepts were a bit difficult for me to grasp, to relate to entirely, but nevertheless, I enjoyed this book immensely.A special trait surely is the narration. The book is told in first person, as a kind of giant flashback with shifts in time every now and then. The style is somehow informal, with Yeine, the main character, addressing the reader directly from time to time. There are hints at what will happen later, dreams and conversation with unknown people thrown in where they don't seem to fit, flashbacks to events some days previous. So yes, I think you can kind of get an idea of what happens in the end, but for me those passages were a little too cryptic to figure out. They are clearly distracting and might leave you more than a little confused – but I think they are meant to be that way.Even though the full potential is not always realized, this novel is amazingly carved out in both characterisation and world building for a debut. It clearly differs from the We-are-on-an-important-quest-to-rescue-mankind-so-let’s-be-solemn-and-stern kind of books to be found in the genre. It represents more an inner struggle than an epic war fought out on the battlefield, but for me that was just right. I tend to get bored by battles pretty quickly. Also, you won’t find any characters here that are only good or only bad. Mostly, they are refreshingly ambivalent.Recommended for everyone looking for a different kind of fantasy who is not weirded out by the idea of gods and mortals mingling – in every possible sense ;)."}, {"userName": "Kells Next Read ", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/44081906-kells-next-read", "userReview": "My Ratings This was my first read from N. K. Jemisin and I can safely say this about her writing style: My head is still fried from this mind blow of a read. The characters, storyline and world building is fantastic. I can't think, write or speak properly at present. I will most certainly have to come back at a later period and ramble about this book. For now:"}, {"userName": "Alex Ristea", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/1669785-alex-ristea", "userReview": "I haven't read fantasy with such a sense of wonder in ages.The Hundred Thousand Kingdoms is simply a delight to read. Everything from the characters to the setting and magic is beautiful. The language is lyrical, and yet not so dense that you become lost. In some places, it's honestly like reading poetry.Forget the rules-based magic we've come to love from Sanderson and Weeks, and dive into a story of gods and betrayal with a deep current of mysticism throughout.(Also, how fantastic to see a non-male, non-white protagonist shine).It's one of those book you know you'll be re-reading and cherishing for years to come. I highly recommend it as an essential for any fantasy aficionado's collection."}, {"userName": "Rusty's Ghost Engine (also known as.......... Jinky Spring)", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/21530568-rusty-s-ghost-engine-also-known-as-jinky-spring", "userReview": "DNF @ 155 pagesOne of the most boring fantasy books ever that focuses almost entirely on politics.RTC"}, {"userName": "new_user", "userReviewDate": "Nov 09, 2009", "userURL": "http://www.goodreads.com/user/show/1365355-new-user", "userReview": "N.K. Jemisin approaches empire in her epic fantasy debut, The Hundred Thousand Kingdoms. Laura Resnick (\nIn Legend Born\n) conceived of conquered Silerians, but few authors discuss the national, political and local effects of imperialism, fearing bored readers and infodumps. Jemisin's subtlety indicates a social awareness, an appreciation for PR vs. reality, biased histories, and mistrust of power.\"Once, like High North, Senm was also a land of barbarians, and the Amn were simply the most successful of these. After the war they imposed their barbarian ways on the whole world and judged the rest of us by how thoroughly we adopted them...Amn now rule the world. I'd have enjoyed more focus on these barbarians, many years later, advertising themselves as civilized and superior and inflicting their values on the 100,000 kingdoms. Instead, first-person Kingdoms follows Yeine, reluctant heir to the throne, in palace Sky for two weeks, and sometimes romance overwhelms the rest, but so does cutthroat intrigue-- and I'm okay with that.Yeine leads Darre, an Amazonian kingdom. She's no stranger to harsh, pragmatic politics, but Sky's schemes are another animal. Yeine's aim? Nothing so simplistic as overthrowing \"evil\" rulers. She's trying to stay alive. However, while assassination is not unheard of in Jemisin's realistic world, her Amn fight more subtly, surreal in their cruelty. Some readers may have trouble connecting to a tale populated by only gray characters. No one's the white knight, even Yeine.I enjoyed Yeine's intrigues and the mystery of Sky's history, Jemisin's characterizations, Kingdoms' mythos, but I wasn't convinced of Yeine's romance with a god. Something unequal there?By turns compassionate, sexay, alien or wrathful, god of night Nahadoth's always angsty. LOL, JK. (Remember Bishop's Black Jewels? Oh, his pain! His pain! Don't you feel his pain? Also similar: the primacy of female characters. It's only obvious in Darre, but Jemisin's male characters are all passive.) He's cool. My friend Ariana compares him to Neil Gaiman's Morpheus character from the \nSandman\n comics with shadows curling from his black hair and cloak. Also, 5000 pts. for a non-white heroine and a non-Eurocentric setting. Jemisin's fictional patchwork of nations speaks to an East Asian influence of Jemisin-invented cultures and gods -two gods plus kids, with their meddling, jealousies and balance of power. Readers will like the misunderstood villain/bad boy/underdog, and I liked the theme of popular beliefs vs. reality, but the romance subplot took precedence too much for me. That said, I can't resist a blind hero or heroine, so I'll have to read \nThe Broken Kingdoms\n! Kingdoms can be read as a standalone."}, {"userName": "Emma Deplores Goodreads Censorship", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/5229326-emma-deplores-goodreads-censorship", "userReview": "This book had a lot of hype when it was first released, followed by a backlash that seemed primarily motivated by the fact there is romance in it. Now that I’ve gotten around to reading this, I did not enjoy it, but that had less to do with the fact that the protagonist hooks up with a dark god than that the story just isn’t very interesting.Yeine is a young woman who travels to a distant land and gets caught up in court politics over her head – standard fantasy stuff. The story is told through Yeine’s first-person narration, looking back on events, and her voice is the one aspect of the book I sort of liked. On the one hand, it is strong and assured, and the digressions and circling back to add new information and asides to the reader give the sense of a person actually telling a story. On the other hand, this voice – reflective, detached, polished – clearly belongs to a writer, while our 19-year-old Yeine is supposed to be the warrior queen of a female-dominated barbarian tribe.I say “supposed to be” not only because she doesn’t sound anything like that, but also because she doesn’t act like it. In her actions she is astoundingly passive, a Generic Female Protagonist used as a pawn by everyone around her, who spends most of the book waiting for events others have set in motion. Such passivity not only leaches interest from the story, but prevents me from even classifying it as epic fantasy. The defining characteristic of that subgenre is a struggle between good and evil. There’s evil here, thanks to the gratuitous acts of brutality that are apparently required in all fantasy novels in the Game of Thrones era (I say this as someone who loves the Song of Ice and Fire series, but could do without the often out-of-place attempts at grittiness in every other fantasy novel). But there’s no struggle. Yeine doesn't try to fight back. She's an object of others' actions, lacking goals of her own; she quickly gives up even on the modest aspiration of surviving her royal family’s backstabbing, hoping only to accomplish with her death an act suggested to her for their own benefit by some characters she’s just met, who have then agreed to assist her people, who are never even introduced. Now tell me that sounds like a rousing plot.Other than Yeine, there are fewer than a dozen characters in the book, most of whom are plot devices with at best one character trait. And although there are supposedly a hundred thousand kingdoms, all the action takes place in the bland, white imperial city of Sky. Jemisin develops the world’s mythology, but not its present; there’s no sense of life in it. Back to poor Yeine: she’s supposed to have come from a matriarchal society in which the government and army are all female, but upon arriving in Sky, where almost everyone in power is male, has no reaction to or comment on this difference. An easy mistake to make in a setting lacking sufficient culture for anyone to be a convincing product of it.Yes, you can find fantasy much worse than this, but I found nothing here to hold my attention: not the plot, not the characters, not the world. I’m glad other readers enjoy Jemisin’s work, but after reading a book and a half (the half was The Killing Moon, which I finally set aside because while technically better than this one, it had not inspired even minimal interest), I have to conclude that it is not for me."}, {"userName": "Ashley", "userReviewDate": "Dec 31, 2010", "userURL": "http://www.goodreads.com/user/show/1343864-ashley", "userReview": "You can always tell when you come across something and know you've never quite read anything like it before, because afterwards, your brain won't know quite how to file it away. It has to create new paradigms to fit stuff into. I was in that stage for quite a while after reading this weird, sensual, dark, joyful book.Our main character Yeine lives in a world where belief in the gods is not an option. The gods walk among them. It's a world where one nation, the Arameri, have all the power because 2,000 years before when the God's War sundered their world, they landed on the winning side. There are many gods and godlings, but only three main gods. The winning god, Itempas, killed his sister, who had betrayed him, and now imprisons his brother and the children who fought on their side. It is this that makes the Arameri powerful. Itempas gave them the defeated gods in human form, imprisoning them at the will of the Arameri. For 2,000 years they are used as playthings and world-destroying weapons. Yeine's mother was Arameri, but was exiled when she married Yeine's father, a man from a \"barbarian\" culture. But now Yeine's mother has died under mysterious circumstances, and she has suddenly been made heir to her grandfather, the leader of the Arameri. Yeine is thrust into a fraught situation with very little knowledge, and has to play power games and figure out the complicated mysteries of the Arameri and their godling playthings in order to survive.The whole thing turns into this mystical, surprisingly sexy, twisted journey of spirituality and power, and it was soooo hard to put down. It was also really weird, and in parts, I had to keep reminding myself it was fiction so my brain would calm down. Jemisin has a beautiful way with words, and the characters she creates feel very real. She also peoples her worlds with diverse cultures and races of people, and her world is one of fluid and surprising sexuality. If you're a fantasy fan and you haven't tried this series yet, I highly highly recommend that you do. It's epic in a way I've never seen fantasy be epic before. I am definitely a fan of this author now (especially after reading the second book in the series, which was my favorite)."}, {"userName": "Sarah", "userReviewDate": "Sep 18, 2015", "userURL": "http://www.goodreads.com/user/show/23841736-sarah", "userReview": "3 stars, but with a lot of promise. I keep arguing with myself about this rating! The fact is that in my eyes it reads very much like a debut novel. There were some things about the character that I felt didn't mesh quite right and her mood swings rivaled the worst YA novel. She talks about her training that helps her not betray her emotions and thoughts on her face but then she spends a lot of time arguing and yelling and thirsting for revenge. She's a warrior and a chieftan, at the ripe old age of 19, but she's incredibly emotional. And Jemisin seems to have the character going in two directions here. It's puzzling. Overall, I'm seeing a debut novel that shows that the author has a great deal of potential. I think that her secondary characters were actually done really well. Nahadoth, Sieh, T'vril, and the thoroughly pschyo Scimina. These characters were pretty cool and were definitely the ones I liked most. Also, the story seemed to be treading water occasionally.I did listen to the audio and initially I thought that there was a poor narrator/story match up, but I actually think that she may have highlighted some of the flawed areas rather than creating them. The narrator was a good match for the character but the character was oddly written. I'm going to continue the series, or at least the second book, but I wasn't quite as thrilled as I would have expected.ETA: I'm remembering this as a two star book.ETA 04/23/17 Downgraded to two stars because I remember it as iffy and slightly annoying."}, {"userName": "Tatiana", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "Just not connecting with it (again, second try). This novel seems to lack something that The Fifth Season has in abundance. Originality? Agency? Unpredictability?"}, {"userName": "Zoë Marriott", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/1975715-zo-marriott", "userReview": "N.K. Jemisin's debut fantasy novel is...well, it's something completely different. I've only been this absorbed in, disturbed by and utterly delighted with a book a very few times in my life - I read it in one day and two days later my head is still buzzing with it. And I don't think a single person that I've emailed or spoken to in the past two days has escaped without hearing me rave about and recommend this story.THE HUNDRED THOUSAND KINGDOMS is an exquisitely written fantasy which harks back to ancient works of epic myth in it's scope and subject matter. The cast of characters, both mortal and godly, is profoundly well realised - the kind of characters who are both completely knowable and completely unpredictable, just like real people. The world is stunning; richly textured, nuanced and so original that I wanted to get lost there and not come back for years.This book does not flinch from darkness, death or pain. The characters who you will love (and you WILL love them) the most are the ones who often do the most awful things, and the author's skill is in making this appalling without ever offering excuses, or detracting from the sense of empathy you feel for them. There are no easy answers to be found in this story, and you'll probably find yourself disturbed at the cunning way that you're tricked into moral ambiguity about the characters actions. One of the things I adored most in the book was the depiction of the captured gods, or 'Enefadah'. So many fantasy novels contain supposedly inhuman characters (immortal or immensely long lived dragons, elves, gods) who, in fact, have no sense of inhumanity at all. They appear as nothing more than humans with a longer sell-by date (for instance, the otherwise excellent work of Tamora Pierce). Other writers make their immortal creatures inscrutible and distant, and thereby preclude any sense of understanding them (the brilliant Lois McMaster Bujold). N.K. Jemisin is the first author who has ever managed to show me a God who was both moral and amoral, human and Godly, terrifying and pitiable, vulnerable and invulnerable. I was enthralled. What an achievement!If you are looking for typical epic fantasy, complete with heroic heroes, predictable quests, evil overlords and black and white morality, do not read THE HUNDRED THOUSAND KINGDOMS. But if you are prepared for something experimental and new, something lushly romantic, something which plays with gender stereotypes and ideas of heteronormality, and which contains a truly diverse cast (including a protagonist who is a woman of colour, whoo!) then I exhort you to find yourself a copy of this book. And now...I'm off to read it again!"}, {"userName": "Jodi Meadows", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/4011205-jodi-meadows", "userReview": "This one has been on my radar since it came out in 2010, but a friend repeatedly fangirling over the series tipped me over the edge. I listened to the audio on a long drive over the weekend.The narration was absolutely fantastic, and the story was even more wonderful. I loved the expansive worldbuilding, the complicated politics, and how BIG everything felt. This is a story that will stick with me."}], "description": "Yeine Darr is an outcast from the barbarian north. But when her mother dies under mysterious circumstances, she is summoned to the majestic city of Sky. There, to her shock, Yeine is named an heiress to the king. But the throne of the Hundred Thousand Kingdoms is not easily won, and Yeine is thrust into a vicious power struggle.", "title": "The Hundred Thousand Kingdoms\n      \n          (Inheritance Trilogy #1)", "url": "http://www.goodreads.com/book/show/6437061-the-hundred-thousand-kingdoms", "average": 3.82, "cover": "https://images.gr-assets.com/books/1303143211l/6437061.jpg", "reviews": 4096, "authors": [{"url": "https://www.goodreads.com/author/show/2917917.N_K_Jemisin", "name": "N.K. Jemisin"}], "type": ["Fantasy", "Fiction", "Romance", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/6437061-the-hundred-thousand-kingdoms", "http://www.goodreads.com/book/show/6612542-the-hundred-thousand-kingdoms", "http://www.goodreads.com/book/show/7901864-the-hundred-thousand-kingdoms", "http://www.goodreads.com/book/show/18459417-the-hundred-thousand-kingdoms", "http://www.goodreads.com/book/show/19161852-the-fifth-season", "http://www.goodreads.com/book/show/26228034-the-obelisk-gate", "http://www.goodreads.com/book/show/31817749-the-stone-sky", "http://www.goodreads.com/book/show/7904453-the-broken-kingdoms", "http://www.goodreads.com/book/show/7923006-the-kingdom-of-gods"]}