{"ratings": 17934, "userreviews": [{"userName": "Lisa", "userReviewDate": "Jul 07, 2009", "userURL": "http://www.goodreads.com/user/show/929683-lisa", "userReview": "Let me preface my review by acknowledging that the tips and tricks described in this book will probably be of great use in calming my baby when I have a newborn. And, if this book were, say, a seven-page article in a magazine, I would rip it out, keep it for reference, and recommend it to friends. The problem is that this is not a seven-page article. It is a 260-page book. 260 pages of fluff, filler, and drawings. 260 pages to essentially inform the reader that calming a newborn takes \"the 5 S's\" (swaddling, side/stomach positioning, shhh'ing, swinging, and sucking). How does one turn seven pages of material into a 260-page book? Oh, it's easy. First, fill the book with nonsense. Here is an actual quote from the book: \"I think a breast-feeding mom should be called Galactic Goddess!\" No, really. Actual quote. Second, use obviously-fictional \"testimonials\" from parents who have succeeded with your technique. My favorite is the one about the father who was so good at swaddling that, when he was at work as a lawyer, and his clients brought a screaming baby to the office, he was able to calm the baby in moments. Answer me this: Who the hell brings their screaming baby to their lawyer's office??? Oh, and let's not forget the \"testimonial\" from the Russian immigrant. She tells the author, \"You don't have to show me dat. In my willage, we wrap dem and put BELT around. It holds dem wery good.\" In case you missed that she is a Russian immigrant, the author makes sure to underline \"dat,\" \"willage,\" \"dem,\" and \"wery\" so that you, the reader, can't miss it. Oh, those crazy immigrants with their crazy accents! So many times, I wanted to hurl this book across the room. I only finished it (a) because my husband insisted, and (b) to better be able to rant about it. Apparently, there is a DVD. This is perhaps the only time I would recommend the movie over the book."}, {"userName": "Ryan", "userReviewDate": "May 09, 2008", "userURL": "http://www.goodreads.com/user/show/754138-ryan", "userReview": "I will save you the 336 pages: suck, swaddle, shush, side position, swing. Wow, 5 Ss. That's inventive.4 years of medical school and better than 4th grade writing skills can generate a book like this. You know what? Forget it: Just make your last name MD. Have someone fill in the sources and make the book run a bit over 100 pages. The fact that Americans (including myself) are looking for instructions allows tripe like this onto the bookshelf to sell millions of copies. It's also why serious literary talent like Mark Leyner will probably never write a postmodernist masterpiece like Tetherballs at Bougainville again: because his medical book, Why Do Men Have Nipples, coauthored with another MD (Billy Goldberg) sold more copies than all of his real masterpieces combined. You know what? James Joyce's literary masterpiece, Ulysses, has fewer stars than this piece of crap. Is there no God?!?!"}, {"userName": "Carrie", "userReviewDate": "May 26, 2009", "userURL": "http://www.goodreads.com/user/show/199635-carrie", "userReview": "I saw this doctor on Oprah YEARS ago... I remember that the audience was full of QUIET, contented babies and I wondered if they were all sedated.The premise is that human babies are born 3 months BEFORE they are really developed because of the size of their heads. Therefore, the fist 100 days of their life is virtually a \"fourth trimester\" in which the baby needs constant vigilance and caring.He offers \"cuddle cure\"... 5 steps done in sequence to calm a baby and simulate life in the womb: Swaddling (firmly), Side/Stomach, Ssshhhing, Swaying, Sucking. They are combined and should match the VIGOR of any crying to immediately pacify the baby.Actually... this all made sense to me and most importantly.... IT WORKS!Author: Harvey KarpPublisher: Bantam DellCopyright: 2002Genre: Parenting/ChildcarePages: 260Date Read- 5/21/09 to 5/26/09p.100The FASTEST way to succeed in stopping your baby's cycle of crying is to MEET THEIR LEVEL OF INTENSITY. Only after your screaming baby pauses for a few moments can you gradually slow your motion, soften your shushing and guide them from frenzy to soft landing.The best colic-calmers say that soothing an infant is like dancing with them in the lead. These talented people pay close attention to the vigor of ther 5 \"S's\"p.1251st S- SwaddlingThis TURNS on the calming effect by stopping the Moro reflex (hand jerking/flailing) that helps them to pay attention to the other S's.2nd S-Side/StomachLay your child on their side or place them in your arms on their stomach. This prevents them from feeling that they are falling.3rd S- ShhhhYou have to do it as LOUD AS YOUR BABIES CRY and close to their ear. It stimulates the sound of the womb. It can be replaced by white noise.4th S- SwaySupport your babies head and neck and wiggle their HEAD with fast, tiny movements (like you are shivering). Once they are entranced, you can move to a slower swinging motion.5th S- SuckingThis works best after the other S's have calmed. A finger or pacifier work and can be eliminated after the 3rd month.p.195Baby Massage.In a 1986 study by Tiffany Field, massaged babies gained 47% more then babes who did not have the same touch. The same babies had higher IQ's a year later.1. Prepare for pleasure. Warm the room, dim the lights, play soft music.2. Bring Yourself to the moment. Sit comfortably, take 5 slow deep breaths and allow yourself to be present for the experience. Its an exchange of love in one fleeting, tender moment of time.3. Speak to your baby with your hands. Always try to keep one hand in contact with the skin and talk to them about what you are doing and what your hopes are for their life, or sing a lullaby. Let your massage strokes move in synchronicity with your calm breathing.4. Reward your babies tummy. Bicycle their legs then firmly push both knees to their belly and hld them there for 20 seconds. Massage the tummy in firm, clockwise, circular strokes - starting at their right lower belly, up and across the top of their tummy and ending at their left lower side (this traces their colon and intestines) 5. Follow you baby's signals. p.245Top 10 survival Tips for Parents of New Babies1. Trust Yourself. You are the Latest in the Unbroken Chain of the World's Top Parents.2. Lower Your Expectations.3. Accept All the Help You Can Get4. Get Your Priorities Straight: Should You take a break or do the dishes?5. Be Flexible. It is better to bend than snap.6. Know Thyself. Share how you are feeling.7. Don't Rock the Cradle to Hard. Know when to take a break.8. Keep Your Sense of Humor Handy9. Take Care of Your Spouse10. Don't Ignore Depression."}, {"userName": "Adam", "userReviewDate": "May 20, 2008", "userURL": "http://www.goodreads.com/user/show/37501-adam", "userReview": "There's quite a bit of filler in this, I think it could have been about half the length or less, and the publisher was looking for an excuse to charge the full 12.95 or whatever a book costs nowadays. That said, THIS BOOK IS MAGICAL. As a new parent, I don't know what I would do without this book. Swaddle, Side, Sway, Shhh, Suck. There be magic in them words, and while I'm up at 1am writing this review, my baby is quiet, if not asleep enough to lay down on her own. I'd be ripping my hair out instead of writing this if it weren't for the wonderful wizard Dr. Karp.Three cheers, and 4 stars only because of the filler."}, {"userName": "Brian", "userReviewDate": "Mar 16, 2011", "userURL": "http://www.goodreads.com/user/show/145381-brian", "userReview": "Hopefully the techniques are more effective than the style  There's a lot of unnecessary fluff trying to convince you of the 'calming reflex' and the 'fourth trimester' idea. Skip the first 75 pages. \n   VERY repetitive (how many times must he remind us that \"he had this type of stimulation 24 hours a day IN the womb, what you're doing now is a big decrease\"?--apparently, this is written in the context of a society that is afraid of spoiling 3 month-olds by soothing them, which was news to me. \n   Off-putting overly enthusiastic and conversational (in the motivational speaker sort of way) style, but probably like many of these mothery books \n   Really disruptive quotes from parents, outdated (like 18th century) parenting guides, and famous people that are inserted in random places in the middle of text. They do not add anything other than occasional humor but mostly frustration (I don't trust anecdotal 'evidence' by nature). The book would be better without them, though only 1/2 the length. Oh, same for the silly cartoons.\nBut HOPEfully, the strategies and techniques work (that's why I'm not giving it a 0.5), but I wouldn't discourage you from getting the meat of the book from another source and skip the read. Borrow it from someone and see which pages they dogeared or something. After I endured the text, I've marked the relevant pages so I can convert the book to a more palatable (and concise) reference. For those of you with the paperback 2003 edition, see the following pages:  23: determining why your baby's crying \n   115: how to swaddle \n   126-127: really, this is the book summarized. I guess he put it in the middle so the book can stay open to it. You can get away with just these two pages (I'm not suggesting you break copyright and photocopy it yourself, nosiree!) \n   134: some ways to hold baby to soothe him/her \n   187: the progression: try one technique, add another, add another till he calms down \n   194: infant massage \n   217: weaning off the soothing techniques"}, {"userName": "Jennifer", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/2160868-jennifer", "userReview": "All right, there really are nuggets of good advice hidden in mounds of dirt in this book. For example, I skimmed the entire first half of the book. And there are just so many darned testimonials from his patients - perhaps a fifth of the book is testimonials. Why? To make this actually book-length, I suppose. Oh, and for your mental well-being you should probably skip the section listing all the rare medical conditions that can lead to colic. So, anyway, there are just nuggets...But what nuggets! Solid gold advice.This book is, supposedly, addressed to parents of colicky babies, but honestly any new parent can use the key advice. My baby isn't colicky but using this advice helped him (and us) sleep much, much better at night, and calms him down when need be. We went from spending 1 1/2 hours calming him down after his middle-of-the-night feeding (and really I think he just cried himself to sleep) to spending 20 minutes helping him drift back to sleep using some of this advice. I recommend expecting parents read the sections on the \"5 S's\" and then read them again after they have the baby. The advice is only good for newborns - the first 3 to 5 months - so there's no reason to put off reading this. I read the good sections when our baby was 3 1/2 weeks old and I wish I'd read it 4 weeks earlier. Lastly, you don't need to use this advice verbatim. Go with what your baby likes. For example, our baby doesn't like the side-hold recommended by this book - I just replace that 'S' with one of his two favorite ways to be held. These are guidelines, not rules, and every baby is different."}, {"userName": "Lisa R. ", "userReviewDate": "Jun 10, 2008", "userURL": "http://www.goodreads.com/user/show/1229727-lisa-r", "userReview": "This book is an absolute parenting essential. In the future, I will purchase this book, along with a swaddler, for every friend/relative who has a new baby. It's the closest thing to magic I have encountered during my brief time as a parent!We used the techniques in this book almost every day for the first 4 months of our child's life. We still swaddle our son now and he's almost six months old. I wold strongly recommend reading it before you give birth - we actually used the entire technique our first night home from the hospital.The book really, truly works. I know a DVD is available too, but I would say read the book as well because it really gets into the science of sleep and infant development."}, {"userName": "Kim", "userReviewDate": "Dec 11, 2008", "userURL": "http://www.goodreads.com/user/show/1791674-kim", "userReview": "The basic points are good - and they work. But, the book is amazingly boring."}, {"userName": "Adam Floridia", "userReviewDate": "Aug 20, 2011", "userURL": "http://www.goodreads.com/user/show/1024945-adam-floridia", "userReview": "This book sucked. Some of the ideas in it might prove very useful. But the book sucked. Rather than read it, I suggest one just skip to page 126-127 and copy the 5 S techniques as they are briefly described. Karp definitely knew that this idea couldn't justify a book length volume, but that didn't stop him from writing one. I'd say you'll read the same information (sometimes verbatim) every 20 pages or so. Before any information, you'll have about 5 pages of \"you are about to learn...\" or \"in Chapter 13 you will learn...\" God this is awfully written! Terrible! Plus, he uses exclamation points like a fourth grader: way more often than could be logically justified! His only pseudo-scientific claims (some dealing with evolution) are always prefaced by \"I believe\" or \"I am convinced,\" completely undercutting any real value these statements might hold and revealing the utter lack of actual scientific research. Here's his most scientific sentence: \"Actually, the [5 S's] trigger a profound neurological response never before recognized or reported--until today.\" Sounds like he's hawking some miracle hair growing ointment. Oh, and he's just a dick: \"In many ways, the people living in primitive cultures are backward compared to Western societies\" (7). He amends his comments later...on page 84, \"Please don't be fooled by the word 'primitive.' Although it conjures up images of backward people, over the past eighty years research has shown that many so-called primitive peoples possess wisdom of the natural world about which we are ignorant.\" I'm not sure who should be more offended--the primitive, backward people or me, the reader for his assumption that I think primitive means \"backward.\" Dick!"}, {"userName": "Brent Weeks", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/1741767-brent-weeks", "userReview": "This is one of those books that is gold... but very brief gold. Here is the failure of the modern book industry. The book should be about 40 pages, and it would be worth paying $10 or even $14. But no one thinks that brief advice could possibly be worth that much, so it's got filler. Whatever. Read the intro and a couple chapters. It'll save your life if you're a new parent. Plus, as a new parent, you only have time for a few chapters. Take it and read, the advice herein is great--it works!"}, {"userName": "Tova", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/11706332-tova", "userReview": "This book should be subtitled, \"How to Ruin Your Milk Supply.\" Following the tactics in this book will most likely sabotage breastfeeding relationships and make parents wonder why they don't know what their babies need...after learning to ignore all their cues and teaching the babies to shut down, not calm down, from being shaken and scared by loud noises. Here's a great review of Dr. Karp's methods:http://www.regardingbaby.org/2012/05/...For better information on normal infant sleep, check out:http://kellymom.com/parenting/nightti...http://kellymom.com/parenting/nightti...http://www.uppitysciencechick.com/nig...http://cosleeping.nd.edu/safe-co-slee...http://www.ibfan.org/art/bb53.pdf by Helen Ball of ISIS & Durham U Parent Infant Sleep Labhttp://www.kellymom.com/store/handout...http://www.kellymom.com/parenting/sle...http://kellymom.com/parenting/nightti...http://www.bestforbabes.org/booby-tra...http://www.cdph.ca.gov/programs/wicwo...http://kellymom.com/parenting/parenti...http://kellymom.com/bf/normal/frequen...And visit the \"resources\" tab on LLLi.org to find a local La Leche League group for breastfeeding support."}, {"userName": "Lara", "userReviewDate": "Sep 01, 2007", "userURL": "http://www.goodreads.com/user/show/269183-lara", "userReview": "I have to read this book to be certified in the curriculum for my job with Prevent Child Abuse Illinois, and normally I wouldn't put this type of thing on a personal book list, but it's so great! Obviously I don't have children, but some day in the future when I do, I definitely want to use these techniques! It talks of the \"5 S's to Stop a Crying Baby\"- swaddle, side/stomach position, shushing, swinging, and sucking! And I have the DVDs for the whole curriculum, which is amazing! The guy is a genius! Every parent should have access to this info! (And if you are interested and have a baby, and live in IL, let me know or go to Prevent Child Abuse Illinois' website....later this fall, I will be able to teach the curriculum for free!)"}, {"userName": "Filiz", "userReviewDate": "Oct 21, 2015", "userURL": "http://www.goodreads.com/user/show/15669641-filiz", "userReview": "Anne adaylarinin ve taze annelerin isine yarayacak,huzursuz bebeklerini sakinlestirebilmeleri icin 5 temel prensipten tekrar ve tekrar!! bahseden bir kitap.Ancak henuz dogum yapmadan okunmasi tavsiyem.Kolik ne degildire de vurgu yapiyor Karp.Mahallenin en mutlu bebegine sahip olmaniz mumkun mu bilmiyorum ama bebeklerle dair ozellikle yenidoganlara dair yararli bilgiler edineceginizden suphem yok."}, {"userName": "gina", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/2023352-gina", "userReview": "Every parent should be sent home from the hospital with the dvd by the same title. It literally changed our lives. It is regrettable that we didn't learn how to soothe the baby in this way until he was about 12 weeks or so. Oh the tears and struggle (us and him lol) we could have saved by knowing the 5 S's earlier. It literally is a miracle to watch it happen. It feels unbelievable to have the power to instantly calm your hysterical baby. I managed to find time to read the book, and it does have a few more tidbits of info the dvd (aka crash course for busy parents) didn't have. So it's worth your time to read it even if you watch the dvd. But my advice to parents is first watch the dvd. Also, we didn't swaddle our baby but the other steps worked like a charm without that bit, so you can easily play around with the 5 steps and see what works best for you."}, {"userName": "Amelia", "userReviewDate": "Oct 28, 2007", "userURL": "http://www.goodreads.com/user/show/584852-amelia", "userReview": "How can I say this?... If you want to never hear your baby cry for longer than 5 seconds and have them sleep through the night for their first three months, read this book and get the instructional DVD. I read it twice and perfected the technique before my baby boy was born and I seriously LOVED having a newborn and NEVER felt like I couldn't console him. It worked EVERY TIME. I really don't know how people do it without knowing this technique. It's a must for every mom."}, {"userName": "julieta", "userReviewDate": "Aug 31, 2010", "userURL": "http://www.goodreads.com/user/show/896646-julieta", "userReview": "Really people, why do we always forget? There is such a thing called mothers instinct, and books like these make it seem as if it is something we made up. \"when you do this, baby will do this\", and etc, no no! Not all babies are the same, and no, they do not react in the same way! there are some good tips here, but mostly it repeats on the same thing over and over. As soon as my baby was born, I realized this book did nothing for me. Reality is always much better!"}, {"userName": "Vi", "userReviewDate": "Apr 06, 2016", "userURL": "http://www.goodreads.com/user/show/28542688-vi", "userReview": "Agreed with other reviewers that the book is overly wordy, though Dr. Karp's method is highly effective and has saved my sanity as a first-time mother, especially during the early weeks when I did not know how to soothe my little booger."}, {"userName": "Galadriel", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/7477934-galadriel", "userReview": "Only regret is that I didn't read it before our son was born. Worked wonders. So glad we Gave swaddling another try! He's two now, but we still use white noise."}, {"userName": "April Hoy", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/4473176-april-hoy", "userReview": "A must read that saved us and Rhett!"}, {"userName": "Wes Smith ", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/64624601-wes-smith", "userReview": "Haven’t had to use the ideas behind this book yet but it makes a lot of sense and is very easy to read. Really hoping it works! The major drawback is this would be better in a 20 page book instead of 200. Very repetitive and lots of stories that are unnecessary."}, {"userName": "Emily", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/24493865-emily", "userReview": "The fourth trimester philosophy mashes a lot of sense to me and I have high hopes for the 5 Ss. However, I do agree with other reviewers that the book was padded. It was longer than necessary and even repeated itself, which annoyed me. Still, I'll be trying the techniques!"}, {"userName": "Allison", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/45995048-allison", "userReview": "As a first time mom the content in this book was SO helpful at understanding newborns and how to care for them. It answered many questions I had and also gave very explicit tips and tricks on how to calm a baby. Everything I have tried from the book so far has worked beautifully with my son. As a book, it was very repetitive and there was a lot of filler material. I didn’t mind it as much because the repetition helped me remember key points but this easily could have been a long blog post or article in The Atlantic rather than an entire book. I did appreciate all of the references and time taken to explain the scientific reasoning behind his suggestions though. It made me much more confident in trying these techniques as opposed to something I read off a message board from 2006 that I found googling in desperation late at night."}, {"userName": "Katie Browning", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/2235015-katie-browning", "userReview": "The five steps the author shares in this book make sense to me, but don't know if I buy into his whole \"fourth trimester\" theory. I did find the advice of shhhhing loudly because that's what babies are used to interesting. We'll see how it works in real life in a few weeks!"}, {"userName": "Cristy Jimenez-Shawcroft", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/22058617-cristy-jimenez-shawcroft", "userReview": "Really helpful tips. I finished this book just in time for my first child’s birth. Let’s see if I can apply them."}, {"userName": "Özge İnci", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/7984380-zge-nci", "userReview": "İlk olarak Mahallenin En Mutlu Yumurcağı kitabını okuyup çoğu zaman işe yarar tavsiyelerini gördükten sonra ilk aylarını gazsız nazsız sıkıntısız atlattığım oğluma zıt olarak tam bir kolik olan kızımla birlikte bu kitabı da okumaya karar verdim. Ve Harvey Karp beni yine yanıltmadı ve kızımın gaz sancılarının zirve yaptığı dönemde kurtarıcımız oldu ve kızımın uykuya dalma ve daha uzun uyuma alışkanlıklarının gelişmesinde de yardımcı oldu. Sarmalama tekniği, diğer pratik bilgiler ve özellikle son bölümdeki ebeveynlere tavsiyeler gerçekten işe yarar, bilgilendirici ve ilham verici. Yalnız bu kitapla ilgili en önemli sıkıntı çok fazla tekrarlardan oluşması. Evet, sarmalama tekniği kitabın en önemli noktası olabilir ama bu kadar çok tekrar etmesi bir noktadan sonra sıkıcı olmuş. Ayrıca küçük çocuğu olan ebeveynlerin zamanlarının ne kadar kıymetli olduğu düşünülürse bu durum itici olmuş. Yine de hiçbir noktayı atlamadan okudum ve anne baba olmayı düşünen ve küçük bebeği olan anne babaların okumasını şiddetle tavsiye ederim."}, {"userName": "Annette", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/1426170-annette", "userReview": "In the last couple of years, I have read - or at least tried to read - more \"self-help\" type books than probably the rest of my life combined. I am noticing a common problem: the author has a good or even great idea, piece of advice, research, or insight into the human condition. This idea can be adequately communicated in, say, 5 or 10 pages. But, the author would like to make some money off this idea, and therefore goes shopping for a book deal. The publishers would like to sell a hardback at $20 and a bunch of paperbacks at $8 to $15. Obviously no-one will pay that for a 10 page book. So, the author and/or his ghost writers wrap his simple idea up into 150 to 200 pages of repetitive, often intelligence insulting prose. \"The Happiest Baby\" is perhaps one of the worst examples of this trend I've yet come across. The entire book may be summed up in two points: 1) Babies aged 0 to 3 months who are in no true pain or hunger can usually be rapidly calmed by recreating a womb-like environment, which can be done by following the \"5 S's\" (Swaddling, side position, shushing, swinging, and sucking. Read the book if you want the details.) 2) It is OK to do this whenever your baby cries in this age range, because you cannot \"spoil\" a child still in its \"fourth trimester.\" This is pretty much all we need to know. But Dr. Karp, in an obvious effort to get his word count up, spends chapter upon chapter discussing colic, why the commonly ascribed causes cannot be correct, why his explanation makes the most sense, dozens of anecdotal examples, etc, etc, etc. One must wade through all this before getting to the meat of the plan, which is neatly summarized in a two-page diagram in the middle of the book. Errgh.I always tend towards written vs. audio/visual material. Perhaps in this case, however, the DVD would have been a better bet. My baby isn't born yet, but from the number of parents who recommended this video, I've no real doubt that \"The 5 S's\" will work for us and save us and our son much frustration - especially if he turns out to be \"colicky.\" Frankly, that's more than worth the price of admission ($13 at Target.) But it does leave me wishing that the current perverse incentives on self-help authors could be somehow reduced so I could waste less time on this sort of literature. (For what it's worth, my husband, who has a PhD, assures me that the problem is just as significant in dissertations. He estimates that roughly 10% of his 200 page thesis contained his actual \"contribution to the field.\" The rest was largely irrelevant...) UPDATE: Either I am in a better mood today, or the last 4-6 chapters in the book were far more worthwhile than the first 4-6. :) Seriously, there was some good info in the latter 1/4 of the book on how to tell if your baby is really sick, how to transition away from the \"S's\" when your child is 4 months old or so, etc. So if you're reading this book, scan the first 1/2, pay close attention to the exact techniques in the middle, and read to the end."}, {"userName": "Kylene", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/4456697-kylene", "userReview": "Well, I think boo to the apps on the phone. I had a very thorough review posted on here, and it got erased while I was using the Goodreads app on my Droid (I was putting baby to sleep and needed something to do while I was waiting to put her down).But I digress... 4 stars to this book. Yes there is a lot of fluff, but it really helps you understand why baby is crying and why they need what the author is saying they need. I think this book is better read PRIOR to baby being born. I could imagine a sleep-deprived parent getting frustrated with the author's fluff and just wanting the meat and potatoes. (I know that was the case for me, anyway. I wish I would have read this prior to her being born, or at least had a copy of it to thumb through instead of ordering it from Amazon out of desperation in week 3 and choosing the free shipping, which meant it didn't come for another 1-2 weeks....but again, I digress.)Also, I have to say that I appreciate the reviews of certain readers who read the book for classes or because they are pregnant for the first time and have no child-rearing experience. HOWEVER, until you are up at 1am, 3am, 5am and 6am with a colicky baby and all you want is more than 15 minutes of uninterrupted sleep and your baby is screaming despite all your best efforts and you don't know what to do...I can't say that I trust your review, especially if you rated the book poorly. I would be more likely to trust the reviews of those who have been in the baby trenches and have tried these principes and can give a fair review to the book."}, {"userName": "Danielle", "userReviewDate": "Mar 02, 2010", "userURL": "http://www.goodreads.com/user/show/1215194-danielle", "userReview": "I'd recommend getting the DVD instead of this book. It's just as repetitious, but it's much shorter to get through, and you don't miss anything from the book.10,000 stars for the ideas contained within the book, 2 stars for presentation. The author is really repetitious with his ideas, so I ended up skimming most of it. However, the ideas work wonders for my baby! The 5 S's were things that I naturally tried, either from instinct to comfort the baby or from experience/watching other mothers. But I wasn't using them effectively together, and that's what this book/DVD helped me to do.My baby (currently 3 weeks old) is a pro night-sleeper, waking up to feed every 3-4 hours. However, during the day I have problems getting her to sleep for more than 1 hour at a time; even when she's in desperate need of a nap, she won't stay asleep. The methods in this book helped her sleep for longer stretches during the day (which means I can actually get something done!), which makes her less fussy when she's awake, and in turn she's much more fun to be around now! For the record, she HATES having her arms swaddled, but when combined with the jiggling/white noise (we use radio static at a low volume), she loves a full swaddle."}, {"userName": "J Melachrinos", "userReviewDate": "Jul 10, 2015", "userURL": "http://www.goodreads.com/user/show/19775572-j-melachrinos", "userReview": "Very helpful book. Lets a tired, stressed new parent trust in their soothing techniques at a time when there's nothing much to cling to."}, {"userName": "Lucas Miller", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/734751-lucas-miller", "userReview": "I've felt pretty calm during my wife's first pregnancy. This calm has been punctuated by episodes of deep dread and doubt that still fell natural and healthy. As things have progressed, my nerves have gotten a bit more rattled. Labor and delivery is intimidating and the idea of bringing our new child home and then just starting life over again seems beyond the realm of the possible. This book was a comfort even as it made me feel like an insane person. I'm convinced that Baby books are things you read in a frenzy and what you remember in the moment is what you needed. This book and many in the genre are written in a repetitive, anecdotal style I imagine is designed for desperate new parents who haven't slept in 36 hours. I will use the jiggly motion. I will master the snug swaddle. I will let my child guide me into this new chapter of my life. Recommended."}], "description": "In perhaps the most important parenting book of the decade, Dr. Harvey Karp reveals an extraordinary treasure sought by parents for centuries --an automatic “off-switch” for their baby’s crying.No wonder pediatricians across the country are praising him and thousands of Los Angeles parents, from working moms to superstars like Madonna and Pierce Brosnan, have turned to him to learn the secrets for making babies happy.Never again will parents have to stand by helpless and frazzled while their poor baby cries and cries. Dr. Karp has found there is a remedy for colic. “I share with parents techniques known only to the most gifted baby soothers throughout history …and I explain exactly how they work.”In an innovative and thought-provoking reevaluation of early infancy, Dr. Karp blends modern science and ancient wisdom to prove that newborns are not fully ready for the world when they are born. Through his research and experience, he has developed four basic principles that are crucial for understanding babies as well as improving their sleep and soothing their senses. ·The Missing Fourth Trimester: as odd as it may sound, one of the main reasons babies cry is because they are born three months too soon.·The Calming Reflex: the automatic reset switch to stop crying of any baby in the first few months of life.·The 5 “S’s”: the simple steps (swaddling, side/stomach position, shushing, swinging and sucking) that trigger the calming reflex. For centuries, parents have tried these methods only to fail because, as with a knee reflex, the calming reflex only works when it is triggered in precisely the right way. Unlike other books that merely list these techniques Dr. Karp teaches parents exactly how to do them, to guide cranky infants to calm and easy babies to serenity in minutes…and help them sleep longer too.·The Cuddle Cure: the perfect mix the 5 “S’s” that can soothe even the most colicky of infants.In the book, Dr. Karp also explains:What is colic?Why do most babies get much more upset in the evening?How can a parent calm a baby--in mere minutes?Can babies be spoiled?When should a parent of a crying baby call the doctor?How can a parent get their baby to sleep a few hours longer?Even the most loving moms and dads sometimes feel pushed to the breaking point by their infant’s persistent cries. Coming to the rescue, however, Dr. Karp places in the hands of parents, grandparents, and all childcare givers the tools they need to be able to calm their babies almost as easily as…turning off a light.", "title": "The Happiest Baby on the Block: The New Way to Calm Crying and Help Your Newborn Baby Sleep Longer", "url": "http://www.goodreads.com/book/show/132900.The_Happiest_Baby_on_the_Block", "average": 3.92, "cover": "https://images.gr-assets.com/books/1387740973l/132900.jpg", "reviews": 2481, "authors": [{"url": "https://www.goodreads.com/author/show/1017070.Harvey_Karp", "name": "Harvey Karp"}], "type": ["Parenting", "Nonfiction", "Self Help"], "outlinks": ["http://www.goodreads.com/book/show/132900.The_Happiest_Baby_on_the_Block", "http://www.goodreads.com/book/show/445919.The_Happiest_Baby_on_the_Block", "http://www.goodreads.com/book/show/1442171.The_Happiest_Baby_on_the_Block", "http://www.goodreads.com/book/show/19508402-mahallenin-en-mutlu-bebe-i", "http://www.goodreads.com/book/show/7219218-the-happiest-baby-on-the-block", "http://www.goodreads.com/book/show/8123744-the-happiest-baby-on-the-block", "http://www.goodreads.com/book/show/26873424-the-happiest-baby-on-the-block-fully-revised-and-updated-second-edition", "http://www.goodreads.com/book/show/25387382-the-happiest-baby-on-the-block", "http://www.goodreads.com/book/show/352323.The_Happiest_Toddler_on_the_Block", "http://www.goodreads.com/book/show/13426360-the-happiest-baby-guide-to-great-sleep", "http://www.goodreads.com/book/show/13641900-the-happiest-baby-on-the-block-and-the-happiest-toddler-on-the-block-2-b", "http://www.goodreads.com/book/show/1000356.Baby_Bliss", "http://www.goodreads.com/book/show/36951350-nej-astn-j-miminko-v-okol", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}