{"ratings": 264, "userreviews": [{"userName": "Julie", "userReviewDate": "Feb 13, 2013", "userURL": "http://www.goodreads.com/user/show/14773738-julie", "userReview": "The sad thing about this work is that Hattemer-Higgins is potentially a powerhouse writer. When she writes with focus, the page is on fire and the story gallops along like a madwoman escaping the asylum. She is brilliant. You just can't get enough of what she's going to say next, where she's going to take you. Unfortunately, there are just not enough of those pages to redeem the novel.First of all, she tries too hard, and it is painfully evident in numerous passages. I felt, at times, that I was being given a Kindergarten Primer on the Holocaust; on guilt, both personal and collective; and on history itself. I was being lectured, admonished, instructed and sometimes even berated. Really? Does the reader deserve this?Her characters are weighed down with mind-boggling obtuseness and mind-bending obliqueness. She doesn't know where she's going, so how can they? And so, by implication, how can we? It's like following David Lynch's dwarf around in the dark -- but not nearly as much fun. The metaphors become painful. For one, the city as flesh, as woman, is hammered again and again. (Yes, I get it, I say after the 10th time. Now please stop.) And then, you begin to question your own sanity. Maybe she didn't mean what I think she meant, because she keeps repeating it, so maybe I should change my mind. I think there is a brilliant story hidden in this little (wal)nut, but she needs a rewrite. Where was the editor in all of this? If she lost 30%, and tightened the story line she would light up the sky, for it is evident that there is much in her that can shine."}, {"userName": "Tabitha", "userReviewDate": "Jan 05, 2012", "userURL": "http://www.goodreads.com/user/show/1470359-tabitha", "userReview": "The way I see it, there are two kinds of books in this world. The first kind are entertainment. This is a broad category, filled with strange bedfellows. There are the fluff books we read for laughter, romance, thrills, escapism. But there are also books that we read, usually non-ficition, that expand our horizons. These are Malcolm Gladwell books, or Tony Horowitz's A Voyage Long and Strange, or A World Lit Only By Fire. We learn from them, and they are certainly not fluff, but they still fall into the same category of entertainment, they are an enjoyable pasttime. The second category of books are very different from these. They are often not enjoyable. They make us uncomfortable, they bring us to the brink of what is bearable, and sometimes they pass beyond that line. We are unsettled by them, and reducing them to a number of stars out of five seems almost impossible. Books in this category, for me, are those that I often hated to read. Lolita is certainly one. A Streetcar Named Desire is another. Books that detail a character's descent into madness are always difficult for me to read--perhaps because they make me realize how close we all can be to tottering on the edge. Or, to quote Margaret from The History of History, they make us realize that we have more madness within us then we ever knew. While I often hate these books, and loathe their plots or one or more of their characters, I read them because they are the epitome of what literature can be. Literature should expose our zones of comfort, and move us beyond those boundaries of comfort. Not all literature, surely, should fit this definition, or I suspect the madhouses would overflow. But this kind of literature, while difficult to read, is absolutely necessary. We need those books that challenge us to move beyond our norms, if only for us to re-examine why we have the boundaries we do, and why they exist for us in certain places.It is only after those thoughts that I can begin to 'review' The History of History. Online blurbs, or the description inside flap of the jacket, don't really do justice to what the reader enters. Yes, a woman wakes up in the forest outside of Berlin and cannot remember the past several months. Yes, the story involves her trying to remember what happened to her, while exploring the tragic history of her city. These descriptions, however, are too straight-forward to adequately describe the novel. The book is not so direct, and Margaret's descent into madness follows the other-worldly paths found in 1970s U.S. films with strange headtrips, in which the viewer always must ask if they can trust what is happening on screen. It is a bit of Fear and Loathing in Berlin, but with World War II tightly wrapped within the narrative. I did not enjoy this book, per se. But, I did tell more people about what I was reading, and discuss it with more people, than I normally do with my reading material. It is a book that necessitates discussion, if only to pull the reader out of Margaret's world and back into the sunlight. Would I recommend this book? Absolutely, but only to those that find value in books that inhabit the second category for books, those firmly planted outside the realm of pasttime and entertianment, and see books as doorways to worlds we may not like."}, {"userName": "Jasmine", "userReviewDate": "Apr 23, 2011", "userURL": "http://www.goodreads.com/user/show/1122151-jasmine", "userReview": "[ Although I'm not a fan on the style of the end. it was one of those wrapping up, then wrapping up, then wrapping up endings, when I think that it's better to close books such as this and The Gone-Away World and One Day immediately after the revelation and let the read conclude alone. Does that ever actually happen? maybe everyone else likes all the explaining, but for me it's kind of like a classical music piece with 18 movements. Basically that is that it isn't polite to clap between movements in classical music so it keeps pausing and you keep thinking YAY DONE and then it starts again and then YAY DONE and then it starts again and you start throwing popcorn at the violinist. but really I'm ranting in an illogical manner. I can't tell you where I thought it should end, but there is a revelation and a philosophical summing up that I think pulls the book together and the book could end there (hide spoiler)]"}, {"userName": "Judith", "userReviewDate": "Sep 21, 2012", "userURL": "http://www.goodreads.com/user/show/301768-judith", "userReview": "There is a scene at the beginning of this book that I can't get out of my mind. Margaret, a young American living in Berlin, has had a period of amnesia, but having received a reminder in the mail of her yearly gynecological exam, she proceeds to the doctor's office. Although she does not recognize the doctor, ( a rather bizarre older woman) she cooperates with the process. Undressed, with her feet in the stirrups and the speculum clamped into place, she become nervous when the doctor then stumbles about (literally) before admitting to being legally blind. From here the story gets even weirder. Margaret awakes one morning to discover that the city has turned into a human being of some type. Though everyone else appears to react to life as normal, Margaret sees the buildings in flesh instead of concrete; hears sighing and other human noises come from the sidewalks and streets. I know all this sounds interesting, and it should be. I just couldn't get into it and had to cry uncle before really understanding what the story was really about. In fairness to the author though, it does sound intriguing, doesn't it?"}, {"userName": "Julia", "userReviewDate": "May 12, 2011", "userURL": "http://www.goodreads.com/user/show/249099-julia", "userReview": "Oh, how I was touched and gripped by this very strange and wonderful novel. The passion with which this talented young author chooses her words and winds her character's tale is truly awe-inspiring.Though I've never been to Berlin, Hattemer-Higgins brings that city literally to life in a way that can't be ignored.The main character seems on the surface to be so odd and so crazy that there might be no way to relate to her. But in the end, it's her very real and familiar struggle with passionate love, loss, and her need to face her own demons that make her so like all of us in so many ways.This is by no means a breezy read, but when I read the last sentence and put it down, I felt like my thoughts were clear and my mind had expanded over the course of the book to accept the possibility of the existence of an alternate reality that had power over the present."}, {"userName": "Natalie", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/10724256-natalie", "userReview": "I really, really tried to lose myself in this book. So many of the reviews were great, and the prose itself was, technically, quite lovely. However, the harder I tried to enjoy the book, the less I did. It was simply not my speed, not my \"bag,\" and I wish I could explain why. It wasn't the writing style so much as...maybe the pace of the book? Maybe its mystical elements, at least in the beginning chapters I read? Not sure. I just couldn't rev myself up to keep going with this one, and I ended up abandoning it."}, {"userName": "Magdelanye", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/5208681-magdelanye", "userReview": "This was a tortured read, dense and overlapping and ultimately amazing in it's ability to translate incoherence,anxiety, and rage into a deeper understanding of the second world war."}, {"userName": "Grant", "userReviewDate": "Jun 16, 2011", "userURL": "http://www.goodreads.com/user/show/1372239-grant", "userReview": "Great build up from the very beginning, but it takes a LONG TIME to unfold, and I'm not quite sure the payoff was worth the trip."}, {"userName": "Rebecca Makkai", "userReviewDate": "Nov 08, 2011", "userURL": "http://www.goodreads.com/user/show/5658965-rebecca-makkai", "userReview": "This was my favorite debut novel of 2011. It's probably not for everyone, but it's definitely for me -- the layering of personal and family and German history, the extremely unreliable narrator, the fabulous payoff of the revelations at the end... and sharp, original prose.The closest thing I can liken the book to is Murakami, but I actually hate Murakami. I always feel like I've been listening to whole-tone jazz with no tonic, and his novels seem to end arbitrarily, no better than if they'd ended fity pages sooner. (Minority opinion there, I'm aware.) The difference here is that we're waiting the whole time for a payoff -- we know the main character, Margaret, has blocked out a traumatic period of time, and we know the novel will be over when she remembers the event -- and when that revelation comes, it's not what we expected, but it's inevitable and disturbing and worth the wait. In that regard, it's a bit of a shoot-the-moon book (an apt analogy here, as there's a strange game of hearts being played with a ghost at one point); Higgins is willing to take risks that will, for the first two hundred pages, make her character appear foolish, until we realize we've been duped. Several red herrings in the plot really fooled me. I thought I was a step ahead of at least Margaret, if not the author as well -- and then I was the one played for a fool. Which is just about my favorite way to feel when I'm reading: like someone much smarter has just totally schooled me.I wish this book were getting the same attention as some of the flashier, lighter debuts of the year -- but cream rises, and I can envision this author's second or third novel winning a major award, at which point everyone will come running back to read this one. (I feel, in recommending this book, a bit like I felt a few years ago when I insisted everyone had to go see The Lives of Others. I knew some people wouldn't get into it, but damn it, they OUGHT to, and so I'm going to recommend it anyway.)"}, {"userName": "Angela", "userReviewDate": "Jun 08, 2011", "userURL": "http://www.goodreads.com/user/show/1431220-angela", "userReview": "I tried so hard to keep with this book - it had a couple of really good reviews and some great snippets on its dustcover. But after two weeks and 100 pages, it just could not keep my attention no matter what I did. I thought that maybe because of the mystical part of the story, it would start to engage if I read for 30 minutes without interruption. Didn't help. There was only one short chapter which was based in the present that I thought \"Wow, now here we go.\" Then we went back to bizarre. I have little enough time to read, I don't want to work this hard."}, {"userName": "Natalie", "userReviewDate": "Dec 03, 2012", "userURL": "http://www.goodreads.com/user/show/2218833-natalie", "userReview": "I couldn't finish it right now: in one way it's brilliant and in another way it all just falls through. It is ambitious - perhaps too ambitious - but not executed well.I will say one thing though, the woman can write."}, {"userName": "Greg Zimmerman", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/41665-greg-zimmerman", "userReview": "The History of History, Ida Hattemer-Higgins' debut novel, is, simply put, an awe-inspiring piece of fiction. The genius of this fiercely intelligent novel — other than the fact that Hattemer-Higgins' prose is absolutely gorgeous — is that it's an unconventional, postmodern (fractured narrative, bizarre dream sequences, unreliable narrator) tale that still crackles with mystery and page-turning intrigue. It's the kind of novel you really only should read 20 to 30 pages at a time and then put down aside to digest and puzzle out the significance of what you've read. Normally, with \"difficult\" fiction, that's easy to do. Not here — it's a story with a magnetism that won't let you leave it.Margaret Taub is a mid-20s American living in Berlin, Germany in the early 2000s. As the novel opens, Margaret stumbles out of a forest, not remembering how she got there. Fast-forward two years — Margaret has settled back into her life in Berlin as a history student and English-language tour guide, but still has a significant gap in her memory before and after emerging from the woods. One day, she receives a mysterious note addressed to Margaret Täubner, summoning her to an appointment with a Dr. Arabscheilis. Despite the fact that she thinks it's a mistake, Margaret goes, hoping for some clues about her missing memory.Then, the novel really starts rolling. Margaret soon becomes obsessed with the story of Magda Goebbels, the wife of Nazi Propaganda Minister Joseph Goebbels. As the Russians were nearing in the final stages of World War II, Magda murdered her six children in Hitler's bunker before she and her husband committed suicide themselves. Margaret, who is haunted by visions of Magda all around Berlin, wants to try to understand why. Was it an act mercy, or an act of evil? In the course of her research, she stumbles across a clipping about a Jewish couple who also killed their three children before being deported to a camp. To Margaret, that seems to be more an act of mercy, when compared with Goebbels'. But when is killing your own children ever morally justifiable?Intrigued by Dr. Arabscheilis' wisdom after their first meeting, and becoming increasingly unmoored, Margaret returns frequently to the doctor who becomes her spiritual guide/guru. The doctor, an old woman with a giant head, is a wonderful character, imparting advice and constantly speaking in dichotomy (difference between story and memory, difference between anestheticizing memories vs. aesthetizing them). At one point, Dr. Arabscheilis tells her: \"You, my pet, are having an identity crisis that has become moral despair. It is impossible for the human animal to remember his or her own life without cleaving a line, a line of some kind, however capriciously zigzag, lazy, narcissistic, arrogant or, on the other hand, self-blaming and unforgiving, between right and wrong, credit and blame.\"The novel's intricate plotting and Margaret's obsession with history allows it to deal with a number of heady moral and philosophical issues, all the while bringing us along at a pretty fast pace as Margaret tries to figure out what happened to her...or what it was that she did. Throughout the book, we're constantly wondering about Margaret's sanity. Are her visions — Berlin's buildings turned to flesh, Magda Goebbels in the form of \"hawk-woman,\" playing a weeks-long game of Hearts with a ghost — a product of her declining mental faculties, or simply beautiful dreams? \"And a sense of beauty, my pet, to each his own, is the weir that staunches the flow of madness,\" the doctor tells Margaret in the later stages of the novel. The degree of Margaret's madness is the riddle Hattemer-Higgins presents her readers, and even at the novel's shocking, stupefying conclusion, that's never really clear.Sadly, this novel — published in January 2011 — remains obscure to most readers. Most likely, that's attributable to the fact that many readers hear \"difficult\" and run screaming towards Dan Brown. But this novel isn't difficult in the Gravity's Rainbow or Ulysses sense. In fact, it's not difficult at all — it's just that it does require a fair amount of thought and concentration to get the most return on the reading investment. And even then, it almost certainly requires a second reading to decipher all the symbolism and philosophizing. Still, this is high-concept fiction of the highest order, and therefore, highly, highly recommended!"}, {"userName": "Daisy ", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/1013908-daisy", "userReview": "A singular, fictional perspective on the Holocaust, guilt, innocence, revenge, love, family, modern Germany -- East and West...I am a pretty literal reader and had to push myself past the fantasy in this novel. The symbols were not easy for me. I'd love to discuss this with someone. If I belonged to a book group maybe. Yeah, this would be a great book for a group to dissect. There are some amazing scenes here, especially being stuck in the doctor's office. If this is at all your area of interest, if you've ever been in an old European city and wondered whose feet wore down the stairs of the apartment building you visit, whose fingers trailed the bannisters, whose elbows leaned on those open windows, then this will be satisfying in many ways. But that's simply put. It's a complicated, elegant, detailed story. I can't pretend to understand all of it though by the end, much of it is clearer. It makes me ponder a lot of things I've never thought about before.Once you've met something unimaginable you can never unmeet it again.She stood in the mirror portrait very near Margaret, close next to her, good as a mother or a friend.Going around in life using German, which Margaret had learned only a few years before, was like walking around in high heels--although it drove up the aesthetic rush of going out on the town, it was dreadfully uncomfortable after a while, and there were certain places you couldn't go. (Now, I confess I've never worn high heels but I have learned German and this is so accurate.)... and these are things that make children welcome: home and non-disappearance of people.Even if you cannot forgive yourself, and by some poor luck you cannot forgive anyone else either, and there is no vengeance to be had in this baneful world that is slowly suffocating on its own past, there might still be a paradox of goodness.Not that this story reminded me of the following books, but I did think of them while I was reading this:The Master and MargaritaEverything is Illuminated"}, {"userName": "Claire", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/7404973-claire", "userReview": "The History of History  was the type of book that made me want to flip right back to the first page after I'd finished reading it. Hattemer-Higgins intertwines so many subplots, themes, and half-fictive, half-historical characters that I'm certain one could approach this book several times and notice a new thread running through each reading. This imaginative and unsettling novel tells the story of Margaret, a twenty-something American in Berlin grappling with gaps in her recent memory as the city's unseemly history brims to the surface all around her. Unfortunately, most of the novel's ultimate revelations are uncharacteristically predictable. That is, the richness of Hattemer-Higgins' prose and the inventiveness of her story led me to believe that her story's and subplots' resolutions would be equally surprising and original. They are not. The novel's relatively quick series of final revelations feel hurried and incongruous with the rest of the piece.There is so much potential not only in the story Hattemer-Higgins invented but also in the ways she reveals the many elements of the plot, and I look forward greatly to Hattemer-Higgins' next disquieting adventure."}, {"userName": "Marc Nash", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/5136053-marc-nash", "userReview": "A dizzying trip through Berlin and its recent history as the heroine tries to get inside the mind of two women who killed their families, one a Jewess and one being Magda Goebbels in Hitler's bunker. Both take their decisions to prevent their children from suffering, but the two women strike very different chords. Winding in between these two historical women, is the strange, slightly hallucinogenic experiences of the heroine in modern day Berlin. This aspect reminded me of both Kafka and Elias Canetti's \"Auto Da Fe\" - impeccable European traditions for this debut American writer. However the middle section of the novel, concerning the heroine's own loves and losses sagged a bit for me. The novel is flawed, but still a very worthwhile read I think. The novel serves as an inquiry into storytelling, the myths of history, of place, of identity. And intriguingly the novel denounces storytelling, including its own fiction within, as the great artifice, \"the great falsifying agent at the disposal of the human mind\"."}, {"userName": "Mark", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/2024776-mark", "userReview": "Meh. It's trying to hard to be satirical and serious in a roughly Joycean fashion, but as if Pynchon were writing a Vonnegut novel, and the mix simply doesn't work. There's rich material here buried in prose simultaneously dense and simplistic, which may be the point, but the author intrusions kicked me out far too often."}, {"userName": "Susan", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/1655341-susan", "userReview": "In this odd novel linguistic playfulness matches a darker whimsey. Gothic, Kafkaesque, like a Grimm folktale, this subjective nightmare of the holocaust is disturbing but unlike the classics, without rewards."}, {"userName": "William", "userReviewDate": "Jan 27, 2014", "userURL": "http://www.goodreads.com/user/show/3082189-william", "userReview": "This first novel by Ida Hattemer-Higgins is subtitled, “A Novel of Berlin,” and the city literally seethes and breathes on every page. Margaret Taub is a tour guide, with an intimate knowledge of its streets and the ability to describe not only what is seen on them but what the streets themselves have witnessed. For any modern novel of Berlin must have a memory, unspeakable memories, and a voice to reveal them.But Margaret has amnesia - a limited case of amnesia, covering a period in 2002 and 2003. Her amnesia though, is meant to remind us of the collective amnesia of the German people over the mass insanity of the Nazi period. As Margaret begins her investigation into what happened during her missing months, she is pursued by the spirit of Magda Goebbels, the wife of Hitler’s propaganda minister, in the form of a tempting, accusing harpy. Magda, of course, is notoriously remembered for having murdered her six children in the Fuhrer Bunker, even after Hitler’s suicide, rather than spirit them to safety.Margaret sees herself in Magda, and in Eva Braun, Hitler’s mistress and wife for a day. She sees herself in the family Strauss, who killed themselves rather than face the horror of the war. She sees herself passing judgment on victim and murderer alike, finding kinship with each alike, until all human action is revealed as corrupt. Her observations and obsessions lead her to believe that what she is doing is domesticating her fear, homogenizing the terror.Margaret is an American with German ancestry, so she (believes she) is an outsider to the recriminations and excuses that modern Germany’s collective memory offers to the Holocaust. But the creeping insanity that she battles is something that anyone who plunges into the history of the Third Reich feels. We see the camps, we see the abandoned shoes and abandoned clothes and abandoned lives, and we desperately want it all to mean something. The sufferings of millions crystallize for us for just a moment in one solitary life, and we mourn, though we are not sure what precisely we are mourning.Margaret’s visits to a Dr. Arabscheilis confirm some of this:“’If you read some scrap of history,’ the doctor said, ‘you are doing nothing but replaying your own life, only in heavy makeup. The world is pregnant with your own face, and it will never give birth to anything else. You know nothing but this life of yours, which is plain and pure emotion, stripped of all gratification of meaning - just a whimper in the dark. A story, by contrast, is a symphony blooming in the sunlight, trying to draw you away from chaos.”Later in the novel, Margaret again speaks to the doctor about the similarity, on a smaller and at the same time more epic scale, between the Holocaust and the Crucifixion. Margaret wonders that if since the death of one man led to spiritual enlightenment, can the death of millions more help the world in the same way. The doctor dismisses this, saying, “The murder of the Jews of Europe in the twentieth century is only interesting to people for whom it is not unbearable. Interest in terrible things is always a sign of detachment.” In the beginning, we tried not to talk about it, and now we perhaps talk too much about it, with the feeling we will never comprehend it at all.Humanity still hasn’t figured out a way to make sense of the murder of six million Jews, much less the death of 50 million in the Second World War, which is one of the reasons why fiction dealing with the Shoah usually suffers from two defects - the story does not do justice to the reality we know, or the story attempts to borrow the clothes of the event for itself and disguises a defective story. But Hattemer-Higgins wisely uses the idea of the tour guide as both outsider and insider, and her prose mirrors the mental confusion of Margaret Taub as she realizes her journey is one of self-discovery. The narrative veers into magic realism occasionally, and adopts an almost Biblical language at times, as if conventional English is somehow unworthy of the trauma at the heart of the story.Because this is a story not just about collective, historical evil, but about personal evil and the will to want to forget. I was reminded of Ron Rosenbaum’s “Explaining Hitler,” a wonderful book written in 1998 about Hitler explainers - those philosophers, historians, psychologists, theologians and Holocaust survivors who argue over the question of whether Hitler was evil - in other words, did he know his dream of mass murder was evil, or was he, in the words of one biographer, “convinced of his own rectitude?” It is not a small question, as Rosenbaum states:“…what we talk about when we talk about Hitler is often not the Hitler of history but the meaning of evil. Not evil as some numinous supernatural entity but evil as a name for a capacity of human nature. To what degree does Hitler represent some ultimate, perhaps never-before-seen extension of that capacity? Or does he represent not a qualitative leap in that capacity but rather a figure whose distinctiveness and importance in this regard have been inflated by the quantity of his victims?”But Margaret Taub, her name means deaf, is not a victim of Hitler, but of a man named Amadeus, whose name means “work of God.” Her love affair with this older man starts her on a bitter road that brings her face to face with her own origins, and headed for a destination that ends up being her undoing. It is the memory of Amadeus and what became of their affair which is the genesis of her amnesia. Her suffering is a particularly feminine kind of suffering, and we perceive that her passion will not be assuaged by the passage of time. The fact that the world continues in the face of her pain is real and devastating. We often abandon our secret shame at the doors of others, only to see it wither in their indifference, the screams going ignored, and then silent.In this regard, Margaret Taub’s odyssey through the pulsating streets of Berlin, her ears ringing with the accusations of millions, the hands of creeping death fondling her imagination, bears some kinship with the narrator of Sylvia Plath’s “Lady Lazarus,” herself employing the language of the Shoah to describe her fascination with death:I do it so it feels like hell.I do it so it feels real.I guess you could say I have a call.Because the picture of Hitler, trapped in the bunker of his own creation, a victim of his own accumulating sins, fascinates us in the same way as grand opera, only more so because we know it to be real. And we know that the nature of humanity’s capacity for evil has never fully been appreciated or understood, just as the supreme sacrifice to undo it has remained, for many, ignored and unaccepted."}, {"userName": "Majo Chalány", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/38213167-majo-chal-ny", "userReview": "Vybral som si knižku na základe jej podtitulu \"berlínsky román\". Vôbec som netušil, na akú strastiplnú cestu plnú smútku, depresie, strachu a bolesti ma autorka prostredníctvom hlavnej hrdinky vezme. Musím, ale priznať, že táto cesta je plná neskutočne fascinujúcich obrazov (ktoré spája aj v ich najtemnejších podtónoch silná lyričnosť, často dokonca čierno-čierny humor a až kafkovská atmosféra) a napriek svojej temnote ma v čítaní neodradzovala - priam naopak! Človek sa túži spolu s Margaret dopátrať podstaty jej stavu a trápenia, lebo jednoducho musí, pretože táto žena si to zaslúži. Čakal som na záver nejakú najtvrdšiu ranu, ale to, čo som dostal, predčilo všetky moje očakávania. Autorka má môj veľký obdiv, že sa pustila do tejto témy týmto spôsobom - spôsobom, ktorý možno viacero čitateľov po chvíli odradí, ale ja mu fandím, lebo každé utrpenie raz musí skončiť očistou. A tá je povznášajúca!"}, {"userName": "Debby", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/9295930-debby", "userReview": "This book was a fascinating experience with it's choice of imagery and language . I was in suspense reading towards an ending .There was so many ideas mainly on the Holocaust ,but not only . Some I would agree ,but some questionable . The mind of a mental illness and a deranged woman's workings of mind in minute details with great imagination ."}, {"userName": "Jim Leckband", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/4180616-jim-leckband", "userReview": "The subtitle is \"A Novel of Berlin\", but it could also be \"A Novel of Freudian Vienna\" because of the intense psychological and symbolic turmoil in the book. Margaret Taub, The very unreliable narrator (heck, the point of the narrator's quest is to find out *why* she is unreliable), wakes up in the forest outside Berlin with no memory of the last two years and tries to piece everything back together. Except she is kind of whacked-out and doesn't do it like a normal person would.Part of her problem is that the buildings of Berlin are made of flesh and hair and bone and this freaks her out. And the ghosts of Magda Goebbels and a Jewish mother who died in WWII are popping up, this also freaks her out. And the overwhelming history of Berlin freaks her out - which is kind of a problem since she is a tour guide.The book is partly a psychological thriller (\"What *happened* to her?) and partly a way for the author to expound on the geography and history of Berlin - which got old after a while. For a much better treatment of essentially the same material, go read The White Hotel."}, {"userName": "Daphna", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/22115249-daphna", "userReview": "Despite my rating of this book I still might give Ida Hattemer-Higgins' second book a try. It seems to me that beneath this pretentious book there is the potential for an interesting and meaningful writer.In The History of History the author over-exerts herself and tries much too hard to be clever and sophisticated. She pushes so much into the book, that reading it gave me the bloated feeling one gets when over-eating. She also makes sure time and again that the reader gets it. Well, the reader gets it. Again and again and again. The Martha Goebbels character versus the Regina Strauss character, The Goebbels children versus the Strauss children, the buildings of Berlin that come alive, the blind doctor, the insane father, the lover with the familial connection, the Jews and the Nazis. Sometimes too much is just too much and whilst reading the book I found myself craving subtlety."}, {"userName": "Vesna", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/7811904-vesna", "userReview": "This was such an enjoyable read. Having visited Berlin a few months ago, I did all the typical sites like checkpoint charlie, the place has a veneer of fact/fiction/real/unreality that has been masterfully captured. Likewise its citizens. I totally believed Margaret's obsessions and was surprised by how stunning it was to read. Its bold exuberance of language glided its way to convey difficult and at times, harrowing content. The theme of madness is seen through a surreal landscape where hints are presented and symbols come out to play. I will most certainly re-read this at another time for on every page there are layers to strip away--the merging of historical fact with dreamlike montages shows that the difference between story and memory is not as watertight as we'd like to think it is."}, {"userName": "Joanne Merriam", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/6868733-joanne-merriam", "userReview": "[Full disclosure: I know the author slightly from the Poets & Writers Speakeasy forum. We've never met.]I read this book several months ago and am still thinking about it and going back to my Kindle to reread passages. It's a haunting book, and best read all at once. Most of it is very mysterious until the end, when much that was confusing earlier becomes clear. I've never been to Berlin, but found it easy to imagine given the lush descriptions of Margaret Taub (the protagonist) whose Berlin is a very personal version of the city (with buildings made of flesh and so forth). I wondered many times if we were simply to understand that the protagonist was crazy, but the answer is not nearly that simple or that alienating. This is a marvelous book."}, {"userName": "Maria Bache", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/35067280-maria-bache", "userReview": "Even though this book ended up being slightly less marvelous than it looked for a long time it's none the less a great read. It is for those of open minds as one has to accept that the main character's past is partly hidden, partly shows itself in very odd images or hallucinations. She's an American expat living in Berlin, studying history, and making a living by giving history tours on foot. Gradually the city transforms in her view or perhaps rather mind's eye from a beginning with a mistaken identity that gets her an appointment with an odd doctor.She can trust her eyes gradually less as the book moves on. As a reader one is more or less as much in the dark as her which drives a curiousity that gives the book a pace of its own."}, {"userName": "Islam Hosieny", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/20966711-islam-hosieny", "userReview": "IDA Hattemer Higgins shows colors of brilliance in this book. But none of them tinged a hue of a writer. Not because of her writing style but because of the way she structures her tale. Her description actually was no vivid it felt like fingering a wound, specially when diving into the mouth of madness.The story however told was very hard to follow with all the sporadic events that don't seem to make sense unless one reaches the end and finally constructs a story in his mind.The story is very interesting the ideas on which it was based and the history invoked are all intriguing. Yet the telling was confusing.I decided to give it a four for this reason. Not three because her witty take deserves more, not five because I wish I would have followed it smoothly."}, {"userName": "Michelle", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/15568348-michelle", "userReview": "I read this book very quickly while traveling, and it was a very entertaining read. As a History teacher myself, living in Europe, I found the questions on the city's \"perfect pregnancy\" and the expectations that people have in the study of history very poignant and interesting.I was drawn into the narrative(s) and much appreciated the changing narrative voices. I also found myself wondering at points if Margaret was really insane or if these visions were really appearing to her...and was happy when other voices came into play to \"help.\"In any case, an interesting read that requires much suspension of disbelief, worthwhile at the end."}, {"userName": "Adrianne Mathiowetz", "userReviewDate": "May 08, 2011", "userURL": "http://www.goodreads.com/user/show/30900-adrianne-mathiowetz", "userReview": "I'm not really sure how to review this book, for two reasons:1.) It took me like 3 months to read it, when it should have taken me a week. This is not the fault of the writing: it's a fast-paced, surreal mystery combined occasional forbidden romance combined with NAZIS. But I get all weird with hardcover signed books and only read them in bed, and I don't take them traveling. Which hasn't worked out so well for me lately.2.)The author went to elementary school with my booooooyfriend! They're all besties and she knows stuff about our relationship and so who the f am I to praise or condemn bits of her book?So: I enjoyed this! I recommend it! Please read it so we can discuss."}, {"userName": "Lotte", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/6051130-lotte", "userReview": "Det er en af de mærkeligste bøger, jeg har læst. Det var svært at komme ind i historien, men da jeg så var der, blev jeg suget ind i den, så jeg vil gerne anbefale den - svinger lidt mellem tre og fire stjerner. Jeg tror, at bogen er bedre, hvis man selv er visuelt-sindet, der er så mange billeder. I det store og hele synes jeg, at oversættelsen var god. Men af og til blev jeg lidt irriteret. \"Hans øjne var rettede mod hende\". Suk. Og nogle steder var det tyske grammatisk forkert. Jeg ved jo så ikke, om det også var det i den engelske udgave."}, {"userName": "Nora", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/4219075-nora", "userReview": "I have never read anything like this. I generally have very little patience for surrealism, but I found this craaaaaaaaazy good. I mean, I am kind of done reading Holocaust novels but they keep sneaking onto my reading list somehow. I wouldn't call this a Holocaust novel anyway, exactly, even though it is very much about the Holocaust. An original take on guilt and memory and love. Whatever. NOT for everyone. Also the language was very strange at times, almost as if it had been translated, which added to the experience of reading it for me."}], "description": "A ferociously intelligent debut novel about a young amnesiac’s descent into madness in contemporary Berlin, and a country wrestling with its dark past.A young woman named Margaret stumbles one morning from a forest outside Berlin, hands dirty, clothes torn. She can remember nothing of the night in the woods, nor—she soon realizes—anything of the previous months. She returns home to her former life.Two years later, she receives a letter from a mysterious doctor, who summons her to an appointment, claiming to be concerned for her fate. Margaret keeps the appointment, but when she leaves the doctor’s office, the entire city is transformed. Nazi ghosts manifest as preening falcons; buildings turn to flesh; reality itself wheels.This is the story of Margaret’s race to recover her lost history—the night in the forest, and the chasm that opened in her life as a result. Awash in guilt, careening toward a shattering revelation, Margaret finds her personal amnesia resonating more and more clamorously with a nation’s criminal past, as she struggles toward an awakening that will lead her through madness to the truth, and to the unanswerable agony of her own actions.Ida Hattemer-Higgins has written a novel about amnesia—individual, cultural, historical—about memory and oblivion, fantasy and reason, myth and redemption in our time. An unforgettable story from a bold and prodigiously gifted young talent.", "title": "The History of History", "url": "https://www.goodreads.com/book/show/8592844-the-history-of-history", "average": 3.19, "cover": "https://images.gr-assets.com/books/1320537996l/8592844.jpg", "reviews": 62, "authors": [{"url": "https://www.goodreads.com/author/show/4122131.Ida_Hattemer_Higgins", "name": "Ida Hattemer-Higgins"}], "type": ["Fiction", "Cultural", "Mystery", "Abandoned"], "outlinks": ["http://www.goodreads.com/book/show/8592844-the-history-of-history", "http://www.goodreads.com/book/show/10781444-the-history-of-history", "http://www.goodreads.com/book/show/22558645-minulost-minulosti", "http://www.goodreads.com/book/show/17679990-history-of-history", "http://www.goodreads.com/book/show/9959246-the-history-of-history", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}