{"ratings": 15, "userreviews": [{"userName": "Amanda NEVER MANDY", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/36873041-amanda-never-mandy", "userReview": "**I received this book for free through Goodreads First Reads.**The synopsis for this one completely caught my attention. It was brief and mysterious and I liked the story that it was teasing. What a tease that it was, too! A few pages in and I knew that things were not going to go as planned. The first thing I noticed was what I thought was going to be a Young Adult read ended up feeling more like a Middle Grade one. It’s not that I am against that age level of reading, just that I like to know it before I step in it. Once I adjusted my reading perception to match the level, things picked up a little and I was able to coast for a while before slamming into the end. I completely understood what message it was supposed to convey but the execution of it left much to be desired."}, {"userName": "Pat Cummings", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/31580463-pat-cummings", "userReview": "The concept for \nThe Home\n was promising enough that I nominated it for publishing on Kindle Scout: hundreds of children are tended in a single building by their \"Father,\" who either kidnapped them or coaxed them off the streets as runaways. These children don't work like Fagin's crew, nor do they go to school. They seem to spend their time playing video games and earning tokens by doing chores or by gambling. The carny atmosphere doesn't disguise the fact that none of them are allowed to leave. Think of boys-becoming-donkeys on Pleasure Island in Pinocchio, and you've got the vibe.The tale is told by two voices: Bom and Mystic are older children in the Home. Bom is a natural leader, a young man in age, who is being groomed as a sort of deputy-Father. Mystic is a new addition to the ranks—who incidentally, also fills the author's need of a foil for explanations. (In '50s pulp science fiction, for example, this role was filled by a buxom blonde lab assistant.)In the only subtle concept of the novel, the Home itself becomes a representation of many inner-city societies, with a \"welfare class\" trapped in sterile leisure by a benign but strict provider, and an upwardly-mobile (or \"outwardly-mobile\") group seeking a way to live on their own terms. By contrast to Meritropolis, another novel with similar themes that I happened to read at the same time, this novel was dismayingly simplistic and badly proof-read, with an annoying number of grammatical and typographical errors. The most distressing \"typo\" left me looking for an escape with the same fervor as Bom and Mystic. The word is in quotes because its near-universal occurrence indicates it was a writer's or proofer's error of knowledge rather than a mistake in typesetting: the omission of commas before every name used as a directed address in dialog. It was never \"I was looking for that, Bom...\" but Watch out! Duck!:\"I was looking for that Bom...\"About halfway through, I stopped noting error corrections in my Kindle, especially as a frequent use of the wrong homophones made me suspect this was a novel written using speech software. Mispronounced words or sloppy pronunciations might have yielded some of the more amusing choices: \"crown\" for \"crayon\" for example.Since I understand such systems ask the speaker to select among homophones like \"you're\" and \"your\" or \"rain\" and \"reign,\" there was an opportunity to correct it. It is more likely someone simply accepted the most-frequent default without looking at the options. Either way, in writing \nThe Home\n using speech software, the author made another wrong choice."}, {"userName": "Melissa Levine", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/4264833-melissa-levine", "userReview": "I did the audiobook version of this story. Sorry, but I didn’t like it at all. I’m not sure who this story was geared to but I imagine it was for young kids. I hate giving bad reviews, what more can I say?Questions/Comments:There’s the part after Bom gives him little speech, which gets ‘Father’ mad at him. There’s supposed to be guards out looking for him. When Mystic goes to Bom’s room why didn’t the guards question her? Or even better, why does Bom have guards to begin with?Lack of detail. I found it strange that the author went into detail when Mystic was going through Bom’s room but everything else was left pretty vague. For example, the marketplace, what does it look like? We know there’s a marketplace, a theater, bedrooms, a communal bathroom, an auditorium, etc., and it’s in what? An old office building? Because of this lack of detail, I had a hard time caring about the characters in the story. I never felt connected or really focused on the story, of course, the narrator didn’t help in this area.So, Tom aka ‘Father’ saw Bom helping the little boy at the marketplace when he was freaking out about the high-priced crackers, YET, didn’t know Bom had given food to the market guy? How was Bom able to get so much food and all for the kids he helped get out and the market without ‘Father’ noticing?I would suggest to the author that he go with contractions next time. Because of the lack of contractions, at least based on the audiobook version, makes the story very stilted.At the end, where had Joshua gotten money to live with? Mystic had been a student when she got her first job, but as an adult needs a HS diploma. So, why hadn’t she continued her education to get a GED? That part doesn’t really make sense."}, {"userName": "Rachel Sakitis", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/51247073-rachel-sakitis", "userReview": "I received this book free from Goodreads. The Home is about children who run away and get promised a better life in \"the home\" with Father. It is the story of Bom and Mystic and their goal of breaking free from this place. Suspenseful and fast paced.I really enjoyed this book and would recommend it to others."}, {"userName": "Dominique", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/12317973-dominique", "userReview": "I thought it was good. Different from what I usually read. It was kind of on the edge of creepy but it didn't step over the line, it just walked along it."}], "description": "Is it still a playground if you can't leave? The home is a sanctuary for runaway children. Their days are filled with fun and games, and occasionally chores, with no regular adult supervision. Most children believe it is paradise but a few have found it to be more of a prison, unable to leave when they decide they have had enough. Join the main characters, Bom and Mystic, as they try to find a way to escape the Home.", "title": "The Home", "url": "http://www.goodreads.com/book/show/31374949-the-home", "average": 3.47, "cover": "https://images.gr-assets.com/books/1470691983l/31374949.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/6467182.Eric_Tripp", "name": "Eric Tripp"}, {"url": "https://www.goodreads.com/author/show/1598326.James_Coyle", "name": "James Coyle"}, {"url": "https://www.goodreads.com/author/show/8780.David_Green", "name": "David Green"}], "type": ["Childrens", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/31374949-the-home", "http://www.goodreads.com/book/show/30297215-the-home", "http://www.goodreads.com/book/show/15821945-dominique-ick-lessont-and-the-dragon-knight", "http://www.goodreads.com/book/show/17156697-dominique-ick-lessont", "http://www.goodreads.com/book/show/18799321-dominique-ick-lessont-and-the-lords-of-lecieldo", "http://www.goodreads.com/book/show/23653773-dominique-ick-lessont", "http://www.goodreads.com/book/show/25749702-dominique-ick-lessont-spirits-and-legends"]}