{"ratings": 2152, "userreviews": [{"userName": "K.D. Absolutely", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "I bought this book because of two reasons: there is \"ice\" in the title and the day I bought this, the temperature in Manila was averaging 36 deg Centigrade. Teethering below fever temperature. So, I said why not read something that is set in a snowy or icy land? When I saw this book being sold at P45 ($1), I bought it right away and cracked it open after few days. But tough luck, it took me two weeks to finish this and when I was winding down, the rainy season has just started and the weather was no longer unbearable. In fact, while typing this review there is an on-going typhoon Butchoy that is flooding the streets and my daughter cannot decide whether to go to school or not.Anyway, the other reason why I picked this up is sea adventure. Since I read Kon-Tiki three years ago, I am amazed how man and the sea could either get along well or hate each other. This love-hate relationship is like the most fascinating that man has with nature. Then there is ice in this book that imprisoned the crew of the ship called Karluk. So, it was like Kon-Tiki meeting Titanic or Poseidon. I have read and liked all of these.HMCS Karluk was an American built whaler that was bought by the Canadian government for the Canadian Artic Expedition in 1913. It was trapped in ice, sunk in January 1914 after floating for several months. Out of the 25 crew members, 11 died before they got to their temporary refuge in an island called Wrangel. This is the story of the ship and the hardship and triumph of the ship's crew.The good thing about reading survival stories is that they are always inspiring. No matter what kind of problem we have in our daily lives, there are always stories that are worst than what we are having. If your are short of cash to buy something, you think of these people who are ice-camping while trying to reach land (after Karluk sunk) who have no food except for dried meat and since they have no other food, they suffer from nephritis because of too much protein. So, the food that sustains them is also the food that kills them, writes Niven towards the end of the book. While, we here in the city, we complain about the traffic, the flood, the temperature but we have lots of available food. Yet, we normally choose the wrong ones: fatty or sugary.If you love survival stories, i.e., man's triumph against adversity, go for this book. It is well-written and not bogged-down with many cold historical facts. There is a nice revelation that has a lesson in the end that makes it not really your usual survival story."}, {"userName": "Michael", "userReviewDate": "Jan 18, 2014", "userURL": "http://www.goodreads.com/user/show/13181751-michael", "userReview": "Great book. Amazing. Incredible. Marvelous. I couldn't put it down. Matter of fact, even though I finished reading it, I still don't want to put it down. I want to carry it around and show it to strangers and say, \"Hey! See this book? You should read it.\" It's that good. Remarkable. Oh.... And I liked it."}, {"userName": "Toni Wyatt", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/5937463-toni-wyatt", "userReview": "From beginning to end, this well researched and haunting tale, brings the reader into the unforgiving arctic along with the ill fated crew of the Karluk. The audacity of Vilhjalmur Stefansson goes beyond what any person with a moral conscience can conceive. If not for the level headed and knowledgeable Robert Abram Bartlett, all hope would have been lost from the outset. Using the actual journal entries from the members of the Karluk, Jennifer Niven has painted a vivid and long lasting picture of the trials and tribulations these men faced. It is a testament to the human spirit and to our desire to survive. I will long remember this book and men such as William Laird McKinlay. A great read for anyone with an adventurous soul."}, {"userName": "Unwisely", "userReviewDate": "Jul 20, 2009", "userURL": "http://www.goodreads.com/user/show/1951394-unwisely", "userReview": "This book was a little out of my usual arctic grouping. Much like the Jeannette, they got stuck in the ice pack, the ship went down, and they ended up on Wrangel Island off Siberia.The expedition was relatively late (1913-4), so they had learned some things from the other expeditions...but not nearly enough. Another fascinating arctic story. I had some concerns with the accuracy of the book - she seemed to imply that no one survived the Jeannette expedition, which isn't true, and also repeated a story about relics being found off Greenland, which was the first I'd heard of that. That last claim was unsourced in the footnotes; one google search turned up an article (from 1896!) that seems to contradict the claim. So I'm not sure how much to believe much that didn't come from the diaries she used as primary sources.Like most authors in the genre, she didn't do too much interpretation - there was an incident that seemed to suggest to me some homosexuality and another that implied cannibalism, but she didn't visit these ideas in any depth, which I might have liked. So, a solid enough book but not a standout."}, {"userName": "John", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/1038181-john", "userReview": "The year was 1913, polar expeditions had become the Last Great Adventure, and the names of Scott, Peary, and Shackleton were household words. Vilhjalmur Stefansson, a lesser-known Arctic explorer, persuaded the Canadian government to fund an expedition that he hoped would raise him to the same pantheon, for he meant to discover the vast continent he was sure lurked beneath the polar ice cap. Stefansson was one of those figures in history who are too sincere to be considered con men, too impressive to be written off as charlatans, and too dangerously self-assured to be trusted with other men's lives.In appearance, the scale of the expedition was awesome: a flotilla of boats, the largest scientific staff ever taken on such a journey, several dog teams, tons of supplies, and loads of scientific equipment. In reality, afraid that someone else would beat him to the discovery of his imaginary continent, Stefansson bought supplies without examining them, hired almosst anyone who put themselves forward whatever their experience, and stuffed everything helterskelter into any boat he could hire that would float. Even so, they set sail too late, steaming out of the Esquimalt Naval Yard (Victoria, BC) in June. Six weeks later, the Arctic winter began, and the lead -- and largest -- boat, the H.M.C.S. Karluk, found itself frozen solid in the pack ice.At that point, Stefansson, taking the best of the dog teams and his closest associates, abandoned ship. He assured the crew and the less favored members of his expedition that he was only going for help and would soon return, but in fact he never looked back, leaving the party to almost certain death. As he knew, the ice itself was slowly moving west, bearing the ship with it deep into the stormy and desolate Bering Sea.Ironically, the Karluk carried with it an extensive library of books on polar exploration; among the collection was a volume recording a Russian expedition that had perished in just this way. One of the many poignant passages in The Ice Master tells of the members of the expedition, one after another, reading that book, each gradually realizing that they were eerily retracing the exact course of that doomed voyage.For five months, the Karluk remained frozen in a massive block of ice, drifting further and further west. Then, in January 1914, the ice began to crush the boat, and order was given to abandon ship. With nothing but the stores they managed to offload onto the ice, Captain Bartlett, twenty-one men, an Inuit woman and her two small daughters, twenty-nine dogs, and one pet cat were now shipwrecked in the middle of the Arctic Ocean, hundreds of miles from inhabited land.Captain Bartlett and one of two Inuit hunters began a desperate trip to Siberia, hundreds of miles away, to seek help, leaving the others, all in varying degrees of bad shape, to make their way to nearby Wrangel Island to await rescue. The island was barren and windswept, but at least there they would be off the ice (the shifting and breaking of which is a constant and terrifying threat) and possibly find game.What follows is a riveting story of defeat and despair. Like evil, disaster, too, is ultimately banal, and the story builds in power through creeping increments of small failures -- moments of bad judgment and even worse luck, compounded by inexperience and incompetence. Supply dumps disappear in snowstorms, never to be found; seals roll off the ice and sink when shot; the canned food they have rescued at the risk of their lives is slowly poisoning them; their clothing has been so often shredded by the sharp ice that it has become all but impossible to patch.As supplies and hope diminish, the men turn on each other, stealing, hoarding food, lying, and, in one instance, most likely commiting murder. Their eyes fail from the blinding brightness and the grit that is always blowing into them; their limbs swell up like balloons; their flesh becomes frostbitten and has to be hacked from their bodies. The one month of Arctic summer comes and goes, leaving them with only rotting seal pelts to eat and a sagging tent to protect them from the increasingly severe weather.When a ship finally arrives (Bartlett heroically manages to get to Siberia and then to find his way back to Canada, where he organized the rescue attempt), it is almost beside the point -- although some do survive, including the Inuit woman and her two little girls (one of whom is alive today), one dog, and the pet cat. But as touching as their return to civilization is, they are less survivors than salvage, and they know it.The Ice Master was passed on to me by a friend, and once I started it I couldn't stop, although I often wanted to. I would read a chapter a night, and dully lie in bed afterward, beset by that impersonal sense of despair that comes from witnessing men forced to bear the terrible consequences of someone else's folly. Furthermore, Jennifer Niven hasn't a clue when it comes to telling a story and her prose can be almost embarrassingly bad. But she has done her research (almost everyone on the voyage seems to have kept a journal of sorts) and eventually the narrative simply shrugs her aside and propels itself along on its own. The result is peculiarly compelling where by all rights it should be merely depressing. Tragedy has a logic and a meaning all its own."}, {"userName": "Marilyn", "userReviewDate": "Sep 03, 2012", "userURL": "http://www.goodreads.com/user/show/6141957-marilyn", "userReview": "The Ice Master: The Doomed 1913 Voyage of the Karluk by Jennifer Niven. I have to say that I have been putting off doing a review on this book. I am not certain that I have the ability in me, to express how this book affected me. Jennifer Niven most certainly developed the story line in such a way, that I could see what was happening, in my mind's eye. I could also feel the harsh cold, and in my imagination, I was able to experience the darkness, as well as the midnight sun. This was not an expedition that I was familiar with, so naturally I wanted to read about what happened, when these brave souls set out to the Artic. I was so impressed with the bravery of some of the men ( and the Inuit lady, and her two daughters.) I was equally disgusted with some of the men, whose actions only made some situations more dangerous for the team.I don't want to spoil things for anyone who has not yet read this book, so as I add my review in installments, I will try to not give too much of the storyline away.For me, the true heroes in this story were Captain Bartlett, Bjarne Mamen, and the Inuit family to name but a few. Bjarne Mamen, at the age of 22 displayed incredible bravery, and the ability of leadership. Unfortunately for Mr. Mamen, the impossible conditions of the Artic winter took a toll on his ability. Captain Bartlett and an Inuit man named Kataktovik, stopped at nothing to walk to Siberia to get help for their shipmates. The fact that they walked the hundreds of miles, in the most harsh conditions imaginable was a miracle in and of itself.The Inuit family who stayed with the ship wrecked crew certainly did more than their fair share to keep everyone alive. Kuraluk was responsible for bringing in the majority of the food. This was something that some of the crew became jealous of. Nerves became frayed, some resorted to stealing food, and fights broke out.Meanwhile Kiraluk, or \"Auntie,\" as Kuraluk's wife was known as, tried to keep everyone in clothes, and shoes. Kiraluk also was in charge of cooking, and managed to keep back some food, for times when hunting provided little. Even her daughters, Helen, and little Mugpi helped to fish, and hunt. Mugpi enjoyed playing with the ship's lucky cat, Nigeraurak, who was saved before the ship sank.But, despite Kiraluk's efforts to save some food back, and Kuraluks efforts to hunt for food each day, eventually food runs out. Hunting becomes hindered by snow blindness, and frostbite. The survivors will live off of things unimaginable.Commander Stefansson is to me the most irresponsible man to have ever manned an expedition such as this one. I try to find kind words or thoughts for him, and none come to mind. I am certain I will like him less, after I read about another expedition of his, to this very same area, which ends in a survivor from this expedition loosing his life....in this same area of the Arctic.When help does arrive, at first it seems as though the ship is a mirage. It seems impossible that as the second winter is beginning, that salvation has come at long last. There is so much yet to say about this wonderful book, yet I don't want to completely spoil it for those who have yet to read it. If nothing else, read this book, to honor those brave souls who sailed out to the Arctic, with intentions of new discoveries for Science. Some of those souls lost their lives for Science....some of them returned, and so read this for those brave souls."}, {"userName": "Lori", "userReviewDate": "Nov 01, 2013", "userURL": "http://www.goodreads.com/user/show/5502367-lori", "userReview": "This account of early western-arctic exploration and misadventure is marred by Niven's transparent bias toward some crew members and against others. She details the transgressions of her villains in exquisite relief, even hinting broadly at murder without a shred of forensic evidence, while glossing over or conspicuously failing to recount the daily behavior and disposition of her chosen \"good guys\". The discrepancy is even more glaring as her principal source is the written - and rewritten - recollections of one of her protagonists.As such, much of the book reads like \"gotcha\" journalism, particularly in bringing down multiple notches the reputation of famed American anthropologist, expedition leader, and probable egotistical ass Vilhjalmur Stefansson. Stefansson may have been a callous, disloyal jerk who was careless of his underlings' well-being and more than willing to sacrifice others' lives for scientific progress and his own acclaim. It is well-documented that he did some vicious and self-serving bad-mouthing of his own, particularly regarding the Karluk's Captain Robert Bartlett, so maybe Niven feels that turnabout is fair play and \"sets the historical record straight\". But those who signed on for this voyage, particularly his fellow scientists, were anything but babes in the woods, and they undertook the risks of high-arctic sea travel knowingly and willingly. That caution aside: what a story this is! The two-year wanderings of the staff and crew of the Karluk, much of the time without even the footing of solid ground, make the trials of the Donner Party look like an afternoon tea. There is true nobility in these pages. Too bad it had to be juxtaposed against the author's clearly inflamed opinion about the sometimes-contentious relationships between those who set out together on the doomed ship."}, {"userName": "Kristine", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/4731250-kristine", "userReview": "Ever wonder what would happen if you compiled a group of arctic explorers and added in an abnormally high number of nefarious ones? I think you'd have what happened to the Karluk, starting with the captain abandoning her as soon as he possibly could to starving men stealing from other starving men. There is definitely worse to mention, but I won't spoil.The struggle for survival, what the human mind and body will do, is fascinating and Niven did an excellent job telling the story of these men. For the ones who behaved admirably, what a sad fate in many cases. I was glad she followed up on how each of them died, both on this journey and later. It's a great follow-up to In the Kingdom of Ice, especially since the journey of the Jeanette is mentioned several times. (However, this last point is also the reason for the dinged star. Early on Niven implies there were no survivors of the Jeanette, which is very much not true. It casts an unfortunate cloud over the remainder of the facts, though I assume given that the Karluk is the main focus, the information about it is much more accurate.)"}, {"userName": "Keith", "userReviewDate": "Apr 05, 2012", "userURL": "http://www.goodreads.com/user/show/1270041-keith", "userReview": "On Tuesday, June 17, 1913 a whaling boat named The Karluk set out on a scientific exploratory adventure that it was destined to never complete. At thirty-nine meters long and 250 tons this wooden hulled fishing boat was ill prepared to face the travails of arctic water and her newly hired master had grave concerns about her abilities as a freighter let alone as an ice-breaker. But a glory seeking explorer Named Vilhjalmur Stefansson found her to be cheap and available and thought she would do just fine. Although a world renowned explorer, Stefansson turned out to be an egotistical fool and the boat’s captain, Robert Bartlett, a hero. This powerful and true story takes crew members, the science team and several indigenous guides to edge of human endurance in the frozen arctic, from which only some manage to return. Compiled from diaries and written records of the events, it’s difficult to believe that the men---and one woman, who was also heroic---could possibly prevail. Even though the ultimate outcome is known from the beginning, the insights into courage and individual fear make it a real page turner."}, {"userName": "Linda", "userReviewDate": "Apr 13, 2010", "userURL": "http://www.goodreads.com/user/show/2225443-linda", "userReview": "My grandfather Babb spent a great deal of time traveling and lecturing, and I assume that is how he acquired an autographed photograph of Vihjalmar Stefansson, a polar explorer. As a child I was fascinated by this picture of the famous man that my Grandpa knew – a man with a strange name, dressed in fur and skins. Now that I have read this book, I have a rather different picture of the man. The Karluk was one of three ships in an expedition poorly organized by Stefansson, planned to survey the Arctic in 1913, hoping to claim land under the polar ice cap for Canada. Captain Robert Bartlett becomes the real hero of this story as the Karluk becomes stuck in the ice and Bartlett sets out on a long trek to Siberia to return with a ship and rescue those of the crew who were still alive. (Stefansson, meanwhile, has abandoned the expedition altogether.) This is an exciting arctic exploration story, well researched and told. Incidentally, my mother threw out the picture of Stefansson when my parents moved from the house I grew up in."}, {"userName": "Amerynth", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/2993355-amerynth", "userReview": "I am a huge fan of polar exploration stories and Jennifer Niven's book \"The Ice Master: The Doomed 1913 Voyage of the Karluk\" fits right in among the great books I've read on the subject.The Karluk expedition occurred after the North Pole was already discovered and appeared to have little purpose, except to get the organizer out onto the ice, as he left 20 other men to fend for themselves. More than half of the crew died after the ill-fated Karluk got trapped in the pack ice.Niven mostly tells the story well. There were parts that dragged a bit, mainly because she appears to have had so much source material. I had trouble keeping so many crew members straight-- it didn't help that so many members of the crew had last names beginning with an M.That said, the story is told so well it reads more like a work of fiction. I would absolutely read another book of Niven's based on this one."}, {"userName": "Pete daPixie", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/1779598-pete-dapixie", "userReview": "There are so many plus points to Jennifer Niven's 'The Ice Master'. Primarily the author has meticulously researched a long lost polar epic that should not have been forgotten or ignored in the first place. Also the author has embellished her narrative with a descriptive excellence that is of the highest quality writing in the field of historical non-fiction. To learn that Niven has been employed as a screenwriter for ABC television is not a surprise. The reader is gripped in this compulsive page turner more surely than the HMCS Karluk was held fast in arctic ice.It is also very pleasing to see historical accuracy that uncovers the criminally incompetent and raises the real heroes to their rightful places.An incredible true story of extreme hardship in northern latitudes, 'The Ice Master', published in 2000, is Jennifer Niven's first book and hopefully not her last in this genre."}, {"userName": "Laura JC", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/12080633-laura-jc", "userReview": "What a harrowing tale. Sometimes I was exhausted and despondent while reading it, the survival part on Wrangel Island. It did get repetitive in that part, but then, their lives were repetitively horrible at that time.This book was on the suggested reading list for an expedition cruise I took to the Chukchi Sea in 2011, which included a day on Wrangel Island and setting foot on Herald Island. I wish I had read this before that trip. I would have had more awe and reverence about them. Well worth reading this tale of survival from the early 1900s. The author has done a good thing."}, {"userName": "Neill Caldwell", "userReviewDate": "Oct 11, 2011", "userURL": "http://www.goodreads.com/user/show/6630259-neill-caldwell", "userReview": "Excellently told tale of an incredible story. Amazing detail for something that happened 100 years ago. Jennifer is a very talented young writer and I look forward into reading all of her books."}, {"userName": "Amena", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/3541451-amena", "userReview": "I first heard this book read aloud on NPR and I was hooked. Enjoyed it just as much when I sat down to read it myself. Adventurous, emotional and compelling tale."}, {"userName": "Chrissie", "userReviewDate": "May 06, 2008", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "Interesting, but none of the characters really \"gripped\" me and the maps were maddeningly insufficient."}, {"userName": "Therese", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/3428240-therese", "userReview": "In 1913 Vilhjalmur Stefansson had outfitted and purchased the Karluk for a bargain to go exploring in the Arctic, hoping to discover land, and in doing so achieve fame and fortune as other famous explorers had done. Unfortunately this was not the time to go bargain shopping, and this book also showed how crucial it is to have not only a good leader, but to choose your crew wisely. Men needed to be able to work together whether they were on the crew or the scientists that were hired, but this wasn’t to be. I also have to wonder if these men would have fared better if more of them had Arctic experience. In addition to these two groups of people, Eskimo men were hired, including one with his wife and two small girls. The expedition got off to a late start, and when you are dealing with the howling wind and the temperamental ice of the Arctic, every moment counts. It wasn’t long before the Karluk got stuck in the ice, not unlike the Endurance, but Stefansson was no Shackleton by any stretch of the imagination. Taking a couple of the hunters, photographer, anthropologist, and his secretary with him, Stefansson did the unthinkable by abandoning his ship although he told everyone that he was just going hunting and would meet up with them later.Capt. Robert Bartlett was left in charge, and it wasn’t long before he figured out that these men were not going to work together even though their lives counted on it. They hadn’t known each other before and other than being shipwrecked, they still had nothing in common although the way they treated one another still defies explanation to me. As I have read before, the ice really becomes a living thing and you never know what it will do. After being freed from the ice, the Karluk drifted far to the east of their original destination before finally sinking several miles off the coast of Wrangel Island in northeastern Siberia. Bartlett gathered everyone together with as much as he could from the sunken ship and headed toward the island bit by bit, including their dogs. A small black cat was the one thing that kept them together because as much as they didn’t like each other, they had a strong affinity for the little feline.After drifting so far and with so much time passed, Bartlett knew he had to gather his strength to see if he could make it to Siberia, down the coast and somehow summon help for the castaways. This he did although I don’t know why they stayed as long as they did at Shipwreck Camp and/or why he didn’t leave sooner toward Siberia. Of course it is easy for me to wonder, but in choosing one of the Eskimo hunters to go with him, he had chosen wisely because so many of the other men were sick or otherwise unsuitable for travel. Bartlett had one thing on his mind – he was going to save those left in his charge, and perhaps things would have gone better had they worked together instead of fighting but extreme hunger and conditions beyond our imagination didn’t allow this to happen.It is beyond my comprehension how anyone could have survived this ordeal, but then again the human spirit and the will to live never ceases to amaze me. The author has done extensive research by going through diaries, letters, and interviews to the descendants of the survivors and some who didn’t. This is a heartbreaking tale but I’m glad the author wrote it, not to mention I was happy to find it. This story will haunt me for a while, though."}, {"userName": "Kelly", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/232155-kelly", "userReview": "In 1913, a Canadian expedition sets out for the Arctic on a ship called the Karluk, hoping to explore and discover new land. The Karluk was an old ship not suited for ice breaking, and she gets frozen into the ice. Then the leader of the expedition takes a few people with him \"to hunt\" and ABANDONS THE EXPEDITION. The Karluk, still stuck in the ice and still containing the ship's crew, expedition scientists, and some Eskimos (including a family with two young daughters!), starts drifting and is inevitably crushed by the ice. Then it becomes a story of survival, traveling over the ice to find the closest land, an island, then the captain and another man travelling hundreds of miles to Siberia and Alaska to secure a rescue ship. There is fighting, stealing, suffering, murder, starvation, sickness, and death...and there is also hope and survival over unbelievable circumstances.After the usual adventure non-fiction slow start where you meet the crew and try to keep their names straight as you get to know them, the book reads like a thriller. It's a captivating, horrifying narrative full of details. Some of my favorite parts of the book, for what it says about the human spirit, were when the ship's cat was mentioned. Grown men, freezing, starving, and suffering form an unknown illness, shared their food to keep the cat alive. I can't get enough of polar exploration because in spite of absolutely ghastly experiences, people manage to show great compassion, bravery, and selflessness."}, {"userName": "Bethany Swafford", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/10084766-bethany-swafford", "userReview": "An ambitious man sets of on an Artic expedition on a ship not even remotely suited for the icy conditions that await, with a crew that has next to no experience in dealing with the arctic conditions, and poor organizational skills. What could go wrong?Everything. Everything could go wrong and it did. This narrative is based on letters and journals and reports of the members of the expedition. In some instances, the hardships brought out the best of humanity, selflessness and bravery. However, it also revealed the worst of humanity: selfishness, betrayal, and laziness.It was impossible not to be affected by the horrors faced by these people. At a time when they ought to have been united in surviving, they were divided by their own thoughts of how things should be done.For readers who enjoy true stories and feel strong enough for tragedy, I would absolutely recommend this book."}, {"userName": "Steve Ward", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/68536866-steve-ward", "userReview": "So glad a church friend lent me this book as it is exactly the type of book I love to read, historical nonfiction. The author did a lot of research to set the record straight on what happened on the fateful voyage. My only criticism would be it was repetitive in the details of how each day went so the book could have been 100 pages shorter. But my guess is she was trying to get the reader to feel how desperate the situation was by telling about the struggle over and over. An enjoyable read about exploring in the harsh Arctic region."}, {"userName": "Jacquie", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/9172799-jacquie", "userReview": "Absolutely amazing!! This is an incredible book that made me realize just how comfortable a life we live. To spend over 12 months not knowing if you would ever see civilization again. These men, women and children persevered beyond anything I have in me. I would have given up long ago. I also learned so much about the Arctic. I Googled many things along the way and that was fun. It was a bit of a slog, but only matching with the story really. Definitely worth reading in its entirety!"}, {"userName": "Nikki Balzer", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/20151643-nikki-balzer", "userReview": "what a facinating read. Jennifer Niven has done a great job of tying this altogether from the various diaries of the men involved. what an amazing, epic and tragic tale in an era of adventure. i couldn't imagine having the will to live as these men did, beset over and over by life knocking the stuffing out of them. walking 50 miles and more through snow and ice then turning round at the end had doing it again towing a sled. do people like this even exist anymore ??"}, {"userName": "Michele", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/271190-michele", "userReview": "I picked this up from a giveaway pile because I've read other books by Jennifer Niven and really enjoyed them. This book was no exception, although it is definitely a different style than her fiction books. Her account of the experiences of these men struggling to survive in the Arctic for more than a year was spellbinding. Even though I knew more or less how it ended, I couldn't put it down. Everyone's story should be told in this way!"}, {"userName": "Larry Hamilton", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/70362194-larry-hamilton", "userReview": "A truly amazing and horrific story of human survival under the most extreme conditions. I felt the story was a little longer than need be. I had a difficult time keeping track of all the comings and goings of the men in their travels between camps, etc., making for a rather repetitious read. A worthy story nonetheless."}, {"userName": "Anna", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/2532754-anna", "userReview": "So good! I like the chronological order of this book from setting out to rescue (albeit with the Herald Island prologue and after). What a contrast of behaviour between Barlett's presence and absence. A perfect example of leadership making a difference (like Shackleton). Once Bartlett had left to seek help, the order of things completely falls apart - lying, stealing and maybe even murder."}, {"userName": "Bill", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/1387036-bill", "userReview": "This was the next to the last expedition to the Arctic in a wooden vessel. It left hurried and ill equipped. The expedition's leader deserted weeks into the voyage. Here lies the horrors of an Arctric shipwreck and stranding. Surprisingly many members survived to tell their story and this is it. A gripping tale."}, {"userName": "Greynomad", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/7175279-greynomad", "userReview": "I am just surprised that someone didn't find Stefansson and make that asshole disappear.A good read but a bit long especially of the ship life as they were locked in ice...."}, {"userName": "Ann", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/2916067-ann", "userReview": "Incredible"}, {"userName": "T.", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/7785902-t", "userReview": "No spoilers. Based on the wreck of the ice ship Karluk. Interesting read with plenty of pictures. Well-researched. I recommend it for anyone interested in shipwrecks."}, {"userName": "Cynthia", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/37193849-cynthia", "userReview": "Really interesting. Fascinating that these guys had no training."}], "description": "The Karluk set out in 1913 in search of an undiscovered continent, with the largest scientific staff ever sent into the Arctic. Soon after, winter had begun, they were blown off course by polar storms, the ship became imprisoned in ice, and the expedition was abandoned by its leader. Hundreds of miles from civilization, the castaways had no choice but to find solid ground as they struggled against starvation, snow blindness, disease, exposure--and each other. After almost twelve months battling the elements, twelve survivors were rescued, thanks to the heroic efforts of their captain, Bartlett, the Ice Master, who traveled by foot across the ice and through Siberia to find help.Drawing on the diaries of those who were rescued and those who perished, Jennifer Niven re-creates with astonishing accuracy the ill-fated journey and the crews desperate attempts to find a way home.", "title": "The Ice Master", "url": "https://www.goodreads.com/book/show/587013.The_Ice_Master", "average": 4.1, "cover": "https://images.gr-assets.com/books/1433190347l/587013.jpg", "reviews": 165, "authors": [{"url": "https://www.goodreads.com/author/show/45592.Jennifer_Niven", "name": "Jennifer Niven"}], "type": ["History", "Nonfiction", "Adventure", "Travel", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/587013.The_Ice_Master", "http://www.goodreads.com/book/show/1596673.The_Ice_Master", "http://www.goodreads.com/book/show/418922.The_Ice_Master", "http://www.goodreads.com/book/show/18871715-the-ice-master", "http://www.goodreads.com/book/show/18460392-all-the-bright-places", "http://www.goodreads.com/book/show/28686840-holding-up-the-universe", "http://www.goodreads.com/book/show/6193902-velva-jean-learns-to-drive", "http://www.goodreads.com/book/show/10790345-velva-jean-learns-to-fly", "http://www.goodreads.com/book/show/526432.Ada_Blackjack", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}