{"ratings": 12032, "userreviews": [{"userName": "Petra X", "userReviewDate": "Oct 07, 2012", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "Marigold loves her daughters a lot. But she loves herself far more. She sees them as children to be formed in her own egotistical image to reflect what she wants the world to think of her. She has one adoring child and one who is beginning to want her own life and not want to look after her mother anymore. Both desperately seek an adequate parent instead of some weird 'best friend' and put their hope in absent and previously unknown fathers. The mother predictably has a breakdown, predictably over a man, and the daughters, predictably find that fathers just aren't people you can rely on either. But they have each other and back they go into their old life of looking after mum again.I enjoyed this book, I enjoyed the film too. I wonder what my perspective on it would have been if I'd been between 10 and 15, the target audience? Probably I would have adored the hippie mother rather than despised her selfishness and thought what good kids the daughters were enabling her to behave so badly and dress so well. And just as the author intended I too wouldn't have been able to see the possibly of help that didn't involve losing their ditsy mother. Hindsight is easy, especially with books."}, {"userName": "Kiki", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/4074594-kiki", "userReview": "I'm pretty stunned by the middling rating for this book. Sure, it's a little dated: we don't say \"manic depressive\" anymore and nor do many of us still see tattoos as particularly shocking (though I can say from experience that being covered in them oftentimes begets loud and unsavoury opinions from strangers). But there's an earnest, powerfully lovable tone to Dolphin's voice, as she struggles so hard to be seen, and later to survive as her life at home spirals completely out of control. She is so penned in by misery that she invents wild scenarios and stories inside her own head, idealising every situation and so ending up disappointed when reality proves expectedly ugly.There are layers upon layers to this book that, when I first read it about twelve years ago, I couldn't have picked up on: the pattern of Marigold's depression and mania, her delusions about Micky, her alcoholism; Star desperate to conform, both to protect herself from the viciousness of the uncaring community and to experience the comfort of \"normality\"; the overwhelming stigma against mental illness in the community; Oliver's mother's circumstantial depression; the emotional abuse inflicted upon Dolphin by her schoolteacher. It's a heavy novel, heavier when you read it again as an adult. I cried multiple times, particularly in those dark moments when Dolphin believes that she is always second best, never good enough, utterly forgotten. It's even more upsetting when we find that she was conceived while Marigold was in a relationship with a man she was using as a substitute for the infamous Micky. Dolphin is a painfully lonely child, so much so that it's often difficult to read. There's a loose, messy ending to this story, a hallmark of Jacqueline Wilson, who writes with incredible and sometimes shocking realism for her young audience. But life is messy, and things don't tie up, and there truly are no happily ever afters. Better this - better that young people understand that what they're striving for is not perfection and undiluted happiness, but to always be moving upwards. Maybe some people don't like that, and maybe they'd rather this was a nicer story. But real life is harder and more terrifying than any make believe. We may as well prepare for it."}, {"userName": "Rebecca", "userReviewDate": "Sep 23, 2012", "userURL": "http://www.goodreads.com/user/show/6437963-rebecca", "userReview": "Re-read for #ReadForMentalHealthWeek. I hadn't read this book for years but it was always one of my favourite Jacqueline Wilson books growing up. I can definitely appreciate it more as an older reader, and understand more how Marigold was acting and how it impacted Dolphin and Star."}, {"userName": "Joey Woolfardis", "userReviewDate": "Jul 17, 2016", "userURL": "http://www.goodreads.com/user/show/4639825-joey-woolfardis", "userReview": "Read as part of The Infinite Variety Reading Challenge, based on the BBC's Big Read Poll of 2003.This was much better. Probably because it is \"for older readers\" but more on why that's a load of bollocks later. Darker, and not at all twee, so definitely better all round. Full review to follow.Blog | Instagram | Twitter | Pinterest | Shop | Etsy"}, {"userName": "Alice Nachir", "userReviewDate": "Jul 24, 2012", "userURL": "http://www.goodreads.com/user/show/11245030-alice-nachir", "userReview": "The Illustrated Mum by Jacqueline Wilson is a book that really relates to my childhood experiences whilst growing up. Marigold is a mother who is eccentric to say the least; is covered in crazy tattoos, and tends to put the needs of her two daughters Star and Dolphin, last. Her daughters adore her but wish for her to become more 'normal'. The mood of the book is somewhat depressing yet hopeful with spurts of humour. I can see this book relating to many children coming from broken homes and families. Star is embarrassed by her mother and desperately wants her to change, however Dolphin admires her mother and constantly wants to please her which is extremely difficult. This is due to Marigold having a mental illness as she struggles to cope with her emotions,having severe mood swings. Growing up myself with a mother with a mental illness, I found real comfort in this book that I was not the 'only one'. Jacqueline Wilson uses much dialogue between characters in this book to convey the messages of a mother living with the responsibility of two daughters while trying to manage a mental disability, and the difficulties of two daughters hoping for change and being strong through everyday family difficulties. Jacqueline Wilson makes the characters come alive so well in this book which is what really reels the reader in. The appropriate age range for this book would be age 10 +. This is due to the book covering many sensitive issues that a younger audience may not be able to connect with. This book would be great for children to read in small groups, where they could pause and discuss feelings and situations of the characters to help them recognize different family situations and increase sensitivity to particular life situations."}, {"userName": "Ed", "userReviewDate": "Feb 13, 2009", "userURL": "http://www.goodreads.com/user/show/558700-ed", "userReview": "I think this is one of Wilson's darker and more depressing novels, geared toward slightly older children. Marigold is great at getting tattoos, not so great at anything else. Especially naming children - poor Dolphin. Dolphin doesn't even like dolphins. I remember that. The novel focuses on Marigold's spiral into depression, and touches on some sensitive subjects - mental health and depression, alcoholism, learning difficulties, bad parenting... At the age of eleven or whenever I read this book, I couldn't relate to a single one of those issues, but the book still got to me.I found the book quite fascinating. Mental health issues - Marigold, as it turns out, suffers from manic depression - have always held interest with me. And poor awkward little Dolphin turns out to be quite gutsy and resourceful, which is nice. I felt for her. It sure as hell can't be easy dealing with a crazy momma."}, {"userName": "Namratha", "userReviewDate": "Feb 27, 2011", "userURL": "http://www.goodreads.com/user/show/114559-namratha", "userReview": "First up, I loved the title. I was tickled pink by this fresh badge for a heavily-tattooed individual. It immediately flooded my mind with images of a lean young woman whose pale skin was totally blanketed by inked crosses, cryptic motifs and a host of Celtic symbols.And the story itself floods you with a bucket load of emotion.It’s a tale of Marigold; a free-spirited, auburn-haired, rocker-vibe infused, covered-with-tattoos single mother. She has two young daughters Star and Dolphin, both from different fathers. Marigold sounds like a free-thinker’s edgy dream. You expect the story to be about a fiercely independent heroine who fights against a disapproving society so that she can raise her daughters in the way that she wants them to be raised. You expect the pages to be bursting with flower-power and righteous indignation.Sadly, life is rarely a walk down a garden path.Marigold suffers from Manic-Depression. She refuses to believe that she has a problem and the possibility of taking treatment is a non-existent option. Star and Dolphin have become accustomed to their mother’s weird spells. But getting used to something does not necessarily mean that you are resigned to it and willing to accept it with a weary roll of your eyes. Marigold parties hard, gets herself inked at regular intervals, pulls all-nighters with random men, drinks indiscriminately and leaves behind a sorry train-wreck for her daughters.Star, the elder daughter, used to love her mother’s uniqueness but as she grows up, she seeks the safety of conformity. She cannot excuse Marigold’s \"episodes\" anymore and just wants a normal life. Dolphin, on the other hand, still loves her mother to distraction. She adores her brightly coloured, covered-like-a-comic-strip parent. She cherishes the little gestures Marigold makes in her brief moments of sanity. Dolphin loves Star too and though the sibling affection is reciprocated, things will soon come to an ugly head. \nThe Illustrated Mum\n is a book that explains Dolphin’s journey of trying to be an adult in a world that is unpredictable and at times downright scary.Jacqueline Wilson is a children’s author who has always been credited for taking up serious issues in a child’s life and handling it with a winning combination of sensitivity and humour. In \nThe Illustrated Mum\n, she tackles a grave issue and leaves you with a sizeable knot in your throat. The comical quips were few, but the author makes you ache for Dolphin and her earnestness. Wilson’s preteen heroines are usually full-of-beans and ready to take on the world amidst their own private hells. Dolphin is no different. She raises all your dormant maternal instincts and makes you want to crush her in a big, squishy comforting hug. My only grouse was with the abrupt ending. I didn’t particular appreciate the convenient tying up of odd ends. It felt like a cop-out.And yet, you clamber on till the end since you want a happy-ending for Dolphin."}, {"userName": "Codie Austin", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/21253712-codie-austin", "userReview": "So, the story in a nutshell, follows Dolphin (yep, that’s her name…), and her sister Star (which is a name that doesn’t actually seem that bizarre in comparison to some children I’ve met…) who live with their mother Marigold who is clearly suffering from some sort of manic depression throughout the story. Star’s Dad Micky comes on to the scene and whisks Star (who is the parental figure to both Dolphin and her mum, Marigold) away, leaving Dolphin dealing her poorly mum as well as school bullies and trying to look after herself, despite being only 11. There are some really dark points in this book that I hadn’t noticed, or fully appreciated as a child. For example, Marigold steals, or at least has in the past stolen, some credit cards. Also, Dolphin shows some traits of Obsessive Compulsive Disorder - presumably the only way she can find control in her life. It was also quite difficult to read as my Mum suffered with depression when I was a child, so some parts were particularly relatable (although thankfully not all!). In fact, I think it was a frighteningly real portrayal of a parent who is suffering with their mental health and a very brave, but important, risk to take for a children’s book. Spoiler alert: There is no dramatic “happy ending”, where everything is suddenly okay again, and I personally appreciated that. It’s not how life works and although the ending is upbeat and optimistic, it’s also realistic and doesn’t patronise the children reading the book. I think that’s so important. There was a moment, when Oliver and Dolphin call up a leisure centre and just so happen to manage to get in touch with Dolphin’s Dad, who she has never met, which did feel a bit too easy and very unrealistic. Aside from that, it was easy to forget that I was reading a book that is intended for children, such is Wilson’s writing. It really is a timeless book that I absolutely loved re-reading and I’m excited to start the next one already!"}, {"userName": "Laura", "userReviewDate": "Feb 06, 2016", "userURL": "http://www.goodreads.com/user/show/20608600-laura", "userReview": "This is possibly one of my very favourite Wilson books. Like most of her books, I read it many times as a child. Looking back as an adult, it's clear the mother is living with some form of mental illness, most likely bipolar disorder. As a child reading this, and from the perspective of the child from which this book is written, all you understand is that Mum is quite impulsive and a little bit weird. She isn't like a normal mum, there's often little money to buy the things the two daughters (Dolphin and Star) need. Mum is instead very good at telling stories and coming up with fun things to do. As with all mental illness, living with someone affected has its downsides.I was impressed on how Wilson challenged the stereotypes surrounding mental health issues. Mum isn't crazy, she's just wired differently. That doesn't make her a bad person does it?"}, {"userName": "Chetana", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/4622325-chetana", "userReview": "Re-read this book for the nth time. That Jacqueline Wilson is such an underrated children's book author, continues to surprise me. Her depiction of dysfunctional, broken families - in this book, it was that the tattooed single mum who is manic depressive but very loving - is refreshingly honest and real. Though these families are extremes, the emotional roller coaster that they encounter is so familiar. Whether it's a neat four member-ed unit or a mother-daughter duo, families _are_ wrung with conflicting feelings of selfishness, irritation, (lack of) respect and love towards one another; it's a reality that's rarely found in a children's book. Giving this a five for both the story and Wilson."}, {"userName": "Jade Singleton", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/12641093-jade-singleton", "userReview": "The Illustrated Mum is the story of ten year old Dolphin and her life living with Mum, Marigold and older sister, Star.Marigold is not your average Mum. She does not work, is covered in tattoos and likes to party. Marigold, Dolphin and Star live together in a run-down flat and the story, which is told by Dolphin, describes her life growing up. Dolphin is very naive and although she realises that her mother is different to others, she always sees the good side. She is very innocent compared to her older sister,Star. Star is a young teen with little patience for her Mum's behaviour. She often argues with Marigold, and Dolphin often feels caught in the middle.I have read this book as a child and i'm now reading it again. I love this book as it is so easy to develop Dolphin's character in your mind and fall in love with her innocence. The book really enables you to see beyond a typical middle-class family, and demonstrates how important a family bond is no matter what background.I would recommend this book for children aged 10-12 and would suggest it for independent reading in a year six classroom. I do think however, that this book for appeal more to girls. This book is a great read and will evoke laughter and maybe even tears."}, {"userName": "Kate (Lillytales)", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/30538697-kate-lillytales", "userReview": "Jacqueline Wilson was one of my all-time favourite authors during childhood and I picked up the Illustrated Mum again as a bit of an experiment. I wanted to read it from an adult perspective as I remember being a little upset by it as a child. The Illustrated Mum is the story of two sisters, Dolphin and Star, and their Mum Marigold. Marigold isn't a 'typical' Mum as she struggles to form a parent/child relationship with the girls. Dolphin and Star spend a lot of time worrying about Marigold as she drinks a bit too much, continues to spend money they don't have on tattoos and she is continuously searching to reclaim her relationship with Star's father, Mickey. I think it's fantastic how Jacqueline Wilson gives children a different perspective on family structures. A common theme throughout all of her books is the idea of diverse families with real-life problems. I think it's really important for children to have access to a diverse range of stories surrounding family and Wilson's books are a vital role in showing that growing up isn't always peachy keen. Sometimes children are forced unwillingly into adult roles and this is a story of love, endurance and the power of empathy."}, {"userName": "Lucy Baldock", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/19620111-lucy-baldock", "userReview": "I enjoyed this it was an easy book to read. I'll be studying this on my children's literature course and I think this is a great book for children to read in the respect that they can learn a lot about functional families, the way kids are treated at school, and question what a good parent is. However I don't know if younger children would fully understand that the mother has manic depression. There is also a mention of Dolphin having Dyslexia and it doesn't really go into depth about what this means and how she struggles with this compared to other children I would have liked to have seen that explored more. Also the ending is very unresolved we don't know where the daughters end up throughout it all which I personally would have liked to have seen. Overall it was a good children's book though."}, {"userName": "Devon Flaherty", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/17163060-devon-flaherty", "userReview": "....I had a week before me, during which I was planning and packing for a very big trip, two thick books lined up in the queue (which would be the wooden box between my front door and the couch), and Dustbin Baby already read. I was not that impressed, and took a stroll through the giant spreadsheet of my Best Books to Read, where I found a total of twelve more Jacqueline Wilson books. I was not pumped. But I was surprised.Who is this Jacqueline Wilson character that she makes the top 1200 (or so) books thirteen times and yet ceases to impress me? I’ll tell you. She’s a British lady. She has written over sixty-one YA books. She is now some sort of tour de force, complete with a whole online wonderland of games and information, as well as more than a few books-to-movies. She became popular after something like thirty books, when she wrote The Story of Tracy Beaker. Her popularity is thanks almost entirely to the people of England. And here is her schtick: since the 70s, she has been writing short, accessible, encouraging yet realistic books about kids and teens in really tough situations. I ended up gobbling down six more Wilson’s books (that’s all my American library had) before laying out my judgement, and the topics that sampling covered (some of her most lauded, included) were being a foster care child, having a parent with a mental disorder, dealing with the death of a friend, going through parental divorce, being a twin, and being abandoned by your parents.I can’t help but keep thinking about the comment I received about my book from Zack Smith at the local paper: “I’m just going to say it: More coming-of-age novels need stuff like this. Estranged parents and soured relationships can only take you so far.” And yet, I think that Wilson’s books, with their accessibility and their very real and positive outlook, are also important to children. And I don’t know who benefits more: kids who can relate to this stuff, or kids who can learn compassion and understanding. (On the other hand, I think romps into light, airy, and imaginary worlds is also good food for the developing mind.)These are the books I read (some of them in an afternoon), in this order: Dustbin Baby, 2001 The Illustrated Mum, 1999 Double Act, 1995 The Story of Tracy Beaker, 1991 The Suitcase Kid, 1992 Vicky Angel, 2001 Girls in Tears, 2002In the end, these books are not really my cup o’ tea, although there was some fun in breezing through them and analyzing them together. And really, I can see the merits of them. Really. Writing-wise, they were unspectacular. Wilson sticks to such straight-forward vocabulary that it can grow flat. At no time was I transported to a grassy hillside. While her characters are rounded out nicely, her plots (I think because of the featureless writing style) leave you wishing for more. With all these terrible, real-life situations and triumphant endings, I ended the last page of the last book wondering why my heart had not soared nor one lonely tear come to my eye. However, the ideas behind the books are solid, and the insight, empathy, and tact with which she writes about them are spot-on. She understands kids–and these kinds of kids (/preteens/teens)–unlike any other author (or even person) I have ever read (met).Six random observations:One, I absolutely love the way so many of her main characters see themselves in such negative terms (including, of course, their appearance, but also often their behavior) or even just unrealistic terms, but Wilson never takes the easy way out explaining and patronizing about how they really are beautiful or slender or kind or whatever. The character always slowly, and in a very understated way, discovers something redeemable about themselves, for themselves, and with the tender help of one compassionate person. We need not cue the sappy music.Two, these books are for girls. Out of the seven I read, not one of them would be of too much interest to a boy. They were all about girls and written to girls. That’s all.Three, part of how Wilson does her Wilson-thing is using illustrations (by Nick Sharrat) and other story-telling devices. Yeah, lots of YA books these days use them, too. Like Captain Underpants and Origami Yoda. Wilson uses different techniques in each book, like telling the story through a journal, or starting each chapter with a letter of the alphabet, or hanging the storyline in the structure of a walk through town. Got it?Four, I also love that she is honest about how kids perspectives are often skewed, especially in that they are often attached where it is unsafe and repelled where it would be good. So many times, her heroine clung to an unhealthy relationship because it was familiar, justifying behaviors and running an internal dialogue of excuses, or separated themselves unwisely from people that could have offered them much better than they were already getting. We adults could take a hint, too.Five, occasionally Wilson’s books bring up the occult or witchcraft, and not necessarily in a fantasy way. I believe she regards it as a type of play-acting, but the line is a thin one. Several of her characters imagine themselves using magic to change things around them or even hurt others. One of the characters imagines a friend who is an “ace” at the occult (turning into a vampire, etc.). Also, Christian belief is seen more in negative terms. The kid characters tend to view religion as worthless and even mock it, while the only positive religious character I read in Wilson’s books was sort of flaky about her religious affiliation to the point that you eventually forgot she was a Christian. (I only just now remembered her because the description of her stiff collar clashing with her lively pants was a stand-out.)Six, there are movies. I have not seen any of them yet, and have no idea about their availability stateside, but I plan to look into it.The Illustrated Mum is a fascinating book for me, not least of all because I too have a family member with bipolar disorder. I found it to be part of the new language and dialogue about this and similar illnesses, where they focus more on the positive elements of the bipolar (or autistic or ADHD or whatever) personality. Being as that may, the mother was an entrancing character, and the struggles of the family so honest and accurate. Besides the slightly cheesy last paragraph, I found this book much better than the first.....REVIEW FROM THE STARVING ARTIST"}, {"userName": "Navdip", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/68484644-navdip", "userReview": "The Illustrated Mum follows the life of a young girl called Dolphin who lives with her older sister Star and mother Marigold who is currently suffering with mental health issues.I actually enjoyed this book a lot more than I was expecting to but I think that is just a testament to how good Jacqueline Wilsons' writing is.I began to care for all three characters really early on and I really wanted a happy ending for Dolphin.I liked Dolphin's friendship with Oliver and it was good to see that she stuck to her guns and decided to be friends with a less popular child over the girls who were popular but mean.The storyline felt real and believable and I feel Jacqueline Wilson wrote about difficult topics such as mental health issues in a respectful and hopeful manner.I feel there are many young people who will be able to relate to Dolphin, in particular to the experiences that Dolphin went through at school (being picked on) and also how she felt left out when Mickey came along.The relationship between Dolphin and Michael was nice to see and I actually liked how it started off a bit awkward to begin with.The ending seemed hopeful and I was glad everyone made up in the end. But I would have loved to have known what happened next and whether Dolphin stayed in touch with Michael.All in all, I really enjoyed The Illustrated Mum and I would definitely recommend it to younger readers."}, {"userName": "Jenn", "userReviewDate": "Aug 18, 2009", "userURL": "http://www.goodreads.com/user/show/229988-jenn", "userReview": "Maybe I'm just way too cynical but I kinda resented the last quarter of this book. The story started off brutally honest, real, uncomfortable, and a bit sad. Two daughters, one of them a teen called Star, the other younger and called Dolphin (Dol), live with their mother, Marigold, who is mentally ill. Because the reader knows this right off the bat, it is difficult to hate her or see her as the villain. For awhile, honestly, there is no real villain except for the community as a whole who does absolutely nothing to help the mother or her daughters. There's the horrible neighbor who threatens and berates, the kids at school who tease mercilessly and their worthless teacher who may as well be one of her students for all the good she does. Star's father turns up and we can't even hate him because this is the first he's heard of Star. He assumes responsibility for her immediately and attempts to get her away from her crazy, tattooed mum. She welcomes this and runs off to live with him. Poor Dolphin is left to take care of Marigold. She has a breakdown one night and Dolphin, innocently, calls for help and Marigold is shipped off to the hospital leaving Dolphin with nowhere to go. And here is where the story turns into a ridiculous fairytale which didn't sit right with me. I listened to the audiobook version which I would recommend. There is a charm to the writing and I did find myself rooting for Dolphin, Star, and even Marigold. Marigold has it rough. Her deck of cards sucks and she's doing the best she can. As are her daughters. When it became more of a fairytale story, I didn't need to root anymore and that was disappointing."}, {"userName": "Vityska", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/44040570-vityska", "userReview": "Маргарита – особлива мама. Вона не зважає на умовності і любить усе-робити по-своєму, її тіло вкрите кольоровими татуюваннями, за якими можна «прочитати» найважливіші події її життя. Маргарита – саме та мама, про яку тихцем мріють бунтівні тинейджери. Але рідні доньки знають, що життя із нею – ще той подаруночок. Любляча і щира, інфантильна і розпачлива, хаотична, яскрава, незграбна, неуважна, емоційно нестабільна щедра і безвідповідальна, вона перетворює життя Зірки і Дельфінни на вибуховий феєрверк. Але якщо молодша, Фінна, ще приймає мінливі правила матусиної гри, намагаючись навіть у найдивніших ситуаціях знаходити щось дивовижно пригодницьке, то старша, Зірка, відчайдушно повстає проти звичного плину життя. А коли на горизонті з’являється омріяний татусь, хитка влаштованість їхнього повсякдення летить шкереберть. І всі троє дівчаток опиняються на роздоріжжі, вагаючись, який вибір зробити. Ця книга насправді не така весела, як може здатися на перший погляд. В ній багато відчаю і розгубленості. Відчуття, наче земля втікає з-під ніг, у ній межує із відчуттям непотрібності, недосконалості, недолюбленості. «Розмальована мама» - це книга про те, що мама – якою б шаленою вона не була – завжди лишається найкращою для своїх дітей. Але у цього глянцево-позитивного твердження є й зворотна темна сторона. Адже іноді мама, попри всю свою щиру любов, може бути потенційним джерелом небезпеки своїх дітей. Цей момент – коли розхристаність переходить за безпечні межі - дуже важливо вчасно помітити і зафіксувати. Тоді буде надія на хеппі-енд – як вона є і в книзі Жаклін Вілсон."}, {"userName": "Shajeda Begum", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/29741686-shajeda-begum", "userReview": "I read this book when I was around 10 years old and I personally loved this book. The story explores different things children experience as they are growing up. The mother Marigold is covered in tattoos and she always puts her two daughters: Star and Dolphin last. She is not an attentive mother and she is quite self centred. Her daughters wish for their mother to be normal. The book is quite gloomy however there are many instances where there is humour. This book touches on social issues such as loneliness; it explores the life of a single mother therefore a lot of children can relate to Star and Dolphin's story. Star is embarrassed by her mothers actions but Dolphin admires her mother a lot and is constantly trying to please her. Marigold's actions are due to her mental illness therefore she battles with her inner self and her emotions tend to become quite dysfunctional. The characters in this book portray a realistic lifestyle and many children can relate to it. This chapter book is suitable for children in KS2 who are comfortable with chapter books. However it is more appropriate for children year 5 + because the themes explored in this book are sensitive. The book could be on a shelf in the classroom or the library for children to read independently during reading time or they could take it home to read over the weekend."}, {"userName": "Ana Dias", "userReviewDate": "Jul 11, 2015", "userURL": "http://www.goodreads.com/user/show/30442794-ana-dias", "userReview": "Finalmente li este livro! Depois de tanto tempo (demasiado até) à espera na prateleira, de já o ter começado e ter desistido e de o ter emprestado a amigas antes de o ler (o que acontece raramente), li-o de enfiada num dia, porque realmente não consegui parar.O título pode parecer infantil (muito devido à tradução) mas a história não é, de certeza. Adorei-a, do princípio ao fim: uma família problemática na qual o amor consegue vencer.Quanto à escrita, já tinha lido outros livros da mesma autora e é bastante semelhante:fácil, leve e que consegue acentuar o que é mais importante na narração, neste caso os sentimentos da pequena Dolphin. E a propósito desta personagem, também apreciei que tenha sido ela a contar a história uma vez que ela era um pouco negligenciada no meio de tudo e este papel de narradora veio dar-lhe o destaque merecido."}, {"userName": "Bookgirl15", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/7641595-bookgirl15", "userReview": "I really enjoyed this book. Marigold has two daughters one who doesn't mind having her as a young mother, but the other one wants to start a life of her own because she is really fed up with having to look after Marigold all the time. So they are searching for their unknown fathers, then they sadly both end up in care while something shocking has happened to Marigold.Dolphin adores her mother, she loves her wavy red hair and her tattoos and she is convinced that she is really good at making up stuff, but Star absolutely hates her tattoos and Marigold drinks a lot of vodka, it really worries Star and she thinks that one day Marigold is going to get seriously ill... I really like Dolphin because she is a good friend to have and is good at making up stories she doesn't seem to not worry a lot because she thinks that Marigold is a good mother, Star has other ideas about her."}, {"userName": "Lisa", "userReviewDate": "Apr 18, 2010", "userURL": "http://www.goodreads.com/user/show/3191832-lisa", "userReview": "This book is pushing a five star rating. I really loved it. I loved how each chapter was named after one of Marigold's tatoos and each tatoo had some significance to that part of the story and Dolphin's life with her mum or her sister, Star. I thought the author's portrayal of this type of mental illness through the character of Marigold was very accurate. This is a serious subject and a serious story, but Wilson makes it very accessible to a younger audience, probably 11 and up I'd say. I loved the illustrations throughout the book. A great read, I didn't ever want to stop reading it :) p.s. In hindsight I've decided to give it five stars. That last little star has been haunting me."}, {"userName": "Siobhan", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/35855553-siobhan", "userReview": "Wilson is great at making realistic characters that you can quickly come to term with, giving realistic reactions to events.Her books are great at getting children to really think about actions and their consequences, really opening the eyes of children to the world. Some of her books are sensitive reads yet they are all great at sending life messages to children.I feel as though Wilson books are a must in the lives of young children, a way of opening their eyes to the real world in the right way."}, {"userName": "Vanessa", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/4620987-vanessa", "userReview": "This is one of the saddest, most heartfelt books I've ever read. IT totally transforms you to a different state of mind, and Jaqueline Wilson writes with such careful carelessness that she might as well be writing about Little Red Riding Hood whereas one might think that the depth and gravity of The Illustrated Mum would require a much more emotional writing style.Overall the effect is astounding. I never expected to like her book this much."}, {"userName": "BookPower", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/76775680-bookpower", "userReview": "Cute but sad. Very emotional."}, {"userName": "Mafalda de  Oliveira", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/46305923-mafalda-de-oliveira", "userReview": "4.5"}, {"userName": "Sophie", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/26827889-sophie", "userReview": "Brilliant. I think I found this book quite scary when I read this when I was younger; given it deals with manic depression among other things. Wilson does take a very adult subject matter and presents it brilliantly for younger people. I can only imagine how effective this book could be for the right person who stumbles upon it."}, {"userName": "* Maru * (FellInLoveWithABook)", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/49454710-maru-fellinlovewithabook", "userReview": "Rating: 3.5 starsThis is the kind of book I would have loved as a kid. Obviously, reading it as an adult brings up a different feel to it. Still, the nostalgic warming feeling is definitely worth it."}, {"userName": "Nazhath ", "userReviewDate": "Sep 20, 2015", "userURL": "http://www.goodreads.com/user/show/46784193-nazhath", "userReview": "The Illustrated MumThis story is about Dolphin, her older sister Star and their mother, Marigold. Marigold likes to adorn her body with tattoos; Dolphin finds them beautiful whereas Star despises the growing addition.Both sisters are shown to be opposites. Dolphin doesn’t have any friends and is lonely most of the time as opposed to Star, who is quite popular in school and goes out with her friends quite often. Their mother Marigold doesn’t work and is always usually in bed during the day and once awake, likes to go out and party during the nights, leaving the girls by themselves. Although not leading a normal life, Marigold loves her daughters and tries to make amends with them by baking cakes when she doesn’t arrive home on time from a late night party. Although Dolphin quickly forgives and accepts her gesture, Star decides not to and rejects eating the cakes. Whilst Dolphin easily forgives her mother and finds her to be amazing, glamourous and larger than life, Star finds her to be an embarrassment and becomes tired of her growing tattoos, boyfriends, drinking, partying and manic depressive episodes. She is also worried about the mounting debt and having to always be the grown, responsible one out of the two. While craves a normal life, Dolphin just wants to keep her family together and be happy.Star’s chance to have a normal life finally arrives when her father Mickey appears, after finding out that he has a daughter. Star decides she would rather live with her dad in Bristol than with her mum. She asks Dolphin to come with her, but she angrily refuses and rebukes Star for abandoning them.Marigold, who has always been infatuated with Mickey, mourns his and Star’s departure and is unable to cope without them. Her mental state worsens and is in turmoil over Mickey’s rejection and Star leaving. Dolphin is left to pick up the pieces and struggles to deal with Marigold’s more frequent and growing manic depressive outbursts. In an effort to appear more acceptable, Marigold decides to cover herself in white paint, to hide her array of tattoos. Scared, Dolphin decides to finally involve the authorities and call an ambulance.Soon after, Dolphin meets her dad for the first time. A married man with children who seems to genuinely care for Dolphin and is concerned for her. She comes to realise how much he actually loved Marigold when they were together for a brief time, and how Marigold was even head over heels in love with Mickey even then. Just like Dolphin, her dad was also made to feel second best.Star makes a reappearance and admits that life with Mickey and his girlfriend in Bristol was anything but great, and how she was told to leave. Marigold wakes up at hospital and is in stable condition. Surrounded by her two daughters, they finally reconcile. The story ends with Dolphin deciding that although they are now in care and Marigold is in hospital, they are still a family. This book is more suited towards older primary school children as it handles mature issues such as manic depression and alcoholism. Whilst dealing with sensitive issues, Jacqueline Wilson writes the story in the mind of young Dolphin, to make it relatable to young readers. Jacqueline portrays Dolphin as a fun and creative child, who loves Marigold immensely even when she has to be a mother to her own mother. This emotive story will touch children, as they read about Dolphin’s problematic home life and her feelings of loneliness, rejection and sorrow. This book would be great for a year 5/6 class as it challenges them to think about social problems and the problems which exist in society that can have a detrimental effect on home life."}, {"userName": "Bookworm234", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/68629059-bookworm234", "userReview": "Jacqueline Wilson is one of my favourite child authors. I read this book a couple years ago and I really liked it. I think that there should be a sequel to this book because it was too good to be a stand-alone."}, {"userName": "Victoria Golovinskaya", "userReviewDate": "May 13, 2016", "userURL": "http://www.goodreads.com/user/show/54753057-victoria-golovinskaya", "userReview": "Еще одна дисфункциональная семья, Жаклин по ним специалист.Все вот это, мама в роли дочки своим дочерям, мама с психическим расстройством, мама с собственным опытом сиротства, окей. Мдп, жизнь как на вулкане в постоянном мониторинге домашней среды и попыток ее балансировать, жизнь, вывернутая наизнанку, и бесконечная тревога, что все нарушится, все кончится и тебя заберут, а ты любишь свою маму, любишь и боишься и ее, и за нее.Базовая потребность ребенка - предсказуемость домашней среды. Чтобы было на что опереться. А тут нет. Тут неизвестно, что каждую минуту будет, и реальность отрицается и переигрывается, и да, она хочет быть хорошей мамой, печет странные кексы и красит потолок в звезды, и соскальзывает, и искажается, и \"это не ее вина, она просто болеет\", но тут хотя бы двое обсуждают, уже есть шанс на реальность, на умение видеть ее, но это только шанс. Наследственность не в генах, наследственность в выучивании способа жить.Как же сложно удерживать все это внутри.Такие книги выполняют важную функцию выведения на свет проблемы. Когда ты растешь в дисфункциональной семье, тебе кажется, что ты на свете один такой, и ты испытываешь по этому поводу бесконечный стыд и носишь печать молчания. А тут можно слышать. Что у других бывает так или хуже и это не вина ребенка. Никогда не вина ребенка.И да, книги Жаклин Уилсон - они пригодны и для детей. Не разрушительны описанием проблем, а целительны, да. Их можно и нужно давать читать детям.**— Ты, наверное, считаешь, что я обжора, каких свет не видывал. — Нет, детка, это здорово. Тебе нужно кушать побольше, а то ты такая худенькая, просто кожа да кости. — Моя мама не очень-то любила готовить, даже когда не болела, — призналась я, на мгновение перестав жевать и глотать. — Зато она наверняка умеет делать что-то другое, — сказала тетушка Джейн. — Она ведь артистическая натура. А твой папа считает, что она вообще необыкновенная. Я задумчиво куснула заусенец. — Она и есть необыкновенная, — кивнула я. — Просто она не сильна во всяких таких вещах… ну, ты понимаешь — как все обычные мамы. Не как ты. — А в чем она сильна, твоя мама? — спросила тетушка Джейн. Я задумалась, по-прежнему старательно обгладывая палец. — Она здорово умеет придумывать всякие истории. — Ага, понятно. Ну что ж, вот в этом мне и в самом деле до нее далеко. Лично я вообще ничего придумать не могу. Я бы не смогла сочинить ни одной истории, даже если б от этого зависела моя собственная жизнь. — А вот я запросто, — похвасталась я. — Тогда, значит, ты пошла в свою маму. — Хочешь сказать, что я кончу в психушке, как моя мама? — Да нет, что-то подсказывает мне, что ты вряд ли когда-нибудь потеряешь голову — для этого ты слишком крепко стоишь обеими ножками на земле. Не знаю только, поймешь ли ты меня, моя девочка."}], "description": "Dolphin adores her mother: she's got wonderful clothes, bright hair and vivid tattoos all over her body. She definitely lives a colourful life. Dolphin's older sister, Star, also loves her but is beginning to wonder if staying with a mum whose temper can be as flashy as her body-art is the best thing for the girls...", "title": "The Illustrated Mum", "url": "http://www.goodreads.com/book/show/511684.The_Illustrated_Mum", "average": 3.75, "cover": "https://images.gr-assets.com/books/1320392229l/511684.jpg", "reviews": 352, "authors": [{"url": "https://www.goodreads.com/author/show/22602.Jacqueline_Wilson", "name": "Jacqueline Wilson"}, {"url": "https://www.goodreads.com/author/show/150121.Nick_Sharratt", "name": "Nick Sharratt"}], "type": ["Childrens", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/511684.The_Illustrated_Mum", "http://www.goodreads.com/book/show/511720.The_Illustrated_Mum", "http://www.goodreads.com/book/show/1413786.The_Illustrated_Mum", "http://www.goodreads.com/book/show/3290700-the-illustrated-mum", "http://www.goodreads.com/book/show/34749406", "http://www.goodreads.com/book/show/7430245-o-cris-ntemo-o-golfinho-e-a-estrela", "http://www.goodreads.com/book/show/30180707", "http://www.goodreads.com/book/show/462684.The_Story_of_Tracy_Beaker", "http://www.goodreads.com/book/show/511527.Double_Act", "http://www.goodreads.com/book/show/266765.Girls_in_Love", "http://www.goodreads.com/book/show/511532.Vicky_Angel", "http://www.goodreads.com/book/show/511566.The_Suitcase_Kid"]}