{"ratings": 100102, "userreviews": [{"userName": "Michelle", "userReviewDate": "Jul 02, 2009", "userURL": "http://www.goodreads.com/user/show/512643-michelle", "userReview": "I’ve been trying to review this book for over a week now, but I can’t. I’m struggling with something: How do I review a Russian literature classic? Better yet, how do I review a Russian literature classic without sounding like a total dumbass? (Hint: It’s probably not going to happen.)First I suppose a short plot synopsis should be in order: The Idiot portrays young, childlike Prince Myshkin, who returns to his native Russia to seek out distant relatives after he has spent several years in a Swiss sanatorium. While on the train to Russia, he meets and befriends a man of dubious character called Rogozhin. Rogozhin is unhealthily obsessed with the mysterious beauty, Nastasya Filippovna to the point where the reader just knows nothing good will come of it. Of course the prince gets caught up with Rogozhin, Filippovna, and the society around them.The only other Dostoevsky novel I’ve read was Crime and Punishment, so of course my brain is going to compare the two. Where Crime and Punishment deals with Raskolnikov’s internal struggle, The Idiot deals with Prince Myshkin’s effect on the society he finds himself a part of. And what a money-hungry, power-hungry, cold and manipulative society it is.I admit that in the beginning and throughout much of the novel I felt intensely protective of Prince Myshkin. I got pissed off when people would laugh at him or call him an idiot. Then towards the end of the novel, I even ended up calling him an idiot a few times. Out loud. One time I actually said “Oh, you are an idiot!” But then I felt bad.Poor Prince Myshkin. I think he was simply too good and too naïve for the world around him.Now here is where my thought process starts to fall apart. There’s just so much to write about that I can’t even begin to write anything. There were so many themes that were explored in the novel such as nihilism, Christ as man rather than deity, losing one’s faith, and capital punishment among other things. And I haven’t even mentioned Dostoevsky’s peripheral characters yet, which, like those in Crime and Punishment, are at least as interesting, if not more interesting than the main characters. My favorite character was Aglaya Ivanovna. She was so conflicted with regard to her feelings about the prince and loved him in spite of herself. I had mixed feelings toward Ganya. I mostly disliked him, but I grew to like him more towards the end. The entire novel was much like a soap opera, but a good soap opera, if that makes sense. Well, at this point I’ve been moving paragraphs around for far too long, and I realize there’s no way this review will do the book any justice. I wanted to write about the symbolism of the Holbein painting and how I love that in both Dostoevsky books I've read he references dreams the characters have, but I just have too many questions and not enough answers. Instead I'll just say that it was truly an excellent read and definitely worth your time."}, {"userName": "Petra X", "userReviewDate": "Oct 03, 2011", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "There are many reviews of this book making out that Prince Myshkin was Christ-like, a truly good man who lived for the moment. A holy idiot, or more accurately, wholly idiot indeed is what he really was. Why did they think Dostoyevsky entitled the book, The Idiot if he meant 'The Man who was Innocent and Really Good\" or \"The Man who was like Jesus\"? The title wasn't any kind of irony, it was about an idiot.Prince Myshkin had spent years in a sanitarium for his epilepsy and returns to Russia where he trusts untrustworthy people, falls for all their plots where he is the patsy, and falls in love with a rather uppity girl who returns his affections and then when it comes to the moment, chooses another woman for all the wrong reasons and thereby ends up rejected by both. He is the very definition of an idiot, he never, ever learns and what intelligence he has he doesn't put to working out the truth of a situation and what he should do to benefit himself. He always falls for the next plot, the next plan, the next person with a glint in their eye for how they can use him to further their own ends. And he goes just like a lamb to the slaughter.Sadly, the debacle, written in a time when not even the word 'neurology' had been invented, let alone the science, is rather idiotic. On getting drawn into a crime committed by a man mad in every sense, crazy and angry, his epilepsy degenerates into a mental illness so deep he crosses over into another land. Bye bye gentle idiot. I was glad to read of you, I'm glad I didn't know you."}, {"userName": "Lisa", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "If Raskolnikov was the charismatic murderer whose side I took despite myself when he killed an old woman out of greed and broke down psychologically afterwards, Prince Myshkin is the supposedly good, childlike Christ figure whom I failed to like at all.Just do make it clear from the beginning: I liked the novel just as much as Crime and Punishment and Notes from Underground, and I found it just as compulsively readable. The cast of characters is magnificent. My sole problem is the character of Myshkin. We are not a likely pair to hit it off, of course.He is a religious fanatic, whose conviction is so narrow-minded that he hates other variations of Christian dogma even more than atheists: “Yes, that’s my opinion! Atheism only preaches a negation, but Catholicism goes further: it preaches a distorted Christ, a Christ calumniated and defamed by themselves, the opposite of Christ! It preaches the Antichrist, I declare it does, I assure you it does!” - I am an atheist, but strongly in support of tolerance and respect beyond the narrow boundaries of one’s own convictions. So I will give Myshkin a pass on his fanaticism, knowing full well he wouldn’t give me one, considering his reaction when he heard his benefactor had converted to Catholicism.He is a Russian nationalist, believing in expanding Russian dogma to the West: “Not letting ourselves be slavishly caught by the wiles of the Jesuits, but carrying our Russian civilisation to them, we ought to stand before them and not let it be said among us, as it was just now, that their preaching is skilful.” - I believe in global citizenship and consider nationalism to be the greatest evil in world history. But I will give him a pass on that one, knowing the historical framework in which it was uttered.He is proud of his lack of education, and does absolutely nothing to enhance his own understanding, despite having leisure to spend all day studying. I believe in lifelong learning to develop as a human being. But I will give him a pass on that one, knowing he suffers from epilepsy and maybe from other conditions as well, which might make learning impossible for him.He is an elitist, openly rejecting equality and democracy in favour of his own, idle class: “I am a prince myself, of ancient family, and I am sitting with princes. I speak to save us all, that our class may not be vanishing in vain; in darkness, without realising anything, abusing everything, and losing everything. Why disappear and make way for others when we might remain in advance and be the leaders?” - I am for equality and democracy, for a classless society without any privileges.He is utterly afraid of female sexuality and almost pathological in his attempt to ignore the fact that it exists, admiring childlike behaviour and the inexperienced beauty of virgins. - I am a grown-up woman.I will let all of that pass, there is no reason why I shouldn’t be able to identify with that as much as with a raving murderer, right? What I can’t accept is his posturing as a “truly good”, almost holy person. That is too much. His social ineptitude, his lack of imagination, his literal-mindedness, his prejudices - all of that might be fitting the time and place where he lives, but it is not objectively good. In fact, I don’t see any goodness in him at all. Even Raskolnikov, poor, and under supreme stress, was able to spontaneously give his last money to a desperate family to finance a funeral. Myshkin does nothing helpful with his fortune, which conveniently fell into his over-privileged lap. On the contrary. He uses the money to cruise in the Russian upper class society and to mingle with distinguished families. He doesn’t work, and isn’t even remotely interested in anything to do with actual progress in society. Instead, he gives credit to whoever happens to be in the room with him at the moment, without engaging or giving any active help, and he changes his mind when another person steps into the room. Critics are eager to call this his “innocence” and gullibility, and to use it as proof that he is a “better person” than the characters who have motives and agendas for their actions. Since when is cluelessness a virtue? And what if he is not an idiot? If you for one second step out of that thought pattern, you can also call his change of mind hypocrisy, or opportunism, or fear of conflict, or flattery. Some might call it Christian meekness. I call it condescension. Myshkin is incredibly one-dimensional in his value system, fearing sexuality and human interaction. To compensate for his fears, he puts himself “above” them, looking down on “weak” people, forgiving and pitying them. But what right has he to “forgive” other people for engaging in conflicts that are caused by his own social ineptitude? If I could see in Myshkin a person who is on the autistic spectrum, I would feel compassion for him and be frustrated that his community is not capable of helping him communicate according to his abilities. But whenever that idea comes to mind, the big DOSTOYEVSKY LITERARY CRITICISM stands in the way. Under no circumstances am I to forget that Dostoyevsky truly saw in Myshkin a Christlike figure, and that he himself was committed to orthodox Christian dogma to the point of writing in a letter (in 1854):“If someone proved to me that Christ was outside the truth, and it was really true that the truth was outside Christ, then I would still prefer to remain with Christ than with truth.”Well, to be honest, I think that is precisely what this novel shows. Dostoyevsky, the brilliant realist writer, writes a story containing the truth of social life as he has accurately observed it, and his Christ is moping around on the fringes, causing trouble rather than offering ethical guidelines. He is absolutely passive, incapable of one single motivated, proactive good deed. Only criminals and ignorant peasants invoke the name of Christ in the novel. The educated people with whom Myshkin mingles are concerned with their own nervous modernity. They act like neglected children, drawing negative attention to themselves to make the (God)-father figure notice them. But he remains silent, ignoring even his most cherished child, the one he sacrificed for all the others, - Christ. It is Holbein’s dead Christ, brutally shown in his human insignificance, that stands as a symbol for the religious vacuum in the novel, a Christ figure that can make people lose their faith, as Myshkin admits himself. The characters argue and discuss their respective positions on philosophy and religion throughout the long digressive plot, and Myshkin mourns earlier times when people were of a simpler mind:“In those days, they were men of one idea, but now we are more nervous, more developed, more sensitive; men capable of two or three ideas at once … Modern men are broader-minded - and I swear that this prevents their being so all-of-a-piece as they were in those days.”That is what he says to Ippolyt, a poor, cynical 18-year-old boy dying (but not fast enough) of consumption. When the young man asks Myshkin how to die with decency, the idiotic Christ figure doesn’t offer him his house or moral support, even though he knows that Ippolyt is in a conflict with Ganya, with whom he is currently staying. No, help can’t be offered, just this:“Pass us by, and forgive us our happiness”, said Myshkin in a low voice.”Oh, the goodness of that (non-)action.Another telling situation occurs when Myshkin receives the clearly confused general Ivolgin, in a state of rage, whose Münchhausen-stories of meeting Napoleon are evidently hysterical lies. Even the idiotic Myshkin understands that something is wrong with the general, but he lets him rave on, encouraging him in his folly. If that was all, I could argue that two fools had met, and that Myshkin couldn’t be expected to show compassion and try to calm down the ill man (who has a stroke in the street shortly afterwards, supported by the “malignant” atheists rather than the Christian elitist characters). But Myshkin is not a fool in that respect, just a passively condescending man. His reaction is outrageous:“Haven’t I made it worse by leading him on to such flights?” Myshkin wondered uneasily, and suddenly he could not restrain himself, and laughed violently for ten minutes. He was nearly beginning to reproach himself for his laughter, but at once realised that he had nothing to reproach himself with, since he had an infinite pity for the general.”Right! How convenient for you, Prince! And you suffer so much when others laugh at your inadequacies. I have an infinite pity for you, Sir! But I won’t raise a finger to help you, all the same. Because being a completely innocent little idiot, I don’t know how to do that.Which leads me to my last comment on the character of Myshkin, who repeatedly was compared to Don Quixote in the novel. He is NOT AT ALL LIKE THE DON!Don Quixote has more imagination and erudition than his contemporaries. Myshkin has none at all.Don Quixote actively wants to change the world for the better. Myshkin wants to passively enjoy his privileged status.Don Quixote is generous and open-minded. Myshkin is aloof and uninterested.Don Quixote has a mission. Myshkin floats in upper class meaninglessness.Don Quixote loves his ugly Dulcinea. Myshkin can’t choose between the two prettiest girls in society, but wants them to remain children to be able to worship them as virgins.So, who were my favourite characters then? As often happens to me while reading Dickens as well, I found much more satisfaction following the minor characters. Kolya, Ippolyt, Lebedyev, Rogozhin, Aglaia, Nastasya - all these people experiencing Russian society in the process of moving towards modernity are affected by one or several of its aspects. They try to deal with modernity ad hoc, without a recipe, and suffer from confusion.Aglaia!When she says she wants to become an educator, to DO something, she shows the spirit of future entrepreneurship, including women in active life. When she goes from one emotional state to another, not willing to be a negotiable good in her parents’ marriage plans, a piece of property moving from one domestic jail to another, she is a true hero. But she embraces the idea of ownership and control, and in order to own Myshkin, she acts out a despicably arrogant farce in front of a vulnerable rival, using as a weapon her privilege and chastity. A flawed but interesting character for sure. She would have been utterly unhappy, had she reached her goal.Kolya! Trying to navigate his hysterical environment and to build bridges between his family’s needs and the society they depend on, and to support parents, siblings, and friends with actions rather than words, he is a truly good person.Rogozhin! Blinded by passion but capable of sincere feeling and fidelity, he is a true lover, yet driven to madness and criminal behaviour. He admits to his crimes and accepts the following punishment.Nastasya! The abused child who takes out the punishment on herself, like anorexic or self-harming young girls nowadays, convinced that the harm done to them is a sign of their own filthiness. Myshkin drives her over the edge with his condescending pity and forgiveness - by enforcing her idea of guilt and worthlessness. As if Myshkin had any right to claim superiority! He seals her fate when he remains completely passive in the showdown between her and arrogant, impertinent Aglaia, and then creates an atmosphere of self-sacrifice during the wedding preparations:“He seemed really to look on his marriage as some insignificant formality, he held his own future so cheap.”So what am I to make of my reading of the Idiot? What is the ultimate feeling, closing the book after days of frenzied engagement with the characters?I loved the novel, hated the main character (but I’ll FORGIVE him, of course, feeling PITY for his suffering), and am prepared for another Dostoyevsky. Let the Devils haunt me next!"}, {"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "Εκεί που πολεμούν οι άνθρωποι με τις αδυναμίες τους και τα όνειρα, εκεί που οι δειλοί πεθαίνουν πριν τον θάνατο τους, εκεί που οι σκέψεις κάνουν πρόβα για να κρύψουν ό,τι αισθάνονται ή να αισθανθούν ό,τι κρύβουν, εκεί που δεν ξέρεις ποιον φόβο σου να αγαπήσεις περισσότερο, εκεί θα περιμένει πάντα ένας «ηλίθιος» να σε καλωσορίσει στο μυαλό του. Βιβλίο υπέροχο. Βιβλίο δύσκολο. Βιβλίο εμμονικό. Βιβλίο κλειστοφοβικό. Βιβλίο επαναλαμβανόμενο, σκοτεινό και ασυμβίβαστο. Σκληρή διαβάθμιση αξιών. Κλασική μελέτη κοινωνικών φαινομένων. Ένας καθρέφτης που δεν κολακεύει. Αν τον κοιτάξεις προσεκτικά θα δεις τον εαυτό σου και ένα ράγισμα στη μέση. Ανεπαίσθητο και βαθύ ράγισμα, διπλασιάζει είδωλα και σε αναγκάζει να συγκρίνεις τις κατάρες με τις ευχές. Ο «ηλίθιος», ο πρίγκιπας Μίσκιν, είναι ο υπέρλαμπρος κεντρικός, διττός χαρακτήρας. Αυτός κρατάει το ραγισμένο καθρέφτη. Μια υπέροχη ψυχή που βρίσκεται σε σύγχυση. Μια λατρεμένη ύπαρξη χαρισματικά άρρωστη που ψάχνει το νόημα της ζωής και οδηγείται απο την επιθυμία του για ζωή. Οι προθέσεις του πάντα καλές μα ελαττωματικές στην εκτέλεση τους. Μια ύπαρξη που έχει σχεδόν ανακάμψει απο τις επιληπτικές κρίσεις και αποκαλύπτει τα κίνητρα του ως εχέγγυα προς την ανθρώπινη φύση. Προσπαθεί να προσεγγίσει τους συνανθρώπους του με διάθεση παιδικής αφέλειας, αγνότητας, τρυφερότητας και συμπόνιας. Ως ηλίθιος αντιλαμβάνεται διαφορετικά τον κόσμο. Ως άρρωστος επιδεικνύει τις σκέψεις του που είναι αντανακλάσεις της ειλικρίνειας του, του πλούτου της αγγελικής καρδιάς του και της ευρύτητας του μυαλού του. Όσο απίστευτο κι αν φαίνεται αυτός ο ηλίθιος έχει μια ανώτερη κατανόηση και έκφραση. Μια υπέρτατη διαχείριση των συναισθηματικών δυνάμεων που τον προωθούν να υπαγορεύει σχεδόν,τις καταστρεπτικές ενέργειες των ανθρώπων γύρω του. Ο ηλίθιος αυτός, ο πρίγκιπας Μίσκιν, είναι μια αστείρευτη πηγή έμπνευσης για κάθε άνθρωπο. Όποιος τον κρίνει ως αθώα παθητικό πρόσωπο έχει χάσει την ουσία. Ο χαρακτήρας του διακρίνεται κυρίως για την οξυμένη αντίληψη προς τη σκέψη και τη δράση, τη βαθιά κατανόηση όλων των καταστάσεων και την ευφυΐα της συναισθηματικής του νοημοσύνης. Είναι ηλίθιος, είναι πράγματι, διαφέρει απο όλους. Η ηλιθιότητα του μεταφέρεται συνοπτικά με αλληλεπιδράσεις που δημιουργούν τόσο αγάπη, όσο και δυσαρέσκεια. Παλεύει να βρει χώρο για να ζήσει μέσα σε έναν κόσμο υλιστικό, αυτός όμως δεν ενδιαφέρεται για τα υλικά αγαθά, διακρίνει αλλού τον πλούτο κι έτσι δεν μπορούν να τον κλέψουν στη μοιρασιά. Μα πόσο ηλίθιος πια, πόσο; Ραγίζει η καρδιά του και σπάει απο ενα παιδικό χαμόγελο, λιώνει η ψυχή του, καίγεται, απο το χάδι μιας ερωτικής διάπυρης ματιάς, μα είναι παγερά αδιάφορος μπροστά στην κοινωνική καταξίωση, την αριστοκρατική εκλεπτυσμένη απληστία, τις φιλοξοξίες για εξουσία και περιουσία, την πολυτέλεια, το κέρδος. Πόσο πιο ηλίθιος, όταν δεν μπορεί να σταθεί στην κλασική τάξη της αστικής υποκρισίας. Όταν αρνείται να συμμετέχει στην διαφθορά και την πλάνη ως υποστηρικτικό σκουπίδι νευρωτικών κληρονόμων. Όταν ανάμεσα σε σνομπ εκμεταλλευτές και ανήθικους νάρκισσους προτιμάει το βάθος της αγάπης και της αυτοθυσίας. Ο ηλίθιος λοιπόν αυτός, δεν δέχεται κοσμικά σύνορα που χαράζουν το σώμα του πλανήτη. Δεν μπορεί να διαλέξει ανάμεσα σε αγάπη και μίσος. Το μίσος δεν υπάρχει, δεν το γνώρισε, δεν το ένιωσε ποτέ. Προσπαθεί να χειριστεί την αγάπη του. Να κατανοήσουν όλοι πως δεν γίνεται να μην αγαπάει, δεν μπορεί να υπάρχει χωρίς αγάπη. Αγαπάει καθολικά και απεριόριστα χωρίς να μπορεί να συμφιλιώσει το παθιασμένο και το συμπονετικό. Ακόμη κι όταν βρίσκεται στη δίνη του ερωτικού οίστρου ανάμεσα σε δυο γυναίκες, του φαίνεται αδιανόητη η επιλογή, αρρωσταίνει, χάνεται μπροστά στο δίλημμα που του θέτουν οι κανόνες. Αγάπη απο οίκτο και δέος ή έρωτας παθους με αγάπη γαλήνια και παντοτινή; Ένα επιληπτικό αριστούργημα γραμμένο απο μια λογοτεχνική ιδιοφυΐα. Κεντρικός άξονας ο ηλίθιος πρίγκιπας Μίσκιν και γύρω του πλήθος χαρακτήρων φυλακισμένων σε ένα τρομερό παιχνίδι πραγματικότητας.Είναι όλοι τους αξιοθαύμαστοι, φιλοσοφικοί,πολύχρωμοι, παρορμητικοί, ενδοσκοπικοί, ενεργητικοί, επιλεγμένοι σοφά για να συμμετέχουν σε αυτό το παιχνίδι, σε αυτή την παράσταση ιδεών. Ο Ντοστογέφσκι αποκαλύπτει, διερευνά και επηρεάζει. Μέσα στο παιχνίδι του πετάει νοοτροπίες, πάθη, λάθη, σκέψεις, ενέργειες,που εξηγούν τη φύση του ανθρώπου και της κοινωνίας. Προάγουν την ανθρώπινη βούληση με ποικίλους βαθμούς διαταραχής της προσωπικότητας, παρανοϊκές παραληρηματικές ιδέες ή μανιακές επιδιώξεις. Επομένως η ουσία της αφήγησης βυθίζεται σε μια θάλασσα λάσπης απο εκούσια κοινωνικά και κακοπροαίρετα σχόλια, ιδιοσυγκρασίες ξεχωριστές και σουρεαλιστική βραδύτητα συσχετισμών. Φυσικά σε αυτό το παιχνίδι δεν υπάρχουν νικητές και σε αυτό το μυθιστόρημα δεν υπάρχει τίποτα λιγότερο απο την τελειότητα. Δύσκολο, βαρύ και σπουδαίο πνευματικό έργο. Σας προκαλώ Αντέχετε;Καλή ανάγνωση. Πολλούς ασπασμούς."}, {"userName": "Foad", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "[شخصیت \"آناستازیا فیلیپونا\" خیلی زیاد شبیه شخصیت زن داستان دیگه ی داستایوسکی، قماربازه به اسم \"پولینا\". و من شدیداً شیفته ی هر دو هستم. خیلی بیشتر از شخصیت پاک و معصوم \"سونیا\" در \"جنایت و مکافات\"، هر چند شخصیت سونیا رو هم دوست دارم.آناستازیا، زنی خرابه که از خراب بودنش، بیزار و غمگینه، ولی نمی تونه و نمیخاد که پاک باشه. عاشق پرنس میشکین میشه، چون به نظرش پرنس میشکین پاکه و میتونه آناستازیا رو از پلیدیش نجات بده، ولی وقتی شرایط ازدواجشون مهیا میشه، عمداً این آخرین راه به سمت رستگاری رو خراب میکنه. انگار بیشتر دوست داره در فساد بمونه و غمگین باشه و برای خودش دلسوزی کنه، تا این که واقعاً به سمت پاکی حرکت کنه. یه شخصیت پیچیده ی غیر متعادل و غیر قابل بیان خیلی خیلی زیبایی داره. بیخود نیست که پرنس میشکین از ابتدای داستان، شیفته ش میشه. پرنس میشکین پاکی رو، حسرت پاک بودن رو توی چشم های غمگین آناستازیا میبینه و میخاد نجاتش بده، ولی شکست میخوره. (hide spoiler)]"}, {"userName": "Ben", "userReviewDate": "Jul 24, 2009", "userURL": "http://www.goodreads.com/user/show/88967-ben", "userReview": "The Idiot is a remarkable literary feat; a true accomplishment. It not only shows and represents true human complexity, but it births it, both in the inner workings of its passionate characters, and in the overall story. It's replete with patient, mind testing issues that spring the reader’s level of understanding back-and-fourth; yet its emotional intensity is felt throughout. It speaks truth of our striving human conditions; our emotions which only know the truth of their existence in the moment; yet it is a true and pure novel, like the heart of our unusual but endearing hero, Prince Myshkin: our idiot.Nobody brings the drama like Fyodor: nobody. Yet despite all the exclamation points and the excessively passionate characters -- who all seem to speak with great clarity, with penetrating philosophical insight -- Dostoevsky novels still feel very real to me. Despite its great entertainment value and all the outbursts from its characters, very real emotional boundaries are pushed in very natural, all encompassing ways. What The Idiot bespeaks is something about life that is so real and true that the novel, while very intense, feels completely unexaggerated. Dostoevsky novels don’t take place in, but are a world of both utter emotional madness and pure genius. And they display how the two are often inseparable:\"He fell to thinking, among other things, about his epileptic condition, that there was a stage in it just before the fit itself (if the fit occurred while he was awake), when suddenly, amidst the sadness, the darkness of soul, the pressure, his brain would momentarily catch fire, as it were, and all his life's forces would be strained at once in an extraordinary impulse. The sense of life, of self-awareness, increased nearly tenfold in these moments, which flashed by like lightning. His mind, his heart were lit up with an extraordinary light; all his agitation, all his doubts, all his worries were as if placated at once, resolved in a sort of sublime tranquility, filled with serene, harmonious joy, and hope, filled with reason and ultimate cause.\" These characters, none of them were \"all bad\" or \"all good\"; in fact there was not one single character in this entire novel that I didn't feel both sympathy and contempt for, at various stages.The Idiot is epic. The way it played out will have my mind reeling for weeks, I know. And I like that. I like that a lot.\"But I'll add though that there is something at the bottom of every new human thought, every thought of genius, or even every earnest thought that springs up in any brain, which can never be communicated to others, even if one were to write volumes about it and were explaining one's idea for thirty-five years; there's something left which cannot be induced to emerge from your brain, and remains with you forever; and with it you will die, without communicating to anyone perhaps, the most important of your ideas.\""}, {"userName": "Katie", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/56035852-katie", "userReview": "We tend to view innocence as an uplifting cleansing virtue. Contact with it is supposed to improve the soul. But this isn’t always the case. Sometimes, in company, my five year old son will blurt out something I don’t want outsiders to know and I end up blushing! His innocence causes me discomfort. I also remember that little girl from Aleppo who every day updated online the situation in the besieged city. Imagine the reactions of Assad’s regime to her online posts. Would they have been won over by her innocence? No way! They would have been made deeply uncomfortable by her innocence. They would have wanted to shut her up. The idiot here has a similar effect on Russian society. Dostoevsky’s idea was that if Christ returned to 19th century Russian society he would be treated as a simpleton, an idiot. So he has created a character who always endeavours to be honest, to tell the truth as he sees it. He has a “noble simplicity and is boundlessly trusting”. His innocence though causes as much hatred as admiration, more anarchy than goodwill. He makes you realise there are many situations in life where a lie is preferable to the truth if the boat isn’t to be rocked. Because there’s nearly always something expedient in a lie, especially in what we call white lies. There’s usually some personal gain to be had from shunning the truth. Usually these are small private lies; sometimes bigger, more public lies, like Trump denying climate change because it’s in his financial interests to take this stand. He doesn’t want to look at images of innocent nature devastated by oil spills from leaking pipes. One of the most interesting things I learned while reading this is how the novel has evolved for the better since the 19th century. As brilliant as this is there’s a lot of rambling waffle, as if all the characters are on amphetamines and don’t know when to shut up. Dostoevsky resorts to rather cheap tactics too – a character arrives breathless with the urgency to convey news but instead of getting to the point embarks on a completely different discourse and finally decides now is not the time to share his news. Or the narrator will coyly tell us he doesn’t know what two characters spoke about when they were alone together, even though on the previous page he told us what a character thought in the privacy of his own mind. I wondered if this was mischief on the part of Dostoevsky or just sloppiness. Apparently this was serialised and Dostoevsky was under great duress when he wrote it. Also, all the women are bonkers. They’re so volatile and capricious that it’s impossible to know what they want. They seem to be overloaded with stoppered sexual energy. Sexual emotions, in Dostoevsky’s novel, seem to deny the female characters access not only to innocence but also measured reflection, a subtext I wasn’t entirely comfortable with. The women sometimes confused the clarity of the theme of this novel. And ultimately it’s the sexual jealousy of an essentially innocent young woman that causes the concluding mayhem. This is not a seamless great read. It can be baggy, chaotic, digressive but the best bits are simply brilliant and overall I found it a tremendously edifying read."}, {"userName": "Fernando", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "Como siempre me pasa con Dostoievski, debo decir que he disfrutado mucho la historia del Príncipe Lev Nikoláievich Mishkin, quien vuelve luego de cuatro años de un sanatario en Suiza para recuperarse... ¿adivinen de qué? si, de epilepsia, como Dostoievski, hacia Pávlovsk en Rusia. De ahí, que, a partir de sus problemas de salud es considerado un idiota. Al volver a insertarse en la sociedad rusa, la encuentra totalmente fría, distorsionada, mezquina y malévola y es, tal vez, el mensaje que Dostoievski realmente quiso mostrar acerca de su presente, allá por 1868-1869. Debo reconocer que El adolescente me gustó mucho, pero El Idiota más aún porque me pareció más fluido, más ameno de leer, tal vez con una historia menos enrevesada y con personajes más marcados (en El Adolescente los parentescos confunden, los apellidos se repiten y es necesario apoyarse en las notas aclaratorias al final del libro). Otro aspecto interesante del libro son los diálogos. Tal vez, lo atribuyo a los traductores que hacen que la lectura del libro que sea fluida.La concepción de Dostoievski sobre el personaje es muy rica, ya que se propuso crear en Mishkin un personaje totalmente antagónico a Rodion Raskólnikov (recordemos que escribió Crimen y Castigo en 1866) y esto se nota en el carácter del príncipe, dado que el hombre tiene sus convicciones, pero estas no logran ser refutadas o respetadas, como las del Raskólnikov. Mishkin es débil, ingenuo, influenciable, indeciso. Su relación con las mujeres es conflictiva, enfermiza y angustiante; por momentos por culpa de su propia decisión, en otras por estar negativamente influenciado. El triángulo amoroso (y enfermizo) que forma que involucra al príncipe con Aglaia Ivanovna y a Nastasia Filíppovna es por donde pasa el nudo de esta historia. También he de destacar que algunos personajes son muy importantes en esta historia, puesto que tienen implicancia directa. Cito entre ellos a Parfión Rogozhin, a Lizaveta Prokofievna, el General Ivolguin, Ippolit Terentiev, Kostia Lebediev y Gavrila Ardaliónovich, entre otros. Siempre en las novelas de Dostoievski, las conexiones entre personajes son el modo de llevar adelante la historia. Como creador de la novela polifónica, Dostoievski le da a sus héroes la función fundamental de que cada uno desarrolle su propia idea y sea portador de su voz, y a la vez, cada una de estas voces hace al conjunto de la historia.Dicen que Dostoievksi quiso hacer confluir en el príncipe Mishkin características de Jesucristo y Don Quijote. Yo particularmente me quedo con el segundo. Realmente hay momentos en que Mishkin va interactuando con los demás personajes de una manera tristemente quijotesca, sobre todo al exponer sus ideales (su discurso sobre el Catolicismo, el Ateísmo y el Nihilismo es muy importante e interesante de leer con detenimiento). Y por último creo que Don Quijote cuadra más porque, sin hacer spoiler, todo eclosiona en el final.“La belleza salvará al mundo”, proclama el príncipe Mishkin. Es probable que la ingenuidad de esta frase encierre la naturaleza de su fracaso."}, {"userName": "Manju", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/11166121-manju", "userReview": "I have been trying to fill this review box ever since I finished this book. After writing and rewriting about this book, I think I have finally come close to what I feel about this book. I don’t think I can ever do justice to the beauty of this book but I still wanted to write few things about it. I started reading this novel last year. Put on pause twice, then finally finishing it this month. I was so relieved not only because I managed to read it, but also because it is one of those books that are still a treat to read even after 150 years of its publication. Story revolves around Prince Myshkin who arrived in Russia from Switzerland. There he meet Rogozhin on the train and befriends him. Then he went to see his distant relatives General and meet family. Here he sees a picture of Nastasya Fillipovna and falls in love with her. Things get complicated when he proposes her and she rejects him for Rogozhin, who is also madly in love with her. On the day of marriage she elopes to be with Rogozhin. Myshkin finds love in Agalaya but all hell loose breaks when once again Nastasya decides that she is still in love with the Prince. In Prince Myshkin, Mr. Dostoyovesky created a beautiful soul. A man who is free of deception, lies, concoction, and brutally honest. A man who always put others before his own happiness. A man whom no one can hate even if one tries they fail miserably and end up falling in love with this simpleton. So many times I felt so angry when people called him mad, fool, idiot, because they failed to see the beautiful heart that the Prince had. Then one can’t blame them for we always hate people who are too good and have the qualities that we don’t possess. We want to be clever but hate it when outsmarted by cleverer person. But our prince is beyond all this, he just love and think highly of others even if those very people are trying to drag him down. And that’s the reason they find it so hard to begrudge him.While the prince has no vile motives, the two leading ladies of the novel have intentions that were hard to grasp upon for me. One minute they were madly in love with Prince, but in the next moment they would leave him and tell him that they don’t love him. They could not bear the thought of him being with another, oh how they made sure of it. One kept running away from him, and the other kept him on the edge with her own confusion. They drove him mad and how I wanted him to leave both of them to their fate and go some other place where he would get peace of mind but they would not let him walk away. Dostoyovesky has written a stunning story that evoked so many emotions in me. I found myself teary, laughing, distressed, full of hatred, scared, angry, and sad on behalf of the prince. I don’t think one will get to meet a person like Prince in real life but it is easy to see the goons that surround him in everyday life. His characters are deeply flawed, impulsive, and dense but at the same time they make me understand (or at least I tried to) how human nature works. I absolutely loved this book, and I am definitely reading his other works but I think I will still take another year to get out of this world."}, {"userName": "Nikos Tsentemeidis", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/27325053-nikos-tsentemeidis", "userReview": "Ξεκίνησα διαβάζοντας από τις εκδόσεις Ζαχαρόπουλου. Για 400 σελίδες. Κουράστηκα πολύ, απορώντας γιατί είναι τόσο κακό το βιβλίο σε σχέση με τους καραμάζοφ και το έγκλημα που είχα μέχρι στιγμής διαβάσει. Συνέχισα με εκδόσεις Γκοβόστη. Διάβαζα ένα άλλο τελείως διαφορετικό βιβλίο. Διάβασα ένα ακόμα απολαυστικό και συγκλονιστικό έργο του τεράστιου αυτού συγγραφέα. Δε το θεωρώ καλύτερο σε σχέση με τα δύο πρώτα, αλλά σε κάθε περίπτωση υποκλίθηκα στο ταλέντο του Ντοστογιέφσκι.Ακόμα ένα έργο πέρα από λογοτεχνικό και φιλοσοφικό και ψυχολογικό. Δεν είναι τυχαίο το γεγονός ότι Νίτσε και Φρόυντ επηρεάστηκαν από τον Ντοστογιέφσκι."}, {"userName": "Henry Avila", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/5431458-henry-avila", "userReview": "Prince Myshkin, 26, arrives in St. Petersburg, Russia by train, \"The Beautiful Man\" has too much compassion for this cynical age. He believes every person, trusts all, feels the pain of the suffering unfortunates, thus has no common sense. Simple? Gullible? An idiot? Or a Saint? That question only you can decide. Set in the 1860's, the sick prince (he's an epileptic, like the author of this novel) alone, frightened, no relatives or friends or money, in the world, but with a desire to see his beloved native land, again. That he hardly remembers, having lived in Switzerland, treated by a kindly Doctor Schneider, without charge for years. However meets two men that will be friends or enemies (in the future), inside his train compartment. Rogozhin, a young man who can't control his emotions, very unstable, just inheriting a vast fortune, eager to show the whole city, it. And Lebedev , a minor clerk the kind of gentleman who knows everything about Petersburg's important people. Myshkin, doesn't even have proper clothes for the cold, late November day as he steps down into the unknown metropolis. Nevertheless he has valuable information received from the well informed Mr. Lebedev . Seeing General Epanchin retired, his wife has the same name as our \"hero,\" maybe some kind of relation? With difficulties, servants are such doubters and have good reason to be, Myshkin finally gets in the house's family quarters. Meeting the three beautiful daughters of the general, and his volatile and scary wife, Lizaveta. Falling in love with the youngest, prettiest daughter Aglaia, she's 20, very immature, has crushes on every handsome suitor she's introduced to. The inexperienced prince, also loves Nastasya a kept woman he sees soon after, the best looking female in the country. He wants to save this lady, from a life of inevitable degradation and doom, the eternal triangle. Later entering society, they the ruling class look at him, the eccentric Myshkin closely, an oddity a childish fool, not suitable for them as a friend. Yet these citizens have no real ones, themselves ... Good fortune comes to Prince Lev Nikolayevich Myshkin, he inherits a lot of money, unexpectedly, when he goes to Moscow. A letter tells him, naturally he gives away most of it to people, who say the prince owes them money. And the \"poor\", those asking for a little help, how can he refuse? Fleeing Moscow, the ill man goes back to the Russian capital, the two women in his life, are there. Rents a villa in the suburbs from Mr. Lebedev , invites the consumptive boy that he befriended, Ippolit, ( an unpleasant youth) to stay during his last days and still earns no respect, from anyone ... The \"Idiot\", has proposed marriage, to both of his loves!"}, {"userName": "Martine", "userReviewDate": "Sep 08, 2008", "userURL": "http://www.goodreads.com/user/show/381149-martine", "userReview": "Are there countries in the world which are more likely to produce depressing literature than others? If so, Russia must be pretty much top of the list. I have yet to read a Russian novel which ends well for all the protagonists. I can only think of a few in which things end well for even a few of the protagonists. And Dostoyevsky of course loves his tragedies. The Idiot is one of them. While it's not as tragic as, say, Crime and Punishment, nearly all of its protagonists come to a sticky end, and as always, they meet plenty of drama and intrigue on their way there. And it's all classical Russian drama and intrigue, which is to say it's full of passion, obsession, sudden mood swings, tantrums and hysterical fits. In short, The Idiot is a book full of histrionics, but I love it, because for one thing, there's something grand about all those huge emotions, and for another, Dostoyevsky is such a good writer that he gets away with making his characters behave like Greek gods. Every time I read a book of his, I come away wishing he had written his own version of Greek mythology. I'm sure it would have been an astonishing read. As for the book at hand, it's a book about society -- more specifically, about a modern society that is so corrupt and materialistic that a good man simply cannot survive in it. In The Idiot, that good man is Prince Lyov Nikolayevitch Myshkin, who has spent most of his life in a Swiss hospital because of his epileptic fits, and now returns to the country of his youth. Although many people call him an idiot, Myshkin is not actually stupid; he is just innocent and naïve, and likely to forgive those who have trespassed against him as he is sure they meant no harm. Needless to say, there are those who dismiss him as an inconsequential figure or try to take advantage of him, but he also wins over a lot of people with his innate goodness and refusal to think ill of others. He's a Christ-like figure, but was Christ allowed to live in the society he lived in? He wasn't, and neither, sadly enough, is Myshkin, one of Dostoyevsky's more likeable protagonists. Because Russia, to which Dostoyevsky devotes some choice paragraphs, is too jaded for people like him -- too corrupt and too, well, Russian.But The Idiot is not just a novel about a corrupt society. Ultimately (and this is probably why I like it so much) it's about love. About the different ways in which people love each other. About loving out of pity. About loving against reason. About mad, obsessive, possessive love. About angry love. About humiliating love. About corrupting love and the fear of love. About the things people do for love, the mistakes they make in the name of love, and the love they simply fail to notice because their eyes are directed elsewhere. At the heart of the book is a fascinating love triangle (or is it a quadrangle? or even a pentagon?), which makes it incredibly romantic despite all the ugly stuff that is going on at the same time. It doesn't have a happy-ever-after ending, but there's something terrifically grand and romantic about the ways in which the various lovers end, and I like that. It's realism with a dose of Romanticism with a capital R, and it works.As always, Dostoyevsky's characterisation is superb. His naïve hero is pitched against a fabulous cast of sophisticated nobles, desperate wannabes, highly strung concubines, passionate schoolgirls, mad stalkers, dramatic nihilists, and so on. Many of the characters are larger than life, yet you somehow believe them, because let's face it, Russia is the kind place that could spawn these people, isn't it? By and large, the characters are well drawn, and if many of them are either unsympathetic or a tad capricious, so be it. There is enough passion, grandstanding and back-stabbing going on between them to keep things interesting, and plenty of twisted love, too.The only thing I dislike about Dostoyevsky (and the one reason why I'm not giving The Idiot five stars) is his tendency to go off on tangents just when something exciting is about to happen. In The Idiot, he relates the events of an evening, tells us that the hero will have a secret and obviously important meeting with the girl he loves in the morning, and then, rather than relating the events of the next morning in the next chapter, proceeds to spend four chapters (some sixty pages altogether) telling the reader what happens at the Prince's house late at night, none of which has anything to do with the upcoming meeting with the girl. I'm sure I'm not the only reader who felt cheated there. Other than the tangents, though, Dostoyevsky is a superb writer, and The Idiot is as fine an example of classic Russian literature as you're likely to find anywhere (provided you like long dialogue and slightly mad characters). I'd give it 4.5 stars if I could, but in the absence of half stars, four will have to do.(And for those of you who care about translations: I read the Bantam version by Constance Garnett and was quite happy with it.)"}, {"userName": "Jason", "userReviewDate": "Jul 20, 2010", "userURL": "http://www.goodreads.com/user/show/2447803-jason", "userReview": "Do you answer ‘yes’ to any of the following questions?1. You ever sleep in another person’s house for the first time, not wanting to turn on a light to see your way to the toilet, and run into a wall?2. You ever been in a public building at night and the power fails, and you run into a wall?3. You ever been camping with an overcast night and straggle into the woods to take a pee, and run into a wall of shrubbery?4. You ever been in a leadership reaction course, blindfolded, and run into a wall?5. You ever been deployed to Qatar in the transition billeting tent at night, not wanting to disturb all the soldiers with your mag-light, and run into a tent wall?What do these questions have in common? 3 things. One, you’ve lost your primary sense--eyesight. Two, you’ve run into something through which you can’t pass. Three, to continue you must turn east or west. This is exactly how I felt when I read The Idiot. Lost, in a strange place, against a barrier. (preview: it’s all about the translator, paragraph 10)Then I agonized for a week about posting a review of a piece of monolithic literature to which I award only 2 stars. How the hell, dude, can you award 2 stars to an uber-classic? Did you forget it was Dostoevsky? Do you realize that among your 56 friends on Goodreads that 2 stars is the lowest anyone has rated it? You missed something; you’re ignorant!And I truly subjected myself to several good harangues. I reread the lengthy, academic foreword and afterword. I thought deeply about the book. I stretched my mind, my cognitive abilities, each time against a wall. I was really concerned about your opinion of me, as a reader, as a consumer of serious literature, as a trustworthy, balanced critic of dense writing.Then it appeared to me, like a turn in the dark. Screw you!! I’m not writing this for you. I write reviews to capture how I feel about a specific novel at a particular place and time in my life. It’s completely fair to award 2 stars to Dostoevsky. At this particular time in my life--as I realize the Deepwater Horizon oil spill may have been overblown by the media, as I decide whether or not to delete my Facebook account, as I realize Obama’s economic plan is an absolute failure with unemployment remaining above 9% for the next 12 months and home values not rebounding for 36 months, as I wonder if next will be as tough as the previous year raising my 3 young kids--at this particular time in my life, I didn’t very much enjoy The Idiot. This is where I’m at in time and place with The Idiot, and I’m so glad to capture feelings other than a middling 3 stars (which is sometimes a rounding error). 2 stars is harsh, but fair.I read Crime and Punishment twice, and think The Brothers Karamazov one of the best 5 books I ever read. I’ve been under the spell of Dostoevsky for nearly half my life. So my lean this week into The Idiot was a disappointment.Here’s what the author said about the book: “There’s much in the novel...that didn’t come off, but something did come off. I don’t stand behind my novel, but I do stand behind my idea.” Authors sometimes give themselves a giant pat on the back, but couch it in self-deprecating language. As if to say the ideas in the novel were so august, so pantheon, so divine that their ability to define or make sense of these ideas with terrestrial words resulted, simply, in a spatchcock of human themes. Ignore the writing. The message is in the idea. Come on, Fyodor, we all know you write like an immortal.The Idiot is brimming with philosophical inquiry into people’s lives, society, culture, and history. Immutable, transcendent ideas about which Russian writers always grapple. The authors of the foreword/afterword reveal and underscore dozens of themes in the book. They discuss mechanics and perspectives and symbols. They discuss Russian history and the Russian concept of suffering, and how these were adroitly parsed among the characters. And how the characters themselves represented the unique attributes--in splinter form--of the Russian whole.Well that’s all great. You read it and take from it what you want. I found it tangled, hard to follow, uninteresting. The characters were so weighed down by being representatives of the Russian whole that they failed to be engaging characters by themselves. And so unlike Dostoevsky, I found not a single sentence worth transcribing here. In 660 pages, wow, nothing worth remembering. How unfulfilling. Certainly nothing like THIS powerful, euphonic sentence. (Important) Because I know Fyodor can bring the noise, it leads me to believe that the translation is faulty, dated. Indeed, I read the version translated originally in 1913 by Olga Carlisle. It’s the staid, orthodox version. Perhaps if I read the translation by Larissa Volokonsky, then I would’ve been in measure with the writing. She won the 2002 Efim Etkind Translation Award for her work on The Idiot, for Chris’akes!! Swoon. Cuss. Paradise Lost! Alas, I won’t reread The Idiot. It’s just too long...and me, I’m too slow a reader. I’ll read The Possessed in a couple years. The experts call it a more traditional story on par with CAP and TBK. Dostoevsky is too fine a writer to abandon, and so I won’t.Another problem I had with the Carlisle translation was the melodramatic interpretation of character staging. Let me, for example, open the book to page 580--a random choice--and list every instance on both pages where the character staging is electrified....got up rather late and immediately recalled......first moment she burst into tears......the prince at once reassured her......he was suddenly struck by the strong compassion......Vera blushed deeply......she cried in alarm, quickly drawing her hand away......went away in a strangely troubled state......her father had hurried off......Koyla ran in, also for only a minute......in a great hurry......was in a state of intense and troubled agitation......was deeply and violently moved......poor boy was thunderstruck......quietly burst into tears......he jumped up......hurriedly inquired about......added in haste......was predicting disaster......was asking pointed questions......with a gesture of vexation......accursed morbid mistrustfulness......in the form of an order, abruptly, dryly, without explanation......suddenly turning around......and feverishly looked at his watch...Remember, this came from a total of 1200 printed words. The entire book is similarly charged. I got tired of reading all this ‘juiced’ action. Did Dostoevsky intend 660 pages of melododrama, or was this a translator’s interpretation? I got robbed, man. Bad translation. The review stops here."}, {"userName": "Maria Espadinha", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "Sejamos Todos IdiotasA sociedade, com todos os seus jogos de poder e corrupção , destrói os Puros.Uma tradição milenar que remonta à era de Cristo!...Numa caricatura social, Dostoiévski mostra-nos como as boas almas são exploradas, vilipendiadas, violentadas... acabando destruídas.Os Puros são apontados a dedo como Idiotas, uns Patetas Bonzões que não encaixam em lado nenhum.A Sociedade é o Holocausto dos Puros!!!Porém, se só a beleza poderá salvar o mundo e a sociedade aniquila os seus mais devotos praticantes, onde estará a Salvação afinal?!...Quanto a mim, ao confrontar-nos com este impasse, este \"deadlock\", Dostoiévski espevita-nos a Consciência, apontando um Caminho.O Príncipe Míchkin, esse ícone de simplicidade, bondade e altruísmo, será antes um exemplo a seguir, ao invés dum imbecil a desprezar ou obliterar!...Epilepsia à parte, pergunto-me se Dostoiévski não estará simplesmente a advogar uma urgente Michkinização da Sociedade?!... ;)NOTA: Não posso deixar de louvar o brilhante trabalho do casal Guerra, que efectuou a tradução directamente a partir do russo, conferindo um maior grau de autenticidade à obra!"}, {"userName": "William1", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/4684009-william1", "userReview": "Here's Dostoyevski's mode of proceeding, and it's maddening. One, here's what I'm about to tell you; two, now here I am actually telling it to you; and three, now let's review what I've just told you. Every point is handled thus. The tedium! Nevertheless, it's D so I forced myself to read most of it. In the end the book fell heavily from my hands and I woke."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Apr 28, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "861.\tИдиот = The Idiot, Fyodor DostoevskyThe Idiot (Russian: Идио́т, Idiot) is a novel by the 19th-century Russian author Fyodor Dostoyevsky. It was first published serially in the journal The Russian Messenger in 1868–9.The title is an ironic reference to the central character of the novel, Prince (Knyaz) Lev Nikolaevich Myshkin, a young man whose goodness and open-hearted simplicity lead many of the more worldly characters he encounters to mistakenly assume that he lacks intelligence and insight. In the character of Prince Myshkin, Dostoevsky set himself the task of depicting \"the positively good and beautiful man\". The novel examines the consequences of placing such a unique individual at the centre of the conflicts, desires, passions and egoism of worldly society, both for the man himself and for those with whom he becomes involved. The result, according to philosopher A.C. Grayling, is \"one of the most excoriating, compelling and remarkable books ever written; and without question one of the greatest.\"تاریخ نخستین خوانش: سال 1974 میلادیعنوان: ابله؛ نویسنده: فئودور داستایوسکی؛ مترجم: مشفق همدانی؛ تهران، کتابهای جبیی، 1341؛ در چهار جلد؛ چاپ دیگر: تهران، صفیعلیشاه، چاپ سوم 1348؛ در چهار جلد؛ چاپ پنجم 1356؛ چاپ دیگر 1362؛ چاپ بعدی 1366؛ چاپ دیگر: 1396، در دو جلد؛ شابک: 9789645626929؛ تهران، امیرکبیر، چاپ سوم 1393؛ در سه جلد؛ شابک: 9789640015896؛ موضوع: داستانهای نویسندگان روسی - قرن 19 معنوان: ابله؛ نویسنده: فئودور داستایوسکی؛ مترجم: سروش حبیبی؛ تهران، چشمه،1383؛ چاپ سوم 1385؛ چهارم 1386؛ ششم 1378؛ هفتم 1388؛چاپ هشتم 1389؛ چاپ نهم 1390؛ در 1019 ص؛ چاپ یازدهم 1393؛ شابک: 9789643622114؛مترجم: منوچهر بیگدلی خمسه؛ تهران، ارسطو، 1362؛ در دو جلد؛ چاپ دیگر: تهران، گلشائی؛ 1368؛ در دو جلد؛ تهران، نگارستان کتاب؛ 1387؛ در دو جلد؛ شابک: 9789648155839؛ مترجم: نسرین مجیدی؛ تهران، روزگار، 1389؛ در 920 ص؛ شابک: 9789643742768؛ مترجم: کیومرث پارسای؛ تهران، سمیر، چاپ چهارم 1395؛ در 640 ص؛ شابک: 9789642200986؛مترجم: آرا جواهری؛ تهران، یاقوت کویر، 1395؛ در دو جلد؛ شابک: 9786008191063؛ چاپ دیگر: تهران، پارمیس؛ 1392؛ در دو جلد؛ شابک: 9786006027623؛ چاپ دیگر 1396؛ در 826 ص؛ شابک: 9786008708094؛مترجم: اصغر اندرودی؛ تهران، ناژ؛ 1394؛ در دو جلد؛ شابک: 9786006110158؛مترجم: پرویز شهدی؛ نشر به سخن، 1396؛ در دو جلد؛ شابک: 9786007987407؛مترجم: میروحید ذنوبی؛ تهران، آهنگ فردا، 1396؛ در 838 ص؛ شابک: 9786007383728؛مترجم: امیر رمزی؛ تهران، آریاسان، 1396؛ در 838 ص؛ شابک: 9786008193760؛ مترجم: آرزو خلجی مقیم؛ تهران، نیک فرجام، 1395، در 784 ص؛ شابک: 9786007159316؛ چاپ دیگر: 1396؛ در 838 ص؛ شابک: 9786007159514؛ چاپ دیگر: تهران، سپهر ادب، 1395؛ شابک: 9789649923963؛ در دو جلد؛مترجم: مهری آهی؛ تهران، خوارزمی؛ 1395؛ در 1075 ص؛ شابک: 9789644871566؛مترجم: عباس سبحانی فر؛ تهران، آنیسا، 1396؛ در 839 ص؛ شابک: 9786008399728؛ مترجم: علی صحرایی؛ تهران، ابر سفید، 1392؛ در 536 ص؛ شابک: 9786006988085؛پرنس میشکین، آخرین فرزند یک خاندان بزرگ ورشکسته، پس از اقامتی طولانی در سوئیس برای معالجهٔ بیماری، به میهن خویش بازمی‌گردد. بیماری او رسماً افسردگی عصبی ست ولی در واقع میشکین دچار نوعی جنون شده‌ است که نمودار آن بی‌ارادگی مطلق است. افزون بر این، بی‌ تجربگی کامل او در زندگی، اعتماد بی‌حدش نسبت به دیگران در وی پدید میآورد. میشکین، در پرتو وجود راگوژین، همسفر خویش، فرصت می‌یابد که نشان دهد برای مردمی واقعاً نیک، در تماس با واقعیت، چه ممکن است پیش آید. روگوژین این جوان گرم و روباز و با اراده، به سابقه هم حسی باطنی و نیاز به ابراز مکنونات پیشین، در راه سفر، سفره دل خود را پیش میشکین، که از نظر روحی نقطه مقابل اوست، می‌گشاید. روگوژین برای او عشقی را که نسبت به ناستازیا فیلیپونیا احساس می‌کند بازمی‌گوید. این زن زیبا، که از نظر حسن شهرت وضعیت مبهمی دارد، به انگیزه ی وظیفه شناسی، نه بی اکراه، معشوقه ی ولی نعمت خود می‌شود تا از این راه حق‌ شناسی خود را به او نشان دهد. وی، که طبعاً مهربان و بزرگوار است، نسبت به مردان و به طور کلی نسبت به همه کسانی که سرنوشت با آنان بیشتر یار بوده و به نظر می‌آید که برای خوار ساختن او به همین مزیت می‌نازند نفرتی در جان نهفته دارد. این دو تازه دوست، چون به سن پترزبورگ می‌رسند، از یکدیگر جدا می‌شوند و پرنس نزد ژنرال اپانچین، یکی از خویشاوندانش، می‌رود به این امید که برای زندگی فعالی که می‌خواهد آغاز کند پشتیبانش باشد و باقی ماجرا… ا. شربیانی"}, {"userName": "Sidharth Vardhan", "userReviewDate": "Oct 23, 2014", "userURL": "http://www.goodreads.com/user/show/58296635-sidharth-vardhan", "userReview": "The tragedy of being too good\nAn ideal idiotMost of my favorite characters are either pure evil or complex anti-hero type; the stereotype Mr. Goody-two-shoes has never appealed to me; however Prince Muishkin, the idiot in the novel, is now going to be an exception.He has suffered from idiocy due to epilepsy (FD too suffered from epilepsy attacks) all his childhood and early youth. Perhaps it was due to this idiocy that he has not adopted the common sense – the ‘normal’ way of looking at the world which is formed by slow corruption of our sense of compassion on pretext of what is called self-defense in a cruel world.P. is full of compassion – which is very clear from stories he tells (the stories you tell, tell a lot about yourself.) His goodness (unlike Evegeine’s calculated goodness and Ptitson who allows himself only small evils) makes him indifferent to harm being done to himself if it means happiness of someone else. If you try to insult or hurt him; he would feel sorry for circumstances that made you do so; and let you cheat him. It is not so much that he doesn't notice or can't defend the harm done to himself but rather he prefers to suffer himself rather than bring on others - even if others are sinister in their ways. He has no sense of social class - he could talk in the same way with servants or master, grownups or children. He lets you make fun of him – often himself joining the lough himself.He won’t stand for his rights but would stand to fight for others. He got into a fight twice within novel, and both times it was to defend someone.His natural goodness won’t let him be suspicious, angry or jealous of anyone; in fact he would reproach himself if he finds himself harboring any such emotion. This restrain is contrasted by people that surround him – drunkards, rogues etc (FD’s novels are always full of contrasts) It is not that he is above all emotions – he is easily excited – but by such emotions like guilt, gratitude and happiness and never so much that he could harm someone.He is tipsy and cuts a messy figure which makes people under-rate him – the fact that he himself is ignorant of his abilities doesn’t help. He has a kind of inferiority complex about him, can’t believe that he can be loved by a woman – which is ironical because four woman are attracted to him during the novel.A loved idiot\nThus it is easier for you to make fun of him; but you will do it at your own peril; his turn-the-other-cheek attitude is bound to find your love sooner or later. Even those who try to cheat on him end up loving him. A third reason for which he attracts attention is curiosity. He is purely original in his thoughts (as opposed to Gania’s lack of originality.) Thus while people under-rate him in beginning; soon they all end up respecting him - in a way. They adopt him, pet him, forgive him all mistakes and want him to do well in life; because of his absolute inability to harm anyone.Lizaveta likes him but do not want him to marry her daughter to him - knowing that his goodness won't let him survive him for long in the world. However she won’t admit to herself reasons for same. One of  the women he loves, leave him as she thinks she doesn’t deserve him; another leaves him because …. Well, in being good to everyone, he ends up hurting her. P. is a good example who shows that if we play the good Samaritan too much; it is always at cost of harming ourselves and, perhaps more importantly, those who love or depend on us. \nChrist?\n\nP. was supposed to be inspired from a Hans Holbein the Younger's painting 'The Body of the Dead Christ in the Tomb' (see below)  - the realism of which struck both FD and P. powerfully. P's reaction upon seeing painting is here:\n\n\"The prince glanced at it, but took no further notice. He moved on hastily, as though anxious to get out of the house. But Rogozhin suddenly stopped underneath the picture. […]\n\"I like looking at that picture,\" muttered Rogozhin, not noticing, apparently, that the prince had not answered his question.\n\"That picture! That picture!\" cried Myshkin, struck by a sudden idea. \"Why, a man's faith might be ruined by looking at that picture!\"\n\n\nIt is the fact that in this painting Christ has wounds and looks beaten just like mortal, his body is seen putrefying. FD's wife note how she had to take him away from this painting as she was afraid he would get one of his attacks.While P. never preached or anything, FD definitely put Christ's good heart in him. There are other important distances between two, unlike Prince, Jesus was not shocked upon discovery the barbarity prevalent in the world. Jesus was, IMO, more assertive too and at least once got angry.Prince's complete lack of aggressiveness is completely contrasted by Rogozhin, Dostoyevsky's idea of anti-Christ. And this anti-Christ isn't pure evil but someone who can't stand the idea of being cheated upon. A person lacking ability to forgive is all that Dostoyevsky's idea of evil. However Dostoyevsky goes one step further making Prince and Rogozhin friends. In the end, Prince's couldn't defeat the anti-Christ in Rogozhin and his own compassion became his doom.FD makes P. a true Christian – a christen by heart and default; and convinces us that it is suicidal to be good in a world of corrupt souls."}, {"userName": "Darwin8u", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "“Don’t let us forget that the causes of human actions are usually immeasurably more complex and varied than our subsequent explanations of them.” ― Fyodor Dostoyevsky, The IdiotAt once 'The Idiot' is a complicated, beautiful and yet ultimately a somewhat flawed novel. Written shortly after 'Crime and Punishment', it seems like Dostoevsky wanted to invert Raskolnikov. Instead of a mad killer, Prince Myshkin the 'Idiot' is an innocent saint, a positive, a beautiful soul and holy fool motivated by helping those around him. He is a Christ in an un-Christian world, a tortured Don Quixote.Dostoevsky is able to use Prince Myshkin's spiritual intelligence and Rogozhin's passion to illuminate the main problems and idocyncrasies of Russian society. But the story still falls a bit short of perfection. It literally falls between 'Crime and Punishment' and 'Brothers Karamazov'; failing to achieve the simple greatness of 'Crime and Punishment' and the complex greatness of 'Brothers Karamazov'. Like Myshkin himself, the novel's intent is nearly perfect, but the execution is just a little off, a little unstable. That doesnt mean I didn't love it. As a novel I adored it. I was both taken by and frustrated with Prince Myshkin.Perhaps my favorite parts of this novel fall into the scenes where Dostoevsky is focused on a painting or an execution. He isn't content with a superficial look at the world. He examines things for depth and poignance that actually left me shaking. He studies Holbein's grotesque 'The Body of the Dead Christ in the Tomb' with a patient, detailed eye that at once appears to capture the whole life and death of Christ. He describes the beheading of John the Baptist; looking for details of his face in that still and eternal second before his execution. In this Dostoevesky is recreating his own near execution and the horror and magnificence that death (or a near death in Dostoevsky's case) brings to a person's fragile, beautiful and flawed life."}, {"userName": "Maria Thomarey", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/34050297-maria-thomarey", "userReview": "Αυτο το βιβλιο το εχω διαβασει δυο φορές . Την πρώτη ήμουν γύρω στα δεκάξι , την δεύτερη , οταν σε μεγάλη ηλικία πήγα στο πανεπιστήμιο . . Ηταν μέρος μαθήματος . Ετσι ξανασυναντήθηκα με τους ήρωες και τον κοσμο του Ντοστογιεφσκι μ. Εχω την αίσθηση ομως πως αυτοι οι ήρωες και αυτος ο κοσμος ποτε δεν εξαντλούνται. Παντα θες να γυρίζεις εκει . Εκει διπλα στο τζάκι που οι ήρωες κάψανε τα όνειρα τους."}, {"userName": "Perry", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "A Prince Among Men\"The humor of Dostoyevsky is the humor of a bar loafer who ties a kettle to a dog's tail.\" W. Somerset Maugham, A Writer's NotebookPrince Myshkin, this novel's protagonist, immediately came to mind when I recently heard the phrase \"a prince among men,\" well after having read this a few years back.What happens when you drop into higher society a man with a title but an illness that took him away to Switzerland for all his youth? Dostoevsky wanted to write a novel that answered the question of how society of the day would treat a true innocent, an unmarried man in his mid-20s who does not sin and only has love to give (in Christianity, only One fits that description). To me, this was Dostoevsky's sad, but hopeful parabolic answer. While published in 1869, The Idiot is essentially timeless and remains one of the best novels of all time.This is the second novel I've read of Dostoevsky in which he depicts the females less than favorably. Understandably so in this novel. The primary basis for the lead female in this book, \"Natasha Filippovna,\" was Polina Suslova with whom Fee-Yo had a relationship while his first wife was sick with consumption. He found Suslova imperious, manipulative, jealous, noting, for example, that she repeatedly demanded he divorce his \"consumptive wife.\" He later wrote of Suslova that she was \"a sick selfish woman\" who refused to tolerate any imperfection in others and whose \"selfishness and self-esteem were colossal.\" After his first wife's death in 1865, he proposed to Suslova, but she declined. She didn't respect, and rarely read, his books and regarded him as a simple admirer.Polina SuslovaOf the 3 Dostoyevsky novels I've read (The Idiot/The Brothers Karamazov/Crime & Punishment), the first two depicted ladies unfavorably. The negative depiction of Filippovna in The Idiot was crucial to the story. On the other hand, I found the negativity toward females gratuitous in The Brothers Karamazov.In any case, I highly recommend this novel, one of my favorites."}, {"userName": "Elie F", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/54680202-elie-f", "userReview": "A Russian Don Quixote?In mid-19th century Russia when Dostoyevsky wrote The Idiot, it was the heyday of the thoughts of the Slavophiles who suggested a dichotomy between Russia and the West, the former being more spiritual, pure, and harmonious, the latter being more material, unfaithful, and cynical. In The Idiot, Dostoyevsky portrayed a dichotomy within Russia itself. Myshkin, the Idiot and simultaneously a man of great intelligence, is distinguished from the Russian society. Even though everyone more or less recognizes the good nature in him, everyone is unable to understand him and eventually see him as an enemy. Myshkin, on the other hand, is able to understand others, sympathize with them, and see through them the way they themselves cannot. Myshkin the idiot especially has the capability to understand and care for other socially awkward, rejected, derailed, or insane people, such as Nastassya, Rogozhin, and Hippolite. And in return these people, Rogozhin in particular, have more capability than the rest of the society to understand him. I don't think the character of Myshkin is strictly good or Christlike. He is more undefinable, more unintentionally harmful, more pathological than that. The Idiot not only presents to the reader a complicated moral world, but also a equally complicated and seductive aesthetic world: Myshkin is in this sense a Russian Don Quixote.\"I'll just mention that of the beautiful people in Christian literature Don Quixote stands as the most complete. But he is only beautiful because he is ridiculous at the same time.\" (Quoting Dostoevsky's letter to Sonya to whom The Idiot is dedicated)"}, {"userName": "Teresa Proença", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/6923777-teresa-proen-a", "userReview": "Terminei O Idiota com um nó na garganta.Fui reler a opinião do André e fiquei de lágrimas nos olhos.Li a pequena biografia de Dostoievski, na badana da minha edição, e...\"Em 1849, quando escrevera já uma dúzia de contos, foi preso e condenado à morte. A pena foi substituída à última hora por cinco anos de trabalhos forçados numa prisão siberiana.\"Se a pena não tivesse sido substituída, não haveria Crime e Castigo, Os Irmãos Karamázov, O Idiota e tantas outras obras criadas por um Génio, que eu tive o privilégio de ler, na minha juventude, e que contribuíram para a formação da leitora (pessoa?) que sou hoje; uma idiota dirão muitos mas, infelizmente, muito diferente do Grandioso Príncipe. Míchkin, um anjo solitário, que acredita que a generosidade, o amor pelos outros e a beleza do mundo são o caminho para a felicidade. Não sei se soube ler O Idiota como ele merece, mas sei que sou muito pouco para escrever sobre ele. \"É melhor ser infeliz e saber do que feliz e viver...como um parvo.\""}, {"userName": "Megan Baxter", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "What is the difference between simplicity and being an idiot? In different ways, this question is asked over and over again over the course of this book. And can an honest man survive in society - to be precise, Russian society in the 19th century. Note: The rest of this review has been withdrawn due to the recent changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Наталия Янева", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/9539140", "userReview": "А вие знаете ли що е то идиот? Срещали ли сте идиоти в живота си? У нас думата „идиот“ е особено широко понятие и се прилага щедро по отношение на хора, които най-общо не са съгласни с вас или по ваше мнение са извършили въпиеща глупост. Според „Речник на дявола“ на Амброуз Биърс идиотът е „член на голямо и мощно племе, чиято роля в човешките дела винаги е била господстваща и ръководна“. В българския Наказателен кодекс пък е заложена като цяло хуманната идея на законодателя, че идиотията, сиреч най-високата степен на невменяемост, е предпоставка за освобождаване от наказателна отговорност. Защо пиша всички тези несвързани неща ли? Защото „идиотът“ на Достоевски е един малко по-особен вид. Не си спомням да съм чела роман от руски автор, в който персонажите да не изпадат в крайни изстъпления и речта им да не е претенциозна и изпълнена с полулични размишления, полуобръщения към събеседника, поради което цялото повествование добива един леко фантастичен характер. Приковава погледа тази хипнотизираща динамика и ви се струва, че всъщност пред вас се разиграва някакъв спектакъл с очарователните леко преекспонирани театрални маниери, характерни за това изкуство. В произведенията на Достоевски има допълнително насищане поради това, че основните му персонажи винаги стоят на ръба на някоя бездънна лична пропаст и въпросът никога не е „Дали?“, а „Кога?“.„Аз не съм съгласен и даже се възмущавам, когато някои ви наричат идиот; вие сте твърде умен, за да ви наричат така; но съгласете се сам, че сте толкова странен, че се различавате от всички хора.“Князът светец Мишкин е опитът на Достоевски да създаде образа на „напълно прекрасния човек“. Прекрасният човек, който може да бъде такъв, само ако е „малко смешен“, също като Дон Кихот, и сам не вижда чистотата си. „Той би сметнал за нещо чудовищно възможността да бъде обичан „такъв човек като него“. Идиот е Мишкин и всички му повтарят това, не толкова поради епилептичните припадъци, които уж от малък са го оставили почти без разсъдък, а защото „не лъжете на всяка крачка, а може би и съвсем“. Не пропускат да покажат изменчивата си човешка природа и хората, които искрено се възхищават от княза и дори го „обичат“. (Друга странност на руската литература за мен – всички или „обичат“ някого, или „не го обичат“, или може би го „презират“. Като че русите не са способни на по-умерени чувства от тези две крайности. Може би това е някаква част от онази необятна руска душа, която още никак не мога да разбера). Сякаш някак се бояха от това негово така неподправено добродушие и искреност, като от някаква причудлива стихия се бояха, която може да ги глътне и обезличи. Как да не те е страх от нещо толкова непонятно и да не се опитваш да го омаловажиш, потъпчеш дори, че да се предпазиш?„... аз ви смятам за най-честния и най-справедливия човек, по-честен и по-справедлив от всички, и ако казват за вас, че вашият ум… тоест, че понякога вие сте болен умствено, това не е справедливо; аз се убедих в това и спорех с другите, защото макар че сте наистина болен умствено… главният ви ум е по-развит, отколкото у всички тях, до такава степен дори, че те и представа нямат“.В „Идиот“ Достоевски се нагърбва да опише не само пътя на своя „княз Христос“, но и отношенията в следреформена Русия в средата на XIX век. Особено се интересува от съдебната реформа на Александър II, която напълно изменя съдебната система в Русия и въвежда принципи като свободната адвокатура и съдебните заседатели – тема, която е доста застъпена и в \n„Братя Карамазови“\n, най-вече в процеса срещу Митя. Неведнъж се споменава и „женският въпрос“ и последвалото колебание на жените дали социалната роля, която са изпълнявали досега, е достатъчна. Като цяло Достоевски винаги развива персонажите си не някак отвлечено от историческия контекст, а ги представя като продукт и продължение на увличащите социални течения и в контраст с реакционните възгледи. Особено остро парва сарказмът му по повод на „оригиналниченето“ и типичния и до днес възглед на човека, че за да успееш в живота, трябва да си колкото се може по-конформистки настроен. Като всички останали в стадото. Всъщност Достоевски често пришива обръщението „идиот“ към княз Мишкин, но позицията му не оставя съмнение кои са всъщност истинските идиоти в романа.„Ще се намери ли например майка, която нежно обича детето си, да не се изплаши и разболее от страх, ако синът или дъщеря ѝ малко излезе от релсите? „Не, никаква оригиналност, нека по-добре бъде щастливо и живее в охолство“ — мисли всяка майка, когато приспива детето си.“„… известна умствена тъпота е като че ли почти необходимо качество ако не за всеки делови човек, то поне за всеки, който сериозно се е заел да трупа пари.“Не ми се ще да нищя сложните характери на Рогожин, Настасия Филиповна или Аглая и отношенията им с Мишкин. У всеки от тях има повече и по-малко безумие, къде от страст, къде от унизено чувство за достойнство или пък просто от младост. Достоевски не дава оценки. Просто описва и наблюдава тези деца на тогавашното общество, които имат по един невидим клуп от човешки слабости около шията и той ги души ли, души. Наблюдава ги и Мишкин и страда за тях и заедно с тях по толкова човешки начин."}, {"userName": "Dem", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "I tend to applaud writers who can tell an amazing story in few pages to those in need of a tome to tell a mediocre storyI read The Idiot as my quarterly 2017 classic challenge and had hoped for the experience I has this time last year while reading War and Peace by Leo Tolstoy. War and Peace I really enjoyed as the plot and the characterisation was excellent and the book was so readable and interesting, while The Idiot is readable and is well written in places it does tend to be on the dry side and I found myself bored in many chapters and confused in others. While I liked the characters I felt the book and especially the first 100 pages was awkward and sluggish.A young Man in his mid twenties by the name of Prince Myshkin returns to Moscow after spending time in a Swiss Clinic for treatment. On his return to Moscow he finds himself a stranger in a society obsessed with wealth and become involved in a love triangle. The tale is primarily a love story and and a good old fashioned tale of good versus evil.A nice hardback edition for my bookshelf and while I don't regret reading it, it's not one for my favourites shelf. I may try The Brothers Karamazov as many of my friends have recommended it over this one."}, {"userName": "Roy Lotz", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/14046996-roy-lotz", "userReview": "This book disappointed me. I never thought I would be saying this with regard to a book by Dostoyevsky, but it's true. Perhaps this is only because I’ve been spoiled by reading The Brothers Karamazov, which even admirers of The Idiot will likely admit is a much stronger work. Yet I was not merely unimpressed by this work, but was often greatly frustrated by it. To be concise, I found The Idiot to be a rambling mess.Anyone familiar with Dostoyevsky’s work will know that he is not a versatile artist. He is a writer with obvious flaws and with tremendous strengths. It is, therefore, incumbent on the reader to look past his demerits—his clunky dialogue, his exaggerated personalities, his slipshod plots—in order to appreciate his peculiar genius, if the reader is to get anything at all out of his works. In this book, however, I found his usual deficiencies to be overabundant, and his usual brilliance to be pushed to the side.Let us take the protagonist. He is supposed to be a nearly perfect man, the very picture of benevolence and kindness. Yet I was not at all impressed with Prince Myshkin. He was a polite and amiable fellow, sure. But did he go very far out of his way to help others? Was he capable of doing any good? Was he busying himself in improving the world? Not at all. Rather, Myshkin comes off as rather bumbling and self-absorbed. This was, of course, partly Dostoyevsky’s goal—to show how true kindness can make you vulnerable and lead to inactivity and ruin. But the impression I was left with was not of a kind man tragically taken advantage of, but a man who was simply incapable of dealing with the world; a man not overly virtuous, but simply inept. This is in stark contrast to two of Dostoyevsky’s other characters, Father Zossima and Alyosha Karamazov, both of whom I found to be more wise, more open-hearted, more interesting, and many times more capable than Prince Myshkin—who, to be frank, is so passive as to be dull.It is clear that much of this novel’s design is due to the influence of Don Quixote, which Dostoyevsky refers to many times during the course of this work. Prince Myshkin is something of a Quixotic character—a bit of a dunderhead, a bit of a loon—except that he is tragic, whereas the Don is comic. We also see Cervantes’s influence in the large and unwieldy cast of minor characters (something not typical of Dostoyevsky), who continually intrude, sometimes violently, on the main action of the plot. It seems that Dostoyevsky vaguely wanted to write a genuine burlesque, with a witless protagonist suffering misadventure after misadventure in the real world. But of course, Dostoyevsky turns this general idea into a distorted nightmare that very often borders on absurdity.Either from lack of practice, or simply because he wrote this novel very quickly while in dire financial straits, Dostoyevsky didn’t seem up to the challenge of keeping track of all these minor characters. All of them act erratically, often to the point that they are unrecognizable one scene to the next. They suffer acute changes of mood and opinion, veering from emotion to emotion too quickly for the reader to even keep up. Admittedly, this is characteristic of much of Dostoyevsky’s writing; and to be sure, he often uses fitful, unpredictable, and irrational characters to brilliant effect, keeping the reader constantly on edge. But in this work, I found it to be so overdone as produce a kind of apathy in me. I couldn’t wrap my head around the characters enough to care about them; and since I didn’t really know them, and thus didn’t expect anything from them, they couldn’t surprise me—since surprise is the thwarting of expectation.Perhaps what I most regretted about this design, however, was not the shoddy characterization, but how it forced Dostoyevsky to deal with his typical themes. Instead of putting his always arresting philosophical speeches into the mouths of major characters, several minor characters butt into the story in order to deliver lengthy and, from the perspective of the story, rather pointless harangues that are promptly swept to the side. So instead of the critique of modern society, nihilism, rationalism, and his analysis of the decline of religion being in the forefront, these themes are peripheral, which I think is a shame.This is not to mention the several incidents that Dostoyevsky introduces apparently only to stretch the page-count (he was being paid by the page). The most egregious example of this was when a young man bursts into a drawing room, spends an hour claiming that he is the son of Prince Myshkin’s doctor and is thus owed money, and reads a lengthy and absurd article that Myshkin then refutes point by point; then, another minor character announces that he has been researching this man for some time (why?), and reveals that his claim to be the son of the doctor is false—and this, after an interminable conversation with many other side-remarks—so that the whole affair comes to absolutely nothing, and isn’t at all important to the rest of the book. This enormous amount of space dedicated to side issues is especially perplexing when one considers that major plot developments are, by contrast, introduced willy-nilly without much ado—such as when Prince Myshkin simply announces, in the midst of a major scene, that he has inherited a large sum of money.To cut short this review, I found this to be a deeply flawed book, one that obviously needed several more drafts before it could be really compelling. I am still giving it three stars, however, because there are occasional brilliant flashes. I especially liked when Prince Myshkin spoke of executions, and Lebedev’s story about the repentant cannibal who killed and ate monks. Yet these shining moments were overshadowed by the many pages of tedium. Of course, it’s quite possible that I missed something. One of my friends is a big fan of Dostoyevsky, and he says this book is his favorite. But until my eyes are opened to this book's secret merit, I will steer those who ask to Crime and Punishment and The Brothers Karamazov, which are not merely occasionally brilliant, but splendid from beginning to end."}, {"userName": "أحمد جابر", "userReviewDate": "Apr 05, 2015", "userURL": "http://www.goodreads.com/user/show/14003483", "userReview": "لا أدري تمامًا ما يجب قوله، لكن سأحاول:الأبله، رواية الأمير ميشكين الذي يعاني من مرض الصرع، يترك مصحته في سويسرا، ويعود إلى روسيا، بلده الأم، فيلتقي برزوغنين، ولبيدييف في القطار الذي يعود به إلى موسكو. يتعارف ثلاثتهم على بعضهم، ويجدون ترابطًا في علاقاتهم. يذهب ميشكين إلى بيت قريبة له، فيستقبله زوجها، يتعرّف على العائلة فيما بعد، وتستكمل الرواية.هل هذه هي الرواية؟ نعم ولا. إن قال أحدهم اعطني ملخصًا عنها فسأعلن فشلي، رغم أن هناك أكثر من خمس وعشرين شخصية في الرواية، هناك أحداث كثيرة، لكن كل هذه الأحداث لا تهم أمام المغزى من الرواية، أمام ما يريد دوستويفسكي أن يصفه ويقوله.أحببت المباشرة التي أتى بها دوستويفسكي، مشهد القطار في البداية، ودخل مباشرة في الرواية، لم يقدّم، ويكتب ذلك السرد الطويل قبل أن يبدأ.الأبله، هو الأمير ذاته. الذي يحاول إرضاء الجميع رغم عدم اكتراثهم به، يحاول أن يسعدهم على حساب مصلحته. بريء، ووحيد. دخل إلى عالمهم، غيّرهم، لكنّه لم يخرج في النهاية بشيء، وعاد كما جاء. إلا إنني أؤكد أنه أضاف وغيّر فيهم، سواء في خط سير حياتهم أو أفكارهم.منذ أن يفهم القارئ، أن الأبله هو الأمير، سيثير ذلك تعاطفًا معه، وسيكمل الرواية كلها متعاطفًا مشفقًا على ميشكين.ميشيكين، يحب أناستاسيا، التي لا تنتمي لعالم الأسياد، ثم تتخلى عنه. يحب أغلايا، وأيضًا تتخلى عنه. أقول مرة أخرى، لا تكترثوا للأحداث، لأنني قد أسيء الوصفَ، إنما هنا في رواية الأبله، كتب دوستويفسكي أنواعًا من الحب، حبًا غرائبيًا فعلاً، حبًا أبلهًا ربما. كتب عن الحب الذي يأتي من الشفقة، وآخر بسبب الغيرة، والخوف، والغضب، والجنون. كل هذه الأنواع موجودة، إذا كان الحبيب فيه شيء من البلاهة، أو الطيبة الزائدة، أو الطفولة، أو قلبًا صافيًا نقيًا محبًا.في الرواية، لن تتنبأ بما سيحصل، ولن تصيب في توقعاتك لمسار الرواية، وهذا يسحب نقطة لمصلحة الكاتب متفوقاً على قدرة القارئ في التخيل.ميشكين، يقول بلسان حاله، أرى أني ما زلت طفلًا، كل إشاراتي خاطئة، وأعبر عكس ما أريد. لا أتمتع بموهبة التنسيق والاتزان، لهذا أعتقد أنه ينبغي أن أظل صامتًا، لأنني ساعتئذ، أبدو شخصًا رصينًا عاديًا.قلبه النقي، يبكي، يبكي العالم، كأنه المأتم. حسنًا، انسوا ما قلته سابقًا واسمعوا ما قاله، الأبله يقول: \"الجمال سينقذ العالم\"، ياااه!! نعم يا ميشكين، الجمال من وجهة نظرك سينقذ العالم، ولكنّك وجمال قلبك، ضعتَ، وضيعوك، وحاكوا المؤامرات، وضحكوا منك، وسخروا عليك، ووصفوك بالأبله والمعتوه، ومع هذا تقول الجمال سينقذ العالم.عزيزي دوستويفسكي، سأردّ عليك كما قال حسين البرغوثي: \"الجمال لن ينقذ العالم، ولكن الجمال في العالم يجب إنقاذه\".هي ثالث رواية أقرأها لدوستيوفسكي بعد \"الزوج الأبدي\" و \"حلم العلم\"، وما زلت أنتظر دوستويفسكي العظيم الذي يقولون عنهفي النهاية، أود أن أشير إلى أمر هام، لا تقرأوا روايات دوستويفسكي إلا بترجمة سامي الدروبي، الصادرة عن المركز الثقافي العربي."}, {"userName": "Håkon", "userReviewDate": "May 19, 2016", "userURL": "http://www.goodreads.com/user/show/49126210-h-kon", "userReview": "\"Love children especially, for they too are sinless like the angels; they live to soften and purify our hearts and, as it were, to guide us.\" Dostoyevsky despised the view that a child's thoughts were not worthy of consideration, in fact he believed a child was necessary (aside from the obvious evolutionary necessity of children of course) in our society due to our increasingly selfish tendencies, and believed a child was always well intentioned. This does remind me of a certain character in this book, that of course, being Prince Myshkin.Dostoyevsky did, I believe, create this character as his ideal man, Dostoyevsky's idea of the übermensch. Contrasting the personality of Prince Myshkin to that of the Russian society; which was hugely self-centered, thus rejecting anyone who didn't agree with their fetish world view, and showing how this, in time, will ruin even the most altruistic person there is, which did happen with Prince Myshkin. I think it is fair to say that he was simply too good for this world. This book is, in my opininion, a brilliant indictment of Russian and western society and our continually growing self centeredness and obsession with materialistic possessions, and how this will, in time, crush anyone who tries another path."}, {"userName": "Raiya", "userReviewDate": "Feb 14, 2011", "userURL": "http://www.goodreads.com/user/show/4421312-raiya", "userReview": "هذا الأبله ليسَ أبلهاً .. أن تقرأ الأبله يعني أن تعيش حياته بتفاصيلها الدقيقة.. أن تتفرغ تماماً.فكاتب عملاق كديستوفيسكي لا يمكن تجاهله بقراءة روايته بسرعة، بل تأني حتى تسبر أغوار الأحداث.برأي الشخصي: الرواية دسمة وتحمل معاني كثيرة، فمن مرض بطل القصة النفسي إلى قدرته الخارقة على تحليل الأمور وحل المعضلات وإقتراح الحلول.. تجد مهارة الكاتب في حبك الرواية جيداً وبآلية تجعلك تشعر وكأنك تشاهداً فيلماً إستثنائياً = )متأكدة بأنني سأعود لإكمال قراءة الرواية لاحقاً.. أنصح طلاب علم النفس ومحبي التفكير العميق بها .."}, {"userName": "Paradoxe", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/62376932-paradoxe", "userReview": "Η βαθμολογία και το γεγονός πως σε περίοδο δύο μηνών το διάβασα τέσσερις φορές νομίζω πως είναι το καταλληλότερο πρελούδιο για το βιβλίο - όαση. Όλα μου πάνε στραβά τελευταία και δέχομαι έντονες πιέσεις. Πριν το καλοκαταλάβω τις πρώτες δυο φορές το τελείωσα και το ξανάρχισα. Μόνο στην τρίτη συνειδητοποίησα ότι το είχα διαβάσει ήδη δυο φορές. Ο Φόρεστ Γκαμπ των βιβλίων. Μαζί του διάβασα το Έγκλημα και τιμωρία. Καλό βιβλίο, αλλά δεν πιάνει μπάζα μπροστά στον Πρίγκηπα. Όποιος αρέσκεται να λέει πως διαβάζει κλασική λογοτεχνία να μην το διαβάσει. Ξεχάστε όλες αυτές τις μπούρδες. Βάλτε το δίπλα στο κομοδίνο και κρατήστε το εκεί. Να θυμηθείτε το γερό Σενέκα που έλεγε για τους φίλους συγγραφείς που είναι πάντοτε εκεί χωρίς καμιά πρόθεση να μας γιουχάρουν, να μας ποδοπατήσουν, παρά να μας διδάξουν και να μας αγαπήσουν. Ίσως πολλοί να μην καταλάβουν γιατί, αλλά αν υπάρχει μια συγγένεια του βιβλίου αυτού με άλλα, αυτά είναι η Μινιόν του Γκαίτε και το Αναμνήσεις εγωτισμού του Στεντάλ. Μπορώ να γράψω κι άλλα το βρίσκω ωστόσο περιττό. Ηθική και λογοτεχνία στην καλύτερη συνύπαρξη τους."}], "description": "Returning to Russia from a sanitarium in Switzerland, the Christ-like epileptic Prince Myshkin finds himself enmeshed in a tangle of love, torn between two women—the notorious kept woman Nastasya and the pure Aglaia—both involved, in turn, with the corrupt, money-hungry Ganya. In the end, Myshkin’s honesty, goodness, and integrity are shown to be unequal to the moral emptiness of those around him. In her revision of the Garnett translation, Anna Brailovsky has corrected inaccuracies wrought by Garnett’s drastic anglicization of the novel, restoring as much as possible the syntactical structure of the original.", "title": "The Idiot", "url": "http://www.goodreads.com/book/show/12505.The_Idiot", "average": 4.18, "cover": "https://images.gr-assets.com/books/1327865902l/12505.jpg", "reviews": 3738, "authors": [{"url": "https://www.goodreads.com/author/show/3137322.Fyodor_Dostoyevsky", "name": "Fyodor Dostoyevsky"}, {"url": "https://www.goodreads.com/author/show/69892.Constance_Garnett", "name": "Constance Garnett"}, {"url": "https://www.goodreads.com/author/show/377462.Alan_Myers", "name": "Alan Myers"}, {"url": "https://www.goodreads.com/author/show/11328.Joseph_Frank", "name": "Joseph Frank"}, {"url": "https://www.goodreads.com/author/show/7945.Anna_Brailovsky", "name": "Anna Brailovsky"}], "type": ["Classics", "Fiction", "Cultural", "Literature", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/12505.The_Idiot", "http://www.goodreads.com/book/show/12854.The_Idiot", "http://www.goodreads.com/book/show/818942.The_Idiot", "http://www.goodreads.com/book/show/9540855-h", "http://www.goodreads.com/book/show/525407.The_Idiot", "http://www.goodreads.com/book/show/17833497-el-idiota", "http://www.goodreads.com/book/show/107844.The_Idiot", "http://www.goodreads.com/book/show/12856.The_Idiot", "http://www.goodreads.com/book/show/275219.The_Idiot", "http://www.goodreads.com/book/show/8287644-o-idiota", "http://www.goodreads.com/book/show/922300._", "http://www.goodreads.com/book/show/26896062-o-idiota", "http://www.goodreads.com/book/show/8129137", "http://www.goodreads.com/book/show/10317920", "http://www.goodreads.com/book/show/9346956", "http://www.goodreads.com/book/show/11659508", "http://www.goodreads.com/book/show/7144.Crime_and_Punishment", "http://www.goodreads.com/book/show/4934.The_Brothers_Karamazov", "http://www.goodreads.com/book/show/17876.Notes_from_Underground_White_Nights_The_Dream_of_a_Ridiculous_Man_and_Selections_from_The_House_of_the_Dead", "http://www.goodreads.com/book/show/5695.Demons", "http://www.goodreads.com/book/show/49455.Notes_from_Underground", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}