{"ratings": 442, "userreviews": [{"userName": "Mohammed", "userReviewDate": "Dec 01, 2009", "userURL": "http://www.goodreads.com/user/show/1842155-mohammed", "userReview": "Middle-period,polished Vance stories makes this collection a masterpiece specially for his SF,Science Fantasy stories.Vance is in my opinion his best in novella length, he can create such wonderful worlds, weird, smart stories in 50,60 pages. More depth than many longer SF novels. His shorter stories are more creative than his best novels. There is huge variety in the shorter stories.Best stories in this collection are: \"The Moon Moth\",\"The Miracle Workers\",\"The Last Castle\",\"The Men Return\" ,\"The New Prime\",\"The Mitr\"The Dying Earth stories in this collection i dont have in the top because i have read them elsewhere in their own omnibus. You cant seprate Dying Earth stories like this collection does."}, {"userName": "Stephen", "userReviewDate": "Feb 15, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "4.5 to 5.0 stars. I have not read all of the stories in this excellent collection so this review is only for the stories listed below (I will update the rating/review as I read additional selections):The Dragon Masters (4.5 to 5.0 stars)- Outstanding Hugo-winning novella about a far future lost colony of Earth battling aliens. Liane the Wayfarer (6.0 stars) - One of my favorite stories from the The Dying Earth featuring Chun the Unavoidable. Guyal of Sfere (5.5 stars) - Another superb tales from the The Dying Earth.The Overworld (5.0 stars) - A classic Dying Earth tales featuring Vance most famous recurring character, Cugel. The Sorcerer Pharesm (4.5 stars) - Another excellent Cugel story set in the world of the Dying Earth. Worlds of Origin (3.5 to 4.0 stars) - A neat science fiction mystery featuring some classic Vance characters and descriptions of alien cultures. The Men Return (4.0 stars) - A classic Vance story about the last survivors of Earth living in chaos after the Earth experienced a phenomenon that has destroyed the \"cause and effect\" rule of nature (i.e. no action's consequence can be predicted). Bizarre and very interesting."}, {"userName": "Jaro", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/41513821-jaro", "userReview": "This special signed edition is limited to 374 numbered copies and 26 lettered copies. This is copy 222."}, {"userName": "TJ", "userReviewDate": "Apr 16, 2017", "userURL": "http://www.goodreads.com/user/show/4296642-tj", "userReview": "The Jack Vance Treasury is a collection of eight shorter works that includes one novella, four novelettes and three short stories. I am rating this one a 5 because it is one of the finest Vance collections ever issued and includes two of Vance's shorter work masterpieces. Recommended to anybody who loves very well written, highly creative fiction. Each story is listed below alphabetically with a brief summary. Gift of Gab, The\"The Gift of Gab\" is a 56 page novella that was first published in Amazing Science Fiction in 1955. Fletcher works on a barge on an alien planet where they harvest barnacles and sea slugs from the ocean to make chemical compounds. One of his men turns up missing and a strange creature grabs Fletcher by the leg and tries to pull him into the sea. This is a planet where there are suppose to be nothing that is predatory toward people. All of the animals on the planet seem harmless, including the very common seal like marine creature called a dekabrach. But much more is going on with the habitants of the planet and also with his coworkers on another barge. The intrigue builds as Fletcher, who is stuck on the planet with his crew until relief arrives, tries to investigate the mystery. \"Gab,\" incidentally, refers to communication between different species. I found this enjoyable to read and I rated it a 3.5.Kokod Warriors\"The Kokod Warriors,\" a 34 page novelette first published in 1951, is one of the Magnus Ridolph series. The \"Women's League Committee for the Preservation of Moral Values\" hires Ridolph to investigate and stop ritualistic battles on another planet (Kodod) where tribes of dwarf like creatures have bloody fights with each other while tourists with their tour guide watch for entertainment. The hotel in the region makes huge profits from the tourists who visit the planet just to watch these killings. Ridolph devises a clever scheme in this interesting and easy to read story that is arguably the finest of the Magnus Ridolph stories. I rated it 5.Men Return\"The Men Return\" was first published in 1957 and is a 9 page short story. It is rather like two universes that overlap after the law of causality, physics and reality on Earth is rendered somewhat inoperable and matter now fades in and out of existence. Humans evolved into two different creatures, one rooted in the laws of science and the other having developed in the coexisting world of randomness and surrealism where nothing seems real. Both groups spend all their time seeking food and are not above eating each other. As food becomes more scarce, the groups become more desperate. It is all very bizarre, but I found it rather fascinating and rated it 3: \"Liked it.\"The Moon Moth\"The Moon Moth,\" is a marvelous work, a novelette of 39 pages that was first published in Galaxy Magazine in 1961. It takes place on the planet Sirene where adherence to specific local customs and protocol is more important than money or even life itself. Edwer Thissell was recently appointed as the new Consular Representative from Earth after the previous Representative to Sirene was killed because he violated a social norm. Thissell has been taking lessons to learn to play various musical instruments in order to communicate with the locals. All communication on Sirene must be made by playing the appropriate musical instruments and singing in a certain respectful way. Social behavior expected on Sirene is so detailed and complex that it is almost incomprehensible to anyone not born in the culture. Slight violations or mistakes might be interpreted as a grave insult or offense and can lead to bodily harm or even death. All of the Sirene residents also wear special masks as must the four men from Earth. Only certain types of masks can be worn depending on the status and musical skills of the wearer. The mask Thissell wears is of the \"moon moth.\" It is a mask of low prestige but a safe one to wear. Thissell is sent a special message by his superiors assigning him the duty of capturing an assassin from Earth who will soon arrive to Sirene. Unfortunately the message is delayed, and the assassin is able to elude capture. Thissell must begin the process of tracking him down in the town where he has to interact with the local people. He knows that violating the strict rules of behavior can lead to severe consequences but he also knows that he will lose his job if he fails. The story is complex, well thought out and skillfully written. It is probably the finest short work Vance ever wrote and is essential reading, a real classic. My rating: 5The New Prime\"The New Prime\" is also known as \"Brain of the Galaxy.\" It was first published in Startling Stories in 1952 and is a 25 page novelette. It consists of five vignettes with different characters and settings. In the first vignette a man with no memory finds himself naked at a 19th century Boston coming out party and has to decide what to do. In the second a different character is in the midst of a losing battle with insect like creatures and decides to order his men to attack the main hive of the creatures he is fighting. In the third a man is in an ancient city of ruins seeking a parchment that can save his lords life. In the fourth a person finds himself in competition to mentally project imaginative images on a screen. In the final scene our main character is captured and tortured by his enemy. It is unclear how these vignettes are related until toward the end of the story where it all comes together. I rated it a 2: \"Okay\"Noise\"Noise\" was published initially in 1952 by Startling Stories magazine. It is a 13 page short story. A man crash lands on a distant planet and begins sending out distress signals, hoping to get rescued. He gradually begins to see and hear strange seductive things and is not sure if his senses have become more responsive or if he is hallucinating. It is a bizarre and interesting story which I rated as a 3. Sail 25 Gateway\"Sail 25\" is a 29 page novelette that was first published in 1962 in the magazine Amazing Stories. It has also been known as \"Gateway to Strangers\" and \"Dust of Far Suns.\" Henry Bent is an irritable, unpleasant, overly sensitive, dictatorial character who seems to be \"a man of a different species.\" He teaches pilots to operate spaceships, in this instance it is one that has a huge sail (thus the title \"Sail 25\"). Bent tells his cadet crew that he does not expect to be liked and that if they do like him then he has failed because, \"I haven't pushed you hard enough.\" All pilots know Bent and respect his skills, but they also invariably dislike him. He has trained almost every well known pilot and is about to train a new crew. During the training flight when Bent is not drunk or hiding from the others, he is sneaking around the ship, spying on the cadets, keeping track of their behavior by making comments in his notebooks where he records demerits. These demerits will determine who passes and who gets axed from the program. Bent also says that he is retiring, that this will be his last flight and hints that he wants to die in space. Is he suicidal? Has he become an incompetent drunk? Or is this the finest training the cadets will ever receive? Each member of his crew reacts differently to Bent's behavior and the challenges of the training. It is all done with humor with a memorable character who is as difficult as any boot camp sergeant. My rating: 3.5The Secret\"The Secret\" is a ten page short story that was first published in 1966 in the British magazine \"Impulse,\" otherwise known as \"Science Fantasy\" and \"SF Impulse.\" It is pure fantasy rather than science fiction and takes place on an island that could be somewhere in Polynesia. It is inhabited by all younger people. As islanders grow older they are tempted to find out the \"secret\" by taking a solo voyage to the west. The secret is completely mysterious because nobody has ever returned to the island once they have left. Our main character, Rona ta Inga, is the oldest on the island. Many of the others have formed a group and pledged to never leave their little paradise of an island and ask him to join in the pledge. Rona, however, begins making a boat. What does he find and what is the secret? I rated this a 3.5."}, {"userName": "Charles", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/1300518-charles", "userReview": "That's it. I made it to 90%, started the last story, can't read another word. I found Vance's use of archaic language annoying, and his pseudo-archaic or made-up fantastical words irritating. I want to know what the words that I read mean. I am happy to use a dictionary. When a writer uses words that aren't in the dictionary, I'd prefer that he provide some context clues for the words--which I suppose Vance does from time to time--and spare use of these neologisms for important elements of the story. What Vance does is drop neologisms and purple prose in service of setting and atmosphere. And for many of these stories, a disproportionate percent of the text is setting and atmosphere. The characters are profuse and often flat. I didn't get a sense of who many of them were, and I rarely cared for or about any of them. Maybe I was born too late for Vance. I do see how he's idiosyncratic and perhaps unique. I just didn't enjoy reading at least three-quarters of this collection. A few stories such as \"Noise\", \"Sail\", and \"The Moon Moth\" redeem it, but that's pretty slim pickins for a book of this size."}, {"userName": "John", "userReviewDate": "Mar 06, 2015", "userURL": "http://www.goodreads.com/user/show/309661-john", "userReview": "Lots of my old faves in this collection: LAST CASTLE, several Cugels, a Magnus Ridolf, DRAGON MASTERS...but too much crap, particularly \"The Mitr,\" which is a lowlight about an innocent castaway being raped by passing thugs, the venturesome but unreadable \"Men Return,\" in which Earth passes into and then out of a zone of non-causality, and most of the afterwords, which are so allusive as to be free of actual insight.But at his best Vance could combine good action with wonderfully erudite mannerist prose, and I think he was also one of the funniest writers in SF:\"I will gladly perform a more comprehensive divination, though the process requires six to eight hours.\" \"So long?\" asked Cugel in astonishment. \"This is the barest minimum. First you are swathed head to foot in the intestines of fresh-killed owls, then immersed in a warm bath containing a number of secret organic substances. I must, of course, char the small toe of your left foot, and dilate your nose sufficiently to admit an explorer beetle, that he may study the conduits leading to and from your sensorium. But let us return to my divinatory, that we may commence the process in good time.\""}, {"userName": "Zachary Stewart", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/5958618-zachary-stewart", "userReview": "A nice collection of various Jack Vance works. One problem: Six Dying Earth stories. Three of them Cugel. These are the most well known of Vance's work and the easiest to find in print. If you already own the complete Dying Earth collection, you may want to pass on this one and find the other half of this book elsewhere. The mini autobiography at the end is pretty neat though so if you are a real Vance fanatic, you will probably want to pick up this volume just for that.Each story has an afterward written by Jack Vance which more often than not has little or nothing to do with the preceding story, so throughout this book does show what is going on in Jack's head, or at least what he wants to show.Overall, highly recommended and a good gift for any speculative fictions fans who don't know Vance yet."}, {"userName": "Jeffrey", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/2683207-jeffrey", "userReview": "Jack Vance is an interesting author. He does a fantastic job of creating these rich worlds of weird nonsense without spending pages and pages on backstory. Vance simply makes up a term or technology if he needs one like a self-aware star trek episode. The stories range from obvious moral parables to strange ramblings on chaos and order. I don't think this would be for everyone, and it took me like three months to finish it, but I was sad it was over.17/52 - A book with more than 500 pages"}, {"userName": "Steven Sullivan", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/34540578-steven-sullivan", "userReview": "An excellent compendium of classic Vance (especially 'The Dragon Masters' and 'The Last Castle' and including 'The Mitr', which is quietly devastating), but be advised that this book uses the 'Vance Integral Edition' versions of the texts -- Vance's unedited original versions. If you're familiar with the edited versions that have been in print for decades, it can be startling to find substantial 'new' text in stories like 'Sail 25'."}, {"userName": "Justin Covey", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/17107877-justin-covey", "userReview": "Everything Jack Vance creates seems to pulse with life. The true gems of this Treasury, such as The Dragon Masters, The Miracle Workers, and The Last Castle perfectly display Vance's genius for effortlessly assembling an expansive cast of three dimensional, memorable characters and creating a setting both fascinatingly alien and utterly believable. Theses stories also display Vance's virtuoso talent for melding familiar tropes from fantasy and science fiction genres into a seamless whole far better and more wondrous than either were apart. A talent also on full display in the Dying Earth tales, some of which are contained in this collection including highlights from the saga of Cugel the Clever, a ceaselessly entertaining, amoral gem of a character.Even the singular clunker in this collection, The Gift of Gab, an early story where Vance's usual character and verve are swapped for technical problems of the hard sci-fi variety and journalistic description, is a better than average story by virtue of it's fully fleshed out world. A world where Vance manages to paint a believable ecosystem including an alien society working of an inhuman system of intelligence and an interstellar bureaucracy capable of exploiting that ecosystem. All that is set up effortlessly with almost no exposition inside a rather short and for the most part engaging story.Finishing the collection is an autobiographical sketch which reveals Vance's life to be as remarkable a story as anything he wrote. A life that included traveling the country performing odd jobs before studying physics at Berkeley, getting into the merchant marines despite poor eyesight by memorizing the eye chart, and building a houseboat with Frank Herbert. Perhaps it is a small wonder that his stories so crackle with life, given that he lived his so fully."}, {"userName": "Fantasy Literature", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/8491232-fantasy-literature", "userReview": "While I don’t think there’s any one novel or short story or even collection of Jack Vance‘s work that comes close to capturing all the best aspects of his writing, I do think that this 633-page Subterranean Press collection does a fairly good job of exposing the reader to a wide array of Vance’s oeuvre. In addition to eighteen stories that span much of Vance’s writing career, there’s a brief comment from Vance himself after each story that gives a little view into how his mind worked while in creative mode, as well as some of the authors and factors that had a major impact on him in developing his writing (note to self after reading one of his comments: re-read P. G. Wodehouse, then find and read some Jeffrey Farnol, two of the writers he says influenced him). There’s also an “Appreciation” by Read More:http://www.fantasyliterature.com/revi..."}, {"userName": "Isca Silurum", "userReviewDate": "Dec 04, 2014", "userURL": "http://www.goodreads.com/user/show/1833113-isca-silurum", "userReview": "Quoth the Raven, \"Nevermore."}, {"userName": "Darth", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/363357-darth", "userReview": "This is likely better than I am giving it credit for, but I just could not get into it.Generally I love short stories, but it seemed like these jumped around and were so jargon-y that it distracted me from enjoying them.I had also read around half of them before, but I dinna always catch on to the fact until later - my fault, but still detracted from my enjoying them."}, {"userName": "Spiegel", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/5718568-spiegel", "userReview": "This took forever to finish. I liked a couple of stories and I appreciated the humor (like the running gag about proper rites), but overall I don't think it aged well. The scenery is spectacular, but the characterization falls flat and gets repetitive. And of course women in general are part of the scenery."}, {"userName": "Mark", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/9349221-mark", "userReview": "I read this in fits and starts: my first exposure to Jack Vance. I finally picked a couple of what seem to be common favorites and ended it there without reading the whole thing, something I rarely do."}, {"userName": "Capitalismissexy", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/74745779-capitalismissexy", "userReview": "Jack Vance is arguably the best author ever.Slight pro capitalism tinge andd anti democrat fascist flavour keeps him hidden by hateful academics and tv n press.As a writer better than anything you will read in school. Has been described as velvety."}, {"userName": "Andrea", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/38258155-andrea", "userReview": "Recommended ed halter"}, {"userName": "Andrew Ceyton", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/4103943-andrew-ceyton", "userReview": "Lovely and variedJack Vance is one of my favorite authors and a master of the short story. His notes on each of the stories are curt and cynical but that just adds to the charm."}, {"userName": "Alex Jackl", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/30840255-alex-jackl", "userReview": "As with all his works... mastery.This is a great collection of the work of a master. I love his humor, insight, and willingness to risk."}, {"userName": "Sheila Jean", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/5495377-sheila-jean", "userReview": "I don't read a lot of short stories. I found some of these interesting and some just downright odd."}, {"userName": "Pinkyivan", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/29831737-pinkyivan", "userReview": "Some stories are amazing, some not so much. I would personally recommend reading the Dying Earth stories in different editions as every interesting one came from those collections, with exception of Cugel, which is not a particularly enjoyable read as you are reading an adventure story in which the protagonist is malicious and evil. This of course wouldn't make a problem, if the nature of Vance in general wasn't primarily high quality entertainment, so instead of wonder, I was left feeling bile in my stomach. The best story, and by far, was The Dragon Masters."}, {"userName": "Chris", "userReviewDate": "Jan 30, 2015", "userURL": "http://www.goodreads.com/user/show/13685378-chris", "userReview": "It's a mixed collection. There are some really neat short stories in here, starting with The Dragon Masters, a tale of breeding an alien race to use in wars on a distance, dirt grubbing little world. Sail 25 is a low-tech sci-fi boom about a terrible space ship master and his fresh out of college crew.Then there is some magical, fantasy rubbish where Vance seems to constantly use 'deus ex machina' techniques to write his hero out of a corner. The 3 Cugel stories are dreck, with a cipher for a hero, outlandish but unexamined situations, and no conclusions.I've enjoyed some of his books in the past, and will stick to his science fiction books, where he takes the tropes and creates a series of interesting worlds with oddities around them, and crafts stories which express those worlds. I will leave his fantasy far behind.I did find one quote interesting, from the Author. \"The less a writer discusses his work—and himself—the better. The master chef slaughters no chickens in the dining room; the doctor writes prescriptions in Latin; the magician hides his hinges, mirrors, and trapdoors with the utmost care.\" --- this was after 'A Bagful of Dreams' one of the terrible Cugel stories in the treasury."}, {"userName": "Jason", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/2201961-jason", "userReview": "This was the first book that I've ever read by Vance. And sadly it will be the last. There were quite a few times where I considered just giving up and not finishing but instead it almost took me a month to finally get through the whole thing. Overall there were two, maybe three of the SHORT stories in this collection that were enjoyable. The longer the story it seemed, the less I enjoyed it. Another reviewer wonders if he was born in the wrong era to appreciate what was written. I too wonder the same thing. The cadence of the language used was very off putting and difficult to get into. Plus the odd language used - newly invented words; archaic words - really affected my being immersed in the story."}, {"userName": "Peggy", "userReviewDate": "Feb 22, 2016", "userURL": "http://www.goodreads.com/user/show/5883190-peggy", "userReview": "Liked the book, especially the fantasy short stories, but I always got a feeling a story was not quite finished. I hope to read some of his novels. He definitely has an imagination as a writer. many of the stories, science fiction, focus on worlds that are dying. I did like the short stories where a character Cojoel (sic) appeared and he gets himself into situations where he as to perform a task. He is a bit of a trickster. If you like fantasy and science fiction short stories you might want to try this one."}, {"userName": "Chris  Longstreet", "userReviewDate": "May 17, 2011", "userURL": "http://www.goodreads.com/user/show/2020788-chris-longstreet", "userReview": "I am investigating the roots and inspirations for Dungeons and Dragons. Much of the magic system comes from Vance and love understanding how everything ties together. Vance has a strong use of language which may be challenging some readers but he paints wonderfully vivid picutres with words. I only read a few select stories in this book, but will eventually go back and finish (hence the middle rating)."}, {"userName": "Steven", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/781091-steven", "userReview": "This omits the late-period Vance works, such as the Lyonesse and Durdane cycles, while over-representing the Cugel the Clever stories that are widely available. But all the quibbling in the world can't diminish Vance's status as a grandmaster of science fiction and fantasy, with a flavorful, highly mannered style that brings to mind a Restoration comedy with monsters and spaceships. Every page of this collection is loaded with wonders produced by a writer of boundless imagination."}, {"userName": "William Humphreys", "userReviewDate": "Mar 07, 2008", "userURL": "http://www.goodreads.com/user/show/187016-william-humphreys", "userReview": "A couple of early, relatively clumsy stories, do not mar what is close to literary perfection in this beautiful collection. \"The Men Return', 'The New Prime' and 'The Secret' were all new to me and particularly amazing.."}, {"userName": "Allan", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/61991-allan", "userReview": "Vance has a really charming old-school style. I enjoyed the first few stories in this book, but was pulled away by other items on my reading list and returned the Treasury to the library. I expect I'll pick up more of his stuff in the future."}, {"userName": "Zvi", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/1125226-zvi", "userReview": "Great collection though it was too bad they couldn't include a bit from the Lyonesse trilogy. Some stories I'd read before -- the classic 'Moon Moth', bits from the Dying Earth -- but enough was new so that it was exciting to read, including the strange novel 'The Dragon Masters'."}, {"userName": "Hermes Solenzol", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/19344651-hermes-solenzol", "userReview": "Jack Vance is my favorite Sci-Fi and Fantasy writer. This is a great compilation of some of his best short stories, including the awesome \"Moon Moth\"."}], "description": "A massive (over 230,000 words) gathering of fiction by the master of science-fantasy.", "title": "The Jack Vance Treasury", "url": "http://www.goodreads.com/book/show/19238783-the-jack-vance-treasury", "average": 4.16, "cover": "https://images.gr-assets.com/books/1386352472l/19238783.jpg", "reviews": 36, "authors": [{"url": "https://www.goodreads.com/author/show/5376.Jack_Vance", "name": "Jack Vance"}], "type": ["Fantasy", "Science Fiction", "Short Stories", "Fiction", "Anthologies"], "outlinks": ["http://www.goodreads.com/book/show/19238783-the-jack-vance-treasury", "http://www.goodreads.com/book/show/40864.The_Jack_Vance_Treasury", "http://www.goodreads.com/book/show/24987193-the-jack-vance-treasury", "http://www.goodreads.com/book/show/951749.The_Dying_Earth", "http://www.goodreads.com/book/show/40866.Tales_of_the_Dying_Earth", "http://www.goodreads.com/book/show/40869.Suldrun_s_Garden", "http://www.goodreads.com/book/show/872816.The_Eyes_of_the_Overworld", "http://www.goodreads.com/book/show/68582.The_Green_Pearl"]}