{"ratings": 1292, "userreviews": [{"userName": "Robin (Bridge Four)", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "I enjoy most Peter Clines books. They are have a Tales From The Crypt or a little twilight Zone vibe to them. Someone told me this was set in the same world as the ex-heroes books, IT IS NOT. This is a whole new zombie apocalypse world with a totally different origin story.I liked how the four short stories were set at about the same time and some characters intersected. It was such an interesting way to tell one short story from varying views and build an origin story in an original way. Each story layers on top of the last to give you a much fuller picture at the end.I always enjoy that little something strange that Peter Clines finds a way to include in his stories."}, {"userName": "11811 (Eleven)", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/4460829-11811-eleven", "userReview": "Standard zombie fare. Well written with decent character development but it still seemed ordinary as far as zombie stories go. 2.5"}, {"userName": "John", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/56438628-john", "userReview": "I won't say it's horrible, but I didn't like it at all! Usually, I like this author, but this book was a bullshit ripoff if you expect a book about zombies to have an element of horror.Maybe it's me... :-s"}, {"userName": "David", "userReviewDate": "Dec 13, 2014", "userURL": "http://www.goodreads.com/user/show/3335664-david", "userReview": "This is a set of four interlinked short stories in post-zombie apocalypse Los Angeles.The first story is about one woman, traveling alone, who is supposedly immune to the virus that creates \"Junkies\" (so-named because they eat literally anything they can stuff into their mouths). She acquires a traveling companion, another woman. Trouble ensues.The second story is about a biological researcher who is brought to a research facility that is trying to develop a cure. He uncovers the Horrible Truth.The third story is about a band of professional scavengers in the post-apocalyptic city who run into something more dangerous than Junkies.The fourth story is about a mercenary/assassin who's still doing his thing after the apocalypse.There is some cleverness in the way each story feeds into the next, but there is nothing really new here for zombie fans. Peter Clines's Ex-Heroes series is more interesting, as he mixes superheroes with his zombies. This is a fun, short read, but it's nothing you haven't seen before."}, {"userName": "Eric", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/2786617-eric", "userReview": "Honestly this little series was great after I read the ZombieFest exclusives on Audible and ever better when cut together as one now. I know these little shorts are going somewhere, wherever Clines takes them I am in."}, {"userName": "Ashley Marie", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/9525996-ashley-marie", "userReview": "*listened to audiobook*This was four different stories but I loved how they all pieced together perfectly."}, {"userName": "Heather Faville", "userReviewDate": "Jan 20, 2012", "userURL": "http://www.goodreads.com/user/show/2697506-heather-faville", "userReview": "Do you like thrilling suspense? Mystery? The Undead? Interested in how people survive in an apocalyptic world? Well then you need to stop reading right here and just trust Doubleshot Reviews and go pick up a copy of ﻿The Junkie Quatrain﻿﻿ by Ex-Heroes/Ex-Patriots author Peter Clines. Go ahead, I'll wait............Ok, got your copy? GREAT! Now pick any one of the 4 stories and read it, then roll a die and pick the next story and continue as such. You're thinking I'm crazy right about now, aren't you? Well, I am a bit touched in the head, but not about The Junkie Quatrain﻿﻿. These stories can be read in any order and can even be read as a stand alone tale, but when put together they tell the tale of a a mixed group of characters surviving/manipulating/scientifically studying the apocalypse. Nearly all the characters at some point come into contact with each other, some effecting certain lives more than others. Just to give a little whetting of the whistle, because I am NOT giving away anything in this review. We meet a tough hardened woman who seems better suited to surviving alone rather than with others, a thoroughly professional killer, a scientist/researcher who has his own agenda and a group of scavengers who just happen upon the wrong building to raid. The tension is tangible at times and the mystery and intrigue continue throughout each story as I tried to figure out on my own how everything fits together. I actually look forward to reading ﻿The Junkie Quatrain﻿﻿ again and in a different order to see how things might change in how I perceive them. This book is a DEFINITE must have and since I know you have already grabbed your copy....roll the dice, sit back with your cuppa and enjoy the carnage."}, {"userName": "Joe", "userReviewDate": "Sep 01, 2012", "userURL": "http://www.goodreads.com/user/show/12400797-joe", "userReview": "Four separate stories! All interwoven! All readable in whatever order you want to read them in! The stories weave themselves around a lean mean woman (with issues) surviving on her own, a band of scavengers that has picked the wrong place to scavenge, a brilliant researcher with luck and integrity to spare, a thoroughly professional killer, and the Baugh-ridden (infected plague victims reduced to the level of cannibalistic meth monkeys). It's a great read, and one I hated to put down so that I could go to work. I truly hope that Peter Clines will give us some more of the Junkie Quatrain. I'm definitely Jonesin' for more of this great story..."}, {"userName": "Stian Drøbak", "userReviewDate": "May 12, 2013", "userURL": "http://www.goodreads.com/user/show/5692659-stian-dr-bak", "userReview": "I am rather fond of Peter Clines other books, and this one was a bit disappointing by comparison, but it still was a good book. It's a bit different in that it follow 3 different character's, but instead of doing like he did in ex-heroes, the characters whole story play out before going to the next character, and all these characters cross path with the others at some point, so you get details that you might have been curious about in the previous character's story. If felt that the end was lacking, since it didn't feel like there was much of a finality to any of the stories."}, {"userName": "Suzanne  Rutherford", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/31609329-suzanne-rutherford", "userReview": "I usually don't read Zombie stories for one reason or another and this was my first. Have to say I loved it. I really LIKE the way the stories were written and how you had the same characters, but varying views of each that intersected each short story kind of making it into a into a \"book'. instead of 4 or 5 different novelle's - which is what I expected."}, {"userName": "Gwen Morris", "userReviewDate": "Apr 08, 2015", "userURL": "http://www.goodreads.com/user/show/9780786-gwen-morris", "userReview": "I loved this. though my favorite chapters were 1 and 4 all of them were entertaining and the audiobook was only 4 hours long so i burned through it on my walk to and from work. Peter clines has definitely become one of my favorite authors."}, {"userName": "Julie", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/14434698-julie", "userReview": "Fantastic set. I love how the stories are independent but inter-related. I picked this because of the narrators, but I also have 4 other Clines books (his Ex-Heroes series) in my To be Listened files. If this is a glimpse into his standard of writing, I'll really enjoy those."}, {"userName": "Ian James", "userReviewDate": "Apr 23, 2014", "userURL": "http://www.goodreads.com/user/show/3155757-ian-james", "userReview": "I want more"}, {"userName": "Linda", "userReviewDate": "May 11, 2014", "userURL": "http://www.goodreads.com/user/show/4830651-linda", "userReview": "These short stories are one story told from 4 points of view. Well written, and believable, the author left me wanting to know what would happen to the characters."}, {"userName": "Dave", "userReviewDate": "Apr 19, 2013", "userURL": "http://www.goodreads.com/user/show/5121849-dave", "userReview": "Quick introduction to Peter Clines' Zombie apocalypse. Very interesting spin, I'm going to add Exheros to my Want to read section!"}, {"userName": "Paula", "userReviewDate": "Sep 28, 2014", "userURL": "http://www.goodreads.com/user/show/11928684-paula", "userReview": "I want to know what happens? How does it end? 4 really entertaining short stories about the end of the world."}, {"userName": "Matt", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/108584-matt", "userReview": "Clines is a real enigma for me. He writes books like 14 and The Fold which I really enjoy, but then he has this whole Ex-Heroes series which I find is a good premise but ultimately extremely mediocre. Unfortunately The Junkie Quatrain falls into the latter category. Four (extremely) short post-apocalyptic stories that are lightly connected to each other and even repeat some of the same events from a different point of view. Short stories are not the ideal format for world building or character development but things are so thin here it felt like I was reading a script for a low budget show on the CW. I thought the first story was the best by far and I wouldnt have minded more of it. I'm not done with Clines for sure, I think I just need to do a better job of evaluating his book before I pick it up."}, {"userName": "Bjorn", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/7171294-bjorn", "userReview": "Meh. It was okay and kinda fun, but I hated the way the women were described. You know that meme about male writers writing women that basically makes fun of the way male writers focus on their female characters' breasts, butts, etc. and how they're all secretly reluctant lesbians, or at least the heterosexual male fantasy version of lesbians? Yeah, this was chock full of that kind of thing. which, if that's your jam, more power to you, I guess. It's just not my cup of tea."}, {"userName": "Mihir", "userReviewDate": "May 26, 2012", "userURL": "http://www.goodreads.com/user/show/1229652-mihir", "userReview": "Full Review originally at Fantasy Book Critic ANALYSIS: There’s an interesting back story to The Junkie Quatrain by Peter Clines. Permuted Press had recently concluded a deal with Audible and invited Peter to write a few short which were to be included as bonus content. Peter agreed and set out to write four loosely connected stories that would resonate with the reader (or listener in this case). The stories can be read in the order they appear or as he suggests in the introduction, to read them after shuffling dice to determine the order of reading. I however didn’t follow Peter’s advice and decide to read them in the order they appear. The first story that appeared in my reading list was “Codependent” It focuses on Holly, a ragged but tough survivor, who has been travelling to reach a certain direction towards a destination. She has walked nearly hundred and forty miles and is looking for her familial connections, what she doesn’t bank upon is companionship. The story is quite a stark one as Holly is consciously trying to avoid the “Junkies” the term coined for the zombie-like humans that have been afflicted with a certain virus. She is trying to be tough as she searches for what she wants. The trouble is you can’t always depend on the company you keep.The second story is called “Predator and Prey”, it’s also set around the same time as the first story. The focus of the story is “the outsiders” a group of people among several groups that used to travel from sanctuary to sanctuary, this story focuses on a relative big group that travels and collects certain things for a select group of people. This time it’s a task for the US military that requires them to retrieve a certain object. What they don’t know is that this time around there might be something more than human that crosses their path.The third story is titled “Confidentiality” and is also set around the same time as the first two stories however in truth is a prequel to all the stories as it gives us the most of the back story about the world, its current junkie problem and its possible origin. The story is centered on Dr. Sam Clemens who gets pulled from his residency in Seattle and is dropped into Los Angeles for an emergency meeting. He doesn’t exactly know what’s it about but the reason for the journey might be something that will reveal what really happened six months ago.The last story is “Strictly Professional” and it deals with a guy called Quilt, he has been extremely successful as a mercenary and he has accomplished all of it by being strictly professional. The end of the world because of the rise of the junkies has thrown a spanner in his schedule however Quilt has managed to adjust his perspective and yet remain a prized asset for the people who wish to hire his services. He however finds out that some things go beyond professionalism and he has to decide how much of a professional he will be.These four stories are set in the same geographical region circa Los Angeles and occur nearly in the same time duration (of roughly two days), the sequence however is different and will be apparent to the readers once they read them however the sequential timeline is third, first, second and fourth. I believe this order will be most helpful for the reader to glean most of the actual happening of the overall saga. These stories follow a Rashomon-like pattern of being connected to each to other; the characters are what bring the stories alive. Each story deals with a set of characters that shine in their stories and draw the reader in. The author does his absolute best with characterization and like his debut series; this makes the story that much more special. The reader feels encompassed in a dying world, which is similar to the world introduced in the Ex-Heroes trilogy but this one is a world of normal humans who have to do extra ordinary things to simply survive. The stories are deceptive as they draw the reader in and manage to surprise the reader with their twists. The reader will be clued in to each story as the threads slowly unfold and readers are given hints about each story as well as the world.The drawbacks about these stories are that while the author does his best to provide a complete picture, the reader is left a bit clueless about the final outcome of the world and the characters introduced in the stories, this bit will cause some dissatisfaction as the reader will want to know more and demand some closure. The threads left hanging are what cause the most amount of discord among the readers. Perhaps the author might also want to explore what happened beyond the eventual outcome of the book. I for one would love to read more about the characters and the world created.CONCLUSION: Peter Clines absolutely shines in these experimental short stories, thereby showcasing his awesome talent which was prevalent stories in the Ex-Heroes series. Give these stories a read if you happen to love zombie stories or thrillers or LOST. The Junkie Quatrain is a must read if you haven’t read Peter Clines yet and if you have, then you definitely know why you ought to read this one as well."}, {"userName": "Jen", "userReviewDate": "Oct 28, 2016", "userURL": "http://www.goodreads.com/user/show/3398300-jen", "userReview": "I thought this 'quatrain' was a unique and interesting way to approach a story - particularly a zombie apocalypse type tale."}, {"userName": "Charmaigne", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/3710262-charmaigne", "userReview": "Another book read by my fast becoming favourite author."}, {"userName": "Albino Castro", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/17976410-albino-castro", "userReview": "Excellent connected short storesGood stories with action, some closure and some leads left unfollowed. Can't wait for more from this author. Maybe a follow-up novella?"}, {"userName": "Jeannie", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/12132892-jeannie", "userReview": "Interesting series of short stories. Kind of the same but not really like the Ex series. I'd recommend if you like Clines' other writing."}, {"userName": "Dionysi Krinas", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/44478940-dionysi-krinas", "userReview": "Another great zombie book, 4 separate short stories that combine into one!"}, {"userName": "JM Wilkerson", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/61659468-jm-wilkerson", "userReview": "Boom...this was a gut punch after reading the others..."}, {"userName": "J.R.", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/7586367-j-r", "userReview": "The Junkie Quatrain is a collection of four stories that intersect but can be read in any order. Think of ‘Pay it Forward’ meets ‘Pulp Fiction’ then add in zombies, the end of the world and how survivors react to it and you might be able to get a hint of what this is all about.To give you an idea what you’re in for, the ‘junkies’ in this book are people afflicted and infected with a contagion that in the early stages, removes inhibitions but in the later stages makes extremely violent. And that’s putting it a bit mildly.In the first story, Holly, a survivor who swings a mean baseball bat, encounters another survivor who looks out of place in the ruins of LA. Holly meet Angie, Angie meet Holly. Angie has no clue how to survive on the meaner streets of LA now that the junkies have taken over. Holly attempts to give her a crash course on extending her life but as they say, events transpire. While trying to gain entry to a sanctuary, someplace that might actually be secure enough to last the night, Holly finds out that Angie had been bitten which explains why she was tossed out of the sanctuary she had been staying in. Whereas Holly appears to be immune to infection, Angie is not but hasn’t presented with frank symptoms, yet.As the two are forced to work together, Holly has to make the decision of how long to allow Angie to travel with her before the disease really takes hold. After encountering an armed group, the decision is made. Angie is dead weight and Holly cuts her loose. You could say the ball is out of the park with that decision.Holly meets Sam at the end of her story and the two decide to travel together.In the second story, Barney and his crew are contracted foragers for a sanctuary. But, as will occur when the world is overrun with infected, mindless, violent junkies, their information is off just enough to put them on the wrong floor and the wrong room of a building that they are supposed to be searching for medical supplies. This is where Quilt comes in but more on him later. Barney and crew end up in a running battle with the junkies and Quilt as one by one they are taken out. Quilt only wants one thing, the item they took from him when they went to the wrong room, his room. During the course of their extraction back to the sanctuary, they encounter Holly and Angie mistaking them for competitors. Running and gunning in an attempt to make it back, Barney’s crew of salvagers finds out that there are worse things at the end of the world then ravenous zombies. There is Quilt.In the third story, we get some detail on who Sam is. Sam infiltrated the same sanctuary that Barney’s crew was working for. After creating havoc within, he escapes and ends up where we first met him at the end of Holly’s story. I’m not giving away what he does or how he does it, you’ll have to read the story for more info.In the final story, we are introduced to Quilt, a character that harassed and exterminated most of Barney’s forage/salvage crew from story two. Quilt is a person who looks nothing like what you would assume to be a professional killer. He’s a germaphobe for one thing. It’s even possible he has some OCD issues. But what stands out the most is his incredible hand-eye coordination. This unassuming character is a total cold-blooded hardcase. Well-armed and motivated to regain possession of an item taken from his secure suite, he has no problem engaging junkies and foragers to get what he wants. Overall, The Junkie Quatrain was a very enjoyable read. The storylines were intriguing and well developed. A great addition to any zombiephile’s library."}, {"userName": "Patrick D'Orazio", "userReviewDate": "Feb 24, 2012", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "The Junkie Quatrain consists of four short stories that are intermingled much like Quentin Tarantino did when he crafted Pulp Fiction, and even Resevoir Dogs. Each story has characters that pop up in the other stories, and reading all four brings them all together nicely. Of course, it is important to note that you can read them in any order, and in fact, while they naturally appear in a certain order in the ebook format, the author encourages you to roll the dice when you decide which story to read first, second, third, and fourth and I tend to agree with that recommendation. To give a brief synopsis, these stories take place about six months after the start of a viral plague that turns its victims into jittering, verbally mush mouthed monsters that twitch and move around like their drug addicts-thus the nickname \"junkies\". Since this is in the vein of 'infected' or 'zombie' tales, they are also ravenous and go nuts when they see the uninfected. It should be noted that they also attack each other on occasion-they travel in packs, and some seem to be set upon by members of these packs. This includes the injured and the weak. The four stories found here were used separately as additional audio tales for the author's novels when they were transformed into their audio versions. Together, they amount to a novella, and one that reads fast and with an incredible amount of energy to them all. In my humble opinion they fit together perfectly, with each additional tale adding layers to one complete and complex story that takes place over the course of a couple of days in an apocalypse torn LA. One story deals with a woman who is a loner trying to find a place off the streets and away from the junkies, though she has a certain amount of admiration for the creatures and their ability to work together in packs. Another story deals with 'Outsiders' who are willing to go out into the world to gather supplies for those who hide away in barricaded fortresses to protect themselves from the junkies. The third tale is of a young doctor and top virologist who is called to LA by the government to help find a cure for this plague, though things aren't quite that simple. The final story tells of a man who once made his living as an assassin, but now just has a bone to pick with some folks who decided to steal a prized possession of his from one of his hideouts in LA. Peter Clines has done a bang up job with both his Zombie/superhero novels and appears to have outdone himself here, with each of these tasty apocalyptic tidbits."}, {"userName": "Rubi", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/54608801-rubi", "userReview": "Zombie. 4 povesti diferite ce sunt unite accidental.Lectura scurta si buna."}, {"userName": "Kristoffer", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/43764149-kristoffer", "userReview": "I am giving this book 3 and one half stars. This book has four slightly interwoven tales of survival in a wasteland of zombie-like people referred to as junkies.Unlike what you generally hear about with zombies, junkies take about 1 to 2 weeks to turn and go through a series of symptoms over time. I really liked this take on the zombie sort of genre. I won't reveal the symptoms of turning, in case that would be considered spoilers for anyone, but I will say that the symptoms make the spread of the virus way more believable. In so many zombie related things, people turn into zombies fairly quickly and show obvious zombie signs. Also, zombies generally move slow. These things combined make many people say that a zombie apocalypse is implausible because the zombies turn quickly enough and are slow enough that they would quickly be noticed and easy to take care of if zombies did occur. Because of Peter Clines' great take on this genre, those common complaints aren't a problem in this book.Still, I felt that the stories were kind of generic aside from the unique take on zombies. I love Peter Clines' writing and felt that this book wasn't quite on par with his other stuff. However, Peter Clines seems to be the sort of author whose stories just keep building up and getting better by the page. This book was fairly short though and so did not have time to develop into what it could have been. Despite being generic in some ways, Peter Clines managed to get his stories past the point of dullness by the third story and was starting to get good near the end of the third story. I've seen this book referred to as part one, and so I am hoping that there is more to come. I believe that another book in this series would be starting off of the good base that this book created, take those things and add some interesting new ideas to them, evolving Peter Clines' \"junkies\" series into something really great.Unfortunately, the flaws of The Junkie Quatrain hold it back at 3 and one half stars, but it is still worth reading and hopefully will get a sequel."}, {"userName": "Justin", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/5632782-justin", "userReview": "While we eagerly await the sequel to Ex-Heroes and Ex-Patriots (Ex-Heroes Book 2), author Peter Clines has given us something a bit different to sink our teeth into. The Junkie Quatrain is a collection of four interconnected short stories that look at a specific series of events from four very different perspectives. The stories are set six months after the initial outbreak of a new pandemic, one that just about anyone who has read a single zombie book will find very familiar. That's where the \"business as usual\" ends though. Clines has already developed a reputation for coming up with new ways to look at the zombie/post-apocalyptic genre, and The Junkie Quatrain is no exception.Zombie 411: The \"zombies\" in this collection technically aren't undead. The infected - or junkies - initially lose their inhibitions before gradually descending into stumbling, twitching cannibals before burning out or starving. I kept picturing the infected from 28 Days Later.The Junkie Quatrain plays out a lot like a movie. Not only does the pace, action and dialogue all seem ready for the big screen, but the change in perspective between each story makes me think of films that show you a scene from different camera angles and points of view. It's an interesting and effective twist on what was already a good setup and overall story.As usual, Clines delivers memorable characters, unique situations and plenty of well-choreographed action. I also like the idea presented in the introduction of re-reading the four stories in a totally different order to see if the feel of the story changes. My only gripe with the book is that it was over way too quickly. Hopefully Clines will revisit this world when he's done with the Ex series.If you're already a fan of Clines's books, The Junkie Quatrain will not disappoint. If you're a fan of zombie/post-apocalyptic books in general, I highly recommend giving this collection a try."}], "description": "Four short stories. Each one's a different type of post-apocalypse story. Survival horror. Ethical horror. Adventure horror. And one where the protagonist barely notices the apocalypse has happened. Each one stands alone and (hopefully) makes for a fun little read. But if you read two or three or all four, you'll see several events from different perspectives. And if you look close you'll even get a few scattered clues which might even come together to form a conspiracy.Ex-Patriots by Peter Clines contains the chapter, \"Codependent\"Acheron by Bryon Morrigon contains the chapter, \"Predator and Prey\"The Undead Situation by Eloise J. Knapp contains the chapter, \"Strictly Professional\"Hissers by Ryan Thomas contains the chapter, \"Confidentiality\"", "title": "The Junkie Quatrain", "url": "https://www.goodreads.com/book/show/12484914-the-junkie-quatrain", "average": 3.74, "cover": "https://images.gr-assets.com/books/1332646292l/12484914.jpg", "reviews": 131, "authors": [{"url": "https://www.goodreads.com/author/show/3396842.Peter_Clines", "name": "Peter Clines"}, {"url": "https://www.goodreads.com/author/show/2725838.Christian_Rummel", "name": "Christian Rummel"}, {"url": "https://www.goodreads.com/author/show/2964904.Th_r_se_Plummer", "name": "Thérèse Plummer"}], "type": ["Horror", "Horror", "Fiction", "Apocalyptic", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/12484914-the-junkie-quatrain", "http://www.goodreads.com/book/show/13639935-the-junkie-quatrain", "http://www.goodreads.com/book/show/15062217-14", "http://www.goodreads.com/book/show/23164927-the-fold", "http://www.goodreads.com/book/show/16479439-ex-heroes", "http://www.goodreads.com/book/show/17229633-ex-communication", "http://www.goodreads.com/book/show/17162429-ex-patriots"]}