{"ratings": 40657, "userreviews": [{"userName": "Tea Jovanović", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/3103000-tea-jovanovi", "userReview": "MUST READ autor i serijal... Svaki put se knjiga sa žaljenjem zatvara posle poslednje pročitane strane i nestrpljivo čeka juli sledeće godine da izađe novi nastavak... U Srbiji je prevodi sjajna Žermen Filipović dobar poznavalac Izraela... :)"}, {"userName": "Sarah", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/5151769-sarah", "userReview": "I read the 'Rembrandt Affair' a year ago and really enjoyed Gabriel Allon, the Israeli spy and assassin who just can't quit his job. I expect spies to have a lot of personal baggage - why else would they gravitate to a profession that requires isolation, deception, moral ambiguity and high ideals (whether it's for a country, a religious belief, or personal gain). He had a rich background and I slipped very easily into the story, enjoying every moment. And then I found out it was the eleventh in the series. It's a mark of a great series when a book stands on its own, acknolwedging that a lot of water is under the bridge but you neither feel left out or beat over the head with recaps from prior books (the Sookie Stackhouse novels are for people who enjoy that kind of pain).I felt compelled to go to the beginning, The Kill Artist, which is the first book in the series and where we first meet Gabriel Allon. And lo and behold, even then you understand that he's already had his share of life, and death. Silva kicks off the series with a fully-formed Allon, a spy who has already lived the enviable James Bond-style life, had a family and great success, but who has lost it all. For anyone who loves heavy doses of exotic locations and political intrigue mixed (sparingly) with pinches of real world leaders, this series is superb. Silva is extraordinarily knowledgable about world affairs and shares insightful commentary (through his characters), due to his journalism background (including CNN) and his stint as a correspondent in the Middle East during the Iran-Iraq war. I will admit that I didn't know of the Israeli-Palestinian conflict origins and (if it's accurately told) now I have a much better understanding - there are truly two sides to that conflict.I'm looking forward to reading books 2-9 and now number 12. I have many, many good hours of reading ahead of me."}, {"userName": "Maria João Fernandes", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/4635053-maria-jo-o-fernandes", "userReview": "\"Se estivermos a vigiar um alvo a partir de um café, não devemos fazer coisas que nos façam parecer estar a vigiar um alvo a partir do café, tais como ficarmos sentados sozinhos durante horas, a fingir estarmos a ler um jornal.\"Daniel Silva introduziu-me, da forma mais extraordinária, o mundo da espionagem. Pela primeira vez, este tema afigurou-se aos meus olhos, surpreendentemente sedutor, envolvente e enigmático. Cada vez que tive de interromper a leitura, para responder às minhas necessidades mais básicas como comer e dormir, enfim, questões de sobrevivência, senti-me como se nunca deixasse de fazer parte deste mundo imponente, repleto de vida. Durante a leitura fui mais que uma simples espectadora, sentindo verdadeiramente os medos e desejos do Gabriel Allon.Tudo começa em Paris. A cidade da Luz e do Amor é o palco da tragédia que põe em marcha o conjunto de eventos marcantes e vibrantes que caracterizam o enredo sem igual do \"O Artista da Morte\". Dois carros colidem. O trânsito pára. Um limusina é bloqueada. Um assassino cumpre, mais uma vez, o seu trabalho.\"Quanto mais longe estamos do nosso último desastre, mais perto estamos do próximo.\"De França aos Estados Unidos da América, de Inglaterra à Palestina e até mesmo Portugal, nunca antes nenhum autor me tinha levado numa viagem tão longa e maravilhosamente perturbante.Gabriel Allon tem um olhar intenso. Com 50 anos é um homem atraente, habilidoso, meticuloso, misterioso, gentil e piedoso. Este restaurador de arte judeu, que em tempos foi um agente secreto israelita, vê-se novamente de volta ao mundo de espionagem. O nosso protagonista faz parte de dois mundos que, apesar de tão diferentes, não podiam ser mais iguais. O espião domina a arte de matar e a arte de restaurar, destacando-se como um dos melhores do mundo. As suas acções são movidas por acontecimentos obscuros, pela dor da tragédia e o desejo de vingança. Atormentado por um passado distante, o espião é caracterizado por uma personalidade distinta. Interpreta diversos papéis durante as suas missões e, independentemente do contexto em que esteja inserido, representa cada personagem com a maior naturalidade. É um actor magistral, cujo palco é o mundo real. Os seus papéis nunca são demasiado pequenos, por muito escassas que sejam as falas ou o tempo que dedica à personificação. Gabriel Allon é sempre o protagonista.\"A vingança é boa. A vingança é saudável. A vingança é purificadora.\"Tariq é um palestiniano revoltado, com uma mente distorcida e um desejo de derramar sangue pelos que perdeu demasiado grande para ser ignorado. Este líder terrorista tem uma inteligência superior ao normal, afinal de contas domina a técnica da espionagem. Um adversário à altura de Gabriel Allon que não é um novo conhecimento, mas sim um inimigo há muito adquirido.Ari Shamram é, na opinião de todos com quem trava conhecimento, um homem careca, bastante feio, cujo casaco com um rasgão no peito direito suscita sempre alguma curiosidade. Este guerreiro da velha escola é chamado da reforma para se tornar no chefe do Departamento - da agência secreta israelita - de forma a restaurar a sua reputação manchada por missões falhadas. O seu método de trabalho baseia-se no seu eterno hábito de nunca deixar a mão esquerda saber o que a direita está a fazer. Shamram é o homem que nos apresenta o nosso herói, o qual só é capaz de fazer o seu trabalho com o auxilio de editoras, empresas de transporte, galerias de arte, farmácias e outros tantos negócios legais, que actuam e são conhecidos a nível mundial.Quando o Daniel Silva já tinha o controlo dos meus pensamentos e emoções, eis que me é apresentada Sarah, conhecida no mundo da moda como Jacqueline Delacroix. A agente de 33 anos é uma presença imprescindível para o enredo. Esta mulher bela e independente é uma poderosa presença feminina na vida de Gabriel Allon.Para além do astuto Shamram, do perverso Tariq, da lindíssima Sarah e do talentoso Gabriel Allon, Daniel Silva apresenta-nos muitas outras personagens que, apesar de não serem principais, representam um papel igualmente importante. O autor não deixa nenhuma delas para segundo plano. Muito pelo contrário, apresenta-nos cada uma delas com descrições pertinentes e detalhes sedutores. Desde uma drogada que trabalha num bordel a um rapaz de 12 anos chamado Peel, o leitor tem acesso à alma humana. As personagens são reais e as suas histórias de vida não podiam ser mais verdadeiras.\"Trabalho de espionagem é paciência. Trabalho de espionagem é tédio.\"O autor e antigo jornalista narra-nos uma história isenta de momentos enfadonhos, aliando, de uma forma perspicaz e estimulante, a ficção a factos históricos.A guerra secreta entre os serviços de espionagem israelitas e as guerrilhas palestinianas são introduzidos majestosamente: a luta dos judeus contra os terroristas que os querem ver mortos não podia ser retratada de uma forma mais convidativa e provocante. Com seriedade ou humor, detalhadamente ou superficialmente, de uma forma breve ou alongada, Daniel Silva tem o dom da escrita. O seu ritmo está em sintonia perfeita tanto com o leitor, como com o enredo.Nesta grandiosa luta entre os povos israelita e palestiniano, em que todos os meios justificam a salvação e defesa dos povos o desfecho é surpreendente. Gabriel Allon é um homem preso entre duas realidades, que ainda não encontrou a paz interior no seu mundo de várias camadas.\"O trabalho de um espião nunca está feito.\" Que venha o próximo livro."}, {"userName": "K", "userReviewDate": "Nov 06, 2012", "userURL": "http://www.goodreads.com/user/show/13779-k", "userReview": "Eh. Kind of an ordinary spy thriller, one I might have appreciated more had I read it 15-20 years ago when I was less jaded.Like many of this genre, you have a good (and troubled) guy who works for Israeli intelligence working with his stunningly beautiful and capable heroine with whom he has a complicated (of course) relationship. And of course, you have the bad guys who are always one step ahead of the good guys, but then the good guys catch up, but then the bad guys catch on, etc., etc. This book was surprisingly hard to get into for a book of its genre. The first section jumped rapidly between characters and settings, and you never really felt like you were getting to know anyone or like anything resembling a story had started. Once the story did start to move, I was a little put off by some of the cliches. I will say, though, that the book tried to take an evenhanded look at the situation in the Middle East and express the victimization claims on both sides. Although there were clear good guys and bad guys among the book's characters, the book did a good job of complicating that distinction when it came to history and politics.So in that sense the book was perhaps a cut above, but overall, nothing special as far as I was concerned. People do seem to like this series, though, so I'm open to the possibility that the books improve over subsequent volumes."}, {"userName": "Tim", "userReviewDate": "Oct 23, 2016", "userURL": "http://www.goodreads.com/user/show/17042835-tim", "userReview": "I've read more than half of the 14 in this series and decided to go to the beginning and get caught up in all. This first shows an insecure and hesitant Gabriel before his maturation into a confident, and self-assured hero of Isreal and that's the Gabriel I prefer. 5 of 10 stars"}, {"userName": "Shuk Pakhi", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/44196647-shuk-pakhi", "userReview": "যারা স্পাই থৃলার পছন্দ করেন বা এককালে মাসুদ রানার ভক্ত ছিলেন গ্যাব্রিয়েল আলোন সিরিজ তাদের জন্য অবশ্যপাঠ্য।মাস্টার মাইন্ড আরি শ্যামরোন পুরাই লা-জওয়াব।গ্যাব্রিয়েলের প্রেমে হাবুডুবু না খেয়ে উপায় নাই আপনি যতই সাঁতার জানা লোক হোন না কেন। :)"}, {"userName": "Jane Stewart", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "Felt like things had been done before. Nothing grabbed me.The story was ok but several minor things bothered me, so I’ll list them below.When I finished this I thought huh, the hero didn’t do anything heroic and he did not solve the bad guy problem. The good action was done by another. Ok, but that kind of let me down - not much hero development here.Throughout the book the good guys were not doing smart things which made it less fun to root for them. In a few scenes the bad guys came out ahead due to luck. For example: the bad guy dresses as a waiter to get into a meeting of dignitaries. The front door guard let him in even though his name was not on the list - because the bad guy said they told me they needed extra staff. A guard let him into a private room because the bad guy said one of the top aids told me to bring this food. When the bad guy was in the kitchen, the boss of the waiters gave him work to do. The boss should have known who his employees were. He paid them. The boss did not even ask where he came from. This was too easy - using luck. I was disappointed the following was not shown. A woman was being trained as an agent. She was told to figure out who was following her. She reported three people and was wrong. Next time she reported three people and was right. I wanted to see what she saw and why she concluded what she did.Because a woman loved Gabriel she did amazing things for him. I wanted to see him reciprocate some kind of feeling for her, but he showed no feelings. That was a let down. It made him less sympathetic.Something unexpected was revealed at the end. It was quickly told. It was a neat surprise. The details behind that could have been a good story. Not required but I wanted to know more.I did not care for the narrator George Guidall. He made Gabriel the hero sound like a clerk or librarian. It didn’t fit the sexy macho agent. And he made the bad guy sound wimpy. Other parts were ok, but overall his voice was not as good for me as other narrators.DATA:Narrative mode: 3rd person. Unabridged audiobook length: 11 hrs and 34 mins. Swearing language: strong but rarely used. Sexual language: moderate. Number of sex scenes: 9 briefly and vaguely described, not much detail. Setting: around 2000 various places including England, Europe, Mid East, Canada, and U.S. Book copyright: 2000. Genre: spy suspense thriller."}, {"userName": "Lisa (Harmonybites)", "userReviewDate": "Nov 05, 2011", "userURL": "http://www.goodreads.com/user/show/2596042-lisa-harmonybites", "userReview": "I think what may have killed this book for me was I read this just after reading John Le Carre's The Spy Who Came in from the Cold--and after having recently read Alan Furst and Eric Ambler while working through a recommendation list that included Silva among this number. I got spoiled and after reading the best in the espionage genre this struck me as nothing more than a generic pulp thriller with all the writing skill, complexity of characterization and plotting of a blow'm up rat-tat-tat of a popcorn chomping action adventure flick.It doesn't help that in the first hundred or so pages Silva rotates the points of views so quickly. I didn't get invested enough in any character early on to really get hooked. This is supposedly the first in a series of novels about Gabriel Allon, an Israeli agent fighting terrorists. We're introduced to him only as \"the restorer\" and then as \"the stranger\" and it's quite a while before he's linked to Gabriel Allon who seems less a starring player as just one in an ensemble cast. His opponent \"Tariq\" is the usual cut-out cardboard Muslim terrorist--as quick to execute a lover or someone on his own side as the enemy and without remorse. The style is decent enough, but nothing in the novel raised this to anything memorable among the many \"dicklit\" thrillers that spend some time in the bestseller list."}, {"userName": "Karl Marberger", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/58621278-karl-marberger", "userReview": "I’ve heard good things about this series, and I was not disappointed. Very enjoyable. Lots of action and twists. I’m glad I starts this series."}, {"userName": "Gary", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/15055195-gary", "userReview": "I enjoyed this book so much I now intend to read the rest of the series. Not really sure how I came across this author but I am so glad I did. The story is exciting, fast paced and informative. The characters are well developed and you can easily picture them in your mind which makes the read easier and more enjoyable. The subject matter is not entirely my genre and not an obvious choice for me but I quickly got into it and read it over two days."}, {"userName": "Stephen", "userReviewDate": "Aug 05, 2009", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "3.0 stars. A good, solid international thriller centering on Israeli operative/art restorer Gabriel Allon attempting to track down a Palestinian terrorist. This is the first of the Gabriel Allon books and I thought he was an interesting character and will certainly read the next book in the series."}, {"userName": "Tim The Enchanter", "userReviewDate": "Oct 19, 2013", "userURL": "http://www.goodreads.com/user/show/5654692-tim-the-enchanter", "userReview": "An Average Read Until the End This marks the first book I have read by Daniel Silva. The Kill Artist, the first in the Gabriel Allon Series was first published in 2000 and it is starting to feel its age. The story resolves around Israeli and Palestinian conflict. There is a cast of a \"villain\" and an \"anti-hero\" and retaliation is the word of the day. The plot feels tired. Granted, had I read it first in 2000, I may have not felt this way.As in many books that are the first in a series, the story starts of slowly as we are introduced to the characters. Despite my issues with a tired plotline, the characters are interesting. Our \"hero\" is a former Israeli intelligence officer who has retired and is working as a reclusive, world class art restorer. He finds himself (surprise, surprise) drawn back into action for the protection of Israel. He is an interesting and nuanced character.His sidekick / love interest/ former love interest / partner is an aging (ok. she is 33 but she says that she is old for her job) world class fashion model. She has also worked an Israeli agent using her \"assets\" to get information or put foreign diplomats in compromising positions.I was rather bored of the book by the halfway point. I only continued to read because the author has been highly recommended by multiple sources. The action picks up halfway through and zips on to a high finish leading a final  3.5  star rating. I plan on reading the next in the series."}, {"userName": "Elisha Condie", "userReviewDate": "Aug 30, 2012", "userURL": "http://www.goodreads.com/user/show/1278237-elisha-condie", "userReview": "I’m always surprised when a premise of a book sounds so good – a perfect swish, and then the book itself is like a big old airball. Meet Gabriel Allon: super spy, art restorerer, tortured soul, handsome, ruthless, boring. \tDaniel Silva’s book sounds great! A spy who restores masterpieces, who is out for revenge for his murdered family but doesn’t really like to kill people. He’s recruited from retirement by a ruthless Israeli agent who wants to stop an equally ruthless Palestinian terrorist. Ruthless is the key word here – everyone is ruthless. It’s like a drinking game. The characters are flat, and there isn’t anyone you can really feel emotionally invested in. And I’ve said this before, but give me a villain I want to defeat soundly. The terrorists and agents in this story just depressed me. I didn’t get the sense anyone was better off, or anything was much accomplished here – all the work and killing people just adds fuel to the fire of this conflict. I can’t get behind that. And knowing Gabriel is just going to get pulled out of retirement again to fight some more of the same old baddies was just anti-climactic. This book was a page turner, for sure. But Gabriel Allon has no style. Dear Agent Allon, please see some James Bond movies and get back to me."}, {"userName": "Brian", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/51395417-brian", "userReview": "“The Kill Artist” is the first book out of 17 (as of today) that follows the exploits of Israeli agent Gabriel Allon. I had previously read the 16th book in the series, “The Black Widow”, and enjoyed it very much. So much so that I went back to the beginning of the series. I am glad that I did not begin at the beginning.This novel is okay, not great. Unlike my previous experience while reading a book of Mr. Silva’s I found I could easily put it down. That is not to say that I did not enjoy reading it, I did. Just that the experience was nothing spectacular.Mr. Silva is adept at not being needlessly one sided in this novel. There are clear good and bad guys, but he does give voice to the grievances that the Palestinian terrorists make. This was an interesting choice, as it does force the reader to realize that although one side may be a bit more moral than the other, there are still legitimate grievances on both sides of the issue.“The Kill Artist” suffered from some “too cute” plot devices and some too easily wrapped up plot points, and from a ridiculous scene with Yasir Arafat and the main bad guy in the text, a terrorist named Tariq. But overall it is an okay novel. I will read the second book in the series in the hopes that the texts get better each time."}, {"userName": "Eric_W", "userReviewDate": "Jan 04, 2009", "userURL": "http://www.goodreads.com/user/show/1711431-eric-w", "userReview": "The methodology of the art restoration expert is the same as that of the professional assassin: “study the target, become like him, do the job, slip away without a trace.” Just as retired Israeli agent Gabriel Allon must study the artist Vecellio in order to resurrect and restore The Adoration of the Shepherd, to make the painting just like the original so he must study again the work of his old nemesis Tariq, agent of the PLO wing that is angry and upset with Arafat’s peace initiatives. Tariq is also responsible for the death of Gabriel's wife and child, so Ari Shamron tries to induce Gabriel out of retirement to track down and kill Tariq after Tariq’s organization has assassinated the Israeli ambassador in Paris. In these days after the end of the Cold War, writers of spy thrillers have been left with few international conflicts and adversaries with which to ground their novels. Silva has become one of the more successful, and this one is a real pageturner. Tariq learns from an inside source that Gabriel is after him, so it becomes a cat-andmouse game to see who can find and eliminate the other first."}, {"userName": "Ana", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/31608297-ana", "userReview": "\"Passou os últimos anos da vida consertando tudo e todos menos a você mesmo. Restaura quadros e veleiros velhos. Restaurou o Escritório...\" pág. 386Triste destino de Gabriel Allon, restaurador de profissão e assassino nas horas vagas ou assassino de profissão e restaurador nas horas vagas :)Gabriel Allon (personagem que veremos noutros livros do autor) é um ex-agente secreto das forças israelitas que vive quase isolado dedicando-se à restauração de valiosos quadros antigos, mas de tempos a tempos é forçado a abandonar o sossego em que vive para voltar ao activo."}, {"userName": "Ingrid", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/6181069-ingrid", "userReview": "3,5 stars It was a nice read, good start of a series, but there's room for improvement."}, {"userName": "Arttemizza", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/7462102-arttemizza", "userReview": "As personagens? Gabriel Allon é a personagem principal deste livro e dos restantes da serie. Antes de se dedicar exclusivamente ao restauro de quadros, foi um agente secreto israelita e responsável por vários assassinatos, tendo sido considerado um dos melhores agentes do seu tempo de actividade. É um homem justo, perspicaz mas de certo modo ainda atormentado pelo seu passado e de um momento para o outro vê-se de novo no activo.O enredo? Inicialmente tive bastante dificuldade com o avançar da acção, senti-me bastante perdida, são muitas personagens para um desenrolar lento da acção.O tema central é o conflito no Médio Oriente, mais especificamente o conflito entre Israel e a Palestina. O escritor parece ter bastante conhecimento sobre este assunto e com isso consegue transmitir na perfeição os esquemas das montagens das operações secretas da Mossad. Os cenários de acção são diversos e desenrolam-se em grandes metrópoles.A escrita? É simples e persuasiva, permitindo uma leitura rápida. Os capítulos são pequenos e permitem uma acção constante.Conclusão? Não foi uma leitura que me atraísse muito mas fiquei com curiosidade para ler os próximos, especialmente para ver o evoluir da personagem principal. Curiosidades? O livro tem uma cena que se desenrola na nossa capital, em que o Bairro Alto é comparado a Beirute nos velhos tempos."}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Nov 06, 2011", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "This is the 1st book in the Gabriel Allon series by Daniel Silva.Gabriel Allon, former Israeli super spy/agent is now a restorer of old art masterpieces, living an isolated life in a remote English seaside village. Persuaded out of retirement by his former boss, Ari Shamron to track down the deadly Palestinian assassin, threatening to derail the peace talks between the Israeli Prime Minister and Arafat after assassinating the Israeli Ambassador in Paris, and who is also responsible for his wife and son’s death.A complex, dizzying, gripping, intriguing, compelling and well-paced story, using the Palestinian-Israeli conflict as a backdrop.Great character development, filled with some fascinating characters (some real) that I look forward to seeing in the next books."}, {"userName": "Helen", "userReviewDate": "Sep 24, 2007", "userURL": "http://www.goodreads.com/user/show/69458-helen", "userReview": "Gabriel Allon is an art restorer brought back from retirement to be a secret agent for Ari Shamron and to restore The Office by capturing Tariq. Gabriel agrees because he is seeking revenge on Tariq. Severla years beofre, Tariq planted a bomb in the car which Gabriel's wife and son were in thereby killing his young son and physicaly and mentally scarring his wife. Tariq is part of a terrorist network who is planning to kill the Palestinian prime minister and disrupt the Isreali/Palestinian peace process. A beautiful French model assists Gabriel as an under-cover agent. If you like art and a good spy story, you'll love this book."}, {"userName": "ChopinFC", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/51633786-chopinfc", "userReview": "Strong introduction to the series, specially setting up the background of Gabriel Allon. As the book progressed, however, I found the set up with Allon as 'surveillance' detail, felt sluggish and bored me. I was expecting a Mitch Rapp or Jason Bourne, but instead got neither. There are still over 10 Gabriel Allon books, I'll give Mr Silva another chance simply for his unique and engaging writing style. 3stars."}, {"userName": "Scott Rhee", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/5717792-scott-rhee", "userReview": "“The Kill Artist” is the first novel in the popular Daniel Silva series to feature his Israeli spy/art restorer extraordinaire, Gabriel Allon. In this novel, readers are given a glimpse at the tragic backstory of Allon---his son was killed in a car bomb explosion meant for him, while his wife survived only to live in a vegetative coma-like state---and introduced to Allon’s arch-nemesis, a Palestinian terrorist named Tariq.Among the other important characters are: ***Jacqueline Delacroix, a beautiful French supermodel who is also an Israeli spy. She uses her seductive charms and feminine wiles to help lure suspected or known terrorists into compromising positions for intel-gathering. During her last mission with Gabriel, the two became more intimate than their cover-identities required. Shortly after, Tariq’s car-bomb killed Allon’s son and left his wife a vegetable. She is conflicted: while she has tremendous guilt about what happened during the last mission, she can’t help but still be in love with Allon.***Julian Isherwood, a British art dealer who has no illusions about the fact that he is getting older and the business is not as lucrative as it once was when he was younger. Allon is his most sought-after restorer, but he also knows that Allon’s other life as a spy may drag him away from his studio work and thus ruin Isherwood.***Ari Shamron, a Mossad spymaster, recruited and trained Allon, his best agent. Allon is also his most troubled agent, for reasons that go beyond the fateful day involving Allon’s wife and son. Shamron and Allon are as different as night and day: Allon loathes violence, while Shamron revels in it; Allon does not believe that everything that the Israeli government has done is for the best, while Shamron can not believe otherwise; Allon believes that revenge leads to spiritual death, while Shamron believes that revenge is a biblical necessity. Strangely, though, they make a superior team.The plot: When the Israeli ambassador to France is killed during a terrorist attack, Shamron clearly sees the calling card of the terrorist known as Tariq. He coaxes Allon back into the field with the promise of closure. Then, Shamron recruits Jacqueline to work with Allon. Sparks fly. Some of them are romantic ones.There is, as is to be expected from Silva, suspense and action galore in “The Kill Artist”, but along with all of that is an even stronger thread of human drama. Silva creates believable, likable characters, and even his villains are sympathetic to an extent. They may do monstrous things, but they never come across as completely monstrous. They are simply broken people with irrational feelings of hatred and revenge."}, {"userName": "Ed", "userReviewDate": "Apr 06, 2011", "userURL": "http://www.goodreads.com/user/show/1090620-ed", "userReview": "As the first book in the series, this effort does not measure up to later stories. This is understandable because Silva had to cover a lot of ground in order to set the series on its way. The later books in the series keep getting better and better.Gabriel Allon, the protagonist, is an art restorer, who at one time worked for a secret Israeli intelligence agency. He, in fact, was one of the assassins, Golda Meir dispatched to take revenge for the Munich Olympics massacre of Israeli athletes. Allon still has nightmares and regrets for what he did and has escaped into his art restoring career. Ari Shamron, his ex-boss and an obsessive protector of everything Israeli lures him back into the game by assigning him to stop a Palestinian zealot, Tariq, who is on one last mission. Allon cannot refuse because Tariq is responsible for killing his son and injuring his wife beyond repair. He is teamed with Jacqueline Delacroix a French fashion model who is also Jewish and has a history with Allon. The plot continues from there.In order to keep the plot moving, the characters are not as full as they become in later books. Silva, though, does a good job of presenting the Israeli-Palestinian conflict as a basis for understanding Tariq's motivation. The plot has many twists in it to hold the reader's attention. There are times when it is not at all clear who is pursuing whom. Morality becomes a casualty, especially, when Shamron is involved, to say nothing of Tariq.I'm glad I had read subsequent books so that the faults of this first effort has not and will not keep me from reading every book in the series."}, {"userName": "Alan", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/2497528-alan", "userReview": "Sometimes I think I am so disconnected from my peers (i.e. other readers). I like spy movies, and have enjoyed some thriller/spy novels. So why does the first Gabriel Allon novel fall so short for me and not everyone else?For myself I know the answer. Two-dimensional characters at best, and with 420+ pages Silva should have done more than just do the small character development bits that he did. Yes, I get it that Gabriel is damaged for many reasons, but really none of them are explored. Especially the early depiction of a happy married life that was far from it (inferred from one sentence). It is obvious that Ari is an ass and Juliette loves Gabriel. We get it, because of the hammer over the head approach used to make these points.So art restorer Gabriel is lured back to Israel's intelligence service to track down and kill a terrorist. Yes, this is a very basic plot, but with good action, good character development, or good examples of trade craft this could be a good book. There is some of all three but too little of any and all to make me buy this book (it was borrowed from the library).Go watch USA network's Burn Notice and you'll get the same amount of trade craft or more. And, especially in the current season of Burn Notice you'll get a better example of the psychological damage this type of work does to an operative (as does Greg Rucka's Queen and Country books)."}, {"userName": "Filipe Miguel", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/5855795-filipe-miguel", "userReview": "Cometi o \"erro\" de começar a ler Daniel Silva pelo fim: \"Regras de Moscovo\" e a sua sequela: \"O Desertor\".Só depois resolvi comprar os restantes livros da saga Allon para ler pela ordem correcta.Em comparação, e tendo lido duas das suas últimas obras e a primeira, considero o \"Artista da Morte\" bem menos conseguido.Presumo que a introdução a esta nova personagem - Gabriel Allon -, tenha levado Silva a tentar uma abrangência de temas que, no final, não cobriu como desejaria (conflito israelo-palestiniano, serviços secretos, passado de Allon, arte, religião).Apesar de não serem obras-primas, os últimos dois livros concentram-se em menos tópicos e aprofundam-nos, enquanto que no primeiro, são apenas alvo de uma passagem rápida.Seja como for, gostei bastante do \"Artista da Morte\", mas admito que ter lido primeiro os últimos possa ter dado algum crédito a Silva e ter-me levado a encarar esta introdução de forma diferente daquela que fará qualquer leitor que entre no \"novo\" mundo de Daniel Silva pelo... inicio.Ainda assim, não haja dúvidas (pelo menos para mim), a saga \"Gabriel Allon\", tal como a de \"Robert Langdon\" (Dan Brown), é uma \"cereja\". Raramente é excepcionalmente doce, mas é agradável o suficiente para comermos sempre mais.Umas vezes temos a surpresa de encontrar uma mais açucarada, outras vezes apanhamos uma mais sensaborona, mas não deixamos de a comer com razoável prazer.Rating: 3.0/5.0"}, {"userName": "Andrea", "userReviewDate": "Apr 03, 2009", "userURL": "http://www.goodreads.com/user/show/2029713-andrea", "userReview": "I came to this book after reading the later story Moscow Rules, which may have been a mistake because the later story is much more gripping than the first. On the other hand, had I read this one first, I might not have found it compelling enough to get me to read on in the series. Silva's first Gabriel Allon book is enjoyable, but it is not a gripping page-turner. Some have compared Silva to John LeCarre. I think that's overstating the case. Silva is, at this point at least, a good, entertaining writer, but not one who has redefined the genre or set new levels of excellence in writing. I will continue to read the Allon books in order and, based on what I found in Moscow Rules, I do expect the quality to improve."}, {"userName": "Maria Carmo", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/3054983-maria-carmo", "userReview": "A relentless thriller that makes one hold one's breath... A lesson to be taken into account: once in never out... Gabriel Allon tried to break free from his previous life as a member of Mossad - being an exquisite artist of restoration of ancient paintings, he becomes one of very few who really can be trusted to bring back all the beauty and splendor of an old painting of a great master... But, his old boss Shamron has different ideas and whenever he needs Gabriel, his now quiet life in Cornwall is perturbed...This is just the first of a series that I intend to read! Maria Carmo,Lisbon 30 August 2016"}, {"userName": "Gwen (The Gwendolyn Reading Method)", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/2250598-gwen-the-gwendolyn-reading-method", "userReview": "[ One of my major issues with books like this is the fact that to have a new girl every book, it requires finding ways to get rid of the girls without the hero looking like a bad guy. In this case, she's like, don't feel bad, I got almost everything I wanted and someone else was like, Gabriel, you saved her. Which can't be met literally because she saved herself and then also saved him, he never saves her. And if it's meant in the spiritual sense. HOW???? Everything she went through because he didn't listen to her when she was like, no, this is a bad idea. Everything she went through really suggests a lifetime of therapy afterward. Her life is F'ed, she has no career, she's gonna have sexual PTSD and good old regular PTSD, and through all that he ignored her the entire time, and somehow the author twists that into HER being grateful to him in the end. Convenient for justifying a new girl in every book, but really teeth-gnashingly annoying when it comes to psychological likelihood.  (hide spoiler)]"}, {"userName": "Barbara (The Bibliophage)", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/3932962-barbara-the-bibliophage", "userReview": "Daniel Silva’s gripping thriller, The Kill Artist, is exactly what I want from this type of book. Silva takes multiple perspective and locations, and weaves them together into a story I couldn’t put down. I listened to the last 90 minutes of the audio very late at night, because I had to know the final twists before sleeping. Full review at TheBibliophage.com."}, {"userName": "Blaine DeSantis", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/2994598-blaine-desantis", "userReview": "My first ever read of a Daniel Silva book and I want some more. I found this a very good action/adventure book dealing with terrorists, counter-terrorists and the protagonist is an art restoration expert. The book is a bit dated since it was written a while back but the saga is quite engaging and moves us around the world quite deftly as a Palestinian terrorist tries to complete a mission and Israeli counter-terrorist Gabriel Allon tries to prevent it from happening. The books plot is driven by dialogue and we also get some background into this never ending cycle of hatred in the Middle East. Fast paced and action packed, the author reminds me of Steve Berry, James Rollins and Clive Cussler style of writing. Glad I finally took a gander at Silva, I have a feeling that quite a few more will pop up on my shelves in 2018!"}], "description": "Gabriel Allon had a simple but brutal job: he tracked down and eliminated Israel's terrorist enemies. But when his wife and son fell victim to the danger that accompanied him everywhere, Gabriel quit and devoted himself to the work of art restoration, an occupation that had previously been a cover for his secret assignments. Now Ari Shamron, the head of Israeli intelligence, needs Gabriel's particular kind of experience to thwart a Palestinian plot to destroy the peace negotiations in the Middle East. The architect of this plot, a Palestinian zealot named Tariq, is a lethal part of Gabriel's past, so as the two begin an intercontinental game of hide-and-seek, with life and death as the prizes, the motives are as personal as they are political.The story features a vivid and fascinating supporting cast, including the magus-like Ari Shamron, a beautiful French Jewish model who is seeking retribution for her family's death in the Holocaust, and a marvelously comic down-at-the-heels London art dealer. Set these colorful and varied characters against a brilliant background of political intrigue and vengeance at the highest levels and a manhunt that covers three continents, and the result is a smart and electrically exciting global thriller.", "title": "The Kill Artist\n      \n          (Gabriel Allon #1)", "url": "http://www.goodreads.com/book/show/93794.The_Kill_Artist", "average": 4.0, "cover": "https://images.gr-assets.com/books/1391616227l/93794.jpg", "reviews": 1679, "authors": [{"url": "https://www.goodreads.com/author/show/29085.Daniel_Silva", "name": "Daniel Silva"}], "type": ["Thriller", "Fiction", "Mystery", "Spy Thriller", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/93794.The_Kill_Artist", "http://www.goodreads.com/book/show/6339089-o-artista-da-morte", "http://www.goodreads.com/book/show/17973399-the-kill-artist", "http://www.goodreads.com/book/show/6523223-the-kill-artist", "http://www.goodreads.com/book/show/27997594-o-artista-da-morte", "http://www.goodreads.com/book/show/533962.The_Kill_Artist", "http://www.goodreads.com/book/show/1012409.The_Kill_Artist", "http://www.goodreads.com/book/show/15736269-o-artista-da-morte", "http://www.goodreads.com/book/show/7096123-the-rembrandt-affair", "http://www.goodreads.com/book/show/5739373-the-defector", "http://www.goodreads.com/book/show/9975779-portrait-of-a-spy", "http://www.goodreads.com/book/show/93795.The_English_Assassin", "http://www.goodreads.com/book/show/93793.The_Messenger"]}