{"ratings": 54576, "userreviews": [{"userName": "Holly", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/2127955-holly", "userReview": "Holy. Effing. Shit. Now THIS was a damn great book. Everything I hoped both Gone Girl and The Girl On The Train would be...but weren't."}, {"userName": "Diane", "userReviewDate": "Dec 21, 2014", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "This book should be getting more attention. The Kind Worth Killing is a smart, well-crafted psychological thriller. Fans of Gone Girl and The Girl on the Train should be all over this novel (but I thought Kind/Killing was much better than the bestselling-but-forgettable Girl/Train).The story opens with a man and woman, Ted and Lily, chatting in an airport lounge. Ted is upset because he recently found out his wife, Miranda, is cheating on him. Lily encourages him to talk, and says she'll help him kill his wife. Ted agrees, in part because he's attracted to Lily. The chapters alternate in their points of view, so we see the story unfold from both Ted and Lily's perspective.The plot starts out simple, but things quickly get more complicated. (Murder is hard, you guys!) There are several juicy turns, but I am being vague on details so I don't spoil anything for my fellow readers.The alternating-chapters technique has been crazy popular in recent years, and it works well in this book. I especially enjoyed Lily's story. It turns out she has some experience with making people disappear, but she always has a good reason: \"Truthfully, I don't think murder is necessarily as bad as people make it out to be. Everyone dies. What difference does it make if a few bad apples get pushed along a little sooner than God intended? And your wife, for example, seems like the kind worth killing.\"BOOM! We have a title.I was so absorbed in this book that I stayed up late to read it, then I got up early, and then I considered calling in sick just so I could see how it ended. I liked all the twists in the plot, and hope Peter Swanson will craft more good thrillers.Meanwhile, I'm going to be careful who I talk to in airport lounges.Favorite Sociopathic Quote\"We understood that survival was everything. It was the meaning of life. And to take another life was, in many ways, the greatest expression of what it meant to be alive.\""}, {"userName": "Jeffrey Keeten", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”Truthfully, I don’t think murder is necessarily as bad as people make it out to be. Everyone dies. What difference does it make if a few bad apples get pushed along a little sooner than God intended? And your wife, for example, seems like the kind worth killing.”We are brought up to believe that murdering someone is the worst thing we could ever do, but is it? If a person is leaving a wide wake of broken hearts and battered spirits and in some cases much, much worse, is it really the worst thing we can do for all of humanity to give that person a nudge towards the afterlife? Of course the question remains, are any of us capable by ourselves of being the defense, the jury, the prosecution, and ultimately the judge? When Ted Severson sees Brad Daggett, a man he has been paying an abundant amount of money to build his dream house, bend his wife, Miranda, over a table and have consensual sex with her, it sets off a string of events that...leads...to...murder. At the very least Brad should have offered Ted a discount. Okay, so the guy is banging your wife. She signed a prenup. That silly bitch isn’t getting one more thin dime out of you. You just need to go get drunk, maybe call up an old flame and have some unsatisfactory revenge sex, and call your lawyer in the morning. Not Ted. He can drink like a fish, martinis in fact, line them up from here---------------to here, but mostly he just simmers on what he saw. He even tries to convince himself that what he saw wasn’t exactly what he saw. Brad was just trying to...nope... not even after six martinis can he convince himself that Brad was doing anything, but SHAGGING his wife. Ted wasn’t sure what he was going to do until on a plane flight home he met The Lily Kintner. Maybe it is because she is beautiful and receptive to him, or maybe it is just because he has to tell someone and usually a stranger is much easier to spill your guts to than a friend. She doesn’t react the way he expects. In fact, she tells him that his wife sounds like  the kind worth killing.You’d never know to look at her, but Lily is an unusual young woman. She is a woman who doesn’t believe in letting people get away with things like infidelity or lying. She doesn’t believe in turning the other cheek or forgiveness. She realizes there is something missing in her, something different. Her father is a reasonably famous author, and her mother an academic. Their household was a free-for-all of revolving parties with artists, writers, friends, and lovers of both her parents coming and going throughout her whole childhood. She was mostly left to her own devices, and when one young man took an interest in the thirteen year old with the flaming red hair and the long thin legs,...well...he annoyed her. ”I’d been waiting for two things since killing Chet. Waiting to get caught and waiting to feel bad. Neither had happened yet, and I knew that neither would.”Now, it may seem like she is just a random stranger with a morbid sense of morality, but as the plot thickens we discover why Lily has taken an interest in Ted’s shattered marriage. The chapters alternate between characters. We are allowed to see things from their perspectives and what is missing in one chapter can be revealed in the next. It all begins to really heat up when police officer Henry Kimball can’t let go of a hunch and begins to follow Lily. He adores her father’s writing, and after interviewing her a couple of times he is half in love with her, but dribs and drabs of loose ends from their conversations continue to nag at his consciousness. 2+2=3.75There is a funny scene that I have to share that made me laugh because it reminded me of myself. Lily’s father has very distinct views of the ocean. ”He said it was like looking at death…. I love the beach, everything except the fucking sand, the fucking sun, and the fucking water.” Okay, it made me chuckle again writing it because it is so sacrosanct for anyone to ever say anything remotely negative about the ocean because everyone is so IN LOVE with water. I enjoy looking at the water. I can understand the attraction, but for me it is something to look at briefly and then move on to something more interesting. I have never really trusted large bodies of water. I wouldn’t say I’m suffering from Thalassophobia, but certainly I don’t feel the need to join the masses in venerating the ocean. I prefer solid terra firma under my feet... all the time... besides the water is such a slurry sludge pit of god knows what. Killers become victims...victims become killers. Yet again Peter Swanson has delivered a neo-noir thriller that reminds me of some of the best of James Cain. There are twists and turns enough to leave your legs corkscrewed together by the time you reach the final page. I also enjoyed his first book. The Girl with a Clock for a Heart ReviewIf you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at: https://www.facebook.com/JeffreyKeeten"}, {"userName": "Mischenko", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/1194517-mischenko", "userReview": "This book is featured on this week's Throwback Thursday @ https://readrantrockandroll.com/2017/...The Kind Worth Killing by Peter Swanson is a psychological thriller that will have you guessing until the end! Just who are the kind worth killing?If you haven't read this book, I recommend skipping my review and the blurb. There aren't any big spoilers here, but going in blind is probably the best...The story starts out with Lily and Ted. The two strangers come together for a game of truth which turns into a plan for murder. Lily has a history and Ted has issues with his wife. Lily jumps in the driver's seat and one thing leads to another. The two strangers plan an arrangement to wreak havoc, but what will be the outcome? Of course, I went into this blind and had no clue what I was getting into which is what I recommend to others. EVERYTHING you think you've figured out, you haven't. \nThere are some major twists and turns which kept my interest from the beginning to end. The story fully grasped me and didn't let me go. The absolute only issue I had was the ending which I both loved and hated. Give me MORE! This is one of the best psychological thrillers I've read. I picked it up on audible and enjoyed all four narrators. I'd like to thank my friend Basia for recommending it! 5*****"}, {"userName": "Carol", "userReviewDate": "Mar 04, 2015", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "HA.....WHAT AN ENDING! (smile)Murder here.....Murder there.....Murder everywhere in this page-turning mystery-thriller! I was surprised more than once, thoroughly entertained from beginning to end, and even found myself rooting for the devious and dangerous little psycho killer.....well, most of the time.Great Read!"}, {"userName": "Jennifer Masterson", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/28953843-jennifer-masterson", "userReview": "This book was a lot of fun. 4.5 Stars. If you like psychological thrillers definitely give this one a try. The first twist totally threw me for a loop. I'm surprised The Girl on the Train was hyped more than this book was. I found a The Kind Worth Killing to be much better."}, {"userName": "Carol (Bookaria)", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/1880531-carol-bookaria", "userReview": "I don't know how I missed this novel when it came out but I'm glad I finally read it. It was an excellent thriller!Ted and Lily met on a flight back to the States. He shares that he recently found out his wife is cheating on him with his contractor. Ted is rich and Miranda a young and beautiful woman. In his devastation he tells Lily (jokingly) that he would kill his wife for her cheating and is surprised when Lily agrees and supports this decision. From then on the story turns darker and what follows it's a thrilling novel.The book is narrated from alternating points of view and takes place mostly around the Boston area.  I found it to be completely captivating and chilling.Overall, I loved it and recommend it to readers of thrillers and contemporary fiction."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/Hey guys, I just read the next Gone Girl!!!! Nah, just kidding. This one was actually a retelling of an oldie . . . \nwhich I didn’t even realize was a book. Some booknerd I am, huh? Anywho, to me there is no greater timesuck than a Hitchcock movie marathon and Strangers on a Train is one of my all-time faves.At the airport bar before a trans-Atlantic flight, Ted meets Lily. After having one too many cocktails, Ted starts dropping truthbombs about his gold-digger of a wife who has been spending her time boffing the contractor who is building their new McMansion. Lily offers Ted a sympathetic ear followed by a solution to Ted’s problems – kill the wife . . . \n“I don’t think murder is necessarily as bad as people make it out to be. Everyone dies. What difference does it make if a few bad apples get pushed along a little sooner than God intended? And your wife, for example, seems like the kind worth killing.”\nPlans change, however, when . . . .\nhappen. Good news is, my lack of enjoyment of The Kind Worth Killing was probably more my fault than the book’s. It has received high marks and great praise from nearly all of my friends here on Goodreads (Snotchocheez, I stand with you in solidarity!!!). I also found this story to be WAAAAAY more unpredictable than the overhyped The Girl on the Train. That being said, I still didn’t love it.Being a fan of the Hitchcock classic, I got sucked in right away to the idea of this story and anxiously awaited some of this . . . \nUnfortunately, the action got bogged down with a lot of this . . . \nSeriously. So much driving! Notating the various landmarks passed. More driving. Driving there. Driving back. Driving, driving, driving! Think I’m kidding???? \n“From Storrow Drive I got onto Soldiers Field Road, then wound may way through Waltham and Newton till I found Boston Post Road, and headed west through the suburbs toward Winslow.”\n\nRight when I was getting ready to scream out of frustration . . . \nGetting me all excited once again. Sadly it wasn’t for long due to the format of the second half of the book . . . \nYep. Just when I got my hopes up the writing style changed and began detailing a scene from one narrator’s perspective, then rewinding it and re-telling it from another narrator’s perspective (and often times rewinding it yet again to tell it from one more person’s point of view). #snoreBut like I said, everyone else seems to really love it so I probably just read it wrong : )"}, {"userName": "Skyler Autumn", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/12859342-skyler-autumn", "userReview": "5 Stars I would describe The Kind Worth Killing as a cluster fuck of mayhem that I absolutely loved. Peter Swanson takes us on a twisty turn-y action packed thriller that begins with a simple conversation between two strangers at an airport bar. After wealthy, and when I say wealthy I mean absurdly filthy stinking rich, Ted Severson confesses after one too many martinis to a beautiful mystery woman on the bar stool beside him that he caught his wife cheating on him, quickly following with a flippant remark that he wished his wife dead. Ted was surprised that not only did the lovely mystery woman named Lily Kinter, not flinch away with distain but heartedly agreed that he should kill his wife. After all some people are \n the kind worth killing \n. Ted both drunk and a little infatuated with the beguiling Lily soon finds himself in a surreal conversation with this strange woman plotting the murder of his wife. After all she clearly was only using him for his money, he had given her everything his love, time, attention and she had betrayed him and then lied to his face in such a eerily easy manner. He believed his wife to be pure evil and he was doing the world a favour ridding the world of such a selfish human. There it is, the plot. At least I thought it was. I thought well I guess the rest of the story will be the carrying out of the murder, the complications that ensue, the understanding the Lily Kinter's motives and possibly the avoidance of, or incarceration by the police. Oh how foolish I was, I thought I figured this story out and now I was going to enjoy a twisted but predictable tale. My god Peter Swanson played me like a fool. By the 30% mark of this book I was given a literary slap down when everything I thought I figured out swiftly blew up in my face. I wish I can go into more descriptions of this novel but it's impossible without divulging major spoilers, just know that there is much more then meets the eye in this story. This is how you write thrillers people, this how you do red herrings, twisted plots, mass reveals and dark character development. Take notes thriller authors this book has set the bar high. I am so glad I found such a unnerving book. I haven't been surprised in awhile and I forgot how fun and shocking it is to truly be thrown off your guard. Last book that did that to me was Gone Girl and that was quite few years ago. I can see Peter Swanson, like Gillian Flynn, loves those strong female sociopath types and I found myself once again having a girl crush on the morally duplicitous anti-hero. I can't help myself. I know I should frown on their behaviour, condemn their horrific actions but nope I love them and I want them to get everything their twisted heart desires. Thriller fans, this is a must read a tantalizing dark tale that'll have you saying \"what the fuck?\" out loud in your favourite quiet cozy cafe more then once because, well, WHAT THE FUCK! This story is insane. I loved it and highly recommend it to those who want their bar for the great suspense novel raised."}, {"userName": "Linda", "userReviewDate": "Feb 07, 2015", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "Just imagine.......All things in the universe line up like stepping stones for you. The right/wrong people at the right/wrong time. And this is how it plays out for the main character of Lily. She dips her fingers into the pond and the concentric circles of ripples take their effect.\"Chet, can you do me a favor?\" I don't think that I'd ever used his name before, and the word sounded strange in my mouth, like a swearword I wasn't supposed to say. And so it begins.....Peter Swanson takes us for a ride through the expected and the not-so-ever-expected notches of this story. The man can write! Each chapter takes you into the deadly mindset of each flawed character. There is plenty of evil to go around and an eye-for-an-eye at the core. Swanson uses mega amounts of the shock element within this novel. At the same time, you can't look away for fear of missing a loaded detail. And loaded it is.The Kind Worth Killing is a book worth reading. Very satisfying. I am looking forward to future offerings by this very talented author."}, {"userName": "Jen", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "When I first started reading this I started to categorize people I knew who pissed me off. According to this book, they would be considered the ‘kind worth killing’. Attention Grabber. Life, you’re going on hold. I need to read this!Swanson has created a sensual thriller where 2 strangers meet at an airport and decide to play a game of truth telling. It quickly becomes a recipe for the murder of a spouse. Through brilliant twists and turns and various characters, the story comes together and is really very simple: You hurt me, you go on my kill list. You don’t deserve to live and I’m doing the world a service for removing you. Lovers beware of the person you think you know and love. If you cheat on them, it's open season. Only true psychopaths get away with murder. They live and breathe the plotting of a death exhaling only once the plan is executed. This was a page turner and I was lured from the start. It was a quick and enjoyable read. 4 stars."}, {"userName": "Debbie", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/8665845-debbie", "userReview": "[ First of all, I’m just not buying that there are TWO psychopathic killers who dated the same guy at the same time at the same school. That’s so far-fetched it’s ridiculous. And there are two other killers who don’t appear to be psychopaths. So I’m to believe there are FOUR killers (all inter-related) in one story? Really? A woman you sit next to on a plane convinces you to murder your wife, sure. (And it turns out you actually met her once.) And your girlfriend talks you into murdering her husband—sure, happens all the time.Second, and this one is a killer (no pun intended): Two characters describe their moment of death! Name one dead person who can do that! We’re supposed to not notice that the people telling the story couldn’t be telling the story because they had died? Make it not so! Make it so the author really didn’t do this! Did he do it on purpose and think it was cool (and decided to throw realism out the window)? Did he do it on purpose but figured no one would notice? Did he just never notice this huge fuckup with his story? Please, have the killer, not the deceased, tell the story of the death, or have an omniscient narrator step in for a while. Please. Once I saw that dead people described their death, I couldn’t un-know it. The talking dead were shiny bright in my mind. (hide spoiler)]"}, {"userName": "Wendy Darling", "userReviewDate": "Jan 08, 2015", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "[The main character here is also definitely more of a clear cut, unpleasant stereotype than the other book's everyday protagonist/villain. (hide spoiler)]"}, {"userName": "Jennifer Kyle", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/9916227-jennifer-kyle", "userReview": "3.5ISH Stars(4 Stars ~ For Writing/3ish Stars~ For overall story)This story was well written and highly addicting. It was a very fast paced read that doesn’t have much romance to speak of. I didn’t particularly love how things ended but did love the thrill of the ride. \n\"Truthfully, I don't think murder is necessarily as bad as people make it out to be. Everyone dies. What difference does it make if a few bad apples get pushed along a little sooner than God intended? And your wife, for example, seems like the kind worth killing.\"\nI see in some reviews this story is being compared to the likes of Gone Girl or Girl on the Train both books that I found to be a much more memorable reads. Still this is the type of read that you can’t fully say what you think until you finish and see the big picture. Looking at the big picture, I found it to be a decent story that didn't lag at all but wasn't anything I will remember in the years to come. \n”Why does a stranger agree to help someone murder his wife? What does she get out of it?”"}, {"userName": "Will Byrnes", "userReviewDate": "Mar 30, 2015", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "I’d taken enormous risks in the past two weeks, and I was lucky to have gotten away with them. But now I was done. It was over. I would live a quiet life and make sure that no one could hurt me again. I would continue to survive, knowing, as I’d known that night in the meadow, the stars pouring their light down on me, that I was special, that I was born with a different kind of morality. The morality of an animal—of a crow or a fox or an owl—and not of a normal human being.\nPeter Swanson, author of The Girl with a Clock for a Heart, has a twisted mind, not that there’s anything wrong with that. He seems to think in curves, bends, dips and sudden, hairpin turns. The feeling is a bit akin to being here, or maybe here. The sudden changes in direction may generate a bit of screaming, but it’s all good.Peter Swanson - from Dead Good Books It starts with a nod to, well, a bit more of a full body embrace of, Strangers on a Train, a 1950 psychological thriller by Patricia Highsmith, in which two men who meet while traveling get to sharing their troubles and decide that permanently eliminating each other’s problems might be the perfect solution. Hitchcock made a beautiful translation of the book to film in 1951. Swanson is a big fan of both Highsmith and Hitchcock.\nI like the idea of sudden change. That you or me or anyone could go out to a bar one evening, and the random stranger who sits down beside you changes your life forever. It’s actually something that Hitchcock liked a lot himself. Most of his protagonists are accidental ones, just ordinary people who wind up in extraordinary circumstances. \n In his version, Ted Severson a wealthy corporate raider (formerly a dot.com millionaire sort), at a Heathrow bar pre-flight, is approached by Lily, a lovely young thing. They strike up a conversation, and, as strangers might be better able to manage than people who actually know each other, (a theory titled The Rules of Airport Bars) they agree to tell each other the whole truth, and continue their truth-telling all the way back to Boston. The truth is gonna hurt…someone. Seems that Ted spotted his wife en flagrante with the contractor who was working with her on Ted’s Maine McMansion. Not good. \n”How long ago was this?” asked my fellow traveler after I’d told her the story.“Just over a week.”She blinked her eyes, and bit at her lower lip. Her eyelids were pale as tissue paper.“So what are you going to do about it?” she asked.It was the question I’d been asking myself all week. “What I really want to do is kill her.” I smiled with my gin numbed mouth and attempted a little wink just to give her an opportunity to not believe me, but her face stayed serious. She lifted her reddish eyebrows.”“I think you should.” She said. \nAnd the game is afoot.An earlier title for this book was The Lonely Lives of Murderers, which, personally, I prefer. We are treated to multiple narrators, not all of whom are psycho-killers. These serve not only to bear witness to events from diverse perspectives, but to bring in the back story as well, offering a sliver of understanding about how at least one of the psycho killers might have become that way. This is a considerable stylistic switch from Swanson’s previous book, which was written in the third person. It is, however, entirely consistent with the madcap dashings-about of that earlier work. Detective Rebecca James carries over from The Girl With A Clock for a Heart, but that did not seem a significant connection between the two books.One soft spot of note is that it can sometimes be easy to mistake the voice of one sociopath for another. There could have been more of a tonal difference made between Lily and Miranda’s narration. This is not literature, and makes no bones about it. Swanson considers himself a failed poet, and teases himself a bit in the book by giving Ted an urge to write bawdy limericks. It’s cute. But poetry major or not, he has proven, again, that he can write a wonderful, slick entertainment. No sophomore jinx here. If you are the sort who objects to excessive reliance on the sociopath as a crutch, you may have a point, but then you would probably not be reading this sort of book anyway. Peter Swanson has written a twizzler of a novel, a sweet morsel with surprising and satisfying twists that will, when you are finished, leave you wanting more. It is a gripping read, fun, fast, and furious. The Kind Worth Killing is most definitely a psychological thriller worth reading. You might pick this up at an airport or rail terminal or maybe take it along for a day at the beach. You will be glad you had. But while you are sitting at that bar, killing time in a waiting room, maybe lounging under a palm tree or an oceanfront umbrella, be careful who you talk to and what truths you tell.Review posted – 4/10/15Publication date – 2/3/2015=============================EXTRA STUFFLinks to the author’s Tumblr, Twitter and FB pagesSwanson’s web site has a cornucopia of samples of his Hitchcock poems, other poetry, short fiction and non-fiction, and is well worth checking out. Armchair Audience is Swanson’s site for writing on “Books read. Movies seen. TV Watched”He writes 500 words a day, in the morning, then it is off to his paying gig, as a product manager for a non-profit. Hopefully The Kind Worth Killing will bring in enough scratch that he will have the luxury of writing full time. Early results are encouraging. Foreign book rights have been sold in eleven territories, and a film option has already been bought, by Nick Wechsler, producer of Magic Mike and The Road. Free download of  Strangers on a Train , the bookThe film of Strangers on a Train can be seen here. The script was written by Czenzi Ormonde and some up-and-comer named Raymond Chandler, and if it is of interest, you can see the script hereI came across a couple of interviews you might like. Nicola Mira’s interview with Swanson for Thriller Book Journal was the source of Swanson’s comment about sudden change that I included in the review. Another is from the Dead Good site, which, while a Random House property, was not half-bad.. No specific interviewer is identified."}, {"userName": "Sammy Loves Books", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/14227114-sammy-loves-books", "userReview": "WOW!! Murder, Sex, and Conspiracy to Murder...Talk about a Thrilling page turnerLily KintnerImagine meeting an attractive stranger on a plane ride from London to the States. After sharing a few drinks, you each start to divulge secrets about your lives. It's all anonymous, so what's the harm? It's all fun until a jaded lover begins to talk about killing their unfaithful spouse.Lily's story will suck you in and have you cheering for the antagonist. MirandaMiranda is a beautiful, selfish, vixen and she has learned to use her good looks to get whatever she wants in life. The feelings of others are inconsequential. She finds her self front and center in a plot to commit murder. But with Miranda, nothing is what it appears to be on the surface.TedTed has found that money can buy you a lot of things, except a faithful wife. His world is about to turn upside down as he is seduced by revenge. He just wants to hurt those that have hurt him most. But life is full of surprises and Ted is in for the shock of his life!!Lily's meadow wellWe all need a peaceful place to escape to. Lily's meadow is her refuge. And it holds some very dirty secrets.BradOh Brad...your dating classified add should state:Attractive, but not the sharpest tool in the shed!!!This book was a page turner for me. I loved the multiple points of view of different characters. There are plots to commit murder that will have you torn. There were times when I found myself siding with and rooting for the killer. But most of the time, I was just intrigued by the story, with it's many twists and turns. Just when I thought I knew what was gonna happen, the author would throw a monkey wrench.If you enjoyed Gone Girl, then I recommend this read. If you're like me, and Did Not enjoy Gone Girl, then I Highly recommend this book! I felt that these characters had more depth and I actually liked them.The Kind Worth Killing is a solid 4 star read that will have your inner monster cheering for the bad guy!!"}, {"userName": "j e w e l s [Books Bejeweled]", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/68216634-j-e-w-e-l-s-books-bejeweled", "userReview": "A PROUD ADDITION TO THE TWISTER HALL OF FAME at www.booksbejeweled.com“I don’t think murder is necessarily as bad as people make it out to be. Everyone dies. What difference does it make if a few bad apples get pushed along a little sooner than God intended? And your wife, for example, seems like the kind worth killing.”― Peter Swanson, The Kind Worth KillingThis first-rate domestic thriller has never gotten the attention it deserved. It won a couple of awards when it was released in 2015, but The Girl on the Train was published around the same time and that press junket steamrolled over any serious consideration The Kind Worth Killing was gaining as the go-to novel that year.A modern take on the Patricia Highsmith classic, Strangers on a Train, the story is told mostly through the voice of Lily. I read this over two years ago, and I still remember Lily! She is a terrifyingly, unreliable narrator due to her psychotic tendencies. Here’s the weird part: I started sympathizing with her and hoping she would get away with murder in the end. This is a talented writer, people! To turn readers into serial killer sympathizers, kudos to the skillful Peter Swanson!If I summarize this book, it would be filled with spoilers. You’re most likely familiar with the Highsmith book or the Hitchcock movie, so you already know the plot. It is a cat and mouse game played with the highest stakes. But there is so much more in the way of characterization (especially Lily!) and plot twists and shocks and murder and…MAYHEM! Amen to that.Now is the time to pull THE KIND WORTH KILLING out of your TBR stack. You will be rewarded with lots of creepiness and an unputdownable story."}, {"userName": "Dem", "userReviewDate": "Mar 04, 2015", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "Wonderfully twisted and chilling suspense novel that will keep you tuning the pages.Thank you Noeleen for recommending this book as I was having a reading slump and this was just the book to make me sit up and shake of the cobwebs.This Novel grabbed my attention from Page one with its short flowing chapters and its quirky plot which starts with a conversation in an Airport bar between two strangers and leads to some riveting reading.A cast of despicable characters and a plot full of twists and turns really made this book a real page turner.\n I especially loved the ending ."}, {"userName": "Norma * Traveling Sister", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "Whoa! I gotta say that some of the twists and turns in this book definitely took me by surprise!!! I must admit near the beginning of THE KIND WORTH KILLING by PETER SWANSON had me feeling a little bit uncomfortable and questioning the motives of our devious, scheming, and manipulative main character, Lily. I just didn't know if I could get passed the planning stages and the idea that it was okay to murder someone and Lily’s dispassionate comment that Miranda, seems like “the kind worth killing”, hence the title of the novel. Then I reminded myself that hey this is a psychological thriller that is actually very cleverly written!The characters are so well-drawn, captivating, and malicious but yet so intriguing that you can't help to get caught up in their cat and mouse game. The story is told through four different perspectives but Lily's voice is heard the most throughout the story. Even though I found myself questioning her motives, the way she justifies her actions and the interactions she had with the other characters had me rooting for her throughout this twisted and chilling tale. That's good writing!I listened to this on Audible & also followed along with the print copy, just in case I missed something! I really enjoyed the performance by all four narrators.To sum it all up, this is a gripping, suspenseful, enjoyable, and an extremely fascinating novel that left me feeling totally satisfied. Would recommend!All of Brenda’s and my reviews can be found on our sister blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Lala BooksandLala", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/31027440-lala-booksandlala", "userReview": "So. Fucking. Good."}, {"userName": "Luke Narlee", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/7387842-luke-narlee", "userReview": "I noticed that I marked this book as \"read,\" but nothing else (aka: no rating or review) which I don't normally do. So, because that's abnormal for me and because I think this book deserves better, I'm going to write something about it. But, I must warn you ahead of time...I didn't get enough sleep last night and my current mood is a little delirious and strange. Enter at your own risk...It's been a while since I read this, so I am currently incapable of giving a detailed review. So you are absolutely guaranteed not to find any spoilers below. With that being said, the following is what still lingers in my memory when I try and think back on this book:1) It was a very addicting, quick read (like The couple next door and The girl on the train). 2) Despite being full of fairly unlikable characters, I found the characters to be very interesting and fun to read about, probably because they had personalities (unlike in The couple next door and The Girl on the train). 3) It kept me guessing and left me feeling satisfied (somewhat unlike TCND and TGOTT = let's be honest, we all knew what the twists were in those, even if we weren't sure about it at the time, didn't we? ) (yes, I'm resorting to acronyms now, despite how long and unattractive they are).4) If you like this sort of very popular relationship/at least one female in this story is most likely a psychotic murderer/mystery/thriller, then I don't think you can possibly go wrong with this one (sort of like Couple Next Door and Girl on Train except there's a few things that go wrong in those that made them less enjoyable than this one (see my reviews) (yes, I decided to abbreviate instead, the acronyms were just too unattractive and just as tedious).5) This book left me excited to read whatever this author writes next (I know what it is because a bunch of people have already read it and reviewed it on here even though it isn't out yet, I just can't think of the title (women staring through windows?). I'm more excited about it than the next books coming out by the authors of those other two books (NEN), but not excited enough to read Swanson's first book apparently (Girl with the clock heart), because I still haven't managed to get around to it. Perhaps it's because the word \"girl\" is in the title, which is quickly becoming the world's biggest eye roll.So that's saying something at least...For those of you who knew what (NEN) stood for without hesitation, I owe you lunch.Bottom line: This is a very enjoyable mystery that doesn't try too hard, it just is.Thank you for reading.Special Note: With all due respect to Shari Lapena and Paula Hawkins, they both wrote very good, enjoyable books. I just have fun ragging on some of the their less-than-stellar qualities. Special Note part 2: Some of you may be wondering why I failed to mention \"Gone girl\" anywhere in this review, since it's like the President of domestic thrillers with \"girl\" in the title, but I've just never been able to get into that book. I tried reading it like four times and kept putting it down. I'm pretty sure that statement is illegal at this point, but it's still the truth, none-the-less.Not so special note: I haven't read the Behind Closed Doors yet, but I want to."}, {"userName": "Diane S ☔", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "The whole time I was reading this I kept thinking of two lines in the poem, \"Marmion\" by Sir Walter Scott, taken completely out of context of course, \"Oh! What a tangled web we weave, when first we practice to deceive.\" This book was deception after deception, deceptions to cover other deceptions. Even when it looked like one thing was going to happen, something else did. Definitely kept one reading, such a grouping of characters with little or no conscience. Well written, suspenseful and rapidly paced, I found this to be a very entertaining read. Loved the ending too, totally unexpected, but I thought perfect.ARC from Publisher."}, {"userName": "Justin", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/2795921-justin", "userReview": "I will never understand why books like The Girl on the Train become runaway bestsellers when books like this exist. Yeah, yeah... there are similarities. This story revolves around four crazy people doing crazy stuff with plenty of crazy plot twists along the way just like that other book I mentioned. But, come on, this story is so much better. I loved how the story begins with Ted and Lily running into each other at the airport and having an interesting conversation. And, I loved how the second half of the book resets everything and flips the story into something completely different than I thought it was going to be. There is plenty of backstory here, too, so most of the characters have depth even if their pasts are ridiculously unbelievable at times. I mean you really have to just roll with this thing and not think about it too much because it's insane. I can't really say anything else without giving too much away. The only thing that bugged me was how convenient some things were from some people, especially one of them, when it came to certain things that happened in particular sections of the book. See how vague that was? I can't say anymore....."}, {"userName": "Sandra", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/3237803-sandra", "userReview": "Two strangers (Ted Severson and Lily Kintner) begin talking to each other in a lounge-bar at London’s Heathrow airport. While their flight is delayed they begin to tell each other a little bit about themselves. Ted mentions that he is married and that he thinks his wife Miranda is having an affair with the house contractor, Brad. Ted says, in an offhand way, that he would like to kill his wife Miranda. Lily replies, “I think you should”. Is she joking? She offers to help him. When they get on their flight (they are both flying to the US) they both seriously discuss killing Miranda, and Brad. And they plan to meet up later with more details about how they are going to do it. This was a really compelling and captivating read. I had a hard time putting this book down. It reminded me a bit of the old Hitchcock movie, “Strangers On A Train”. This book also had some unexpected twists and turns in it.A very gripping suspense story."}, {"userName": "Mary Beth *Traveling Sister*", "userReviewDate": "Dec 12, 2015", "userURL": "http://www.goodreads.com/user/show/14233569-mary-beth-traveling-sister", "userReview": "Wow! What a thriller! This book has a lot of twists and feel that it was a very fun book! I was shocked at the ending which was another twist! If you haven't read this yet and love thrillers this one is a must!It all started when Faith stole Lily's boyfriend Eric from her and it never seems to stop. Scene after scene of sociopaths and murderers, and right when you think that you have it figured out another twist pops up! The ending was the thrill and I couldn't believe it. I just couldn't hold in the laugh! This book definitely meets the Wow factor! Ooohh I loved the ride and think that you will too!I just loved this book. This is the third book in a row that I gave 5 stars too. I really love it when it happens like this. It has to be an above over the top book for this to happen and this one definitely is one. So make sure you click on kindle or to the bookstore now and get this book!"}, {"userName": "Elyse", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "\"Could he possibly have secrets, as well?\"\"And now I was realizing......\" ( you think I'm going to tell you?)\"The day was cold and gray\"...... ( of course, what mystery murder thriller do you know that happened on a bright warm sunny day?)\"I wondered of course\" .....( me too) .... But I figured out the ending 50% into it.\"I pretended to be interested.\" ( I really really tried) \"I watched his eyes hunt my face. I knew I looked quite a bit different from when I had checked in\". ( always a reason of course)\"Your not going to like what I'm going to say, but I need you to listen.\" ( yeah, damn you) \"He slumped a little, looking like a dog that had just been swatted in the nose.\" ( it happens) \"Tell me again what we're going to do.\" ( yeah, who doesn't love a little direction) \"She was surprised, though....\" ( question is... will you be?). 3.6 rating I liked it! But....This story also seemed like a similar story I read years ago. A stand out thriller that still gives me the yummy- willies...( favorite psychological suspense thriller), is \"AS NIGHT FALLS\", by Jenny Milchman I have many other reviews to read about this book!! .... gotta read what my friends think of this novel. ( I'm guessing that's many of 'you'). See ya soon! :)"}, {"userName": "Zoeytron", "userReviewDate": "Feb 02, 2015", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "[The idea of a veritable nest of psychos operating within shouting distance of each other, and working at crossed purposes, was absolutely delicious! (hide spoiler)]"}, {"userName": "Trudi", "userReviewDate": "Sep 20, 2015", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "It's easy to compare this one to The Girl on the Train or even Gone Girl. It definitely has that vibe of psychologically damaged minds perpetrating dark deeds in the midst of a twisty, sinuous plot. It also shares the multiple POV narration, which when done well, can add SO MUCH to these types of stories. As it does here. I would actually argue that The Kind Worth Killing is an even stronger and more page-turning book than The Girl On the Train (whose underwhelming ending left me sort of underwhelmed by the time I was done, especially after such a great build-up). If you're going to write a page-turning psychological thriller piece like this you had better stick the landing, otherwise all your hard work leading up to the main event is going to feel wasted. It's all a house of cards, an illusion built using smoke and mirrors; you are asking the reader to suspend their disbelief and come along for the crazy ride. When it's all over, don't leave them feeling like they've been had. Play fair. Don't cheat.The Kind Worth Killing has a very noir sensibility in its tone and execution that I just lapped up like cream. And no surprise because the author is channeling Patricia Highsmith's classic crime novel Strangers on a Train that Hitchcock adapted into one of my favorite film noirs. When people start talking and planning the perfect murder, you know anything can -- and usually does -- happen. Along with its noir vibe, The Kind Worth Killing is also reminiscent of the old pulp fiction crime novels churned out on cheap paper during the first half of the 20th century -- where sex and violence are expected to go together like PB&J -- a marriage made in heaven if you will, or more accurately, hell. The characters are not meant to be likable, or even relatable, and the dialogue and writing style is strictly utilitarian -- nothing fancy -- just let's move the plot along here, we've got places we need to end up. It's not always easy getting from A to Z leanly and meanly. I really enjoyed the multiple POV narration here. It's probably what the novel does best. Sometimes there is some overlap too -- you get the same event described to you again but this time by a different character. It would be easy to screw that up and just have things seem repetitive. Here it's executed with aplomb and adds depth and interest to the story. At least it did for me. I would love to see this as a movie, especially if they fully committed to a noir style."}, {"userName": "Iris P", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/2641948-iris-p", "userReview": "The Kind Worth Killing“The Kind worth Killing” by author Peter Swanson, is full of sociopathic, vengeful and backstabbing characters. It is a highly gripping, addictive and brilliantly executed psychological suspense novel. The novel is told from the perspective of alternative narratives between the main characters and it truly takes you on a very twisted and wild ride. Although there’s bloodshed the author does not relishes in providing lots of gratuitous and gory details. One of my pet peeves is when people complain about a book because it has “unlikable characters”, I am pretty convinced that “unlikable characters” are far more interesting to read (and I am guessing write too) about. And these are truly unlikable and unreliable characters, so if you are with me on this point you are on for a treat! It has been mentioned that the author wrote this book to pay homage to Patricia Highsmith’s “Strangers on a Train”. As the story opens, our main character, Lilly Kintner, a beautiful and mysterious redhead, is in fact sitting at a terminal at Heathrow airport reading a book by the renowned author, although instead of the well-known classic mystery, she is holding the lesser known “The Two Faces of January”, and she points out is “not one of her (Highsmith’s) best”. This is where she accidentally encounters rich businessman Ted Stevenson (he’s not quite Mr. Grey but close enough), who like Lily is on his way to Boston. Over drinks they start a conversation that would definitely not pass the “just small talk with a stranger” test. Thanks to a delay in their flight, the certainty that they’ll never see each other again and several Martinis, their exchange becomes much more candid. Later on during their night flight to Boston, Ted mentions that Miranda, his bohemian artist, gorgeous wife, is having an affair with Brad, their contractor. Half-seriously he reveals that what he’d really want to do is kill her. Rather than being shocked by this revelation, Lilly’s reaction is not only to be sympathetic to the idea but to actually offer to assist on the plotting and execution of the scheme.The title of the novel refers to Lily’s almost nonchalant comment that Miranda, seems like “the kind worth killing”. She rationalizes that “we are all going to die sooner or later ”so what difference does it makes “if a few bad apples get pushed along a little sooner than God intended”. Apparently this is all the moral support Ted needed to take this from: crazy idea in my head to let’s get together to come up with an actual plan. Really crazy!Although this scene sounds outrageous and farfetched, Mr. Swanson very aptly draws the psychological background, particularly for Lily, that helps the reader understand this exchange and the events that follow. As the connection between Ted and Lily deepens, they start planning the demise of Miranda and her lover and how to get away with it.The first part of the book focuses on Lily’s backstory. That includes a legacy of murder that goes back all the way to her own troubled childhood. Through the use of flashbacks, we have a chance to glimpse into her past. He does the same for Ted and the other characters, but they are not as flesh out as Lily's is.Although I don’t always enjoy how many authors use this technique, I felt that in this case, Mr. Swanson’s did a masterful job at using past narratives to draw pretty good psychological profiles of the characters, while at the same time holding back enough details to keep you guessing how everything is going to end.The 2nd part of the book delves deeper into the plotting to kill Miranda. It also adds the narrative perspective of two of the other main characters, Brad and Miranda.The 3rd part of the book becomes sort of a police procedural, albeit a low-key one, with a detective that although determined to uncover the truth, is part of a police force that's a little bit too inept. I don’t want to give much more about the plot, but the ending was well done and I thought, nicely wrapped up with a satisfying conclusion.I have a few minor criticisms of the novel:* The author has a tendency to over-explain the characters motivations to the reader, this to me felt a little redundant and unnecessary sometimes.* To me Miranda and Lily sound too similar in their inner-dialogue and overall traits. They both fitted into the role of \"femme-fattale\" a little bit too neatly.*Perhaps this was premeditated, but it’s difficult to know if the author wants the reader to empathize with Lily or to loathe her. Sometimes I like a clearer moral compass in my reading. Let’s just say that I felt awkward whenever I caught myself rooting for one of the bad guys/gals (and I say this as someone that enjoyed all 7 seasons of Dexter!).As for the comparisons with Gone Girl, which seem inevitable these days, is fair to say that yes there's a similar story structure: a marriage unraveling in front of our eyes, a female character with sociopathic tendencies, and to a certain extend, unreliable narrators. But whereas Gone Girl focuses more on Amy Dunne's bitterness and sense of betrayal after Nick falls fart short of her expectations as a husband, and later on the conflicting stories as seen through their eyes, \"The Kind Worth Killing\" does not follows such a tight chronological timeline. It also relies not on two but three narrators. Ah and lest I forget this important detail: there's a much higher higher body count here!. And as astonishing as this sounds, Lily Kintner is a much more cold-hearted, manipulative and emotional unattached figure that Anne Dunne.In my opinion, “The Kind worth Killing” is not a literary thriller, don’t read this book looking for beautiful, profound prose, however if you are interested in a well written tale of revenge, lust and betrayal with some intriguing psychological nuances, I would definitely recommend it.Finally, although it's not always the case, the multiple-narration on this audiobook worked really well for me this time."}, {"userName": "Lisa", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/32081931-lisa", "userReview": "Murder Murder & more Murder that's what Peter Swanson takes you on in this thriller which made me think is murder that bad everyone lives everyone dies its as simple as that but HOW FAR WOULD YOU GO TO KILL & COULD YOU DO IT??While reading this brilliant novel i was thinking about my own mortality & how easy it would be to be pushed so far by people who you thought you knew but didn't ? WHAT WOULD YOU DO IF THIS HAPPENED TO YOU!!I was so taken with this book i just could not stop even to cook dinner told hubby you will have to wait, did i win NO but i did eventually put it down.I loved everything about this book the tension built between the characters & the plot was told between certain characters which really worked i hated Miranda AKA Faith i felt sadness for Ted as he was just so desperate to kill Miranda but the closer he got the more anxious he got to tell you to be honest everyone got what they deserved.Peter Swanson is an accomplished writer of this Genre will be looking into more books by this author. 5+ *s"}], "description": "A devious tale of psychological suspense involving sex, deception, and an accidental encounter that leads to murder. Fans of Paula Hawkins’ The Girl on the Train will love this modern reimagining of Patricia Highsmith’s classic Strangers on a Train from the author of the acclaimed The Girl with a Clock for a Heart—which the Washington Post said “should be a contender for crime fiction’s best first novel of 2014.”On a night flight from London to Boston, Ted Severson meets the stunning and mysterious Lily Kintner. Sharing one too many martinis, the strangers begin to play a game of truth, revealing very intimate details about themselves. Ted talks about his marriage that’s going stale and his wife Miranda, who he’s sure is cheating on him. Ted and his wife were a mismatch from the start—he the rich businessman, she the artistic free spirit—a contrast that once inflamed their passion, but has now become a cliché.But their game turns a little darker when Ted jokes that he could kill Miranda for what she’s done. Lily, without missing a beat, says calmly, “I’d like to help.” After all, some people are the kind worth killing, like a lying, stinking, cheating spouse. . . .Back in Boston, Ted and Lily’s twisted bond grows stronger as they begin to plot Miranda's demise. But there are a few things about Lily’s past that she hasn’t shared with Ted, namely her experience in the art and craft of murder, a journey that began in her very precocious youth.Suddenly these co-conspirators are embroiled in a chilling game of cat-and-mouse, one they both cannot survive . . . with a shrewd and very determined detective on their tail.", "title": "The Kind Worth Killing", "url": "http://www.goodreads.com/book/show/21936809-the-kind-worth-killing", "average": 4.03, "cover": "https://images.gr-assets.com/books/1417981750l/21936809.jpg", "reviews": 6692, "authors": [{"url": "https://www.goodreads.com/author/show/7142445.Peter_Swanson", "name": "Peter  Swanson"}], "type": ["Thriller", "Mystery", "Fiction", "Thriller", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/21936809-the-kind-worth-killing", "http://www.goodreads.com/book/show/25173402-the-kind-worth-killing", "http://www.goodreads.com/book/show/21936646-the-kind-worth-killing", "http://www.goodreads.com/book/show/24396293-the-kind-worth-killing", "http://www.goodreads.com/book/show/25944394-the-kind-worth-killing", "http://www.goodreads.com/book/show/29938032-her-every-fear", "http://www.goodreads.com/book/show/17841564-the-girl-with-a-clock-for-a-heart", "http://www.goodreads.com/book/show/35230481-all-the-beautiful-lies", "http://www.goodreads.com/book/show/32945839-xxl-leseprobe", "http://www.goodreads.com/book/show/23257133-goodnight-june-those-who-wish-me-dead-looking-for-me-the-girl-with", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}