{"ratings": 675, "userreviews": [{"userName": "Carol", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/23315273-carol", "userReview": "The Kindness of Enemies deserves two ratings - 5 stars for the portion of it that is set in the 1850s (in the Caucauses and in Russia), in the third person, and focused primarily on Imam Shamil, a highlander Muslim warrior at war with the Russians (an actual historical figure) and Anna, a Georgian married to a Russian, whom Shamil takes and holds hostage for several months, and a 2.5 for the portion of it that is set in contemporary times and focuses on Natasha Wilson, in Scotland and the Sudan, in the first person. The good news is that my perception was that the dual-timeline is allocated approximately 70-30, with 70% of it spent with Shamil, Anna and others in the 1850s. The puzzlement is that one author, Aboulela, wrote this novel - so unequal is the quality and character of the two parts. The contemporary portion is weighted down by an unappealing protagonist whom we never relate to, for a variety of reasons, and whose story just seems so trivial compared to the stories of Shamil and Anna.What Aboulela does with the story of Shamil et al is simply magical. The characters are morally complex and fascinating, including the ones I didn't particularly like. Shamil is a warrior, and he is also noble and principled. The dialogue is believable and rang true, notwithstanding the challenge for a 21st century author crafting conversations between 19th century characters of disparate cultures and educational levels. The history was entirely unfamiliar to me (my bad) and she explained it effortlessly throughout and while telling the story - without spending 8 pages on historical background, the crutch of the poor historical fiction writer. Aboulela brings the battlefield alive, even to this reader who is often bored by battle scenes. She deals with death authentically, but not gratuitously. Even so, early tragedy lets the reader know not to anticipate or hope for happy endings all around, and to accept that the desired outcome for these characters isn't a happy ending, but that they be at peace with whatever happens. There is a sadness to Shamil, Anna, Shamil's son, Jameleldin, Shamil's mentor, the Shiekh - almost despair. They've experienced personal loss, political loss and fear losing identity, too. Aboulela's ending for this part of the narrative brings a certain amount of resolution for the despair each characters feels and is satisfying. The language of the finale is breathtakingly beautiful.So . . if you want to read one of the best books you'll read this year, consider taking an unusual approach to the Kindness of Enemies and read only the Shamil parts. If you skip the parts of the Kindness of Enemies that tell Natasha's story, you miss nothing of value and you'll also be certain that Aboulela is a brilliant writer, without question. It's a win-win. Now I'm off to find out more about Imam Shamil - he's just that fascinating a historical figure, and the conflict between the Muslim tribesmen and the Russians, is as well. p.s. if the sheer ugliness of the cover is putting you off from reading this wonderful book, please don't let it. It's an abomination - perhaps the single least attractive cover I've seen, at least on a novel that isn't self-published. The illustration on the front is odd and off-putting. The rear cover has 3 - 4 forgettable quotes. Really - it's as if the boss's nephew came up with the cover design while the marketing department was being held hostage in a far off castle. Whomever approved it for printing should be punished severely and reassigned to a job that involves no design element whatsoever, and he/she owes Ms. Aboulela an apology of the highest order."}, {"userName": "Susan", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "I have never read anything by Leila Aboulela before; but knowing she has won the Caine Prize, the Scottish Book Award and has been shortlisted for several other awards, as well as having two books on the Orange Prize long list, I was eager to review this new book. Aboulela grew up in Khartoum and now lives in Scotland and both places feature in this novel which makes use of the now much over-used dual time line, taking place both in contemporary Scotland and Sudan and has a historical storyline which unfolds in Georgia and Russia during the 1800’s.We begin with Natasha Wilson, an academic in her thirties, who works at a university where one of her students is the rather unfortunately named Osama (nicknamed ‘Oz’ or ‘Ossie’) Raja. Natasha, the daughter of a Russian mother and a Sudanese father, has changed her surname to that of her Scottish step father and is obviously conflicted about her identity and her place in the world. Her research centres on Imam Shamil (a real character) who went to war against the Russians. She is delighted to discover that Oz is a descendent of Shamil and is invited to visit him and his actress mother, Malak. During her visit they are snowed in and, during this stay, Oz is arrested for possible terrorist sympathies.This story is interweaved with the story of Shamil, whose fight against the Russians is much admired by Natasha. Shamil’s eldest son, Jameleldin, is taken by the Russians as a hostage and, many years later, Shamil kidnaps a Georgian princess, in an attempt to get back the son he has lost. Much of this novel is about identity, conflict and belonging – but the author does not so much belabour the point as hit you over the head with it. We have Natasha unsure of her place in the world, Oz who is a rather typical angry young man, provocatively beheading snowmen with a scimitar, Jameldeldin who is lost to his father both physically and spiritually, as he assimilates with his Russian captors and loses his faith and language and yet is accepted in neither world and Princess Anna who sees herself as Georgian rather than Russian.I really did want to like this book, but I found myself sympathetic to none of the characters. Of course, you do not have to like the characters in a novel to enjoy the book itself. However, I simply felt a lack of interest in what happened by the end. The storyline set in Georgia and featuring Shamil was certainly the most interesting part of the book, but whether Jameldeldin was the son of his father or a Russian gentleman or not, was not really enough to keep my interest. I listened to an interview with Aboulela in which she stated she wanted to reclaim some of the language that she feels has been misused in recent times, such as the sense of a spiritual struggle. However, her sentiments threaten to overwhelm the plot. Identity is not always about nationality and in the multicultural world we live in now few people I know obsess as much as the characters in this book about their place in it."}, {"userName": "Ron Charles", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "The flames of Sept. 11, 2001, not only recast America’s future, they illuminated a long-neglected history of conflict between the West and certain strains of Islam. Suddenly, for many of us, the present day had malignant roots we’d never recognized. Salman Rushdie recently added to the library of books on this vast subject with “Two Years Eight Months and Twenty-Eight Nights,” a surprisingly whimsical story about warring genies reigniting an ancient battle in the modern age. And now comes another unusual novel that captures our anxious latter-days while reaching back to a contentious past.“The Kindness of Enemies” maps the interconnectedness of the world on both personal and political levels. To some extent, that intricacy reflects. . . . To read the rest of this review, go to The Washington Post:https://www.washingtonpost.com/entert..."}, {"userName": "Pia", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/9976675-pia", "userReview": "In this beautifully written book by Leila Aboulela there are two stories: One is the story of Natasha, half Sudanese-half Russian, who has grown up in Scotland and lost all of her roots. The other is the story of Imam Shamil, a Muslim warrior battling the Russians in the 19th century and of Princess Anna of Georgia, whom he takes hostage in exchange for the return of his son Jamaleldin, who in turn has been a hostage of the Tsar since he was a young boy.This is a book in which most of characters have a feeling that they don't belong: Natasha because of her mixed heritage, Oz the descendant of Imam Shamil, Princess Anna who has to consider herself Russian, and Jamaleldin who has lived as a Russian since he was a young boy.There is also another very important element in this book, and it is to show how complicated it is to be a Muslim in the 21st century. How anything you do might be misinterpreted and investigated.Through all the despair this characters feel, is there some hope for them? That is what Leila Aboulela writes about, of finding yourself (or trying to) amidst the despair and the sadness. And though not all her characters manage to reach a happy ending (the book is more serious than just wishing for happy endings), they do achieve a sense of peace that made me, as a reader, completely enjoy this book. I received an ARC of this book in exchange for an honest review."}, {"userName": "Lila", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/4656570-lila", "userReview": "This fascinating and wonderful novel flicks back and forth telling two parallel stories and linking two different time periods. It's a book about multiculturalism, understanding other cultures and finding one's own identity in a multicultural world. Leila Aboulela creates the character Natasha, a history professor living in Scotland in 2010 as a bridge between the two time periods. Born in Sudan of a Russian mother and Sudanese father, Natasha refers to herself as \"a failed hybrid\". She has lost touch with her Sudanese culture, changing her last name from Hussein to Wilson.  A part of her must still yearn to get in touch with her roots, because she is currently researching Imam Shamil, a 19th century Chechen Muslim leader and resistance fighter. Natasha learns that her most promising student, \"Oz\",short for Osama, is a direct descendant of Imam Shamil. Oz invites Natasha to the country home he shares with Malaka, his actor mother, to see the family heirloom, the famous sword that once belonged to his great, great grandfather. There is a snow storm and Natasha must spend the night with her new friends. Early the in morning the police come and take Oz away under suspicion of being a terrorist. The Kindness of Enemies shows how careful Muslims have to be these days and ages. Oz, is doing research on \"Jihad\" for his studies. His email user name \"SwordOfShamil” and email subject lines like “Weapons used for Jihad\" get him into trouble.  The second story begins in the 18 hundreds. Russia is embarking on full scale conquest of the Caucasus. The points of view alternate between Imam Shamil, Anna,granddaughter of the former king of Georgia and Jamaladin, Shamil's eldest son.  As part of a broken treaty Shamil is tricked and Jamaladin is taken hostage by the Russians as a young boy. He raised as Tzar Alexander's guest. In the many years living among the Russians, he too, like Natasha, loses his original identity. No longer feeling Chechyan, Jamaladin is also never fully accepted as Russian.  In an effort to get Jamaladin back, his father Shamil kidnaps Princess Anna and takes her and her son to live with his family. Anna's infant daughter tragically dies along the way.  Princess Anna is the granddaughter of the King of Georgia who ceded his country to Russia. She has accepted that becoming part of Russia is inevitable. When living with her captors, she starts to identify with the Chechyan's struggle not to be assimilated. Imam Shamil's mission in life is Chechnya's independence.  Here Abouleila shows the difference in what \"Jihad\" meant then and now. Shamil did not endorse suicide attacks. When faced between a choice of leading his village to fight to the death, he chooses to surrender. When he finally is exiled to Russia, he appreciates many aspects of Russian-Christian culture. A theme in this novel is how very little people know about their enemies. As Abouleila says in an interview:“The Russians believed the Chechens were wily and suspicious,” Jamaladin, Shamil’s son thinks. “The Chechens believed the Russians were aggressive and treacherous. They were both right, they were both wrong.” In the 18 hundreds traveling was not easy and people did not have a lot of information about other cultures. Nowadays we have so much information, yet many people remain willfully ignorant!  So what was true for then is still true today, but today we have the power to change.  Leila Abouleila says the following about the real life Imam Shamil:\"His open heart and learned mind make him completely different than present day jihadists, whether Al-Qaeda or otherwise\" He would definitely have disapproved of today's suicide bombers.  This is the kind of book where you feel like yelling out loud that everyone should read it! Although the subject matter is deep and thought provoking, it is never heavy handed or preachy. It is a very an enjoyable read. Incidentally, a few months before I read this I discovered a beautiful and moving video of Chechens performing the Sufi ritual Zikr: https://m.youtube.com/watch?v=sSGrStb...I thought of it while reading about the Zikr rituals being practiced by both by Imam Shamil and in the modern story Oz's mother Malak. This book is for everyone who is interested in history and other cultures. It's characters linger on in your mind long after the story is finished! Thank you Leila Aboulela for writing this book!"}, {"userName": "Taryn Pierson", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/13977687-taryn-pierson", "userReview": "When news broke last week of attacks in Beirut, Paris, and other cities around the world, as I always do, I turned to fiction to help make sense of the ongoing tragedy. Of course there isn’t any real sense to be found in the violent deaths of innocents; there never is. But suddenly my reading of The Kindness of Enemies took on a new urgency. Now more than ever, understanding Islam feels like an imperative, and more importantly, marking the distinction between its earnest practitioners and its extremists. Reading fiction is a consistent way in for me to cultures and experiences outside my own. It strips away the foreignness I feel as I read journalistic reports and use as a convenient excuse for my ignorance. I may easily dismiss “that group” as other, but I can’t do the same with “that character.” The specificity of fiction, though it may not represent truth in the same way a news article would, points me toward the larger, more fundamental truths of real, complicated, global life.Leila Aboulela’s novel shines a light on the events of last week, and in so doing reveals a need for nuance in our approach to questions of religion and extremism. Natasha, a professor at a university in Scotland, bonds with a student and his mother over a weekend spent snowed in at their home, but when the student comes under investigation for terrorist activity, she has to reevaluate their every interaction. Was he harboring fantasies of violent jihad? Were there signs that she ignored because she liked him, respected his intellect? How much responsibility should she bear, if the claims of the police prove true?Natasha's situation is further complicated by her own ambivalence toward her heritage. Her father is Sudanese, her mother Russian, which leaves Natasha in between two cultures, not feeling as if she belongs anywhere. She claims Islam culturally, but is not a practicing Muslim; her almost compulsive tendency to distance herself from her father's religion echoes throughout her narration. Aboulela includes chapters that flash back to the mid-1800s, telling the story of Imam Shamil, Natasha's prized student's ancestor and the focus of her own academic research. Shamil led a group of resistance fighters against the Russian army in the Caucasian War. These chapters portray compelling, sympathetic characters on both sides of the conflict—both Shamil and his family, and the families of his enemies—eloquently underscoring the point that, in war, identifying sides as “good” or “bad” is not always a simple proposition, much as we might try to make it so.I still have a lot more questions than answers about what happened last week. But now that I've read Aboulela's book, I've at least learned some of the right questions to ask.With regards to Grove Atlantic and NetGalley for the advance copy. On sale 5 January 2016.More book recommendations by me at www.readingwithhippos.com"}, {"userName": "Missy J", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/7406091-missy-j", "userReview": "[after x-amount of years living abroad and being estranged from her father and the country Sudan, she suddenly realizes that her home has always been in Sudan?! A country where sharia law is fully applied to all people regardless if they are Muslim or not! Ok, I can see that she can feel a connection to the small Russian-Sudanese community there (it reminds her of her own childhood), but she has spent more time in the West at the end of the day. She was educated there and has worked there only and suddenly, she embraces Sudan, which is radically different. No culture shock at least? And she comes to the conclusion that she needs to seek a spiritual life as a better Muslim...  (hide spoiler)]"}, {"userName": "DubaiReader", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/2368681-dubaireader", "userReview": "Identity and belonging.It took me quite a while to get into this book, I kept putting it down because it just wasn't grabbing me. Having given four stars to Lyric's Alley by the same author this was a bit disappointing, but I persevered and as a result I have learned about a time in history that I was totally unaware of. And there was a reward - it turns out that during a trip to Georgia I had actually visited the villa where Anna and her children were spending that fateful summer.I had thought when reading, that I enjoyed the contemporary story most, but as I start to write this review, I realise that it is the story of Shamil and Anna that has stuck with me.Leila Aboulela recently attended our Literary Festival and was talking about the problems of assimilating into Scotland. I wonder if I was relating her experiences to those of Natasha, the main character in the contemporary parts.The main character of the historical section was Imam Shamil, the 19th century Muslim leader who led the anti-Russian resistance in the Caucasian War. Although a warrior leader, the author attributes him with a very genuine, caring nature and he treats his prisoners with respect.This was a book group read and I don't think anyone had heard of Imam Shamil before reading this book. I'm glad to say that the others all gave higher ratings than I did, so you may consider me a minority and ignore my rating if you wish :)"}, {"userName": "Beverly", "userReviewDate": "Oct 26, 2015", "userURL": "http://www.goodreads.com/user/show/876421-beverly", "userReview": "This was a 4.5 read for me.Thoughts coming shortly"}, {"userName": "Annette", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/28876436-annette", "userReview": "The kindness of Enemies by Leila Aboulela was a Goodreads First Reads winThis is a book about identity and belonging. It questions whether religious identity is with you from birth, or whether upbringing and culture are the main forces which create it. Two stories interweave, one in the present, one in the nineteenth century. In both stories there are displaced people. In the past story, a warrior (Shamil) fights to defend his country (the Caucasus) against Russian invasion. He fights for his culture and religion. His son, Jameleldin in taken from him by the Russians, when he was young. He lives in the court of the Tsar, who treats him kindly. Jamaladin forgets his native language, culture and religion and embraces the Russian way of life, but he is not totally accepted by the Russians. When he returns to his father years later, he does not feel at home there. In order to get the release of his son, Shamil captures a Russian princess and her children to exchange for him. One child, a baby is lost in the mountains, and the princess and her son face hardship. Shamil is kind to them though, and they begin to feel at home with him, especially her young son who begins to adjust to a new life. Back in present day Scotland, a lecturer, Natasha, is researching the story of Shamil and discovers that one of her students, Oz, is descended from Shamil. Natasha has a Russian mother and a Sudanese father, but is estranged from both. Her life, with a new surname is in Scotland. Only when she has to return to the Sudan, on the death of her father, does she realise how much of her past and identity has been lost. Oz is proud of his connection with Shamil. He still has a sword which is a family heirloom, said to belong to Shamil. He too wants to research the past, which causes him to access terrorist websites. This brings him to the attention the anti-terrorist police. We are left wondering if he is innocent, or a potential terrorist. If innocent, he is so traumatised by the experience, it might well change his ideas and life.It is a very readable book, descriptive of place, people and ideas."}, {"userName": "Carol Douglas", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/36792905-carol-douglas", "userReview": "This is an amazing book. Leila Aboulela is a fine writer who covers new ground. One part of this story is set in Dagestan in the 19th century as it rebels against Russia. The other part is the story of a woman who is half Russian and half Sudanese who lives in Scotland and studies history. She's fascinated by the revolt in Dagestan that the other part of the book discusses. How wonderful it is to learn about places I've never read about before! Imam Shamil, the leader of the Muslim resistance to Russia, is the focal point of both stories. Natasha Hussein, the modern narrator, meets his descendants, a Sufi actress and her son, who is one of Natasha's history students. Shamil was a Sufi, though we don't generally think of Sufis as being fighters.  It's so refreshing to see a clash of cultures that isn't primarily about the United States or Britain, though they figure into it.  Shamil doesn't understand how much military superiority the Russians have. He finally has to give his beloved first son as a hostage to the Russians to save the lives of his followers. But he is determined to get his son back.  Natasha is deeply conflicted about being mixed race and changes her name to hide her Muslim identity.  The story also includes Georgians, another people who have been made subjects of Russia, but who's situation is easier because they are white and Christian.  The book is about what it means to be Muslim, both in the 19th century and today. It's a fascinating, subtle book."}, {"userName": "Nisma", "userReviewDate": "Apr 03, 2016", "userURL": "http://www.goodreads.com/user/show/4730679-nisma", "userReview": "I can't really explain why I love this. Okay, for a start, it wasn't anything I expected. I envisioned something a little more thriller, I guess, or contemporary political stuff. And sure, Oz's plight is a significant part of this story, but I was enraptured by the flashbacks to the life and times of Shamil, Anna, and Jamaleldin. That... was... Epic is the only word for it.I have always loved Russian history, but for me, that was the Russian revolution and onwards. This step back, and the history of these highlanders, or the Caucuses, this is stuff that I've never heard about, but it's so very... Extraordinary. I cannot believe this isn't so well known. It's. It's EPIC.More than that, I like how Leila Aboulela doesn't create a... a sway to one side. You don't feel like she's preaching to you, but you also don't feel like she's embarrassed or sugar-coating the religion. It just is what it is. I love it."}, {"userName": "Columbus", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/2426275-columbus", "userReview": "An absolutely engrossing read from Leila Aboulela with dual storylines: One of present day Scotland and radical jihad terrorism accusations and another of 19th century Muslim religious leader, Iman Shamil, The Lion of Dagestan, and the anti-Russian resistance in the Caucasian War. This Caine Prize winner weaves a wonderful tale in a region and fight I knew very little about. I learned a lot from this fantastic novel and one of those things is not to overlook the unfamiliar. Or said differently, to seek out that which I'm unfamiliar. I will certainly be seeking out more from this author.4.5 stars"}, {"userName": "Vivian", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/4285380-vivian", "userReview": "Natasha Wilson is a history professor at a university in Scotland with an interest in 19th-century Russian history, specifically the anti-Russian resistance movement. One of her students, Oz Raja, is reportedly a descendant of one of the most popular leaders of this movement. Befriending this student and his mother sets Natasha on an amazing adventure of self-discovery and reconnecting with her past in The Kindness of Enemies by Leila Aboulela.At the age of fourteen, Natasha Hussein was adopted by her stepfather and went from being a Sudanese immigrant to a Scottish resident named Natasha Wilson. Born and raised in Khartoum, Sudan by her Christian Georgian mother and nominally-Muslim Sudanese father, Natasha never felt truly comfortable in Sudan or with her father. After her parents divorce and her mother's second marriage, Natasha did her best to fit in. In 2010, she is a college professor that has published several well-received articles and is respected by her peers. She's not quite sure why, but she's drawn to one of her students, Oz (Osama) Raja, a disenfranchised Muslim. Their connection grows due to one of Oz's forefathers, the renowned Imam Shamil. After visiting Oz and his mother, Malak, Natasha has the opportunity to see Imam Shamil's sword and other items. Although Natasha and Malak are concerned about Oz's curiosity about jihad and his perceived persecution of Muslims, neither takes it seriously until Oz is arrested after downloading suspicious materials. In a post-9/11 world, a little suspicion goes a long way and Natasha is perceived to be tainted by her visit to the Raja home and receiving an email from Oz about a possible research project for a dissertation. As Natasha attempts to rebound from these suspicions, she must also contend with phone calls from Sudan about her estranged father's failing health. Is it possible Natasha and Malak missed signs of Oz's radicalization? Is Oz, in fact, being radicalized or simply curious? Are Muslims being unfairly targeted in a post-9/11 world? Can Natasha reconnect with her father and Sudanese heritage? After reading The Kindness of Enemies, I had to take a day just to think about it and what I could say about this book. Did I enjoy this book? The answer is a resounding YES! However, The Kindness of Enemies wasn't a book that I could simply finish reading and then set aside. There are stories within stories within stories in this book. There's Natasha's story, past and present; Oz and Malak's story, present; and, then there's the story of Imam Shamil. I was astonished to learn that Imam Shamil was a real leader in the anti-Russia movement in the 19th century. It was fascinating to read about his life, albeit a fictionalized version of his life, and that of his family. I enjoyed the blend of contemporary and historical fiction and the parallels found between the 19th-century and 21st-century storylines (trust me, there are a few...read it for yourself to discover just how many there are). The majority of the characters are all flawed and realistically portrayed. They all have their doubts and fears. This is not a story about being right or wrong or even having the right set of beliefs or not, it is about humans struggling to find their place in the world, do the right thing, and the perception of those struggles and behaviors by others. I get to read a lot of books, some good, some not so good, and The Kindness of Enemies is one of the best books I've had the pleasure to read this year and one that I strongly encourage you to read. I don't normally post a star-rating with my reviews, but I give this book five stars (yes, I really enjoyed it that much)."}, {"userName": "Tamara Agha-Jaffar", "userReviewDate": "Mar 12, 2016", "userURL": "http://www.goodreads.com/user/show/51003559-tamara-agha-jaffar", "userReview": "The Kindness of Enemies by Leila Aboulela weaves two interlocking stories set approximately 150 years apart. Beginning in Scotland in 2010, one story is of Natasha Wilson (aka Hussein), a professor of mixed Sudanese and Russian heritage, torn between her two cultures and trying to define her place in the world. The second story is of Imam Shamil, a Muslim leader and member of the Naqshbandi Sufi order, who lead the resistance to Russian occupation of the Caucasus in the mid-1800s. The thread that connects both stories is Wilson’s research on Imam Shamil and her discovery that one of his descendents is a student in her class. Aboulela skillfully weaves in and out of both narratives, taking the reader along with her at a breathtaking pace. There are twists and turns in the narrative, some of which are predictable. For me the value of the novel lies in its realistic portrayal of characters struggling to live according to their convictions and their subsequent disparagement by those who perceive reality through a different set of lenses. Aboulela reminds us the issue of truth and justice is seldom a simple question of either this way or that. Instead, it frequently straddles between the two paths and one has only to use a different set of lenses to begin to see the possible merit of an opponents’ point of view. The novel is well written, moves at a rapid pace, and sheds light on the challenges facing Muslims post 9/11."}, {"userName": "Tuck", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/565487-tuck", "userReview": "a favorite topic of mine is caucasus mountains area and this new novel promised a bit to fictionalize the saga of shamir freedom fighting against imperial russia in mid 1800's, and the thread ofhis son being given as collateral for treating, but was hustled off to st peterburg and became a russian military guy, a favorite of czar but a pawn and a tool, ultimately. meanwhile, this novel has a contemporary thread of scottish uni prof, origianlly from sudan, her dad sudan muslim, her mom russian, and this prof's writing about historical jihad in caucasus, and her prize student getting busted by cops for 'suspected islamic radicalization'so lots of good elements, but writing a bit melodramatic, lite on lit, and infuriating too, like: why didnt prof get a lawyer as soon as cops came and roughed her and star pupil's family up? (in usa the lawyer wouldnt been at cop shop before the suspects) why didn't prof fight for her uni intellectual freedom? she was 'assigned' and she 'volunteered' to be the faculty fingerer of 'possible' young candidates for radicalization. maybe in scotland professors do not have academic freedom? or freedom of association? maybe the world has gone mad about possible islamic type terrorists/freedom fighters and so employs state terror blithely ? oh bother, this novel has lots of elements that could be good, but were not that good, for me. but still, read it!"}, {"userName": "BookBrowse", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/2160619-bookbrowse", "userReview": "\"The concept of jihad has become synonymous with terrorism but when Imam Shamil, an honorable, even noble, character uses the term, he is describing the defense of his homeland, not aggression or acts of terror. In the contemporary storyline, Oz is arrested and his university career derailed, it appears, solely because of online research he conducts for a course. And although Natalie wants nothing more than to feel at home somewhere, it is clear in Aboulela's novel, that for a young, intelligent Muslim woman in the UK, feeling that she belongs is not as easy as it ought to be. At a time of international concern over terrorism and fears of jihad against non-Muslim nations, these threads that The Kindness of Enemies unearths, makes it a deeply humane, refreshing and insightful read.\" - Kate Braithwaite, BookBrowse.com. Full review at: https://www.bookbrowse.com/reviews/in..."}, {"userName": "Chaitra", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/9086236-chaitra", "userReview": "This is my first book by Leila Aboulela. It's also the first time I've heard of Imam Shamil. It's an interesting story, divided into two parts. The historical sections deals with Imam Shamil and his insurrection against Imperial Russia, and his major mistake - the kidnapping of a Princess of Georgia and her children, as hostages in exchange for his own son in Russian arms. The contemporary section tells the story of a Natasha Wilson, a Sudanese-Russian professor whose research is Shamil, and her interactions with a student of hers who is a descendant of Shamil. It's a story about people who struggle with identity, with religion and its confines, and with relationships. I enjoyed the prose and the pacing. The themes are heavy, and the characters do not always make the right choices but Aboulela writes with understanding and sympathy. A worthy read."}, {"userName": "Kate", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/536658-kate", "userReview": "This was a satisfying read with likable characters. It takes place in two historical times and geographic places: in the present, mostly in Scotland but with a trip to Sudan; and in the 19th century Caucausus, Georgia, Dagostan, and a little into Russia.Written in first person, the main character in the present is an academic and a scholar of Imam Shamil, an 18th century warrior and leader in the Caucasus. One of her students, Oz (Osama), is a bright star in her classroom with family connections to Shamil and who introduces her to his mother, Malak. She visits Malak and Oz in their rural home over the winter break and while there, a blizzard keeps them together and exchanging stories about Shamil. When they are finally able to leave the house, Oz is picked up by the police on suspicion of being a terrorist after visiting a website hosted by terrorists, throwing all three lives into uncertainty. The alternating story takes place in and around where Shamil and the Northern Caucasians are at war with Russia. Kidnappings and destruction of villages takes place. Shamil's son Jamaleldin is kidnapped and taken to Russia. Years go by and he is not allowed to go home. Shamil kidnaps Anna, Princess of Georgia, and her children and governess and takes them into the mountains while he negotiates his son's return. This is the second book I've read by Leila Aboulela and I've enjoyed both. This one gave me insight into another part of the world and world history, the mountainous region of the Northern Caucasus."}, {"userName": "Mike", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/3365766-mike", "userReview": "A nineteenth century Muslim hero fights for his son’s freedom during the Caucasian War. While in a second narrative, a professor questions her values after a promising young student is arrested on suspicion of terrorism. A multilayered novel with complex themes, which offered revealing insights into how Muslim people are and have been viewed by the West."}, {"userName": "Hassan hamdoun", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/1216174-hassan-hamdoun", "userReview": "when I started the book I was thinking it differently and as I went on, I couldn't stop being impressed by the rapid movement and epicness of Leila writing and beautiful mix of history, identify and culture.A story of faith, breadth of history, tolerance and belief. A story of what is home and how we can relate to it. A story of Khartoum, Aberdeen, Dargo, Caucasus and Kalugo,Petersburg and Georgia. A story of what we call home in: books, paintings, streets and memories..in teachers, spiritual moments and ruined old homes..in faith, in love and in conflict of identity.in belonging .. Kindness of enemies is vivd story of tolerance in the width of a long Russian-chechens war in the 1850s and its distant ramification in Khartoum and Aberdeen. Imam Shamil's long war with Russia and success in defeating a powerful empire, is a lesson in faith, patience and spiritual strength.You learn a lot about history form Leila's brilliant mix of facts and tour of places. You go in a journey where the caucasus becomes moving in your eyes with its mountains and toughness, khartoum with its humid and trees and Aberdeen's snow and breeze.  Imam Shamil's and Sheikh Jamal el-din teacher and student relationship is particularly inspiring.The spiritual purity of Imam Shamil, his honesty and integrity convey a an understanding of war and conflict that is unique and I must say, would be great for all of us to learn it ,in our current world full of wars. Imam Shamil teaches us tolerance differently, while coming from a spiritual sufi background. The Russian long war in Caucasus is full of lessons the world would learn a lot from.Leila's also shed an important light on sufism and the issue of terrorism. I have been fascinated by Leila's depiction of Natasha's culture and identity conflict. How one can live in two homes and relate to both satisfactory?..how one become confident in the existence of home when is away and is marginally belonging?..about belonging and love of home !one can learn to disguise as a teacher, an actor, a professional and a student ..a student who strives to connect, to fight own weaknesses and build on strength..\"Lord make me grateful and make me patient, Make me small in my own eyes and great in the eyes of the people\""}, {"userName": "Shahda Al Taie", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/52994384-shahda-al-taie", "userReview": "I absolutely loved this book! I did have some issues with some parts (particularly the present timeline), but I think the other aspects really made up for it!It had all the elements that I enjoy in a book - history, romance, royalty, war and a touch of internal conflict! I can't say enough to express how much I enjoyed the historic part and the interaction between Anna and Shamel. It was beautifully written by the brilliant Leila who knew how to slowly make me like Shamil and understand him as a character. Anna on the other hand, I almost fell in love with her character immediately. She is heroic in so many ways and I would have loved to see her explore Shamil's suggestion of making her the Queen of Georgia more, but I know that it would have taken away from the credibility of the story. I think that the events played out just right, especially since it is based on a lot of historical facts of the time. Now what did I dislike about the present day? The characters! They seemed too silly and troublesome! That being said, I do think that they do exist in this world and it gave a nice contrast to the story. I attended a reading of one of Leila's plays sometime back and I feel the similarities in her style. She also had a dual timeline and the topic of religion was a key theme in the play as well. Did I enjoy this book? I loved it!Would I recommend it? YES!!!"}, {"userName": "Shahd Fadlalmoula", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/5792045-shahd-fadlalmoula", "userReview": "Leila Aboulela, the lyricist and the poet comes out to play, full-fledged, in this novel.At first, I found the book slow, and her flash-fiction technique tiring. But soon, the little details she tucked into her prose became the detour to bringing the two worlds of her narrative alive! Her onerous descriptive style grew on me. I loved the overlap, and the subtle mirrors she layed out in the many layers of this story. The mirror between Natasha and Jamal, the mirror between Anna and Tony, the mirror between Jihad-the defensive war against oppressors and imperialists, and pseudojihad-the anger that remains when you are born to the imperialists but remain oppressed... and the mirror between different forms of radicalization and our own reality today... Then there is the internal Jihad strewn across the entirety of the book: the struggle to fit in, when you can't completely assimilate... the endless homesickness for a home that isn't geographically defined.. Aboulela does a fantastic job of hitting raw nerves. She mercilessly criticizes all that is beautiful and adorned about Sudan, and the West. She paints a picture of Islam on a foreigner's (non-Arab) tongue. She draws the picture of frustration, with skin color, with privilege, with one's self, and with absolutely nothing and everything all at once.I found Shamil's historic account more captivating than the current narrative , but the newer account by Natasha enriched the book. I could relate to the third-culture kid in Natasha all too well. Aboulela used Natasha to paint the image of self-hatred that many pure Sudanese feel against their \"Black African roots\", their obsession with fair skin and the elusive notion of privilege, and the constant strive to be what we are not. It was frustrating to be in Natasha's head! I couldn't tell who the Enemies were supposed to be, far from one's \"self\".In sum, I think the book is definitely worth picking up, even if only to appreciate the delicate skill with which Aboulela dances between time. But it is truly, and completely fulfilling when/if you get to hear what Aboulela is really trying to say with this story."}, {"userName": "sappho_reader", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/17068912-sappho-reader", "userReview": "It takes some courage to publish a book of this subject matter in today's political environment, especially from an author wearing a hijab in her official photo inside the dust jacket. As the title implies the characters in this book find themselves deep inside enemy territory for their ethnic and religious differences. The narrative is split into two threads: current day Scotland and mid 19th century in the Caucasus region. The sections about the Caucasus war between Russia and the Highlanders was well portrayed and interesting, especially considering that the conflict continues today in some form. But I felt the contemporary sections of present day Scotland were less developed. Leila Aboulela tackles delicate topics such as the surveillance of the radicalization of Muslims in Britain, although I felt this could have been expanded greatly and probably be the subject of its own book. In addition I thought how two of the characters shared the unfortunate names synonymous with terrorism today (Osama and Hussein) was a tad too much. Otherwise it was a refreshing take on a contentious topic."}, {"userName": "Anne Carlill", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/32532156-anne-carlill", "userReview": "Why did I really enjoy this book? Firstly, it is very topical at a time when western understanding of the Islamic world seems to be dipping. Secondly, the historical part is about an era and an area of the world, the mountainous Caucasus, that I knew nothing about so I relished the history it was teaching me. The main character is Natasha, a university lecturer with Sudanese and Russian parentage. Aboulela interweaves the contemporary tale, of a student accused of plotting terrorism, with the historical story of hill people, and their leader Imam Shamil, who in the early 1800s resisted attempts by the Russians to take their territory. It is good to see Imam Shamal written about in a sympathetic light to counteract some of the so-called historical accounts of him. I think this book has a serious place in the genre of  fiction informing about historical events  . I enjoyed one of her previous titles, Minaret, but I believe that she has found a higher level of storytelling here. My hope is that through this novel Aboulela will succeed in winning, what she has been nominated for more than once, a literary prize."}, {"userName": "Rah-zee-uh", "userReviewDate": "Aug 28, 2015", "userURL": "http://www.goodreads.com/user/show/19143295-rah-zee-uh", "userReview": "I have read all three of Leila Aboulela's previous novels - this one was by far the best. I bought this book over the summer, but was sufficiently irritated with the vapidity of the Oz character to put it down, and not pick it up again for some months. (I still think the story might have been richer, more purposeful, had the Oz and Malak characters been omitted from it altogether - although I appreciate what the author was trying to achieve).The rest of the book was much more readable - perfect for a winter evening. The message behind its historic depiction of Imam Shamil only really comes together at the very end. For that alone, it was the best read of my Christmas vacation, surpassing even Chigozie Obioma's 'The Fishermen' (gritty, hard hitting - but let's be honest, not much fun to read). Would definitely recommend this book, maybe even gift it to a few people. I suppose I am now running out of excuses - will have to read Tolstoy's Hadji Murad soon."}, {"userName": "Mainlinebooker", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/600545-mainlinebooker", "userReview": "What a captivating novel that reflects the periods of time when Caucasian Muslim highlanders fought Tsarist Russia's attempted takeover of their land.This is interwoven with a modern day story of a biracial woman, a product of Russian and Sudanese parents, teaching in modern day Scotland about the anti- Russian resistance movement. Both stories reflect displaced people, and both focus on issues of identity.I had a hard time putting this one down, as it was so much more, and integrally interwoven. I learned a great deal about Iman Shamil and understood the passion and fervor behind the fight in present day Chechnya.It is reflected the difficulties of being a modern day Muslim. Though this sounds dry, it is a far cry from it.I urge anyone to take a chance on this one.."}, {"userName": "Linda", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/39927690-linda", "userReview": "Antagonist is Natasha Hussein or Natasha Wilson, a half Russian and half Sudanese professor of Islamic studies who despised her last name because of Saddam Hussein so changed it to her Scottish step father’s surname, Wilson. Natasha is doing a research on the life of the Muslim leader, Imam Shamil, who led the anti-Russian resistance in the Caucasian War. As luck may have it, her star student, Osama Raja, who is called Oz or Ossie to hide bearing the same name as Osama bin Laden, is a descendant of Shamil. Oz invited Natasha to his house to meet his actress mother, Malak who confirmed the connection to Shamil and even showed her the sword Shamil fought with.Read more here:https://lindasyearlybookchallenge.wor..."}, {"userName": "Billy", "userReviewDate": "Jan 10, 2017", "userURL": "http://www.goodreads.com/user/show/2531812-billy", "userReview": "I liked this book. I bought it not knowing anything of Aboulela or the story and was not disappointed. The story was great and totally worth the read for that alone, but my favorite part, as an otherwise WASPy person, was how human and rational she made her Muslim characters. Whoa, Bill! You can't say that! Can he say that? I have no idea what goes on in the day-to-day lives of Muslims; I'm an American Atheist. Most of what I recognize as 'Islam' I get from popular media turbans, burkas, beards, explosions, guns, weeping as far as the eye can see. Aboulela crafted characters who weren't like that; they had substance. Her themes of humility and defiance were moving. I would recommend this to anybody."}, {"userName": "John Stotesbury", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/13526064-john-stotesbury", "userReview": "Aboulela produces a new novel only every 4-5 years, and this is her fourth. The first, The Translator, was an attractive start, but the intervening two have been perhaps more limited in scope. The Kindness of Enemies, however, is a great leap forward, well structured, and with a fascinating, even didactic, take on the 19th and 21st history between the Christian north and Muslim south. I would imagine that this volume will be regarded as both her best work to date and also extremely promising for her future writing"}], "description": "It’s 2010 and Natasha, a half Russian, half Sudanese professor of history, is researching the life of Imam Shamil, the 19th century Muslim leader who led the anti-Russian resistance in the Caucasian War. When shy, single Natasha discovers that her star student, Oz, is not only descended from the warrior but also possesses Shamil’s priceless sword, the Imam’s story comes vividly to life. As Natasha’s relationship with Oz and his alluring actress mother intensifies, Natasha is forced to confront issues she had long tried to avoid—that of her Muslim heritage. When Oz is suddenly arrested at his home one morning, Natasha realizes that everything she values stands in jeopardy.Told with Aboulela’s inimitable elegance and narrated from the point of view of both Natasha and the historical characters she is researching, The Kindness of Enemies is both an engrossing story of a provocative period in history and an important examination of what it is to be a Muslim in a post 9/11 world.", "title": "The Kindness of Enemies", "url": "http://www.goodreads.com/book/show/25785299-the-kindness-of-enemies", "average": 3.81, "cover": "https://images.gr-assets.com/books/1448570896l/25785299.jpg", "reviews": 123, "authors": [{"url": "https://www.goodreads.com/author/show/62372.Leila_Aboulela", "name": "Leila Aboulela"}], "type": ["Fiction", "Historical", "Cultural", "Northern Africa", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/25785299-the-kindness-of-enemies", "http://www.goodreads.com/book/show/25661804-the-kindness-of-enemies", "http://www.goodreads.com/book/show/26095275-the-kindness-of-enemies", "http://www.goodreads.com/book/show/28453102-the-kindness-of-enemies", "http://www.goodreads.com/book/show/30316216-the-kindness-of-enemies", "http://www.goodreads.com/book/show/206227.Minaret", "http://www.goodreads.com/book/show/107824.The_Translator", "http://www.goodreads.com/book/show/8965997-lyrics-alley", "http://www.goodreads.com/book/show/645818.Coloured_Lights", "http://www.goodreads.com/book/show/20926765-the-museum", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}