{"ratings": 22192, "userreviews": [{"userName": "Pouting Always", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "I love Pat Conroy and I don't think I could ever do justice when reviewing any of his books. His writing is always so rich and draws me in with it's vivid imagery and he always somehow manages to convey so much emotion through his writing that I always feel really affected by it even months after reading it. This book was excellent, the characters were deep and complex and the plot line was really heavy but well constructed. He managed to address issues like perceptions of masculinity and social hierarchy and nepotism so well. There aren't many authors who can do that so eloquently, tying in real world issues with a fictional world full of characters who are well developed and a plot line that makes me want to keep reading until I get to the end. Some of this book was really rough though especially the scenes with the hazing but I think it's really necessary to have that visceral reaction to the things happening in the story."}, {"userName": "Jana", "userReviewDate": "Dec 28, 2009", "userURL": "http://www.goodreads.com/user/show/2296903-jana", "userReview": "I'm a bit scared that I won't be able to describe how much I love this book and that I’ll screw up this review. Every time I have the same problem with Conroy. Every time when I finish reading ''him'' I have this properly deep ache. I get spoiled and I find myself measuring almost everything I’ve read so far. I even get angry because I know it will take a long and thorough research to find book(s), author(s) that could replace this Pat Conroy feeling. And I never do find them, I never managed. The major problem is - I always fall in love with his characters. On the other hand, he is so intense and if I were reading only his books and books of this caliber (which is again, impossible to find), I would only read four books per year. To give myself a little break from exhaustion.But when I start writing what I love about The Lords of Discipline, I am not able to stop. Conroy makes his story true and maybe this is over the top statement, but most of the time I feel like I am inside, like I’m in the book, feeling a bit embarrassed because I'm watching what is happening with his characters. BUT, luckily I've read enough reviews to know that I'm not alone in this.To add even more spice to this essay: it's a goddamn military book! I think the main reason why so many people relate is because it seems like you alone are experiencing all the things that are written inside. It really is that real. And scary. And you’re sad and lonely when the book ends, because you miss all of them. It’s a story about South Carolina Military Institute * aka The Citadel, in Charleston, in the fall of 1966. The main character is Will McLean, senior in that college, and he is one of the most amazing and best developed male characters I have ever come across in any novel. Will McLean hates the Institute, but he gave a promise to his father that he would graduate. During four extremely brutal and agonizing years he was psychologically, physically, emotionally and morally humiliated, degraded in every possible way a human can tolerate, or not tolerate, because plebe system during the first year makes you swallow blood and expect nervous breakdown. Final result if you survive is a satisfaction of becoming a Complete Man. Will is an Irish descendant, an athlete, majoring English (only pussies major languages), with brilliant dry sarcastic humor that is his shield against those who torture him. He is introspective and opinionated, but he has unimaginable sense for justice and fairness and he is wise beyond his years. He is shivering afraid of his demons and yet absolutely not afraid to point and admit them in a place where you have to hide everything. But, his major qualities are his morality and loyalty. He’s not the strongest, nor the toughest, and intellectually he could give a lot more if he only cared, but those vulnerable soft spots that he has as a character make him irresistible. He cares too much about people, and he thinks too much, and goes into such deep and complicated monologues where he tears himself apart that you as a reader push your limits as well, and this is what kills him. In a way he's a full circle person. This character is growing with each page and you grow with him. I had a serious crush on him. Obviously. Institute is the nest of hate, racism and cruelty and they have to accomplish their mission of developing the Complete Man without flaws, so it's vitally important to have somebody who will represent comfort, loyalty and security. Will has three best friends: Tadd, who comes from the wealthiest and oldest Charleston family, Pig, the strongest of all the seniors and Mark, Italian descendant. They are roommates and blood brothers. Off campus Will is less sure of himself, in his romance with peculiar and snobbish Annie Kate Gervais, a native of the beautiful city Charleston. Conroy knows how to put us on paper. He wrote 500 pages long poem to this Ashley river based city and those parts where he talks about Charleston are probably, if that is possible, the best parts of the book. It’s his love letter to Charleston and I often read passages out loud. But he is not a drunk writer, he doesn’t just praise and splendor it without giving it any flaws: he examines the beauty of the old South while he along the way harshly addresses racism and classes. From the beginning this book was intense but Will is just so powerful and attractive character that you live with him during the reading. He doesn’t trust himself at all and interrogates himself even more brutally than the plebe system does, but he has you on his side constantly, because you trust him from the start. And that’s f*cking rare. To find in real life, let alone to get yourself mesmerised by somebody 'who' is called - a fictional character. There is so much more to this book than my words could describe. It’s a masterpiece. Painful, insightful, heartbreaking, inspiring and stunning. It’s an ode to humanity, friendship and love. True masterpiece."}, {"userName": "George", "userReviewDate": "Jan 02, 2008", "userURL": "http://www.goodreads.com/user/show/716985-george", "userReview": "This would be the 3rd unforgettable book I've read by Mr. Conroy in the past year, and to date. I just love reading his work. There is no other way to put it. He just simply writes, in my humble opinion, the most beautiful sentences I have ever read. He has an unflinching capacity to be so brutally honest it often hurts. But it is the greatest pain one can recieve from a great novel. The amount of passion, pain, and pure adrenaline within the pages of this book will not let the reader put this one down. I promise!"}, {"userName": "Muhammad K", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/47573945-muhammad-k", "userReview": "“The objects you valued defined you.” (Page 376, The Lords of Discipline by Pat Conroy). Friedrich Nietzsche said, “There are no beautiful surfaces without a terrible depth.” The Lords of Discipline by Pat Conroy is able to demonstrate this with meticulous detail. It focuses on Will McLean’s dark experiences in his last year at the Carolina Military Institute, a school where administration turns the other cheek to vicious hazing practices designed to produce “real men.” This is a story about love and hate, and how these two values we associate with everyday objects, ultimately shape who we become.In this novel, the reader is put in the shoes of Will McLean, a senior at the Carolina Military Institute. He is able to endure and survive the brutal tests of “plebe year,” through his humor and wit. However, in his last year at the institute, Will is assigned to assist the institute’s first black student, Tom Pearce, in overcoming his “plebe” or freshman year. It is during this process that Will comes face to face with a sinister organization, the driving force behind the hazing culture of the institute, which singles out and targets specific individuals they consider outside their notion of \"ideal graduates.\" Through this turbulent journey, Will experiences the realities of institutional racism and other social hierarchies. While struggling through these bitter experiences, Will also finds the first love of his life. She adds beauty and purpose to his life, counterbalancing the ever-growing struggles at the institute. The book’s intent is to reflect on the brutality of society, and the plebe system is a perfect illustration of the vicious social hierarchies that are embedded in society. The casual use of profanity as a means of degrading people shows how Pat Conroy does anything but sugarcoat the realities of the military academy. To some, this extreme use of lewd language may seem morally objectionable. However, I personally believe such details are integral to the books theme. These expressions of extreme hate and love are very real, and abstracting away from them would dull the stark message of the book. The plot was slow to develop, but once established, it was impossible for me to put the book down. Pat Conroy’s use of detail immersed me deep into Will McLean’s life. The use of vivid details forced me to become closely attached to the characters, their struggles and their emotions at every turning point in the story became mine. I believe this book has particular value for the two extremes of the social spectrum. I would recommend it to those struggling to come to terms with who they are, since this book serves as a support in their isolation by giving accounts of those who have overcome their isolation. This book is also an important lesson for those in position of authority, it would show them the profound effect their actions can have on the lives of those around them. In conclusion, The Lords of Discipline is an insightful read. It presents a non-fairytale version of the society we are all a part of. We must all deal in some way or another, with the truths this book features, in order to truly value that which we love and hate."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "Wow. A really in depth novel about life for young men in a military school. Hilarious, tragic, and sobering, THE LORDS OF DISCIPLINE is one of the best books I've ever read."}, {"userName": "✨Susan✨", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/21276121-susan", "userReview": "Wow this is a rough Read. Interesting what was expected or accepted during the Vietnam War. There was no room for the week. These young men were put through rigorous and demeaning torture that was definitely the actions of ruthless young men that had a history of violence or abuse in their younger lives. The power hungry, older officers should have been charged with Conduct Unbecoming an Officer and a Gentleman. On the flip side there was a group of friends that were very loyal to each other...or were they? Good writing, characters and narration."}, {"userName": "Buck", "userReviewDate": "Jul 18, 2008", "userURL": "http://www.goodreads.com/user/show/1342576-buck", "userReview": "I was introduced to this book at Pat Conroy by my high school algebra teacher. She was reading the book just after it came out and suggested that we all read it. I think I may have been the only one who did.I immediately fell in love with this work. Conroy's descriptions of Charleston are priceless. Some of my favorite quotes come from this book.I return to this work yearly to explore my old friends once more and with each reading I find a nuance that I had overlooked in the past.From the opening passages where Will McLean says that \"walking the streets of Charleston in August is like walking through gauze or inhaling damaged silk.\" To the tragic, yet triumphant ending this book remains a fascinating snapshot of a period in southern history that is both specific and timeless.A wonderful primer on the love/hate relationship many intelligent and progressive Southerners have with their own beloved part of the world."}, {"userName": "Steffany Cartellone", "userReviewDate": "Jan 05, 2008", "userURL": "http://www.goodreads.com/user/show/746814-steffany-cartellone", "userReview": "I love Conroy's humor in this book, the way he uses it to diffuse some incredibly raw scenes. I cried so hard when Pig walks down the line and the men turn their back on him. And then the train. Ugh. It absolutely broke my heart. I love all of Conroy's books for their descriptions, for introducing me to the beautiful South, and for his characters. He has strong people with strong issues which makes them real. And the men are vulnerable and strong and that's not something you see in many books. Thank you Pat Conroy."}, {"userName": "Michael", "userReviewDate": "Nov 19, 2007", "userURL": "http://www.goodreads.com/user/show/629059-michael", "userReview": "I read this book over the course of two days in September 2000. I could not put it down. It was recommended to me by a friend who attend The Citadel. I rarely read books as fast as I read this one. I highly recommend it."}, {"userName": "Anne  (Booklady) Molinarolo", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/3615945-anne-booklady-molinarolo", "userReview": "Pat Conroy has done it again! He drew me into The Lords of Discipline both visually and emotionally. I thought I was right there with Will McLean. \"I wear the ring.I wear the ring and I return often to the city of Charleston, South Carolina, to study the history of my becoming a man. My approach to Charleston is always silent and distracted, but I come under full sail, with hissing silk and memories a wing above me in the shapes of the birds... But to me, Charleston is a dark city, a melancholy city, whose severe covenants and secrets are as powerful and beguiling as its elegance, whose demons dance their alley dances and compose their malign hymns to the side of the moon I cannot see...\"He goes on to say that he's not a good person, and we won't like him after he finishes telling us his story. Oh, Mr. McLean, how you are wrong, sir! I liked you at the beginning and loved you at the end. You were brave, maybe a little narcissistic. But you absolutely did the right thing. However, I did wonder about you and your judgement when you said this: \"Anyone who knows me well must understand and be sympathetic to my genuine need to be my own greatest hero. It is not a flaw of character; it is a catastrophe. I have always been for the underdog and I’ve pretended it was because I was sensitive and empathetic, but that’s not it at all. It was because I wanted the adoration of the underdog, the blind approval that the downtrodden so gratefully bestow on their liberators. It was all paternalism, my insatiable desire to be the benevolent tyrant dispensing tawdry gifts and moldy foodstuffs to the subjects who stumbled into the spiritual famine of my sad kingdom.\"And that's when you chose to be friends with Mark Santuro, Dante \"Pig\" Pignetti, and Mr. Tradd St. Croix. I was leery of the \"Honey Prince.\" All 4 of you had become blood-brothers, but not all of you had y'all's best interests in his heart. The Ten and Charleston have those secret and beguiling covenants.The Lords of Discipline is set in Will McLean's Senior year at the Carolina Military Institute in 1966-1967. The Viet Nam War is beginning to ratchet up. The boys who enter the Institute, leave as men. Shaped by a code that is strict and what the secret organization, The Ten, believes a man should be.“The Ten are selected to preserve the purity and integrity of the Corps of Cadets. They take an oath to uphold the traditions of the Institute at any and all costs. I was told that The Ten has a powerful lobby in the state legislature, that they are influential in contributing money to any political candidate deemed favorable to the Institutes interests, and that they watch individual members of the Corps carefully to make sure that no one graduates who is unworthy to wear the ring.”Before you start thinking this is good, stop. Boys are hazed horribly. They are abused to their breaking point, so they're empty. That emptiness is refilled with discipline, physical strength, pride, worthy to wear the ring.\"I will take you down my own avenue of remembrance, which winds among the hazards and shadows of my single year as a plebe. I cannot come to this story in full voice. I want to speak for the boys who were violated by this school, the ones who left ashamed and broken and dishonored, who departed from the Institute with wounds and bitter grievances. I want also to speak for the triumphant boys who took everything the system could throw at them, endured every torment and excess, and survived the ordeal of the freshman year with a feeling of transformation and achievement that they had never felt before and would never know again with such clarity and elation.\"Will takes us back to his Freshman year, when he was a knob or Plebe. He and his 3 roommates were subjected to a stiffer Plebe system that bordered on torture with a capital T. Then the second 2/3's of the book is devoted to what happened in his Senior Year. If Bear hadn't asked Will to look out for the first black cadet of the Institute, this year would have been much different. Or would it have been? There would still be the coming of age story, loyalty, betrayal, first love, Charleston's prejudice. But would all 4 have survived? The Ten was a vile group of human shit that looked and walked like Cadets and Men of Power. Beware of the dog who has had enough of its Master's abuse - it will attack, going straight for the jugular."}, {"userName": "Caley Rogers ", "userReviewDate": "Feb 02, 2008", "userURL": "http://www.goodreads.com/user/show/834022-caley-rogers", "userReview": "Fantastic book! Pat Conroy does an excellent job conveying the life of a student at Carolina Military Institute (based on the Citadel). Conroy has a wonderful writing style that really enables the reader to visualize everything in the novel, from the atmosphere of Charleson to the vicious beating the cadets endure. The book is told from one boy's point of view and begins with his senior year, but has flashbacks to his earlier years. While you may flinch at the violence that is tolerated at such a school, you really understand the pull of becoming an \"Institute Man\" and the internal struggle the main character has with becoming such a thing."}, {"userName": "Drew", "userReviewDate": "Dec 10, 2007", "userURL": "http://www.goodreads.com/user/show/669275-drew", "userReview": "This is quite simply my very favorite book of all time. Pat Conroy draws upon some of the events of his days as a cadet at The Citadel to tell the story of Will McLean, a senior who attends the fictional Carolina Military Institute in Charleston, South Carolina on a basketball scholarship. Will is charged with shepherding the Institute's first black cadet, Tom Pearce, through his freshman year at CMI. In Charleston, South Carolina, in 1967, Pearce is being welcomed through the Gates of Legrand with something short of open arms.The school's Commandant of Cadets, Colonel \"The Bear\" Berrineau asks Will, whose political beliefs are decidedly liberal, to keep tabs on Pearce and offer him whatever assistance he can in avoiding \"The Ten,\" a mysterious group consisting of a cadre within The Cadre, a small contingent of the cadet corps which dedicates itself to removing any cadets which it deems to be unfit to wear the institute ring. Will's only allies are his roommates, Tradd St. Croix, an affluent Charleston native whose father graduated from The Institute and who will meets while struggling through \"Hell Night,\" a cadet's first night on campus, Dante \"Pig\" Pignetti, a loyal body builder from Brooklyn and Mark Santoro, an intelligent and pragmatic boxer from Philadelphia. Will also encounters Annie Kate Gervais, a Charleston girl from a well to do family, who has her own secrets and with whom Will gradually begins a relationship.Conroy recalls the Charleston of his college years with precise and affectionate detail. He knows the city and its oldest institute of higher learning quite well. The reader is graced with a vivid depiction of life in the barracks for The Citadel's attendees during possibly its most brutal and demanding era, that of the war in Vietnam.This is a rare work of intelligence, humor and emotion. Its most central theme, the enduring bond of friendship, is rendered with impressive and quite remarkable resonance. Conroy estabishes himself as one of the truly great American writers with this work."}, {"userName": "Marialyce", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "Oh wow, just wow.....I know that I should be the president of the \"I love Pat Conroy fan club\", but this book was just in a word fantastic. I went through the gauntlet of emotions while reading this story. Mr Conroy remains in my mind the consummate story teller. He lays his emotions out in the open and fills his characters with such reality that you would know them if they walked into a room in which you were seated.This book about a young man's coming of age while enrolled in Southern military schools, was filled with pathos, love, and an understanding that it is more than a uniform that makes one a man. Will was a wonderful protagonist, a young man full of the joy and wonder of being part of tradition. He always managed to overcome those who seemed against him often using wit and later a shrewdness that would come from the many heinous things he witnessed and was subjected to while he was was attending the Institute. While some might say that Conroy is an emotionally overwrought author, I believe him to be brilliant. He touches my spirit in so many ways and makes me always want to savor his novels. I am devastated when they end and I am left floundering trying to find something that could possibly measure up to what I have just read."}, {"userName": "Amy", "userReviewDate": "Jan 07, 2009", "userURL": "http://www.goodreads.com/user/show/1710557-amy", "userReview": "This is one of my favorite Conroy books, though the subject matter isn't easyfor those of us who know The Citadel, but there's much that's true about it back in the day. It's a different place now, though. My son read 18 pages of it and announced he knew who the best living author in SC is. I have multiple copies on my shelf as I believe in spreading a good thing. Some people, however, were less than thrilled with this book. It made it to a Banned/Challenged Books list. It was challenged in the Cobb County, Ga. schools (1992) for profanity and descriptions of sadomasochistic acts. Removed from and elective English course by the WestonKa, Minn. School Board (1992) due to parental complaints about language and sex in the book. And some Citadel alumni objected to it, too. Imagine that!I support freedom to read. Read more about banned books at The Forbidden Library and the  American Library Association."}, {"userName": "James Aura", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/25078753-james-aura", "userReview": "Powerful and wonderfully told through the memories of a young man who experienced the hazing culture of a southern military college. Conroy said the school was a composite of several schools, but it strikingly resembles the Citadel in Charleston, SC where the story takes place. Great characters, memorable action, and Charleston is so well described the old city serves as an additional character in the plot. Powerful suspense and a satisfying ending. Conroy was a master."}, {"userName": "Kathleen", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/39134508-kathleen", "userReview": "THE LORDS OF DISCIPLINE by Pat Conroy and performed by Dan John Miller includes a New Introduction read by the author, Pat Conroy. Mr. Conroy explains that this book was banned for years in schools and institutions in the USA. Pat Conroy has me sympathizing with the freshmen as they are bullied and hazed all year long. Many of the boys cannot endure the torture and leave the institution; one takes his own life. The badgering and vile language is very difficult to hear and I often needed to stop the reading or turn the volume to nearly off until the rampage was over. I realize that Mr. Conroy's writing is giving the reader a true picture of how things were for the cadets in training at the institute. Due to the abundance of swearing in this novel, and I abhor hearing swearing even more than I dislike reading swear words, I gave this book only 3 stars."}, {"userName": "Bill", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/810550-bill", "userReview": "54% in and I just can't do it anymore.Hard to believe this is the same guy who wrote The Prince of Tides, and I'm so thankful I hadn't read Lords of Discipline before that because there is no way I would have read Pat Conroy again.The Prince of Tides was immensely readable. Fantastic characters, and an even narrative that made it such an absorbing read. While Lords of Discipline had fine characters, the narrative was, at best, uneven, and in dire need of a good editor.Sprawling and highly repetitive descriptions of Charleston are thickly spread throughout the novel (well, at least for the first 54%). After you've wallowed in the descriptive mire, you are once again rewarded with dialogue. The term staged dialogue came to mind as I was reading this. It was awkward, and at times corny, particularly where Pig was concerned. Speaking of Pig, the character he immediately brought to mind each time someone said something inappropriate in the presence of his picture of his girlfriend Ethyl Theresa, was Moose from the Archie comics.The only thing that kept me going as far as I did was Conroy's spectacular storytelling skills in Prince of Tides. Unfortunately, the redundant descriptive prose and corny dialogue were too much to get through. My tolerance finally eroded and I had to put it down and move on to something I would fully enjoy.What a let down. It'll be a while before I read him again."}, {"userName": "George", "userReviewDate": "May 05, 2014", "userURL": "http://www.goodreads.com/user/show/1021218-george", "userReview": "BRUTAL. HAUNTING. SUBTLE. COMPELLING.\"Cruelty was an easy sport to master when practiced anonymously.\"—screen 971Any atrocity is okay if it's done for the sake of the tribe.THE LORDS IF DISCIPLINE, by Pat Conroy, is one of the most compelling, 'hard-to-put-down' novels I've ever read. It brutally probes the subtlest nuances of honor, of integrity, of character, of cruelty, of callousness, and of fear.How have I missed reading this incredibly haunting story, first published in 1980, for thirty-four years?Recommendation: A 'must read'.\"...I was a lone, absurd, figure in the history of my times, a sleeper in the history of ruthless law, of bombers over suburbs, of artillery barrages destroying the gaily painted walls of kindergartens.\"—screen 1147iBook digital edition, 1,337 screens (<> 561 pages)"}, {"userName": "David", "userReviewDate": "Jun 13, 2008", "userURL": "http://www.goodreads.com/user/show/977182-david", "userReview": "Rare indeed is it that I, someone early to bed and late to rise, finds himself wide awake at 1:30am unable to even consider going to bed until the book being read is finished. This almost unbelievable scenario took place last night as I kept turning the pages of this book.This is the 3rd or 4th Conroy novel I have read to date (I have my Losing Season on the shelf) and it is without doubt the best so far. The characters, the dialog, the quality of the plot, and the intensity of the writing is a notch above the others. I found it thematically the most clear and therefore the most satisfying in that regard as well."}, {"userName": "Claudia", "userReviewDate": "Apr 26, 2008", "userURL": "http://www.goodreads.com/user/show/70211-claudia", "userReview": "One of my students was being recruited to play football at the Citadel, the fictional setting for this book. I told him I couldn't let him go until he read this book. Conroy's said this book is the reason for years he was not welcomed to the campus. Now it's included in the curriculum. Deep, rich, eloquent. I loved this one."}, {"userName": "Patricia Kurz", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/1026048-patricia-kurz", "userReview": "Only because it's Conroy is it 3* -- else 2... I know that this book is the foundation for most of Conroy's story telling, but I have to say, that perhaps because of his immaturity in his writing career at that time, it is poorly edited and a bit self-inflated. The descriptions of some of the initiations of the military school were so repetitive, so boring, that after a while, one did not experience the horror any longer. The plight of the African American kid could have been so much more deeply mined but he was just another among the ranks. Pat Conroy is one of my favorite contemporary writers, but I find one thing I consistently dislike in his stories. He (the protagonist) is ALWAYS better than everyone else in the book. He is NOT a racist, he will NOT participate in the torture of plebes, he is smarter than everyone in school, he is the most well liked and the most morally tortured of all the boys. There is a psychological aspect to this consistency, I believe. I think that we write so that life is as we wish it were. I think we write to show how things could've should've been. But all of Conroy's protagonists take the high road about 90% of the time, which means either 1) that to align ourselves with the protagonist we are condescending to the other, less morally straightlaced than we are or) that Conroy is rewriting his personal history and portraying a character he wishes he had been. I am not indicting Conroy for any of this, not accusing him or being judgmental. I am trying, as a reader, to understand where he wants me to end up when the story is done. Pat Conroy is a treasure, a tremendous and emotional writer. I should do so well myself. I am trying to understand where his dreams come from and how he translates his own history into his characters. On the other hand, how do we know which of his characters a writer is using to portray himself... maybe it's not the protagonist who represents the writer. Maybe it's the monsters that appear in all the others."}, {"userName": "Ella Burakowski", "userReviewDate": "Sep 19, 2010", "userURL": "http://www.goodreads.com/user/show/2675870-ella-burakowski", "userReview": "Pat Conroy is to words as Beethoven is to music. In Lords of Discipline, Conroy spins a tale filled with torture, degradation, lies and deception all in the venue of a US military academy whose purpose is to create men of honor. The time is 1966 in Charleston, North Carolina. The story revolves around 4 boys at the \"Institute\" - roommates. They have created their own cacoon and deep friendships in spite of all that is going on around them. The protagonist, Will Mclean, has suspicions of a clandestine cartel of hand picked students called \"The Ten\" who take torture and hazing to a whole new level for the sole purpose of eliminating students not worthy of graduating from the academy. He makes it his goal to discover if in fact they exist, and if so, to expose them. His journey takes him to places which have dire consequences, not only for members of the Institute, but within the bonds created between these four boys. The story is disturbing and powerful and impossible to put down. An excellent tale nestled amongst words unmatched by most authors. It left me wondering how much of this story is based on fact. I understand a movie was made of this book, but it was made in England as no US military academy would allow filming of such an unflattering and negative depiction of their schools."}, {"userName": "Karen", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/5118619-karen", "userReview": "I adore Pat Conroy to a degree that is fanatical. He writes the most beautiful sentences about the most heartbreaking yet real human relationships I've ever read in contemporary fiction and non-fiction. This is my favorite of his novels, but I haven't read them all and that could change as I read more and as I age. Perhaps I love this book so much because all the conflict and action centers around a tight-knit group of friends, or maybe it's because the central characters are in college--as I was when I read it. Something about this novel resonated more deeply in me than his others have. I think I need to re-read it. Nearly half a lifetime later, it would at least make for an interesting exercise in comparison. I've heard there is a movie adaptation of this one, like several other Conroy novels and his memoir The Water is Wide have all been adapted for film. I have also heard that it is a horrible film, not worthy of the beautiful, suspenseful story he crafted in the pages of this book."}, {"userName": "Keenan Johnston", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/18128177-keenan-johnston", "userReview": "One of the best books I've read this year. Could not put it down.I write this one week before I head to The Citadel to witness my brother receive his Citadel ring, so have some decent perspective, though nothing like actually going through 4 years at The Citadel. The Citadel is an incredibly unique experience, unparalleled with any other college experience. I can't ever know what exactly it is like to be a cadet there, but this book hits on all the emotions I would imagine in such a beautiful way. Courage, pain, fear, pride, dignity and triumph for anyone who wears the ring.If you know anyone associated with The Citadel or ever visit Charleston, this is a must read. Absolutely loved this book."}, {"userName": "Annie Myers", "userReviewDate": "Jun 24, 2007", "userURL": "http://www.goodreads.com/user/show/120582-annie-myers", "userReview": "A powerful, moving story written in Conroy's trademark poetic style. Some parts of it were harder for me to read than even the descriptions of mental illness in The Prince of Tides, or the Holocaust story woven through Beach Music. I found it immensely disturbing that young men could be so cruel to one another. I was impressed by the way Conroy captured and portrayed the inconsistency and confusion of the main character, Will, bearing in mind that Will was a young man between the ages of 18 and 22 throughout the course of the story."}, {"userName": "Sean Chick", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/5936947-sean-chick", "userReview": "At times long and propelled by overly florid language and pointless asides. Yet, there is a loving poetry to this complicated tale of honor and manhood. I could write a whole paper on why this book was so moving but time is lacking now. Suffice to say, I loved this book when I was 14. It opened my eyes, it was the start of a slow rebellion against the conservatism I was force fed in the bosom of the west bank of New Orleans. Now, it is like a wise reflection of a time and a world I did not know but could feel in my bones."}, {"userName": "Tom", "userReviewDate": "Dec 31, 2007", "userURL": "http://www.goodreads.com/user/show/729365-tom", "userReview": "The title of this book makes it sound like Fabio should be posing on the cover. However, the book is absolutely riveting. It's about Will Macleans's trip through four years of The Citadel, the military college in South Carolina where Pat Conroy did in fact go. It's structured around his task of trying to assist the first black cadet to enter the citadel, but is mostly about Will's friendships and battles against the more sadistic members of his class."}, {"userName": "Adrienne", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/2961726-adrienne", "userReview": "Even my least favorite Pat Conroy books are still really good books. This one was a little too graphically and persistently brutal for me, but still incredibly evocative. Every Conroy book is like a little treasure hunt where you look for clues about his own life and influences. This one was semi-autobiographical just like all the rest."}, {"userName": "Shelli", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/1561203-shelli", "userReview": "An excellent read. Pat Conroy is an amazing writer and story teller. This is a fictional account of a cadet at Carolina Military Institute in the late 60's....based on the author's own experiences at The Citadel during the same time. While difficult to read and even more difficult to digest at times, this should not be missed. Riveting!!!"}, {"userName": "Hamzah Jhaveri", "userReviewDate": "Sep 12, 2015", "userURL": "http://www.goodreads.com/user/show/46926280-hamzah-jhaveri", "userReview": "Incredible.In The Lords of Discipline, Pat Conroy describes the epic tale of Will McLean, a senior attendee of the South Carolinian military school, the Citadel, or more commonly referred to as the Institute. He gives several first hand accounts of the lengths of hazing in which the school has housed since its early founding, including a detailed section dedicated to his cringeworthy freshman or \"plebe\" year.The book focuses on Will's task of looking after the Institute's first African American student, Pearce, who was bound to be abused by most of the students since his first steps through the Institute gates. This tragic story of camaraderie and betrayal, love and abuse, submission and resistance is simultaneously comical, dramatic, and heartbreaking.As Conroy looks through the lenses of Will McLean and describes him getting lost in the beauty of Charleston, I guarantee every reader is getting lost in Conroy's immaculately worded sentences. His descriptions are beyond physical - he has officially found a way to fully immerse every sense and more in each aspect of the story.\"I was not one of those victims, at least not at first. I was not ugly or thin or obese or pimply. I did not limp or stutter or cry in front of them or lose my temper or pass out after doing twenty pushups.\"The very substance and soul of the book is spoken in this quote by Will McLean. In my opinion, the ideology of the book is the battle between conformity and anti-conformity. The Institute spits upon the idea of individuality, clearly expressed in its own architecture consistent of congruent arches, identical structures, and trite promenades. The abusive upperclassmen always chose to \"run out\" the underclassmen who didn't fit or choose to fit the standards that clearly defined an Institute man. College should be about finding oneself, but in the Institute, if one is a confident individual that refuses to be a part of a bigger group, then that person is bound to be booted.The vulgarity of several passages throughout the book caused it to land on a plethora of banned lists throughout the country. Personally, I feel the crude language and cringing descriptions were necessary for Conroy to convey the validity of the story and for him to reach a true point of disclosure with his own experiences at the Institute.Another reason for controversy regarding the book was the calling out of the social class structure of America's Southern society. Many a times Will's roommate, Tradd St. Croix, and especially Will's temporary lover, Annie Kate Gervais, and her mother often looked down upon Will for his unimportant family name. They received special treatment, as if they were American royalty, all because of their surname. I feel this culture of southern society was described painfully truthfully, which most likely personally offended many southern readers.Looking past the objections of the book, I personally could not put it down. If one is looking for instant satisfaction of reading an excellent story, I wouldn't recommend it. But if one craves a lengthy, convoluted, descriptive book that may take 400 pages to get to dramatic action, I strongly recommend this book. Specifically I would recommend this book to troubled teenagers as it is an excellent lesson of what conformity will lead to. I feel that this book is a must for students that are struggling with coming out with their own problems."}], "description": "The bestselling Pat Conroy novel—now available as an ebookAmid the social upheaval of the Vietnam War era, a young cadet at a southern military college must face down a racist secret societyAs Will McLean begins his studies at the Carolina Military Institute, antimilitary sentiment is raging and the American South is in turmoil over desegregation. An outsider to the harsh authoritarianism of the military, McLean survives his freshman year despite the school’s notorious hazing, and avoids attention from its fabled and menacing secret society, the Ten. But when he becomes the mentor of the school’s first black student, Will is drawn into the intense racial politics—and the simmering threat of violence—that lie just beneath the surface at the Institute. Featuring Conroy’s lush prose and richly drawn characters, The Lords of Discipline is a powerful story of a young man’s stand for justice and the friendship, love, and courage that he finds along the way. This enhanced ebook edition includes four documentary-style original videos. These videos illuminate how Conroy’s experience at the Citadel shaped this novel; how Conroy’s mother inspired his love of reading and writing; Conroy’s role as the protector of his mother and siblings while growing up in an abusive household; and Conroy’s loving relationship with his wife, Cassandra.", "title": "The Lords of Discipline", "url": "http://www.goodreads.com/book/show/13566347-the-lords-of-discipline", "average": 4.29, "cover": "https://images.gr-assets.com/books/1428695240l/13566347.jpg", "reviews": 1202, "authors": [{"url": "https://www.goodreads.com/author/show/6942.Pat_Conroy", "name": "Pat Conroy"}], "type": ["Fiction", "Historical", "War", "American"], "outlinks": ["http://www.goodreads.com/book/show/13566347-the-lords-of-discipline", "http://www.goodreads.com/book/show/12067674-the-lords-of-discipline", "http://www.goodreads.com/book/show/85443.The_Lords_of_Discipline", "http://www.goodreads.com/book/show/129946.The_Lords_of_Discipline", "http://www.goodreads.com/book/show/17560720-the-lords-of-discipline", "http://www.goodreads.com/book/show/17590133-lords-of-discipline-the", "http://www.goodreads.com/book/show/8895157-the-lords-of-discipline", "http://www.goodreads.com/book/show/1423660.The_Lords_of_Discipline", "http://www.goodreads.com/book/show/16735.The_Prince_of_Tides", "http://www.goodreads.com/book/show/16729.Beach_Music", "http://www.goodreads.com/book/show/6135237-south-of-broad", "http://www.goodreads.com/book/show/85448.The_Great_Santini", "http://www.goodreads.com/book/show/129947.The_Water_is_Wide"]}