{"ratings": 128538, "userreviews": [{"userName": "Jayson", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/22106879-jayson", "userReview": "[with a rescue plot practically a beat-for-beat mirror of the first book (hide spoiler)]"}, {"userName": "Ahmed  Ejaz", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/53694260-ahmed-ejaz", "userReview": "No matter what dimension you're in, there's a big-headed male trying to take over the world.   I wasn't expecting this. I was trying too hard to like this book. But I couldn't. I just couldn't! :( ☆3.5 Stars☆ For God Sake, Eoin!!! Change the pattern. I have guessed by now how you will start the book. Of course, after reading the last four books of the series. So I was bored in the beginning except for one thing. There was action and little excitement. Or I also consider the excitement in this was slightly unnecessary. Maybe it's just me?? Don't know but I was feeling just like that. The most important thing of my dislikes is the Villain. I couldn't connect with her. I liked Opal Koboi more.Nevertheless, I enjoyed after the beginning. It wasn't that bad but wasn't that good as compared to the previous books of the series.January 14, 2017"}, {"userName": "Mahdi Lotfi", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/52374183-mahdi-lotfi", "userReview": "آرتمیس فاول این بار به سراغ دیو ها که خانواده ای ازجن ها هستند و بعد از نبرد تیلت حاضر به رفتن به زیر زمین نشدند و جزیره ی خود را به برزخ منتقل کردند،می رود.امّا در این حین دختری به نام مینروا یکی از دیو ها را می دزد و آرتمیس و دوستانش به نجات دیو و جزیره ی دیوها که هایبراس نام دارد می پردازد.و..."}, {"userName": "Nestle", "userReviewDate": "Sep 03, 2007", "userURL": "http://www.goodreads.com/user/show/338658-nestle", "userReview": "I was ecstatic when i bought the new release just last year! Here i thought that there would never be another person who could match artemis fowl and here pops up a Pretty, 12 year old French Prodigy! Who Artemis seems to be really attracted to! I must say that i am very excited for these two geniuses! A girl version of Artemis Fowl named Minerva! what a coincidence in names! The girl seems to be definately artemis' match! Well, Minerva, at this age is just like Artemis when he was 12 years old, always thinking about power and fame.I pitied Artemis at the end of the story.. because he just missed almost 3 years of his supposed to be life... So... 12+3=15... Minerva and Artemis are supposed to be of the same age now!!!I am quite positive that they will both work together at the last book! and i am really really excited for it!"}, {"userName": "Cassie", "userReviewDate": "Jan 09, 2008", "userURL": "http://www.goodreads.com/user/show/437476-cassie", "userReview": "Artemis Fowl: The Lost Colony is the fifth book in the series, and I personally think that everyone who loves Harry Potter should read these books. Better written and with more intelligent contemplation of elements like magic and technology, this is a series that readers of all ages can enjoy. By book five, we’ve been introduced to a wide and fun cast of characters, and unfortunately had one of our good friends die. There is no over-arcing plot between books, though there are certainly continuing themes and characters, so a reader can pick up the series at any point. I’m a big fan of starting at the beginning, but this is a series that could actually be read from any book.While I think this book is much more complex and thought-out than many books I’ve read, I did feel that in comparison with the rest of the series, this book just wasn’t as good. I was excited when I got it, drove an hour away to the nearest bookstore to find it, started reading right away, and then I ended up putting it down later that day in favor of watching Veronica Mars . It just didn’t keep my attention like the other books had, and the spot where I drifted away for about two weeks was the same spot that my editor drifted away at too.Still, if you like the other books, you’ll want to read this one and not give it up. The second half of the book is far more interesting and the ending made me jump up and down with joy for what is being set-up for the next book. It’s kind of nice to have an Artemis Fowl book that I’m sure will have a sequel, since the last few books have ended on more questionable notes. Maybe that was part of the problem with this book, because the last book ended on a note that didn’t *need* a sequel, so this book didn’t have as much of a place to start off from.Read the rest of my review at  Bookwyrm Chrysalis"}, {"userName": "Adibah Atiqa (elentiyareads)", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/67283364-adibah-atiqa-elentiyareads", "userReview": "my Artemis Fowl's reading playlist : https://open.spotify.com/user/debbyhattan/playlist/1rQmLp9EHxnQwB72zHGgSk\n“Control puberty?\" snorted the bodyguard.\"If you manage that, you'll be the first.”\nThis book literally got me cracked up when it comes to the humor of Artemis' stage of growing up xD How smol and so innocent he is back then from the very first book till now the sixth. So memorable to follow up his journey. \n“If it looks like a Dwarf, and it smells like a Dwarf, then it's probably a Dwarf or a latrine wearing dungerees.”\nKind of a bit disappointed for not having enough Mulch in this book but surely, introducing new characters, new world to explore of knowing new species -demon is quiet good track for filling the series. I love Number One, he is so lost yet feeling alone despite being rare he still believed he have something so much more and yes, HE DID ! I truly feel him :')))))\n“Just what we need,\" moaned Holly. \"Artemis Fowl with magical powers.”\nThis book got me mind blow with plot twist and each shocking moments of how I am forgetting that Artemis is a real genius on game board. Oh God, he is just so whoa...I LOVE HIM EVEN MORE THROUGHOUT THE SERIES <333Yeeeaaass and yeaaaaasss the cliffhanger at the end book really got me hyped for the next book !!!!!!"}, {"userName": "Caela Harrison", "userReviewDate": "Feb 13, 2008", "userURL": "http://www.goodreads.com/user/show/905705-caela-harrison", "userReview": "I like Eoin Colfer - he has some cracking ideas. However, he is one of the laziest writers I've read in a while. His work would be so much better if he spend a little time on it; he has the manner of a 10 year old boy with a brilliant idea, desperate to gush it all out before it's lost.There is no excuse for a children's book to be shoddy. I'm not ashamed of reading children's books, but I do wish authors would try a little harder. Colfer has a good mind and a great deal of potential to write well... he just seems to choose not to."}, {"userName": "Niki", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/57137850-niki", "userReview": "By this book, this series has started to feel \"stretched\". We have a saying in Greek about this kind of thing, \"to pull it by the hair\", when a creator decides to keep a series/ a TV show/ etc. going, even though they don't really have the inspiration or will to do so anymore (in this case: \"Eoin Colfer is pulling the Artemis Fowl series by the hair!\"), so they just introduce increasingly ridiculous plot points. For a prime example of this, see JK Rowling's \"The Cursed Child\", which is a JOKE. Enough said.So like I said, this series has begun to be pulled by the hair with the introduction of YET ANOTHER problem that might expose the Fae world to the humans. So many in the approximately 2 years that Artemis has known them. If fae-exposing issues arise so often, how did they deal with them before Artemis, to whom they run asking for help every time? The problem in this book wasn't even caused by him at all, unlike the previous ones.Also: Holly quit the LEP at the end of the previous book, but is recruited at a very similar service at the beginnng of this book, so basically nothing changed even though her quiting the LEP was a big deal in the previous book.Hey, all the AF books were written in a very simplitic, dare I say lazy writing style, but this one is the one where the plot got a bit lazy too. I'm kind of attached to the characters now, so I'll finish the series, I want to know how it ends. But let me just say that I've already started the next book and it seems even worse than this one. Sigh."}, {"userName": "Nikki ", "userReviewDate": "Dec 25, 2009", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "Reading too many Eoin Colfer books too close together doesn't seem to help in appreciating them. There's something about the tone and such that just starts to get on my nerves after two or three of his books. Still, Artemis Fowl is still fun, and while this book didn't contain many surprises, I quite liked the new characters, and I'm interested to see what happens in future. Minerva should be interesting, and I hope Number One shows up again. And Doodah, maybe.Other than that, though, I don't have much to say."}, {"userName": "Abby", "userReviewDate": "Jan 24, 2016", "userURL": "http://www.goodreads.com/user/show/16909720-abby", "userReview": "In this installment, we see Artemis coming to the aid of demonkind, the seventh fairy race that has become lost in time due to a warlock spell gone wrong. The Artemis Fowl series continues to get more complex with each book. The time travel element is surely confusing to its younger readers. And now we have an aged Artemis with a stronger connection to Holly Short. Can't wait to see their continuing adventures together."}, {"userName": "Saania Zee Jamal ϟ", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/10376232-saania-zee-jamal", "userReview": "What's weird is that this was the first of the series I'd unwittingly picked up from the library at a whim– only to devour it in one go and proceed to buy all four preceding books the very next day. Eternally grateful to Artemis Fowl for being one of the major contributors to my bookworm evolution."}, {"userName": "Ghada-NQ", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/28915813-ghada-nq", "userReview": "MY ABSOLUTE FAVORITE SO FAR!!!!!!"}, {"userName": "H Mckeachie Mckeachie", "userReviewDate": "Mar 25, 2008", "userURL": "http://www.goodreads.com/user/show/1021916-h-mckeachie-mckeachie", "userReview": "\"Artemis Fowl and the Lost Colony\" is a great book! If you have read the other books in the series this is a great continuation of them. I think this book is good for many reasons. First of all, it is filled with humorous and witty comments, even in the most dire situations Eoin Colfer finds room to fit them. You will find yourself laughing outloud to yourself when reading. Another great thing about this book is that it takes you on and adventure and it starts off right away, there's no waiting to get to the climax because the whole book is exciting. I also love the characters in this book, you really feel as if you know them and they are each so differents and all very likeable. So if you are looking for a humorous and adventurous story, this would be a great one to check out."}, {"userName": "Kimberley doruyter", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/23952659-kimberley-doruyter", "userReview": "tooooooo ducking far"}, {"userName": "Nikki", "userReviewDate": "Dec 27, 2014", "userURL": "http://www.goodreads.com/user/show/4741552-nikki", "userReview": "I LOVE THIS SERIES! The way Eoin Colfer raises the stakes with every book while deepening the characters and their relationships is so amazing. So good, I didn't want to put it down."}, {"userName": "Aliya", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/6058218-aliya", "userReview": "[ Butler fails to save Artemis. A Butler failed in his duty. And I think that was awesome. It’s not catching when everything works out conveniently for the heroes, and that usually happens in this series (as in most books). So Butler failing was awesome. And Artemis has to deal with things on his own (sort of.. Holly was with him… Someday he’s going have to handle strenuous physical situations all by himself)  (hide spoiler)]"}, {"userName": "Connor", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/22027176-connor", "userReview": "Fantastic. I loved it!"}, {"userName": "Stephanie (Bookfever. ♥)", "userReviewDate": "Feb 11, 2011", "userURL": "http://www.goodreads.com/user/show/4939266-stephanie-bookfever", "userReview": "As always I loved this addition to the Artemis Fowl series but it wasn't as good as the previous books. Still a really great read, though!"}, {"userName": "Nico", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/61003242-nico", "userReview": "I really like this book because it has a lot of action and adventure which are two of my favorite genres in books. My favorite part of the book was when Artemis fell through the a time tunnel and became young again. Then at the end he met up with his friend he was separated from a long time ago. The barely recognized each other. I recommend this book to people who like action and adventure."}, {"userName": "Karissa", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/4057501-karissa", "userReview": "The Artemis Fowl books have continued to be a great series to read. For some reason I always start reading these books with a bit of reluctance because they are, after all, kids books. A few pages into the book though I am always hooked again; this continues to be the case.In this book Artemis calculates that the time warped island that demons live on is slowly unraveling. He is attempting to prove his calculation by detaining a time warped demon. With a demon as proof he is hoping that fairykind will take him seriously and take action to save the demon race. When he shows up at the next demon appearance he finds that he is not he only one who has made calculations about demon appearances. A girl Artemis's age, name Minerva, kidnaps the displaced demon in hopes of completing research on the demon and hopefully winning the Noble Prize. Of course everyone's plans end up collapsing and chaos ensues.The book is action packed and non-stop intellectual fun from the beginning to the end. The new characters introduced are wonderful. Minerva is the perfect female counterpart to Artemis and No.1, who revels in his new found English vocabulary, is a hoot. The whole gang is back and ready to deliver. Holly is in for a lot of action and Foaly has a whole new bag of tricks in his hands..er...I mean hoofs. Artemis is taking his turn as a \"good guy\" seriously and his new outlook on life really endears him to the reader. The addition of Minerva as a possible love interest is very interesting. Finally Artemis has someone to laugh at quark jokes with.This is another fun book that further enhances the Artemis Fowl series. I look forward to reading the next book in the series."}, {"userName": "Debbie", "userReviewDate": "Aug 25, 2008", "userURL": "http://www.goodreads.com/user/show/377085-debbie", "userReview": "Book five in the Artemis Fowl series.When the fairy folk decided to live underground to keep their world a secret from humans, the Demons refused to join them. Instead, the Demons chose to move their island home to another dimension where they could hide until they were strong enough to defeat the humans. The island ended up in Limbo and the Demons were trapped indefinitely. However, as the time spell weakened, demons began popping up in the present. Artemis figures out where the Demons are likely to appear and makes plans to capture one. He is flabbergasted when someone else gets there first and grabs \"his\" Demon. To make matters worse, his rival is a 12 year old French genius named Minerva Paradizo who also happens to be quite pretty.Artemis and his friends race to save the world from destruction (again)."}, {"userName": "Jason", "userReviewDate": "Aug 28, 2007", "userURL": "http://www.goodreads.com/user/show/275922-jason", "userReview": "I started these a couple of years ago and have worked through this, the fifth and most recent book, in the Artemis Fowl series. These books are simply fantastic, hilarious mixtures of technology and mythology, and a 12-year-old (when the series begins) Richie Rich type Irish kid who happens to be the most brilliant criminal mind to come down the pipe since Lex Luthor. These will probably end up being dated for their ultra-up-to-date technological bent (much like C.S. Lewis' Space Trilogy is now dated, yet still wonderful to read), but they're clever and highly entertaining books, and everyone should get into one or two. Between Harry Potter and Artemis Fowl, it seems the UK islanders have a real handle on parallel magical universes intermingling with our own!"}, {"userName": "Alex Murphy", "userReviewDate": "Jul 22, 2008", "userURL": "http://www.goodreads.com/user/show/993298-alex-murphy", "userReview": "This was the only Artemis Fowl book that has confused me so much I had to re-read the finale to figure out what happened.Even so, it was very interesting, with the introduction of Nº1, a demon who feels out-of-place in his bloodthirsty world.One thing Eoin Colfer knows how to do is end a book. The last pages of his works inspire you to wish you had the sequel in your hands. This one is not only no exception.Of all the series, this one is probably the most pretentious. But that's only minorly off-putting. All things considered, the book is awesome."}, {"userName": "Lisa", "userReviewDate": "Jun 04, 2010", "userURL": "http://www.goodreads.com/user/show/3828022-lisa", "userReview": "While I very much love this series, I had found it difficult to finish this book when I read it. I got half way through and just stopped, which is weird because this is my second favourite series. But I do feel that there was just a little too much going on for me, and a lot of new characters. And, on a personal side, I didn't at all enjoy Minerva. She didn't even grow on me like characters usually do. But there are some interesting developments that are key in book too and definitely worth the read."}, {"userName": "Alexb", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/71748405-alexb", "userReview": "It is a great book packed full of adventure and wit. If you like excitement in your books this is a good book to read."}, {"userName": "Bilal Taibzada", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/55681389-bilal-taibzada", "userReview": "THE BEST BOOK OF THE SERIES SO FARThe putting of no 1 was pretty clever eion colfer(i guess that's how you write it)"}, {"userName": "Marina", "userReviewDate": "Nov 13, 2009", "userURL": "http://www.goodreads.com/user/show/2938801-marina", "userReview": "Artemis has completed his transformation from a criminal mastermind to a do-gooder genius. Going so far as to look-out for his fairy friends... without seeking a payout. His parallel Mulch is right there with him, working as a private investigator in the Lower Elements with Holly and actually enjoying it!!!The book was another great instalment in the Artemis Fowl series, but I feel as though the plot slowed down a lot because of all the new technical details. Things also moved so quickly that sometimes it was hard to keep up, but it definitely kept me on the edge.I was slightly disappointed with Minerva. It appeared that Colfer wanted to create an equal for Artemis (just in time for him to develop a romantic interest since he's going through puberty). And while Minerva is definitely a twelve-year genius in her own right, she is far from Artemis' equal. Especially considering that Colfer goes out of the way to highlight the fact that she's as girly as possible by highlighting just how pretty she is, throwing tantrums when she doesn't get what she wants, and getting emotional when things go wrong. Girl geniuses are usually the opposite... actually. Artemis was very detached when it came to his plans, even when his plans went wrong, and he always had several contingency plans as back-up. Frankly, I'm just tired of having one token female in a cast of all men.The end action sequence was definitely epic. So much was happening so quickly and the chaos was palpable. I wasn't sure about that ending though. Skipping three years (while I understand why it happened) seems like a huge plot twist. Plus Artemis stealing magic just when he was supposed to finally be good. But I suppose that sets us up for the next book."}, {"userName": "Sara ♥", "userReviewDate": "Jun 26, 2007", "userURL": "http://www.goodreads.com/user/show/155288-sara", "userReview": "February 4-7, 2018I really liked this book! Number 1 was a light and humorous addition to the cast, and the plot was really cool. The time stuff at the end was a bit confusing, but I was like, \"I'm just gonna trust that whatever Artemis is saying is correct...\" Lol! The eye swap is pretty fun. I can't wait to see if that has an effects other than aesthetic.... Also... MINERVA!!! Can't wait to see what happens next book with her! :)October 26-29, 200811/3/2008:HOLY COW!!! It ended, and I went, \"WHHAAAAT????!??!?! GOOD THING THE NEXT ONE IS OUT!!!!!!!\" Not that it was terribly cliffhangery or anything. It wasn't... but I'm sitting here going, \"But... but.... but..... but.... *strange and desperate squeal from the back of my throat*\" Minerva!! :) And Butler! And HOLLY!! It was really really really really really really good!10/29/2008:HOLY CRAP!! I'm almost done with this book (on CD)...!!! It's SO GOOD!! SO INTENSE!!!"}, {"userName": "Tyler", "userReviewDate": "Dec 28, 2007", "userURL": "http://www.goodreads.com/user/show/155689-tyler", "userReview": "In the penultimate Artemis Fowl book, the series manages to get even weirder than before. The story is just as lively and interesting but a little disturbing with Artemis's switching digits and gaining magical abilities. Initially I must say that this doesn't please me as it seems to break (or at least bend) several of the implied rules of fantasy, especially children's fantasy. However, this may change when the final book is released. It is also quite intriguing to note how Artemis has turned his moral compass around throughout the series and now feels guilt. I did have to laugh when I looked at the Wikipedia article on this book and found N°1 named Number One when the joke is obviously \"no one.\" And again in the book when Qwan suggests changing his name to a traditional \"Qw\" name such as Qwerty."}, {"userName": "Sanne (TheBookDutchess)", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/24585510-sanne-thebookdutchess", "userReview": "Ok so I really really can't judge this fairly because I just realized I never finished the fourth book. However; this one started with a lot of newly introduced characters and new setting. And I really did not like a lot of the new characters (except nr 1 whom I loved). And didn't enjoy the new species and world introduced. This was also why I didnt realize I missed half a book (just thought I forgotten some details since reading it).Artemis also seemed really insecure for most of the book which I was disappointed with.I wouldve given it 3 stars but I wont because I feel missing some things from the 4th book really influenced my experience (wondering why some characters weren't involved).It was still written awesomely, I still love some of the characters and I will still continue reading books from this great series.Anyway I will be reading the 4th book asappp"}], "description": "Ten thousand years ago, humans and fairies fought a great battle for the magical island of Ireland. When it became clear that they could not win, all of the faeries moved below ground—all except for the 8th family, the demons. Rather than surrender, they used a magical time spell to take their colony out of time and into Limbo. There they have lived for decades, planning their violent revenge on humans.Now the time spell is unraveling, and demons are beginning to materialize without warning on Earth. If humans were to find out about them, all faeries would be exposed. To protect themselves, the faeries must predict when the next demon will materialize. But in order to do so, they will have to decipher temporal equations so complicated, even a great brain like Foaly can't understand them. But he knows someone who can: Artemis Fowl.So when a confused and frightened demon imp pops appears in a Sicilian theater, Artemis is there to meet him. But he is not alone. Someone else has unlocked the secrets of the fairy world and managed to solve complex mathematical problems that only a genius could. And she is only twelve years old...", "title": "The Lost Colony\n      \n          (Artemis Fowl #5)", "url": "http://www.goodreads.com/book/show/37586.The_Lost_Colony", "average": 4.0, "cover": "https://images.gr-assets.com/books/1522190376l/37586.jpg", "reviews": 1675, "authors": [{"url": "https://www.goodreads.com/author/show/10896.Eoin_Colfer", "name": "Eoin Colfer"}], "type": ["Young Adult", "Fantasy", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/37586.The_Lost_Colony", "http://www.goodreads.com/book/show/119794.Artemis_Fowl_and_the_Lost_Colony", "http://www.goodreads.com/book/show/18401553", "http://www.goodreads.com/book/show/815645.Artemis_Fowl_and_the_Lost_Colony", "http://www.goodreads.com/book/show/13611857-the-lost-colony", "http://www.goodreads.com/book/show/8130007-the-lost-colony", "http://www.goodreads.com/book/show/1865453.The_Lost_Colony", "http://www.goodreads.com/book/show/613898.The_Lost_Colony", "http://www.goodreads.com/book/show/533808.The_Lost_Colony", "http://www.goodreads.com/book/show/249747.Artemis_Fowl", "http://www.goodreads.com/book/show/114955.The_Arctic_Incident", "http://www.goodreads.com/book/show/114954.The_Opal_Deception", "http://www.goodreads.com/book/show/227865.The_Eternity_Code", "http://www.goodreads.com/book/show/2179276.The_Time_Paradox"]}