{"ratings": 1536, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”He held in his hands a human skull. It was impacted with moss and mud, a salamander curled in an eyesocket, periwinkles clinging like leeches to the worn bone. Bright shards of moss clung to the cranium like perverse green hair. He turned it in his hands. A chunk of the occipital bone had been blown away seemingly by some internal force, the brain itself exploding and breaking the confines of the skull. He turned it again so that it seemed to mock him, its jaws locked in a mirthless grin, the two gold teeth fey and winsome among the slime and lichens.”\nWho did this skull belong to? You’ll have to read the book to find out.Everybody was so busy trying to feed their families and keep a roof over their heads they could spare little time over worrying what a man like Dallas Hardin might be up to. He took over Thomas Hovington’s farm while he was stoved up with some illness that bent his spine like it was a piece of black licorice. Hardin didn’t need a magical staff or the will of God to part the legs of Hovington’s wife, Pearl. She came readily to the task. Hardin also took over the moonshine business, as well. People talked, sure, but who was going to do anything about it? Hardin was rough cut, like a knot infested piece of yellow pine. ”Hardin’s vulpine face was leaner and more cunning than ever, the cold yellow eyes more reptilian. Or sharklike, perhaps, lifeless and blank save a perpetual look of avarice. And he went through life the way a shark feeds, taking into its belly anything that attracts its attention, sucking it into the hot maw of darkness and drawing nourishment from that which contained it, expelling what did not.”He was a predator who took what he wanted just to see what someone else would do to keep it. If he was having an issue with a neighbor, everyone was just happy he didn’t have an issue with them. They took wide turns when they walked around Dallas Hardin. Most people were pretty simple in this rural area of Tennessee in the 1940s. William Tell Oliver, who had observed Hardin’s business and personal practices from the shadows among the trees, described a typical person populating this region of Tennessee. ”She had no interest in anything that happened in a book, on the radio, in France or Washington, D.C. Nothing that was not readily applicable to her life. If you can’t eat it, fuck it, or bust it up for stovewood, she’s got no use for it.Higher ideals, in other words, were not of interest, and it made these people easy to manipulate and even easier to buffalo. Oliver had reached a point in life where he might have spent time pondering the cosmos, but really he just wanted to be left alone to raise his goats and enjoy the peacefulness of a simple existence. When the lad Nathan Winer, to whom Oliver was partial, went to work for Dallas Hardin building a honky tonk that could be stocked with whores and booze, Oliver had a feeling in the marrow of his bones that, sooner or later, somebody was going to have to do something about Dallas. \nThomas Hovington had a daughter named Amber Rose who was about Nathan’s age. Nathan had never seen anything as saucy and pretty as her, with her nice angles and soft curves. Dallas Hardin had been raising her like a fatted calf, with a mind that someday she would be his. Desire and perversion were twined in a hillbilly tango as Nathan and Dallas squared off. Boy against shark. Nathan had been slinging a hammer all summer, and his forearms were like pieces of molten iron. In a fair fight, Nathan would sling Dallas around like a dry corn stalk and smash him to pieces, but Dallas didn’t fight like that. He’d stack the deck and come at you from your blindside, with darkness slung around his shoulders. Besides Dallas was focused on what he wanted. Nathan was understandably distracted. ”The wind sucked through the cracks by the windows and told of a world gone vacant, no one left save these two. He thought of his hands on her throat, of his weight bearing down on her, forcing her legs apart with a knee, sliding himself into her. Dark and nameless specters bore their visions through his mind. He thought of her supine in a shallow grave, her green eyes and the sullen pout of her mouth impacted with earth, the cones of her breasts hard and white as ivory, ice crystals frozen in the red hair under her belly. The rains of winter seeping into her flesh, the seeds of springs sprouting in the cavities of her body.‘Why you lookin at me like that?’‘I ain’t.’” He shore is. A woman, even if she was a mere girl, would drive a man, especially one still shaking off the last vestiges of boyhood, crazy.William Tell Oliver could see it all playing out like an old song that always ends the same way. Someone was going to have to do something, and he couldn’t deny that the someone, who was going to have to do something,… was him. ”He knew that the world was wide in its turnings and it was fraught with dark alleyways and pastoral footpaths down which peril lurked with a patience rivaling that of the very old.”\nWilliam Gay has some intense dark eyes, like holes in snow cleaved by icicles.Simply amazing writing, so lyrical it will make your teeth ache, like you just took a drink of melted snow. I had so many notes of so many great passages that I had a difficult time deciding what had to be shared with my faithful, reading audience and what would have to be found by them when they read the book themselves. I’ve heard wonderful things about William Gay over the years and bought his first two books with his signature adorning the title pages. I’m so glad I did because he departed this world in 2012, taking the rest of those wonderful, electric phrases and exploding, earthy thoughts, which he would have shared with us,... to his grave. This book certainly qualifies as Hillbilly Noir with some soaring Mozart moments. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Ned", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/21232850-ned", "userReview": "I’m filled with that rare sense of pure reading joy at being deepened, improved and highly entertained by a great novel. This is a story, a real one, but I had to force myself to slow it down since every single word, every sentence, and the arrangement are something to savor and turn over and over. But first, how I got here: Haphazardly I started communicating with a virtual stranger online about books we had in common. He suggested William Gay, new to me, and I read Twighlight which I loved. Then I found Goodreads and those with similar tastes as mine wrote glowing reviews, almost without exception, of this little known (I think) author. So I added him to my short list of authors who I plan to read from earliest to last. The Long Home is Gay’s first, and I am beyond words.What I don’t like about this book: Nothing, nada, nil.What I like:1.\tThe author is unknown, mysterious, not widely recognized (my joy in being on the “in”).2.\tThe author seems ordinary, quiet, unglamorous and committed to great writing for its own sake. I don’t want to know too much about him as a person yet, I want to absorb his body of art.3.\tThe story is set in remote hills, in a time before I was born (I can learn from the days of my father and my father’s father of humble yet noble character).4.\tThe writing is about nature, the feeling of the earth, the sky, the seasons and the emotions they bring forth about time passing and the permanence of all life and our temporal place on earth.5.\tThe characters are old, young, and all between and authentically drawn in their thoughts and their language and thoughts. They are original, surprising, not formulaic or taken from preceding styles.6.\tThe story is dramatic; it has a beginning and end and conflicts aplenty. I could not imagine how it would turn out and I cared deeply about the people. It was not neat, it had resolution for some and chaos for others. The final outcome is left open for some, yet the main character meets his moments of revelation and gives finality to the human theatre and a dramatic closure.7.\tThe language is unique for its time and place, and how a modern writer can recreate that is magic and all but incomprehensible to the reader. It goes beyond skill and craft, and achieves alchemy like all great art (think Charlie Parker in zen-state, the notes and fingering and phrasing blurred, the mind turned off and channeling something beyond intellect).8.\tIt touches the core of all being, nature and man and spirit: A boy grows up, meets world, learns the depravity and kindness of humanity, finds and loses passion, plays his hand, deals with consequences. The age old conflict of love against the inhumanity and hardness of others who have chosen a different path (material, power) is played out. On top of it all, the wisdom of the seer, regretting his judgments, but saved just in time, offers the hope of redemption we all seek, deep down.9.\tThere are protagonists, villains and bit players, all tuned to perfection.A sampling:1.\t(p 66) the young girl caught between a rock and hard place, judging the young man and her keeper: “When she had been a little girl she had tried to think of Hardin as her father. A father was strong and Hardin looked as remorseless and implacable as an Old Testament God, there was no give to him. The man whose blood she’d spring from was flimsy as a paperdoll father you’d cut from a catalog, a father who when the light was behind him looked curiously transparent. No light shone through Hardin and in a moment of insight she thought she had seen a similar core of stubbornness in Winer. Somehow you knew without shoving him that there was no give to him either”. 2.\t(p 222), the sinister strongman Jiminiz hired by the villain Hardin: “’What I like about you is you never ask me why’, Hardin said. ‘Why is that, Jiminiz?’. ‘I’m afraid you’d tell me,’ Jiminiz said.” 3.\t(p 225), Roy the bit player in the pool hall observed by the young man: “Winer drank from his Coke and studied the pool game in progress. Roy Pace had found a sucker. Roy was paralyzed from the waist down and went in a wheelchair. His head was oversized and pumpkinshaped and there was a peculiar mongoloid cast to his face but he had won a small fortune off traveling salesmen who put great stock in appearances”.4.\t(p 226), Buttcut (don’t ask ), friend of the our protagonist, out on a Saturday night: “I never seen such a crop of hairyankled men in my life. You’d think with a war bein fought a man might stumble up on a little stray pussy just every now and then. But hell no.”Finally, all the elements are there for a particular genre: Mayhem, bootleg whiskey, intrigue, macabre deformed figures, beautiful innocents, impossible odds, etc etc.But that is all beside the point..."}, {"userName": "Melanie", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/4093022-melanie", "userReview": "Let’s dig up hogs sprouting from the ground; worship a yawning pit; make risky deals; form deadly acquaintances; join a bloody bar fight; steal thoroughbreds; build a whorehouse; dig up jars of greasy money. In other words: so much fun to be had here. Still, I’ve given nothing away, because aside from plot (more structured than Provinces of Night), the essence of the story is difficult to explain, there is a sense of finality throughout, longing and nostalgia: it’s a heady mix and with William Gay, repeat reading will unearth more of the gold...or hogs at the very least."}, {"userName": "Red Panda", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/44824883-red-panda", "userReview": "William Gay writes with a kind of hallucinatory detachment that made me feel like I was observing the events of this story through LSD-infused bulletproof glass. I know I sound like I'm talking bollocks but that's as close as I can come to describing this author's remarkable style.He weaves a few plot threads around each other in a way that's slightly dizzying at times and sometimes things are left open to interpretation.One minor irritation: characters mention Coca Cola so often I did wonder whether the author was being paid to advertise it.I enjoyed this book, although I felt like I was wrestling with it at times. Gay has created a whole bunch of interesting characters, most notably his antagonist. Hardin was such a loathsome, detestable character that I desperately wanted to get to the end just to see him get his comeuppance.I'll definitely be reading more by William Gay in the future."}, {"userName": "Horace Derwent", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/54083442-horace-derwent", "userReview": "I fucking love American Southern (Country) (Noir)And yes, I even changed my accent a few years back (you know, I spoke Cockney 20 years ago, as I first started to learn English)"}, {"userName": "Doug", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/14987742-doug", "userReview": "\"I never needed nobody anyway, he told himself. Nary one of them, then or now, and at last he was touched with a cold and solitary peace. For he had the white road baking hot in the noonday sun, the wavering blue treeline, the fierce, sudden violence of summer storms. At night the moon tracked its accustomed course and the timeless whippoorwills tolled from the dark and they might have been the selfsame whippoorwills that called to him in his youth. That’s all that matters, he told himself with a spare and bitter comfort. Those were the things that time did not take away from you. They were the only things that lasted.\""}, {"userName": "Shaun", "userReviewDate": "Feb 05, 2014", "userURL": "http://www.goodreads.com/user/show/9779623-shaun", "userReview": "This is or rather was William Gay's debut novel. Unfortunately, Gay passed away in 2012 at the age of 70Though released in 1999, this book has a meager 473 ratings and 61 reviews, which is sad. Such a masterpiece deserves a much larger audience.It does take Gay a little while to hit his stride with this work, but once he does the delivery is nothing short of genius. Best described as Southern Gothic, this is a book the explores the complexity of human nature as well as our interconnectedness. Gay is almost as interesting as his well-drawn, though sometimes unlikable characters. A writer without a literary background--just the opposite: Gay worked as a manual laborer--he once said that he felt like an imposter and an outsider whether hanging out with fellow blue collar workers or hobnobbing with the literary elite. Here is a little taste of what you'll get:\n\nIn the molten fire where he lay he could watch the sow machinations of eternity, the cosmic miracle of each second being born, eggshaped, silverplated, phallic, time thrusting itself gleaming through the worn and worthless husk of the microsecond previous, halting, beginning to show the slow and infinitesimal accretions of decay in the clocking away of life in a mechanism encoded at the moment of conception, withering shunted aside by time's next orgasmic thrust, and all to the beating of some galactic heart, to voices, a madman's mutterings from a snare in the world.Hardin lived in a world he manipulated day to day, you never knew when a piece of information might have a use. Life was a jigsaw puzzle someone had kicked apart on the day Hardin was born and he was still putting it back together a piece at a time, turning each section this way and that to see where it fit. A thousand lives woven like threads in a patternless tapestry and if he died here on the highway it would alter the design not one iota. The world was locked doors, keep-out sign, guard dogs. He figured to just ease through unnoticed and be gone.He guessed wherever he was was better than sleeping, these days he had come to feel that life was spinning past him, leaving him helpless. Sleep only accelerated this feeling of impotence. While he slept the world spun on, changed, situations altered and grew more complex, left him more inadequate to deal with them.\n\nWould recommend to fans of Southern Gothic fiction and/or those who enjoy rich, poetic prose and multi-dimensional characters."}, {"userName": "Kevin", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/11089210-kevin", "userReview": "I've waited a while before writing this review, as I've been trying to decide what it is I like so much about William Gays writing. He seems to encapture all that is good in a writer, at least for me. The way he establishes such a strong sense of time and place, the believability (not sure that's a real word) of the characters he creates, and the way they behave rationally within the confines of their own logic, whether it be in a good or a bad way. Dallas Hardin is an evil/vile (choose either anagram) character, but you can follow his thought patterns and his logic, he's no unhinged psychopath, and this gives him an even more menacing air. Gay's writing is impressively economic at times. He can cram, what for other writers would be a whole chapters worth of storytelling, images and feelings into one sentence. There's one line ( if I can find it I'll add it to this review), that Motormouth Hodges says when he comes back from Chicago with his big city hopes destroyed, that made me conjure up almost a separate side-novel in my mind about his experiences up there( small fish in big pond; nobody looks you in the eye; don't wanna shoot the breeze with no strangers; cold cold place; big lights just threw darker shadows to get lost in; not what you'd call friendly folk; sleeping rough; whadya mean move along, I aint botherin' nobody; everyone going through life at a million miles an hour like they was on the clock; folks looking down their noses; what makes them better than me; oh to hell with this place, you cold-hearted bastards can keep it.) You see what I mean, all that and more from one perfectly formed William Gay sentence. That's why I love William Gay."}, {"userName": "Josh", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/10773168-josh", "userReview": "William Gay, rest his soul, had a way of crafting a story that while reminiscent of other great contemporary authors also hits spots that are so very uniquely his. You know how some books just flow? The ones where you can follow the author's process behind a desk as they seemingly let their thoughts create a rough draft initially only to come back with slight edits where needed because the spontaneous creative process was what the author was trying to convey........well that's not Gay. Particularly in this one, you can tell that his writing in the settings, phrasings, descriptions, and plot developments were married in a wrenching and painstaking way. I for one appreciate the heck out of his labor. His way with words, while in no way similar to how anyone (particularly Gay) would carry out a conversation, is superb. Some would find this too dark in subject matter, and it certainly is a dirty little look into some pretty unsavory crap, but it is also beautiful and for me the good out weighs the bad. It's not one where all the loose ends straighten, or where good entirely trumps evil and we get the outcomes and closure we want. This is more believable than that, and in being so it isn't a finish it and move on book. These folks seat in your brain as real and will stay a part of your life for time to come.Personally, while it still makes my favorite shelf, I still \"like\" Provinces of Night even more, but that's no real surprise, I kinda knew that before I started. I would also say it is a slower journey, ramping up more gradually, working toward the crescendo which is back end loaded. For a first time reader, oddly I would recommend Twilight (not the vampire saga......although there is some \"blood sucking\" in play) even though his other works are my favorites. Go grab something by this man for Pete's sake, he's great."}, {"userName": "Still", "userReviewDate": "Jan 13, 2014", "userURL": "http://www.goodreads.com/user/show/6752847-still", "userReview": "In the past few months I've read 3 of William Gay's novels.Two I purchased outright. This particular novel was loaned to me in eBook format (via Kindle) by Goodreads friend and contributor MSJ.William Gay was a unique and gifted literary artist. Many reviewers compare him to Faulkner, Wolfe, and McCarthy.Of those three authors, (haven't read Wolfe since I was in high school) I guess he most closely approaches the greatness of Faulkner. To mention William Gay in the same breath as Cormac McCarthy is an injustice.Both authors are brilliant but William Gay's writing is so much more approachable and rewarding.The writing is stunningly beautiful.The characters are so vividly drawn that they haunt the reader long after the final page has been turned."}, {"userName": "sappho_reader", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/17068912-sappho-reader", "userReview": "Bootleggers, honky-tonks, murder, revenge, desperation, crooked deputy's, Whitecaps, long held secrets...there's a lot of love about this book set in 1940's rural Tennessee. William Gay is a master storyteller. It's hard to believe that this was his debut novel. He has such a gift with words. The descriptions of nature and the landscape were like a lullaby. There were many times I became mesmerized by his prose that I had to shake my shake my mind awake and reread passages so not to miss events. The characters really shined and were so well developed. How could you not like characters nicknamed \"Motormouth\" and \"Buttcutt\"? Hardin was truly a bad guy. I thought his schemes were pretty clever and although I did not applaud his actions I also never rooted for his final demise. It was a strange paradox for me. And let's not forget the snappy dialogue. I loved it all.On the surface this could be described as a good versus evil story but it did not necessary play out like that for me and for that I am very happy. It is a very dark tale written in the Southern Gothic tradition.Rating: 5 stars (\"I loved it\"). When I found myself waking up 20 minutes early just so I can squeeze in more reading time before leaving for work I knew this was a great book. One of the few times I was sad when it ended."}, {"userName": "Adam", "userReviewDate": "May 19, 2010", "userURL": "http://www.goodreads.com/user/show/214053-adam", "userReview": "William Gay writes a distinctive version of southern gothic. Cormac McCarthy’s Tennessee novels is obviously the model with almost episodic descriptions of small town and country stacked up into a tale seemingly plucked from the Old Testament, some dark forgotten Grimm’s fairy, or Greek tragedy. Gay adds a comic voice and handling of characters. His dialogue like Daniel Woodrell’s is almost too clever at points and some of poetic descriptions can approach McCarthy parody and a lot of this novel seems replayed in his later novel Twilight. But these problems fade to shadows when plunging into this bizarre world of limestone sinkholes to hell, satanic bootleggers, bizarre characters, murder, lost love and innocence, all with a beautiful ending. A great new voice in hard boiled Southern Gothic like Daniel Woodrell and Tom Franklin"}, {"userName": "Randy", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/131730-randy", "userReview": "Reading like a Southern Gothic regurgitation of Cormac McCarthy, late author Gay's debut novel explores the dualities of youth and age, life and death. Despite a slow start, and notwithstanding the author's unusual fascination with lengthy descriptions of the sky on almost every page, the story builds to a resounding, though inevitable, climax. The emotional heft of the tale is due more to the arcs of the vibrant characters than to the nearly incidental plot."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "Just a superb book by one of our most gifted modern southern writers. Sadly, William Gay is no longer with us, but his books live on for those willing to hunt for these treasures."}, {"userName": "Jamie", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/51089-jamie", "userReview": "In his short story “The Valley,” Rick Bass writes, “I wake up smiling sometimes because I have all my days left to live in this place.” I know exactly what that’s like. William Gay knows exactly what that’s like too.5 stars in a prayerful kind of way. Hardin and Oliver’s final showdown made my fingers twitch, it’s so good. It didn’t catch and pass \nProvinces of Night\n because I love the Bloodworths beyond reason, but The Long Home shares all the essential DNA.First read January 2012- - -July 2012:I knew these past couple weeks would be dicey, schedule-wise— dicey, schedule-wise being at least two consecutive days I’m not on the farm— and I wasn’t up to conquering new worlds in a book too. I wanted old worlds to carry with me. The oldest world, the most lived-in and loved, a heap of wild quilts to burrow into.A little more removed from Fleming Bloodworth this time, I loved Winer a little more on his own. Who couldn’t love these fighting, longing creatures? Everyone wants something here, which is exactly how it should be. Not any other way. I’ve got room in my heart for them all. “You want to see everything at once, Nathan. You want it every bit in front of you where you can look at it, make choices. I never had a choice to make. I just do what there is to do and then I don’t worry over it. It’s done.”- - -April 2013:This is what I read when I’m trying to stall myself from Provinces of Night. When I want Ackerman’s Field, when I want William Gay’s people, but it’s ridiculous how many times I’ve read Provinces already this year. (“It’s not ridiculous,” goes my brain. “It is.” “It’s not.” “It is.”)But the only consequence of that stalling is that I love this book more and more and more until it might as well be the Bloodworths. Winer is family. Oliver is friend. Hardin is spectre and ghost. They’re not in the shadow of EF and Fleming and Brady and Boyd and Albright; they’re all loved just as much. If it goes on much longer, I’ll be reading Provinces to stall me from The Long Home."}, {"userName": "Lori Kishlar", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/877006-lori-kishlar", "userReview": "Well, i wanted to love this book. On the back it mentions evil about 13 times. I like horror and I like evil, so okay! No. By evil they just mean there's a guy who is a dick. The cavernous pit that is mentioned, it isn't evil. It's just a pit. I thought some supernatural stuff would happen but it didn't. The story IS good, but it isn't what i read from the back teaser. Also, I found it hard to believe this was written by a guy. It is very flowery and i believe they used the thesaurus for each paragraph. There were so many awkward words, and not because it was based in the 40's in the South. I trudged through anyway. I had a hard time enjoying this book the whole way through, though the premise is good. At the end, it just kind of wraps up in 5 pages and well, its a super big bummer. I was left feeling unsatisfied."}, {"userName": "Carol", "userReviewDate": "Apr 20, 2014", "userURL": "http://www.goodreads.com/user/show/3845138-carol", "userReview": "Rough-edged – Unflinching – Lyrical prose. Compelling! More to follow (maybe)."}, {"userName": "Mike Simmons", "userReviewDate": "Jan 20, 2010", "userURL": "http://www.goodreads.com/user/show/2571569-mike-simmons", "userReview": "William Gay is indeed a master of the written word in The Long Home. Every page brings a new wonder of words and storyline. His words and descriptions and attention to detail are as good as I have ever read. His characters are real and memorable. I became attached to them like family, I knew their flaws and thier goodness. As I read it, I kept waiting for a letdown in this tale, but it never came. Good to the last word.At times the evil and wasted humanity in this story is hard to take, but I took it. These people are poor, some stupid, some worthless, some evil-it propels the story. I also found humor-for me a rare commodity in writing because it requires well written characters and the perfect turn of a word-I actually laughed a few times at the wit of these simple country folk.I am no literary genius, but to me Gay's writing is better than Faulkner. I will be reading Gay's other books; if they are half as good as The Long Home, it will be worth the time."}, {"userName": "Daniel Villines", "userReviewDate": "Jan 23, 2012", "userURL": "http://www.goodreads.com/user/show/2266055-daniel-villines", "userReview": "The back-woodland area of Tennessee is a place known to only a relative few. Reverse time by half a century and the remoteness becomes virtually complete. The people in this region are uniquely their own. The Long Home opens this world up to its readers so that the differences and similarities can be considered within the context of a story that is not the slightest bit unbelievable. Gay instills in his characters a truthfulness to themselves which further drives the story’s realness. Every act is understandable even though the characters are the kind of people that you will likely never know. There are some books that are organically born from their writer’s mind. These stories belong to them because the words used could only have originated through their personal experiences with places that permeate their lives. This is my impression of William Gay and this, his first novel, The Long Home. It’s a beautiful book because it speaks to the soul of its owner."}, {"userName": "Diane Barnes", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "Well-written .......very moving passages and descriptions of people, locations and nature.Well-crafted ........plot and characterizations carry the story along perfectly.I am torn between 4 stars for the writing, and 3 stars because this book made me squirm, and not in a good, conscience stricken way as with a book that teaches me something, but because of the bleakness of the setting and his characters lives. I read some of Gay's short stories a few months ago, but had to give up after the fourth one because they were so dark. I hope the author was not as morose as his books. I wanted to read this for my group, On the Southern Literary Trail, as it was our December read, and I'm glad I did, but it will most likely be my last William Gay book. I know this will rankle with Gay's fans, as he seems to get mostly 4 or 5 stars in reviews, but he's just not my cup of tea."}, {"userName": "Kathy Doll", "userReviewDate": "Feb 06, 2013", "userURL": "http://www.goodreads.com/user/show/16879983-kathy-doll", "userReview": "Oh, William Gay, how I love you...Adding my 5 stars to this long list of them. What a fantastically masterful writer. His prose is so rich and full, like you could chew it and swallow it. Some of the passages really made my heart swell. The beautifully chosen words evoke the time, place and feeling of rural Tennessee in the 1940's so truly, I could really feel that I was there (despite the cliche of that term). The characters are finely drawn and real.This was his first novel and what a bang to come in with. I've also read Twilight, which I think was a more modern setting but it was similarly fabulous.I am much saddened to learn that he died last year.I will be buying all his books to add to my own library for sure!"}, {"userName": "Kirk Smith", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/15749169-kirk-smith", "userReview": "I'm blown away. This is the second novel of his that I have read and I am still shocked by just how good he is. Normally what I would be reading would satisfy me if I just related to the characters, but with his novels I feel myself evolve into and become the character(s). He plays to sensibilities and builds slowly, nothing contrived, and then just as naturally as you please the anticipated disaster brings you to your knees. This is Classic Literature in its highest form."}, {"userName": "Laury Kerr", "userReviewDate": "Dec 19, 2015", "userURL": "http://www.goodreads.com/user/show/36899134-laury-kerr", "userReview": "I'm not very far into the book, only about 100 pages. But, I'm not sure if I can go too much past this point. The rambling, overly descriptive language is almost too much to take. I certainly understand that some good use of adjectives is needed, but wow, this is really a bit over the top."}, {"userName": "B. R. Reed", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/32410049-b-r-reed", "userReview": "Although I gave it three stars this book was a bit of a disappointment for me. It was a pretty good story (good vs evil) set in central Tennessee during WW II but it seemed to me that Gay was trying too hard. I thought he went way overboard on his descriptive images and it took away from the story. He must have used the word orb (a word I hate for some reason) a half dozen times to describe the sun. Gay was inspired in youth by Wolfe's Look Homeward, Angel and the other usual suspects from down south. Gay one of the leaders of the southern Grit Lit tradition. Unfortunately, he died a few yrs back. I enjoyed his last book (Twilight) and plan on reading Provinces of the Night. Gay deserves some attention."}, {"userName": "Sarah Tittle", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/1806730-sarah-tittle", "userReview": "3.5 starsI have such mixed feelings about this book, the author's debut. I never heard of William Gay, and I'm surprised about that because I am a diehard fan of Flannery O'Connor and pretty keen on Cormac McCarthy. This guy straddles both traditions of Southern Gothic literature. When he's writing O'Connor style he's great, with tight, sardonic--even comic--scenes and dialog that are a pleasure to read and reread for the details. But when he's waxing literrrrrrrrarrrrrrry, taking way to long to describe: oncoming storm, single leaf fluttering on tree, frozen river, moon, sun, etc., it's pretty unbearable. Not to mention the wordcombining that makes my brainhurt. Also, the Kindle edition I read was flooded with typos so I didn't know if the badgrammar was intentional or the fault of the publisher. At any rate, if you're a Cormac McCarthy fan, you'll probably really like this. If you're an O'Connor fan, you'll appreciate it. Here's the first paragraph from Tony Earley's review in The New York Times: The fact is, most Southern writers live on one side or the other of a railroad track in the same small town. On one side of the track, half the population gathers after church in Miss Welty's yard and listens to the other half cursing and breaking bottles in the neighborhood Cormac McCarthy lived in before he moved west. While the segregation between the two sides might seem absolute to an outsider, the isolation of the community forces writers from both camps into uneasy commerce -- not to mention the occasional intermarriage -- with their counterparts across town. Most of the old verities, for instance, are most easily found in the small, dusty shops of Miss Welty's neighborhood, while everyone knows the best place to load up on hot weather and violence and sex is at the Wal-Mart down the road from Larry Brown's. Accordingly, everybody pretty much knows everybody else's business, and when a new writer moves in, on either side of the tracks, word travels fast. This sums up my experience of this novel quite well. Never take a 25-line paragraph to say it's hot. Do it this way: \"Pigs on the porch just make things hotter.\" -- Larry McMurtry, Lonseome Dove"}, {"userName": "DanC", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/41096956-danc", "userReview": "I must have expected too much from this book due to all the good reviews, because it just didn't seem that great to me. While I usually finish a book in 2-3 days, this one took me over 2 months because I simply could not get into it. A lot of rambling, overly descriptive writing, without enough real meat to the story. I spent the entire read wondering when something entertaining was going to happen. Never really did.The Hardin character was hardly an embodiment of pure evil, in fact he seemed more like just a creepy redneck capable of murder. I never felt any real fear or apprehension in the later scenes with him and Winer or with Amber Rose.While it's clear that Gay is a talented writer, this story just didn't do it for me. For my money, Donald Ray Pollock's \"The Devil All the Time\" is a much better book in the southern gothic genre. It is certainly more entertaining. The kind of book that shocks and thrills you throughout, then leaves you feeling like you just got punched in the gut while you try and finish absorbing what you just read."}, {"userName": "Yimmy", "userReviewDate": "Jul 22, 2014", "userURL": "http://www.goodreads.com/user/show/32915890-yimmy", "userReview": "Like a shot of whiskey the first 50 pages went down. A smooth, but pungent taste. I wasn't sure what it was, but I knew it was powerful. I sat the book down. Was I ready? Maybe I should grab something more light, possibly a beer? No. I had to see if I'd get the taste for whiskey. 80 more pages in and I was drunk. Drunk from the sheer honesty of Gay's writing. Drunk from the beautiful prose. I had the taste and all I wanted was more. I attacked the rest with the vigor of an addict. I spent as much of the day at work sneaking in sips of \"The Long Home.\" If my bosses had known what state I was in....I finished the book late that night and woke up with a hangover in the morning. Would I read a book this good again? Is my tolerance for great writing too high now? \"The Long Home\" should come with a warning: This book may make everything else you read this year just a tad less enjoyable. You may also have to reevaluate everything else you've read."}, {"userName": "Rob Kitchin", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/4579658-rob-kitchin", "userReview": "The Long Home is a literary crime tale set in rural Tennessee in the 1940s that is driven forward mainly through its character development and its sense of foreboding rather than a central hook. Gay creates a somewhat claustrophobic, menacing atmosphere amongst a poor, backwoods community, producing a strong sense of place and time. At times it seems that Gay is more interested in constructing beautiful prose than the story, with many passages feeling overwritten. Nonetheless, as the tale progresses it becomes quite gripping as the young Nathan Winer, advised by the elderly William Tell Oliver, comes of age as he tangles with Hardin, a dangerous racketeer, in pursuit of Amber Rose. The result is a thoughtful, dark, sombre read that just about manages to balance style with substance."}, {"userName": "Carla", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/7965254-carla", "userReview": "Haunting novel, his literary debut, that marks William Gay as an incredible southern gothic writer. Set in Tennessee in the 1940's, Gay has set the standard for intensely developed characters who leap off the pages. Good, evil, justice, retribution... it's strength lies in its simplicity, its chilling landscape descriptions and the gritty lifestyles."}, {"userName": "Steve Payne", "userReviewDate": "Feb 19, 2016", "userURL": "http://www.goodreads.com/user/show/39634384-steve-payne", "userReview": "Mr. Gay could certainly turn a phrase but wasn't nearly as successful telling a story. For the life of me I still don't understand how the book ended. And I know it is a nitpicking thing but his use of halfwords really started to get on my nerves. I would rate this 2.5 stars."}], "description": "In a literary voice that is both original and powerfully unsettling, William Gay tells the story of Nathan Winer, a young and headstrong Tennessee carpenter who lost his father years ago to a human evil that is greater and closer at hand than any the boy can imagine - until he learns of it first-hand. Gay's remarkable debut novel, The Long Home, is also the story of Amber Rose, a beautiful young woman forced to live beneath that evil who recognizes even as a child that Nathan is her first and last chance at escape. And it is the story of William Tell Oliver, a solitary old man who watches the growing evil from the dark woods and adds to his own weathered guilt by failing to do anything about it. Set in rural Tennessee in the 1940s, The Long Home will bring to mind once again the greatest Southern novelists and will haunt the reader with its sense of solitude , longing, and the deliverance that is always just out of reach.", "title": "The Long Home", "url": "https://www.goodreads.com/book/show/972106.The_Long_Home", "average": 4.01, "cover": "https://images.gr-assets.com/books/1348942670l/972106.jpg", "reviews": 179, "authors": [{"url": "https://www.goodreads.com/author/show/62659.William_Gay", "name": "William Gay"}], "type": ["Fiction", "Gothic", "Historical", "American", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/972106.The_Long_Home", "http://www.goodreads.com/book/show/18245613-the-long-home", "http://www.goodreads.com/book/show/12045854-the-long-home", "http://www.goodreads.com/book/show/24945424-the-long-home", "http://www.goodreads.com/book/show/1202526.The_Long_Home", "http://www.goodreads.com/book/show/108315.Twilight", "http://www.goodreads.com/book/show/294731.Provinces_of_Night", "http://www.goodreads.com/book/show/294733.I_Hate_To_See_That_Evening_Sun_Go_Down", "http://www.goodreads.com/book/show/24998972-little-sister-death", "http://www.goodreads.com/book/show/319322.Wittgenstein_s_Lolita_and_The_Iceman"]}