{"ratings": 21252, "userreviews": [{"userName": "Aleeeeeza", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/4559727-aleeeeeza", "userReview": "*3.5 stars*Truth is, I don’t really have that much to say about this book. Was it good? Yeah! But was it amazing? Out-of-the-roof wonderful? Erm, I wouldn’t say that. The plot was fast, yes, and in this book, unlike the first one, the characters definitely were more developed, so in that regard it was great.Obviously, since the last envelope never got revealed in the first book, I was definitely wanting to find out what’s in it. And…all right, I’ll admit it, this book was kind of missing that all-over-Europe charm of the first book. I mean, yes, she visits Amsterdam and Paris again, and even goes to Ireland (!), but for some reason, it just kind of didn’t have that spark.But like I said, the characters in this book were more fleshed-out. Oliver, the oh-so-mysterious, snobby and (SUPER-DUPER) tall, dark and handsome dude was…well, hot. And you know how I feelz about HAMS…esp. in books. I do wish we’d gotten to know him better once we’d found out his motives behind the blackmailer-façade. He actually seemed like a reeeeally nice guy! Keith in this book was a lot more, let’s say, tolerable in this book. But, seriously, can someone PLEASE tell me what was up with his coming on to Ginny repeatedly despite the fact that he had, ahem, a GIRLFRIEND. Did I miss something…?Two other things I think are worthy of mentioning are: (1) I found it hard to believe that Ginny’s parents would send her all the way to England based on some phone calls with Richard, Aunt Peg’s hubby. Knowing the kind of people Aunt Peg used to consort with, wouldn’t they be a bit suspicious? And (2), in the first book Ginny composes a few letters to her best friend Miriam, and in this book I don’t think she was mentioned even once. I mean, don’t best friends deserve at least a couple of mentions? Amiright?Overall, however, it was a fun, good read that I might even give a go again sometime in the future when I’m in the mood to revisit Europe."}, {"userName": "Sonja", "userReviewDate": "Dec 07, 2012", "userURL": "http://www.goodreads.com/user/show/4798422-sonja", "userReview": "[I might have liked her relationship with Keith more than I ever liked Ginny's relationship with him, but also Keith doesn't deserve her because he's an asshole (hide spoiler)]"}, {"userName": "Jake Rideout", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/2518097-jake-rideout", "userReview": "Fans of Maureen Johnson have expressed both delight and dismay at the prospect of a sequel to 13 Little Blue Envelopes, originally published almost five years ago. \"More Ginny! More Keith! *squee*!!\" say the optimists. \"Maureen Johnson cannot possibly top the first book, especially since she didn't leave much in the way of loose ends,\" say the pessimists.Well, pessimists, let me put your concerns to rest. This book is as good as and better than the first one. You thought the wild careening around Europe was done? Wrong. You thought the romance was played out? Wrong again. Ginny has a new haircut, a new outfit, and 304 more pages of hilarious experiences, observations, and adventures.In the first book, Ginny finds herself alone in Europe with thirteen letters from her dead aunt. Each letter directs Ginny to a new location and teaches her a little bit more about Aunt Peg. But when Ginny is almost done with her journey, the last letter is stolen. Now, months later, a mysterious English boy contacts Ginny to tell her that he has found the thirteenth little blue envelope--and she has to come to London to get it.Maureen Johnson's genius lies in her ability to make the most mundane parts of life completely hilarious. She and John Green share the honor of being the best dialogue writers in YA fiction. This novel has the added bonus of taking place mostly in England, so there is a plethora of funny nicknames and insults.There's also a new character: Oliver, who is holding the last letter ransom. Tall, mysterious, and kind of dashing, he's the perfect addition to the cast of characters.I just finished the book today, and already I want to reread it.EDIT: Keith is in this book! He is as Keithy as ever. I would even venture to say that his car is a main character in this book too."}, {"userName": "Erin", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/1328574-erin", "userReview": "\"I'm not a violent person,\" Keith said under his breath, as they climbed the steps to the second level of the bus. \"But I've really been meaning to work on that.\"And here are the fruits of my labor. I have two major issues with this book, namely, the absurd retconning and the blatant character flanderization.First: Retcon. For those who don't waste more time than I would like to admit on TV Tropes (I'm speaking to everyone except Cecy), a retcon is RETroactive CONtinuity--the author waving their hand and saying, \"Hey, remember when we said this? Yeah, well, ignore that.\".The entire premise of the first, where we were sent places by Peg was completely disregarded, with only token mentions of the blue letter when the plot of \"OMGHESINLOVEWITHSOMEONEELSEWHATDOIDOOOO\" got a bit slow. We knew Peg was dying of cancer while writing these--it turns out that it made her certifiably loony, even though Richard didn't say anything about invisible dogs or cats or baby Ginnys. Her backpack that was stolen? Turns out it wasn't really 'stolen'; it was traded and someone bought it. All those feelings--which were gone into in slightly floofy detail--for Keith? Yeah, now she just whines, forgetting that she's the one who left, not him.Which segues nicely into my other point: character flanderization.When we meet Keith in the first book, he's a sweet, snarky, albeit-slightly-juvenilely-delinquent-y person who we all love. Cut to the sequel, and he's arrogant, unfeeling, jerky, and altogether unpleasent verging into cruel at times. Really? And all of this, just so that the author could pair Ginny up with the new guy we meet--there's always a new guy, as we've learned--who has the charm and personality somewhere in between a sprig of parsley and a single ice-skate (paraphrase courtesy of Dorothy Parker).Sorry, that doesn't fly with me. You can't completely change a character and have him half-play the FMC when dating another girl and--and--and--*Phew*Breathe, Erin, breathe.**The Last Little Blue Envelope, rated 13+, rated 2.4/5 stars."}, {"userName": "Reynje", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/5590906-reynje", "userReview": "[whereas Keith kind of inspired anti-swoon in me in the first book, (again: Keith!? No, just no..) I was feeling the swoon this time! I infinitely preferred Ginny’s interactions with Oliver (and Oliver as a character in general), as opposed to Keith, who I really just wanted to punch through most of this book and the former. It was really the Ginny / Oliver development through this book that kept me page flipping. (hide spoiler)]"}, {"userName": "Angel Gelique", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/13230091-angel-gelique", "userReview": "I was hoping that I'd enjoy this book much better than the first, but I honestly didn't. It started off interesting. Ginny receives an email from a stranger informing her that he has her backpack and the envelopes, including that last envelope that Ginny didn't get a chance to see. So it's back to Europe for Ginny to continue her quest to fulfill her deceased aunt's wishes. This time, we meet Oliver, who comes across as even more dislikable than Keith. And Keith! I didn't care much for him while reading book one and this time around, I had little to no respect for him at all. The story itself didn't really hold my attention much. There just wasn't anything thrilling about it. I admit, I did warm up to Oliver, but this story left me feeling terribly unsatisfied when there were no further developments with his character. The ending felt rushed and incomplete. Definitely disappointing, in my opinion. I wouldn't continue this series should another book surface some time in the future. I'm just not very interested in knowing what happens to Ginny and/or her \"friends.\""}, {"userName": "Susan", "userReviewDate": "Jun 15, 2011", "userURL": "http://www.goodreads.com/user/show/351657-susan", "userReview": "Some time ago, I unashamedly fell in love with Maureen Johnson's 13 Little Blue Envelopes. I included it in an imaginary teen book club series I constructed as a library school assignment and I would still swear that it is one of the most perfect books I've come across for a teen book club. One of these days I'll have one and use it. In the meantime I'll just continue to talk her book up to everyone I know. In the first book, quiet, practical Ginny is ambushed by her inheritance from her late aunt, a madcap artist whose last wishes involve Ginny doing some world traveling, following the breadcrumbs she leaves in the form of 13 letters. An unexpected hurdle separates Ginny from the last letter, but it resurfaces in the sequel along with fresh adventure, intrigue, secrets, and romantic complications. Once again, Johnson does a fine job with balance. She delivers poignancy without sappiness, romance without cheesiness, and captures every stop on Ginny's travels vividly without you feeling like you've stumbled into a travel guide."}, {"userName": "Brianna | RainyDaysAndStormyNights  ", "userReviewDate": "Dec 08, 2010", "userURL": "http://www.goodreads.com/user/show/2750336-brianna-rainydaysandstormynights", "userReview": "This is exciting, but I'm scared. :/After reading:4.5Still had all the elements of the first book, but it was a little slow and incomplete at times."}, {"userName": "Reut", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/3222236-reut", "userReview": "As you can see here, I did not enjoy 13 Little Blue Envelopes. I was very disappointed because I know Maureen is an awesome person. (Hello, she subbed for John Green on vlogbrothers!) I would have hoped that when Maureen decided to write a sequel, she would have looked at some critical reviews and maybe seen if what they were saying was true. (This is quite mean, but authors do this all the time. Just ask Lauren DeStefano.)BUT NO, SHE OBVIOUSLY DID NOT. BECAUSE EVERY.SINGLE.FRACKING.THING I HATED IN 13LBE IS STILL PRESENT!!!One of the problems I had with 13LBE is that Ginny had zero personality. I hoped that the trip to Europe would have influenced her to be a bit more... outgoing? Funny? Smart? And I thought we were getting somewhere when Gin cut off her braids. But alas, Ginny had not changed a bit, meaning all her flaws from 13LBE are still here.Another thing: when Oliver contacts Gin about the envelopes, she just kind of rushes off the Europe without a second thought. In 13LBE, I could overlook this, cause of benefit of the doubt and all. But really, Maureen? Taking the whole of one paragraph to explain how Gin got her parents permission to go to Europe... again??Now we arrive in England, and it is revealed that Ginny and Keith are \"kind of something.\" What the hell is that supposed to mean? Obviously nothing, because Keith, wonder of wonders, has a girlfriend! And he didn't bother to tell Ginny! This is the part where I would have stormed out, never to talk to Keith the arse again. But no! Ginny just smiles and keeps on going! WTF. Ginny is still a doormat.Look. Oliver is not the most likeable character in the book. Yet his actions are very easy to justify. He saw an opportunity that would make him money, without harming anyone. He took it. There's nothing wrong with that.Yet, according to the almighty Keith, Oliver is a terrible person, and he taunts Oliver throughout the book. Examples:Ginny and Ellis were throwing away the trash and just stepping outside when Keith started the car, gunned the engine (as much as this was possible), then pulled out abruptly. He headed right for Oliver. Oliver looked surprised, but he didn't budge, even as the white car came toward him.\"What's he...?\" Ellis said. \"Oh God.\"It looked for a moment like this battle of wills was going to accidentally--Accidentally?--end in death, but at the last second, Keith turned the wheel hard, fishtailing around, sending a wave of dirty, icy slush all over Oliver.Keith got out and surveyed his work with satisfaction. Oliver was trying to maintain his dignity, brushing himself off calmly. The force of the splash must have washed the Zippo out of his hands. He reached into an icy puddle and retrieved it. He flicked it a few times, but it didn't produce any flame.\"Doesn't work?\" Keith said. \"Oh, that is a pity.\"Let's get this straight. Keith is being an arrogant asshole and Ginny does nothing.I hate Ginny. And Keith.And I didn't like this book.But I still (inexplicably) like Maureen."}, {"userName": "Melissa McShane", "userReviewDate": "Oct 24, 2012", "userURL": "http://www.goodreads.com/user/show/1329059-melissa-mcshane", "userReview": "Near the end of 13 Little Blue Envelopes, Ginny's backpack, containing the last of her aunt's letters to her, is stolen before Ginny can read it. Though she manages to work out what her aunt's final message is, she still wishes she'd read the letter herself. Months later, she's contacted out of nowhere by someone who says he has her letter and wants to meet her. In England.This is the point where Maureen Johnson starts to prove that she is some kind of evil genius. Oliver (the letter-holder), rather than handing over Ginny's property, proceeds to blackmail her heartlessly. He's read about how much money Aunt Peg's paintings made at auction, and he wants a cut. I absolutely hated him. He's selfish, cruel, refuses to even let Ginny see the letter, and in general treats her like crap--as if he had any right to demand any of the potential money from the potential sale of the artwork Aunt Peg's last letter leads to. As if Ginny, who doesn't care about the money, wouldn't have given him just about anything out of gratitude for returning the letter.Hated. Him.But by the end of the book, after all the traveling back and forth, after Ginny's heart is broken by Keith and his new girlfriend that he couldn't be bothered to tell her about (This is not a spoiler. It's obvious that Keith started to distance himself in the first chapter.), Maureen \"Evil Genius\" Johnson managed to make me feel sympathy for Oliver, and then to like him, and then to like him a lot. There's a moment in the final pages of the novel that simply broke my heart at how vulnerable and not-evil he really was. That's pretty impressive.I like this book as a conclusion to 13 Little Blue Envelopes, or maybe an extension of it. I recommend reading the two back-to-back, if possible. Excellent duology."}, {"userName": "Ashley - Book Labyrinth", "userReviewDate": "Feb 15, 2011", "userURL": "http://www.goodreads.com/user/show/2304814-ashley---book-labyrinth", "userReview": "I was so ecstatic when this book appeared on Netgalley. Ever since I heard this was going to be a book, I was completely excited for it. This return to the envelopes and the journey was bittersweet, because while it was great to reconnect with Ginny, it was sad knowing the last of Aunt Peg’s letters would be uncovered, and that there wouldn’t be any more journeys after that.The traveling aspect of this book is incredible. One of the main reasons I loved the first ‘Envelopes’ book is because of the great journey through Europe. While the scale of the trip in this book is a bit smaller, it is in no way less engaging. I was happy to take part in more zany travel antics with Ginny and her pals, and to meet some more colourful characters. The book introduces a couple of new characters who are very important to the plot. Ellis is a bit of a spitfire, and she plays an interesting role in Keith’s life, where as Oliver is presented as the bad boy who just might have something more beneath his scheming exterior.I thought the overarching story between Keith, Ginny, Ellis, and Oliver was a bit predictable, but Maureen Johnson still presented it in an extremely delightful way. The zany adventure and the lovely details of this book (Harry Potter references, anyone?) make it quite irresistible. This is a great continuation of both Ginny and Aunt Peg’s story that you’ll definitely want to pick up if you enjoyed the first book. Also, I have to add that I adore Richard. Anyone else?"}, {"userName": "Sylwia (Wish Fulfillment)", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/7476945-sylwia-wish-fulfillment", "userReview": "Why I Recommend Bumping This Down On Your TBR: It has to create new conflicts from resolved matters in the first book, which means it messes with the resolutions and the aspects of the first book that we enjoyed."}, {"userName": "Brigid ✩ Cool Ninja Sharpshooter ✩", "userReviewDate": "Mar 07, 2011", "userURL": "http://www.goodreads.com/user/show/886144-brigid-cool-ninja-sharpshooter", "userReview": "Alrighty, so it's like midnight. And I could be working on writing my own book right now. Or I could be reading the book I wrote when I was 12, because I took it upon myself to read it again just to get another laugh out of it––it's horrendous and about talking cats. But I'm also sick and I have a terrible headache. Seriously, every time I stand up it feels like someone is hitting me in the back of the head with an axe. And I don't want to make that worse. So, like, I guess I'll write a book review.What does this have to do with the book? Um, nothing. I'm just stalling for a while, and complaining because a) I have no one to complain to right now, and b) no one really reads my reviews except Seth. It's rather sad. So Seth, here's another review for you.THE LAST LITTLE BLUE ENVELOPE. YAY.So, yeah. I love Maureen Johnson. A hecka lot. Not just as an author, but as a person. Recently she led a Twitter-riot against the horrendous Wall Street Journal article \"Darkness Too Visible\" which claimed that YA fiction is oh so dark and disgusting and poisoning the minds of today's youth and making us all cut ourselves, yada yada. I spent like a whole week fuming about this article. So if you want to hear me complain any more about it, just read my blog post about it. But anyway, Ms. Johnson started the #YASaves hash tag, which encouraged everyone to share their experiences with YA fiction and how it has helped/inspired them. It was awesome. And she is just ... awesome. 13 Little Blue Envelopes is the first of her books I ever read. I picked it up thinking it would be some shallow girly beach read that I wouldn't like ... and yeah, I guess it's still kind of shallow and girly, but I found myself strangely sucked into it nonetheless. Who doesn't love a crazy travel-all-over-Europe story, eh? Very cute and addicting book.After that, I picked up ... well, pretty much every book she's ever written: Devilish, The Bermudez Triangle, The Key to the Golden Firebird, Suite Scarlett, Scarlett Fever, Girl at Sea ... (And I am eagerly awaiting The Name of the Star––sounds SO EFFING EPIC! AAAH!) All great books. Did I get, like, extremely emotionally invested in any of them? No, not really. But they were all entertaining. (Okay, I lied. I wasn't really into The Key to the Golden Firebird, but I loved the rest of her books.)So in a way, The Last Little Blue Envelope kind of brings it full circle, because it reminds me why I love Maureen Johnson in the first place. Now, I was nervous about it. I'm always nervous about sequels––because often times, they suck. Or at least, they're not as good as the first book. Also, this book seemed to come out of nowhere. I didn't get the impression from the first book that it was going to have a sequel, although I guess it left a sort of open-ended conclusion, but––but I like when stories end that way!Oh, well. It's a Maureen Johnson book, damn it. So I have to love it. And I did like The Last Little Blue Envelope. As much as the first one? Ehhh, probably not as much. But like her other books, it was cute and addicting and over all quite enjoyable. *Yawns* GOOD MORNING! So yeah, I fell asleep after writing what you see above ^^ But now I am awake again. So, moving on.Where was I? Ah, yes. The Last Little Blue Envelope.So, like I was saying, I didn't know 13 Little Blue Envelopes was going to have a sequel; in fact, I suspect it was unplanned. Which only ticks me off a little. I just get annoyed that everything nowadays seems to have a sequel ... just because. A lot of the time, the sequels end up overcomplicating the plot or being a crappy repeat of the first book.I didn't think this sequel did either of those things, though. I mean, it wasn't the most fantastic book ever, but it was a fun read.So, the premise. We all know how, at the end of the first book, Ginny's backpack got stolen in Greece and hence she lost her dead aunt's last blue envelope. In this book, some mysterious dude named Oliver contacts her to tell her he has found her backpack and so has the envelope. Ginny just hops on over to Europe, because that's what she always does. First thing, she goes to visit Keith (aka love interest from the first book and creator of the brilliant \"STARBUCKS: THE MUSICAL\") and discovers in the span of about two pages that ... he has a girlfriend named Ellis. DUNH DUNH DUNH. Ah, long distance relationships. They always work out so well.What follows is a crazy road trip story as the band of four––Ginny, Oliver, Keith, and Ellis––travel around Europe ... once again. Well, what can I say. This is a very charming book. \"Charming\" is just the perfect word for it, I think.The character additions were nice. I was glad Ellis was actually a part of the story and had her own characteristics; she wasn't just a prop to create drama. And actually, there was surprisingly little drama over the whole Keith/Ellis relationship. Sure, Ginny was kind of pissed off but she and Keith really only argued about it once. I guess because the whole thing made sense. And anyway, Ginny had Oliver ... who was also a nice addition.I was initially kind of pissed off about his existence. It's kind of like, \"I'm bored with the hot guy from the first book, so I created a different hot guy!\" (A lot of sequels do this...) But nevertheless, Oliver is pretty cool. He has a photographic memory (or something similar) which seemed a bit unrealistic at times, but then again I don't have a photographic memory so I wouldn't know. This enables him to do useful things like recite Harry Potter books from memory, which he does in a café–-then tells the shocked onlookers that he knows Harry Potter so well because he's Dumbledore. So you know, he gets a hundred awesome points for that. He also apparently has a large penis. (Stop giving me that look ... Maureen Johnson kept saying so! It's just that, he'd be walking around in his underwear and Ginny would be like, 'Can't help but notice.' So, I guess that's realistic.) Also, Keith was being an asshole to him the entire book, so he got my sympathy.So, over all, a lovely read, simple but entertaining. Like all Maureen Johnson books, the writing is good, the characters are likable, and the dialogue is witty. She balances humor with tragedy well; I liked how, as in the first book, Aunt Peg's death and her lingering \"presence\" through her letters made the story bittersweet––with a good message about how we should appreciate small things and take time to notice the beauty of the world."}, {"userName": "Ella", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/23299706-ella", "userReview": "I honestly liked this one better than the first. 4.5 stars."}, {"userName": "Maddie S", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/59476659-maddie-s", "userReview": "After going on an amazing adventures do you ever feel like it's not over, or have a feeling that you haven’t accomplished everything you need to do?  Well in this fiction adventure Ginny Blackstone heads back to London for the last part of her Aunts directions. Looking forward to seeing Keith she ends ups going with Oliver the one who found the last envelope, Keith and a new friend Ellis. Like the first book the head where ever the letter tells them to, so they could stay in England, or go to Ireland. Going these distances would be easy in a plane or train, but not so much in a car with two guys whose personalities couldn’t be more different. Keith is wild, artistic and rude while Oliver is calm, collected, and can hold his tongue. Along with that Ellis and Ginny aren’t exactly alike, but they get along quite nicely. Ginny is a rule follower, and cares about her future and her new friends while Ellis cares for those same things except she can breaks the rules, and feel great about it too.     Ginny knows this last task is still in need of completion, so she follows the rules like she always does. She heads to where the last pieces of art are, and is faced with something that is outside of her comfort zone. Three pieces, three places, four days, and four people are in for this crazy adventure of love, mystery, but mostly a close to these 13 envelopes.     In comparison of the last book the author makes the reader want to know how it ends even if they didn’t like the first one, like me. I love to read, but not the first book to this adventure, and even though that was the case I felt like i needed to know how it ended. I think in order for this to my kind of book it would just need more of something that I can’t even place. Maybe it’s needs more of a lot of little things, but whatever it is was missing for my liking wasn’t there to keep me awake, and make me never want to put it down. The correct audience for this book I think would be maybe a seventh grade girl who likes adventure with endless detail, but maybe I’m wrong. Even though I didn’t like this book doesn’t mean it didn’t have any good qualities because trust me it did. The storyline was great, and the conflict between the character and objects were fantastic, but it just wasn’t my favorite book."}, {"userName": "Alyce (At Home With Books)", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/1433115-alyce-at-home-with-books", "userReview": "*This review contains spoilers for 13 Little Blue Envelopes.*The Last Little Blue Envelope has a slightly darker tone than the first book. Ginny is faced with a situation involving an extortionist named Oliver who she knows is not nice (and also might not be safe). She realizes though that she will have to travel with him to fulfill the instructions in the last envelope.The boy she met in the first book decides to travel with her and Oliver, and she sees a different side of him that she hadn’t seen before. She begins to wonder who is the more despicable person – the one who is the extortionist or the one who is supposed to be her friend.At first I was appalled at the darker tone of this book, but in the long run I ended up liking it just as much as the first. 13 Little Blue Envelopes was full of adventure and discovery, and personal growth as Ginny gains confidence in her ability to navigate through foreign countries. While the second book doesn’t lack those elements, it reflects the journey to maturity we all have to travel, in which we realize that people are not always what they seem, and that people sometimes mature at different paces. Ginny gets to see firsthand how it can take a while to know someone’s true character, and that there can be ugliness if you dig too deep.In the end I appreciated that this wasn’t just a re-hash of the same plot from the first book. It was still a fast-paced read, and even with the heavier issues it was by no means a depressing book. The ending is upbeat, and some minor plot threads are not tied up, so I have to wonder if there could possibly be another sequel."}, {"userName": "Mari", "userReviewDate": "Jun 04, 2011", "userURL": "http://www.goodreads.com/user/show/3314047-mari", "userReview": "I liked this book a lot more than Thirteen Blue Envelopes. I've read reviews saying that The Last Little Blue Envelope was less adventurous than its predecessor but I beg to disagree. Because while the first book felt like a flurry of one country after another, this one was more personal. And this time, there were no rules. I loved that this book focused on the characters' relationships while the countries they traveled to provided a backdrop that's both fitting and breathtaking at the same time. And even if the \"settings\" took a backseat to the story, it didn't stop me from looking places up and igniting in me a serious case of wanderlust. It's a bit depressing, really, to be my age and to not have had the chance to travel outside of Asia. Someday. But I digress.I thought Oliver's character was skeevy at first. And although I'm still not completely over the fact that he set out to blackmail Ginny, I understand why he thought that was his only choice. And their interactions particularly those in Dublin and back at London? One word = HOT. Keith on the other hand, was an ass. Didn't like him in the first book and on this one, I hated him even more. I liked Ellis though, and Richard too. An excellent read."}, {"userName": "Kaethe", "userReviewDate": "Mar 11, 2009", "userURL": "http://www.goodreads.com/user/show/1072582-kaethe", "userReview": "So the last, stolen, blue envelope makes an appearance and Ginny is off on adventures again. Lovely. Perfect really, with the hostel full of cats."}, {"userName": "Wendy", "userReviewDate": "Oct 06, 2010", "userURL": "http://www.goodreads.com/user/show/378822-wendy", "userReview": "WHUT WHUT! I don't approve in theory, but I know she can do it."}, {"userName": "Miranda", "userReviewDate": "Jan 02, 2011", "userURL": "http://www.goodreads.com/user/show/2681657-miranda", "userReview": "Disclaimer: ARC received from NetGalley.*THERE WILL BE SPOILERS FOR THE BOOK IN THIS REVIEW*Trigger Warning: There’s a surprising amount of bullying in this book by one of the main characters to another main character. It ranges from verbal to physical, including acts done with a car. I will be talking about it in my review, as well.When I first heard that there was going to be a sequel to Thirteen Little Blue Envelopes, I was cautiously excited and optimistic. Maureen Johnson is a favorite author of mine, and she’s rarely ever disappointed me. I was happy to read about the last blue envelope, Aunt Peg’s last letter to Ginny, and see the loose ends tied up. I’ll start with the good first. Johnson’s descriptions, as always, are beautifully written. She has a strong talent for getting the reader to simply imagine everything the characters are seeing, and it feels real, like you’re right there beside them. I especially loved the little touches she put into domestic settings, how it brought everything to life and made it seem like it really existed, like these were real people. Often times I would simply reread a paragraph of description just because it was so well done and I loved it so much. The pacing is also well done; there was never really a dull moment in the book, or a point where I felt, “Can we get on with this, please? It’s dragging, let’s go already!” Everything moved at a good, reasonable, realistic pace.It’s also much easier to believe that Ginny’s parents let her go to England in this book than it was in the first. In the first, she didn’t really know who she was staying with, or where, and it seemed a little unbelievable that her parents would let her go by herself without any means of contact. Now that she has her uncle and knows people there it was much easier to swallow. The other little thing I loved were Peg’s last letter to Ginny. I did actually tear up at one point, when she began describing her hallucinations, and when the letter ended. It was a good end to a long journey, for both of them. As much as it pains me to say it, I really did not like the character development in this book. Ginny’s was well done and believable, and I loved watching her grow, but the other main characters actually kind of irritated me. My biggest problem was Keith; when Ginny mentioned that his contact was becoming less frequent and that she was going to show up at his house without telling him, it was kind of a dead giveaway about where that particular relationship was going. Sure enough, Keith has a new girlfriend, but they never actually talk about that until later in the book. Ginny just assumes they’re together from the way they act around each other, and never actually confronts Keith about it. She keeps putting it off and putting it off until it finally blows up, and it’s just not a very satisfying ending to that relationship. Another problem with Keith is that he turned into a major jerk in this book. Suddenly he’s bullying Oliver, the man who has the envelopes, and he won’t let up. Granted there is a good reason for it: Oliver blackmails Ginny, which I’ll get to next, but it really went over the top. At a certain point it stopped feeling natural and felt more like Keith was being made to look bad so Oliver could look good in comparison, which made it easier to write and develop his and Ginny’s relationship. It felt like an easy way out. And Keith really went above and beyond jerkiness: At one point he covers Oliver while he’s sleeping totally in snow, and dumps some on his bag so all his clothes are wet. This is when they’re in Belgium and it’s freezing outside, so his clothes will be not only wet but cold. There are also a few times when Keith threatens Oliver with his car. It just seemed to come out of left field, and maybe that’s what Johnson intended, but it didn’t come off naturally at all. One aspect I did really love, though, was how well Ginny and Ellis, Keith’s girlfriend, got along. They didn’t have that many scenes together in the grand scheme of things, but not once did they fight over Keith, and not once did Ginny hate her for being together with him. In fact at one point Ginny states that she sometimes liked Ellis far more than Keith. It was very satisfying to see that sort of thing done well in YA; it’s not something you see often. Usually the other woman who’s with the main character’s love interest is written as a bitch, or a slut. I liked seeing two girls in love with the same guy who were friends, and never fought over said guy. While I wish they had a little more screen time together, I enjoyed what I got and I applaud Johnson for writing them that way. The last major problem I had with this book is Oliver, the guy who has the envelopes. He bought the backpack off of the people who stole it at the end of the first book and found the letters. He contacted Ginny and said he’d give them to her if she came back to London, which she did. They meet at a cafe (incidentally, right after Ginny visited Keith and found out about Ellis) and he hands over twelve envelopes. He refuses to hand over the last one, because Aunt Peg wants Ginny to put together one last painting, with pieces she did that are spread out in various places that Ginny’s visited. Once that painting is assembled, Oliver wants to sell it off and take half of the money as a finder’s fee. He never says why he wants half of the money, and threatens to leave with the envelope if Ginny doesn’t agree. He states, point blank, he’ll leave and she’ll never see the envelope again if she doesn’t agree.Ginny, to her credit, finds it incredibly sketchy and is appropriately freaked out. But she goes along with it, because what other choice does she have? And that is my biggest problem with Oliver. He blackmailed her into doing what he wanted, and that is not a good way to start a relationship. He later becomes the new love interest, and I had trouble accepting that because of his actions when they first meet. As I said before, it really did feel like Keith was made into a jerk just so Oliver would look better by comparison, and it didn’t really work because of the blackmailing. At no point did I want Ginny to end up with him, simply because of that raw deal he made with her. It is, of course, later revealed that he had good need for the money, but Ginny explicitly says “You could have just told me that and I would have handed it over.” Still, they kiss and may at some point in the future become a couple, and it was just very hard to be happy with that outcome. It’s always better when relationships have trust in them, and when they don’t start out with one part of the couple blackmailing the other. There were times when the easy way out seemed to have been taken. Keith and Ginny, in an attempt to get the last letter back, plan to have Keith steal it from Oliver at a train station before he and Ginny leave for Paris. However, they arrive at the train station and only then begin making the actual plans. Isn’t it kind of stupid to plan out that sort of thing when your target could be anywhere in the midst of hundreds of people? Sure enough, Oliver arrived earlier than them and saw them plotting and figured it out, keeping them from getting the letter. It seemed like a kind of sloppy way to keep the letter from them and make Keith and Ellis join along in the adventure. All in all there were extremely good parts to The Last Little Blue Envelope: I enjoyed the writing, as always, and I liked Ginny and Ellis. Oliver I grew to tolerate but I never quite forgot how he came to be involved in the whole adventure, with the blackmailing and all. Keith was a major disappointment and a somewhat baffling turn of events. I did like seeing how everything tied together, and Ginny’s final decision at the end of the book. It felt natural and strong and empowering, and I really did love seeing her go through with it. I would reccomend that fans of Thirteen Little Blue Envelopes read the sequel, but with some very strong reservations. It’s a good ending to Ginny’s journey, even if at times it was a little irritating. I’m very much looking forward to Johnson’s next book, The Name of the Star, which is the first in a new series."}, {"userName": "Jennifer", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/16483058-jennifer", "userReview": "That's how you win at life, Gin. You have to imagine your way through. Never say something can't be done. There's always a solution, even if it's weird.\"\"And I think something is beautiful if it reveals something important about what it means to be alive.\"\"I don't know why people find this idea so hard to get. I mean, you can throw any two people together, it doesn't mean they'll fall in love. Everyone knows this.\"\"It's always easier to say good-bye when you know it's just a prelude to hello.\"Soundtrack: 101 by WALLA"}, {"userName": "Mollie", "userReviewDate": "May 17, 2010", "userURL": "http://www.goodreads.com/user/show/647089-mollie", "userReview": "Thirteen Little Blue Envelopes was one of the first books I read when I first \"re-discovered\" my love of YA during my graduate school years. I'd devoured most of Dessen's books and stumbled on 13LBE. I LOVED it. While I recall many people having issues with her parents letting a teenager gallivant across the world, I have such a horrible case of wanderlust, and always have, that I didn't give a crap whether it was realistic. When I heard there was going to be a sequel I was ecstatic! However, it had been so many years since I read 13LBE and I have a horrible memory. I just had the barest recollection about what had happened in 13LBE. I recalled Ginny's Aunt dying and sending her off on this adventure. I remember a boy. I remembered exotic locales and quirky characters. Lastly, I remembered that the last envelope was lost. And that was about it. The Last Little Blue Envelope begins with Ginny receiving an email from Oliver, an English lad, who happened upon the last envelope. Having opened and read the letter Oliver realizes that Ginny's Aunt's artwork is worth a fortune and that the last envelope gives Ginny clues to assembling her Aunt's final piece of art work. Oliver demands to go with Ginny and, once the piece is assembled and sold, half the profit. For the most part I enjoyed the book however, one thing really irked me. When Oliver tells Ginny what he's planned she doesn't question him. One of the first things I'd do is ask someone \"Why are you doing this?\" Obviously he's after money. But common, in all the time she never once thinks to ask him why? As readers, we pick up on things that Ginny clearly overlooks. She clearly knows he's somewhat of a decent guy, despite the extortion. So, if he's mostly an a-okay guy wouldn't you assume that there is some situation in his life that has left him no other options but to take advantage of someone else? Wouldn't you ask why? She never asks why until the book is practically over. Even if she had asked why it's likely that Oliver wouldn't have spilled his guts but at least she would have asked. I was so frustrated the whole time wanting Ginny to friggin' ask him why already! Gah.This frustrating bit hampered my enjoyment of the novel somewhat. Overall, this installment was enjoyable and we see Ginny grow, however I felt it lacked the magic and spark from the original. But fans of the first book will be happy to revisit Ginny and other characters and get a sense of closure that the first book lacked."}, {"userName": "Nikhat Hetavkar", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/11465068-nikhat-hetavkar", "userReview": "[ Keith? He's here. I never really liked him and Ginny together. That Oliver guy was cool. The background story predictable. But when did he and Ginny connect? And to what extent that she decides to stay in London? For a girl who claims to be sensible and practical, it was one flaky move.  (hide spoiler)]"}, {"userName": "Annie  Carlson", "userReviewDate": "Dec 05, 2010", "userURL": "http://www.goodreads.com/user/show/2609076-annie-carlson", "userReview": "Holy shit, guys. That was freaking boss. Honestly, it's hard for me to describe how much I adore this book. Everything was fantastic. The plot. The characters. The way it was written.... I didn't want it to end, nor be that frustratingly short.*Spoilers from here on out*First of all, I love Oliver. Ahh. I was so happy that he was introduced. Keith has always annoyed me. He's just, well, annoying. And I dislike his name. It makes me feel icky. Buuut, Oliver. Maaaan. That man is pure sexiness. I just wish Ginny and him would have just got it on as soon as possible. But, nooooo. Of course not, that would have SENT ME OVER THE FUCKING MOON. Alas, not. That doesn't even close to happen.I love how we got to see the last letter wrapped up and everything. Perhaps there could have been a bit more adventure in that, but oh well. At least we got a new book.Some minor complaints- 1. I wish there would have been more character development for Ellis. I sort of felt like I knew her at the end of the book. But... eh. Not really, her and Ginny could have talked more or something.2. I wish there would have been a stolen kiss with Keith. Although, I dislike him, it would have been scandalous and created some more fun drama.3. Speaking of which. I wanted way more of kissy time with Oliver! It was only at the end of the book that she started liking him. :( That made me so sad. Did I mention how much I love Oliver?4. And lastly, maybe the ending could have been a little more bittersweet? Everything sort of flawlessly worked into place and that made me raise my eyebrows a little bit. But not much. I love happy endings.Sooooo yeah. I love this book. It's fantastic, I guess I basically just wish there would have been more of it."}, {"userName": "Maria Myka", "userReviewDate": "Nov 04, 2016", "userURL": "http://www.goodreads.com/user/show/8205139-maria-myka", "userReview": "\"It's always easierto say good-byewhen you knowit's just a preludeto hello.\""}, {"userName": "Antonia", "userReviewDate": "Aug 09, 2010", "userURL": "http://www.goodreads.com/user/show/2880601-antonia", "userReview": "There's going to be a second book!!!!!!!"}, {"userName": "Adriana", "userReviewDate": "Jun 14, 2012", "userURL": "http://www.goodreads.com/user/show/7391803-adriana", "userReview": "[Caution: This review will contain some SPOILERS for BOTH Little Blue Envelope novels!]After Thirteen Little Blue Envelopes, we leave Ginny reeling from her intense journey of self-discovery after she’s gone on this wild, unbelievable traipse through Europe. Of course, the only blemish on her travels would be that the last envelope that her late Aunt sent to her was stolen while she was on a beach in Greece (I think it was Greece). Personally, I wasn’t too tortured about this dilemma in the first place. I liked that the novel didn’t have a traditional “happy ending,” and, much like Ginny, I accepted that the last letter was lost and that life would go on, forcing her to take what she DID learn along the way with her instead of mourning over everything she did NOT know. So, in my opinion, I kind of wish the thirteenth letter would have stayed lost.You know me, though—I’m an unfailing optimist. When I saw that there was a second book (!!!) published so long after the first—and titled The Last Little Blue Envelope, no less—I was kind of excited, truthfully. I really enjoyed the verse throughout the first installment and I had so much fun reading about Europe through Ginny’s eyes while she went on this mad dash across continents that she initially knew nothing about; Keith was a really cool character as well and I loved that he didn’t turn out to be a “fling,” and nor did they try to swing an unrealistic continuation of their relationship when she flew back home to America; I also adored Aunt Peg, whom some might argue is not a “real” character in the story, but who claimed some of the best writing in the book with her incomparable spirit. So, yes—I was excited to go back to the verse and I, like Ginny, was curious to know just what was in that last envelope and what it could possibly bring to the table.To be honest, not enough.This second novel was problematic pretty early on. Ginny’s been back in the States for a while now—she’s even starting to apply to universities—yet she’s still pining after Keith despite the fact that they’re separated by an entire ocean (and then some) and that they’re not DATING. One day, Ginny gets an email from someone who has recovered her backpack, which was pawned off on him, and who has discovered the thirteenth letter. This person asks if she would like to come collect her letter since it seemed like a personal matter. This is the perfect excuse for Ginny to—what else?—jump on a plane and go scope out the whole Keith situation. (Let’s be real, the guise of the trip was to retrieve Aunt Peg’s last letter, but we could totally tell that Ginny just really wanted to get back on her English Boy Toy and re-establish some momentum.) I don’t know—I can suspend my belief for one crazy trip across Europe, but the second one seemed a little sketchier right from the get-go.So what is established when Ginny touches down is that her Uncle Richard is still a cool guy and—surprise, surprise—Keith is dating a new gal whom is as tirelessly bright as the sun. Enter Ginny feeling threatened, jealous, and depressed all at once, deflating the momentum of the storyline straight away. I really didn’t like that there was such an intense focus on love—or lack thereof—in this novel; what I really loved about the first book was the purity of Ginny’s discovery of possibility and of qualities in herself that she didn’t know she had. It was truly an introspective story for her and more of a journey of self rather than worrying about the fact that she might not get some hot foreign ass while she’s out there doing her Aunt’s crazy [but sometimes brilliant] bidding. For me, Ginny’s fixation in THIS installment on romance and attraction makes me feel like it sort of undermines the great realizations she unearthed on her first trip. Her Aunt Peg would roll over in her grave if she had witnessed how annoyingly obsessed Ginny is with what she perceives to be a love triangle between her, Keith, and Ellis. It honestly just grated me, because I feel that Ginny should be smart enough to assess a situation—a guy she once kissed and hung out with is dating a new girl, who is great—and to come to the conclusion that she should put it behind her and move on if she wants to keep Keith as a friend. But no—we get a lot of moping from Ginny in this book, sometimes deterring her from her trip’s purpose, and consequently leading to many, many, MANY scenes with Keith as opposed to her new alleged “love interest.”That segues nicely into my second point: Oliver. My overall opinion of him can be summed up with, “no.” Oliver is the new love interest for Ginny, though you would never know by his clipped attitude, lack of personality, aptitude for hiding things, and his overall rude demeanor. I was extremely disappointed with Oliver’s existence, mostly because I saw this blog post written by a YA enthusiast who listed all of her favorite fictional male leads and he was number THREE out of ten; she dubbed him sweet and swoon-worthy, none of which is true in the slightest. How am I supposed to be led to want Oliver for Ginny when, just to start off with, he’s BLACKMAILING her? He literally calls her to a meeting in a coffee shop—where he’s described more as a potential mugger than a heartthrob—and tells her that the last letter, which he has already read (go figure), contains a paper trail to another piece of art that Aunt Peg has left behind for her collection that she wanted Ginny to sell. Absolutely no one is shocked when he confesses that he wants in on the cash. Ginny continues to further annoy me by not even WONDERING—let alone ASKING—why this complete stranger is in such desperate need of money that he’s willing to ask a girl he’s never met to fly in from America, go on a treasure hunt to assemble this piece of art, and then fork over a huge chunk of the proceeds. No, this thought never crosses her mind until the END of the book and, honestly, its unveiling did absolutely nothing to help boost Oliver’s character. I don’t care if he was literally dying and needed funds to pay off his medical bills for a life-saving operation—whose first instinct is to blackmail an innocent girl into giving you money that is intended for her and then convince her to go on a three day trip with you ALONE? Anyone? And, as it turns out, his reason for wanting money is purely selfish which he justifies by saying, “I figured since you made a bunch of money off the first sale, I wasn’t stealing from someone who was broke.” Yeah, the guy’s a real charmer, folks.Besides his entire premise—which is really the kiss of death, let’s be honest—Oliver’s entire appeal is supposed to be rooted in his appearance. This is a huge misstep on Maureen Johnson’s part because I will never ever trust a relationship that’s built on the foundation of “he/she is attractive” because it HOLDS NO SUBSTANCE. The first time Ginny thinks of Oliver in “that way,” it’s because of his gait and how he looks “dashing.” The second time she has a stirring, it’s because she sees Oliver in his underwear and then wonders if he flounces around in his underwear in order to seem more “human” and “vulnerable.” (Nice try, Maureen Johnson.) Top this off with the fact that Oliver and Ginny almost NEVER interact besides sitting silently next to one another in the back of a car and moodily writing one another off (if you even count this as interaction—which I don’t) and the only times they ever have what could be considered a “connection,” in the barest of terms, is when they have ONE “real” conversation/outing while strolling around Amsterdam. Besides that, the only time I felt that there was some kind of understanding between them was when Oliver tells Ginny to do the last part of the letter by herself because (since he’s already gone ahead and read/memorized it) he knows that it’s more of a personal moment that she should experience alone. I think the only other time Maureen Johnson tried to humanize Oliver—as someone who’s NOT an asshole and who’s blackmailed a girl and her friends into taking him on a road trip by being the only one with access to the last letter just so that, in the end, he can maybe take said girl’s money—was when he was doing some “magic tricks” in a café and when he used his super duper memory trick to recite some Harry Potter in a marijuana café—I shit you not. Other than that, there was absolutely nothing between them, and even if there was, I would still have been extremely put off by the small fact that he’s BLACKMAILING HER for 90% of the book. (No, I will not let it go.)I’m pretty sure Keith and Ginny have more scenes and more dialogue than Ginny and Oliver, so my suggestion to Maureen Johnson is that, if she wants the readers to “feel the love” between two characters, then maybe—just maybe—she should have those characters INTERACT and stare at each other’s genitalia less. (Disclaimer: I’m not, in the slightest, saying that sexual attraction can’t play a part in “real” romance—but it AT LEAST has to be written well in the first place and certainly not as the tenure of an already thinly built relationship.)Moving on.Things I liked about this novel: I really loved the poetic elements fueling Aunt Peg’s final piece and, as always, Peg claimed nearly all of the good writing in this novel with her beautiful letters. Even though a majority of the plot was displeasing, Ginny’s voice was still readable and she was still written with a good sense of humor. Keith, of course, is the winner hands down for GREAT humor, because he was a total gem diction-wise and, as per his usual, he took the cake with his dialogue, because he’s the perfect mix of sarcastic and witty. It’s such a shame that all of that is overshadowed by the fact that he was a complete jerkwad and professional asshat, too, but if I spent time mourning over Johnson’s male characterization, then we’d be here all day. All in all, it was still a decent read and it wasn’t completely devoid of merit, but it was a significant step down in the series that didn’t bring me any satisfaction and which led me to believe that the series would’ve been better off without it written at all; the ends did not justify the means. The relationships were written poorly and this novel just didn’t have the same spirit as the first because it seemed like a haphazard miniature version of its predecessor with a boy-crazy narrator. I think I liked it more when I hadn’t read it, actually.Anyways, at least this series is laid to rest and at least I had some laughs along the way—which I consider a good thing. Now I can move on with my life without the intense nagging feeling that Maureen Johnson is depriving me of answers to all of my burning questions regarding Ginny’s life post-Europe. [Sarcasm.] Can I get a, “Huffah”?"}, {"userName": "Lacey", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/62155226-lacey", "userReview": "This is one of those funny times where I enjoyed the sequel more than the original. I feel like in this one, I flew right through it, eager to see what was going to pan out through the end. In the last book, Ginny has her backpack stolen from her, along with the sacred thirteen letters from her aunt. This book is the story of how a young man named Oliver finds it by buying her stolen backpack and basically holding it hostage. Let me just say that this book did a very good job with character development. I went back and forth from hating to loving to hating again to loving again multiple times with each character. Oliver especially. I feel like if I say too much, I'll give most of the story away, so just read this book, it was very, very good! ☺"}, {"userName": "Anky's Book Bubble", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/61924443-anky-s-book-bubble", "userReview": "The Last Little Blue Envelope in some ways was even better than the first book.I loved the fact that there was a consistency of characters unlike in the first book, where Ginny travelled too much to have a consistent friend by her side.I had so much fun reading this book and I'm so sad that it ended so soon. I wish it hadn't.The only thing I did not like about this book was the ending. I wish there had been a better closure. It didn't feel like an ending, to be honest. It was as if the author just left it unfinished.Though the journey up until then was absolutely enjoyable, entertaining and so much fun!"}, {"userName": "Jesi Sarracino", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/12551527-jesi-sarracino", "userReview": "What a sweet sequel to 13 Little Blue Envelopes. I really did enjoy getting to catch up with Ginny and taking the adventure of that last little blue envelope. Is Aunt Peg weird? Yes. Are we all a little weird? Yes. I love the idea of someone you think you know, who you have figured out turns out to be different than you realize. Oliver was different than he seemed, even Aunt Peg. We all are different, and you just have to figure out how the two personalities collide. I really enjoyed this book, and I feel great about how it ended!"}], "description": "Ginny Blackstone thought that the biggest adventure of her life was behind her. She spent last summer traveling around Europe, following the tasks her aunt Peg laid out in a series of letters before she died. When someone stole Ginny's backpack—and the last little blue envelope inside—she resigned herself to never knowing how it was supposed to end.Months later, a mysterious boy contacts Ginny from London, saying he's found her bag. Finally, Ginny can finish what she started. But instead of ending her journey, the last letter starts a new adventure—one filled with old friends, new loves, and once-in-a-lifetime experiences. Ginny finds she must hold on to her wits . . . and her heart. This time, there are no instructions.", "title": "The Last Little Blue Envelope\n      \n          (Little Blue Envelopes #2)", "url": "http://www.goodreads.com/book/show/9462775-the-last-little-blue-envelope", "average": 3.86, "cover": "https://images.gr-assets.com/books/1288297853l/9462775.jpg", "reviews": 1565, "authors": [{"url": "https://www.goodreads.com/author/show/10317.Maureen_Johnson", "name": "Maureen Johnson"}], "type": ["Young Adult", "Romance", "Contemporary", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/9462775-the-last-little-blue-envelope", "http://www.goodreads.com/book/show/26074213-the-last-little-blue-envelope", "http://www.goodreads.com/book/show/17020.13_Little_Blue_Envelopes", "http://www.goodreads.com/book/show/13595639-the-name-of-the-star", "http://www.goodreads.com/book/show/2328841.Suite_Scarlett", "http://www.goodreads.com/book/show/270363.The_Bermudez_Triangle", "http://www.goodreads.com/book/show/15721638-the-madness-underneath", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider"]}