{"ratings": 3588, "userreviews": [{"userName": "Ahmad Sharabiani", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Last Leaf, O. Henry (Editor), Raymond Harris (Editor), Walter Pauk (Editor), Robert J. Pailthorpe (Illustrator)تاریخ نخستین خوانش: پانزدهم ماه مارس سال 2003 میلادیمترجمها: حبیب الله آتشی در 95 ص؛ علی حسنی فرد در 55 ص همراه با داستان معجون عشق؛ عبدالعباس سعیدی همراه با یازده داستان دیگر در 160 ص؛ ناصر خلیلی مهدیرجی؛ در 38 صآقای حسن شهباز هم این داستان را به زیبایی ترجمه کرده است، هرگزی از یادم نمیرود، استاد شهریار شاعر عاشق نیز این داستان را سروده استمادری بود و دختر و پسری، پسرک از می محبت مستدختر از غصه ی پدر مسلول، پدرش تازه رفته بود از دستیک شب آهسته با کنایه طبیب، گفت با مادر این نخواهد رَستماه دیگر که از سموم خزان، برگها را بود به خاک نشست صبری ای باغبان که برگ امید، خواهد از شاخه ی حیات گسستپسر این راز را مگر دریافت، بنگر اینجا چه مایه رقت هستصبح فردا، دو دست کوچک طفل، برگها را به شاخه ها میبستشهریارا. شربیانی"}, {"userName": "Florencia", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/21575078-florencia", "userReview": "\"It is the last one,\" said Johnsy. \"I thought it would surely fall during the night...\"Dear, dear!\" said Sue, leaning her worn face down to the pillow, \"think of me, if you won't think of yourself. What would I do?\"But Johnsy did not answer. The lonesomest thing in all the world is a soul when it is making ready to go on its mysterious, far journey. The fancy seemed to possess her more strongly as one by one the ties that bound her to friendship and to earth were loosed.\nA good story. Even though I prefer language with a little less sugar when dealing with certain matters. (Good grief, Hemingway, is that you?)Dec 10, 15* Also on my blog."}, {"userName": "Dem", "userReviewDate": "Dec 18, 2015", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "Faboulus little book that I will certainly try to get a copy of for my library.I love little stoies like this that have so much meaning in so little pages.Wonderful and enlightening."}, {"userName": "Urmi  ✨ BookishPixieOfForbiddenForest✨", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/52697970-urmi-bookishpixieofforbiddenforest", "userReview": "5/5 full stars...Loved it😍😍😍😍😘😘😘😘!!!!!Why do O'henry's stories always tend to make me terribly schmaltzy?????In this book, I especially liked how O'Henry personified \"pneumonia\" and also Mr Behrman's appearance.This story is based on instincts about life and death. Though O'henry's books are famous for the awesome plot twists, but this short story based on a dying woman and a \"failed\" sexagenarian painter's first and last masterpiece, is a very heart-rending story indeed. The tragic death of Mr Behrman kept my insides hurting. This was indeed one of the most touching and moving short stories I've ever read😢😢😢..."}, {"userName": "ilknur a.k.a. iko ◬ ", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/18816035-ilknur-a-k-a-iko", "userReview": "Bu kitabın doğru edisyon altında olduğunu düşünmemekle birlikte (ben eklemedim, varmış), bendekinin 54 basım olup 14 hikaye olduğunu belirteyim.İlk defa O. Henry okuyorum ve şu fenomen 'fakir iki sevgilinin birbirlerine hediye almak için, habersiz, biri saçını satıp saat zinciri, öteki saatini sararak fil dişi tarak aldığı o acıklı hikaye'nin aslı bu amcaymış meğersem.Sohbet havasında, kıssadan hisse havasında, didaktik ve sürprizli sonlarla, sade bir dille yazılmış hikayeler. Hani bu artık internet köşelerinde görebildiğimiz, bir zamanlar forumların vazgeçilmezi hikayeler gibi.Bu arada yazar Amerikalı. Kent ve kentli manzarasını basitçe aktarıvermiş. Son Yaprak, Define, Kan Davası, Bir Harlem Faciası adlı öykülere gerçekten bayıldım. Diğerleri de çok güzeldi ama bunlardan ayrı bir tat aldım ben. Özellikle Kan Davası diğerlerinden bence farklıydı.Ben de bir de MEB'den 94'de çıkma bir kitabı daha var seçilmiş öyküleri olarak, 3 öykü ortak sadece. Yarın gidip edisyonu bulamazsam ekleyip başlarım belki.Bir veda cümlesi bulamadım.Esenlikleiko"}, {"userName": "Magdalen", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/46843838-magdalen", "userReview": "Four characters and a few pages  that's all it took for O. Henry to write this heart warming, touching, bittersweet short story. The themes of love, death, sacrifice are found in this short gem. I guess the last leaf symbolizes the last hope of life that people hold on to. It's a beautifully and simply written story."}, {"userName": "Soheil", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/75570253-soheil", "userReview": "\"برمان گفت:سرانجام روزى شاهكارم را ميكشم و آن وقت همه با هم از اينجا مى رويم\"و پيرمرد شاهكارش را كشيد...داستانى كه هيچ وقت فراموش نميكنم."}, {"userName": "Sepideh Tafazzoli", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/17947512-sepideh-tafazzoli", "userReview": "In my opinion, the message lying behind last leaf’s short story, message that comes through most powerfully is that you should not judge people by their outward appearances or social persona. The story describes the artist that lives beneath, Behrman, as an old drunk who had never found success and hated weakness though he goes out in the middle of a storm to paint a leaf for Johnsy. This self-sacrifice is an interesting point why would he do such a thing earlier in the story he laughed at the idea of counting the leaves. The story does foreshadow him painting the leaf in that he is always talking about the masterpiece he is going to paint and how he is a protector of the two young women that live above him. Now the inference that can be taken from his actions is that he had touched no one with his art, he had no true masterpieces. By painting the last leaf he insured that Johnsy would be affected by his art, even only to get her through her illness. He paints a leaf in the pouring rain just for her and so she would pull through. She realized her foolishness when the leaf had staid and made a complete turnaround. The work done by Behrman saved her life."}, {"userName": "Mahsa  fanaei", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/34073227-mahsa-fanaei", "userReview": "این داستان کوتاه رو بارها به شکل ها و زبان های مختلف خوندم و شنیدم و چی می تونم بگم جز اینکع عالی بود؟!شاهکار برمان و فداکاریشبله، آدمیزاد برای زندگی کردن و ادامه دادن به امید احتیاج داره؛ حتی یه امید الکی و مصنوعی"}, {"userName": "Khush", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/76759105-khush", "userReview": "'The Last Leaf' is an excellent story. First, I read it in school. Now after years I read it again and found out what I missed in my first reading, and how my teachers were implicated in telling us only the 'safer' aspects of the story. They told us about friendship, concern, help and so forth, but they did not even slightly mention any other dimension, for instance, of same-sex love. I would have done the same if I were in their shoes.With adult hindsight, I see how this short story is about same-sex love. To state it more clearly, this story can fit into an anthology of modern-day LGBTQ writings. It is a story of two young women artists, Johnsy and Sue, who live together. One of them gets sick, and the other brings her back to health by her devotion and care. In the story, these two women are almost depicted like a homosexual couple. They live together and they deeply care for each other. In the story, we are told that they meet in a restaurant and learn that they have many things in common. They move in a shared flat. But I assume that there is more to this 'move' that O' Henry did not 'dare to speak its name' hundred years ago, he did not spell it out for us, however, he suggested its depth and its existence in very clear terms.At one point in the story, the doctor tells Sue that he cannot save those patients who lose will to live. He goes on to ask her Johnsy's condition has anything to do with a 'man.' This how they speak in the story;“She has a very small chance,” he said. “She has a chance, if she wants to live. If people don’t want to live, I can’t do much for them. Your little lady has decided that she is not going to get well. Is there something that is troubling her?”“She always wanted to go to Italy and paint a picture of the Bay of Naples,” said Sue.“Paint! Not paint. Is there anything worth being troubled about? A man?”“A man?” said Sue. “Is a man worth—No, doctor. There is not a man.”This is interesting how sharply Sue brushes aside this conjecture as if she is offended in some deep way. 'Is a man worth' also shows a very firm feminist streak in her, which only means that 'men' do not figure in their lives in the way doctor seems to have imagined. Later in the story, she helps and takes care of Johnsy in every possible manner. She acts like a seasoned lover. She chides Johnsy for imagining weird things about her sickness. For instance, Sue speaks to her with the poignancy of a sad lover. These words indicate their deep same-sex love. “Dear, dear Johnsy!” said Sue. “Think of me, if you won’t think of yourself. What would I do?”There are also two other things in the story that make us see the connections between very visible contemporary gay life to the lives that were lived a century ago. It is interesting to see how Mr. Pneumonia enters the Greenwich village to infect its residents. Most of these residents are unusual in many ways, they are struggling artists, failed artists, people who want to do extraordinary things, and come from different parts of the country to inhabit this particular place, and be in the company of those who share their passion, their ways of being in the world. The story in these ways shows both the dangers and rewards that life poses to queer people without naming names."}, {"userName": "Niradhip", "userReviewDate": "Mar 17, 2013", "userURL": "http://www.goodreads.com/user/show/17969689-niradhip", "userReview": "Wonderful story, demonstrates the power of hope and belief. The supremacy of faith in life, changes the course of existence altogether. The metaphor of masterpiece is magnificently described. Masterpiece is not something which can be described as a materialistic entity; rather it’s a self-explanatory deed which doesn’t really require any introduction or admiration. Masterpiece would be created automatically when we realize the real purpose of life. I would like to give 3.5 to ‘The Last Leaf’."}, {"userName": "Shayan", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/49895475-shayan", "userReview": "چه شاهکار هنری بزرگ تر از جون کسی رو نجات دادنهمون کاری که جراح ها در سرتاسر دنیا هرروز انحام میدن"}, {"userName": "Linda", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/1740304-linda", "userReview": "I read this short story in middle school, and it's one of those that I would still think about every once in a while. So, 40 years later, I decided to re-read the tale that stuck with me so tenaciously. Like that last leaf on the tree.I enjoyed it once again this time around. I didn't remember all the details, and it was fun to rediscover the classic O. Henry irony. I may have to re-read some more, and maybe find some new ones.And here's a link to it so you can read it for yourself. It will only take a few minutes.https://americanenglish.state.gov/fil..."}, {"userName": "Shrilaxmi", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/38604089-shrilaxmi", "userReview": "I loved this story. The ending was totally unexpected. I like the way O' Henry personifies pneumonia and describes his characters. The writing is so simple but it teaches you a lot about love and sacrifice. The way humour and tragedy is mixed is exceptional. This story will stay with me forever."}, {"userName": "Brian Yahn", "userReviewDate": "Dec 14, 2015", "userURL": "http://www.goodreads.com/user/show/22849115-brian-yahn", "userReview": "The Last Leaf is one of those short stories where at the end you grin and say, \"I see what you did there.\" Unfortunately, where most of O Henry's works are voice-y and entertaining, this one seems like it's ripped out of a Hemingway collection."}, {"userName": "Con Bé Ki", "userReviewDate": "Sep 25, 2016", "userURL": "http://www.goodreads.com/user/show/7062340-con-b-ki", "userReview": "Hihi, sáng nay tự nhiên thức dậy sớm hơn thường lệ, kiểu chả hiểu vì sao 6 giờ sáng đã tỉnh như sáo trong khi chưa từng có tiền lệ (sáng nào mình cũng nướng ít nhất là 7h30 từ thứ 2 - thứ 7 và 10h sáng CN), mới giả bộ mở cái ứng dụng Ybook lên. Rồi cũng chả hiểu vì sao lại có cuốn Chiếc lá cuối cùng trong đấy, mà lại chỉ có một cuốn duy nhất, chắc là hồi xưa tải về rồi chọn đại một cuốn miễn phí nào đó :D Rồi thì vì độ dài nó có 33 trang nên là lật chắc khoảng tầm 5-7 phút là xong nội dung. Thấy cũng không thực sự xúc động với câu chuyện là mấy ^^ Coi như là lần đọc lại để nhớ chi tiết hơn so với việc từ trước tới giờ chỉ nhớ mang máng mà chẳng biết Chiếc lá cuối cùng là chiếc lá cuối cùng nào, có khi là Chiếc lá cuối cùng của Tuấn Khanh thì chết kaka"}, {"userName": "Ashley", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/32654906-ashley", "userReview": "Oh crap! Why do O Henry's short story endings always have to make me cry?! LOL!"}, {"userName": "Eti Mishra", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/11204272-eti-mishra", "userReview": "This story is really beautiful and one of my favorite short story written by this author.\"The Last Leaf\", this story symbolize a lot of different aspects of life;hope, friendship, sacrifice , pessimism, optimism and death.There were four characters, Johnsy, Sue, doctor, and old Behrman.Johnsy was a pessimist, while Sue was an optimist. Old Behrman here in this story was a friend , who sacrificed. All three of them were artists.Old Behrman had never painted a masterpiece, but he said that, one day he'll paint a wonderful picture, a masterpiece.And he did, he painted the last leaf on the vine, before he died, and saved a life of an ill friend, Johny, who binds herself with a fancy that she'll die with the fall of last ivy leaf.According to me in this particular story the leaf symbolize life, death and hope. The life of a tree can be guessed by looking at its leaves, also the last leaf in this story signifies hope of life for tree and as it falls it conveys death.I love the twist and ironic circumstances in O. Henry's stories and this short story was worth reading."}, {"userName": "Gautam", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/32002534-gautam", "userReview": "A very Unique story with a shocking ,unprecedented twist that changes the whole dimension of the story . Until the culmination of the story , it was hanging around an eerie fancy debating in mind whether the last leaf that apparently dictates johnsy's life (an abstarct mind-woven concept by an ill-stricken mind) would fall-off or not . The Shocking twist when unveiled adds lot of substance and showcases the ingeniousness of Henry.4 stars on 5 !-gautam"}, {"userName": "Rao Javed", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/18653053-rao-javed", "userReview": "Absolutely beautiful story. Breathtakingly beautiful... I am at my wits end to define the beauty of this story. Hope is a weapon. :O"}, {"userName": "Mariam", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/11086410-mariam", "userReview": "One of my favorites."}, {"userName": "Rezvan ", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/66026556-rezvan", "userReview": "عالی بود"}, {"userName": "Mohsen M.B", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/54459079-mohsen-m-b", "userReview": "بین چهارونیم و پنج مرددم! ـانقدر داستان قشنگ و جالبیه که حتی اقتباس سروش رضایی از دید طنز هم شاهکار از آب در اومده.ـنمیدونم چرا ولی به طرز عجیبی من رو برد به حال و هوای کتاب درخت و برگ"}, {"userName": "Lynda Williams", "userReviewDate": "Sep 16, 2012", "userURL": "http://www.goodreads.com/user/show/12882766-lynda-williams", "userReview": "I read this story in junior high or earlier (more than 45 years ago), and while I couldn't remember the title or author, the imagery and concept stuck with me all these years. I read the story more than once in my youth, never paying attention to either title or author. I loved the idea of someone being that good a friend, and it was my first exposure to the \"theory\" of mind over matter, and hope overcoming even disease and death. At least, that's what I took from it.A friend recently sent me a script he'd written that put me in mind of it, and I shared what little I remembered with him. He immediately knew the reference, because although this story didn't inform this particular script, it is one of his favorite short stories by a favorite author.As a result of this new information, one of my very next Kindle acquisitions will be a collection of O. Henry short stories."}, {"userName": "Sumati", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/13187326-sumati", "userReview": "O'Henry has never failed to evoke my emotions...never!!!! Stories are short but heart quenching....depth is not bound to pages, it can be achieved in few lines as well.The Gift of Magi was my first book of O'Henry's. I was in school when i read it and till today the story lingers in my memory.That is the power of his writing! I have since read many of his works and they have left their impression on me as well. The ironical twists narrated by each story is commendable."}, {"userName": "Darkiknowwell", "userReviewDate": "Dec 18, 2010", "userURL": "http://www.goodreads.com/user/show/4187886-darkiknowwell", "userReview": "I simply loved this story. Not only was it magical, but thought provoking too. The lesbian subtext was portrayed really well, and the humanity of the story was uplifting. \"The Last Leaf\" is a must read for everyone and is an excellent introduction to O. Henry. Can't wait to read \"The Gift of the Magi\" and his other stories!"}, {"userName": "Simin Yadegar", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/39418834-simin-yadegar", "userReview": "تنهاترین چیز در دنیا روحی است که خود را برای آخرین سفرش آماده می کند .... از متن کتاب"}, {"userName": "Perihan", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/47956300-perihan", "userReview": "\"Hayret ! Bütün gece devam eden yağmur ve şiddetli rüzgara rağmen, dalda bir tek yaprak kalmış. Yerden 5,6 metre yükseklikte, bir dala mucizevi olarak asılı kalmış...\"Dikkat Spoiler!Evet bu hikaye çoğunuza tanıdık gelecek, bu hikayede çok ciddi hasta olan ve pencerenin önündeki sarmaşık yapraklarının tamamının döküldüğünde öleceğine inanan ,genç bir bayan ve bir de aşağı katta yaşayan , yaşlı yetenekli bir ressam var. Yağmurlu ve fırtınalı bir gün sonrası o ressam , zatüreden ölür ve kız sabah o kalan tek yaprağı görünce birden canlanır, iyileşeceğine inanmaya başlar ve gerçekten de durumu iyileşir ... Evet nasıl oldu da o son yaprak orada kaldı? Evet anladınız sebebini... Sonra bir bildik hikaye daha size, birbirine delice aşık , ama çok yoksul bir karı koca. Evlilik yıldönümleri için kadın, o ipek gibi uzun güzel saçlarını keser satar , kocasının çok sevdiği saatine zincir almak için; kocası da karısına gümüş tarak, toka seti almak için ne yapar? Tabi ki tahmin ettiniz... İşte daha önceden okuduğum bu güzel kitapta bulunan tanıdık hikayelerin sahibi O. Henry.Gerçek adı William Sydney Porte ve genelde şaşırtan sonların adamı olarak biliniyormuş. Gerçekten her hikayesinin sonunda bir şaşkınlık yarattı bana da Çok akıcı, unutulmaz tasvir gücüne sahip bir anlatımı vardı hikayelerin..."}, {"userName": "Lnaz Izd", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/15685709-lnaz-izd", "userReview": "Now that I had the chance to go through the story again, I could still see signs of the old feelings I had toward the story. Like I have not aged since the last time I touched the passage with the profundity of my soul and heart. Impressions, personifications and words chosen to describe every detail in the story gets you attached so artistically that you can see yourself among the people in the story, among their conversations. You can be Sue , worried about Johnsy, the best thing you have in your life. You can be Johnsy, so hopeless that you can't even think of the wishes you were to reach. All this made me appreciate O'Henry's great piece of art, written in a style impressing people of different ages and different tastes. I think of last leaf as a masterpiece, like the one indicated in the story , but this time it would be given the name O'Henry as the artist who painted it."}, {"userName": "Zainab Alrifai", "userReviewDate": "Aug 16, 2014", "userURL": "http://www.goodreads.com/user/show/12859643-zainab-alrifai", "userReview": "يااااه والله كانت أيام درست هالقصة بمادة short stories بالجامعة وكان مفروض اشرحها للبنات تأثرت فيها كثير جميلة جدا"}], "description": "Sue and Johnsy are two girlfriends who live together in New York City. When Johnsy becomes sick one winter, she makes up her mind to die when the last leaf falls from the ivy plant growing outside her window. Sue would do anything to help her friend get well, but she is a poor artist. As the winter wind blows and the rain falls, there seems no way to stop the last leaf from falling.", "title": "The Last Leaf", "url": "http://www.goodreads.com/book/show/213395.The_Last_Leaf", "average": 4.35, "cover": "https://images.gr-assets.com/books/1375410369l/213395.jpg", "reviews": 215, "authors": [{"url": "https://www.goodreads.com/author/show/8993.O_Henry", "name": "O. Henry"}, {"url": "https://www.goodreads.com/author/show/98123.Raymond_Harris", "name": "Raymond Harris"}, {"url": "https://www.goodreads.com/author/show/357079.Walter_Pauk", "name": "Walter Pauk"}, {"url": "https://www.goodreads.com/author/show/3933784.Robert_J_Pailthorpe", "name": "Robert J. Pailthorpe"}], "type": ["Short Stories", "Classics", "Fiction", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/213395.The_Last_Leaf", "http://www.goodreads.com/book/show/2608506-the-last-leaf", "http://www.goodreads.com/book/show/29079624-son-yaprak", "http://www.goodreads.com/book/show/35620696", "http://www.goodreads.com/book/show/22823185", "http://www.goodreads.com/book/show/1633655.The_Last_Leaf", "http://www.goodreads.com/book/show/18336655-son-yaprak", "http://www.goodreads.com/book/show/143534.The_Gift_of_the_Magi", "http://www.goodreads.com/book/show/14469.Selected_Stories", "http://www.goodreads.com/book/show/963839.The_Ransom_of_Red_Chief", "http://www.goodreads.com/book/show/31626.The_Gift_of_the_Magi_and_Other_Short_Stories", "http://www.goodreads.com/book/show/14467.The_Best_Short_Stories_of_O_Henry"]}