{"ratings": 1968, "userreviews": [{"userName": "G.R. Reader", "userReviewDate": "Oct 29, 2015", "userURL": "http://www.goodreads.com/user/show/25304792-g-r-reader", "userReview": "And then, as time went on, the poets themselves introduced the reign of vulgar and lawless innovation. They were men of genius, but they had no perception of what is just and lawful in music; raging like Bacchanals and possessed with inordinate delights—mingling lamentations with hymns, and paeans with dithyrambs; imitating the sounds of the flute on the lyre, and making one general confusion; ignorantly affirming that music has no truth, and, whether good or bad, can only be judged of rightly by the pleasure of the hearer. And by composing such licentious works, and adding to them words as licentious, they have inspired the multitude with lawlessness and boldness, and made them fancy that they can judge for themselves about melody and song. And in this way the theatres from being mute have become vocal, as though they had understanding of good and bad in music and poetry; and instead of an aristocracy, an evil sort of theatrocracy has grown up. For if the democracy which judged had only consisted of educated persons, no fatal harm would have been done; but in music there first arose the universal conceit of omniscience and general lawlessness;— freedom came following afterwards, and men, fancying that they knew what they did not know, had no longer any fear, and the absence of fear begets shamelessness. For what is this shamelessness, which is so evil a thing, but the insolent refusal to regard the opinion of the better by reason of an over–daring sort of liberty?Yes, I'm talking about you, Goodreads."}, {"userName": "Coyle", "userReviewDate": "May 16, 2012", "userURL": "http://www.goodreads.com/user/show/433617-coyle", "userReview": "Despite having been assigned it in my Classical Political Thought class, I only in the past few days finished reading Plato's Laws (apologies to Dr. Walsh). Which is a bit unfortunate, since it's bloody fantastic.I confess to having had a bit of a \"meh\" relationship with Plato in the past. I mean, the number of his dialogues that I've actually enjoyed (as opposed to just kind of thinking they're okay) is pretty small- basically the Ion and maybe bits of Epistle VII. Sure, I've read and discussed what are usually counted as his greatest works (Gorgias, Meno, Apology, and of course The Republic) and even taught them in class (I prefer teaching the Crito, since it's short and a quick read for the students). But this was the first book where Plato and I really clicked. It was the first one of his that I've read where I found myself wanting to read more, to find out where the argument was going, and to see what the next step in his argument would be. Part of the reason for this may have been a translation issue (I read the Penguin Classics translation of The Laws done by Trevor Saunders- an excellently done work with good footnotes and introductory summaries), and part of it may have been the fact that all the other times I've read Plato it was for class. I can't say for sure what the reason is, just that this has ended up being a book that I truly enjoyed reading and look forward to (someday) exposing to students.The way I've regularly had The Laws explained to me is that it's Plato's admission of failure. In undergrad, it was covered in a Greek civilization course where the prof (for whom I have the deepest respect) suggested that Plato had given up on trying to get anyone to care about the virtuous philosophical life and turned his final hopes on getting them at least to be good because the law said they had to. In the aforementioned graduate course, the professor (for whom I also have the deepest respect) suggested that The Laws is more of an appendix to The Republic, wherein the \"Philosopher Kings\" who exist at the center of the ideal state in The Republic have withdrawn from society, leaving behind only the laws they crafted. (I suspect this view is traceable back to a philosopher named Eric Voegelin, for whom I have slightly less respect but whom I occasionally enjoy reading.) Having finally read the book myself, I think I disagree bit with both of these position. Certainly it's true that Plato is issuing some kind of passionate call here- after all this was his last and longest work. But I think a better way to read The Laws is as a second shot at The Republic. In The Republic, Plato had argued that people ought to live virtuous lives within virtuous states. The same argument is at work here. But! In The Republic, when asked how such a state could ever come about, Plato gives a mix of reasons including (but not limited to): education, hard work, divine intervention, leadership by a philosophical elite, some form of natural selection, and a life of continually increasing and unrestrained virtue. In other words, all of the ways in which people expressly do not want to live. How does Plato argue his state will come about in The Laws? By playing games, drinking, a life free from all but the most moderate work load, and enough sex to keep the state populated. Same goals, different means. It's true that there are differences between The Republic and The Laws (perhaps most noticeable is the presence of families in The Laws which had been outlawed in The Republic in lieu of communal wives and children), but these differences are very much organizational differences rather than differences in the philosophical goal of virtue.Such, at least, is my read on the relationship between The Republic and The Laws- they're not really two radically different books, they've just got two different audiences. In a sense, I think it could be argued that the former was written as a guide for the Philosopher Kings, while the latter was written for at least the Guardian class, if not for the rest of the citizen body...The biggest major modern issue with The Laws (at least as of the writing of the translator's Introduction in 1970) is the question of whether or not Plato was a totalitarian. This goes back to a book by Karl Popper written in the 1930s called \nThe Open Society and Its Enemies\n. Popper argued that any philosophy that teaches moral absolutism will eventually lead to totalitarianism, since moral absolutes are non-negotiables. As someone who clearly believes in moral absolutes, Plato must therefore be a totalitarian. Variations on this theme have followed Popper, but all are loosely tied back into his original thesis. The translator takes a fairly middle path through the book, pointing out places where Plato seems to be totalitarian, and places where he is fairly liberal in his outlook (the absolute equality of women, for example). I think the problem is we're asking an anachronistic question. Were we to say to Plato \"are you a totalitarian or not?\" His reply would be \"huh?\" That is to say, no such category existed in the Ancient World. In one sense, all ancient societies were totalitarian. There was no distinction between the individual and the state. After all, an ancient would argue, states are made up of bodies of individuals. So when you do something wicked, that makes the state that much worse. And when you do something virtuous, that makes the state that much better. With that being the case, why wouldn't the state have the authority to regulate even the most minute details of daily life, should it be necessary for preserving the virtue and dignity of the society? This would not be seen as either repressive or intolerable. Really, the only two political categories of major concern to ancients in any meaningful sense were 1) who was allowed to participate? and 2) what was the goal of the government? Any combination of answers to these questions could be more or less \"totalitarian\" by modern standards, that simply wasn't something they were interested in. And, this reflection is going on probably longer than it should. After all, I haven't even said much about the book itself. I think this might have to turn into at least one more post, if only to keep the length of things manageable...So, the short version is: this is an excellent book that raises all kinds of great questions (and gives great answers) to questions like: what is the role of education in society and individual life? What should be the goal of legislation? Who watches the watchmen? (seriously, that's one of them) What is the role of the elderly in society? And so on...Highly recommended."}, {"userName": "Mina Soare", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/1843780-mina-soare", "userReview": "The one Plato work that makes for accessible, organised, readingI have the greatest respect for Plato’s work and what it has meant for Western thought and Western culture. To my chagrin, Plato and the Socratic dialogues have proven hard to go through, if you are like me the sort who: * sees an argument that looks strange* picks it apart, because believes character is flippant* works on refuting it for 5 minutes* realises author is dead and can’t answer* does a Tasmanian Devil impersonationHowever, here we are dealing with a lecture, rather than a debate, which will hopefully make it easier to digest the ideas. If not, this book might still be for you, as a coherent, comprehensive layout for main governance issues or for the mental exercise of ‘coding’ a fictional Polis from scratch. It is very rewarding."}, {"userName": "Garrett Cash", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/7701118-garrett-cash", "userReview": "This mammoth work is one of Plato's most important, and not very widely read books. There's good reason for this, while there are important passages in this, the work is ultimately like reading an Ancient Greek version of Leviticus. In other words, it's really... really boring."}, {"userName": "Levon", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/10508540-levon", "userReview": "The 3-star rating is an average of the ratings I would have given each of the twelve Books of the Laws if they were read separately. Some flaws in the text:- The Athenian Stranger leaves open very important facets of legislation, while thoroughly legislating much less pertinent ones.- Heavy burden placed on assumptions of many kinds to do with human nature.- Inherent counter-productive legislation (ie: legislation with a view to friendship, but allowing - nay, promoting - citizens to denounce one another)However, I think these flaws are needed, as they represent the great difficulty in embarking on man's greatest journey: creating an entirely new political order. Plato's Laws is an essential read for lovers of political theory and philosophy, as it is one of the few books that deals with the aforementioned task.On a side note, I especially loved the Book on punishments and the Book on gods, even as an atheist."}, {"userName": "Tyler", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/27498265-tyler", "userReview": "The Laws of Plato is not entirely laws. It is not entirely anything, really. It seems to be a nice collection of aphoristic sayings, wise and pithy truths, and overall a collection of legal requirements for a city whose regulation is the main focus of this work. Designing a city can be difficult, and whereas The Republic was largely metaphorical and none too practical, pragmatism is the design for this book. In addition to designing laws, Plato goes step-by-step and designs the arguments one should have to devise said laws, and even to devise said arguments to devise said laws (this may seem recursive on first glance, but in some cases the justification was indeed the punishment, as in the justification for the law itself would most likely have been the appropriate logical foundation of the purification rites, in addition to incarceration). It is dry. It is bland. But so was the Old Testament, and at times, this can seem very reminiscent of that old law-based text as well. With very key differences and very key similarities; one major key difference was the lack of enforcement of principal on loans. Another key difference was the allowance for anger for expiation of crimes. If committed in anger, it is curious to note, this hypothetical Cretan utopia would NEVER punish with death, unless a matricide or patricide. The Judaic law of course, would have had this individual pay for his crimes through the avenger in blood: Talion. Likewise, the former point, regarding the principal on loans is something enforceable in the Old Testament as well as many other lawbooks throughout the ages, whereas in Plato's Laws it is simply relegated to the lender. As if to say that the lender is the one who has the responsibility to make sure he is lending to a responsible individual. And if the borrower doesn't repay, it is the lender's fault. This wouldn't work obviously unless you had a society which was religious-based. The overall banishment of usury from both books simply makes this sort of mentality apparent: greed, fundamentally, is not compatible with an ideal utopia, and is therefore a sin. Overall, Laws hearkens back to a time when expansion through Greek colonies was rampant, and reminds one even of the incipient days of America, when the Constitution had to be constructed for the benefit of civil society. This magnificent work of art deals with ideas and philosophies that are in every other Platonic book: it deals with the very argument of the existence of God. And Genesis, is the one key similarity with the Old Testament that strikes me, believe it or not. It is thought, says the Athenian stranger, that the core idea of the immortality of the soul precedes all material things. Because of this fact, there is a prime force from which springs all life. In the union of soul and body, proceed all sorts of sinful things, and from which spring ideas which are harmful to humanity. Plato makes the argument for predestination as well through this, by simply stating that God(s) have placed things where they will for their pleasure, seeing that in the end virtue (Good) triumphs over vice (Evil). Because of this, the struggle is made entertaining, even though there is more bad than good. Because of an eventuality. The strange capricious, chaotic, and overall aphoristic argument of the Nietzscheans regarding will and exertion on reality is even dealt with here. Simply the fact that we can create ourselves or in part create reality is completely denied and shot down with Chapter X of this beautiful work of art. Everything is well placed, everything divine, and if everything is followed a utopia will proceed. Clearly even this ridiculously dry, litigious work is not the exact outline for a city, however it is the backbone from which a utopia springs. And whereas The Republic is a way for a man to live his life, it could be said The Laws are the way for a republic to live its life."}, {"userName": "Billie Pritchett", "userReviewDate": "Mar 15, 2014", "userURL": "http://www.goodreads.com/user/show/1571969-billie-pritchett", "userReview": "I'll open myself up for criticism and confess that I did not actually finish Plato's Laws. I made it all the way through Book VIII, then I started skimming, and when that proved just as boring, I went and looked at the secondary literature about the work. (There's a great summary at Stanford Encyclopedia of Philosophy in an entry titled \"Plato on Utopia,\" available HERE.Plato's Laws is a work written by Plato in his later years, when he's an old man. Interestingly, Plato had been, prior to writing The Laws, an advisor to a tyrant in Sicily whose rule Plato was supposed to guide. Instead, Plato landed in prison. Before the problem with the tyrant, Plato had written in his younger days The Republic, where he had imagined a just society to be the mirror of the just soul, where wise kings rule spirited soldiers and pleasure-seeking working classes just as people justly control their souls by having their wisdom control their motivations and desires.There is nothing in The Laws approximating this tripartite division of the soul or of the just society like that in The Republic. Nor is there a robust sense of the ideas commonly associated with Plato, like his view that knowledge is a soul's recollection of what was already imprinted on it before the time of birth, although some views, like his view that what we tend to experience of reality are crude approximations of eternal forms, is retained, even if expressed a bit differently. The later Plato is concerned with how the human condition came to be as it is today, and how we can recover that earlier sense. For the later Plato, then, there is a more perfect and eternal order but it might have been, for all he or anyone knows, a really existing condition.The later Plato believes that once upon a time God governed the world and human beings lived a harmonious life, without need or strong desire. People lived and shared everything in common. Then as people began to control more of their own affairs, they began to create inequality and need and be ruled by their strong desires. Plato writes in The Laws, contra The Republic, that the most perfect society was like this society: where people live in harmony and share everything in common. But Plato does not think we can recover that society and so proposes the second most ideal society, the details of which are about as enjoyable as eavesdropping on a city planner.I invite you to read the following passage and see if you have the patience for reading pages and pages of the following sorts of descriptions:The temples are to be placed all round the agora, and the whole city built on the heights in a circle, for the sake of defence and for the sake of purity. Near the temples are to be placed buildings for the magistrates and the courts of law; in these plaintiff and defendant will receive their due, and the places will be regarded as most holy, partly because they have to do with the holy things: and partly because they are the dwelling-places of holy Gods: and in them will be held the courts in which cases of homicide and other trials of capital offenses may fitly take place. As to the walls, Megillus, I agree with Sparta in thinking that they should be allowed to sleep in the earth, and that we should not attempt to disinter them; there is a poetical saying, which is finely expressed, that “walls ought to be of steel and iron, and not of earth; besides, how ridiculous of us to be sending out our young men annually into the country to dig and to trench, and to keep off the enemy by fortifications, under the idea that they are not to be allowed to set foot in our territory, and then, that we should surround ourselves with a wall, which, in the first place, is by no means conducive to the health of cities, and is also apt to produce a certain effeminacy in the minds of the inhabitants, inviting men to run thither instead of repelling their enemies, and leading them to imagine that their safety is due not to their keeping guard day and night, but that when they are protected by walls and gates, then they may sleep in safety; as if they were not meant to labour, and did not know that true repose comes from labour, and that disgraceful indolence and a careless temper of mind is only the renewal of trouble. But if men must have walls, the private houses ought to be so arranged from the first that the whole city may be one wall, having all the houses capable of defence by reason of their uniformity and equality towards the streets. The form of the city being that of a single dwelling will have an agreeable aspect, and being easily guarded will be infinitely better for security. Until the original building is completed, these should be the principal objects of the inhabitants; and the wardens of the city should superintend the work, and should impose a fine on him who is negligent; and in all that relates to the city they should have a care of cleanliness, and not allow a private person to encroach upon any public property either by buildings or excavations. Further, they ought to take care that the rains from heaven flow off easily, and of any other matters which may have to be administered either within or without the city. The guardians of the law shall pass any further enactments which their experience may show to be necessary, and supply any other points in which the law may be deficient...I quoted such a full passage to give you a sense for the sheer tedium of reading this dialogue. This dialogue, incidentally, reads the list like a dialogue of any of Plato's dialogues I have read. There are lengthy passages like this that go on for passages with hardly any of the interlocutors asking questions or making comments.It is clear what the message of Plato's Laws is. The purpose of this just society Plato is creating has the sole purpose of being as most near to what it was like in the early days when people were ruled by God and when the people were the most virtuous. The aim of this society is to cultivate the highest virtue in people. The citizens are to learn through gymnastics, music, persuasion about life matters, and a strong education how to be virtuous, and to have their virtue maintained. Unfortunately, so much of the trivia of the dialogue do not seem to be necessarily related to this. It is hard to, for example, see how the placement of temples with respect to the marketplace will make a society less just, or the people less capable of virtue. At the very least it's difficult to see why such things need to be spelled out. Maybe they do. Could be my lack of imagination."}, {"userName": "Phillip", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/7510654-phillip", "userReview": "\"The Laws of Plato\" translated by Thomas Pangle is a difficult but amply worthwhile read. The volume contains a lengthy \"Interpretive Essay\", by the translator, that is so full of enthusiasm for \"The Laws\" that it is more pleasant reading than the translation itself. In fact, I would be tempted to recommend a new reader to read the \"Interpretive Essay\" before tackling the translation.The \"Interpretive Essay\" increased my appreciation for this book that I have read a couple of times before in another translation (and, of course, most recently, Pangle's translation). The essay does a great job of pointing out literary flourishes in the drama of the dialogue that contribute to an interpretation of what is said in the dialogue. Pangle pieces together the parts of the long discussion that make them (the parts) significant. Pangle brings the whole scheme out for the reader's examination, changing, or at least influencing, one's attitude that perhaps \"The Laws\" isn't quite the literary white elephant it is generally assessed to be.Granted, it is no \"Republic\". It isn't one of the great dialogues of Plato. But, it does contribute to the overall cannon. \"The Republic\" describes the ideal city throughout an allegorical argument to define justice in the soul of a man. In the process he presents the theory of the forms, discusses education, and provides the reader with some of the greatest philosophical imagery to be found in Western literature. But, the ideal city was never intended to be made a reality in our physical world.\"The Laws\" on the other hand, provide a consultation between three old men about the laws necessary to found a city. The principle speaker, the Athenian Stranger, argues that the purpose of the laws is to treat the spirits of the city's inhabitants in the way that a medical doctor heals physical bodies. The Athenian Stranger outlines institutions in Commerce, Defense, Religion, Education, The Family, and on and on. Principle values are full public disclosure and equality between men and women.Yet, a reader will find the culture portrayed as different from modernity as the landscape from a well-developed piece of fantasy or science fiction is from our world. The stated purpose of the translator was to provide contemporary readers, who do not have a background in classical languages, with a presentation of Plato's thought that goes beyond a summary or gloss of the original. He wrote that we live in a time in which: \"by the awareness that our culture--a liberal republicanism fueled by the forces of modern technology--has come to be riddled with self-doubt, and is under attack from vigorous and influential thinkers of both the Left...and the Right... No adequate defense of liberal democracy will be available, no complete evaluation of the attacks upon it will be possible, until we grasp its specific character in detail, by comparing it with the ancient Socratic tradition which the philosophic founders of liberalism in large part rejected and overthrew.\" (p. 375) With all of this said, I recommend this translation of \"The Laws of Plato\", not as one's first Platonic dialogue, but rather as something to read after having read the great philosopher at his best in such works as \"The Republic\" or \"The Symposium\". I believe that by itself it would usually turn off a reader from completing the dialogue, much less to be inspired to read other works by Plato."}, {"userName": "Cosmo", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/8036158-cosmo", "userReview": "I had a hard time doing much with this text. It is rich, but I'll leave it to better minds than mine.I'm going to stick to The Republic, Symposium, Phaedrus, Crito, the Apology, etc. If you want to figure out the Laws, good luck to you."}, {"userName": "Alex", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/58827667-alex", "userReview": "I liked this more than the Republic. In fact, I'm not sure why the latter, and not this is Plato's signature work, though maybe I'm just outing myself as a pleb. It does revisit a lot of the same themes. The absence of Socrates is jarring, even to a casual reader, but I didn't mind. The Athenian, the Cretan, and the Spartan get straight to the point. There's no hair splitting framing device about the meaning of justice.Magnesia will be located in Crete, and will strictly try to maintain its population of 5040, which is not an arbitrary number. It has some divisibility properties, which would help with the management of the state, and Plato really wants to keep the population steady. Even if there's a plague he warns caution regarding who you ought to let in to replace those lost citizens.The government will in true Platonic fashion, care for and thoroughly manage its population from cradle to grave, though it's good to see him abandon the scheme of abolishing the family. The end of course shall be virtue, and hence we get a lot of discussion, not just on legalisms, but on human nature, and the latter is really my favorite part of the discourse.There are two main themes that everything seems to spring from here, obviously not just in this Platonic dialogue. You will see shades of his other works here. The two themes are the division of human nature into the rational, the spiritual, supreme over the material and the sensual, but also the existence of a separate and objective world of ideas.There is a lot of discussion of mastering one's passions. Gluttony and lust ought to yield before reason. Such an ideal will strengthen the citizens, it will help them prevent from ending up “slaves of those who are able to endure amid pleasures.” We ought to practice mortification, and guided by reason search for decent middle point between enjoyment and discipline: “he who draws from [pleasure and pain] where and when, and as much as he ought is happy.”Plato actually views virtue as the most important element of education and as idealistic as it is I have to agree with this. We may end up in a wide variety of stations in life, but isn't the most important thing to remain a good person amidst it all?I found his view of art fascinating, as he absolutely believes that beauty is objective, and not only that, but tied to virtue as well. He's not a big fan of avant-garde musicians. “the poets themselves introduced the reign of vulgar and lawless innovation. They were men of genius, but they had no perception of what is just and lawful in music; raging like Bacchanals and possessed with inordinate delights… and making one general confusion; ignorantly affirming that music has no truth, and, whether good or bad, can only be judged of rightly by the pleasure of the hearer” This nonsensical music is nothing more than then the sensual overwhelming reason “the instigation of lawless pleasures” Art is a window into the world of ideas, into the divine, and as it is rational, it will have rules, but it will still be pleasant, the most sublime type of pleasant, but he doesn't emphasize this enough . Praising Egypt for keeping its statues the same for ten thousand years wasn't the best approach in my opinion. Naturally, he proscribes censorship.As we recall from the Republic, the principles one finds in the individual, one can also apply to the state, and just as the individual must practice moderation so should the state as a whole, both extreme poverty, and extreme wealth are going to cause harm, and overwhelm the role of reason in the individual. “the war is against two enemies- wealth and poverty one of whom corrupts the soul of man with luxury, while the other drives him by pain into utter shamelessness”As the divine plays such a central role in his philosophy, Plato laments that religion is fading away. “Now that a certain portion of mankind do not believe at all in the existence of the Gods...[or don't believe they are of any consequence]” even oaths ought to be abolished, but this is not the ideal situation. He spends a chapter trying to prove the existence of God, rather passionately. “Who can be calm when he is called upon to prove the existence of the God? Who can avoid hating and abhorring the men who are and have been the cause of this argument”I would say the main flaws are that Plato, as typical of reformers, overestimated the power of government to bring his ideal society into reality. He believes the incest taboo is derived from custom and not from biology. The story of the dragon's teeth is proof that the state can indoctrinate its citizens into any belief the statesman finds useful. Through the use of education, Plato thinks that his citizens will be able to unite virtue and pleasure, to accommodate themselves to proper manners of art, and be repulsed by the abstractions which offend him so much. The young will not be allowed to question the laws, written works will be censored, and even impiety will be punished.It's nice to see a bit of self awareness here. “He who exhibits a pattern of that at which he aims, should in nothing fall short of the fairest and truest; and that if he finds any part of this work impossible of execution he should avoid and not execute it, but he should contrive to carry out which is nearest and most akin to it.” It's still a long ways away however. Magnesia is best as an ideal to be aimed at, but I don’t think it can be successfully imposed."}, {"userName": "David Sarkies", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/5856247-david-sarkies", "userReview": "Plato's Dystopia18 October 2016\tFor some reason when people think of Plato and government we seem to automatically jump to the though 'gee, what a wonderful idea' as if a Platonic government would actually be a good thing. The question that I raise is what if it isn't? What if this form of government that Plato outlines actually isn't all that good, or moreso what if it doesn't work. In a way it is a bit like the western reaction to Buddhism. For some reason the young and hip seem to love Buddhism, believing that it is the one religion that you can do whatever you like, but as long as you treat other people okay then everything will be all right. However, when they delve into it (such as offering to volunteer at the Tiger Temple in Thailand) they pretty quickly discover that Buddhism is not all that it is cracked up to be – what no sex!?! No alcohol !?! Okay, I've known Buddhists that have breached both of those restrictions – at the same time – however they probably fall into the category of 'nominal'.\tAs for Plato we seem to have this idea that because he is this really famous, and apparently really smart, philosopher then any form of government that he comes up with has to be good, and has to work. Well, my argument is what if it turns out that this wonderful form of government sort of turns out to look a little like this:\tThe thing is that the more I think about Plato's political theories the more I realise that the freedoms that we enjoy under our modern democracies will be basically non-existent. For instance, you know how when you are in school you get to choose what you want to study at University, or even if you go to university – well, that won't happen in Plato's realm – your career path will be chosen right from the word go, and if you don't like it then tough, deal with it because the state that Plato envisages is a perfect, and efficient, state, which basically means that human free will sort of takes a back seat because free will is actually the thing that causes half the problems that we face today. Oh, and you know that idea that is known as the family - well we have none of that in Plato's realm because families are bad since they work to undermine the perfect nature of the society (or was that 1984, I don't know, but I recently saw it in London, and this book was so long and, well, dull that I may have got the two mixed up).\tAnother interesting thing about Plato's state is that it happens to be communist – it is against the law to have excess wealth, and if you have excess wealth well, at best it simply gets confiscated, at worse you are severely punished. Oh, and don't think that you can get around it by hiding it in another form of currency because he has that area covered as well. Oh, and let us talk about punishment because in Plato's mind nobody does wrong willingly – the only reason they do bad things is because they don't actually realise that they are doing bad things – even though we have free will this free will isn't actually free because we only do things out of ignorance, and if we weren't ignorant then we wouldn't do these things. However, Plato seems to acknowledge that people will do bad things even if they are told that they are bad. Well, it seems that in Plato's mind they have some sort of inherent defect so we might as well kill them. Yep, you heard me right, Plato is a big fan of the death penalty – if you are criminal then, well, there is no way that you are going to change so off with your head (or whatever way they decided that they will kill you).\tAnother rather interesting thing that I noticed in this particular edition was that the editor, and I assume translator, had a go at us moderns because we look down on slavery, and because we look down on slavery then we consider the ancient Greeks to be somewhat barbaric. Well, it is probably a good thing that we consider slavery to be barbaric because as far as I am concerned we really shouldn't be owning people and forcing people to do things against their will. However, those who look down on the Greeks because of slavery really don't understand the world in which we live – we have a form of slavery – it is called employment. Okay, we can leave our job whenever we like, but when we have a mortgage, and countless other debts, then the ability to walk away from our job really doesn't exist. While our employer may not be the slave master, the banks certainly are because if you don't pay back those debts they will let you know about it.\tWhich brings me to an interesting point about bankers – being a Christian I have heard how a number of people have given up a promising career in banking to become ministers of religion. Most of the time I just let it go over my head however I suddenly realised that banking is hardly what you would call an ethical profession. Okay, there isn't anything intrinsically wrong with banking, just as there is nothing intrinsically wrong with law, accounting, or even politics. However, I would hardly call the lot who brought about the global financial crisis paragons of virtue. Moreso, I have never heard anybody say that somebody has given up a promising career in plumbing to become a minister of religion (despite the fact that you can make some pretty decent money as a plumber) even though plumbing is actually a lot more honest than banking. Okay, there was one minister that I knew indicated that he didn't leave the legal profession for some holy and righteous reason, but rather because his conscience really couldn't handle the rubbish that he had to deal with. Actually, the more I think about it – bankers, fund managers, and lawyers as ministers of religions – I think I'd rather go with the plumber.\tAs for this book, well all I can say is don't bother – it really isn't all that great. In fact it is sort of half philosophy half idealistic legal text. In fact the translator writes it as if it were a piece of legislation, or at least the parts appeared to have been like that rather confusing stuff that politicians get paid ridiculous amounts of money to argue over. Sure, Plato may have some good ideas, however what I discovered was that these good ideas were few and far between and in reality were buried deep within what appears to be little more than a totalitarian state. Sure, Plato says that the military (otherwise known as the Guardians) and the rulers were to behave in a certain way but seriously, these are humans that we are talking about – as the saying goes power corrupts and absolute power corrupts absolutely. As for the Greeks being less sophisticated that we are – all I can say is that I don't think so – apparently our lust for technology and luxuries have pushed us past the point of no return – we have destroyed our environment and the global financial crises has resulted in a greater discrepancy between the haves and and the have nots that it feels as if we are returning to the middle ages, that is if we don't nuke ourselves over Syria first."}, {"userName": "Volker Rivinius", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/8490598-volker-rivinius", "userReview": "Ce n'est pas \"Les Lois\" qui me réconciliera avec Platon. En plus, Socrate en est absent. La meilleure partie de ce livre, c'est l'excellente introduction qu'Anissa Castel-Bouchouchi en a fait. A priori, on pourrait presque se passer de la lecture du reste. Mettons que sur ces vieux jours, Platon tourne réactionnaire, voire totalitaire. Bien entendu, il y a certaines argumentations qui restent valables, mais il y en a trop qui ne le sont pas. Ce que propose Platon, c'est ce qu'il faudrait presque appeler une sénilocratie, si le terme n'était trop injuste, tant il se félicité de sa propre vieillesse. On doute cependant de cette sagesse acquise quand on parcourt les propositions de lois évoquées, propositions qui n'hésitent pas à s'immiscer dans la vie privée des gens. Un exemple: il faut impérativement se marier entre 30 et 35 ans, sinon: amende. Il y a bien une sorte de simili-égalité hommes-femmes, dans le sens où elles auraient le droit aux mêmes activités et exercices physiques que les hommes, mais d'un autre côté, je ne vois pas en quoi ça diffère de la Corée du Nord et autres régimes totalitaires.Ce qui est proprement consternant, c'est ce chapitre consacré à l'épuration: il faudrait donc mettre à mort ou bannir les mauvais éléments de la cité idéale. Ou encore, ce qu'il appelle \"épuration douce\", les déporter, afin qu'ils colonisent d'autres terres. Ce chapitre cristallise tout ce que je déteste chez Platon: c'est qu'il y a des idées, vraies, justes, immuables, et qu'il faut juste mettre le doigt dessus pour mener une bonne vie. Et sinon, tant pis pour vous (et on s'occupera à vous le faire entendre).Seulement, il y a les gens, et il faut faire avec. Les idées, ça viendra après."}, {"userName": "Lukerik", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/9346755-lukerik", "userReview": "I love Plato, but I put off reading this for years because it just looked so dry. It isn't exactly dry. This may be down to the translation. I've looked into quite a few with a mixture of hope and horror. In the end I went for A E Taylor's (Everyman no. 275). Excellent introduction. The notes are sensible, if sparse, and many presuppose a knowledge of Greek. Still, I think it's worth trading off the notes for something readable. Taylor makes an effort to choose the word that isn't the dullest. In fact, he writes such a nice line of prose that I may look up some of his other books.That said, there's no getting away from the fact that parts of this book are unbelievably boring. My darlings, you're just going to have to power on through those bits. There's a sequence of unalloyed delight in Book VII for example which is a succession of good and bad ideas, all fascinating, which he rounds off by proposing the theory of evolution.Don't think that because he's writing about a pre-industrial society that Laws has no relevance today. There is a clear line of descent from the thoughts in this book to the gas chambers. Every time he uses the word “slave” switch it out for “Jew” and you'll see what I mean. You can do this for the target group of any authoritarian state and it holds true whether it be “intellectuals” or the “working class” etc. This isn't pleasant reading but it is required reading if you want to know your enemy. The mindset is one of complacent arrogance. What I found most frightening is that Plato doesn't consider himself evil. He looks on this sort of treatment of his fellow man as elevating the perpetrator closer to God."}, {"userName": "Salim Tamer", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/40759617-salim-tamer", "userReview": "Bir çok konu ile ilgili kanun ve yasalardan bahsediyor, toplumu iyi ve güzele yönlendirmek için tüm yasalara ihtiyaç var."}, {"userName": "J-Man", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/4125979-j-man", "userReview": "http://svetmogarazmisljanja.blogspot...."}, {"userName": "Þróndr ", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/4792415-r-ndr", "userReview": "While Plato’s Laws is not as evocative - nor as famous - as the Republic, it is nevertheless an important complement to it, and a fascinating read – and it is also in its own right a classic of political philosophy. Whether or not you agree with Saunders' statement (in his Introduction) that \"Plato could perfectly well have written the Laws when he wrote the Republic\", it will nevertheless be more or less apparent after reading both that (as he continues to say) \"the one should not be read without the other\". Three elderly guys, or Gentlemen rather; the unnamed Athenian Stranger, Clinias (a Cretan) and Megillos (a Spartan) are on their way from Knossos to Mount Ida and the Cave of Zeus - and after Clinias informs the other two that he, along with nine others, has been given the responsibility of composing a legal code for a new Cretan colony, they decide to pass the time with creating the laws for this state, which is given the name of Magnesia. It is not that much of a dialogue (although it is classified as one); it consists mainly of long monologues by the Athenian, and with the other two – very gentlemanly – mostly agreeing with him and spurring him on. They also function as representatives of their respective states when the Spartan and Cretan legislation is discussed in Book I. I started reading Plato’s Laws in the Complete Works (Hackett edition) but decided I would also get the paperback with Saunders' translation so I could read while commuting as well (the other one being a tad too heavy for it to be practical to carry around..) Now, Plato isn’t really ideal (heh) for reading while there’s a lot of disturbances around you, so I often ended up re-reading those passages that I’d already read while on the move. Still, it never hurts to read any parts of Plato’s texts twice anyway. Initially I wasn’t entirely pleased with the subsection headings that had been added by Saunders (these are kept in the Penguin edition while they are omitted in the Hackett edition), but I decided I rather liked them when I first got used to them being there, and they will surely be useful whenever I want to look something up again. The only thing I really disliked about Saunders' translation was his use of the term \"God\" - with a capital G - alongside the term \"gods\" (lowercase). I found that thoroughly distracting, especially as the gods are rarely left out of the discussion. Whenever Plato would write about one of the gods, he would use the term ho theos (\"the god\"), of which the plural would be hoi theoi - and while Christianity undoubtedly owes much of its philosophical basis to Plato, it's absurd to try to plant it into Plato's own writings in this manner. Plato takes metempsychosis for granted, and I found the way he applies that in his argumentation very intriguing. Indeed, the entire Book X (which deals with religious questions) was a remarkable read – the same goes for his argumentation for drinking parties as an educational device in Book II. Just mentioning these in particular because I particularly enjoyed them, but it should also be added that there is a clear structure to the whole of this work and that the masterful composition of the Laws very much adds to the pleasure of reading it (as in all of Plato’s work... though in a long and complex work like this one, it is an even greater accomplishment). In the final Book (XII) of the Laws there’s the introduction - or rather: innovation - of the Nocturnal Council – I suppose no one would have expected Plato to leave this new state without philosophers. While it might not be especially tempting for anyone today to become a citizen of the proposed state of Magnesia, it can be useful to consider that things could well have looked a bit different for someone living in the fourth century BCE. And, of course, Plato's influence on political thought ever since would be difficult to overestimate. The Laws has a similar utopian character as the Republic though here theory merges with practical application; the discussion about the essence of virtue, education as acquisition of virtue, unwritten customs and their intimate relation to written law, crime and the purpose of punishment, the usefulness of preambles to the laws, the role of the Scrutineers (\"our god-like 'straighteners'\" fit to exercise \"authority over the authorities\"), and the role of the Nocturnal Council in supplementing and interpreting (or even changing) legislation.. Plato here presents an overall practical plan for the ideal state, but at the same time his philosophical ideas are very much present in the discussion.\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "George Simopoulos", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/49913064-george-simopoulos", "userReview": "The last book of Plato indicates the progression of the writing style and the age of the author. The element of dialogue is limited in this book, and any dialogue that takes place, is non-vivid and without any contemplating effort. Most of the book is thus occupied by long monologues and law statements. Some of these statements are quite boring and only concern the age of Plato. Unfortunately, as this is his last work, Plato is old and his mind has become rigid and narrow-minded and conservative. All the dreams and overoptimistic goals for achieving the perfect state of the Republic, here in the Laws are gone. Plato presents us arguments that are more realistic and down-to-earth, having probably seen through his life that his previous ideas are too good to be realized. Nonetheless, there's always some Plato wisdom to be found even in this monotonous book. In this edition, before the original text, there's a summary for each chapter and an analysis from the translator, which seemed very energetic and passionate and made the following text more understandable. However, I would want it to be after the original text, because that seemed like a bit of spoiler to the whole thing."}, {"userName": "Bob Nichols", "userReviewDate": "Dec 05, 2014", "userURL": "http://www.goodreads.com/user/show/2105523-bob-nichols", "userReview": "Plato’s ideal state in The Laws is modeled after the divine, immortal world. But could it be that its ultimate purpose is to promote entry into the divine world, that its purpose is not earthly happiness but a divine happiness based on virtue, which is knowledge of and respect for the “real” world, the eternal realm of the soul?The primary substance is not material. It’s soul. Soul precedes matter and “is pre-eminently natural.” It is self-generating motion and “the source of all motions.” It moves all things according to reason. To deny the existence of this “real” world of the gods (immortal guardians?) and God (immortal philosopher-king, Reason Itself?) is heresy, punishable by death or banishment, and enforced by extreme censorship on behalf of “right belief.” Beyond earthly punishment lies divine punishment. When people deviate from their proper place and make wrong choices, they are judged by the gods and suffer, if they’ve chosen wrongly, another earthly existence in a lesser form. In this ideal state, there is no equality. As opposed to “equality of number,” Plato writes that “the most genuine equality” grants “much to the great and less to the less great,” based on their wisdom and judgment that, in Plato’s scheme, is right belief regarding the existence of a divine world. Ignorance is disbelief or a willing disregard of this divine world and these people have no business ruling. They must take their proper place and submit as “slaves” who follow their master. Regarding equality, women are a special case for Plato who writes that, “Half of the human race – the female sex” that is inclined “to be secretive and crafty, because of its weakness,” and whose “natural potential for virtue is inferior to man,” are a problem to be managed. And so Plato requires that women be educated and trained “in the same way as boys,” presumably to correct their natural deficiencies that disrupt the proper management of the ideal state. Freedom is not indulgence in desire and appetite, but precisely the opposite: It is to abide by objective, divine, and immortal law and not to be a slave to (by being free from) one’s passions.Watching over all of this is the Nocturnal Council. The laws must, themselves, be held to account against what is the objective standard of good and bad. The role of the Council is to ensure “a truly religious outlook,” which is first and foremost right belief: The soul is “immortal and controls the world of matter” and “that reason is the supreme power among the heavenly bodies.” Truth, wisdom, knowledge and virtue for Plato is about right belief."}, {"userName": "Clint", "userReviewDate": "Oct 30, 2012", "userURL": "http://www.goodreads.com/user/show/4147996-clint", "userReview": "I literally got anxious toward the end because I thought he was about to answer the central question of the Meno (What is ‘Virtue’ (arete) as a whole; that is, what is it which is common to all virtues, such that we would say they are all Virtue) but he got around it again by saying that the Guardians of the Laws of this new city would be the ones who decided this after much intense labor and deliberation. But it’s interesting that he doesn’t say virtue comes from the gods, and is instead what is reasoned from these wisest of wise men. I think the Laws might be my favorite dialogue. It doesn’t have the most beautiful imagery, it doesn’t dwell on the more divine philosophical implications of things; Plato has already written extensively about those things in all of his other dialogues. The Laws is Plato’s last dialogue, and as such it incorporates many ideas from his previous dialogues, but doesn’t dwell on expanding them so much in the Laws. Here Plato creates a comprehensive structure in which these ideas of virtue, beauty, divinity, etc. have a place in human lives and how we order ourselves to these concepts and thus become good men, and the fact that Plato sought to undertake that task and did so in a very compelling, artful, and comprehensive way is probably the most beautiful thing Plato ever did."}, {"userName": "Riccardo", "userReviewDate": "Dec 31, 2015", "userURL": "http://www.goodreads.com/user/show/22403687-riccardo", "userReview": "Platone qui tenta di educare il politico all'ideale di governo delineato nella \"Repubblica\". E dice che lo Stato veramente giusto non è quello governato da pochi o da molti, dai ricchi o dai poveri, accettato volontariamente o a forza: il vero governo è quello che sia retto da chi abbia scienza, la scienza dialettica delineata nella Repubblica.Tuttavia Platone si rende conto che le riforme non si possono fare da un giorno all'altro e dal di fuori perciò sottolinea l'importanza di inserirsi nella situazione da riformare attraverso un continuo educare il cittadino.Molto belle alcune parti. Ad esempio quella in cui Platone all'unità armonica del tutto si giunge solo attraverso un'intima e personale esperienza interiore; il Bene che è giustizia interiore e dover essere si afferma come coscienza di misura, che appunto perché misura è ineffabile ma comunque sia per giungere a questo punto bisogna essere vissuti a lungo con questi problemi, bisogna essersi a lungo tormentati, essere passati attraverso gravi conflitti così da giungere, al fine, non al superamento di sé stessi ma alla realizzazione di sé attraverso il riconoscimento delle proprie potenzialità e dei propri limiti. Pezzi bellissimi insomma."}, {"userName": "Luke Echo", "userReviewDate": "Jun 03, 2016", "userURL": "http://www.goodreads.com/user/show/4754628-luke-echo", "userReview": "Plato's Laws is one sprawling mess of detail and theory all jumbled in together and periodically punctuated with 100 or so individual laws. Its quite an ordeal to read. I was rather determined though.What can one learn from the Laws today? I really don't know. I think the starkest contrast for us today is the extent to which the individual is subordinated to the aims of the state. Also perhaps the enduring tension between the desire to regulate (every last thing) and the danger that it will dilute the force of Law in doing so. That morality for Plato seems to regulate that which Law does not dare (for fear of ridicule). I read part of the Jowett translation and a more recent Trevor J Saunders translation from the Hackett Complete Works. I think I've grown accustomed to Jowett's old style because I seem to prefer it to the newer translation."}, {"userName": "Kevin", "userReviewDate": "Nov 15, 2012", "userURL": "http://www.goodreads.com/user/show/14621555-kevin", "userReview": "Plato's \"The Laws\" is not for the faint of heart. This book will definitely play with your mind and have you question a lot of ideas that we take for granted in Western Culture. The Laws can also be argued as a disillusionment of \"The Republic,\" being that Plato came to the realization of \"The Republic's\" flaws after having been sold into slavery by a tyrant. However, the Laws are also a great extension of \"The Republic\" as Plato reiterates some of his ideas in \"The Laws\" in more detail On a side note, \"The Laws\" is heavily Conservative. If your political affiliations are right leaning, do not be disfranchised by Plato's previous works; \"The Laws\" is the book for you."}, {"userName": "Alby Malka", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/21818694-alby-malka", "userReview": "I think you can't understand this book without fully understand plato's republic. As I understand it, this is the \"fixes\" Plato did for his idea of the republic, interesting and deep thoughts of how the country should be managed after the first \"try\" didn't worked out.. Don't look at it as shallow as a totalitarian manifest, but observe the amazing way of thinking (which, like me, you don't have to agree with it)"}, {"userName": "Tony Gualtieri", "userReviewDate": "Jan 29, 2016", "userURL": "http://www.goodreads.com/user/show/6970283-tony-gualtieri", "userReview": "It's fascinating that Plato's final work abandons the lofty abstractions of The Symposium, Phædrus, and The Republic for a detailed legislative plan to establish a new colony in Crete. Socrates is absent as is the Theory of Forms. It's as if Plato chose to leave something concrete and practical as his last testament. Sadly, little of his literary art remains, especially in the latter half."}, {"userName": "Khalil", "userReviewDate": "Dec 06, 2013", "userURL": "http://www.goodreads.com/user/show/5641322-khalil", "userReview": "To the young man , reading Plato is like suicide or killing time ,specially if you have in your mind another great philosophers to read , e.g. Schopenhauer ,Heidegger and not to mention Wittgenstein. Just because I promised myself to read all his works , it does not mean that I will complete this  Dialongue. Its too long to be called a dialogue , fortunately Plato died before completing this uninteresting one ."}, {"userName": "Heather", "userReviewDate": "Dec 24, 2013", "userURL": "http://www.goodreads.com/user/show/10364080-heather", "userReview": "I'd like to be the sort of person who can quote Plato. But I don't think it's meant to be. I've never enjoyed reading philosophy much, and here, Plato is incredibly rigid and controlling. That's not remotely what I want in a society. Though, in the spirit of Plato and Socrates, I had better make sure that I think this opinion through XD"}, {"userName": "Saturnina", "userReviewDate": "Dec 08, 2007", "userURL": "http://www.goodreads.com/user/show/551541-saturnina", "userReview": "Not half as good as The Republic. I liked the beginning but then it just got incredibly boring and any philosophical gems were few and far between. If his students actually did do most of the work on the middle and the ending, that would definitely explain it. But then, poor Plato, didn't have too good students."}, {"userName": "Xitsuka", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/40751786-xitsuka", "userReview": "The most evil and sublime monster I have ever read. Rather than the other readings, growing like a mustard seed inside you throughout time, this one is a true monster. Bloody sun shall set, old men shall die -- and they shall see dreams in the last night, before the eternal night."}, {"userName": "Mikhail Belyaev", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/37365528-mikhail-belyaev", "userReview": "Why so many scholars comment on the political theories of The Laws, but there are virtually no exploration of Plato's ideas in civil law? A substantial part of the dialog deals with contract and family law, economic regulation and civil process."}, {"userName": "Bob", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/10867738-bob", "userReview": "A much more thoughtful exploration of how to best order a political regime than The Republic. This serves as a great lead in to Aristotle's Ethics and Politics, especially considering that many of the questions and concerns The Laws of Plato elicits are addressed by his protege in those works."}], "description": "The Laws, Plato's longest dialogue, has for centuries been recognized as the most comprehensive exposition of the practical consequences of his philosophy, a necessary corrective to the more visionary and utopian Republic. In this animated encounter between a foreign philosopher and a powerful statesman, not only do we see reflected, in Plato's own thought, eternal questions of the relation between political theory and practice, but we also witness the working out of a detailed plan for a new political order that embodies the results of Plato's mature reflection on the family, the status of women, property rights, criminal law, and the role of religion and the fine arts in a healthy republic.\"Because it succeeds in being both literal and comprehensive, it is by far superior to any translation available. By reproducing dramatic detail often omitted, such as oaths, hesitations, repetitions, and forms of address, Pangle allows the reader to follow the dialogue's interplay between argument and dramatic context. . . . Pangle's translation captures the excitement and the drama of Plato's text.\"—Mary P. Nichols, Ancient Philosophy\"Pangle's achievement is remarkable. . . . The accompanying interpretive essay is an excellent distillation of a dialogue three times its size. The commentary is thoughtful, even profound; and it amply demonstrates the importance of reading Plato carefully and from a translation that is true to his language.\"—Patrick Coby, American Political Science Review", "title": "The Laws of Plato", "url": "https://www.goodreads.com/book/show/30578.The_Laws_of_Plato", "average": 4.05, "cover": "https://images.gr-assets.com/books/1328872522l/30578.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/879.Plato", "name": "Plato"}, {"url": "https://www.goodreads.com/author/show/163269.Thomas_L_Pangle", "name": "Thomas L. Pangle"}], "type": ["Philosophy", "Classics", "Politics", "Nonfiction", "Law"], "outlinks": ["http://www.goodreads.com/book/show/30578.The_Laws_of_Plato", "http://www.goodreads.com/book/show/1289293.The_Laws", "http://www.goodreads.com/book/show/18891956-laws", "http://www.goodreads.com/book/show/6215458-les-lois", "http://www.goodreads.com/book/show/17187804-the-laws", "http://www.goodreads.com/book/show/18741442-yasalar", "http://www.goodreads.com/book/show/36563150-zakoni", "http://www.goodreads.com/book/show/528895.The_Laws", "http://www.goodreads.com/book/show/28408823-le-leggi", "http://www.goodreads.com/book/show/28321031-laws", "http://www.goodreads.com/book/show/30289.The_Republic", "http://www.goodreads.com/book/show/81779.The_Symposium", "http://www.goodreads.com/book/show/22632.The_Trial_and_Death_of_Socrates", "http://www.goodreads.com/book/show/73945.Apology", "http://www.goodreads.com/book/show/30292.Five_Dialogues"]}