{"ratings": 52090, "userreviews": [{"userName": "Lisa", "userReviewDate": "Dec 18, 2009", "userURL": "http://www.goodreads.com/user/show/1025797-lisa", "userReview": "I hated this book. I couldn't even finish it. I started it and had so much trouble reading it that I put it down and didn't even want to pick it back up. Curious, I went to Goodreads to see what other people had said about it. Surprisingly, a lot of people loved it. A couple of people couldn't finish it, but the majority gave it good reviews. So I thought I'd give it another try. Ugh. For the life of me, I couldn't figure out its appeal!!I just Googled it and found a NPR review that made me feel much better. It calls it Barbara Kingsolver's disappointing return, and uses the title to epitomize what's wrong with the book. As NPR says, \"Lacuna refers to a gap or something that's absent. The motif of the crucial missing piece runs throughout the novel, but the thing unintentionally missing here is an engaging main character.\" Yes, that's it exactly.This book is about Harrison Shepherd, but at the beginning, he's referred to as The boy, so I was immediately distanced from him. And then I was reading about him from his diaries. And all along, it just was not interesting. Apparently he's famous later on and meets famous people like Diego Riviera, Frida Kahlo and Lev Trotsky, but the book is just so friggin' BORING!!!!"}, {"userName": "Will Byrnes", "userReviewDate": "Nov 11, 2009", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "The Lacuna is really two books. One, the latter, is quite engaging, with a well-written historical perspective, emotional content, a bit of action. The other is an overlong back story, very light on involvement, written as if the author was watching the events and characters from behind a cloud. Considering that the stable of characters includes Diego Rivera and Frida Kahlo, it takes some effort to make them dull.The Lacuna is Kingsolver’s attempt at a grand historical novel. She begins in 1929 in Mexico, introducing Harrison William Shepherd, son of an American father and a Mexican mother, as a young lad dragged along by mom to live with her boyfriend on an island off the Mexican coast. We follow him through adolescence, through his association with Diego Rivera, Frida Kahlo, Leon Trotsky and a host of lesser characters. He connects briefly with his father in Washington DC and is enrolled in a private academy where latent interests come to the fore.My favorite passage in the book occurs then, a thrilling scene of MacArthur and Patton attacking American WW I veterans who were demanding the payment that had been promised to them for their participation in World War I, the Bonus Army. Things do not become compelling again until many years later when Shepherd moves to North Carolina and begins his literary career. We first meet the wonderful, warm, Violet Brown there and it is her energy as much as Shepherd’s that carries us through to the end. That journey includes a chilling look at the McCarthy era, one that carries far too much resonance of today’s psycho-right. That works very well.The methodology here is to present archivist notes from Violet Brown, excerpts from HWS’ journals and letters to and from him from other characters. The varying voices work well. There is much beautiful writing here, rich imagery. And Kingsolver works her title, finding relevant lacunae images in lava tubes, blank spaces on a page and a part of Chichen Itza that is called the “mouth of the world,” among others. I was impressed by her comparison of the Bonus Army battle with the Spaniards’ attacks on New World locals several centuries prior. Overall The Lacuna is a good book that could have been much better with significant editing. It makes one wonder if Kingsolver has enough juice to reject a demand for editing, a la Stephen King. If so, she should rethink that position. Even though there is worthwhile historical content within, and although it is very engaging in parts, The Lacuna is rather dull for far too much of its five-hundred-plus pages, which constitutes a rather glaring hole."}, {"userName": "Fey", "userReviewDate": "Jan 18, 2011", "userURL": "http://www.goodreads.com/user/show/2056399-fey", "userReview": "The story is told as the collected journals of Harrison Shepherd, put together after his death by his secretary and friend Violet Brown. Beginning with his childhood, (just before WorldWar2), as his mexican mother leaves his american father and takes him with her back to mexico. Harrison writes his journals because he can't help but write, like other people cannot help breathing, he is destined to become an author one day.Harrison's childhood is surreally beautiful, the problems of his chain-smoking, gold digging mother are distant. His journals are all in the 3rd person, nothing ever happens directly to Harrison. It's like looking at everything from underwater.Harrison gets a job mixing plaster for the famous mexican muralist Diego Rivera and his wife Frieda Kahlo. which gradually turns into a job as a cook, and then also a secretary. Then the exiled Lev Trotsky arrives, taken into the houshold of the Riveras, and Harrison can't help but be a part of the revolution, even so he is still always on the outside, an observer, written in the 3rd person.In the second half of the novel, back in America, Harrison finally begins to use the personal pronoun, I. No longer talking about himself in the 3rd person, he finally owns his own words, and talks directly about himself. Yet somehow he is grown distant, like letters from a child hood friend that you grew apart from. I find it harder to connect with Harrison now, which is ironic. But it leaves space to be covered over with by the political upheaval in America. Harrison's personal life seems to happen far in the background, while in front of us the FBI and the Un-American commitee are hunting down communist sympathisers. I feel bad now for every silly joking utterance of 'bloody commies', because I never meant it, and I never realised how real it once was. I feel like I've never paid attention in history class. \"Whenever I hear thing kind of thing,\" he said, \"a person speaking about constitutional rights, free speech, and so forth, I think, 'how can he be such a sap? Now I can be sure that man is a Red.' A word to the wise, Mr. Shepherd. We just do not hear a real American speaking in that Manner.\"Theres a horribly real feeling of suffocation in this second half of the novel, neighbours turning against him, his readers turning against him, no matter how much they loved his first 2 books, now they believe any lies printed in the newspapers. The same happening to hundreds of US citizens, once they're labeled as communists, they're done for, no matter who they really are or what they really said. But it could easily be happening today. Replace the word 'communist' with the word 'terrorist', and this could be America today. It could be britain and any non mainstream political party - the British national party for instance, once the papers label you as a BNP supporter, you're demonised.Violet Brown reminds us, when we're already well over 100 pages into the novel, that these are the private journals of a dead man who never wanted them published. And that we should stop reading if we want to respect his wishes. I almost stopped reading. It was hard to remember that the book is fiction. In fact that should be hard to remember, it should be, because in truth, in the end, it wasn't fiction. This is the most important thing about it. Harrison Shepherd and Violet Brown may never have existed, but these events too place, these things happened to someone. These things still happen to other people now, under other names and guises. It's not fiction. And that is the scariest thing about it."}, {"userName": "Alex", "userReviewDate": "Jun 18, 2010", "userURL": "http://www.goodreads.com/user/show/766382-alex", "userReview": "Placed in context with Kingsolver's other books this is essentially worthless. She turns Freida Kahlo into the most magical pixie dream girl ever and gives us a main character so thoroughly desexed and generally grey that one sort of imagines him as a Ken doll, completely generic and non-threating in every possible way. And I KNOW that's sort of the point of the main character, but still, he is pretty much one of the least enjoyable protagonists I've ever read since all you do is spend time with his guilt and boring unhappiness. Additionally, and you may not have known this, brace yourselves, but the House Un-American Activities Committee was BAD (NOOOooooooo I've blown your mind!!). Also bad: newspapers and media. Good? Trotsky and NOTHING ELSE. Especially Americans, unless you are a hillperson. I do admire how with the Violet Brown character Kingsolver has reconfigured the Noble Savage idea (and yet it still offends me!), maybe in these kinds of cases we could call it the Magical Hillbilly? Oh, and just so I am not coming off as some kind of dumbass \"America: Love it or Leave it\" type I have no problem when American wrongdoings such as the internment/concentration camps for Japanese or the aforementioned Committee are rightfully brought to task, but it almost offends me when its done so lazily and without even the slightest attempt to think about why these things happened beyond \"most Americans are sheep who like to buy stuff\". ETA (Man I just keep on thinking of things to dislike about this book): Her use of slang! Oh. My. GOD. Apparently someone issued Ms. Kingsolver an urban dictionary of the 30s-50s with the challenge of using every phrase in it, no matter the fact that when people do use slang they don't use all of it at once. About 60% of the characters sounded like parodies of people from their eras (see: The mother, Salome-I-don't-know-how-to-type-accents)."}, {"userName": "Julie Suzanne", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/1505281-julie-suzanne", "userReview": "I had the privilege of listening to Kingsolver read this aloud as well as reading the print...I love her. Her voice and her style of narration, her perfectly articulated words and sounds all captivated me instantly. Hearing V.B.'s voice as Kingsolver intended it is what made me want to just hug Violet Brown. The characters were so lovable (even though I'd never want to hang out with Harrison or Violet in real life, but Trotsky definitely).I have heard people say that this book had a political agenda. I have to disagree. I believe that this novel, although centered around politics, is about humans, while politics never seem to be. This novel did not turn me into a socialist, a communist, an anti-communist, or a hater of capitalism, but it did make me want to embrace all kinds of people. It made me yearn to learn more about and to listen to people I don't know, and especially those that I think \"I know about.\" Because I don't really. The best part about someone is that which you don't know. Thinking about that recurring message in the novel has impacted me. For reals.This novel showed me about:McCarthyism: how could we force people to value our government over theirs by silencing, condemning, and violating all of the personal freedoms that make our country so great?The Bonus Army: How did I learn about this terrible event in high school (I had to have, right?) without remembering it? It's seared into my consciousness now...Having your words used against youBeing a writerBeing a private person Trotsky & StalinStupid American slang from the 20's-50's. Being gay when hardly anyone around you thinks that is okayCensorship & other oppressive behaviorArtists, especially Frida & DiegoA lot of ancient Mexican historyIntegrityMy favorites (I'm being vague so as not to spoil the plot) a) when a character protested a violating probe by invoking our personal rights guaranteed to Americans, and the agent responded with something to the effect of, \"No American talks like that; that's how I know you're a communist.\" HA! I don't think this is true anymore, and I'm hoping that we'll be a little less inclined to McCarthyism-type witch hunting in the future. b) The metaphorical images in the first chapter and what they came to symbolizec) The strong women (Frida & VB)d) Leve) The subtletyf) The statement that a rule of the media is to fill the silence, keep talking, whether it's true or not. Sounds familiar.g) Barbara Kingsolver's voices when she reads aloud. h) The ending.I have to thank my local library for pushing me to read this by selecting it for book club. I would have really missed out on some opportunity to grow as a person had I not dived into the lacuna."}, {"userName": "Bridget", "userReviewDate": "Sep 27, 2009", "userURL": "http://www.goodreads.com/user/show/2076050-bridget", "userReview": "Yep, Barbara Kingsolver does it again, with a book that almost demands that you keep reading. This is the story of Harrison William Shepherd, the son of a Mexican mother, and an American father. The father is indifferent to the boy, and his mother longs for romance and adventure, so she returns to Mexico with the boy.The book is written as if it is a diary or journal of Harrison's life from his earliest memories. He details his life in Mexico, where through a series of events, he becomes the cook in the household of Frida Kahlo and Diego Rivera. Later, Leo Trotsky comes to stay when he is thrown out of Stalinist Russia. Harrison's life becomes entwined with that of these three characters, which makes for fascinating reading. As an adult, he eventually returns to America, where his books about Mexican history become best sellers. However, when the House Committee on Un-American Activities starts up, he is called to testify because they believe he is a member of the Communist Party. Having always been a private person, this causes him a great deal of anguish, and leads to his decision which ends the book.I found this to be a really riveting read, both for the story, and because it is not always clear who is really telling the story. The description of life in the Kahlo-Rivera household, as well as the personality of Leo Trotsky and his wife made it especially interesting to me. I also learned more about the history of Mexico than I ever expected to!I recommend this book if you don't mind stories that take a while to tell. Even small details turn out to be important, and at least in my opinion, I didn't want to finish reading the book and have the story end."}, {"userName": "Patty", "userReviewDate": "Aug 20, 2010", "userURL": "http://www.goodreads.com/user/show/363289-patty", "userReview": "I don't give a book the 5 stars without much consideration. This author's beautiful language and the things she taught me make Lacuna very special to me.I found myself in the bright and colorful world of Frida Kahlo's Mexico, and the gloomy sphere of the iron curtain and our country's disturbing consequences of McCarthyism. A real work of art that took me away from my cozy home.It's not a quick read or one you can put down without considering all the circumstances of all the main characters. Hope and hopelessness, truth and misinformation are always present . Kingsolver requires you to think and search your heart and soul. I can't wait to discuss this book."}, {"userName": "Nicole", "userReviewDate": "Dec 28, 2009", "userURL": "http://www.goodreads.com/user/show/1118065-nicole", "userReview": "About a week before I started reading Lacuna, my friend asked me when I thought Barbara Kingsolver was going to write a gay character. Little did we know...The fascinating part of Shepherd's homosexuality, of his entire character really, is how it is revealed. Slowly, carefully, the way we had to peel away the thinest possible onion skins to put on slides in my 6th grade science class. Most of this story is told through Shepherd's journal entries, entries in which the pronoun \"I\" is notably lacking. It's through his descriptions of everyone and everything around him that we come to know our protagonist. A delicate business, Babs, but one you do so well.For those enamored with Kingsolver's lyrical prose, this latest (and greatest) work might be a bit of a stretch. Shepherd is a poet and though his journals often reflect that, the book is presented as a collection of \"nonfiction\" journal entries, newspaper articles, and archivist's notes. Kingsolver bats her character (and reader) from Frieda and Diego's Mexican ranch house, to Trotsky in hiding, to the McCarthy trials in America. This ambitious work covers art, politics, and social history in a comprehensive and thoroughly palatable way. Reading the fictive life of Shepherd and company set against the backdrop of actual history was like reading a textbook with the people and places come to life.Of course, attention must be given to the relationship between Shepherd and his assistant Mrs. Brown. Sometimes the most perfect love affair is purely platonic. Or is it? Complicated and fascinating.It's a brick of a book, so start lifting weights now. And sometimes it dragged. (I skimmed over some of the newspaper articles, I'll admit it.) But I fell in love with Shepherd and my heart was with his all the way through. I genuinely cared what happened to him and turning the page was never a question. I closed the book wishing there really was a writer named Harrison Shepherd. Brilliant, all around."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Oct 18, 2009", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "3 1/2 starsThe two sections of this book are different enough that it could almost be reviewed as two separate books. They really are THAT different.First 275 pages or so = 4 starsFinal 230 pages or so = 2 stars Kingsolver is at the peak of her descriptive powers in the first part of the book. Her bright, lively detailing of Harrison's early life in Mexico compensates for the patchiness of the narration. Add to that the real characters of Frida Kahlo, Diego Rivera, and Lev (Leon) Trotsky, and it makes for an intriguing story. The second part is so drab by comparison that it's almost a chore to get through. The dullness is compounded by a lack of narrative flow. Try making a story from a collection of letters, news articles, and journal entries. Not too appealing. I understand Kingsolver's agenda for the book. Nothing wrong with that. It's honorable to promote one's concerns and ideas through fiction. In the latter part of The Lacuna, however, I think her need to educate or make a statement competes too loudly with a story so richly begun. I did like the way it ended. The Afterward section gave me chills and made me chuckle just a little. Hence, my waffly, weaselly overall rating of 3 1/2 stars."}, {"userName": "Karen", "userReviewDate": "Sep 11, 2009", "userURL": "http://www.goodreads.com/user/show/371295-karen", "userReview": "The only disappointing thing about this book was that I finished it, and have no new Kingsolver books to look forward to. As always, her writing is exquisite. I found myself re-reading parts just to savor her use of language.The Lacuna is a novel based on real events in history--the Mexican artists Diego Rivera and Frida Kahlo and the period in the 1930's when Trotsky was exiled in Mexico. I learned a lot while enjoying a good story, not really sure where it was heading--but oh! does it come together in the end in a way that took my breath away."}, {"userName": "MK Brunskill-Cowen", "userReviewDate": "Sep 09, 2009", "userURL": "http://www.goodreads.com/user/show/1216385-mk-brunskill-cowen", "userReview": "Is there anyone who writes with such beauty as Barbara Kingsolver? She has an ability to transform the reader from reading on a dreary porch to Isla Pixol, Mexico of the 1930s to Asheville, North Carolina of the 1940s. To transform someone from a beloved novelist to a scourge to be abhorred overnight. The Lacuna is about Harrison Shepherd, son of a Mexican woman and a US government official, who belonged to both countries, yet not to either of them. He wound up working for Diego Rivera and Frida Kahlo as a young teen, who then introduced him to persons and ideologies who came back to haunt him as a young man - persecuted by the howlers. Loved it - loved it."}, {"userName": "Aylin", "userReviewDate": "Dec 11, 2009", "userURL": "http://www.goodreads.com/user/show/2300199-aylin", "userReview": "I really liked the first part (roughly half) of this book about a boy (Harrison)who is being raised by a mother who eeks out an existence by sponging off the men she manages to ensnare. The setting is 1930's Mexico. Mexican artists Diego Rivera and his wife Frida Kahlo are an integral part of the story, as is Lev Trotsky (leader of the Bolshevik Revolution and Rivera's friend and houseguest). The second half of the book completely switches gears. The setting is Asheville NC where Harrison is living the life of a semi-recluse and writing historical novels during the time of the Red Scare. The second half of the book was more of a lecture/essay in the thin guise of a novel. Lots of lecturing conversations and little if any subtlety. The brightest glimmer of light in the second half of the book was the no-nonsense, out- from- the- hollers Violet Brown, Harrison's secretary.I'd give the first half of the book a 3.5 or 4 and the second half a 2 (loved Poisonwood Bible and Prodigal Summer so was disappointed)."}, {"userName": "Brian", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/198932-brian", "userReview": "Kingsolver's best book since The Poisonwood Bible, The Lacuna is the story of a diffident, unassuming man who is thrust unwillingly onto the centre stage of history. Harrison Shepherd, is born in America but raised in Mexico by his half American, half Mexican mother, a woman who is temperamentally discontented with her position in society and is always seeking to improve it through a series of affairs with married men. As a youth, Harrison becomes involved with the painters Diego Rivera and Frida Kahlo and subsequently with their friend, Leon Trotsky, who is in hiding in Mexico from Stalin's execution squads. Harrison works for all three, graduating from cook to secretary, and finally being entrusted with the care of a shipment of Kahlo's paintings to the US. Impressed by the American lifestyle, he decides to stay and manages to create a new career for himself as an extremely successful novelist, only to be denounced as a Communist in the McCarthyite witch-hunts while at the height of his popularity.It's a cleverly structured and beautifully crafted book with an emotionally satisfying ending that I did not see coming until the last few pages. I do have some reservations, however. Kingsolver's unabashed political stance can seem intrusive sometimes and I did find the almost saintly portrayal of Trotsky a bit unlikely. Nevertheless, the sheer scale and ambition of this work, the seamless integration of historical material, and the way that imagery and motif are sown into the narrative at every level make this a hugely impressive work."}, {"userName": "Candace", "userReviewDate": "Oct 07, 2009", "userURL": "http://www.goodreads.com/user/show/1629175-candace", "userReview": "This is quite the novel, as full and satisfying as anything I've read in some time. Its picture of Mexico in the 30's is spot on, and the characters of Diego Rivera, Frida Kahlo, and Lev Trotsky feel fresh and sharp. The political correctness which bored me in Barbara Kingsolver's novels seem naive has developed--she's showing, not preaching. A wonderful read by an author who is at her best."}, {"userName": "salinthebay", "userReviewDate": "Jan 04, 2010", "userURL": "http://www.goodreads.com/user/show/779194-salinthebay", "userReview": "Over the past 15 years, I have read most of Kingsolver. But, The Lacuna was a huge disappointment for me; I had a hard time finishing it. But, out of respect for her 15 years of research, I slogged through it. Recently, I checked out her NPR review as suggested by other Goodread reviewers. Most loved it but a few discerning folks also had a problem.. Voila! NPR stated, \"Lacuna refers to a gap or something that's absent. The motif of the crucial missing piece runs throughout the novel, but the thing unintentionally missing here is an engaging main character.\" As an art historian I blame myself for these high expecations - either read fiction , or history. When an author mixes the two, one had better be on top of their game - oddly enough Dan Brown usually gets this right, but his wife IS an art historian. In Kinsolver's latest novel the problem is two fold: First she mixes the diary/journals entries documenting the fictional Harrison Shepherd, the main character, with a political science lecture on the History of Mexico. She ties this loosely together with the annoying use of simile - the constant use of describing dissimilar things using the word \"like.\" Terrible! I will re read The Bean Trees and calm myself..."}, {"userName": "Margitte", "userReviewDate": "Dec 06, 2013", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "For some or other reason, being a staunch admirer of Barbara Kingsolver's books, I just could not connect with this one anywhere. Do I blame the author? No. We, the book and I, just did not gel and that's it.What I appreciated:1) Historical background of Mexican history going back thousands of years, and American society between 1900 and more or less 1955: brilliant with enough detail to last a lifetime.2) The characters: The protagonist as introduced by Violet Brown, his personal assistant and last friend. And of that I am not even sure. But, no, I think she was.The main characters were real people. Fiction and fact got married in this book. Mexican artists Freda Kahlo and her husband Diego Riviera, as well as Leon Trotsky was internationally well-known figures. Several others in the book were real too. I've read a biography of Trotsky many years ago, so that part of the story did not tickle my fancy as much as it would have for someone who did not have the background on the Russian exile. Perhaps the historical facts sweetened-up by a long winding narrative in diary form, did not work well enough for me.What I did not like:The miles and miles and miles of words stringing the story together. There is an undertone of unrest, discontent, darkness, whatever you wish to call it in the book that worked like microscopic pebbles on blistered feet confined to heavy boots on a long walk home from the mountains. You cannot see them but you feel them and it's killing you!P. 506. \"Well, my stars, the thing was like the Bible-look hard enough in its pages, and you'll find what you seek. Love they neighbor, or slay him with the jawbone of an ass.\" As a possible true story, because it could have happened to anyone to be falsely accused and found guilty of something you did not commit, this tale should be told. It doesn't matter what we believe in, we lose everything when we maintain that believe with lies and deliberate misconceptions. And yes, Harrison Shepherd, the protagonist, left more than a story behind. He left a house with a mirror. One he used. One that Violet had to confront each day. In the end it is a mirror that is waiting for all of us. Will we like what we see? After this book, I am not so sure.The cover blurb summarizes the story perfectly. I am not going to try to improve on it. However, I am of the opinion that this book could have been three hundred pages shorter and would have had a much more powerful story to tell. The middle part of the book, which I skipped from page 188, by reading mostly one sentence per paragraph, tiptoeing through 203 pages, yes, just finally convinced me to take off the damn boots and leave the pain behind. So I continued reading in detail again on page 391 till the end(page 507). I just wanted to get it over with and get closure! I still think it is a tale to be told since it provides a platform to confront political horrors of the world. A chance to expose those skeletons in the closets of those heroes on the pedestals. What are excellent historical fiction other than that, right? It's never wrong to flip a pancake over. It is the kind of book I revel in yes. Admittedly.And the author did leave the message in the end to take out of the book what we need. She also warned on two occasions not to continue reading....with good reason. Very clever, indeed! This was my fourth try with this book and this time I gave it two days with many hours of reading. Maybe a fifth is waiting in the future. Perhaps this was still not the right moment to grasp every word and cover myself completely with the magic. The pebbles in my boots are painfully preventing me to do just that. For now at least! But let's see what happens. It wasn't my Barbara Kingsolver moment this time around."}, {"userName": "Lorna", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/6700518-lorna", "userReview": "The Lacuna was a sweeping and epic work of literary fiction that spans from Mexico to Washington, D.C. to Asheville, North Carolina combining history and fiction and taking place from the 1930's to the 1950's. This is the intricate tale of fictional character Harrison William Shepherd with the background of people like Diego Rivera and Frida Kahlo, renowned Latin American artists, to Lev Trotsky and the rise of McCarthyism in the United States. There are beautiful literary and artistic references throughout and the lacuna is used metaphorically in this novel with great effect."}, {"userName": "Krista", "userReviewDate": "Jul 06, 2012", "userURL": "http://www.goodreads.com/user/show/5807518-krista", "userReview": "I tried & tried & tried to like this book...I am a huge Kingsolver fan so I expected it would grow into something wonderful. I liked the beginning, but once the main character was shipped off to the US, I lost total interest. I was already a little irritated by the disjointed, journal style but was enjoying the character's adventures in Mexico. But when he ended up in the US with his weird father & unpleasant characters, I forced myself to finish the first 100 pages & then stopped...it took me 3 struggling weeks to get to that point, I feel like I gave it a fair shake. It wasn't the usual Kingsolver book, full of natural wonders but rather a more human/society tale. I think she just hopped off her normal track for this book, it might be great for another reader but the themes didn't work for me.I gave it 2 stars because it might have turned to something...but I couldn't hold out to finish it, too much time wasted already! It is only one of two books that I have stopped before finishing in my entire life, it just wasn't working for me!"}, {"userName": "Michael", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "This is a great read that satisfies on several levels. A key pleasure is Kingsolver's prose, which shines as we would expect from her track record of essays and novels about rural folks in Appalachia and the Southwest. It also satisfies as a coming of age tale of a half-Mexican, half-American boy, Harrison Shepherd, raised by his mother on an island near Vera Cruz and later transferred to the care of his father, who dumps him in a boarding school in Washington, DC. Shepherd seeks solace from his emotional isolation through books, exploring nature, and a special friendship with the surrealist artist, Frida Kohl. While residing in Ashville, North Carolina, he achieves success as a writer of novels about Aztecs and Mayans, all the while hiding his homosexuality. Eventually he assumes the role as a cook and secretary in Kohl's household in Mexico with her husband and fellow artist Diego Rivera. This gives him an inside vision on their tumultuous relationship and struggles with their work and politics. The Bolshevik and Communist Party leader Leon Trotsky turns up as a character when Rivera hosts his stay in Mexico during his exile in the 1930's. History buffs will recall that Stalin's GRU agents assassinated him there in 1940 in retaliation for public criticism of the Soviet non-aggression pact with the Nazis. The novel highlights Mexico's affinity with socialism and the growth in pride for its own artist heroes in this period. The role of art as personal versus political expression gets explored through the plot. The focus of the tale on Shepherd's life gets a bit diluted for awhile with the major historical figures on the stage. But eventually we move comfortably along the life of the lead character back in America. During the McCarthy era, Shepherd's past connections with communists undermine his writing career and his guarded private life. The latter is blessed by a deep friendship with an older woman who becomes his secretary and protector. As you might guess from these disparate plot elements, the novel is overambitious. Still, I was pleased with the portrayal of the personal life of a charming character with integrity and emotional zest against the backdrop of historical progressions in art and politics. The \"lacuna\" of the title, meaning \"missing piece\", is an overriding metaphor, often raised in the narrative to signify how the the key to a person is the part one doesn't know."}, {"userName": "Jennifer", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/32647049-jennifer", "userReview": "This one is so close to being 5 stars. It's got the scope and ambition of The Poisonwood Bible, but with the butterfly touch of her breezier novels. Ranging from the 1930s Mexico of Diego Rivera, Frida Kahlo, and (exiled) Lev Trotsky to the 1950s America of J. Edgar Hoover, this book uses an epic backdrop to tell the story of one solitary, forgotten man. The dozen or so different formats (including journals, book reviews, letters, newspaper articles, and transcripts) are deftly handled and perfectly paced. And maybe best of all is Kingsolver's sensational portrait of Frida Kahlo. I'd recommend this one to pretty much anybody, whatever your usual tastes - it's just a damn good story."}, {"userName": "thewanderingjew", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/2309191-thewanderingjew", "userReview": "This book is a powerful exposé of our country’s experiences and eventual recovery from the time of the depression until after World War II, up to and including the McCarthy era. The reminder of the world’s decay and the violent politics of that time made me shudder as I read it. The book traces the life of a fictitious person, Harrison Shepherd, a rather lost soul, born in the United States of an American father, a government worker, and a Mexican mother of rather loose morals. He is shuttled from one country to the other, without clearly identifying with either one, Mexico or the United States. He has no anchor to either place. His anchor is to the lacuna*** he discovers as a boy, when his loneliness leads him to become a swimmer and to explore the ocean’s floor. As the story begins, so it ends.While Harrison Shepherd’s character is made up out of whole cloth, the reader will recognize many of the other characters in the book that lived at that time: Hoover, Churchill, Trotsky, Lenin, Stalin, Kahlo, Rivera, Truman, Nixon, McCarthy and so on. The events in the countries discussed, actually took place. Illuminated for us by Violet Brown, his stenographer, we learn about the politics of Shepherd’s employers and of the countries they represent. She opens a window into his private life, his sexuality and his thoughts. She leads us on his journey as he tries to survive his haphazard existence, as a young man, in a troubled world. He is largely innocent, naive and unaware of the dangers awaiting him in the outside world.Alternately during his life he is a plaster mixer for Diego Rivera, a confidante to his artist wife, Frida Kahlo, a secretary to Leon Trotsky, a cook and later on an accomplished novelist in the United States. Shepherd’s journals, diaries, and fictitious correspondence, primarily with Frida Kahlo, lead us on a journey through the period of his life in Mexico, when he lived with his mother and worked for the Riveras, until he was returned to his father in the United States and attended a military school. After that brief sojourn, he returns to Mexico to work again for the Riveras, proceeding from there to work as secretary and cook to Trotsky, the exiled Russian. Later when he again returns to the United States, he becomes an author of some renown, attracting the attention of the Un-American Activities Committee, and finally returns again to Mexico, going back to his lacuna after being disgraced by false innuendo and false accusations.Kingsolver has done a monumental job of describing the events and atmosphere of those times. All of the heroes and villains of the day are drawn clearly and their emotions and fears are captured perfectly. How difficult it must have been for her, as a writer, to write a story about a writer, and to make that writer have a style of his own, apart from hers, and yet, she did it magnificently.The first part of the book was the weakest one for me. It was a bit tedious, but after that, the pace picked up and the book branched out connecting fact to fiction and held my interest. Kingsolver has shown how, on several occasions, a few power hungry men, politicians of all stripes, radicals and extremists, came together to alter the course of history. Their extreme views caused panic, fear and ultimately, obedience. The media fanned the flames by printing information regardless of its veracity, because they were not so much concerned with the truth but rather with the size of their audience. The most frightening message for me, gleaned from this book, was that we are today in the midst of a similar atmosphere in which the politics of division are being ramped up and paraded across front pages of newspapers and a media still intent on readers rather than facts is shaping our history and our world.Once again we have a political situation in which a leader is allowing the country to be corrupted by false statements, soundbites, inference and fear which tend to incite the country to move in a particular direction and turn against a particular segment of the population. The enemy has changed but the false accusations are the same and the results can be catastrophic. Are we headed down the same shameful road to ignominy that we traveled with McCarthy? As the media and politicians once fanned the flames of hate and fear and closed the minds and mouths of those that disagreed, silencing all opposition, are we not now, with our political correctness echoing those times? In the time of the novel, communism was the ugly enemy, in today’s time, success appears to be the enemy, as class warfare is encouraged and waged against innocent, successful people, a situation promoted and worsened by the media and politicians of all stripes. Is truth stranger than fiction or is art imitating life? Once, speaking out against government policies was likely to falsely brand you as a communist, today, doing the same, will likely falsely brand you as a racist. I don’t think either policy is worthy of this country! This book was published in 2009. Perhaps it needs to be reissued again.***For purposes of this book, the lacuna, which refers to something secret, has many meanings."}, {"userName": "Ann", "userReviewDate": "Jan 08, 2010", "userURL": "http://www.goodreads.com/user/show/1292669-ann", "userReview": "Every night while I was reading this book, I dreamt of its characters. I enjoyed the leisurely first part, but when Kingsolver plunged into the Diego Rivera/Frida Kahlo/Lev Trotsky section, I plunged deeper with her. And by the time the protagonist is writing books, receiving adulation and criticism in his homeland, I was reading the book on at least three levels: 1) paying attention to the protagonist's actions and reactions, 2)reviewing what I know of American history and culture from 1930-1951 through a different lens, and 3) listening to the protagonist's perspective on what it is to be a writer.Other reviewers have pointed out that Harrison Shepherd is a passive observer rather than active participant in his own life. With all the other strong characters, each with decided opinions on most subjects, Harrison plays a counterpoint: listener, observer, the one who takes everything in and gives it back in what he writes in journals and novels. When Harrison asks his secretary to burn a childhood journal, he muses ( to himself): \"An invisible boy made manifest, seen for once by another's eyes, if only for a short while. A city of memories has gone up in fire and gas, and there can be no remorse.\" I think Shepherd knows himself best through his own words put on the page.Violet Brown is my favorite character in this book. She is so true to herself, so stalwart, and knows how to ask penetrating questions. Everyone needs a Violet Brown to hold up the self-disclosing mirror, one who loves unconditionally and pulls no punches."}, {"userName": "B the BookAddict", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/19832827-b-the-bookaddict", "userReview": "Diego Rivera, Frida Kahlo, Mexico, Leo Trotsky, Committee on Unamerican Activities: The Lacuna is a wealth of information on these topics. But it's outstanding feature is it's narrator, Harrison Shepherd; Mexican/American, cook, sometime secretary, novelist and gay. Kingsolver's wonderful telling of his tale and those whose lives cross his path is insightful, humorous and full of pathos. I was, by turn, amused then saddened by his story; Harrison may have been a fictional character but many lives were shattered by the Committee on UnAmerican Activities and Edgar J Hoover and his band of merry men and those activities. A HUGE thank you to Sally Howes for recommending this fine tome. A good place for Kingsolver beginner to start and a great place for her fans to continue reading her magical novels. 4.5★"}, {"userName": "Nandakishore Varma", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "This is my first and so far, only book by Barbara Kingsolver. She writes beautifully, and I loved this strange story of a fictional gay man caught up in the real life struggles of Frieda Kahlo, Diego Rivera and Leon Trotsky - also the scathing indictment of McCarthyism in the final part. The story feels strangely incomplete, yet the final, unexpected twist was exquisite.I am determined to read more of this author's books."}, {"userName": "Jan Rice", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/5864678-jan-rice", "userReview": "This book had some amazing segments. I listened on audio and am going to have to buy a hard copy just for some of the quotes and observations. But even though it was wonderfully read by the author, it went on too long. I thought it would never end. Therefore it's hard for me to recommend it."}, {"userName": "Carmen", "userReviewDate": "Oct 05, 2011", "userURL": "http://www.goodreads.com/user/show/395236-carmen", "userReview": "While I thoroughly enjoyed The Poisonwood Bible I have huge problems with this book. Even though the book is fiction there are historical facts that have been included and it is indeed terrible when she makes so many mistakes. On page 56, she talks about the one fifth booty part that Cortes was to send to the Extremely Catholic Majesty the Queen. When this Queen, Isabel La Catolica, died in 1504, Cortes did not arrive in Mexico before 1519 and he wrote to and shared the booty with Carlos V The Emperor.Napoleon did not invade Mexico he was having too many problems with the English it was Napoleon III a distant relation of Napoleon.Her words in Spanish are not spelled correctly, as far as I can see the word Lacuna does not exist in Spanish or not in the sense she uses it. Where he and his mother lived in Mexico City was not at all a part of Mexico City, since the city was very small at the time and they lived in villages or town adjacent to the City.I might finish the book but at the moment I have stopped because I think she should have done her editing more carefully. Even if the book takes place in Mexico, which most Americans tend to ignore she could have been more accurate."}, {"userName": "Gini", "userReviewDate": "Nov 22, 2009", "userURL": "http://www.goodreads.com/user/show/2682871-gini", "userReview": "I saw a review of this book on television that made me buy it the next day. I'd not read Kingsolver before, but the first part of the story took place in Mexico, in the homes of Frida Khalo, Diego Rivera and Trotsky-- and I've been to those houses several times and was looking forward to reading about the people who had lived in them. I enjoyed the first half of the book very much, but the second half -- after so much color and action -- fell flat. Most of the story unfolded as rather obvious conversation between two characters. It was almost as if it was a different book. I would still recommend it if the real-life figures fascinate. Also picked up some upsetting facts about our country's history. The author's research is impressive."}, {"userName": "Debbie", "userReviewDate": "Jun 13, 2011", "userURL": "http://www.goodreads.com/user/show/4806670-debbie", "userReview": "Very difficult book to get into. Barbara Kingsolver is an excellent and articulate writer, but there was just too much information and I found it all so boring at first. I had a hard time imagining this fictional character having a place in these actual historical events. It was a bit like Forrest Gump. Around 75% into the book it really picked up and came together. The ending was poignant and I really liked how all that information came together! The historical accuracy was impressive (and quite interesting I found, in doing my side research)! I really believe this book could have stood as a trilogy, the first book being about Harrison's time with his mother in Mexico, the second part his time with Diego & Freida, and the third part his time in America. Having said all that, I am glad I read it and I don't feel it was a waste of time. I learned a lot from this book, whether it be the interesting historical events or the profound comment on human nature and social and political evolution (or lack thereof)."}, {"userName": "Sally Howes", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/23122552-sally-howes", "userReview": "I just finished this book and I'm almost speechless with emotion and awe. Review will be coming soon, but for now, I just want to shout from the rooftops: EVERYONE SHOULD READ THIS BOOK!"}, {"userName": "Connie", "userReviewDate": "Feb 26, 2014", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "\"The Lacuna\" has an interesting title signifying a gap, something missing, something you don't know--a theme that runs through the novel. Living in both the United States and Mexico as a child, Harrison Shepherd has been neglected by his parents and doesn't truly feel at home in either country. He learned to cook and bake by helping a servant in his residence in Mexico. It was a twist of fate that he was viewing the murals of Diego Rivera on a day when the artist needed another boy to help mix plaster, a technique similar to mixing a type of bread dough. Soon, he was living with Rivera and his wife, artist Frida Kahlo, helping with the cooking, mixing plaster, and typing correspondence.Lev Trotsky, who was hiding from Stalin's henchmen, was given shelter by the Riveras. Eventually Harrison worked for Trotsky, cooking and helping with secretarial work. A few years later Harrison returned to the United States and became a successful writer of Mexican historical novels. During the McCarthy years, his association in Mexico with the Communist leader came back to haunt him.The book shows the power of the media in influencing public opinion. Untrue rumors become truth if they are repeated often, and the public becomes afraid. The Japanese-Americans were sent to internment camps during World War II by officials that panicked. Stalin spread untruths about Trotsky and killed his family. The quiet writer Harrison Shepherd was targeted during the Red Scare of the 1950s. The media is referred to as the \"howlers\", imitating the behavior of the Mexican monkeys. One monkey howls, then the others join in until the woods are ringing with a demonic howl.The book is written as a series of journal entries, newspaper clippings, letters, and notes by Shepherd's secretary. Some parts of the book were brilliant and others very dull. The book could have been edited down a bit, such as taking out the fan mail to Shepherd. I especially enjoyed the journal entries involving Frida Kahlo who became his friend. The diary entries about Lev Trotsky and his philosophy were also interesting, although the book neglected to present the amount of violence he was associated with in Russia. Shepherd was a young man possibly looking for a father figure to admire, and Trotsky was very charismatic.The book had many good political and social points. But the format of the journal entries and newspaper clippings seemed to slow the book down, and rob it of the colorful storytelling I've admired in Barbara Kingsolver's other books. 3.5 stars."}], "description": "In her most accomplished novel, Barbara Kingsolver takes us on an epic journey from the Mexico City of artists Diego Rivera and Frida Kahlo to the America of Pearl Harbor, FDR, and J. Edgar Hoover. The Lacuna is a poignant story of a man pulled between two nations as they invent their modern identities. Born in the United States, reared in a series of provisional households in Mexico—from a coastal island jungle to 1930s Mexico City—Harrison Shepherd finds precarious shelter but no sense of home on his thrilling odyssey. Life is whatever he learns from housekeepers who put him to work in the kitchen, errands he runs in the streets, and one fateful day, by mixing plaster for famed Mexican muralist Diego Rivera. He discovers a passion for Aztec history and meets the exotic, imperious artist Frida Kahlo, who will become his lifelong friend. When he goes to work for Lev Trotsky, an exiled political leader fighting for his life, Shepherd inadvertently casts his lot with art and revolution, newspaper headlines and howling gossip, and a risk of terrible violence. Meanwhile, to the north, the United States will soon be caught up in the internationalist goodwill of World War II. There in the land of his birth, Shepherd believes he might remake himself in America's hopeful image and claim a voice of his own. He finds support from an unlikely kindred soul, his stenographer, Mrs. Brown, who will be far more valuable to her employer than he could ever know. Through darkening years, political winds continue to toss him between north and south in a plot that turns many times on the unspeakable breach—the lacuna—between truth and public presumption. With deeply compelling characters, a vivid sense of place, and a clear grasp of how history and public opinion can shape a life, Barbara Kingsolver has created an unforgettable portrait of the artist—and of art itself. The Lacuna is a rich and daring work of literature, establishing its author as one of the most provocative and important of her time.", "title": "The Lacuna", "url": "https://www.goodreads.com/book/show/6433752.The_Lacuna", "average": 3.77, "cover": "https://images.gr-assets.com/books/1355810301l/6433752.jpg", "reviews": 7277, "authors": [{"url": "https://www.goodreads.com/author/show/3541.Barbara_Kingsolver", "name": "Barbara Kingsolver"}], "type": ["Fiction", "Historical", "Abandoned", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/6433752-the-lacuna", "http://www.goodreads.com/book/show/7530290-the-lacuna", "http://www.goodreads.com/book/show/7099649-the-lacuna", "http://www.goodreads.com/book/show/7110648-the-lacuna", "http://www.goodreads.com/book/show/38316691-the-lacuna", "http://www.goodreads.com/book/show/7962825-the-lacuna", "http://www.goodreads.com/book/show/6433753-the-lacuna", "http://www.goodreads.com/book/show/7884272-the-lacuna", "http://www.goodreads.com/book/show/7244.The_Poisonwood_Bible", "http://www.goodreads.com/book/show/30868.The_Bean_Trees", "http://www.goodreads.com/book/show/25460.Animal_Vegetable_Miracle", "http://www.goodreads.com/book/show/14249.Prodigal_Summer", "http://www.goodreads.com/book/show/13438524-flight-behavior", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}