{"ratings": 2914, "userreviews": [{"userName": "Will Byrnes", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "Ella stared west. She imagined the great mountains foggy and raindamp in the distance, the blue ridges rolling away in great swells. She opened her mouth, paused for a moment, gathered the story of her life around her as she would lift the hem of a long dress before stepping across a stream. She did not think, did not stop to look at [anyone]. She simply began to speak.\nEvents and people have a way of disappearing when they do not suit the narrative favored by those who decide what is to be allowed into our history books. Unless there are powerful interests taking on the task of sustaining that history it can fade from our consciousness. For myself, it took until college for me to have any but the most primitive clue about the labor movement in the United States, who the players were, what it had achieved, and its relevance to my life. Wiley Cash grew up in Gastonia, North Carolina, and had an awareness of his familial history in the area, but it was not until he was an adult that he learned of one historical event in particular. The idea for the The Last Ballad\nfirst started cooking in 2003 when I was in graduate school in Louisiana. I had never heard of the Loray Mill Strike. I asked my parents about it, and they’d never heard of it either. My mom was born in Gastonia in a mill village in 1945, and my dad in 1943, in a mill village in Shelby, and my mom’s maiden name is Wiggins. All my family came from mill people. My mom’s dad, Harry Eugene Wiggins, was living in Enoree (S.C.) in 1929 when Ella May was murdered. He would’ve known about it. But I never heard the word Loray. This story was buried. Nobody talked about it.\nCash has brought it back into the light. Wiley Cash - image from WC’s GR page Ella May Wiggins was 28 years old. She had lost several children to whooping cough already, and worried about the brood that remained. Her husband had abandoned them long ago, and her current boyfriend was something less than reliable. She worked twelve-hour days, six days a week at a local textile mill in Bessemer City. Actually, she worked nights, leaving her children to the care of a friend, and the supervision of her eldest. She was a white woman living in the black part of town. Unless she was docked for doing something crazy, like staying home from work to be with a sick child, she brought home nine dollars a week. Even in 1929 no one could support a family on that. In April, 1929, at the Loray Mill in Gastonia, a few miles away, the workers had walked off the job for improved pay and working conditions, and union recognition. The governor sent in the National Guard to break the strike. \nWomen were beaten. Soldiers pressed guns to men’s heads. The strikers’ first headquarters had been destroyed by a nighttime mob. The union commissary attacked, the food stores ruined.\nThe union tried to gain support from workers in other area mills, offering to transport folks to a planned rally. Ella had seen their leaflets, the union demands, and decided to attend. Ella May Wiggins with friend (probably Charlie Shope) - image from Southern CulturesTransported to the rally by two women organizers, Ella is encouraged to tell her personal tale to the gathered group. She had been writing songs in the spare microseconds when she wasn’t struggling to keep herself and her family alive. She had a popular tune running through her head for a while and had been writing lyrics germane to the need for organizing to go with it. Ella addresses the crowd, sings her song, and kills. A star is born. We follow Ella’s dealings with the union organizers, her struggles to make them and not just the workers hear her voice. One of the interesting things about the book is that while the black and white of exploited workers vs dark-hearted owners and enforcers is given front stage, the novel is rich with nuance. One of the mill owners is shown not only taking pride in the industry his family had built, but also having a real interest in the welfare of his employees. Some of the union organizers are shown to be less than totally heroic. Even the police chief is shown to be someone you can talk to. One of the things that Cash does in his novels (this is his third) is portray strong female characters. Adelaide Lysle, in Cash’s first novel, A Land More Kind Than Home, is one of the main people standing against a sinister force. Easter Quillby in This Dark Road to Mercy is a pre-adolescent who shows remarkable courage and judgment coping with her orphan-hood and being abducted. Ella May, in this one, is not only a principled defender of and provider for her family. She finds an outlet for her larger strengths, her public speaking ability and musical talent, in union organizing, and runs with it. Another strong woman is shown having sacrificed her ambitions for a secure life but is searching for a way to regain herself. As some of the men in Cash’s prior work were of the opposite sort, weak, maybe corrupted, so it is here. One of his POVs is Verschel, a recovering alcoholic married to a domineering woman. Ella’s husband John is engaged in practices both illegal and immoral, not least of which is to abandon his family. Cash offers a range of strength in other characters, both male and female. One mill owner is shown in an understanding light. Even a union basher is shown to have a motivation, however misguided, based on an at least somewhat understandable desire. Ella May’s children stand beside her grave on the day of her funeral - Image from NCpedia.orgCash does a great job of showing how complicated a thing a strike is, the cat-herding aspect of trying to keep everyone on the same page. The challenge of getting, and protecting people, turf, and materials, while running a full-time PR operation. He also shows the impact of racism, weakening the potential strength of the union when joining together would have been the smart move. One element of the story is Ella May’s musicality. We are shown early on where she gets the melody for the tune she will sing at the union rally. In the American folk music tradition this was a very common practice. Consider that the Star Spangled Banner was originally an English drinking song.\n Woody Guthrie considered her one of our nation’s best songwriters. Alan Lomax published her stark union ballads in his acclaimed collections of American folksongs. Pete Seeger recorded a version of her most famous song on a Cold War folk revival album. …Ella May Wiggins… is not well known today, [but] she was one of a handful of southern grassroots composers who combined traditional balladry with leftwing politics to forge a remarkable new song genre just prior to and during the upheaval of the Great Depression. - from the Southern Culture articleHer boyfriend even suggests she quit working at the mill and make a career out of music. But we are shown very little of this prior accomplishment. It is mostly by reference. The song she sings at the rally is what would be considered her greatest hit, The Mill Mother’s Lament, also sometimes seen as The Mother’s Lament. I included in EXTRA STUFF links to a couple of performances by other artists. There are no recordings to be had of Ella May performing her songs.An estimated 1,000 strikers at Loray Mills - image from Millican Pictorial History MuseumThe structure of the novel is to offer Ella as a central character, but to present several points of view on the events of the Loray strike. In this way, we meet the McAdams family, father Richard, a mill owner, his wife, Katherine, and their daughter, Claire. We follow a black Pullman porter, now an organizer, Hampton Haywood, as he confronts racism from supposed friends and foes alike. We even get a look from one of the lower level police sorts, eager to be of service, but lacking the judgment to be anything more than what he is.Also, there is a bit of time jumping, stepping back to 1918 for the perspective of a neighbor who encounters Ella and John when they moved to Cowpens, South Carolina, eleven years before the strike. We also meet one of Ella’s grown children in 2005, as she recalls the events of 1929.Gripes? Some. Cash shows the resistance the white workers manifest toward the black workers who come to the union rally. The impression is that they rejected this attempt at integration. But in the actual history, black members were indeed voted in to Ella May’s local union. I felt that there were maybe too many perspectives in play here, not all of which added a lot to the story. The pages used for the tale of the character called Brother might have been better used for the more central people. Fred Beal (holding child) with a group of strikers – image from Charlotte ObserverBut really, these are not major concerns. In an era when union membership is at a perilous low, an era in which the forces of ownership have successfully crushed most labor hopes, it is a refreshing reminder that people can rise up, can organize, and can, through joining together, not only improve their own working conditions, but offer inspiration to others to improve theirs as well. The Loray Mill strike was seen in the short term as a failure. Ownership and their political shills have rarely been reluctant to apply the state’s violence monopoly against those who oppose their wishes. Ella May was murdered for her efforts. But she inspired many to continue the struggle, even in the face of overwhelming force. Strikes rarely achieve all their aims. But even when they fail in the short term, sometimes longer term goals are advanced.\n After her death, pressure from local strikers, North Carolina liberals, and national political organizations led Gaston County mill owners to reduce working hours to fifty-five per week, to improve conditions in the mills, and to extend welfare work in the textile villages. - from NCPEdiaThe Last Ballad is Wiley Cash’s strongest novel to date. He offers us insight into an important, if mostly forgotten, event in American history, a time, sadly, that has much in common with the world of the early twenty-first century. We could use more Ella Mays today. We could use more union organizing. With the nomination of an ultra-conservative senatorial candidate in Alabama, and the steady withdrawal from public life of the saner elected Republican officials, the rise of the Steve Bannons and Tea Party sorts in this country, the need to battle for labor rights has rarely been greater. But the political content would not be worth much if the story and the characters did not engage readers. Not to worry. Ella May is a relatable everywoman, spectacularly drawn. Plenty of the other characters are portrayed sufficiently to pull you in. Cash has a talent for offering just enough detail about a character to give you a rich image. You may not have heard of the Loray Mill Strike, or of Ella May Wiggins before, but when you read this book you will be grateful to Wiley Cash for filling in that gap in your knowledge. It is a powerful, content-rich, and very moving book. Review posted – September 29, 2017Publication-----October 2, 2017 - hard cover-----June 5, 2018 - Trade Paperback=============================EXTRA STUFFLinks to the author’s personal, Twitter and FB pagesInterviews-----Charlotte Observer -  A murdered singer and a strike in Gastonia: This true story led to ‘Last Ballad’ - By Dannye Romine Powell-----Shepherd University - Interview with Wiley Cash, August 2017 - By Brianna Maguire and Sylvia Bailey Shurbutt (who have done an amazing job)The strike was a big deal at the time. There were even six novels written within four years of the strike that dramatized elements of the conflict. They are known as The Gastonia novelsBeyond Desire – Sherwood AndersonCall home the Heart – Olive Tilford DarganTo Make My Bread – Grace LumpkinGathering Storm – Myra PageThe Shadow Before – William Rollins, Jr.Strike!  – Mary Heaton VorseElla took the melody from the song  Little Mary Phaegan for The Mill Mother’s LamentHere is the Pete Seeger version. And a later recording, sung by a female, Yvonne Moore, with Mat Callahan on guitar, is quite good. The following lyrics were taken from hereThe Mother's Lament by Ella May WigginsWe leave our homes in the morning,We kiss our children good-bye,While we slave for the bosses,Our children scream and cry.And when we draw our money,Our grocery bills to pay,Not a cent to spend for clothing,Not a cent to lay away…And on that very eveningOur little son will say: \"I need some shoes, Mother, And so does Sister May.\"How it grieves the heart of a mother, You everyone must know. But we can't buy for our children, Our wages are too low.It is for our little children,That seem to us so dear,But for us nor them, dear workers,The bosses do not care.But understand, all workers,Our union they do fear.Let’s stand together, workers,And have a union here.Odds and Ends-----NCPedia is a good source for information about the strike. Here are links to their articles on Fred Beal, one of the Loray Strike organizers, and another on Ella May-----A short video about the Loray Strike-----Southern Cultures, Vol. 15, No 3 -  Mill Mother’s Lament: Ella May Wiggins and the Gastonia Textile Strike of 1929 - by Patrick Huber ----- It seemed to me that the hooch that one of the characters cooks up is a nod to the past of the region, one in which the abundant natural running water was used for produce booze before it became a power source for cotton mills."}, {"userName": "Angela M", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "Wiley Cash is a storyteller who captures both my mind and my heart. He has written three novels, three different stories but all bearing in common Wiley's beautiful writing as well as an uncanniness for depicting the human condition under circumstances that chill us as readers. His writing takes you exactly where he wants you to be - to the place, to the moment, into the thoughts of these characters. Each of his novels take place in North Carolina where he lives, but this one is broader in scope than his first two. It's a work of historical fiction and more than a story of the south. It's a snapshot of a time in our country's past centering on the Loray Mill strike, a notable event in the history of organized labor in the United States in 1929, in which a woman named Ella May Wiggins played a major role. This may be a fictionalized account, but Cash brings to life the real Ella May. Ella May has had a hard life from her childhood to an early marriage at 16 to a man more interested in things other than taking care of his family to her working in horrible conditions in a mill for a pittance, struggling to feed her children. Not only does she want better pay and better, safer working conditions and a better life for her children, she wants it for her friends, her \"colored\" working friends and wants them to be able to rally and unionize. A second narrative 76 years later in 2005 is in the voice of Lilly, Ella's oldest daughter, now close to 90 years old. In a letter to her nephew Edwin, she tells him Ella May's story. Through Lilly, we come to know more about the family's hard life before the story opens. Then we are taken back to 1918 and 1929 through other narrative voices. Verchel Parks with connections to Ella and her husband when Lilly is born, Katherine McAdam, the wife of a mill owner and Hampton Hayward, a black train porter are among the most notable characters connected in some way to Ella. This is a beautifully written story, and it's sad. It is not just about one strong woman, but evocative of the strength and spirit of the real courageous people who took up the challenge to fight against injustice. At the end of my review of his first book A Land More Kind Than Home, I said that Wiley Cash was born to write . Now that I have read all three of his novels, I feel that way even more. Highly recommended to fans of his other books and to those who enjoy historical fiction. If you have not read Cash before but plan to, you're lucky to have these yet to read; I have to wait for his next one. 5 stars, without a doubt. Wiley Cash is on my list of favorite authors. I received an advanced copy of this book from William Morrow/HarperCollins and through Edelweiss."}, {"userName": "Diane S ☔", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "What would you do if you were in your late twenties, already have had four children and now a new one on the way. Your husband has left you, you are now poor and alone, living in a shack in the black section of town. You, yourself are not black nor are your children, but they have proven to be wonderful friends, one named Violet you call your best friend. In order to feed your children, you work at a textile mill, 60-70 hour work weeks, making only nine dollars a week. Then you see flyers asking people to protest, strike and join a Union. They promise many things, better pay, shorter hours, better working conditions, and for Ella Mae she sees this as possibly her only chance to better herself and children. The year is 1929, in the Carolinas and there are many textile mill, blacks and whites both work at the mills but in separate areas or separate floors. What would you do? My father was a Union worker, my husband worked Union for over forty years. We supported Union stores, I have only been in a Walmart three times, Aldis, once. I knew what a struggle these early supporters faced, but never to the extent highlighted in this book. Ella Mae is a strong character, her life incredibly hard. We hear from many different characters in alternating chapters, all either fighting for the right to unionize, both black and white, or involved with those against the Unions or mill owners themselves. We get a broad view, see all sides. Parts are heartbreaking, parts show how falsely things were painted, and parts show how quickly things can get out of hand. This author is a marvel, I love how he puts his stories together, they are always informative and heartfelt, full of truths. My one complaint is that I felt one revelation made early in the book would have had more of an impact if held until later.As with all who in earlier years fought for our rights, in whatever way, we owe them a debt of gratitude. Unfortunately, I don't think we are done fighting for, or maintaining our rights, not with what I have seen on my television news this week, not with what is happening with individual rights in my country. Seems we go backwards instead of forward.ARC from William Morrow and Edelweiss.Released the beginning of October."}, {"userName": "Karen", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "Wonderful novel based on the true life of Ella Mae Wiggins, a poverty stricken mill worker at the Loray Mill in North Carolina, 1929. She helped to try and form a union, specially an integrated union in a time when people didn’t accept blacks.This woman had so much courage to leave her job to work on union matters when she had little ones at home that she could barely feed. Such a tragic story that touched my heart. I went online after finishing the book so I could see pictures of her and her kids."}, {"userName": "Cheri", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "!! NOW AVAILABLE !!\n“We leave our homes in the morningWe kiss our children goodbyeWhile we slave for the bossesOur children scream and cryBut understand all, workersOur union they do fearLet's stand together, workersAnd have a union here\n\"A Mill Mother's Lament\" – Ella May Wiggins “Saturday, May 4, 1929””Ella May knew she wasn’t pretty, had always know it. She didn’t have to come all the way down the mountain from Tennessee to Bessemer City, North Carolina to find that out. But here she was now, and here she’d been just long enough for no other place in her memory to feel like home, but not quite long enough for Bessemer City to feel like home either.”Ella May has just started her shift when she is called to the office of American Mill No. 2, where she sits on a bench watching the young secretary with her polished, perfect nails and her perfect blue dress reading a new book, laughing, as though she hasn’t a care in the world. Ella’s hands lay on her stomach, which fluttered from the movement within. Another child. Her husband, father of her children Lily, Otis, Rose and Wink, had left shortly after their newborn son Willie had died of whooping cough disease, taking with him all their money, and the only photograph of the three of and of Lily as an infant. What she wouldn’t give to see that picture once again, that perfect face of her newborn daughter. Charlie had arrived one day as if he were carried in with the wind, she was equally sure that he’d leave someday the same way. She knew he never wanted children of his own. She knew the child she was carrying would not be welcome news, and so she kept her news to herself.When she is called in to Goldberg’s office for missing her last night’s shift, she explains her little girl had been sick, that she’d asked to be put on the day shift when her coughing wasn’t as bad, but it isn’t a valid reason in his eyes. Walking two miles to and two miles from work on top of the six day work week of twelve hour days should leave you with something more than sheer exhaustion, it should leave you with enough money to feed your children, keep them clothed, to provide some small comfort and shelter, but it is barely enough to keep them alive, with many days where they just do without. So when she sees a leaflet about the Union, she begins to feel a ray of hope, a possibility of a better life not just for herself, but also for all the people who are her neighbors in Stumptown, for everyone. She may be the only white woman living there, her children the only white children living there, with an older male being the only other white person in Stumptown, but these are her people. She works in the only mill whose employees are both black and white, their story is all the same, they are all the same: underpaid, overworked, underprivileged. A union might offer hope for them all, regardless of the colour of their skin.There are many tales to be told, many voices to be heard, Ella May, and Lily, now elderly, among other voices. It is a beautifully shared story of one woman’s struggle to be heard on an issue that seems to loom large in today’s news. Basic rights for all people.Based on the Loray Mill strike of 1929 in Gastonia, North Carolina, and the real life story of Ella May Wiggins, telling the story of the lyrics she wrote for her songs and how those lyrics, these songs became a part of that struggle for basic human rights for all.Beautiful and heart wrenching, this story radiates hope despite devastating loss, despite the violence used to eliminate those who bring hope to the world. Most of us can’t imagine a life like Ella May’s life, but it happened all the time. I’ve read Wiley Cash’s “A Land More Kind Than Home” and “This Dark Road to Mercy” – both of which I thoroughly enjoyed, but \n”The Last Ballad”\n reached into my heart and grabbed hold. This will definitely be one of my favourite books of this year. Highly recommended.Pub Date: 3 Oct 2017Many thanks for the ARC provided by HarperCollins / William Morrow Publishers"}, {"userName": "Linda", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "\"You exist whether it is written down or not, and you are dead whether it's written down or not too.\"Do we make our mark only in the lives of those who love us or does that mark still exist whether it is simply acknowledged or not?Wiley Cash creates a superbly written story based on the actual life of a little known woman named Ella May Wiggins. Ella May's life barely caused a ripple to stir in her early years. Her innocent nature fell for the golden charms of handsome John Wiggins when she was sixteen and then found herself with child. She and John married in Tennessee and kept moving from mill to mill in the 1920's until they eventually moved to Gastonia, North Carolina. Throughout her pregnancies, Ella May continued to work and John continued his wayward ways and abandoned his growing family.We soon come to know Ella May's desperate struggle to keep food on the table, manage her children, and work long, arduous shifts at the mill. While living in Stumptown, Ella May is blessed with the friendship of Violet and the African American community. They work together in one of the few integrated mills in the area. They both earned $9.00 for a 72 hour workweek. Ella May is threatened with dismissal when she misses her shift caring for her seriously ill daughter.The story bends in a new direction when Ella May is handed a flyer on the street that advocates the National Textile Workers Union. Hesitant at first, Ella May attends a meeting and eventually walks off her job and joins the union. Wiley Cash reveals the profound impact that her decision will have on Ella May, her family, and the workers in Gaston County as she becomes more and more active. We are left with the realization that even the most tender of voices can send shock waves that permeate through the stone cold walls of inhumanity. And, believe me, Ella May Wiggins left her mark, indeed."}, {"userName": "Jennifer ~ TarHeelReader & Traveling Sister", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/32340179-jennifer-tarheelreader-traveling-sister", "userReview": "5 Tar Heel State stars for The Last BalladElla May Wiggins was a strong character and a strong woman in real life. Ella fought hard to organize a union in her area, and it was important to her that all races were allowed to be part of the union. We received a multi-dimensional look into her life through the various characters in the book, as the story was told from more than just Ella's point of view. The way this was done was genius. I've never seen a character study executed in this way. It's almost as if the side characters panned around Ella's life like a three-dimensional camera, adding richness to her story that we would not have been privy to otherwise. The sense of time and place was exceptional as a result as well. Before I read this book, I was not as aware of the textile mills in my home state, the same state where this book takes place, which were once plentiful, and I certainly was not aware of their history. On a personal note, through discussing this book with my dad, I found out that my paternal grandparents worked in a mill for a few years just after World War II. The conditions where they worked were not the same, but it was a later time, and the labor laws may have improved some by that point. This was my first read by Wiley Cash, and I will definitely be reading his other two books. He's a gifted storyteller; his writing is breathtaking. The afterword of Cash's connection to Ella May's story is definitely worth a read. Ella May's character left an indelible mark on my heart. I will not forget her any time soon. This was a wonderful book for discussion with the Traveling Sisters. The characters elicited strong feelings from us all, and it was a pleasure talking it out with these wonderful ladies! For our combined Traveling Sisters' review and much more, please visit Brenda's and Norma's blog: https://twogirlslostinacouleereading...."}, {"userName": "Berit☀️✨Traveling Sister✨", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/38946743-berit-traveling-sister", "userReview": "this book was based on the life of a remarkable, smart, and feisty woman Ella May Wiggins...This is tough for me, I am such a character girl, and this is such a plot driven book... I found Ella and her children’s lives very interesting... I really wanted more about them; Love how the children looked out for each other and really appreciated the fact that they did not care about color... also would have liked more about Ella’s friendships with Violet and Sophia, and of course very unlikely friendship with Kate.... but as I said I’m a character girl...Having said that, I really did find this book very interesting and I am very glad I read it...The book did a fabulous job of painting a picture of the times; the mill strikes in 1929 in North Carolina.... something I really knew absolutely nothing about, and when you read books like this it makes you appreciate how much the people who came before you did to make this country a better place.... The hate was hard to hear, hard to understand, but unfortunately part of our country‘s history and even more unfortunate it’s still exists today....Wiley Cash, is a very good writer, this was my first book from him, but definitely not my last! I would definitely recommend this to anybody who is a fan of historical fiction with the understanding that the focus is on the plot... narration: fabulous job with the narration! Fantastic job with all the local accents... this was another fabulous Traveling Sisters read with Dana, Jan, Nikki, Marie Alyce, Brenda, Lindsay, Jennifer, and NOrMA. Love how everyone brought their own personal experiences to the discussion... some of the sisters are a bit over scheduled, so I am looking forward to their thoughts! As always a pleasure to read with these ladies!"}, {"userName": "Esil", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "The Last Ballad is the first book I have read by Wiley Cash, but it won't be the last. I loved the topic, some of the characters and the story. It's based on the true story of Ella May Wiggins, who was a union organizer in North Carolina. From the beginning, we know that Ella May died young in 1929. Told through a number of characters, including Ella May, Cash gives a feel for the living and working conditions of people working in the cotton mills at that time. He also explores the class and racial tensions in the area. I especially liked his depiction of Ella May, a white single mother of four living children, who is depicted as hard, smart and pragmatic. Unlike many of the other poor white people depicted, she has crossed the colour barrier, and lives amongst poor black people. Her fight for better working conditions and a union is a fight for all working people, but her views are not shared by all involved in the union movement. Some of the other characters seemed a bit extraneous and not fully developed, but this is a minor criticism. The Last Ballad was an excellent portrayal of a time and place, and its depiction was multidimensional. Cash clearly sympathizes with the union movement, but he isn't blind to some its flaws and tensions. Thank you to Edelweiss for giving me an opportunity to read an advance copy."}, {"userName": "Brenda - Traveling Sister ", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/10841164-brenda---traveling-sister", "userReview": "4.5 stars rounded upThe Last Ballad is a powerful, haunting, and moving story, that had me lost in the insightful, heartbreaking lush coulee with some of our Travelling Sisters. The story explores the courage of one woman's inspiring fight for justice that was inspired by actual events.Wiley Cash shows us the heartbreak and bravery of one woman along with other women and men who risked their lives to win basic rights for all workers. With intertwining voices and different perspectives, Cash takes us into the lives of some brave, interesting, gritty, likable and unlikable characters that are connected to our main character Ella May Wiggins. Well-done characters with many shades of humanity and each bringing their own conflict to the story that allowed us to feel their hopes, fears, bravery or cowardliness.When we first meet our main character Ella May Wiggins she is struggling to care for her family and we all loved her strength and through her bravery, she found her voice and stood up for what she believes in. She had something important to say and we wanted to hear it\"You've earned your story. I've earned mine. I've earned this being sad, this loss, this being angry. I want to tell it to people so they'll know what it means to earn it. ... They need to know they're not alone.”The Last Ballad is beautifully written however for us it was a heavy read. We needed to slow down and give it attention and the focus it deserved. Even though we can’t say we really enjoyed this one we really appreciated it. I highly recommend!For all my reviews featuring Wiley Cash please check out our Travelling Sister Bloghttps://twogirlslostinacouleereading...."}, {"userName": "Stephanie Anze", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/27117957-stephanie-anze", "userReview": "Ella May Wiggins is a single mother to four children. Six days out of the week she a spinner at American Mill No. 2. Overworked and underpaid, Ella has no choice but to continue at this job that barely sustains her family. When the leaflets for the union start appearing at her work, she is intrigued and decides to attend a rally. Struck by the significance of the union on the mill workers, Ella joins up. It will be a decision that will alter her life and many more after her.What a remarkable book! Set in North Carolina in 1929, the background of this novel is the union and their struggles to becomes established. Tired of being overworked and abused, some laborers walked out and striked in protest. Still, it was a mammoth task to recruit more people for they feared retaliation by the mill bosses. The union approached workers directly but more often left leaflets. That is how Ella May joined the fight. Her hard work earned her all of nine dollars per week. Following her first rally, she left her job and became an advocate for the textile mill worker. Ella also possesed a beautiful voice and her ballads about the mill workers rallied the people. It took very liitle time for the mills to notice Ella for she became a thorn at their side (at one point is referred to as a \"nasty woman\"). Raw, powerful, beautiful, emotional and sad this narrative surpassed my expectations. The prose is excellent and I will definitely seek more works by Cash. I have to say that I had not heard the name Ella May Wiggins before but I will not soon forget it now. A laborer turned advocate, ballader, speaker and ultimately a martyr for the cause, this is a woman that had courage and guts. I have nothing but respect and admiration for her. Ella May was different for a number of reasons. First off, she was white living among blacks and had them as her closest friends. She fought for the integration of black laborers into the union for she felt they were just as abused as the rest. In the South, not everyone saw it that way. Secondly, she was a single mom to four kids (her husband having abandoned her). Her most famous ballad \"A Mill Mother's Lament\" highlights the struggles of parenting under the duress of the mill. She testified before congress about the work conditions in the mill and did not back down despite their threats. On September 14, 1929 Ella May was killed in an ambush on the way to a rally. She was only twenty-nine years old. The mills were suspected but no one payed for the crime despite the fact that there were over fifty witnesses. Still her legacy lives on and paved the way for significant change. Bravo Ella May. I salute you."}, {"userName": "Ann Marie (Lit·Wit·Wine·Dine)", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/7447086-ann-marie-lit-wit-wine-dine", "userReview": "You can read this and all of my reviews at Lit·Wit·Wine·Dine. This book first captured by attention at Book Expo 2017. I’d not heard of Ella May Wiggins prior to reading the blurb and I was very drawn to the story of this young woman who fought for social justice and racial and gender equality. I was also very drawn to the beautiful cover!The Last Ballad is Ella’s story told in chapters which were snippets of the lives of several people who played a role in her story. With the exception of the chapters told in the first person by Ella’s daughter, Lilly, they were not exactly told in different points of view. As the story progresses we begin to understand how they they relate to one another and to Ella’s story on the whole. This worked well for the most part. I loved Lilly’s voice and wish we’d heard more of her story.This story is beautifully written and it’s clear that Wiley Cash is gifted writer. However, I did find that there were times that I felt the pacing was somewhat slowed by superfluous or overly descriptive narrative. It was difficult to resist the temptation to skim over a few areas so that I could get to more of the “meat” of the story. Though I know this book was based on the true story of Ella May, I’m not sure exactly how much of the book is factual and how much is the author’s imagined version of characters, events, conversations, etc. (This may very well have to do with the fact that I was reading an ARC. Perhaps there will be additional Author’s Notes in the finished copy.) The the story was told in a more plot vs character-driven way. The author did balance this particularly in rendering Hampton’s character.I applaud Wiley Cash for bringing us Ella’s story and reminding us of the unimaginable struggles she and her neighbors and co-workers faced on a daily basis just to put food on the table. Though this is a story from the 1920’s, parts of it felt sadly relevant to our own political climate today:“…\"Of course not”, Epps said again. “No violence.” “Just a friendly presence,” Guyon said. “A Good show of good people – mill people – to let the Reds know they’re outnumbered.” \"And this: “…Just a nasty woman.” I definitely felt a little tearful at the end of The Last Ballad. I can certainly see why Wiley Cash has such a devoted following and I look forward to reading his novels again in the future."}, {"userName": "Lindsay - Traveling Sister", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/54886546-lindsay---traveling-sister", "userReview": "3.5 stars!This was an informative, eye-opening and emotional novel. This story, based on true events, follows the life and legacy of Ella May Wiggins, a North Carolina union organizer in the 1920’s. She was one brave and courageous woman who stood up for her beliefs and worked hard to solely support her large family. I love learning about a piece of history I knew nothing about and this was definitely the case with this book. I was fascinated with Wiggins – learning how she lived and the choices she made for her families’ survival and community betterment. As much as I loved learning about Wiggins, I found the way the story was told was a bit choppy. Each chapter had a different characters’ perspective and some took a while for me to piece together. I also found several parts of the book dragged and my mind started to wander. I feel there could be several parts taken out of this novel which could strengthen the readers’ connection and focus while still keeping the story clear. I recently finished this author’s previous novel, This Dark Road To Mercy, which I loved. This author, Wiley Cash, definitely has a way with words. He is a great story teller and I look forward to reading more from him.This was another Traveling Sister Read which was a fantastic experience! We all enjoyed this one and the wonderful discussion it brought forth."}, {"userName": "Marialyce", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "What makes a person brave? What is it in some that allows them to push themselves forward in difficult times and achieve? Where does the line form between those who go with the flow and those who go against it?Ella May Wiggins, a poor mother of four is uneducated, at a poverty level, and destined to work in a mill countless hours a week for the wage of nine dollars. She is unlucky in love as she seems to pick men that use her and then leave her. Saddled with the care of four children with another one on the way, Ella begins a journey that brings her into the middle of the establishment of a union. She is certainly not the type we would think of as a spokesperson, but that is indeed what she becomes, a kind of face and voice given to the union with demands made for fair treatment, salary, and perhaps even integration.However, this is the South in the year 1929 and those ideals are not what are going to be accepted. The mills in which Ella works are controlled by the rich elite. They are not places where workers and their conditions and surroundings are given any consideration. They are places where hope does not exist and where the only ones getting rich are those who already are. Meanwhile families live in poverty, children take sick and die, and life is a journey of hopelessness.Mr Cash has written an historical fiction based on a woman whose history was forgotten. Mr Cash had been a part of the town where Ella's struggles and those of her coworkers, union organizers and others played out almost ninety years ago. While the book surely has a tale to tell, I found the first third of the novel to be difficult to get through. It seemed disjointed and somewhat meandering. However, the last two thirds of the book were where the story came together. These tales need to be told. We need to be constantly reminded of the people, the places, the lives that were lost, that helped pushed our country into an age where workers are valued and not the chattel of the owners. It is thanks to people like Ella that we today have employment that oftentimes pays a decent wage. Although not perfect yet, the goals that Ella and others had for workers have been in many cases achieved. “Every great thing that's ever been achieved started with the belief that it could be.”**Special tanks to the Sisters who read this book with me. I was so enlivened by their thoughts and discussions.**"}, {"userName": "Dana", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/10503220-dana", "userReview": "Inspired by the events of an actual textile mill strike in 1929, Cash creates a vivid picture of one woman's desperation. (Kirkus Review)Wiley Cash is a wonderful storyteller and great at capturing a strong sense of time and place/local color. He has done that again with The Last Ballad. Ella May Wiggins is a single mother who is barely keeping her family alive while working at a local mill, when she sees a flyer asking people to join a union. She finally sees hope and her best chance at a more promising life - but at what cost?Although I can't agree with some of Ella May's choices, I admire her courageousness and determination.Like Cash, who said this book was for his grandparents who were born on farms and saw only hope in the mills - my father grew up on a farm (oddly enough - the same town A Land More Kind Than Home was written about) and was determined to have a better life -so moved to Georgia where he earned his degree in Engineering. After graduating and teaching at a college there for a while, he moved to Asheville and got a job as the plant engineer in the local mill. He was not part of the union - but we heard lots of stories growing up. Also, like Cash, my mother was born in a mill village - and wrote a book about it -Greige Bales and Village Tales. This village was very different from the one Cash writes about as it was sweet and lovely place where everyone was like family. Her book (a local book, which I need to write a review) is a compilation of stories, interviews, and photographs of the people living in the mill village and the history of the mill. She met my dad at this mill. So....I can really relate to the stories Cash writes about - and I live in NC, so the places he writes about are very familiar to me.This was a read with the Traveling Sisters (Norma, Brenda, Jan, Berit, Jennifer, Nikki, Lindsay and Marialyce). One of our favorite quotes was ::\"You've earned your story. I've earned mine. I've earned this being sad, this loss, this being angry. I want to tell it to people so they'll know what it means to earn it. ... They need to know they're not alone.\"This was not my favorite Cash novel. It felt very disjointed at times, with multiple characters - although it did eventually all come together. Some sections were too long and I found myself skimming through. Still, it's an timely and interesting topic and the writing lovely. I would read anything he wrote! 3.5 stars"}, {"userName": "Connie", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "In the summer of 1929, Ella May Wiggins was trying to raise four children in a mill town in North Carolina on $9 weekly. She worked the night shift in the integrated textile mill for 12 hours six days every week. Her husband had run off, so the desperate mother had no help in clothing and feeding her hungry children. Ella got swept up by the union who were organizing a rally at the nearby mill town of Gastonia where she spoke of her troubles and sang pro-labor songs. Although this book is historical fiction, it is based on the life of the real Ella May Wiggins, a white mill worker who helped organize the black workers who lived in her poverty-stricken section of town.The book is told in multiple voices, showing a cross-section of people involved in the strike--mill workers and their families, strike organizers, police, and a mill owner's family--while the press lurks in the background. The book started out slowly, but picked up the pace when a black organizer from New York, Hampton Haywood, travels down South. A black man in the South faces even greater danger than the women, and Hampton's sections of the book were especially effective. A few of the secondary characters were not as important to the main story, although they added to the mill town ambience.Brave people like Ella May Wiggins started the labor movement which fought for better pay, shorter hours, and safer conditions in places of employment. Many were injured or killed while striking, but desperate people sometimes take big risks. Overall, I found \"The Last Ballad\" to be an interesting look at an important part of history."}, {"userName": "JanB ", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/260116-janb", "userReview": "I added a star to my rating, because now, a month after finishing, I find myself still thinking about it. It was a book that led me to the internet to find out more about Ella May, and that is the mark of a great book. Ella May was a poor, young, single mother of 4 working 12 hour days for a pittance, who became a labor organizer in 1929. Her story is a true one. Ella made $9/week, not enough to adequately house, clothe, and feed her children. I put her in a category with people throughout history who stood up for what was right despite the personal danger. No one ever thinks the worst will happen, but they have to take a stand. At the time, the disparity between the haves and the have-nots were striking and racism was rampant. Both are certainly relevant topics for today as well. I love a book that is entertaining while I learn something new, a book that makes me think and opens my mind. This book has all of that. And Ella, oh Ella, how she touched my heart. What misery she endured in her too-short life. I read this on a long drive with my husband and was compelled to share parts of the story with him. It sparked an interesting conversation.I loved the way the author wove all the different characters into the story. They all had a story to tell that was important to get such a strong sense of time and place and to help us understand Ella's life. \u2028I cried when I finished the book and even now I get teary-eyed when I think of the struggles and hardships she endured. I enjoyed the afterward, and I can’t help but think how amazed Ella May would be if she knew someone like me read her story nearly 90 years after her death. I found a you tube video of her great-granddaughter singing one of the songs Ella wrote about the struggles of the poor. Pete Seeger has also recorded her songs.This was a Traveling Sister read with Brenda, Norma, Dana, Berit, Jennifer, Nikki, Lindsay and Marialyce. You can find the Sisters' blog with this review and others at:https://twogirlslostinacouleereading...."}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "3.5★“People want to know that you’ve earned it…you’ve earned the story. I’ve earned mine. I’ve earned this being sad, this loss, this being angry. People have lived the same kind of life I’ve lived. They need to know they’re not alone.”Inspired by events of a textile-mill strike in 1929, Ella May Wiggins was a real person. She wrote songs that would be sung by Woody Guthrie and recorded by Pete Seeger. I’d say this was a labor of love for Wiley Cash paying tribute to people who once lived in the town where he grew up and where his heroine earned her place in history. My issue with it was the many separate narrative threads. It works and they ultimately connect in a satisfying way but I have come to resent this popular style of telling a story. It’s too distracting, sometimes confusing, and saps my reader’s energy and enthusiasm causing a domino effect of disconnection at points throughout. I just don’t like it when a book taxes my patience. In addition, revealing the end up front was not to my liking. A Land More Kind Than Home remains my favorite by this author."}, {"userName": "☮Karen", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "In person book club read #13 March 2018.This would be my least favorite book from the Wiley Cash repertoire. I adored his others. I had previously set this aside after only one chapter, thinking I'd finish it another day. That day came when my book club made it our March selection. Then during this attempt at it, I swore at the 50% mark I could go no further. But for the sake of my book club, I skimmed a couple of chapters and it picked up again with about 150 pages remaining. Thankfully, those final pages were (for me) the best of the entire book, go figure. Action packed, emotional, and nicely wrapped up.What I didn't love was that the chapters jumped around from new character to new character, and also from past to present. Just as I felt a rhythm in my reading, someone I never heard of would show up, interrupting the flow. This is something I find jarring in any book, and as I get older it becomes more difficult to adjust to. Also problematic is that I didn't particularly care for Ella May, the heroine of the book. I should have felt more empathy for her and her situation, I know. But instead, I felt Cash gave us someone emotionally distant and rather cold. She seemed to glide much too easily from struggling single working mother to activist, without a sense of any inner struggles or conflicted feelings.These are solely my opinions, and unpopular ones at that, given the high ratings on goodreads. So if you are one who doesn't mind time shifts and changing points of view from too many characters to count, go for it. Especially if you're already a Cash fan, you owe it to yourself to give it a try."}, {"userName": "Sara", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "Today is a tough day for me. I lost my sweet Fluffy, a cat who was more like my baby than my pet. He brightened my life for the last eighteen years, and I am at a loss to know what I am going to do without him. Additionally, I just came off a very hard and solemn read of A Fine Balance, so maybe the gloomy and foreboding book was not the best choice. So, I’m willing to concede that my timing might be part of what made this book never achieve the pinnacle it reaches for, but I think some of the credit goes to the writing and structure as well.I was very interested in the premise of this book--it is based on a true story, and that alone lends it instant credibility. While I felt for Ella May, the human face of the efforts to unionize the mills in several small North Carolina mill towns, I never felt attached to her. There are books that make you feel you are inside another person’s skin, and ones that make you just an observer...the inside the skin books are always my favorites. I want to imagine I have walked a mile in that person’s shoes. I was always observing Ella May.One of the things that did not work for me was the abrupt switch from chapter one, 1929 third-person Ella May, to chapter two, 2005 first-person Lily, her daughter. Of course, many people use this device, but here it seemed not to have any other purpose than to acquaint us with Ella May’s ultimate fate, and I felt that would have served better if revealed at its time in the story. It also broke the flow of the story for me, and I had a difficult time recommitting to the tale. It seemed particularly odd since Cash then resumes telling the story from the 1929 point of view and never reverts to Lily again until the final chapter, which serves as a kind of epilogue. Undeniably, Ella May’s story is a sad one and she was an unbelievably brave woman. In her circumstances and with four children to consider, I’m sure I would have been one of those continuing to slave at the mill and hoping to just go under the radar. She put everything on the line to try and improve her circumstances and those of her children, and that can only elicit admiration from those of us at a safe remove. What nags at me about the novel is that I felt I ought to love it, but I didn’t. It ought to have informed my understanding of the times and the place, but, again, it didn’t. I appreciate that this is a moment in history that deserves to be remembered and examined, I just never felt connected enough to anyone to feel I had been there or experienced any of the events portrayed."}, {"userName": "Tom Mathews", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/22063432-tom-mathews", "userReview": "The biggest problem with novels based on actual events is those pesky spoilers. Seriously, how many people who watched the movie Titanic didn’t know at the outset that that ship was going to sink? Sometimes, though, it is necessary to put a human face on events that shape the world we live in. If Jack hadn’t sacrificed himself and died of hypothermia to save the woman he loved, how could we possibly come to care about a hunk of steel plummeting to the ocean floor?So it is with the early days of the American labor movement. We learned in school how those who worked for long hours under hellish conditions for starvation wages took a stand against rich factory owners who had the resources to buy not only armies of hired muscle and Pinkertons but the very government and military itself to maintain control of their mines and factories. But it can never become personal until we read first-hand the stories of Orville Frank Aderholt, a police chief who strove to maintain order in chaos but ended up dead in a shoot-out, or Ella May Wiggins, folksinger and labor organizer who was murdered by a mob of strike breakers. And few authors are better suited to resurrect the voices than Wiley Cash, a native son of North Carolina and master of southern literature. Although both sides painted different pictures of Ella May Wiggins, some things are known. Like many Appalachian hill people, she was lured away from the mountains to a life in the factories with promises of good jobs by company recruiters hired to bring in lots of cheap labor to run their mills. Her job at American Mill in Bessemer City, North Carolina, wasn’t enough to provide adequate food and shelter for her and her four children so she found the rhetoric of the labor unions. Like many hill people, Ella May had a close connection with folk music and used it to tell her story and union rallies. It is unsettling to read how closely connected the unions were to the Communist party at this time in our history but the reality is that the party was one of the most outspoken advocate for the abolition of Jim Crow laws, an end to lynching, equal access to education, interracial marriage, and the rights of workers to demand fair wages and safe working conditions. I suspect that the animosity Americans have towards communism today stems more from the propaganda spread by the captains of industry who needed to win the war for popular opinion and couldn’t do it by preaching that living wages are bad. Another problem that authors experience when writing novels about actual events is that those actual events don’t always end in a way that one would wish them to, but Cash reminds us of the old adage that ‘every story, even your own, is either happy or sad depending on where you stop telling it.” Not all author know when to end a story, but Wiley Cash does. *Quotations are cited from an advanced reading copy and may not be the same as appears in the final published edition. The review was based on an advanced reading copy obtained at no cost from the publisher in exchange for an unbiased review. While this does take any ‘not worth what I paid for it’ statements out of my review, it otherwise has no impact on the content of my review.FYI: On a 5-point scale I assign stars based on my assessment of what the book needs in the way of improvements:*5 Stars – Nothing at all. If it ain’t broke, don’t fix it.*4 Stars – It could stand for a few tweaks here and there but it’s pretty good as it is.*3 Stars – A solid C grade. Some serious rewriting would be needed in order for this book to be considered great or memorable.*2 Stars – This book needs a lot of work. A good start would be to change the plot, the character development, the writing style and the ending. *1 Star – The only thing that would improve this book is a good bonfire."}, {"userName": "Christina Kline", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/7874536-christina-kline", "userReview": "Lives are changed forever in this intimate and yet expansive novel about a real-life 1929 North Carolina mill strike. With subtlety and insight, Wiley Cash reveals the dignity and humanity of people asking for a fair shot in an unfair world. Fraught with the turmoil of social change, THE LAST BALLAD moves inexorably toward a devastating moment of reckoning. A timely and topical portrait of a community in crisis."}, {"userName": "Diane Barnes", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "I really wanted to like this book much more than I did. It's my first Wiley Cash novel, and it's gotten glowing reviews, and takes place in my native NC, so I was receptive and entered the pages with high hopes.The novel was written from different character's perspectives, and different time periods, which I usually like, but in this case, it seemed to take away from the main story of Ella May Wiggins and the violent mill strikes in Gastonia during 1929. I felt as though I were reading many different stories, any one of which could have been an interesting book on its own, but left me feeling confused as to this one. As a result, I never felt any real sympathy for any of the characters, even Ella May.My real rating is somewhat lower than 3 stars, but I'm rounding up because maybe it's just me, and maybe I'm missing something."}, {"userName": "Nikki", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/7538243-nikki", "userReview": "The Last Ballad, by Wiley Cash, is a novel inspired by the real life of Ella May Wiggins, mill workers, unions, and tumultuous times in North Carolina in 1929. This is not a \"light\" read, but one that is thought provoking and, for me personally, one that requires lots of focus. I enjoyed and appreciated the purpose and message of Cash's story, and I find myself still thinking of Ella May quite often. His writing is descriptive and beautiful, however, I struggled with the layout of the novel. I felt the flow of the book was a bit muddled, particularly the first half of the novel. As a North Carolinian, I enjoyed having some perspective on where the events of the novel took place, and it was nice being able to picture these places. I am rating this 3 stars. I enjoyed Cash's other novels (A Land More Kind Than Home and This Dark Road to Mercy) more than The Last Ballad. Although The Last Ballad was not my favorite, he continues to be an amazing writer, and I look forward to reading more from him in the future. **This was another wonderful experience with the Traveling Sisters. I had the pleasure of reading this along with Brenda, Berit, Marialyce, Dana, Jan, Norma, Lindsay, and Jennifer. The Last Ballad offered lots for discussion and deep thoughts."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "In 1929, the south was home to a growing movement of protest for workers' rights. Told from rotating perspectives as Wiley likes to do (including at least one character from forgotten history), the author tells the stories surrounding the Loray Mill in Gastonia, NC. I live in a former mill town in the south, also mentioned in the book, so this was of particular interest to me.I've read several books by Wiley Cash at this point and have seen him speak a few times at conferences and the like. I see that this rotating perspectives approach works for him, but I'm hopeful that he will make an attempt to write a novel without it at some point. I'd really like to get to know one central character in a deeper way. Something about this rotating perspective makes me feel like I'm kept at arm's length from truly connecting as a reader. I received a copy of this book from the publisher through Edelweiss in exchange for an honest review. The book came out in October 2017; I'm playing catch up!"}, {"userName": "Sue ", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/690922-sue", "userReview": "I have read all of Wiley Cash's books and I while I definitely enjoyed the first two, The Last Ballad, his third book, is definitely my favorite. The writing is so beautiful that I read the book slowly so I could savor his words. I felt like I was part of the action and could clearly see the scenes he set in this novel. The characters were so well done that I felt their pain as they worked to bring better pay and working conditions into the NC textile mills. This is a must read book about an early history of not only the labor movement but also the women's and civil rights movements in our country.My husband grew up in a NC mill village and his parents and grandparents before him all worked in textile mills. I used to hear family stories about working in the mills and often questioned how they felt about the mill owners. Without a pause, they all assured me that the owners were all part of the mill family and were doing their best for the workers. Coming from Detroit with a grandfather who was a union organizer in the 30s, I had trouble believing that the mill owner looked out for their best interests. This book was a real eye opener for me and answered a lot of questions that I had - why my husband's grandparents moved to the city from farming in Tennessee, why the textile mills stayed non union for so long and how the workers were treated in the mills. Beyond a personal interest in the story, I will tell you that this was one of the best, if not the best, book that I've read all year. The author's use of language is beautiful and helped create a beautiful, though violent, story. The main character Ella Mae Wiggins, who worked 72 hours a week for barely enough money to keep her children fed. Her husband has run off again and she is trying her best to keep her children fed and clothed even though it keeps her away from them for hours every day. When she sees a leaflet about the union, she decides to check it out to see if they can help provide her with a better life for her and her children and ends up as a crucial member of the drive to unionize the textile unions. The author uses a number of voices to tell the story but as they all come together at the end, the reader is left with sadness but more importantly, left with a feeling of pride and awe in Ella Mae Wiggins, a poor mill worker who tried to make a difference in her life and the lives of all of the other mill workers - both black and white - of the time.This is a beautiful book and I highly recommend. Not only was the book fantastic but it is based on real people and a real strike at Loray Mills in Gastonia, NC, in 1929 that seems to have been forgotten. There was a real Ella Mae Wiggins who was a mill worker that started working with the unions. Wiley Cash does a wonderful job of telling her story and the time she lived in. I highly recommend this book!"}, {"userName": "Kathleen", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/56509454-kathleen", "userReview": "Thank you to Goodreads, because this book was not even on my radar until I saw the Goodreads giveaway and signed up. I won an autographed copy from William Morrow and I'm so glad I signed up. The Last Ballad  is historical fiction, based on true events in 1929. It is sad, and also beautiful, to see how Ella May and her fellow millworkers endured unimaginable living and working conditions and fought desperately for a better life."}, {"userName": "Asheley", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/4691325-asheley", "userReview": "When I first saw the advanced copies for The Last Ballad by Wiley Cash being circulated months ago, I got so excited. His books are among my very-favorites. His stories are always so layered and his characters sometimes seem so straightforward but they’re actually really complex. And I love the way they’re set in the dusty, gritty parts of North Carolina, which is my home.The Last Ballad is a fiction story that is based on real history and real people. It tells a the story of the Loray Mill Strike of 1929, which took place in Gastonia, NC. This was historically one of the largest textile strikes in the US (as far as I can tell), and certainly one of the most significant of the time. This occurred during a time and place of huge racial tension in North Carolina and across the South, and this strike was a chance for mill workers to strike for better wages and working conditions.The story’s main character, Ella May Wiggins, was a real woman, and I’m sad to say that before reading The Last Ballad, I had never heard of her. Ella May was a single mother with several children who worked 72 hours per week for a paycheck of $9/week. She worked nights and had no choice but to leave her children alone to take care of one another while she worked. When she occasionally missed work due to her daughter’s recurring illness, she was penalized and treated poorly by her bosses at the mill. When she put in a request to be moved to the day shift so she wouldn’t have to leave her children at home, she was ignored.Ella May was reluctant to join the strike because what if her boss got angry and she lost her job? How would she take care of her children then? She was already living paycheck-to-paycheck, and barely. But she saw absolutely no other choice and she felt like she could make a difference. She felt like her story was similar to other mill workers across the area, so she took the chance and joined the union. She eventually became a leader among the strikers, raising interest in the union by singing motivational ballads at the meetings. She was far more progressive than most strikers, however, because she advocated for fair wages and working conditions for all people, regardless of color. This was dangerous during such a racially tense time in North Carolina and made Ella May a large target for people that wanted to shut down the strike and for racists.The Last Ballad is structured so that we are able to hear from multiple POV’s. We hear from Ella May, of course. But we also hear from various people in the community, people that are situated on all sides of the strike. I love this method of storytelling, particularly coming from Wiley Cash, because it gives depth to a story that is already so layered and nuanced. Mr. Cash historically has a way of showing that there is usually something good on each side of a conflict, even if it isn’t obvious, even if it is small, and that sometimes the obviously good aren’t always pure in their movies. For example, one of the more pivotal secondary characters is a mill owner’s wife that is sympathetic to the strikers’ cause. On the other side, many of the strikers show violent racism in their words and actions.Another thing that I love about this book and Mr. Cash’s other stories is the theme of redemption. There is one character in The Last Ballad that I felt was a little bit oddly placed for a while, until I got to the end and suddenly that particular character’s inclusion clicked into place and made perfect sense. I suppose to that I would say: sometimes people spend their entire lives trying to atone for a past hurt or wrong. It is always so satisfying to me when I read of someone that has tried for years to redeem his/herself and an act comes full circle.I love love love Wiley Cash’s other books, but I think The Last Ballad may be my favorite. His stories just grab my heart for one reason or another. They are so full of North Carolina to me, so full of home. They’re also dust and hard work, they’re the South, they’re the very best people and also some of the worst. Every time I close a Cash book, no matter if I’m reading it for the first time or if it is a reread, I am always overwhelmed by that story and I just need to sit with it for awhile.The Last Ballad is one that I’ve spent considerable time anticipating in 2017 and I’m so excited to say that it’s a top-shelf, rereads-worthy favorite for this year.I received this book for free from the publisher in exchange for an honest review. This does not affect my opinion of the book or the content of my review. Thank you, William Morrow Books!Find this review and more like it on my blog, Into the Hall of Books!"}, {"userName": "Nancy", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/28397995-nancy", "userReview": "My first Wiley Cash novel will not be my last. Cash is a wonderful storyteller, entertaining while enlarging our knowledge. The story is compelling, the characters wonderfully drawn and real, the theme relevant.The Last Ballad is the fictionalized story of the 1929 labor movement to unionize the mills of North Carolina. Ella May Wiggins struggles to provide for her family, working 12 hours a night, six days a week, for $9 a week. She lives in Stumptown, the black part of town, and her neighbor Violet is her friend and support. Ella is drawn to the Union for the dream of a living wage, the ability to feed and clothe her children. The Northern organizers decide that Ella is the perfect 'face' for the local movement. Discovering that she sings and has written a ballad called The Mill Mother's Lament*, the organizers put Ella on the payroll.Ella finds courage and discovers leadership skills. Her ballad brings her fame, and she goes on to write protest songs for the Union movement. The mill workers go on strike. Joining the Union and going on strike is a hardship, and as known members of the community they are easily targeted. In 1929, unions were considered 'Red', socialist, communist, and most of all, anti-American. Ella complicates things--she wants to organize the African American mill workers into the movement. The Council attacks the platform of equality and laws against lynching, warning that the Union will destroy the Constitution, the church, and the justice system.\"We ask every man and woman in Gaston County to answer the following question: Will I allow these communists to gain control of Gaston County...? The time is at hand for every American to do his duty.\" Gaston Transom-Times, Thursday, April 4, 1929. From The Last Ballad The union organizers are Northerners. Although their lives are threatened, they also can leave town when things get hot. Hampton, an African American Pullman porter, member of the Brotherhood of Sleeping Car Porters and a Socialist, arrives to assist organizing the black workers. He is not trusted by the black community and is considered another 'outside agitator' by the  Council, a coalition of community leaders and police determined to squash the union. He is shocked to see the white mill workers living in dire poverty.Ella works for the Loray Mill, whose owner is not an unjust man, although a clueless man who has never taken the time to question how things are. He thinks he does well by his mill workers and considers himself progressive. He is pressured to contribute funds to the Council. His wife, however, is compelled to understand. She befriends Ella without revealing her identity.  The Confederate Solders Reunion celebration in Charlotte on June 7, 1929 stirred the emotions of Albert Roach. Too young to have fought in WWI, he longs for valor and a chance to be important. He sees his chance to fight communism at home-- the Loray mill strikers. In a drunken rage, he violently lashes out in the crowd, which mostly consists of women, all become the enemy in his drunken and disordered mind.The novel leads up to a thrilling and horrifying climax. Cash brings us inside all the characters and sides of the story, so we understand how these characters came together on June 7 and its devastating events. I am grateful to have received a free book through Bookperk Page Turners."}, {"userName": "Bookworm", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/31167656-bookworm", "userReview": "I really wanted to love this book. I was quite excited upon starting it as many people raved about it. I'm sad to say that this story was good but not great for me. I had a hard time connecting with the characters and found them one dimensional. I tried really really hard to invest myself fully but just couldn't. I wasn't able to care about any of the characters. As the plot progressed, I found myself less and less invested to the point in which I started skimming to the end. The best part of the book was actually the last chapter when the author summarizes the historical facts and talks about his personal ties to the event. If only the rest of the story had the heart that the final chapter had, I'm sure I would have devoured it."}], "description": "Named a Best Book of 2017 by the Chicago Public Library“Wiley Cash reveals the dignity and humanity of people asking for a fair shot in an unfair world.”- Christina Baker Kline, author of A Piece of the World and Orphan TrainThe New York Times bestselling author of the celebrated A Land More Kind Than Home and This Dark Road to Mercy returns with this eagerly awaited new novel, set in the Appalachian foothills of North Carolina in 1929 and inspired by actual events. The chronicle of an ordinary woman’s struggle for dignity and her rights in a textile mill, The Last Ballad is a moving tale of courage in the face of oppression and injustice, with the emotional power of Ron Rash’s Serena, Dennis Lehane’s The Given Day, and the unforgettable films Norma Rae and Silkwood.Twelve times a week, twenty-eight-year-old Ella May Wiggins makes the two-mile trek to and from her job on the night shift at American Mill No. 2 in Bessemer City, North Carolina. The insular community considers the mill’s owners—the newly arrived Goldberg brothers—white but not American and expects them to pay Ella May and other workers less because they toil alongside African Americans like Violet, Ella May’s best friend. While the dirty, hazardous job at the mill earns Ella May a paltry nine dollars for seventy-two hours of work each week, it’s the only opportunity she has. Her no-good husband, John, has run off again, and she must keep her four young children alive with whatever work she can find.When the union leaflets begin circulating, Ella May has a taste of hope, a yearning for the better life the organizers promise. But the mill owners, backed by other nefarious forces, claim the union is nothing but a front for the Bolshevik menace sweeping across Europe. To maintain their control, the owners will use every means in their power, including bloodshed, to prevent workers from banding together. On the night of the county’s biggest rally, Ella May, weighing the costs of her choice, makes up her mind to join the movement—a decision that will have lasting consequences for her children, her friends, her town—indeed all that she loves.Seventy-five years later, Ella May’s daughter Lilly, now an elderly woman, tells her nephew about his grandmother and the events that transformed their family. Illuminating the most painful corners of their history, she reveals, for the first time, the tragedy that befell Ella May after that fateful union meeting in 1929.Intertwining myriad voices, Wiley Cash brings to life the heartbreak and bravery of the now forgotten struggle of the labor movement in early twentieth-century America—and pays tribute to the thousands of heroic women and men who risked their lives to win basic rights for all workers. Lyrical, heartbreaking, and haunting, this eloquent novel confirms Wiley Cash’s place among our nation’s finest writers.", "title": "The Last Ballad", "url": "http://www.goodreads.com/book/show/36341125-the-last-ballad", "average": 3.93, "cover": "https://images.gr-assets.com/books/1527171158l/36341125.jpg", "reviews": 587, "authors": [{"url": "https://www.goodreads.com/author/show/5018174.Wiley_Cash", "name": "Wiley Cash"}, {"url": "https://www.goodreads.com/author/show/5018174.Wiley_Cash", "name": "Wiley Cash"}], "type": ["Historical", "Fiction", "Historical", "American"], "outlinks": ["http://www.goodreads.com/book/show/36341125-the-last-ballad", "http://www.goodreads.com/book/show/33913895-the-last-ballad", "http://www.goodreads.com/book/show/33913894-the-last-ballad", "http://www.goodreads.com/book/show/33930087-the-last-ballad", "http://www.goodreads.com/book/show/36222304-the-last-ballad", "http://www.goodreads.com/book/show/34818812-the-last-ballad", "http://www.goodreads.com/book/show/12408149-a-land-more-kind-than-home", "http://www.goodreads.com/book/show/17349104-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11958773-the-rain-barrel", "http://www.goodreads.com/book/show/23420021-fate-moreland-s-widow", "http://www.goodreads.com/book/show/5977045-this-louisiana-thing-that-drives-me"]}