{"ratings": 288, "userreviews": [{"userName": "marissa sammy", "userReviewDate": "Nov 20, 2009", "userURL": "http://www.goodreads.com/user/show/122026-marissa-sammy", "userReview": "Geling Yan offers a complicated disturbance to stereotypical notions of East Asians in this novel, with her historical heroine Fusang and with her own narrative presence as a \"fifth-wave\" Chinese woman teasing out the details of Fusang's life. Her refusal to shy away from or soften the ugly, distressing truths about the suffering of Chinese women at the hands of white Americans and sometimes Chinese men reminded me very much of the same forthright manner of Sky Lee's \"Disappearing Moon Cafe\", which deals with westcoast Canadian Chinese of the same era.On the surface, Fusang is all of the things that are used to (mis)characterize her race — inscrutable, implacable, mysterious, always either smiling or serene. But Yan goes deeper than that to uncover Fusang's extraordinary tenacity and strength, her skills in negotiating a world in which she is simultaneously valued and worthless, and her incredible desire to survive.Many of the pro reviews I've read complain that Fusang never becomes \"fully realized\" and that her motives are unclear. I strongly, passionately, insistently disagree. Fusang has a distinct, layered personality while embodying a powerful critique of perceptions of Chinese women, and her motives, although not made explicit, were never in question or doubt. I wonder if these reviewers expected a fairy-tale ending with Chris, the white man who pays for his turn with her as a teenager but also convinces himself that he loves her? Were they expecting a Pretty Woman result?I don't think Yan's intent for this book was to spell out a neat, packaged story of exploitation, brutalization, and salvation of Chinese women to satisfy a voyeuristic audience hungry for tales of \"exotic\" pain and suffering (with a happy ending). I think her intent was to testify to the legacy of oppression that Chinese Americans faced and still feel the influences of. Fusang is not an easy heroine, with stirring speeches or epic true loves. She is, however, exactly that lost daughter that Yan and many other Asians and diasporans are trying to tell stories about, and for."}, {"userName": "Kinga", "userReviewDate": "Aug 02, 2010", "userURL": "http://www.goodreads.com/user/show/110812-kinga", "userReview": "I can't quite make up my mind about this book. It was either really good or really bad. The protagonist was either bland and boring or too complex and foreign for me to understand. And this second person narrative when the narrator/author is having a private conversation with the main character and I, as a reader, get no love. Was this a brilliant idea or was or was it a reckless experiment?I admire Geling Yan for writing this book with bravado and making her heroine virtually mute. I can't say it worked for me all the way through but I give credit where credit is due. And it is the first time I feel that the second person narrative is at least partly justified. It emphasized that our heroine is so elusive that even the narrator hasn't got a clue.Other than that, it was the second book about Chinese prostitutes I have read. In this one they didn't quote Confucius so I was slightly disappointed."}, {"userName": "Jori Richardson", "userReviewDate": "Nov 23, 2012", "userURL": "http://www.goodreads.com/user/show/6089955-jori-richardson", "userReview": "The beautiful Fusang is brought to the city of 1860's San Francisco as a prostitute after being kidnapped from her home in China. There, she is sold from brothel to brothel, continually crossing paths with Chris, a young American boy who falls in love with her.I did not care for this book, and one of the main reasons was the way that it was written. The style was, above all, detached and bland. There were no quotation marks, something I always dislike (I always wonder why an author would choose to write this way?), and there were no chapters. It made the book feel even more like a droning narrative.But more importantly, there was an omniscient sort of narrator, who wrote in 2nd person, addressing Fusang as \"you,\" as if perhaps they are reminding Fusang of her own memories. Often, the narrator would tell Fusang to do things, or give her little bits of advice, such as \"Look at the customer, now, that's it...\" But later on, the narrator reveals herself to be a modern-day woman who was born 128 years after Fusang. So it just didn't make any sense.Then, it would sometimes switch to Fusang's story being told quite regularly, in 3rd person (much better). The problem was that these two different styles would often overlap and go over the same things. The narrator might say: \"You walk down the street - watch where you're going, now!\"And then the other form of the story will pick that up a few pages later and say \"Fusang walked down the street.\"It was confusing, pointless, and annoying.The second thing I did not like about this book was our heroine, Fusang, herself. She appeared to have few feelings about any of the events in her life. When she is married by proxy to a man whom she may never meet (he is in America, sending money back to his family), we cannot exactly tell what she thinks about this change. When she is kidnapped and sold into prostitution, she never betrays any emotion, either. Though it is always stated quite certainly that Chris loves her, it is never clear if Fusang cares for Chris at all.Perhaps a lot of this could be blamed on Fusang's stupidity - the second reason I disliked her. Bricks have been known to exhibit more intelligent.When she is kidnapped, Fusang lets herself be lured away by a strange man onto his boat. When he has her tied up, he assures her that it is because \"women crossing the sea aren't allowed to have two legs, it's a violation of ocean law.\" Fusang accepts this without question, and when she sees a member of her family running to the shore in an attempt to save her, she simply waves goodbye, smiling ignorantly.She seems not to understand what being a prostitute actually is, even after she has been one for years, later in the story.She forgets every man she has ever slept with, and when they remind her of their nights together, she simply smiles stupidly at them. Whenever she met Chris again, sometimes I would wonder if she even remembered who he was.On the other hand, I did find tiny glimpses into the character I think Yan was trying to write. Fusang can at times a simplistically charming girl who remains unaffected by her tragic life, a girl who is too good to be ruined by it. She puts on lipstick not because she is trying to lure customers, but for the simple reason that she likes how it tastes. As many times as her madames beat her, she never makes any attempt to interest potential customers, letting them approach her instead.But even with these occasional little bits of a personality, she was a heroine I found it very hard to side with.The only thing that I found interesting about this book was the distinctly Asian feel to it, despite it being set in an American city. It was easy to forget that I was in San Francisco, as it seemed so Chinese. It is fascinating that there are so many Chinatowns all over the world, where the Chinese people have managed to retain their culture and set up a town within a city, just for themselves.This sounded like such a good premise for a story - a rich young American boy falling in love with a Chinese prostitute. But Chris appeared only a few times, and their romance never seemed convincing. That combined with the bland heroine and awkward writing style ruined the book for me."}, {"userName": "Pia", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/17369374-pia", "userReview": "A lot of research obviously went into this book and it does take you to places you might not otherwise visit. Alas. The story is told in a way that makes all of its characters float in space with no clear reason for doing anything; no aim, no personality, no flesh, no bones, no independent inner dialogue - mere wispy apparitions of the author's mind.The author inserts herself into the story throughout, which blocks every attempt at getting absorbed. When we read about what a character is thinking, we hear it in the author's voice. Never true inner dialogue.The whole story is told, not shown - and just like when sitting down with your auntie Sally and listening to her telling you what Chrissy and David did at work today, you'll never believe it, you are constantly aware that the story is told through the author's point of view; not of the characters'.Pseudo-profound wistfulness and descriptions of the worst sides of human nature told in an ethereal, matter-of-fact way, with an added air of Western 'oriental' fantasy makes for a strange and somewhat cringeworthy combination. A different mix would have illuminated this story's underbelly in a better way."}, {"userName": "Persephone Abbott", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/5887151-persephone-abbott", "userReview": "The end of this story made me shed a tear...or two. It reminded me a little of a beautiful Chinese film, resigned, restrained and fateful. But up to the last few pages I was remarkably impressed with the way Geling Yan was able to create a fine tuned perspective between East and West, man and woman, in a brutal and \"barbarically civilized\" time without being sentimental or cloying. She saved the emotion for the end, or the no ending. I greatly enjoyed \"The Banquet Bug\" however when I read the back of the paperback edition of \"The Lost Daughter of Happiness\" I wasn't tempted to read it because of the description and newspaper review which were presented to entice the buyer. But since my husband wanted to read another book by this author I bought him a copy. And then I read it, too curious not to pick it up. I believe it is one of the best books I have ever read about San Francisco. There are many passages that shifted to the category of my \"favorite one\" until the next one came along and I felt treated to the Chinese novel format (no apostrophes). I would greatly like to meet Geling Yan, or hear her speak publicly."}, {"userName": "Preeta", "userReviewDate": "May 12, 2007", "userURL": "http://www.goodreads.com/user/show/77824-preeta", "userReview": "This started off pretty well, I thought, with the writer speaking directly to her subject (a turn-of-the-century Chinese prostitute in San Francisco). Bold post-modernish device, promising setting. But then she gets more and more heavy-handed, and after a while the studiedly spare prose really starts to feel like it's trying way too hard for *something* (one is never quite sure what, alas). And then it all goes *really* bad when the writer begins to load her politics (mostly feelings about immigration & the place of Asian immigrants in the US *today*) onto a tale that just can't bear that weight."}, {"userName": "Elizabeth", "userReviewDate": "Apr 14, 2012", "userURL": "http://www.goodreads.com/user/show/8443209-elizabeth", "userReview": "This book was a let down for me. I saw it on here as a book to read, and ordered it from my local library....that seemed to be the best part of the tale.I did not like the narration of the book, as the tale was being told, the narrator would break in and begin speaking to Fusang.Characters were flat, and they all seemed to lack the general capacity to have enough sense to know how they \"felt\" or were not able to recognize how they felt towards each other, (especially Chris and Fusang), in this story.I liked the basic premise of the book, and thought it could have been better written. It was a fast read, but I am glad it is over."}, {"userName": "Meghan", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/5473569-meghan", "userReview": "I got a little over 100 pages into this book and still could not get into it. The main character was not likable and the writing style randomly switched back and forth between third to second person. The description on the back of the book made it seem as though Fusang and Chris are in love, but in actuality Chris is the only one in love. Fusang has no emotions whatsoever about anything at all, which makes it very hard to get emotionally invested in the story yourself. The plot was incredibly slow moving and having no chapters made this short book even more of a slog."}, {"userName": "Rouelle", "userReviewDate": "Jan 14, 2015", "userURL": "http://www.goodreads.com/user/show/39156752-rouelle", "userReview": "I remember buying this book on a booksale, I was intrigued by the cover so I started to read it that same day. Since I wasn't used to this genre, I was forcing myself to read at least one chapter a week. After one boring summer I gave in and promised myself to finally finish it... and I'm glad I did!This book was beautiful in every way, a bit tragic but definitely thought provoking. I let my friends borrow this book and they too felt the same way I did: sad and hungry for more."}, {"userName": "Cecilia", "userReviewDate": "Oct 29, 2009", "userURL": "http://www.goodreads.com/user/show/2864262-cecilia", "userReview": "parts of the beauty of this book is its simplicity yet complexity. some passages never fail to go directly to my core, recalling a history that is too often forgotten and too easily ignored."}, {"userName": "Steve", "userReviewDate": "Apr 09, 2016", "userURL": "http://www.goodreads.com/user/show/33845674-steve", "userReview": "Fusang, the name of the central female figure in Geling Yan’s most celebrated novel, The Lost Daughter of Happiness, also happens to be the name of the land in western North America where the Chinese are reported to have landed long before Columbus. Is there a correlation? Given the myriad strands of social commentary, history, and east-meets-west romanticism that underlie the simple love tale in this marvelous book, I like to think so. Centered around three main characters, Fusang, a young American boy named Chris, and the menacing pimp Da Yong, the story is interspersed with a one-sided conversation between the author and Fusang. Representing we the audience and thus blinded and frustrated by our own modern viewpoints, the author tries to sort through the mythology and get to the truth behind the veil. This novel is at various times, a hard look in the mirror of our frightening, racist, and ignorant past, and a soft focused reflection on the timeless fascination we have for those who are not like us. For many Americans, Fusang must come across as a naïve perhaps even mentally disabled person. How else to explain the detached bemusement she maintains through her horrible life as a prostitute? Hers is not some heroic tale tainted by modern feminism nor is it a trite cultural tragedy. Rather, it falls into the realm of truth that we often find hard to swallow. That such simple, innocent, and almost pathetic people survive, find joy and love in their lives, and maintain their dignity is a jarring paradox for many. We demand that our heroes and heroines be strong, dominating, and iconoclastic, not passive, obedient, and conventional, thus Fusang might easily be written off as merely stupid, or worse, a tragic victim of misogynistic cultural norms. Herein, I believe Yan accomplishes the difficult task of making such an otherwise pitiful character not only genuine, but also smart and admirable. There is much in this easily read novel that shines a light on racism, the clash of cultures, objectification, and the powerful attraction of the forbidden. It is a provocative story, brilliantly written in a cascading, dreamy prose. I’ve read a few of Geling Yan’s books and this is her most gorgeous and compelling."}, {"userName": "AlexLovesBooks", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/51953317-alexlovesbooks", "userReview": "The Lost Daughter of Happiness is a remarkable novel, a love story unlike any I've read. It unfolds in alternating points of view. Writing in the second person, as if she were speaking to Fusang, looking back at Fusang's life from the present day, the narrator's language is factual, unemotional, sometimes bordering on contemptuous: You are a prostitute, she says, brought to California from China, one who didn't die during the long voyage, who didn't succumb to disease or beatings after being sold into slavery. \"I certainly won't let people confuse you with any of the other three thousand whores from China.\" Occasionally the narrator quotes histories of the California Gold Rush from which she draws her account of Fusang. Occasionally she tells Fusang tidbits about her own life as a recent Chinese immigrant, about her own perplexity understanding the ways of white people, including her husband. In this new novel, set in the 1870s, she has borrowed a figure from history, Fusang, the most famous prostitute in San Francisco, and has imagined an unusual lover for her, a 12 year old white boy named Chris.Approaching the issue of anti-Chinese racism through these two characters, she tells a tale of slavery, rape and murder, and, ostensibly, love. I say ostensibly because Chris and Fusang remain completely opaque throughout the novel; we can never comprehend their motivations or thought processes."}, {"userName": "Marthe Bijman", "userReviewDate": "Sep 21, 2013", "userURL": "http://www.goodreads.com/user/show/13110348-marthe-bijman", "userReview": "Despite the tagline on the cover, this is not a traditional romance. The story is simultaneously revolting and intriguing, upsetting and riveting. In fact there is hardly any love to speak of, rather a lot of tragedy, and an array of decidedly nasty characters – pimps, wanderers, rapists, wheeler-dealers, miners and prostitutes in San Francisco of the 1860s. Even the main character, exotic courtesan Fusang, is not beautiful or charming by today’s standards, with tiny, contorted feet, wobbly fat and a habit of chewing and spitting melon seeds in stead of talking. Fusang survives kidnapping, rape, beatings and disease because she is utterly aloof: “…deep down she really was free; she had the kind of freedom that rescue or salvation could never bring, the kind that nobody could ever give or take away.”This puts a distance between her and an ordinary farm boy who falls in love with her and wants to save her. The contrasts between their worlds are mirrored in the differences and tensions between the resentful San Francisco establishment and the growing Chinese immigrant population. Yan contrasts the Taoist attitude of the majority of the Chinese, Fusang in particular, and their fatalism and passivity, with the zeal and possessiveness of the Americans, and, intriguingly, extends these observations to modern-day Chinese-American relations. Not an easy read, this, but well worth the effort."}, {"userName": "E. Amato", "userReviewDate": "Dec 15, 2009", "userURL": "http://www.goodreads.com/user/show/668454-e-amato", "userReview": "Book starts out poetic and beautiful. The historic element is interesting, but somewhere along the line both the writer and the narrator, ostensibly the writer, lose their way. It is hard to make a story sensual that is also so overtly political and is based on the idea of female sexual slavery and prostitution. It works for a time, but the continued tone starts to wear thin, as the narrators observances gradually shift into diatribes -- ones that are all too obvious, and therefore unnecessary. The narrator herself is not very interesting, so her interruptions to the narrative begin to read as just that. Repetition of imagery and narrative elements begins to get tedious. There is lovely symmetry in the story and the characters and it is a good read, but overall, it is unsatisfying on some levels. Fusang's character is forced into becoming a representative cypher by the author - despite the fact that her actions and her manner as portrayed do add up to an intelligible personality. Da Yong never seems to be given a voice in the last third of the novel, which is also unfortunate, as he is the most interesting character in the book. Overall worth the read - it is a quick one, but there is a strong feeling a better editor could have made this a much more significant and entertaining book."}, {"userName": "Mel", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/5866692-mel", "userReview": "I was given this book by a friend who read it but didn't care for it so she offered it to me. At first I wasn't sure as I'm not terribly keen on modern Chinese literature (the little I've read) but saw the author was the same woman who wrote \"xiu xiu the sent down girl\" http://www.imdb.com/title/tt0115005/ which is one of my favourite films terribly disturbing and sad. So I became curious. I loved this story. The main character Fusang was a perfect embodiment of everything Laozi suggested. She was weak, yielding, unintelligent and untouchable. The book took a stark look at the history of racism against Chinese immigrants in the 19th century and with the new 5th wave. The author spent part of the book carrying out a one sided dialogue with the main character that I found rather touching. (If a little confusing at first). The style reminded me a lot of the early 20th century Chinese writers who littered their prose with descriptions of physical unpleasantness. Even translated it came across beautifully. I shall have to add this to my list of books to read in Chinese when I'm able. (Hopefully in a year or so). In the meantime I've added her other books translated into English books to my amazon wishlist. I'm very glad to have discovered this author."}, {"userName": "Marie Hew", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/1366837-marie-hew", "userReview": "In the beginning of the book I couldn't believe I was reading a \"sensual' story about a 19th century Chinese woman who was sold into prostitution and lusted after by a 12 year-old white boy. I thought it was racist, patriarchal bullshit. I was aghast that Amy Tan sang the author's praises. Fortunately the story is much more interesting and complex than initial impressions. The best part is the structure of the novel. The narrator is a contemporary writer who researches and writes the story of a famed Chinese prostitute, Fusang. She interacts with the characters as if she were a character in the book. Unlike most characters, this narrator is almost omniscient and offers insight to the main character and modern critiques of the historical and social context of the time period. She jumps in and out of the story helping the reader better understand the storyline. I'm glad I didn't bail on this book following my initial disgust. I found this novel more gripping as I went along."}, {"userName": "Gana", "userReviewDate": "Oct 11, 2007", "userURL": "http://www.goodreads.com/user/show/518554-gana", "userReview": "It is offensive to be the particle of a nation, who was an object for discrimination for hundreds of years, unless you are really powerful. Ceiling Young is a powerful Chinese, who could analyze and judge her own nation from different perspectives with insider and outsider’s view points. Her writing style is very interesting, talking to the hero from different time; seems like she reflects her own feeling experienced while writing this novel. In general, I got the feeling that the author, through her novel, explodes her own feelings and thoughts about Chinese immigrants in US and the people, who discriminate them and main stories of the novel is just background to this."}, {"userName": "Jyotsna Sreenivasan", "userReviewDate": "Jul 25, 2016", "userURL": "http://www.goodreads.com/user/show/1760015-jyotsna-sreenivasan", "userReview": "I’m not sure how to describe this beautiful novel. On one level, it is a mysterious love story between a Chinese prostitute, Fusang, in San Francisco’s Chinatown in the 1860’s and 1870’s and a white boy of German heritage, Chris. On another level it is an exploration of a Chinese immigrant woman at the beginning of the 21st century attempting to research Fusang as a way of understanding the history of Chinese people in San Francisco, as well as the relationship between Chinese and white people. Please see my complete review at: http://herstorynovels.com/lost-daught..."}, {"userName": "Kelley", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/5754642-kelley", "userReview": "Strange but thoughtful book about a Chinese prostitute named Fusang (based on a true story) and her complex life as a woman in violent, chaotic Gold-Rush era San Francisco. Fusang is caught between her desire for a white teenager named Chris and a malevolent Chinese man who may or may not be her husband Da Yong. The thing that drove me CRAZY through the entire book was the question: WHY doesn’t she try to escape? I felt like Fusang almost seemed kind of lazy. Also, the narrator kept interrupting with her weird self-dialogue."}, {"userName": "Princess", "userReviewDate": "Feb 18, 2008", "userURL": "http://www.goodreads.com/user/show/918630-princess", "userReview": "This is an intense book about a Chinese prostitute named Fusang. She is kidnapped from her village in China then shipped off to San Francisco and sold to a brothel. There are two central male characters as well. Chris, a white boy who becomes obessesed with Fusang but is never able to overcome the racial divide, and Da Yong, a Chinese criminal who wants to own Fusang but then his overcome with his emotions after Fusang is gang raped by white men. This books explores racial tension in a context I hadn't seen before. Fusang is a strong and interesting woman."}, {"userName": "Emma", "userReviewDate": "Jan 04, 2009", "userURL": "http://www.goodreads.com/user/show/1351156-emma", "userReview": "Narrated in a haunting voice that mulls over painful truths of the past, this is an unflinching, erotic tale of forbidden love in turn-of-the-century San Francisco. Fusang is a Chinese girl who is shanghaied from her village and brought to San Francisco, where she enters a seedy underworld. This book revealed to me a part of American history, which I had been unaware of. This book truly brought to life the often-horrific experiences of 19th Century Chinese immigrants to America. I also found the love/ lust story between Fusang and a German-American captivating."}, {"userName": "Linda Maria ~", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/58044386-linda-maria", "userReview": "\"you make it seem like they are the mystery.\"The disturbance and somehow intriguing showing in this novel interested me from the beginning to the end. The way it was written was almost poetic to me. I've a hidden love for the mute but deafening storytelling that somehow Asian writers, as well as in books and films, possess and westerners just don't seem to grab it. Fusang herself made me admire her but also a frightening. the story made me breath and suffocate. simple and complex. written in a poetry pace. it's remarkable. I loved it."}, {"userName": "Graham Crawford", "userReviewDate": "Apr 16, 2014", "userURL": "http://www.goodreads.com/user/show/5884833-graham-crawford", "userReview": "Another strong work by this writer. This one is a little slippery, wandering in between genres. It's part historical fiction, part history, part essay. It succeeds in defying boundaries in much the same way the Chinese prostitute protagonist defies being known by the writer and the reader and her clients. In many ways this is a meditation on Orientalism - its erotic foundations, and the racism that is the underbelly of the exotic attraction."}, {"userName": "Shani Cxx", "userReviewDate": "Oct 28, 2013", "userURL": "http://www.goodreads.com/user/show/14734469-shani-cxx", "userReview": "Although I enjoyed this novel and found the setting and time period interesting, it was also a frustrating novel since the author intentionally keeps the reader distant from the main protagonists throughout so you don't feel as though you ever get beneath their skin. This gives it a mythic quality and by the end of the novel Fusang is still a mystery - a series of impressions rather than a real person."}, {"userName": "Ashley", "userReviewDate": "Jul 29, 2010", "userURL": "http://www.goodreads.com/user/show/1717563-ashley", "userReview": "A heavy handed waste of time. I was very disappointed after having high hopes for what could have been a great piece of historical fiction regarding an era that we don't really hear much about. Instead, it seemed as if the author was always reaching further than she was able, and provided a weak protagonist to drive the narrative. I would not recommend this, even for a quick read."}, {"userName": "The Book", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/8990718-the-book", "userReview": "Absolutely brilliant - from the style of narration, to the topics covered, this was an unputdownable novel. I was caught up in the stories of Fusang and Chris, enthralled by the depiction of San Francisco in the 1860s and wondered at the descriptions of racial tension on both sides. I thoroughly recommend reading this."}, {"userName": "Zane", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/8964401-zane", "userReview": "This book started at a low tension, but it kept getting better towards the end while sucking you into its trap that ends at the last page with you still wanting for more.There is a female and two male protagonists. What could be better?"}, {"userName": "Ellen", "userReviewDate": "Aug 01, 2010", "userURL": "http://www.goodreads.com/user/show/678815-ellen", "userReview": "San Francisco's Chinatown, mid 1800's, young Chinese prostitutes... don't waste your time. The story could have been a good one, but I didn't care for the author's style of cutting in to give a modern day first person account that related to the story."}, {"userName": "Christina", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/13987142-christina", "userReview": "Powerful book. I had a hard time getting into the story, but it did get easier to read, in one sense, as you get drawn into the story. It is very shocking to learn about the Chinese slave trade in San Francisco (gold rush era.) There is a lot of violence in this story, so beware."}, {"userName": "Debbie", "userReviewDate": "Mar 19, 2011", "userURL": "http://www.goodreads.com/user/show/3575124-debbie", "userReview": "It was so depressing it was awesome! Whenever I feel overwhelmed with my problems, I think about strong women in the past and see how much they have overcome, and I get strength from it. This is one of those books. Movie?"}], "description": "Los Angeles Times bestseller--now in paperback. A \"sensuous and disquieting new novel\" [New York Times] from one of China's most acclaimed novelists, the award-winning screenwriter of Joan Chen's film Xiu Xiu: The Sent-Down Girl. The Lost Daughter of Happiness is an epic and moving love story of individuals intoxicated with one another and yet repeatedly separated by prejudice and mistrust. The novel chronicles the lives of the main characters over decades against a backdrop of social turmoil--the anti-Chinese hysteria that plagued San Francisco.", "title": "The Lost Daughter of Happiness: A Novel", "url": "https://www.goodreads.com/book/show/996726.The_Lost_Daughter_of_Happiness", "average": 3.43, "cover": "https://images.gr-assets.com/books/1348707446l/996726.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/81969.Geling_Yan", "name": "Geling Yan"}], "type": ["Fiction", "Historical", "Cultural", "Asian Literature", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/996726.The_Lost_Daughter_of_Happiness", "http://www.goodreads.com/book/show/1101586.The_Lost_Daughter_Of_Happiness", "http://www.goodreads.com/book/show/142062.The_Lost_Daughter_Of_Happiness", "http://www.goodreads.com/book/show/14772069-the-lost-daughter-of-happiness", "http://www.goodreads.com/book/show/12710390-the-flowers-of-war", "http://www.goodreads.com/book/show/18661400", "http://www.goodreads.com/book/show/142059.The_Banquet_Bug", "http://www.goodreads.com/book/show/142060.White_Snake_and_Other_Stories", "http://www.goodreads.com/book/show/18070678-little-aunt-crane"]}