{"ratings": 3857, "userreviews": [{"userName": "Navessa", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "TRIGGER WARNING: THIS BOOK, AND THEREFORE THIS REVIEW, HAS NUMEROUS MENTIONS OF RAPEDNF @ 82%And I swear to Gann, if anyone shows their face in the comment section and tries to pull that \"You can't rate a book until you've read the whole thing\" malarkey with me, I will go absolutely apeshit. Because in reading 82% of this book, I've read 510% of any other book that's ever been published. Okay, fine, I'll allow that there are exceptions to that. Like the Hypnerotomachia Poliphili, of course, because ain't no one figured that thing out out yet. Sure, there are translations. For the known languages he used. But what about the ones he made up, huh? And you'll never get me to believe that the poliam frater franciscvs colvmna peramavit acrostic is the only code in that crazy ass book. Wait a second. I'm off topic, aren't I? Blame it on the wine.That I had to consume.To keep from turning my kindle into a hate-frisbee.Because of this book.What I meant to say is that this book is long. Really long. But that is not where my rage comes from. I'll get to that part of the review later. Surprisingly, up until about 72%, I really enjoyed this book. Could an editor have hacked about 250k words off of it? You betcha. But I was really happy that they didn't. Because I don't suffer from a short attention span. My most re-read book of all-time is the 1500 page behemoth unabridged version of The Count of Monte Cristo.Give me a rambling, well-written book filled with commas, colons, commas, semi-colons, and still moar commas, and I'm a happy reader. Especially when, like in this book, there is very little down time. Every page was infused with action or emotion. Every scene had me on the edge of my seat. Every character made me feel things. Okay, so most of them just made me feel murderous, but that's probably more of a personal issue I need to work through. Short synopsis: Amber Bierce has run out of luck and options. Her whiny little shit of a sister can't take care of herself, so Amber books them both passage on a spaceship bound for a new colony on an alien world. Something goes horribly wrong on the way there, and they spend 200 years asleep while the ship drifts until its navigation system finds a habitable world and crash-lands there. Welcome to Gann. Home of the dumacq. A lizard-like people not so different from humans. You see, they've already had their apocalypse. They bio-engineered it themselves. And guess what? \nIt's not over yet.\nWhat follows is one hell of a story. Complete with desperate, frantic, assholic human survivors, a lizard warrior/prophet/priest, a desperate flight through wastelands, some smexy times after they get snowed in for the winter…AND RAPE.Yup. From about the 72% mark this book gets suuuuuuuper rapey. Which I knew going into it, but I kept reading, because people assured me that it was handled well. It wasn't. This is my surprised face: -___-*WARNING: UNMARKED SPOILERS*So, Amber ends up \"married\" to this lizard warrior-priest, and they get down wit it. Every day. Sometimes multiple times. But then \"the fires of Sheul\" take him. Remember how I told you their bio-engineered apocalypse wasn't over yet? Yeah, this is what I meant. They rage-fucked their planet to death. Literally. And they still are, but have more control over it than they used to. Anywho, Sheul takes him and he takes Amber. Rough. Rougher than she wants. But she's able to talk him back from the abyss, so that's cool, right? Even though he hurts her? Even though she tries to get him to stop? Oh, you're telling me that is cool? Okay, then. Then Amber gets kidnapped by bad guys. And made into a sex-slave. Raped multiple times every goddamn day. Does Amber ever display the psychological symptoms of this abuse? Nope. Does she ever mention or even think about how much pain she's in from BEING RAPED MULTIPLE TIMES A DAY???Nope. Does she go on to kill her attacker? OH HELLFUCKYEAH. Just before her husband shows up to save her. But the fires of Sheul have him. And so instead instead of saving her, he pauses first to rape her. Violently. Nearly breaking her hip. Nearly killing her at several points. She fights, she thrashes, she screams, she begs, and he rapes her. Because the fires of Sheul have him. So it's not his fault. Because the fires of Sheul have him. Is what the book tells you over and over again. And Amber? Is she horrified? Traumatized? Hurt? Nope. Perfectly fine the very next day. Even though she was nearly raped to death. But don't tell her that, because within ten minutes after the rape, she refers to it as sex and doesn't have a problem with it. I shit you not. I'd include the quote, but in order to do that I'd have to open this book again, AND I FUCKING REFUSE TO DO THAT. I read the next 10% (roughly 50k fucking words) in utter disbelief, thinking that she was repressing. That she would at least MENTION IT TO HIM. Nope. Nothing. Instead, SHE apologizes to HIM for getting captured and raped. While sobbing. And begging for HIS forgiveness. Sooooo….If a strange man kidnaps and \"gently\" rapes you multiple times a day for a week straight: KILL HIM. If your husband nearly rage-rapes you to death: APOLOGIZE???Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Jill", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/3820197-jill", "userReview": "4.5 starsA spiritual, warrior, alien, lizard hero....who knew?Amber Bierce and her sister are aboard a spaceship heading to an earth-like world to colonise when their ship is hit by an asteroid and crashes on a nearby planet. There are only 48 survivors of the original 50 000. Meoraq, seeing the fires of the wreckage, believes it to be a sign from his god that he should embark on a pilgrimage to a temple in the east of Gann. When he comes across a group of 'aliens', deciding this also must be god's will, Meoraq acts as unwilling guide and protector to the humans.Wow.The only book I can compare this to is \nOutlander\n by Diana Gabaldon. Not that the hero, Meoraq reminds me of Jamie Fraser or the heroine, Amber reminds me of Claire exactly. Nor even the plot really. But the \nepic-ness of this story,\n the depth of the love story is very similar in scope to Outlander. Just imagine for a moment Jamie as an alien lizard warrior....person....and the Highlands of Scotland as the alien planet, Gann and instead of Sassenach the hero calls the heroine Soft-Skin....***Beware may be spoilers ahead***What worked (Big Time!)\nThe Hero and Heroine\nWith a smart mouth and coarse language, Amber is a wonderful, strong, independent heroine. She is a perfect, irreverent match and foil for the pious, proud Meoraq. Ahhhh, Meoraq, that beautiful bipedal lizard. And the star of this show. Lizardman as Amber affectionately calls him. What's particularly gratifying is the author has not written his appearance, especially his facial features, to make him more human, more physically appealing. We can't drool over his pouty, sensual lips....because he doesn't have any....or his thick mane of ink-black hair....he's a lizard, he's bald....or his fathomless black eyes....they're red (with gold flecks)....or his masculine, thrice-broken, slightly off-centre nose....he's got a snout, people!\nThe Romance\nThe relationship between Meoraq and Amber made this story. The romance builds slowly, realistically, inevitably. Their conversations and interactions are humorous, romantic, passionate, and strangely typically male-female. Meoraq initially sees Amber as ugly with her flat face, snub nose, rubbery mouth and tufts of hair. He never really sees her any differently at the end (though he did rhapsodise just a bit about her smooth pale shoulders), it was the inner person he comes to love.\nThe Love Scenes\nThe love scenes are surprisingly sensual and lovely. The details of the lizard anatomy are....interesting. And not the turnoff I'd expected.Though this is cateogorised as erotic/erotica the actual love scenes between the main characters are not. But some type of warning is necessary due to the graphic violence and particularly, sexual violence including rapes.\nThe Writing\nThere are some outstanding, brilliant scenes and passages of dialogue and narrative. So many. But don't want to spoil it for other readers. But here's a taste.He never mated this way before - lying down and belly-to-belly - but it felt new and exciting and perhaps just a bit deviant.\nThe World, The Plot, Etc\nThe world of Gann, the culture, society were complex, detailed, interesting. The plot was totally engaging, well thought-out with action and adventure aplenty. The strange animals the characters encounter are fantastically described.What didn't workThis story is so clever, so intricately-plotted and so different to the usual romances that it's a shame I should mention some things that simply didn't work for me.\nSlow Beginning\nUp till the 16% mark when the hero and heroine first meet, I found this story....boring. No other way to say it. Had it not been for its very high average rating, I would have DNF'ed. Glad I didn't.It's not a perfect read. But. Once I got to that 16% mark and the hero and heroine finally meet, the star rating began to climb, and I was hooked.\nMain Characters' Flaws\nAmber is completely wonderful, except for her constantly (and stupidly) forgiving her fellow humans even when they betray her.Meoraq's strident beliefs and strict adherence to his religion, though entirely in keeping with his culture and upbringing, did get on my very last nerve after a while. Meoraq rapes/has non-consensual sex (before he meets Amber). As a reader who loathes rape-by-hero the only reason I went with this is because it is an accepted ritual of the aliens' culture. And we find out later how and why this came about.\nSecondary Characterisations\n Where the main characters are portrayed almost flawlessly with fully-fleshed-out personalities, and an entirely believable alien-human relationship, it seems the author ran out of time/ideas/enthusiasm/words in portraying the secondary characters, particularly the humans. Most of the time, they appear as one-dimensional baddies. Amber's sister, Nicci is especially annoying with her whiny, lazy attitude. Though the humans had moments of lucidity, they were mostly just stupid and mean.There are forty-eight human survivors, and yet for a handful (eight to ten, maybe) we never know anything about the other 38 or so. There may as well have been only the smaller group for all we know of the others.\nLoooooong\nThis book took me three days to read. It's very long, and I can't help but feel if it had been trimmed a little, it would have added to the book's appeal.\nThe Ending\nThe ending though not exactly rushed could have been more. I'm hoping that this may be because there's a sequel in the works.\nWarning! Violence and Rape\nSome readers will understandably find this story unacceptable. There is some graphic violence, sexual violence, rapes. Horrific things happen. But still, The Last Hour of Gann is a compelling read and one of my favourites this year. Both Meoraq and Amber suffer violence and abuse.Final ThoughtsI'm rounding up to 5 stars. Despite some of its flaws and the issues I had, this is simply not a rehash of the usual run-of-the-mill romance reads. It's fresh and different. It's absolutely compelling (after the first 16%), clever, creative with a passionate, believable romance that left me satisfied (and yet hungering for more) and thinking about it after I'd finished. And that's just what a great story should do. For those who enjoy science fiction, alien worlds, fantasy, romance and an epic love story (peppered liberally with violence) this may be worth putting aside three or four days to read. Highly recommended. Steam: 3.5-4* Thanks for first bringing this to my notice, Searock!"}, {"userName": "Jill Myles", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/2368931-jill-myles", "userReview": "THIS BOOK. MY GOD. I have so many feels. SO MANY.First off, it's long. It's probably a trilogy in a single book. Don't let that deter you - it never slumps along the way.So anyhow, Amber Bierce is our heroine. She's fat, she's bossy, and she's got a pottymouth. Her sister Nicci is a user and her favorite person to use is Amber. All of these things combine into a heroine who makes trouble for herself, knows it, and can't seem to stop. But Amber's an awesome heroine. When shit hits the fan, Amber's the first one to take charge. When the colony ship crashes, Amber saves people. When they're starving, she tries to hunt. She ALWAYS tries, and I love that about Amber. She refuses to lay down and let life kick her ass, and life tries to, a LOT.Meoraq is the hero. He's a lizardman. I'll let that sink in for a moment. A MOTHER-EFFING LIZARDMAN. Don't care. It's still awesome and he's still great. By the time the middle of the book hit, I was like PLEASE HAVE SEX YOU TWO PLEASE PLEASE because I wanted their relationship so freaking much. The build and the sexual tension is amazeballs.Because this is RLee Smith, bad shit happens. Not gonna lie. There was a section that was pretty heartbreaking, and I thought everything was ruined at the 90% mark of the book...but Smith turns the ship around and by the last page, I was all YEESSSSSSS MY GOD YESSSSSS. It was perfection and no one got screwed over in the end, except for the ones that deserved it.So. Loved this. I've had a book hangover for a week because I read it and I can't find anything else like it. I even bought my mom a copy (YES I BOUGHT MY MOM A LIZARDMAN ROMANCE) so I will have someone to discuss it with.Please read this, because I want this author to be wildly successful and write more books. I'm selfish like that. :)"}, {"userName": "Mariana Zapata", "userReviewDate": "Jun 04, 2014", "userURL": "http://www.goodreads.com/user/show/7595879-mariana-zapata", "userReview": "I don't even know where to begin with this. I've written and rewritten this review in my head about a dozen times but the feels--THE FEELS. I don't know what to do with myself, and I wish I could give more of an unemotional review but I can't. So, let me fangirl. This book is one of the best things I've ever read, flat out. If I could hug it or RLS, I'd do it. Over and over and over again, and I don't care how creepy that sounds. And it'll sound even creepier when I say that Meoraq has become one of my favorite male characters ever. Yes, he's a Lizardman. No, I don't care. I want one with his rough mouth and slapping tendencies. He's complicated, a bit of an ass, arrogant, and slightly violent. So of course I love him. Duh. Then there's Amber. I was a little nervous about her but from the get-go, I really liked her character. She's not a doormat, a little bit of a bitch, and she's a survivor. So of course I love her.Put them together, a friendship that takes its time, an excellent plot, twists and turns, and you'll get one of the best romances ever. I do have two \"warnings\": there are parts that are really dark and a little painful to get through. There's rape and it is explicit but... I managed. It also delves pretty deeply into religion. For the record, I'm not a religious person. Yes, it's sort of a made-up religion but all the aspects are pretty familiar. But it's fine. Trust me. Give it a chance. The thing that really stands out about TLHoG is that it has \"effort\" written all over it. Thought. Emotion. You can tell how much time went into every aspect of the novel. It all makes sense, it all ties in together, it all fits. There was also none of that \"instant love\" crap that I can't stand. Love for me is made up in the details, and none of that is skipped.I don't want to give anything away and this review isn't going to justify the absolute epic-ness that is TLHoG, but the point is--it's amazing and I don't use the word lightly. It's not for everyone and I can see a lot of people giving up along the way because it's long and takes it times but that's what I loved about it. It isn't rushed and RLS does what RLS wants to do and that's something I can totally 1,000% respect. I don't know if RLS is a lady or a man and I doubt he/she will ever read this but if you do, you have my undying love for having the balls to write this and hitting the ball out of the park. This is the kind of thing I wish I could write and wish everyone in the world would give it a chance.And on an entirely different note... Nicci and S'kot (ha). Dear god. I wanted to murder their asses, slowly, Dexter style. Bring them back to life and do it all over again. The rages I felt... akdfjlaksdf. Okay, I needed to vent that at some point. Anyway, be brave and read this. Sci-fi and maybe it wasn't meant to be a romance but that's what this hopeless romantic took it as. It's the best $6.50 I've ever spent."}, {"userName": "Felicia", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/666892-felicia", "userReview": "UGGGGGGH. I dunno if I can recommend this book. It's really well-written in a lot of ways, and is the only fiction outside of Skyrim where I'd think a lizard guy was hot, but man, there are things that triggered revulsion in me with the abuse of women in the sex scenes. I actually couldn't read whole chapters of this book. The slavery and abuse of women was just something I couldn't stomach. Over and over again through the story (which is VERY LONG, like 800 pages!)The world-building is masterful. The alien race interaction was just amazing. I see why it's an underground hit, and would be interested to read other books by the author. My tolerance point was just way overboard with the rape and abuse. But I just need to warn everyone that this is FULL OF TRIGGER WARNINGS OF EVERY POSSIBLE KIND. There's a huge thread on my romance book club group, Vaginal Fantasy, forum if you want to discuss it! Lots of great comments there."}, {"userName": "Sophia Triad", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/44642860-sophia-triad", "userReview": "“If you cannot have an easy journey, make an interesting story”This book is epic. An ODYSSEY that should not be taken lighthearted.I understand that the book may scare people off because of its length, but I believe it is important to treat it as 8 separate books as opposed to one book. The book has clearly eight distinct parts in which different events take place and you have a different degree of knowledge about the characters and their world. The emotions change. The number of characters and the familiarity between them vary. The landscaping changes too. Each part could be treated as a different book with a cliffhanger in the end. Something happens always in the end that gives a head start to the next part.Thus I would like to break down my thoughts towards this book in eight parts as well:BOOK 1 - AMBER:The start of the book is absolutely awesome. Earth has changed and not in a good way. Drugs and corruption are present. But still the human race is exploring the outer space and starting colonies in other planets. From the beginning it is clear that Amber is a survivor. Amber tries to avoid her dead mother fate and become a whore in order to survive and not die of hunger and without shelter. Amber and her sister decide to take part to the mission to colonize a distant planet called Plymouth. Her little sister is basically dragged to this adventure by Amber. I need to mention here that Amber is a big girl and her weight is a problem. She even takes drugs to reduce her weight and become fit for the mission. She is that determine to escape Earth.Pioneers’ ship will eventually depart from Earth and crash on an unknown planet. The description of the crash and burn was one of the best I have read in Science Fiction. As a result only a few people survive. Where are they? Who lives in this planet? Houston, we've had a problem here …BOOK 2 - MEORAQ:The action with the humans stops there and we meet Meoraq who is like the top dog (or should I say top lizard of this planet). Uyane Meoraq: A holly man, a warrior, a philosopher, a ruler, a leader, a judge. A sheulek. We see the world through his eyes. This is a new savage world. Cold and inhospitable. They solve their differences in the Arena. Females are the lowest of the low. Every father is proud if Meoraq takes the virginity of his worthless otherwise daughter.There is no description of the creatures/anthropoids, but you may notice that they are talking about their snoots instead of their noses. And about their scales. Thank God no talking about tails.And all I can think is “huh”? What?And I got even more worried for the poor ex inhabitants of the planet Earth. I was scared of the moment whey will be discovered – especially women (bahaha...evil laughter). Meoraq has seen the fires of the huge explosion and soon he will start his long journey to discover what God has sent him (Have I mentioned that he is an extremely religious male?)All these happen in like the first 100 something pages of the 1000 pages.BOOK 3 – LOST AND FOUND:Meoraq discovers the most plainly ugly beings he has ever seen in his life. So the miscommunication starts. He thinks they are not intelligent beings. They think he is some kind of a stupid animal. Only Amber tries to communicate, although Meoraq is not responding. Believe me she tries really hard in a “Me Jane, You Tarzan” short of way.He will stay with them. He will not kill them and they will start a journey together to the end of the world to Xi’Matezh because God told him to do it (Have I mentioned that he is an extremely religious male?). The survivors will be his pets. He will feed them, find them water and shelter. Like sheep and he is the shepherd.This is the part where you really start hating the rest of the survivors and mainly because all of them hate Amber (including her sister). The worst of them is Scott who named himself commander and all of them follow him. The humans treat her badly, they starve her to death, they tell fat jokes to her. And you will like Amber. For sure! She is clever and tough, she is a problem solver, she is not nagging, she is a natural leader but she doesn’t want to lead. Amber will try so hard to understand Meoraq, although he is the ugliest creature she has ever seen.There is this super, incredible, magnificent scene where Meoraq defends Amber and suddenly they all know that Meoraq can speak and understand English and that Amber is HIS.Oh and when Meoraq and Amber actually FINALLY start talking and exchange insults, points of view, experiences, emotions, they are just pure joy.Meoraq: “God see us both and we can both show Him improvement.” Amber: “I’m still an atheist!”BOOK 4 – PIONEERS:This is the book where Meoraq prays a lot and takes six breathes (the magic number) constantly trying to calm down. Humans drive him crazy, but he is not supposed to kill them.This is the book also that we discovered that the ancients of this planet were really advanced in technology until God contemned them and they abandoned their advanced cities and returned to the simple ways. Thus, Meoraq despises anything of technological value.The relationship between Meoraq and Amber is getting also more serious. Meoraq starts having naughty dreams. But they are tiptoeing around each other.Amber:”Will you miss us, when we are gone?”, “Aren’t you going to ask if I’m going to miss you?” Meoraq : “I don’t know what to do with you”, “I don’t think I can teach you. You upset me.”BOOK 5 – SCOTT AND THE SHIP:Scott is the man who named himself commander and all gave him the responsibility because simply they didn’t want it. This is the book in which Scott believes that he will find a spaceship at the end of the world and fly away.This is also the book where the humans have a look in an ancient city, Meoraq keeps praying for patience (Have I mentioned that he is an extremely religious male?), a huge storm almost kills them. And Amber almost dies twice.Meoraq looks for reasons to sit with her, to speak with her, to fight with her.The end of the book will find Amber and Meoraq alone, abandon by the rest of the humans. This is truly the best thing that could happen to Amber and Meoraq (and me).BOOK 6 – GANN:This is the book where Meoraq and Amber will really fall in love with each other. Soul deep. A communication of souls. Not because of body attraction. Not because she has sunny blond hear or because he has nice abs, but truly because they admire each other. An “I don’t understand your culture and the things I understand I hate them and I think you are butt ugly but I still want you beside me” type of love and connection. They will have the type of love that they could not understand, the one they don’t know where it is going. They don’t even know if they are sexually comparable, but they still have embarrassing dreams about each other. The tension is building up for them.He calls her softskin, she calls him lizardman.And then Meoraq prays and he has a vision (Have I mentioned that he is an extremely religious male?). And they FINALLY have sex. My favorite book :)BOOK 7 – ZHUQA:This is the book where Meoraq loses Amber and prays, Amber discovers more lizardmen and she becomes a slave and she makes friends, Meoraq turns berserker and Amber kills.This is a very hard book to read. It has many rape scenes described in graphic details and lots of violence. Blood and killings. Your heart may bleed, but as Meoraq keeps saying “Shit happens”.It is also time for Amber to reunite with whoever is left from the humans’ team. Meoraq is not happy (and neither am I). I really cannot understand why from the whole ship only these awful people survive. BOOK 8 – Xi’MATEZH:This is the book where Meoraq gets exceedingly disappointed with his God – although he is a very religious male (Have I mentioned that?).Favorite quotes from Book 8:a) Amber: “Why did you marry me?”Meoraq: “God gave you to me”Amber: “Did you keep the receipt?”b) Amber: “He doesn’t love me like He loves you, Meoraq”Meoraq: “If He loves me, He will never let you die.”c) Meoraq: “I love your ugly face.”, “I love your ugly fur”, “I love your ugly teats”, “And I love your beautiful shoulders.”d) Meoraq: “You saved my life”Amber: “Feels awful, doesn’t it?” (and this is my absolutely favorite dialogue!)Okay, you need to invest lots of time in this book, but It’s worth it. Totally.So my advice is that you need to take your time, have long breaks, and even read other books in your breaks. And then go back and start from where you left it. I can assure you that you will not have forgotten any details. Gann will be there waiting for you to be brave enough and continue reading about Amber’s adventure in the lizards’ land and the eventually green sky.(I am sorry for the length of this review…)"}, {"userName": "Pam Godwin", "userReviewDate": "Sep 27, 2013", "userURL": "http://www.goodreads.com/user/show/10980625-pam-godwin", "userReview": "This is a saga, the length of five books in one, and when I turned the last page--kindle location 23044!--I cried tears of wonderment. Never have I read a story this engrossing, this thought-provoking, this emotionally potent.It conveys a similar theme to Lord of the Flies, with its marooned, violent characters, and its study of the ugly side of human nature versus the omniscient force of goodness. The symbolism is unmissable, but the events that unravel are as real as speculative fiction can get. There's no doubt human depravity sinks this low in ungoverned, distressing situations. But this tale also portrays the hero who rises from the rot of humanity, and the courage she (and he) must suffer to endure the journey. And it's a beautiful and terrible hero's journey.It'll take you about 40 hours to read. 40 hours with a dry throat, a sputtering pulse, and twisting and tumbling stomach. But the joyous moments--oh the unselfish love between the heroine and her scaly son of a bitch lizard warrior--are the balm for a beaten-down heart. If this isn't the best book I've ever read, by God and Gann, this is the greatest H/h in literary romance.She stared at him for a moment and then flung out her arms, shouting, “There is no baby, lizardman! There’s never going to be a baby! There’s no baby and no God and the only reason we have sex—you might want to write this down—is because it feels good and we like it! You can call it God or Gann or the Great Gadzooks if you want to, but it’s just two people fucking!”Amber is a positively fierce heroine, and sarcastic and stubborn to a fault. She's captured by a brutal lizard rebel and stands nose-to-snout with him, unwavering in her trash-talk, insulting him in a language he doesn't understand.“You are such a slut,” said Amber, pushing her finger in to stroke his sa’ad. “Honest to God, that’s what you are. Big, tough Zhuqa. You’re just a dirty girl.”The sex scenes are graphic and appropriately short, some painful, some heartfelt, but all serving a purpose to the plot.RLS has a magical way of blending classic storytelling with modern sci-fi. The result is enchanting, romantic, and unparalleled. The author peels back the skin and scales, exposing not just the heart and mind, but the very fiber that connects the soul and constitutes the character. The dialogue is witty and imaginative, the humor allows you brief and blissful exhales, and the complexity of the expert writing is the touchstone by which the craft should be measured.Do you want a story created for greatness, one that will transport you without the benefit of gimmicks and gratuitous sex? Do you want to take a journey that will thrive on being tasted and shared from beginning to end? You don't need to pray on this. Meoraq's fires are burning. Any opportunity to read this book is surely proof that Sheul has will in this matter. Stand in His favor and experience Meoraq's fires for yourself. :)"}, {"userName": "Mandi Schreiner", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/2704703-mandi-schreiner", "userReview": "A week or two ago Jane from Dear Author wrote on Facebook how much she enjoyed this book. I’ve been wanting to try this author since I heard about Heat last year. So I wandered over to Goodreads to see what other readers had to say, and I saw this review by Jill Myles so I knew I had to read it.This is most likely my favorite book of the year, which means I gently place Captive Prince Vol 1 & 2 in second place (and Heart of Obsidian in third place – my top three books make me so freaking happy.) If someone had told me at the beginning of the year that my two favorite books would be these extremely dark, intense, epic world books, I probably would have laughed and snuggled up with a motorcycle club book. How interesting things have turned out.There is so much to say about The Last Hour of Gann, I feel like if I start trying to summarize I’ll just ramble on forever. So I’m going to make my points in a list format, to stay somewhat organized. And before I go on let me say – this book is extremely long. I think the longest book I’ve ever read. Just FYI.Our Heroine: “So suck it up,” she told herself. “Amber Bierce, fearless Space Adventurer, can live with loose underwear.”Amber is a human who lives on Earth, a future Earth that is very over populated, government controlled etc. She decides her only hope for a decent future is to jump on a space ship with 50,000 other people (and her younger sister), go into a medically induced sleep for three years and wake up on a new planet and colonize it. Except their ship gets off course, and they crash land onto a new, unknown planet. Oopsie. She doesn’t believe in God – I tell you this for what you read next.Our Hero: “This day will end,” he said softly. “You and I will go on.”Meoraq lives on the planet that Amber crashes into. The people that inhabit this planet are lizard-like creatures. They walk on two legs, wear clothes, live in houses, speak their own language – yet have scales, spiney-thngs and three fingers. God and religion is everything to Meoraq. He believes every single thing that happens is fate/destiny. He lives in a world where “The Ancients” built machines, and then something really bad happened, killing many, many people. So now they have gone back to no modern items, a very religious, strict culture. Meoraq comes from a line of pure blood warriors, so he is the chosen one of his people – is a Sheulek – which means he acts as God’s hand for his people. He can also walk into any village and take anything he wants (including women) and people bow down to him. He also is the ultimate judge and has killed many whom God tells him are guilty.There is rape in this story. In Meoraq’s culture, women don’t get much of a say as to who (or when) their sexual partners will be. The men in his culture have non-consensual sex. Meoraq has non-consensual sex. The first time he is introduced, we see a scene with him doing this. He never rapes Amber, BUT Amber does get raped more than once by other ‘bad guys.’ And those scenes are in this book and are quite descriptive. I felt the author took care with these scenes and the way they play out and the aftermath were very relevant to the story. They were not in there just for shock value. I also feel that as Meoraq comes to know Amber and eventually comes to care and love her, his views on women might have changed…maybe more so in the future. Amber is an extremely strong heroine – I mean really strong and I loved her. The other women in the book are not so strong. They are very submissive and weak. That didn’t bother me as I read – but I’m putting it out there in case that is a turnoff for you. At the end of the book, Meoraq doesn’t have some miraculous turn-around where he wants all women to rise to power. I think he’d still take a houseful of female slaves any day. But – something quite impactful happens to Meoraq at the end, and I think after he has time to really let his new knowledge settle he may be open to having different thoughts about women. That is something that the reader has to decide on his/her own.The World: I loved the world in this book. This is a world that is ravaged by storms and always cloudy. Amber and the few other survivors must tromp through water day after day. The cities are now ruins and at some points in the story, they enter these cities trying to find shelter or maybe some kind transmission tower. What you find in these cities are creepy and very dark and intense. I really like that the author at times takes us out of the soggy fields and puts the characters into these desolate places. There are also clues and foreshadowing as to what is to come at the end. When Amber’s ship crashed, it caused a huge fire. Meoraq, quite a distance away, sees this fire and it is kind of pointing upwards – of course Meoraq takes this as a sign from God. There is a holy temple of sorts on a mountain somewhat near the crash site that Meoraq now feels like it is his mission in life to pilgrimage to this temple, open the doors and hear the voice of God.Meoraq had trained a lifetime to hear Sheul’s voice and feel His touch. Now he saw His waving arm. It would be a foolish thing to pretend he did not know what it meant.Or what he had to do.It’s during his travel to this place where he stumbles across Amber and the other survivors. The entire story leads up to Meoraq and Amber getting to this temple. I found it very exciting and suspenseful knowing that eventually at the end of this book, we would get to the temple and something big would happen. I wasn’t disappointed.The Romance: I adored the romance in this book. I fell in love with Meoraq and all his scales and spines damn it! He is so fierce, and arrogant, and sexy. He is witty. They learn each other’s language but there are still slang words and phrases he doesn’t understand which would make me laugh. Meoraq is suppose to be in control of his emotions at all times but he often lashes out with his temper and then immediately starts to pray – which made me laugh. Meoraq and Amber butt heads in this book so damn much. Amber can’t stand the fact that Meoraq thinks everything happens because of God – that plays a big role in this book – but their banter is just so well done. Meoraq being this revered lizardman of God, never gets touched without his explicit consent – except Amber has no idea this is the case.And she took his arm.Reached right up and took it.Meoraq held very still as she used him to climb to her feet, unsure where he should be looking. He was excruciatingly aware of everything around him: the wind whispering through the grass, the piercing warble of laughing humans, the smell of wet leaves and earth, Nicci’s silent staring eyes, and above everything, the warm press of all five thing fingers that gripped him.No woman in all his life had ever…ever touched him like that.And there is sex. Eventually. At first they have to work through their surprising attraction to each other.Meoraq reached out and caught at her leg before she could flee. He rubbed his brow-ridges,cursing himself and all the words he could not make, because there was no way to tell her that it wasn’t sex, it wasn’t either that fierce eruptive will of Sheul or the shameful temptation of Gann, but this…this nameless thing that was neither fire nor clay but as constant as the wind, sometimes a storm and sometimes only a breeze, was always with him.No, it was not sex, but it had to be something that made him look for reasons to sit with her, to speak with her, even to fight with her if that was all there was, because even the most tedious and foul chore of curing a damned animal hide could become something to look forward to if he was with her. And it wasn’t sex, but he wished it was; it wasn’t sex, but if it had been, even that could be good, could even be glorious, just because it was with her.Yes – the lizard peen comes out of this slit and him and Amber do the dirty dirty a lot. Meoraq is one horny dude. But let me say – by the time they actually have sex, you want it to happen. You know them both well enough that it makes sense. (for reals!)I know some of you are like – seriously? You want me to read this book? Some of you will love it. Some of you will hate it. I hope I warned you of the dark and intense stuff enough.I became completely invested in these characters. This author has such an incredible voice. The way she writes the dialogue, the romance, the world, the action scenes – it all worked for me. It’s so different and so well done."}, {"userName": "Steelwhisper", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/7962895-steelwhisper", "userReview": "I need a day or so to digest this before I review. I can say this much: BRILLIANT!========Let me unequivocally state that Meoraq is one of my most favourite male romance heroes EVER!Okay, I needed much longer than a day or so. I re-read this the past week and am still very much impressed by this book. Truth be told: I'm a bright grinch-green in envy.Few authors managed to include religion in such an organic manner, few managed to then subvert religion in such a brilliant way, either. This is a truly epic tale, though I agree with others who stated they wanted to have a bit more of a HEA at the end. But I've come to realise this is sort of Smith's signature.A lot of readers are exasperated with Amber and how much she allows everyone to trample on and bully her. However, what few seem to notice is just how brilliant a study of (majorly female) anglo-saxon pack mentality this is. Even the (human) men come over as not male in their bullying nature (the only true male in the group being Meoraq), but instead are casebook studies of females socialised in the USA and to a lesser degree the UK as well.I'm often side-eyed when I state that I have few--very very few--female friends and in general prefer the company of men. It's the way girls are early on taught how to hen-peck and take down their peers, how the whole gaggle descends on anyone they consider infringing on some arbitrary (and often completely idiotic) social rule, how so few women reflect on what they do to other women. It's a cultural and above all a FEMALE behaviour. It's trained, actually flogged into girls over the course of their childhood and youth by their very peers. It's not happening like that among men by the way. And any woman who lacks that training, or who behaves in a male manner in these respects, will be destroyed, ostracised, and--something which this story puts on the table--by that killed. Smith very brilliantly makes the whole story a clinical study of this. She nails it.As someone in the trans* spectrum, who has experienced both male and female behaviour towards either a male or female self, I can vouch for this. It always astonishes me when someone tells me that too few women are written as excellent friends and good company for their fellow sisters. Unfortunately my personal experience is the exact opposite. Too few women are written as the bitchy bullies and opportunistic back-stabbers they are in real life. I've not been in a single work/occupation/hobby-related environment numberwise dominated by female members which wasn't deeply and thoroughly toxic. Not a single one. That includes online and offline groups. Yes, there are exceptions, just as Amber Bierce is an exception, but they are rare. And the exceptions are usually those who get pecked upon and bitten down to a bloody pulp. Which is what I took away from this book, apart from that it was a bloody good story, namely that Smith wrote a perfect portrait of this behaviour, to the point of emasculating all her male human characters and turning them into toxic females as well. I sympathised more even with rapist Zhuqa than with any of the other humans."}, {"userName": "Kathleen", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/13954899-kathleen", "userReview": "[ Even babysitters know not to lead the kiddies back into a burning building, but an experienced officer, Lietentant Jonah Somebody, did exactly that, even though the flames were visible. And even worse, they all went! All except for about 50. Absurd. A plot convenience. Better to just make the ship blow up as they ALL were escaping to the hills, clutching randomly grabbed gear, killing all but 50 en route -- all but those at the front of the line.In such a moralistic, rigid, caste-based society there is just no way an obvious cross-species mating -- much less marriage and pregnancy -- would go over without huge repercussions. This aspect was glossed over.Why did educated people follow Stupid Psycho Scott so blindly, even into the snow and the tunnel? Lugging cement and broken crap for miles and miles at Scott's command? Keep in mind, Eric is a construction engineer (who should have told Jonah to stay out of the burning ship), Crandall is an electronics expert (who could have told Scott the broken solar panels could not be fixed) and Yuo has a doctorate in evolutionary biology. Maria is an attorney. Not a likely cast of characters for Lord of the Flies, but that's just what ensued, including schoolyard mockery about Amber's weight.Here, on this hopelessly distant planet, the \"men\" may look like walking lizards, but they still carry on  just like humans: they worship, they drink, they cuss – F bombs included – plant crops, build cities, and carry out justice. Oh, and they screw. Or \"dip\" rather. Babylon 5.Lieutenant Jonah Somebody said the ship was at least 500 light years from Earth — an impossible distance to even consider sending a radio transmission, when we keep in mind that one light year is equal to almost six trillion miles. So, 500 x 6 trillion miles is .... To hell and gone. Even traveling at light-speed, a radio transmission would not reach Earth for 500 years. They would know this. At least, Crandall should.Not a biggie, but why did the sun suddenly appear for the first time in a millennium? No reason given. The global cloud-cover would not suddenly clear. It would be a gradual thing, but far as I can tell, the sun had never so much as peaked through the clouds before. Now, suddenly, nothing but sunshine and green skies...(But sunshine did add imagery to illustrate the happy ending, and it lent weight to Moeraq's new message of grace and mercy, gotta say. Also, Moeraq did tell Amber -- somewhere in the middle of the book -- that scholars had predicted the end of God's Wrath was coming, the conclusion of the Age of Gann was approaching, because the storms were diminishing). (hide spoiler)]"}, {"userName": "Amy Harmon", "userReviewDate": "May 07, 2014", "userURL": "http://www.goodreads.com/user/show/9005639-amy-harmon", "userReview": "First off, let me warn those who read my books and who are my reader friends. This book is graphic, violent, offensive, painful and dark. It is also a thousand pages long - and it absorbed me for days.Second. I don't think many authors could write this book. I don't think I could. It was deep, thought provoking, involved, and brilliant. And I think it took a lot of courage to write it.Third. I loved it. I loved that it made make me think. I loved it because I was constantly forced to evaluate my opinions, feelings, and ideas about God. It challenged and reinforced my beliefs and about what faith in Him means to me on a very elementary level. There was a line toward the very end that had me weeping like a baby because I recognized the truth in it. The line was something like this: When God talks he talks quietly. I persevered through the first 20% of this book because a friend of mine told me it would take that long to get into it, and it did. But it was worth the effort. I loved Amber Bierce and Meorac. I will miss them now that the book is done. And I will value the lessons I learned, which to me is the mark of a great read."}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Apr 16, 2015", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "[ The middle section where the humans have left and it's just Amber and Meoraq surviving the winter and they realize they love each other. That section should have been shorter. When Amber gets kidnapped by the raiders, that was great. Good drama. However, after that, when Meoraq takes the slaves and all the stuff with baby and the other men and going to that other village... That should have been cut out. In my view, it ruined the pacing and that is where I began to lose interest. THEN, when they find the humans, Scott and Nicci and Eric and Crandall, they go RIGHT back to acting exactly the same way and it's like the same scenes from the beginning practically. They were in CAGES, had been raped and weren't fed much, yet they were still greedy and unappreciative and acted exactly the same. I found that very unbelievable. It seems to just be in there to create unnecessary drama. That part should have been edited better. By the time the last major drama occurred and the remaining raider Izzi - or whatever his name was - found them, I was just like, whatever.  (hide spoiler)]"}, {"userName": "Deborah", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/24383684-deborah", "userReview": "4.5* Addictive and Unforgettable I'd skipped past this book several times since neither the title nor the cover appealed to me at all, I didn't even stop to read the blurb. But then a friend of mine said she'd just read it and loved it and thought I would too so I downloaded the sample (which was longer than some books I've read) and I was hooked.I didn't read any reviews at all which is unusual for me but by this point I was so engrossed in the book I just couldn't pull myself away.It's safe to say this book is addictive even when I didn't actually like what I was reading I couldn't put it down resulting in very little sleep for two days.Before I get further into my review I have to say that I had one huge issue, I've come across this before and it drives me crazy. The characters spend a considerable amount of time in their heads (which is fine) but their thoughts are written in quotation marks. Why?There's also a lot of conversation so this is confusing as hell and really slowed down and spoilt my reading. What's wrong with using italics for thoughts and quotation marks for actual speech?Right I'm getting down off my soapbox now.For me this was an addictive and unforgettable read, following the death of their mother Amber and Nikki Bierce have little to no prospects on earth so Amber makes the decision that has to be made and signs them up for Earth's first colony-ship, a five year contract.On the ship in her sleeper pod Amber sleeps through the asteroid field that pierced the hull and pulled the active crew out into space through approximately seven thousand coin-sized holes. She slept through two hundred sixty-six years of Tunneling as the speakers above her bed blatted a polite, unheard alarm. She slept through the crash. Then she wakes to her sleeper on it's side to discover so many dead and no idea where they are.They have to make the best of a bad situation and luckily Amber is capable and determined. Now in any situation like this you're always going to get a mix of characters some good, some bad and some just downright annoying and this book wouldn't have worked otherwise but it annoyed me so much at times. Scott was Scott, Nikki was unbelievably annoying, irritating and pathetic and Amber, what can I say about Amber?At times I thought she was amazing yet she annoyed me no end, while most of time I understood her and her motives the self sacrificing martyr thing got to me after a while but still I couldn't stop reading.Uyane Meoraq is a Sword of Sheul, God’s own instrument of judgment, victor of hundreds of trials, with a conqueror’s rights over all men and he's amazing, I just loved him.Amber and Meoraq's relationship is not love at first sight, to him she's ugly, pale and fleshy with hair sprouting out all over and to her he looks like a lizardman but they overcome everything and learn to see, really see each other.This is not an easy read (and not just the quotation marks) it's dark at times, it shows the worst of humanity there's rape and violence and a whole load of praying and certain parts I didn't like but it's long unforgettable read, a story you can get lost in for a couple of days and how often does that happen?"}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Feb 26, 2016", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "1. Lemme just say that when I created my aliens-i-love-em shelf, this is NOT what I meant. *giggle snorts*2. Who the hell cares that I have a MULTITUDE of other books I'm supposed to be reading? I'm gonna read the 1000+ page book about ALIEN LOVE, b/c I DO WHAT I WANT. If I hate it, it will make for an excellent rant. I MADE YOU CUPCAKES."}, {"userName": "Katie Michaels", "userReviewDate": "Oct 21, 2013", "userURL": "http://www.goodreads.com/user/show/4669344-katie-michaels", "userReview": "Epic Science Fiction. It’s not a genre I have heard of before, but it seems to fit here. This book is sweeping. It has depth. Breadth. It’s dark at times, but there is also hope. There is love. And there is, ultimately, an examination of what it means to be human and what truly constitutes a monster. Epic.The story follows Amber, a woman down on her luck, who in a last ditch effort to make a future for herself and her sister, secures passage for them both on a space expedition to colonize a new planet. She is abrasive and overweight; people don’t like her. But she is pragmatic and fiercely loyal. Her already bad life gets unbelievably worse when her ship goes way, way off course, and crash lands on a mysterious planet after the passengers took a 200+ year nap. The ship and most of the people on board go boom, leaving Amber, her sister, and about 50 other humans stranded in an alien world.Our unlikely hero is Meoraq, a native to the planet who looks like a giant lizard. He is a warrior among his people and a deeply religious man. When he stumbles onto Amber and her people, he sees it as a sign from God that he is supposed bring them on his pilgrimage to the Holy Land. And over the course of the story, a meaningful connection grows between him and Amber. They must face serious external threats and work through their own internal ones to find their place in each other’s lives and in the world they share.There is a reason so many people speak highly of this book. The world-building is really amazing. The author really creates two cultures: the futuristic, awful human world where Amber comes from– and the vastly complicated culture of Meoraq’s people. Both were drawn so clearly, they felt real. Page after page, more of it is uncovered, drawing us further in, layer upon layer. Even more powerful, though, are the characters.Amber is not an easy woman. Between her big mouth and her bluntness, though, she was so relatable to me. I felt like I could be in her shoes, digging the same ditch she dug for herself among her shipmates. That made it all the more disturbing as her fellow humans mistreated her, and as she faced horror after horror. Then there’s Meoraq. He is honorable in the way of his people, but very different than a traditional hero. While he did and said things that would be unthinkable coming from a human man, for him, they fit. He was… awesome. And the development of his relationship with Amber was just so compelling. I loved that it took time; that we got to see them really learn each other before they became friends. That we got to witness their internal struggle as they began to feel more. That lizard sex could be hot. Who knew?But part of what really makes the relationship so powerful, is its contrast to the interpersonal behavior among the rest of the characters. Scott, the human “leader” was such an untenable bastard. Nicci, Amber’s sister, was so spoiled and weak. But lest you think that humans are the only monsters here, we get to see that evil is universal with the introduction of some really horrific lizard-people. Corruption and misuse of power are clearly universal failings.There are some tough things in here, I won’t lie. There is rape. More than one. The hero doesn’t rape the heroine, but THERE IS RAPE, so be warned. It was difficult to read, but being prepared for it by other readers helped. It also helped the way the way the victim is portrayed. She doesn’t despair. She keeps moving forward… through one awful thing after another. But there is a balance of darkness with hope, in the growing love between Amber and Meoraq.It wasn’t a perfect book. There were some slow going parts, especially before Meoraq and Amber cross paths. Plus, I would have liked to see more shades of gray among the peripheral characters. For instance… did every single human HAVE to be one of the sheep? Couldn’t anyone be redeemed? Or on the lizard side, couldn’t anyone see the disparities in their culture? Did no one see the problems with the misogyny or slavery? (Hint: No.) But this all did highlight what made Meoraq and Amber so special… so different from those around them.Anyway, the whole book is a journey — both literally and metaphorically. The pinnacle of that is such an awesome surprise… and it turns Meoraq’s whole word upside down. It was so worth it. All of it.The book is long –and it may be too dark for some readers– but in the end, I thought it was very, very good.Rating: A-"}, {"userName": "Duchess Nicole", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/2204947-duchess-nicole", "userReview": "I can't possibly write a review to do this book justice. I put it off too long anyways and my Nook went on the fritz, deleting all of my saved quotes and highlights and notes. Grrr. If you want a thorough, comprehensive review, I'd suggest Jill's review here: https://www.goodreads.com/review/show...What I CAN say is that this book goes right to my all time favorites shelf and that it is one of the most unique and original books I've ever come across. It's a 1000+ page whopper of a book but worth every single second of time spent reading. It's an epic-size tale of spirituality, understanding, love, and acceptance. It's absolutely BRUTAL. I mean graphic violence, unconscionable rape, ruthless behavior on the part of the warriors on this lizard alien planet. It's not for the faint of heart, to say the least. It's a lizard-human romance and yes, there is lizard-human sex. I don't think it's meant to be titillating and sexy, however. For me, the sexual parts were more of an ultimate bonding experience between the hero and heroine. For those who are interested, the first 100 pages or so are all setup for what's to come...the background of the heroine and her journey to a new planet. It's when she meets Meorak that the intensity really picks up and the direction for the journey is set. Absolutely blew my mind. Read it, read it!!"}, {"userName": "Kinga", "userReviewDate": "Dec 21, 2013", "userURL": "http://www.goodreads.com/user/show/110812-kinga", "userReview": "I read this because Jill made me. Every now and then we force each other to read books we probably would not have read otherwise. I’m not going to lie - many times during reading this book I was asking myself: what is this? Why am I reading it?And yet, it’s clear to me there is a five star book hidden in this 1000 page long behemoth of a novel. R Lee Smith is a fantastic storyteller but she could use a good editor to just trim her production. There were so many repetitive scenes, and don’t get me wrong, they were all fairly well-written but I got the point the first time round. There is no need to beat me with it in the head.On the other hand I can’t see any mainstream publisher taking this weird number on because their marketing department would go mad trying to figure out which of the neat publishing boxes to stick into. Is it sci-fi? Epic fantasy? Post apocalyptic survival? Paranormal romance?There is no point in summarizing a 1000 page long book in a review but the basic premise is this: It’s sometime in the future and of course the world has gone to shit. Amber and her annoying sister find themselves in dire straits and decide to sign up to colonise some distant planet. Things go wrong and they crash land somewhere further they ever meant to go with only a handful of survivors. Lots of things happen and Amber meets Meoraq, an alien looking like a cross between a lizard and a man. Surely they will eventually fall in love but the romance develops slowly, understandingly, as both of them at first consider any relationship between them as a form of bestiality. So they have to get over that first. And the reader has to get over things like snouts instead of faces and retractable penises. Retractable penises! Sexy times.Except for Amber, every other surviving human is an idiot and an asshole, especially Scott, the self-proclaimed leader who hates Amber’s guts. This is where the book gets a bit confusing, because while I can understand why Amber wants to stick with those human assholes despite everything (they are on an alien planet, they are the only humans she will ever see again, I get it, I’ve spent enough time in some God-forgotten places to know how quickly your standards for what is acceptable human company drop) but why do all these morons follow Scott is beyond me. In normal circumstances populist idiots like Scott get voted into governments because they can wax poetic about all the fantastic things they are going to give the people because those people have no idea how the economy or government work so it’s easier for them to buy that sort of crap. But on that alien planet all Scott’s theories are put to test immediately and he fails repeatedly. It’s Amber who brings them food and guarantees their survival. Even if they don’t like her, their self-preservation instinct should’ve kicked in and told them who to stick with. I understand that you had to be either very stupid or very desperate or both to join that foolhardy mission in the first place but it’s still amazing how poor Amber found herself on an alien planet with 50 of the stupidest humans Earth had to offer.I hope it doesn’t sound like I didn’t enjoy this book because I enjoyed it a lot. It’s not an escapist read – which is what I normally want from my romance novels. I would never want Amber’s reality over my own reality, even if hers comes with this larger-than-life love. No hung lizardman is worth going through such a fucking ordeal that includes murder, rapes and near starvation. I’d do anything for love, but I won’t do that.One of my favourite aspects of the book was the very clever meditation on religion and society. Amber is a sarcastic atheist while Meoraq is serious and fiercely religious. Props to the author for making their romance feel authentic. Bizarrely, this book reinforced my atheism while according to another reviewer it strengthened her belief in God. It really was very balanced. Narration was also very good. I particularly remember that one bit when suddenly things became weird and distorted and after a while you realise Amber got hit in the head. And then there is the world building, of course. It was very clever and so internally coherent that it would be a shame to classify it as a simple romance novel."}, {"userName": "WhiskeyintheJar/Kyraryker", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/2763722-whiskeyinthejar-kyraryker", "userReview": "2.5 starsI read this for the Alien square for Halloween Bingo\nShe should have been prepared to see something like this. An alien, that was. From the moment she'd first seen the scaly deer if not sooner. But there was a big difference between knowing intellectually that there were forms of animal life on this world and seeing a six-foot tall lizardman come at you out of the bushes with a knife in his hand.\nThis was 1,000 pgs. I'm exhausted because as you can tell by rating, it was only an ok 1,000pgs. Look, everyone seems to love this book, so grain of salt and all that but here's my probably not coherent exhausted luke warm take:The first three books(parts) was pretty interesting, meeting our first person pov heroine Amber and how she has had a poopy life on Earth and decided the best way to survive was jumping on a space ship. Her whole life seems to be taking care of her sister Nicci who is completely a waste of space. Nicci depends solely on Amber and blames her if anything goes wrong. The ship gets hit by a bunch of asteroids, killing most of the 500,000 or so, gets knocked off course and crash lands on an unknown Alien planet. 48 survive with a guy named Scott who wants to be leader and really has it out for Amber. I've never been in such a survival situation with a group of people but I would hope food and shelter would be first on their mind, at least for a hot minute, over what guy gets what \"womb\" out of the 11 to repopulate their colony. Looking over reviews, I see this is classified by some as erotica, which could help explain the huge focus on sex, which felt over focused on to me. People needing leaders but too scared to lead I get, but the hate on Amber felt so forced and the lack of anyone questioning stuff, again, felt forced to serve a narrative. It was a good narrative on society with a Lord of the Flies feel but still, a bit forced.  Meoraq and his world that Amber crash landed on was interesting, especially with the importance of religion the author added in and how it tied into their society and cultural values. Meoraq's faith and sureness in his world and role in it was interesting to follow along with as he met Amber and how she slowly but surely put it dent in it all.After book three, things slowed way down for me as it was endless Amber fighting against the group trying to get them to survive, her sister treating her like crap, and Meoraq being annoyed with the whining humans but also kind of attracted to Amber, a lot of rinse and repeat. Book six has Amber being kidnapped and the constant rape scenes start, it was incredibly exhausting. I liked how the author addressed religion, how its needed, what it provides, and how it can lie. I liked how this was something pretty different with the alien world and culture and how Meoraq was a lizard, no human characteristics at all. I also liked how the humans were the \"aliens\" and how the author played with that theme. Ultimately, this was too long with repeated scenes, forced or simplistic actions, and too many rape scenes. If you want something different with a lizard hero, many others really enjoyed this."}, {"userName": "Jacqueline", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/2999717-jacqueline", "userReview": "Loved. It. I wish I could buy this book in a dead tree copy so I could share it with all my friends. I've read a few comments about this book. I know some people thought it was too long but you could sign me up right now for another 2400 pages. Some people thought it was too violent. I was glad the author had the courage of her convictions. The hero is not going to save the heroine every time before the bad stuff happens. So on to my review.First, the world building was amazing. The religion based culture of the planet the humans landed on was fully realized and made clear sense. Sometimes alien religions seem murky and hokey. Not here. The hero, Meoraq, had firm belief. All his words and actions spoke to his belief. He was an amazing character and I loved him. He was a good man and a wise one. He behaved the way he knew was right and let no one except the heroine sway him. He fell in love with her and indulged her where he could without compromising his principles. His dialog was lovely and the way he loved her and spoke of her was beautiful. He wasn't always perfect and I felt he learned and grew as the story went along.The heroine, Amber, was interesting. She was bitchy and the other humans didn't like her. But she was right and they were wrong and she let them know it. She understood their situation and tried to learn and move on with her new life. She wasn't perfect. She held on to the other humans way too long and let the walk all over her. But I think that was explained at the end when she told Meoraq that they were the only humans left and she couldn't let them go. She was ultimately a good woman. She loved Meoraq and tried to always have his back. She wasn't xenophobic. She was open and accepting of the people and culture of the planet. Except she was an atheist. She and Meoraq squabbled about religion all the time.I loved the minutiae of the journey to the shrine. That is my crack. I love to have every detail explored especially in a sci fi book. I like to see how they are responding to and dealing with the new world. That might not be everyone's cuppa but it sure is mine. The violence was there but honestly I have read way worse violence in some romantic suspense books. Yes she got raped but it wasn't horrifically graphic. She mostly just figured it was going to happen and just got through it best she could. She was a survivor. I think this violence etc., just added realism to the story. She was on an alien planet full of sex driven men. It was going to happen. Not putting it in would have been doing the story a disservice. The important part is that she got through it and that both she and Meoraq clove together anyway. Their relationship was the important thing to both of them. Although of course there was thought put into how to move forward, at least on her part. He never took his eyes off the prize which for him was her. I didn't feel this story was too dark. There was hope throughout. There was courage and love. The ending could have been a major downer but I felt the author pulled it out at the end. Of course I knew early on what was going to happen at the shrine. I've read too much sci fi not to but I liked the way it was handled and how Meoraq eventually dealt with it.On a more prosaic note. This book was well written, well plotted. No typos or other self pub type issues. If you like sci fi romance you should read it. Gotta get to work now. I might have to come back and fill this review out a little more when I have more time. :-)"}, {"userName": "Ivie ✩Born to Magic-Forced to Muggle✩", "userReviewDate": "Aug 16, 2015", "userURL": "http://www.goodreads.com/user/show/9838687-ivie-born-to-magic-forced-to-muggle", "userReview": "Here's the thing, space-porn is awesome. It's a genre on it's own. A lot of people may laugh, and I imagine do, that so many people are jumping all over books that depict humans humping aliens, but what do you expect me to say? We can be a bit pervy as a species. One thing I didn't expect – is for this book to be this long. And long it was. Over 1K of pages. Yup.... Think on that a minute. For a space porn – that's impressive. Tell you what else was impressive, the actual novel itself. It was damned good. I liked the writing style, it was elaborate, extremely detailed and not rushed. From the beginning I knew I will abso-fucking-lutely love it and I did. The story starts told trough the eyes of an older sister taking care of her younger sibling following the death of their mother, who happened to be a registered prostitute. The sisters are destitute, too young to truly help themselves and in desperate need choose the lesser of all evils that can befall them. They volunteer to be the first colonizing force on a far away planet. They would be the pioneers, and clear the way for other colonizers. It is extremely dangerous work, with no guarantees, but the only possible true choice remaining. The sisters fall asleep in the crio tubes and Murphy takes his law in full effect and simply screws everyone over like the bastard he is. Shit goes terribly wrong and they overshoot their planet, by a couple hundred years. They crash on a planet and soon enough out of fifty thousand people and crew only forty eight remain. While for the sisters a terrible drama unfolds, we go a bit further away to find that the planet isn't uninhabited as the settlers first thought but a home to a lizard like race. They have their civilization and a set of rules they follow really closely. We go on a journey with Meoraq, a spiritual warrior male to meet his destiny given to him by his god.This book is definitely not for the faint of heart. It has elements that people could find disturbing, from graphic violence to graphic sexual content. It seems to me that this was maybe meant to be a series but got published as an omnibus. Still for people like me, who live the not so classic Sci-Fi it's brilliant. I am amazed that it was so well written ( I honestly wasn't expecting that) so it was an amazing bonus. I have to say that because of the length of the novel, I have read it in segments rather than in one go, with a few fillers in between. This book was friggin amazing and I would recommend it to all people who love Mars Needs Women trope."}, {"userName": "Anna (Bobs Her Hair)", "userReviewDate": "Oct 20, 2013", "userURL": "http://www.goodreads.com/user/show/3167458-anna-bobs-her-hair", "userReview": "4.5 stars ... (Not sure whether to round up or down.)A heck of a lot less violent than Heat, which had gore and rape from beginning to nearly the end. Loved the world-building at the beginning. It did drag off and on during the middle. The payout for reading this long book was a very rewarding ending. Everything came full circle. What was good: the world-building, the romance, the characters (even the villains had dimension; except the humans, especially Scott), and the resolutionWhat Gann needed: tighter storytelling, Nikki and Scott's behaviors became old and they lost their effectiveness as foils/villainsBuddy read coming Nov. 7. Suggested by Searock, who heard about from Dear Author blog."}, {"userName": "Mara", "userReviewDate": "Oct 11, 2013", "userURL": "http://www.goodreads.com/user/show/3954707-mara", "userReview": "4 1\\2This is a book about faith. And maybe hope. It's in no way an easy read, there's plenty of violence going round and not all of it will be palatable for many (most?) readers. You really have to enjoy dark, gritty books to even consider reading The Last Hour of Gann. It's weird. This is published by and with an erotica label. And yes it has sex in it. But in a book 500+ pages long, the sex is a drop in an ocean. What you'll find is two mind set, two species, a lizard warrior monk and a human daughter of a prostitute. Past and future (and who is what really depends on pov.) The rightful and the sinner. And all of it is nothing if not a slight reflection of what's going on. I'm mostly agnostic. At times an atheist. Often irritated with faith. Always wary of religion. And here I found myself damn sorry for a faith lost. And possibly recovered.Because yes this is a romance. But the romance is as good as the characters who love. And I could not find a reason to avoid loving Amber and her Lizard. His world is perfectly crafted, his faith too. She is so human in her faults to be near perfect. None of them maybe for you, but hell if they weren't for me.Mark me. This book has its many faults. It's long (but not enough). It has both incredibly detailed villains and absolutely cardboards ones. You have plenty to chew off, and probably too much. But you can't stop reading. Just be warned. This is not a book for everyone. Try a sample, in itself it's a novella. You get the idea. And you'll want to drink this cup to the bitter end. (Where you might find hope, who knows?) What I loved.-Amber-Meoraq-World-building (even if you hate the world), detailed up to flora and fauna-Side characters are as interesting as the main ones (but only the lizardies)-the slow building romance-the cultural differences. I appreciated how the author did not equal language and culture/meaning. Langue and parole. You may perfectly understand a language and still do not understand subtexts. Or avoid to get references. Here I was snickering every time I realized the leading couple did not really mean the same things when talking to each other or thinking about each other. What I didn't like-The lack of true depth in the human camp. It doesn't take a PhD in psychology to see how a group of human men and women works. If you put five people together, they'll want to do 5 different things. Here there was no real human social life. Yes, the 50 strong group divided in 2: 49 vs 1. No, sorry. It really never works this way. (And there was no reason or logic to it, too).And yes, disaster can bring the worst out of us, but also the best. But the author choose one side only. It was like she was trying too hard to make us either hate the humans or like the alien society. Plus, only a small bunch of people are named and actually part of the story. The rest of the survivors are just a backdrop destined to die (and be sheep in the mean time). There's not one intelligent being in this group. And I'm not joking. No one, except Amber, tries to learn to survive. Pity, because this really brought down the book in my enjoyment.-The soap opera drama. No, it's really the wrong phrase. There's no melodrama here, but pure heartbreaking drama. But at the end (i.e. Iziz) I was really thinking, ok, there is \"too much\". It (he) was expected, but honestly, is it statistically sound? All the fuzz started on Twitter, but you get the why here: http://dearauthor.com/book-reviews/ov..."}, {"userName": "Mei", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/6876967-mei", "userReview": "WOW!!!!!I don't have enough words to explain just how GREAT this book was!!!I was expecting a usual alien-human love, but here I found so much more!!!Like an excellent, interesting, intriguing, brutal, violent, religious, sexist world building!Like a totally alien hero, both in his physical aspect and his reasoning!Like a post-apocaliptic, empty, dangerous landscape.Like a totally unconventional heroine!Wonderful!!! Simply wonderfulIt reminded me of Octavia Butler's Xenogenesis books. It has the same \"flavour\", the same desperation, the same bleakness, the same strenght!More than a simple love story, it's a journey to God. And don't get me wrong, it is absolutely not a religious book.There are too many very violent scenes, there's rape, there's killing and maiming, but it is still a journey to God.It is almost a rewriting of the Bible (please, you devout believers, do not be offended), an alien Bible, but still...Some of my friends, who read it, found it a litlle bit dragging, but I must say that I enjoyed every sigle word and I am left wanting for more.It's true: I cringed during all the awfully violent scenes, but each one of them has a lesson to impart either to Amber or to Meoraq. Like the sweet, tender scenes also had a lesson in them, but this time a lesson of love.Yes, this book is a love story, but it is also the story of acceptance of self, of each and every flaw. There're all kind of lessons hidden (and not so hidden) here: humility, compassion, forgiveness...The tiny, teeny complaint I have is the almost morbid attachment Amber had to her sister. She's not blind to her sisters faults, but she's still attached to her to the point of madness.I didn't like how the humans have been described here, but that's only because I'm part of the human race. *wink*I would have liked to have at least one good human among the crazy bunch besides Amber. And even Amber was not completly good, but still she's at least willing to learn to be a better human being.Also, the villains here were truly bad, bad, bad... But this is Gunn's world...Anyhow, this book was tought-provoking and so very interesting that I'll keep thinking about it for a long, long time!"}, {"userName": "Grey", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/33429289-grey", "userReview": "This is without a doubt the longest book, I have EVER read. With my specialized kindle font, margins, yada yada I have set... twelve days ago when I opened this book and I tapped the screen - the bottom bar said location 3 of 19907. I am not exaggerating when I say my mouth did that weird fishy-looking, up and down, no sound thing.I'm not sure I would have ever picked this one to read for myself, other than the fact it was on my TBR pile and at some point, it must have interested me... Let me back up a little, I am in a wonderful book blog group and we are participating in a year long challenge to help try and clear a few books from our never ending TBR piles. For every month of 2017, several of our most vocal members picked a theme for each month. And well... February's theme was PNR/Fantasy. How much more PNR/Fantasy could I get than, The Last Hour of Gann?This book came highly recommended by those members of my book club that had read it... far more are daunted by the length. I mean truly, it's divided into 8 or 9 books inside the main book. I don't like to give spoilers in my reviews, so please forgive me for being rather vague here. World building, on pointe. Character believability-absolutely. Engaged all of my feels.Where I struggled, was with finishing....it was just way too long. The first half of the book, while well written, seemed to drag. The second half, while it seemed much more intense; still, was overly verbose and repetitive. My biggest problem was the ending, believe it or not. All of that build...and then I feel, that not enough time was given to properly tie up the ends. I know...damned if you, damned if you don't. I'm waffling between a 3.5 and a 3.75 star rating on this one."}, {"userName": "´*•.¸(*•.¸♥Laura♥¸.•*´)¸.•*´", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/10251860-laura", "userReview": "Solid 4.5 starsLoved it!  The Last Hour of Gann is LONG!! But I cannot praise the momentum of this book enough; it builds momentum like no prose author I've read in quite some time. This book does not hold the typical archetypes characters that seem to be the norm of late; some are gritty; few are totally evil or good. R.Lee has created a sprawling world, full of intrigue and potential, and sowed it with characters that can carry out interesting conflicts within it.  There are richly textured characters as well as secondary characters, but in my opinion; this book contains one of the best male and female characters I have read. For me personally, the main strengths of this book are Meoraq and Amber; and oh the author’s willingness to do horrible things to them!! I will conqur with my darling Kelleann and I will also go on record; Meoraq and Amber are my **NEW favorite couple! **Update: Thanking Jill for the reminder how Jamie & Claire, who will go down in my reading history as my all time favorite couple :)  She had this lizard lord wrapped around her pinky! She had him at \"Mmmbr\"This is only my second book I’ve read in this genre (Sci-Fi); both those books were by this very author. Do I care to further pursue this genre, if R. Lee Smith writes it, I’m in."}, {"userName": "Pamela / SpazP", "userReviewDate": "Oct 08, 2013", "userURL": "http://www.goodreads.com/user/show/3522886-pamela-spazp", "userReview": "Re-Read: Just as amazing as the first time I read it in 2013. I NEED more books like this in my life.What do I do with myself after finishing this?? It took me a week to read it (I usually read 2-3 a week), it's that dense, and soooo much happens. WHAT A STORY. Gah!! I was intrigued from the beginning, then found I could not put it down. Every free moment I'd glom this book. The ending left me with one of the most rewarding feelings I've ever had upon completing a book, and now I have a book hangover. How can I possibly read anything else after this?"}, {"userName": "Michelle [Helen Geek]", "userReviewDate": "Oct 20, 2013", "userURL": "http://www.goodreads.com/user/show/5557851-michelle-helen-geek", "userReview": "11/02/2013 --Overall Rating = 5 StarsBook Cover / Book Blurb / Book Title = 5 / 5 / 5 = 5 StarsWriter’s Voice = 5 StarsCharacter Development = 5 StarsStory Appreciation = 5 StarsWorth the Chili = 5 Stars -- [$6.50 on Amazon]Books like this are invaluable. They engage the reader's mind, their emotions, their sense of adventure. The rating scale we have available do books like this an injustice. They are head and shoulders above others I've rated 5 Stars. Read this book.I'm not a huge fan of sci-fi books. Why? I'm not always patient with the world building that must happen in order for the story to be told. Without Jill's review {https://www.goodreads.com/review/show...} I may have given up. This would have been a TERRIBLE thing. The world building took up about 16% of this incredibly long book, so it seemed like it took forever and I may have given up. I'm so very glad I didn't. This book, this author is a TREASURE.I could outline all those things I liked and those things I have some critical comments about, but Jill nailed it in her review. Read it -- I won't spend time duplicating.Michelle's comments:1 -- This book is about a love \"for the ages\". Nothing mattered to these two but each other. The care and well-being of the other. They showed this with such care and loyalty. It was detailed in such an unremarkable way. Just thinking about it brings tears. This writer is truly incredible.2 -- Sure there is violence. Some of it against women, but this isn't what this story is about. It's about survival. First of all, this is a primitive setting. In any culture, survival can be violent and it isn't always pretty. Have you read history? This is the history of two people as they struggled to survive. One is on a personal journey to figure out the meaning of the rest of his life and the other is just trying to survive. Meaning? Hell ... she just wants to get through this day and into the next. If you decide not to read this book because of the violence, you will be missing something extraordinary. A shame that.3 -- Have you ever read a book that makes you wonder about the creative mind? This is one of those. Amazing someone can create all this and not have lived through some of it. The detail and vision. No other words come to mind but BRILLIANT and AMAZING.4 -- Rich symbolism. What do I mean? Well, this world is another planet with \"alien's\", but the culture reminds me of what little I know if the history of the Bible. Remember the story of what happened after Sodom and Gomorrah? Think Old Testament / New Testament. This isn't obvious, but I got it. BRILLIANT. Now, it isn't a religious book at all, but it pulls from history to create this story. Totally overhauled and reinvented. I LOVED IT.5 -- These two creatures couldn't be more different, but they accepted each other completely. One is human and other is not. This didn't seem to matter as their story progressed. It started out with mutual respect for their strength's ... attitude then work ethic, then so much more. The differences between them didn't seem to matter. It was such a total non-issue. What a wonderful world this would be if we could all see beneath the surface into the true person. It did take a while for these two, but actions speak louder than words. The message is perfectly simple. And, loud and clear.This is really all I can really add to Jill's thoughtful review. If you read this, remember, be patient. At 16% you will be so CAUGHT, you won't be able to put this down. I'm reading another by this author now and the same thing happened at about 23%. I'm hooked. She is one my FAVORITE author list for now and forever.Happy Reading!!Jill, thank you for your review which kept me there until the story did. Searock -- you always amaze me when you find these gems for us. THANK YOU! To both of you ... keep them coming. I love and appreciate my ARC buddies!"}, {"userName": "Raquel", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/14158760-raquel", "userReview": "DNF at 70% I was really intrigued by this book. The story sounded different and interesting and there are some really good positive reviews. I knew it was long and that a lot of parts would drag based on the reviews. A lot of people mentioned that it would pick up after the 20% mark. But for me it actually picked up after the 60 ish% mark. It took me 3 days of forced heavy reading getting to the 50% mark and was mostly bored during the first half. By the time I felt that things were really picking up I was really drained and unfortunately wasn't caring much for the story or characters that I started skimming through some parts until I decided to give up. There was too much repetitive and unnecessary fillers in the first half. If this book would have been edited by half I would have liked it and enjoyed it more. On a positive, I thought the world the author created here was very creative, different and unique."}, {"userName": "Whitney", "userReviewDate": "Jan 07, 2015", "userURL": "http://www.goodreads.com/user/show/6972601-whitney", "userReview": "Ok, I can see why people are either hating or loving this book. But, I'm giving it a solid 4. Why, you ask? Because I was damn entertained. It wasn't a struggle or a goal, I just wanted to keep picking this book up and see what happened next. Yes, it was very long. Yes, there were some aspects that drove me insane. But, I give Smith props for building this world and characters. Down side: No Epilogue! It was much needed!"}, {"userName": "Kara-karina", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/5427067-kara-karina", "userReview": "The good thing, ladies and gents, is that this book will blow your mind. The bad thing, - it's not for everyone. This is a pretty epic sci-fi romance; a hefty tome, at 1000+ pages, with quite a lot of world building and various trials and tribulations for the main group of characters, which at times are very hard to stomach, but the whole experience is absolutely addictive.In not so distant future, Earth is how we imagine it would be - overpopulated, overpolluted and drowning in its own misery. Amber's mother just died, and she and her younger half-sister Nicki have to get out of their apartment, because even with their two jobs they can't afford the rent.The only logical option as practical, overweight, plain Amber sees it is to sign a five year contract to become first colonists on a distant planet. The hitch in the plan? A meteorite shower on the way to the colony shreds the ship, and Amber, Nicki and few others wake up from their suspended animation few years later in a wreckage on a very different planet from their destination. Unknown, unexplored, with not many supplies and no way to contact Earth.What follows is a very difficult journey of the surviving colonists on an alien planet. Amber in her practicality and almost brutal honesty is not liked, barely tolerated and constantly bullied by the rest of the group and especially by its leader, Scott. He is a typical politician who tells people what they want to hear and ignores the truth even if it bites him on the arse repeatedly. In fact, Scott comparing to Amber is almost a perfect villain. You can not not hate him, and that disturbed me a little as I prefer my villains with at least a hint of redemption.Amber is perfect too but in the opposite way. She is extremely stubborn, insanely brave and determined to always do the right thing even if it pits her against everyone else. Her saving grace however is her practicality. She is by definition a survivor and will do whatever it takes to get through shit.The characterisation in the book is fantastic. The characters are so alive, you either love them or hate them, but what you don't feel is the indifference or boredom. What really makes it though is the monumental clash of cultures and larger than life figure of Meoraq.The main hero of the novel is, pardon me, a lizardman. His race lives in a strictly regimented religious, feudal society, and he is some sort of a higher ranking warrior-priest who discovers human survivors on a religious pilgrimage.Funnily enough, Meoraq finds us humans very ugly. So his fascination with Amber stems not from physical attraction but from her amazing spirit. He is very insightful, but stubborn and set in his ways, and the chemistry between him and Amber develops very slowly and against all odds until it reaches its boiling point.Another interesting thing is that throughout the whole book Meoraq speaks in his own language and Amber converses with him in English. They learn each other languages, but Meoraq refuses to speak anything apart from his own language due to religious beliefs, and Amber can't reproduce the sounds of his language correctly because her physiology is very different.There is a lot going on, and I mean A LOT. Apart from the twist of the story, there are a couple of villains that will give you chills (and I'm not talking about Scott). There are nasty dynamics which will happen in any human group when the flair of civilisation will crumble, but there will be some amazing shit happening as well that will make the whole experience for the lack of better word seem... profound.I'm intentionally vague, but believe me, - this was one of the best reads for me this year, and I wholly recommend it without giving you too many spoilers. If and when you read it, come back and comment. I would dearly love to know if you enjoyed it as much as I did."}], "description": "It was her last chance:Amber Bierce had nothing left except her sister and two tickets on Earth’s first colony-ship. She entered her Sleeper with a five-year contract and the promise of a better life, but awakened in wreckage on an unknown world. For the survivors, there is no rescue, no way home and no hope until they are found by Meoraq—a holy warrior more deadly than any hungering beast on this hostile new world…but whose eyes show a different sort of hunger when he looks at her.It was his last year of freedom:Uyane Meoraq is a Sword of Sheul, God’s own instrument of judgment, victor of hundreds of trials, with a conqueror’s rights over all men. Or at least he was until his father’s death. Now, without divine intervention, he will be forced to assume stewardship over House Uyane and lose the life he has always known. At the legendary temple of Xi’Matezh, Meoraq hopes to find the deliverance he seeks, but the humans he encounters on his pilgrimage may prove too great a test even for him…especially the one called Amber, behind whose monstrous appearance burns a woman’s heart unlike any he has ever known.", "title": "The Last Hour of Gann", "url": "http://www.goodreads.com/book/show/18589656-the-last-hour-of-gann", "average": 4.11, "cover": "https://images.gr-assets.com/books/1380286253l/18589656.jpg", "reviews": 717, "authors": [{"url": "https://www.goodreads.com/author/show/3225845.R_Lee_Smith", "name": "R. Lee Smith"}], "type": ["Science Fiction", "Romance", "Science Fiction", "Fantasy", "Dark"], "outlinks": ["http://www.goodreads.com/book/show/18589656-the-last-hour-of-gann", "http://www.goodreads.com/book/show/27228341-land-of-the-beautiful-dead", "http://www.goodreads.com/book/show/8151462-heat", "http://www.goodreads.com/book/show/17563213-cottonwood", "http://www.goodreads.com/book/show/8151463-the-care-and-feeding-of-griffins", "http://www.goodreads.com/book/show/13377768-olivia", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}