{"ratings": 837, "userreviews": [{"userName": "karen", "userReviewDate": "Nov 06, 2014", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "i'm not sure what i can even say about this book except: fun fun fun gory fun. i don't know how big the south african horror writing community is, but even though i have only read this book and two by lauren beukes, i can safely say i am a fan. this book is actually very reminiscent of lauren beukes, in all good ways, and may be why she liked it enough to include in her list of horror novel must-reads. first things first - s.l. grey is a pseudonym for Sarah Lotz and Louis Greenberg, so i'm going to use \"they\" when i refer to the author, which will be confusing at first, but you're a smart kid, you'll catch on. in this book we have rhoda and david and a mall in johannesburg.rhoda was supposed to be babysitting a little boy for her cousin, but she also needed to score some drugs, so she dropped him off in the bookstore and went to cop. when she came back, the boy was gone. her requests for help from security are complicated by the fact that she can't actually remember the boy's name, and the fact that she's clearly a junkie, reeking of smoke and sweat. she's also black, has a british accent, a shaved head, and severe facial scarring, none of which are endearing her to the mallcops. david is a passive emo wageslave, all black hair, eyeliner and mooniness - a bookseller at only books who spends his days pining over his unattainable blonde co-worker josie, and hating his boss, his job, his looks, his life. he saw the kid rhoda lost in the employee passage behind the store during his break, but since the cops tell him they are looking for a black kid, he tells them truthfully that he has seen no such child. rhoda is pissed.and after the mall closes, she forces david at knifepoint back into the building to help look for the kid. at first, things are going swimmingly - rhoda is chain-smoking and doing coke and david is slouching and scowling, but soon their surroundings start to …change. david is lost in a part of the service tunnels he has never seen before, even though he has spent ample time in them. the numbers on the backs of the stores make no sense, turning into a crazy maze and forcing them deeper and deeper into a series of stairways labelled with disturbing signs and dank tunnels containing piles of discarded mannequins in grotesque poses.they begin to receive spooky and manic texts on their phones, even though they otherwise have no signal, that gleefully force them into a series of tests that seem to be based on their own personal fears and discomforts.eventually, after a series of very harrowing mini-adventures involving a few different batches of half-crazy homeless folk, shattered mirrors, a diabolical elevator, and a large, unseen snuffling beastie, they emerge triumphantly, but exhausted and shaken into the mall once more. only this mall is not quite the same mall…. this is the mall from hell. which you might cry \"redundant,\" but stuff your snark because i mean this literally. blank-eyed staffers chained to their stations chirping corporate jargon perkily like the most perfect customer service drones ever, shoppers who are either morbidly obese or skeletal, sporting amputations and plastic surgery, barreling through stores, shopping 'til they drop, nightmarish advertisements decorating stores that are just off, with ominous names like \"Curl Up & Die,\" \"Last Call,\" \"Slut Bucket,\" \"McColon's\" (which serves humungous sandwiches filled blood-gouting meat), and a movie theater showing a very different version of bambi.it's horrifying, but also very very funny. you get your scathing social commentary on vanity and consumerism and gluttony along with some less-funny examinations of inequality along racial and class divides. and how, as much as this mall is a carnival of ghoulishness, it's actually more appealing and accommodating to perceived outsiders than the real world in many ways. brrrrthey get all the retail parts exactly right, in both of the malls - the customer abuse, employee abuse, work hookups, middle management bombast, the narcotizing effects of the climate-controlled wonderland… and that's just in the \"good\" mall. there's also some great bookstore-specific humor that former booksellers like myself appreciated a bunch, Another Dan Brown flick and everyone's suddenly a reader. overall it's a really fun book that makes some astute points, presents some hilarious alternative-world advertisements, and suffers only from a strange shape; the action kind of wanders around in unexpected peaks and valleys, and the story meanders a bit, but i expect it's difficult to compromise and blend two authors' visions into one narrative, and i'm not complaining - this was wonderfully smart and gross and i'm so glad to have finally gotten my hands on it. this book is part of a trilogy, but it's one of those trilogies that don't seem connected by character or situation (although the second book sounds very similar in plot to this one). the other two are still in print in my country, so i will snatch them up and report back at some point. thank you so very much, kristin (KC)!***********************************************************after reading about this book in lauren beukes' must-read horror novel list that elizabeth posted one time, i knew i had to have it. and i finally got my hands on a copy thanks to kristin (KC). it takes a village."}, {"userName": "Carmen", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/25353295-carmen", "userReview": "Once again I'm cowering in a dark place, in fear for my life.Wow, this book was actually excellent.Patrons are advised to enter the market at their own risk. Management will not be responsible for injuries resulting from choking on small parts, exsanguinations, unlicensed amputations, theft, transplants, broken pointy bits of glass or death.Now. I want you to take my five-star rating of this book with a grain of salt. You should know beforehand that I have a real weakness for horror. I love horror books.Why, Carmen? Do you like to be scared?Not at all. But horror books don't scare me. Do you know what is scary? Rape, child abuse, sexual slavery, car accidents, living with chronic pain, starving, poverty... stuff like that. You know. REAL LIFE. No matter how \"horrifying\" books claim to be, if they are about zombies/witches/demons/ghosts/werewolves/living dolls/hauntings etc. I am not scared of them. Because I don't believe in that shit. Give me a book about child abuse, I will be very frightened and feel sick inside. But a book about, say, a demon clown who beheads people with a chainsaw - and I will just be entertained (if it's well-written)....So. This book. Even though the book is NOT divided up into three parts in actuality, it is clearly divided up into three parts in my mind.PART ONE: HorrorstörHere's the opening of The Mall:My first instinct is the grab his hand, snap back his index finger, and floor the fucker. Instead I keep absolutely immobile, sucking in deep jags of oxygen to try and still my heart. It's jack-hammering like it does when I've taken too much MDMA, but it's vital I get my shit together and calm the fuck down. I shrug my shoulder out of his grasp.\"Sir?\" he barks, voice nasal and commanding. \"Why were you running?\"\"I'm not a sir,\" I say, turning my head so that he can get a good look at my face. He flinches as I knew he would, but doesn't bother trying to mask his distaste. Most people at least attempt to hide their shock, but not this guy....This is Rhoda. A black British woman who is in a Johannesburg mall, looking for a little boy who's gone missing. She's starvation-thin, with a bald head, a nasty scar that takes up half her face and trails down her shoulder to her back, a switchblade, and a real bad attitude. She's supposed to be babysitting her cousin's Zinzi's charge - but instead of staying home she took the 8-year-old kid (fuck! Why can't she remember his name!?!?) to the mall so she could meet her dealer and buy some coke. Unfortunately, the little boy runs off and now Rhoda can't find him...Rhoda tells every alternating chapter.Our other narrator is Dan.Have you ever seen the show Gravity Falls? If you have, I only need to tell you that Dan = Robbie. For those of you who don't, picture this. Skinny white guy (23ish) with tons of acne. Dresses in My Chemical Romance t-shirts. Wears eyeliner. Works a shitty retail job and hates his life. He is obsessed with his pretty co-worker, Josie - but instead of actually talking to her he hides behind the stairwell and spies on her creepily. Lives with his mom. And it wouldn't even occur to him to ask out or be interested in any woman except for the prettiest woman he works with. You know the type. You know what I mean - any woman other than the \"hottest\" woman would somehow be \"settling\" even though realistically he would never ever get that type of girlfriend, for reason of his low self-confidence ALONE, if not for looks/attitudes in addition to that. And he idolizes women and \"rates\" them based solely on their physically appearance - never asking himself stuff like \"Is she kind? Is she funny?\" etc.ANYWAY. When the kid goes missing, Rhoda frantically tries to convince the (racist, sneering) guards to help her. But they won't. The CCTV footage they show her convinces her that Dan saw the kid and that he's lying to them. So she escapes the guards and lies in wait until the mall is closed to jump Dan with a knife in the parking lot, where she proceeds to beat the shit out of him. I knew the scary bitch was on drugs. Cocaine, heroine, tik, whatever it is. But while I'm bigger than her, she's faster than me, and vicious. I can still taste puke in my mouth, and my stomach fucking hurts. It's the first time I've been beaten up since high school, and never so seriously. I thought she was going to kill me when I tried to run, but I think she realises that she needs me to get her through the mall.Eventually Dan admits to having seen the kid, and Rhoda marches him straight back into the dark, closed mall in order to find him. But the mall is very different after hours. Smelly. Creepy. And what's that phlegmy, coughing sound they keep hearing? Where are all these maggots coming from?...It's not often that I read a book by South African authors. This was a very interesting location and culture for me to explore. And S.L. Grey is not really one person, but instead a female-male team that writes this \"Downside Trilogy\" together. I think this is one reason that the split-narration really works here. I wasn't suffering from that \"Who's narrating again?\" syndrome that usually happens when authors THINK they can speak clearly in two voices, but actually their \"different\" narrators are nigh indistinguishable. In this novel, angry, damaged, streetwise black woman leads one half, and the other half is followed by a loser with low self-esteem and a dead-end life which he hates.Kudos to the authors for making these two MCs layered and complex. At first I was convinced they would just be stereotypes - (angry black woman! emo loser scrawny white guy!) the kind trotted out in typical horror media. But with each chapter, we get more and more tantalizing clues about each of the characters' back stories, and slowly they morph in front of our eyes into fully-formed 3D people with strengths and weaknesses, good and evil inside them....So, the first 33% of the book is following this very traditional horror format. Two unlikely 'heroes' who hate each other's guts get in a really messed-up and creepy situation that becomes more and more hellish with each passing moment. What lies in wait for them in the darkness? Can they put aside their differences and learn to help each other in order to survive? Will they ever find the missing child or is it too late for him? Will they ever escape the hell that is The Mall?\"I've seen worse.\"\"You have?\"I haven't - not even close. And I've been in some pretty fucking hairy situations in the past. But I'm not going to tell him that.Very traditional horror.I take a gulp of the viscous brown air and something violent and thick lodges in my nose. The air is solid with flies, the floor carpeted with maggots. Now I recognise what's causing the acid itch on my flesh.She jumps up screaming, batting at herself, running away where there might be anything but this.I have to get up. I have to follow.But then the book changes tack. The middle portion of the book (33% - 75%) was really hard for me to get through. The characters act in really dumb ways that I just could not believe. It was as if they'd had sudden lobotomies or something. I was shaking my head, yelling at the book, and I was convinced I was going to give it 2 stars. I know it's common for people to do \"dumb things\" in horror, in order to make it more scary or something - but this was just them acting TOO STUPID for me to possibly believe. o.OSo what changed my mind? The final 25% of the book. This whole section was completely mind-blowing for me. Suddenly the authors were focusing heavily on psychology, relationship-analysis, life issues and life problems, radical life changes, and discussions on the meaning of life. In other words, MY JAM. I love this stuff. I eat this stuff up. Suddenly I couldn't turn the pages fast enough and I was reading and re-reading every perfect, profanity-laden sentence. WOW. This book TOTALLY went in a direction that I could never, ever have guessed from reading the first few chapters....There you have it. Again - take this with a grain of salt. I freely admit the middle section is soggy and not on par with the first and final thirds of the novel. But overall this book blew me away - and really surprised me, which is what I love most.Is it scary?I'm probably the wrong person to ask. I don't get scared by Stephen King novels or horror films, so I really have no idea. Again, stuff like \"I'm living with chronic pain and I am on food stamps\" is horror to me. Not \"a demon is possessing my house.\" That just makes me shrug. So, you'll have to decide for yourself whether this is 'scary' or not.I would say do NOT read this unless you know you like horror books/movies. It is NOT for the squeamish or the easily disgusted / easily creeped-out. There are some descriptions in here that would turn a weak stomach....This book makes great observations about life.Retail work: I made myself worthless, all for three peanuts an hour.Racism: Here's Dan talking about his black maid: ...realising as I say it that I've never imagined what Florence's home is like. I know she's got two grown-up kids and a grandchild living with her. But what does she do when she goes home? Who cooks, who cleans, how many rooms does her house have, does she have a TV? Do her kids work? Who gets up for the baby? Is she the same bleak and silent woman at home, or does she sing songs to the baby? Does she tell stories? I can't imagine her sitting around a table with her family and laughing. Florence starts existing at eight in the morning and blinks out of being at five. And as I pass her, she leaves my mind just as quickly.Or when he first meets Rhoda:\"I know you're in trouble. I'm trying to help you.\"The laughter dries up. \"Yeah. A prat like you would willingly help someone like me.\"\"Ja? What do I think of you?\" I challenge, rubbing the small of my back.\"Ugly unladylike darkie freak with a drug and anger problem. Typical of those black bitches who think they're above their station.\"Well, at least she isn't deluded. Aggressive. Paranoid. Fucked up on drugs. But, to her credit, she is not deluded.What we expect from people and what they actually are in reality. How we can think we \"know\" a person, only to be surprised and betrayed to find out that they have as many facets to their personality and as many faces in their life as pi has digits. What's happened to her? Or is this who she really is?Do we really want free will? Or do we secretly need and want others to tell us what to do? I want you to tell me what to do. The only time I ever did anything interesting with my life, I was following you. I need you to tell me what to do.The book is also surprisingly funny. I won't tell you the best jokes, but it made me smile quite a bit. She's beaming dreamily like a teenager at a poster of a semi-naked movie vampire.Here's one of my favorite exchanges:Dan yawns. \"What's the first thing you're going to do when you get home?\" he says.\"I don't have a home.\"\"When you get out of here, then.\"\"Have a fucking shower, try not to get arrested, make sure that kid is found.\"\"In that order?\"\"Sure. You?\"He rests his head on the wall behind him. \"Double Quarter Pounder with Cheese. Then a trip to a psychologist.\"\"Seriously?\"\"No. I hate McDonald's.\"And in the middle of grimy, dirty, slimy, hiding, run-for-your-life horror, there are these small clear moments of observation. For the second time today, I notice just how light she is. She shouldn't be this light. It's like if she relaxed all those tight sinews she'd break into pieces....Even though I also gave Horrorstör 5 stars, this book is 10x better than Horrorstör. If you are going to read just one \"evil retail location*\" book, this one beats out Horrorstör. The thing is that this is the first book in a trilogy. And while this book doesn't end on a cliffhanger - I feel it ends in a great, really satisfying way - the authors ARE continuing this story in this universe and you can either choose to leave this as a stand-alone or you can go further into this world. I have NO idea where they are taking this, so I'm going into Book 2: The Ward eager but with a bit of trepidation. Who knows what kind of monsters are lying in wait just ahead?*I can't believe this is becoming a sub-genre. Or a sub-sub-genre, more likely.Tl;dr - I highly recommend this to any horror fan....P.S. Once again with the rats. Rats are NOT scary. Please stop trying to use rats to scare me, S.L. Grey, Grady Hendrix, Neil Gaiman. Rats. Not scary. Find a new schtick.P.P.S. Dear Publishers,If you publish this is Spanish I will buy a copy!"}, {"userName": "Tracy-Lee", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/5543097-tracy-lee", "userReview": "This book was my induction into the world of horror fiction. Interestingly enough the actual content of the book is not scary as much as it is grimy and gross. I must admit that there were moments where I became very weary of the dark corridors of my local mall and looked very carefully at sales people and shoppers. There are moments in the book where skin will crawl and your toes will curl. Descriptions are present, but not overtly, the content provides a platform for our imaginations to run wild. On surface level, the book is a horror adventure, but deeper it is a philosophical statement on the current consumer market and materialistic nature of the world.A fantastic read, with lovely South African references and a solid plot. Excellently written, a book to fully immerse yourself in, an exciting journey, but one that makes you think. I was told that this book was brilliant and I wasn’t disappointed."}, {"userName": "Kristin  (MyBookishWays Reviews)", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/3491365-kristin-mybookishways-reviews", "userReview": "http://www.mybookishways.com/2014/04/...Rhoda is supposed to be watching the child of a friend of a friend. Rhoda goes to the Highgate Mall to score cocaine, and when she steps away to collect, she loses track of said child. Desperate not to be turned into the police, she, er, asks (if you call a knuckle sandwich asking) a clerk named Daniel to help her. He claims to have seen the child running through the back corridors earlier, so that’s where they start, and that’s exactly when things start getting very, very weird. Daniel knows these corridors like the back of his hand, or, at least, he thought he did, but soon, they’re hopelessy lost, and something very big seems to be following them. Soon they emerge into a very different mall, where things seem more than a little off: shop employees are chained to their counters by their ankles, everyone seems to have at least one very noticeable gaping wound, and of course, all of the shop names are very different. Rhoda and Dan’s journey seems to be steered by the text messages they are both receiving from an unknown source, but who is sending them, and why, and more importantly, how do they get back to their own reality without losing their lives?The Mall is the first in the Downside series (The Ward, The New Girl) by the South African writing duo of SL Grey (Sarah Lotz and Louis Greenberg). Since I was lucky enough to snag a copy of the upcoming The Three by Sarah Grey, I wanted to dive into my copy of The Mall (which has been on my shelf for quite a while), to get an idea of her writing, and I wasn’t disappointed. The Mall is a clever take on the Alice-down-the-rabbit-hole theme, but it’s also much more. The authors did a terrific job of capturing Rhoda and Dan’s all-consuming terror when exploring the depths of whatever hell they’ve seemingly descended into. When they finally get out of those awful corridors (seriously, awful-remember the hospital in Silent Hill?), they must quickly adapt themselves to the new mall, and that means complying with some very new rules. People talk different, they act different, and odd doesn’t even begin to describe their surroundings. Given the strangeness of the Shoppers’ (everyone has a label, you’ll see) clothing choices, I began imagining some of the outfits that Effie wore in The Hunger Games, except take those and add bloody wounds and some pretty outrageous subdermal implants, and you’ll have a pretty good idea of what I mean.Rhoda and Dan actually make a pretty good team, once they hit their stride, and of course they’re forced to work together in order to survive their surroundings. The narrative is told in first person in alternating viewpoints, both Rhoda and Dan’s, and it’s quite effective. Rhoda is about as rough around the edges as one can get, but she has her reasons, and the way she perceives herself has quite a lot to do with what happens to her in the Mall, as does Dan’s dissatisfaction with his bookstore job and life in general, made evident in the book’s opening passages. It’s when they finally reach the mall proper, and find themselves separated, that things start getting bad for each of them (again, their distinctly different outlooks on life have much to do with what happens to them.) I don’t want to give away too much, because that would spoil the considerable fun that makes up this book, but its authors managed to combine very effective horror (with not a whole lot of gore, I must add), with some pretty astute commentary on consumer culture and the lengths that we go to in order to attain a certain “ideal”, whether it be in our careers, our looks, you name it. One of my favorite aspects of this book is the alternate mall’s power to both terrify and amuse, and effective black humor is very hard to do, but they pulled it off. It’s obvious that the authors meant their readers to laugh at some of this stuff, even if you find yourself cringing at the same time. And you will cringe. If you’ve ever wondered at the dead eyed (yet oddly hungry) stares of mall shoppers in their element, this book is a special treat. The ending may surprise you (or it may not), but it’s effective, and the authors only took it as far as they needed to. The Mall is unusual, insidious, very creepy (I mean, come on, when are mannequins not creepy? And what do malls have tons of?), and altogether entertaining (also, the imagery is amazing, I could go on…) If you like horror that makes you think, but also offers up some classic scares, this is a must read.*The Mall recently became available in the US by Atlantic Books, and The Ward and The New Girl will be available in June and August, respectively. Although, you could do what I did and hit up The Book Depository, because after reading The Mall, I just couldn’t wait."}, {"userName": "Eat.Sleep.Lift.Read.", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/15403298-eat-sleep-lift-read", "userReview": "From what I gather this tripe was written by two authors - it fucking shows.Disjointed.Sloppy. Tedious.What's even worse; the whole frackin' book is a set up for a sequel. oh fuck no, that shit ain't cool. The ESLR don't fucking read this stamp of approval."}, {"userName": "Karis", "userReviewDate": "Jul 09, 2011", "userURL": "http://www.goodreads.com/user/show/4860018-karis", "userReview": "Not sure whether I liked it or not really. An odd book that leaves you with more questions than answers."}, {"userName": "Haralambi Markov ", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/1233458-haralambi-markov", "userReview": "The Mall by S.L. Grey is horror on steroids with a PhD in psychology. It’s the smart answer to the SAW series as far as torture challenges are concerned and I estimate that even Hannibal Lector would worry entering this alternate reality. Writers Sarah Lotz and Louis Greenberg set out to chillingly disturb and tastefully disgust.I admit The Mall exhibited a rather slow start. Thirty pages in and I had not caught a whiff of horror, rather atypical from I’d expect from horror regardless of medium. In retrospect, I’m happy with the pacing as S.L. Grey justify every sentence used in the introduction of Dan and Rhoda, the unlikely protagonists, who must team up in order to survive the mall’s hazardous games. Both characters are socially dysfunctional. Dan’s a mall bookstore clerk with a strong tendency to whine as consistent with his emo persona, while Rhoda’s a scarred junkie with a short fuse and a potty mouth.It’s Rhoda’s irresponsibility [leaving the kid she’s supposed to babysit at Dan’s bookstore in order to meet her dealer] that triggers The Mall’s domino effect. When the kid disappears [Rhoda really doesn’t know his name, OK] and Dan’s ineptitude to focus on anything other than his woes causes Rhoda trouble with the Highgate mall cops, it’s Rhoda’s idea of revenge to later take Dan hostage and have the whole mall searched for the kid. This plan backfires, when the Highgate mall ceases to be the Highgate.S.L. Grey excel at reality distortion. As the characters enter sub-basement after next, the mall dons a more sinister atmosphere and the world tilts towards the macabre. From a mannequin massacre to mortifying signs, murderous text messages [while both cell phones suffer from no reception] and glowing rooms, Dan and Rhoda have to navigate this byzantine underground, until they enter the Other Mall. The Mall that has no closing time. The Mall that has no exit. The Mall that venerates consumerism, glorifies body mutilation and robotizes its employs as mechanic slaves.The Mall employs the video gamer logic from Scott Pilgrim vs. The World, most prominent in the scene with the elevator death-trap. References to Through the Looking Glass litter the whole novel as evident from the satire aimed at consumerism and the ideals celebrated in the under-mall. The Mall is high concept in its approach as to how it presents materialism and the hunger for hoarding and the itch to own.Shoppers function as celebrities, whose purpose is to consume as Rhoda’s skillful narration demonstrates. Body image is taken to extremes with starvation and obesity as ideals of beauty and the advertising business promotes the true face of these ideals. In the under-mall, people have accepted the damage and seek more damage. The juxtaposition between the honesty and the familiarity of the advertising methods is what makes the under-mall so startling.Although not entirely accurate, The Mall pays homage to body horror through the use of cell phones as extensions of both Rhoda and Dan as well as the main weapons the Management of the under-mall to tease and spook. As the couple descends further down in the mall’s depths, I felt how much they relied on their phones, on the reception and the time display and how with every sub-level their phones betrayed them, stripping Dan and Rhoda from their sense of time and becoming weapons for the Management.The Mall’s atypical structure accommodates the ‘What Happens After’ segment, where Dan and Rhoda have escaped the under-mall and are faced with the normalcy of Joburg [as normal as Joburg can be]. I risk spoiling the novel, by giving away succulent character development. I’ll say it this way, S.L. Grey answer the question ‘What if the victims enjoyed running from monsters and evading fatalities?’ The answer warped all my expectations from horror as genre and proved to me that horror is more than shock and screams.The Mall is a catalog of horror. It’s universal as malls around the globe. It will have you look with distrust your cell phone the next time you receive a text."}, {"userName": "Maraya21 (The Reading Dragon)", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/40949835-maraya21-the-reading-dragon", "userReview": "This is currently  ON HOLD .I will continue reading this at a later time.Original start date: October 27, 2017Put On Hold: February 23, 2018"}, {"userName": "Lauren Smith", "userReviewDate": "Nov 28, 2010", "userURL": "http://www.goodreads.com/user/show/2109160-lauren-smith", "userReview": "Review first published on my blog Violin in a VoidRhoda was supposed to be babysitting someone’s kid, but she lost him when she left him at Only Books in Highgate Mall while she went to score crack from her dealer. Dan’s an emo bookseller at Only Books. He hates his manager, he hates his job, he hates his life. He also seriously pisses Rhoda off when he tells security that he didn’t remember seeing her with any kid, because he didn’t think that a scruffy-looking black woman with a scarred face would be with a “respectable” white child. So when the mall closes and Rhoda still hasn’t found her charge, she hunts down Dan, twists his arm (literally) and forces him to help her look for the boy. Dan leads them through the service corridors of the mall, but instead of finding the child they’re forced deeper and deeper into a disgusting otherworldly building, driven on by sick spam sms’s that threaten their lives and their sanity, and followed by a slavering beast preventing them from ever turning back.The Mall is the debut novel by S.L. Grey – the pseudonym for the collaboration of authors Sarah Lotz and Louis Greenberg. They wrote The Mall in alternating chapters, with Greenberg writing Dan’s chapters and Lotz writing Rhoda’s, but with the necessary crossover editing and rewriting that befits a collaboration. In the writing process they’d often leave their characters in difficult situations that the other would have to write their way out of.This leads to some incredibly tense scenes, but admittedly it also makes the transition between chapters a little jerky. New chapters often don’t start quite where you expect them to, and there are a few small errors in continuity. Nevertheless that doesn’t prevent it from being an awesome horror novel. It’s genuinely creepy at times and utterly horrific. I was glad I no longer work at a bookstore in a mall, or I’d get nervous about working the night shift and having to leave through the back door.The service corridors that Dan and Rhoda enter become increasingly surreal and sinister. The bowels of the mall and are reminiscent of Silent Hill – coated in rust, soaked in blood and God knows what else (but it’s best not to ask). And there are mutilated bodies, lots and lots of mutilated bodies, from mannequins showcasing torture, to amputees and cripples with seeping wounds. Then, in an otherworld version of the mall, there are ‘Shoppers’, deified consumers disfigured by hideous plastic surgery, traipsing around in the hottest fashion, forced to keep shopping or risk being “recycled”.It’s part of The Mall’s brutal stab at consumer culture. In the otherworld mall, everything glitters and gleams like it does in the real world, but all the glossy marketing has been scraped off. Lonly Books sells titles like Jesus Wants You to be Pimp-Rich; McDonalds is re-envisioned as the thoroughly disgusting McColon’s (I don’t know if I can eat a Big Mac again); and models in adverts are grossly starved and sickly. The stores all have twisted names like Curl Up & Die (a hairdresser) or Last Call (a cellphone shop). This mall is always open and there’s nothing outside of it.With its satire, the otherworld mall is the coolest part of the novel, spoilt only by Rhoda and Dan’s failure to realise that they haven’t escaped. Despite what they’ve already been through they try to fit this surreal mall into their idea of a normal world, imagining, for example, that the strange store names are bad marketing decisions or inappropriate attempts at counter-culture advertising. Dan is particularly slow to catch on, but it’s crystal clear to the reader that this is another dimension of horror altogether and you wait anxiously to find out what will happen next.The ending is surprising, as the novel abandons the visceral horror of the preceding chapters for something more cerebral. Initially, it disappointed me, because my horror diet has consisted almost entirely of nerve-destroying zombie movies and films like The Ring­. However, the more I thought about it the more impressed I was, and it’s the kind of ending you’d ask anyone who’d read the novel about.The Mall will be out in stores on 1 June, and I suggest you buy a copy and read it asap. It’s creepy, gruesome, satirical, and even though its protagonists aren’t exactly heart-warming (Rhoda’s a foul-mouthed, bad-tempered drug addict who can’t even remember the name of the kid she was looking after, and Dan’s, um, emo) you’ll like them anyway and hope they don’t get tortured."}, {"userName": "S.A. Partridge", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/2783993-s-a-partridge", "userReview": "The Mall is the debut novel of S.L. Grey, the pseudonym of established South African writers Sarah Lotz and Louis Greenberg. It’s not so much a horror story, as the cover image might suggest, as it is a reflection of the darker side of humanity.Rhoda needs to get to Highgate Mall as soon as possible to score cocaine from her dealer. She’s supposed to be looking after someone else’s child, but decides to take the kid with her, thinking she won’t be more than five minutes and what’s the worst that could happen? The worst in this case, is that she loses the child, beats up a mall security guard, and has to stay hidden until the mall closes or risk being arrested.She decides to centre her rage on Dan, a slacker bookshop employee that didn’t back up her story when he was interviewed by security. She waits until Dan’s shift ends and forces him by knifepoint to help her search for the missing child.The dynamic here is interesting. Crime is part of everyday South African life. Rhoda is a disfigured junkie who gets what she wants through violence. Dan, on the other hand, has been walked over his entire life, and readily submits to Rhoda’s threats without fighting back. The two make an unlikely pair, but it’s the horror of what comes next that unites them.During their wonderings of the cavernous tunnels and storage rooms that constitute the mall, Rhoda and Dan find themselves in an “alternate” mall where McDonalds has been replaced by McColons and the chemist is called Medi-Sin. It’s a nightmare world where Shoppers have to shop ‘till they drop, and mind-controlled employees are chained to their desks.But it’s not the horror of bloody meat dripping from its plastic packages or shoppers undergoing gruesome amputations for the sake of fashion that provides the biggest chills. The horror comes in the form of the novel’s take on the human condition.The alternate mall hides nothing behind bright lights and pretty store displays. It describes, sometimes with comic brilliance, what a consumerist nightmare the real world is, and what human beings are actually capable of. In their quest to escape, Rhoda takes on the guise of a Shopper. She realises that she wants to be superior to others as this is how she views herself.Dan becomes an Employee. At first he believes its all part of the game, but secretly he wants to be subservient and to please others. They adapt to these roles as if they were born for them. The alternate mall gives them a purpose that they were deprived of in their other lives. Soon the missing child is forgotten, and by the time Rhoda and Dan reach the exit, they’re not sure they want to leave. Reading The Mall, you might experience the sensation of déjà vu. It’s all too real, somehow. Then you realise that the twisted mirror on real life was nothing more than plain glass all along. That’s the beauty of this work. It portrays real horror, but it’s the horror of real life and the ugly beast that is consumerism."}, {"userName": "Sarah", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/11818290-sarah", "userReview": "3/07 - I've already read S.L. Grey's second book The Ward and the first thing I thought, after reading the first paragraph, was \"Ok, there's a lot more swearing in this than there was in the other book.\" I wonder about the difference in the language between the two books. The plot is nice and scary (a blind scraping on the windowsill nearly gave me a heart attack while reading in bed last night) and I'm being drawn in by the mystery of what the evil entity with the crazy texting fingers is. Is it going to be a twist like in The Ward, or the more obvious demon/trickster type of character? For the evil texter (if it's a seperate entity from the presence following them through the deserted corridors, that is) I'm imagining a cross between an evil leprechaun and a ventriloquist's dummy with an evil laugh (maybe even a pair of them). I have no current predictions on what the lurking presence might be or what the mannequins might have to do with anything. Either way I'm looking forward to continuing the story tonight and finding out. To be continued...4/07 - As soon as the shop girl, Colt, called Rhoda and Daniel 'browns' I knew that we were talking about the same evil beings as in The Ward - very weird aliens trying (and failing) to assimilate into the human population by attempting to dress like us while using us 'browns' for spare parts, among other terrifying uses. To be continued...5/07 - I don't understand the need Rhoda and Daniel felt to go back to the 'other mall'. Rhoda obviously didn't understand what was going happen to her once it was time for her to start paying her debt, shopping isn't free forever. She'll be dreaming of going back home to her parents once they start chopping limbs off. Obviously it was a convenient solution to Daniel's immediate problem of going to jail for murder, but how much less of a jail cell will it be for him to be 'plugged in' as a shop boy for the rest of his life, not even allowed to think his own thoughts. The Ward is a good sequel, it doesn't have any of the same characters but it short of shows the progression of 'browns' from normal everyday people to shoppers or shop assistants to the donors once they have to start paying their debts. I'll be interested to see what Grey's third book brings."}, {"userName": "Danielle", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/24502058-danielle", "userReview": "3.5 starsI really thought I was going to hate this book when I first started it. It was such a typical 'judging a book by its cover' or more so 'judging a book by its lack of reviews and hype' situation and I almost didn't continue after 50 pages but I pushed myself to read another 50 pages on my break and work and slowly I realised I was actually really into the story! So it's definitely not the best written novel in the world but the plot was great (even if it was similar to Horrorstör) and the characters were unusual and not your typical perfect protagonist. They made mistakes and they were problematic which I loved. I don't often read horror novels but I really wanted to read at least one for October and I'm so glad I picked this up! Not only did it have its creepy moments but it was also just disturbing and it has this almost anxiously uncomfortable vibe running the whole way through it. The ending was great too, it wasn't at all what I was expecting, I feel like perhaps there could have been a bit more explanation but the last line was perfection. Would recommend for sure! (Also side note- I've mentioned before how The Mall and Horrorstör were alike, well it turns out that two years ago to this exact date of me finishing The Mall was the same date I finished reading Horrorstör! What a coincidence!)"}, {"userName": "Cyna", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/4171731-cyna", "userReview": "Well, this has definitely been the most original of the books I’ve read this season. The Mall is the tale of two very different people who find themselves trapped together in the bizarro-nightmare version of their local shopping center. It’s weird, gross, and gory, and as one might expect from that premise, centers around vague social commentary and a totally OTT horror-ization of consumer culture, which is in actuality the least interesting thing about it. That is clearer in hindsight, though, because The Mall is very compelling as you read it, thanks in equal parts to stellar characterization, snappy pacing, and great momentum.So, characterization. Narration duties for the novel are shared by two characters, Rhoda and Dan. Rhoda is a drug addict, out at the local mall to score her next fix when the kid she’s been tasked with watching for the night disappears. After a series of, let’s be real here, totally racist incidents with the mall security guards (Rhoda is a black woman, and The Mall is set in South Africa) Rhoda winds up taking Dan, a sulky, sad-sack shop clerk, hostage and forcing him to help her look for the child.Right from the start, I enjoyed the narrative set-up. Rhoda and Dan have engaging voices, and it was interesting to see the same interactions from opposing viewpoints. Plus, they felt like actual fucking people. Not necessarily the usual gold-star squeaky-clean protagonist types, but real characters, with relatable problems, who aren’t instantly condemned or set in to a predictable narrative arc because of them. Basically, they’re – gasp! – multi-dimensional characters, and they are continually developed and fleshed out as the book goes on.The first, I dunno, third or so of The Mall focuses on Dan and Rhoda’s efforts to find the lost child in the passages behind the shops, where they wind up having to navigate an increasingly bizarre and spatially disorienting maze dotted with unsettling and grotesque imagery, whilst being pursued by a violent and disgusting-sounding monster that they never actually see.This is exactly the kind of horror that I’ve been looking for, and it is hands-down my favorite part of the book. The Mall was meant to scratch my Silent Hill itch, and for like a hundred pages or so, it totally does. They’re basically running around the dirty, viscera-spattered Otherworld, and the obstacles that they have to face, set up as a series of game show-esque challenges geared towards forcing them to confront their greatest fears and personal traumas, are exactly the sort of mind-fuck shenanigans that Silent Hill is known for. I love it. It’s a great set-up, a great way to blend the horror elements and allow for character-developing backstory to come out more naturally.Thanks to this, I was significantly more invested in the moments where Dan and Rhoda were in peril, which is pretty vital to the success of a horror story. The emotional stress was well-handled, and the book was just off-kilter enough that I was never sure how solid the bulletproof protagonist immunity actually was. It kept me reading, because I wanted to know what was going on, why this was happening, where they were being led. I was totally involved, interested, invested, riiiight up until we hit phase 2.This is the part where Rhoda and Dan end up in the Otherworld version of the mall proper, a bustling hive of activity where workers are chained to their posts, brainwashed to be robotic caricatures of the perfect retail employee, perpetually polite and helpful to Shoppers, people chosen arbitrarily to consume. Shoppers are treated like celebrities: they’re catered to, given the finest clothes, make-up, apartments, soaked in materialism until all of their thoughts revolve around acquiring things, and all they can think about is what to buy, or where they’ll find the next big “sale”, even though it’s all even more meaningless than usual, since there is no actual monetary system in place for Shoppers.The whole enterprise is overseen by the sinister and bureaucratic “management”, who select and monitor Shoppers and Workers, and are also apparently responsible for the texts that lured Rhoda and Dan in.This is focal point of the story, but again, it’s the least interest part. It’s basic and broad, all bad puns and a cartoonish, exaggerated consumerism that would make Romero look subtle. To be fair, though, subtle is probably not what they were going for, and even though the effect is like going from Silent Hill to an episode of Tales from the Crypt, I do at appreciate that they were at least trying to say…something.What I don’t appreciate is the rampant ableism and body-shaming/general dickery that The Mall uses to make its point. The whole idea of the nightmare mall is that every aspect of it is over the top and repugnant. “Grotesque” is a word that I’m probably going to use a lot here, because it’s a spot-on encapsulation of what the mall is meant to be. Unfortunately, the physical appearance of its inhabitants is the means by which The Mall chooses to communicate this.While some Shoppers are cartoonishly overweight consumption machines (so gross!!11!1!), the majority are skeletally thin and missing arms and legs, having been nipped, tucked, and surgically altered to fit the Mall’s horrifying standard of beauty. Body modification and eventually outright self-mutilation is common among employees and lower-tier consumers, who are encouraged to live up to the standard set by the celebrated Shoppers, who themselves are threatened with the vaguely ominous fate of being “Recycled” should they fail to conform.So yeah, I get that culture in the Mall is meant to be a funhouse mirror reflection of our own. The problem is that the horror of the Mall’s culture is completely separate from the characters’ attitudes towards its inhabitants, who are labeled “freaks” for their physical differences even before the characters come to understand that they are self-inflicted. There’s no empathy for the people here – outside of the one “normal”, conventionally attractive shopgirl that Dan wants to fuck, and that should tell you just about all you need to know about The Mall‘s attitude on the subject – just villianization and an endless supply of fake tit and botox jokes.It also doesn’t help that the characters use r-word every two fucking sentences, or that there’s a gross, pervasive misogyny that only gets worse as the book goes along.At any rate, the in-mall portion of the book just isn’t as good as I was expecting or hoping for. It hops around making a bunch of unrelated social observations, and climaxes in our characters fighting to keep from losing themselves to the roles they’re assigned, and escaping the mall.This is where it gets interesting, though. Right at the point at which most books would end, The Mall begins its third act, in which the characters have to re-adjust to life in the real world, and cope with how they’ve been changed by their experiences. I liked this. It was unexpected, and I appreciated the willingness to explore some messy ideas that fall outside the conventional narrative structure. In this segment, the horror isn’t in an external threat, but in what the characters have internalized, and how it has changed them.Rhoda fares best, her experience in the Mall curing her of the physical side affects of her drug addiction, and leaving her uninterested in the emotional ones. She’s finally able to deal with some of the anger and resentment that drove her to turn to drugs and run away from her family, and seems to be on a path towards reconnection and a better life. She is, however, haunted by the memory of being a Shopper, of being important and catered to and admired.Dan, on the other hand, turns into an asshole. Straight up. He completely tanks any sympathy you’ve developed for him by morphing from a sulky, timid emo kid into a brooding loner asshole. See for yourself...(long quotes incoming)Read the rest of the review at You're Killing.Us"}, {"userName": "Monique Snyman", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/9107546-monique-snyman", "userReview": "At first, I thought this would be another yawn-fest. Kid gets lost, unlikable babysitter needs to find kid, unlikable loser can't remember kid being in the store... blah, blah, blah... You know, the type of books that really shouldn't be categorised under horror/thriller? Well I was wrong. It took me a while to get into the book, but when I was past the first couple of chapters things quickly changed and I was drawn into The Mall's bizarre twists and turns. The spooky atmosphere jumps off of the pages, envelops the reader in its shroud of mystery, and then screws with the reader's mind just for the hell of it. It's bloody brilliant! Like I said, it takes a while to get into the book, but by golly, once you pushed through the introductory chapters, you're going to be in for a ride of your life, coming straight from a seemingly unknown mall situated in Johannesburg. Not to mention, the mannequins (Doctor Who fans will remember how creepy mannequins can be), freaked me out! I'll never look at a mannequin the same way again. Okay, but The Mall isn't just about a weird horror story with creepy characters. S.L. Grey (a collaboration between Sarah Lotz and Louis Greenberg) actually has more to say than what meets the eye. With consumerism, drugs, violence, and negligence present between the lines, it's obvious that this book is much more intelligently written than similar horror novels. Granted, you don't have to dissect the book to enjoy it though...So, what did I think? Well, my suggestion is that you push through. It starts off a bit lame (the writing is excellent, the plot just kind of drags on for a while), but when you finish the book you're going to sit there and swear off mall's for quite some time. In other words, horror junkies, this is a definite must-read. (review originally posted on www.tentaclebooks.com)"}, {"userName": "Life After Undeath", "userReviewDate": "May 20, 2012", "userURL": "http://www.goodreads.com/user/show/9646986-life-after-undeath", "userReview": "Take two utterly unlikable characters, lock them up in a seemingly deserted mall and you have the basis behind SL Grey's The Mall.Rhoda is a supremely messed up addict with aggression issues who loses the child she was taking care of just as the mall is closing its doors. Daniel is the nerdy employee who she drags along on her mission to find this kid, whose name she can't remember. As the lights dim and they get deeper into the bowels of the mall, weird things start to happen that defy all explanation.The Mall is a fine example of the kind of talent that South Africa possesses. One half of SL Grey, Sarah Lotz, co-authored another novel, Deadlands, which I loved just as much as The Mall. The writing and dialogue is sharp and witty and the interaction and development of the two lead characters is brilliantly executed.This novel is genuinely spooky. I always had issues with malls after hours and, after reading this, will probably make a point to avoid them. Mannequins seriously freak me the hell out. More than Justin Bieber music videos. More than pajama parties at Neverland Ranch.The Mall is set in South Africa and some of our culture does shine through, but it easily stands on its own in the international market. I enjoyed the little cultural references and am glad the world is getting another view of the country besides Apartheid, AIDS and soccer.I give The Mall a rare 9/10 for awesomeness. Very excited about SL Grey's next novel, The Ward (due out in December). Many thanks to the authors for sending us a review copy!"}, {"userName": "Larissa", "userReviewDate": "Sep 10, 2011", "userURL": "http://www.goodreads.com/user/show/2410493-larissa", "userReview": "It was supposed to be a quick trip to the mall, make the deal, score a hit and get back before anyone noticed that she, and the kid she was looking after, were missing. But after returning from her dealer to Only Book, the store she left the kid waiting in while she made her transaction, she discovered the kid had disappeared.A run in with mall security should have been just what she needed, they would find the kid and she could leave, however they are not as helpful as she hoped. Worse still they are threatening to call the cops and with the stash in her pocket there is no way she is going to risk getting taken in. To find the kid she is going to have to take matters into her own hands.When he left for work that morning he never imagined his day would end being held at knife point by a drugged up girl, forced to search behind the scenes at the mall for a kid that has probably already been found is long home by now. But as the detour through the mall becomes more and more dangerous and surreal, he realises he has more important things to worry about.The mall became a labyrinth, it shouldn't have been possible, he knew the mall and none of these turns and corridors existed. But here they were being chased by monsters in the dark, stumbling over dismembered mannequins and being confronted by a distorted version of reality. Suddenly getting out is not a question of how by why.The Mall is a gritty, raw and provocative story that turns society inside out and strips it down to expose its discarded, scared and rotting core. Through drugs, violence, consumerism and days spent in a nightmare world on the run for their lives, Rhoda and Dan discover that the life they once had is no longer the life they wish to lead. A thought provoking and chilling read."}, {"userName": "Carrie Clevenger", "userReviewDate": "Oct 23, 2012", "userURL": "http://www.goodreads.com/user/show/4076780-carrie-clevenger", "userReview": "With a seemingly standard opening, (lost kid) SL Grey drew me in thinking it'd be a read I'd most likely abandon midway from the yawn factor. No. Scary by page 40, it sucked me in until the end with twists and turns, coupled with so many bizarre (albeit greatly-detailed descriptions, yeek) circumstances I was intrigued enough to keep going. It's fast-paced with a delicious lull, just enough to get you all comfortable until the real game begins. My nitpicks are few about this book because from what I noticed, the editing was very tight and concise with little waffle or fluff and a keen razor edge style. However, there were a few instances where facts established in the story contradicted one another (it could have just been me, you be the judge) and oft-times I felt like smacking the characters over the head with a Duh Stick. Yes, it's a screwed up horrific alternate mall. Stop being so dimwitted.But really, how would I react in a situation as grotesque and unbelievable as that? I can't say I wouldn't try to fool myself either.The characters themselves, Daniel and Rhoda, go through a tremendous amount of change throughout the course of the story in a nod-your-head-makes-sense manner and are very personable. Recommended for those who not only like horror, but horror with a bit more substance and culture beyond your usual slash-and-gore fare."}, {"userName": "Krystal", "userReviewDate": "Oct 18, 2013", "userURL": "http://www.goodreads.com/user/show/18989854-krystal", "userReview": "So I was reading this creepy book about scary things that happen in the mall when it closes for the night, and then I had to work a late night close and when I finished it was dark and creepy and all my usual exits were blocked off and I kind of wanted to run screaming down the empty corridors.This book had me thoroughly creeped out at times, and was an addictive read. It's got that great, ominous beginning where you're not quite sure what's going on and I think if I hadn't accidentally read the sequel to this one first I would probably have had a major 'wtf is happening here' moment. Nowadays when things are THIS bizarre it's usually 'just a dream' or something like that which is always disappointing. But this commits to its ideas and it's alternate world is strangely attractive. The down side for me is more just the language- as I'm not South African (the book's setting and, I assume, the author's nationality) myself I found all the 'ja's and things a bit strange. And I had a hard time connecting to the characters but I must say they were developed brilliantly because by the end of the book I wanted what they wanted. Great read; if you are open minded to the bizarre it should be thoroughly entertaining."}, {"userName": "Lu (Sugar & Snark)", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/2049296-lu-sugar-snark", "userReview": "What a strange and creepy book! Dan is tired of his life which seems to revolve around work and his mother. Rhoda is a fish out of water that gets stuck babysitting a young boy, only to lose him in The Mall. The Mall then throws their lives together in a weird mash of events. They are both very different characters who get caught up in a roller-coaster ride of things going wrong. It starts off on a scary note and soon became one of the weirdest books I had ever read! Rhoda and Dan are both characters I liked and I was really rooting for them. But more importantly I really wanted to know what the hell was going on!Who knew a mall could be such a creepy setting? I kept imagining all the locations they kept finding themselves in – and even though they ranged from the mundane to the bizarre, I could see it all unfold. There were some truly terrifying moments and some that made go: ‘Wait what?!’Definitely one of the most unique reads ever! Filled with satire, terror, bizarre events and ‘ah ha’ moments. I recommend this to anyone who likes reading something a little different!This got a 7/10 from me."}, {"userName": "Demi", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/28873377-demi", "userReview": "Plot: ⭐️⭐️⭐️⭐️Characters: ⭐️⭐️⭐️World Building: ⭐️⭐️⭐️⭐️Twists: ⭐️⭐️Enjoyment: ⭐️⭐️⭐️⭐️Okay, so for the most part this book was bloody brilliant and had me glued to it.In-fact, it was almost a 5 star book until it got to \"book two\" where for a little while it just turned into a completely different book.\"Book One\" was so full of suspense and made my imagination go crazy, and my heart was genuinely thumping. \"Book Two\" was rather mild in comparison and dealt with the \"situation\" at a completely different angle.The world building was fantastic and I had no trouble at all imaging what I was being told.The downfall is, I was left with many, many unanswered questions after finishing this book.I do know that this is a \"trilogy\", even though I suspect it is actually just three companion novels. I'm hoping that as the books go on, my questions become answered.I would however, completely recommend this book!"}, {"userName": "Kylie", "userReviewDate": "Sep 26, 2013", "userURL": "http://www.goodreads.com/user/show/5933912-kylie", "userReview": "I found it hard to rate this, because while I didn't like it very much it did stop me from putting it down as I wanted to know what happened.As to why I didn't like it, well I'm not a huge fan of body horror, particularly when it's used as a form of social commentary or satire (as it was here in the 'other mall'). Also, I was a shade disappointed that we never get to learn the why and how of it all. Granted, sometimes things can seem more scary when you don't know why something is happening - but likewise it can seem as if the writer hit upon what they thought was a cool idea and just go with it without thinking. The one great thing is the characterisation; you start off with two characters you don't really like, and then over the course of the book start liking them and caring what happens to them. Which is more than I tend to get in the average horror film."}, {"userName": "Andy Sean", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/5148417-andy-sean", "userReview": "This is the first time I heard of S L Grey. Prior to my purchase, I was a little skeptical about the title. You know those cheap horror stories of being locked in a mall, the mannequins come alive and you're being chased down the corridor by those creepy stuffs. But hey, The Mall is totally new-level-thing. Let's just say it's a mix of horror + psychological elements that will keeps you turning the page to the end.Took me few days to get to the middle but once I reached the middle, took me one night to complete the other half. You will be thrilled by how the story twists and how the story actually ends.S L Grey looks like a promising writer. Looking forward to more of his \"disturbingly adrenaline pumping\" books."}, {"userName": "Nerine Dorman", "userReviewDate": "Feb 21, 2011", "userURL": "http://www.goodreads.com/user/show/1611208-nerine-dorman", "userReview": "What more can you ask from if you're looking for an off-the-wall romp that pokes fun at retail and residential hell, all in one? Two misfits, Rhoda and Daniel, form an unlikely partnership when they slip into the Other Mall that exists as an infernal mirror of Highgate Mall in Joburg. While the author went on a limb creating two thoroughly unlikeable main characters, I found I was nonetheless cheering for them by the end of the story in all their glorious personal dysfunction. Although the tale is at times funny there is, however, a fair amount of social commentary going on. At the end of the day, how far will you go to be accepted for who you really are? And, then again, who are you really? A product of your environment or someone who can move beyond others' preconceptions?"}, {"userName": "Judy", "userReviewDate": "Nov 07, 2013", "userURL": "http://www.goodreads.com/user/show/4129245-judy", "userReview": "Deliciously creepy. I hate malls so this book just fed into my nightmares. I loved the idea of sealed off corridors and abandoned food courts. I loved Rhoda's voice and Daniel's contrast. The way that they both changed due to what happened and also how they were changed by each other. This is the type of horror that gets to me. Not the horror of hacked off limbs and blood spewing everywhere. This is the horror that gets under your skin. The idea that there is another world that exists besides this one, and that one day you might turn around the wrong corner and find yourself trying to survive. Just awesome."}, {"userName": "Taha", "userReviewDate": "Jul 11, 2015", "userURL": "http://www.goodreads.com/user/show/25225808-taha", "userReview": "Çok ugrastim ama 100 sayfadan fazla okuyamadim maalesef. Kitabin gectigi mekan cok karmasikti bi kere. Kitap sozde AVM'de geciyor ama karakterlerin 100 sayfa boyuncagezdikleri yerler AVM'nin neresiydi anlayamadim. Keske bir harita gibi bir sey olsa bile dedim kendi kendime.Kitap boyunca iki bas karakterimiz bir seyler duyuyorlar, birileriyle karsilasiyorlar ve bir yerlere girip degisik birseylerle karsilasiyorlar. Ama bunlar ne insani geriyor ne de kitabin devami hakkinda meraklandiriyor.Kitabi okuyup bitirmekten vaz gecince son 10-20 sayfasini okuyup sonu nasilmis ona bakayim bari dedim. Ve anladim ki bu kitabi bitirmekle ugrasmamak bu hafta aldigim en iyi kararmis:)"}, {"userName": "William", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/4615473-william", "userReview": "This is the most genuinely creepy book I have read in ages. I think what I loved most was the lack of any overly-familiar supernatural antagonist. Not a zombie, werewolf, vampire, or ghost to be found. What does that leave? Think Silent Hill and you might have the right idea. I will definitely be reading the other books (The Ward, and The New Girl) in what I understand is a loose trilogy--probably multiple times. I am now officially a fan of this collaborative duo."}, {"userName": "Darlington30", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/32820930-darlington30", "userReview": "Great little gem from the horror genre. Goes from a Saw/slasher story to a Clive Barker horror realm. Nice feat. Didn't read too much into the overwrought satire. One star off due to a surprisingly dud ending. Still a fun ride, though. Very innovative."}, {"userName": "Tiah", "userReviewDate": "Jun 27, 2011", "userURL": "http://www.goodreads.com/user/show/943435-tiah", "userReview": "Not normally my style. Creepy / gross yet fun. However, as somebody who likes 1984 I thought I'd give it a go. Read it on the Kindle while travelling on various airplanes. A much safer place to read it than a home with stairs. . ."}, {"userName": "Chloë Yates", "userReviewDate": "Feb 05, 2014", "userURL": "http://www.goodreads.com/user/show/5415056-chlo-yates", "userReview": "Bloody Brilliant stuff! Wonderfully and mentally inventive. You have to read it. I'm not kidding!"}, {"userName": "Lynne", "userReviewDate": "Apr 18, 2011", "userURL": "http://www.goodreads.com/user/show/2984877-lynne", "userReview": "This is as original as it gets!! Once you start ... there is no stopping until the final page! It is a dark creative spark in the world of fiction."}], "description": "Dan works at a bookstore in a deadly dull shopping mall where nothing ever happens. He's an angsty emo-kid who sells mid-list books to mid-list people for the minimum wage. He hates his job. Rhoda has dragged her babysitting charge to the mall so she can meet her dealer and score some coke. Now the kid's run off, and she has two hours to find him. She hates her life. Rhoda bullies Dan into helping her search, but as they explore the neon-lit corridors behind the mall, disturbing text messages lure them into the bowels of the building, where old mannequins are stored in grave-like piles and raw sewage drips off the ceiling. The only escape is down, and before long Dan and Rhoda are trapped in a service lift listening to head-splitting musak. Worst of all, the lift's not stopping at the bottom floor. Plummeting into the earth, Dan and Rhoda enter a sinister underworld that mirrors their worst fears. Forced to complete a series of twisted tasks to find their way out, they finally emerge into the brightly lit food court, sick with relief at the banal sight of people shopping and eating. But something feels different. Why are the shoppers all pumped full of silicone? Why are the shop assistants chained to their counters? And why is a cafe called McColon's selling lumps of bleeding meat? Just when they think they've made it back to the mall, they realise their nightmare has only just begun...", "title": "The Mall\n      \n          (Downside #1)", "url": "http://www.goodreads.com/book/show/17032810-the-mall", "average": 3.59, "cover": "https://images.gr-assets.com/books/1355846701l/17032810.jpg", "reviews": 139, "authors": [{"url": "https://www.goodreads.com/author/show/4477070.S_L_Grey", "name": "S.L. Grey"}], "type": ["Horror", "Fiction", "Thriller", "Fantasy", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/17032810-the-mall", "http://www.goodreads.com/book/show/9760701-the-mall", "http://www.goodreads.com/book/show/13162943-the-mall", "http://www.goodreads.com/book/show/10089672-the-mall", "http://www.goodreads.com/book/show/18158567-the-mall", "http://www.goodreads.com/book/show/15754594-avm", "http://www.goodreads.com/book/show/29663071-the-apartment", "http://www.goodreads.com/book/show/15060759-the-ward", "http://www.goodreads.com/book/show/21416716-under-ground", "http://www.goodreads.com/book/show/18361137-the-new-girl", "http://www.goodreads.com/book/show/27778711-three-books-by-s-l-grey"]}