{"ratings": 1, "userreviews": [], "description": "This historic book may have numerous typos and missing text. Purchasers can usually download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1920 edition. Excerpt: ... INTRODUCTION. The Human Equation In The Making Of The Peace Treaty. Much misconception exists and many misstatements of fact have been made regarding the reparation and economic sections of the Treaty of Peace --clauses vital to the interest of the American people and even more vital to world stability. As I was intimately concerned with the creation of these sections, my purpose herein is to set forth the problems which the writers of the sections had to meet and why they met them as they did rather than in the various ways suggested by present-day critics. Before, however, the subject matter of the clauses in question is presented to the reader, it is essential that he should have a mental picture of the conditions under which they were brought into being. The mightiest conflict of mankind had just come to an end. The cannon's sound had but lately died away; the shock of battle was still upon the world; the aroused primitive passions of nations and of men had only in a small measure subsided; the world's wounds still bled. Within a few hours' travel from the Peace Conference were the battlefields upon which lay 900,000 dead Englishmen and colonials; 1,300,000 dead Frenchmen; and the bodies of hundreds of thousands of other Allies. On these fields had been sustained the grievous wounds of many millions of living men. From wantonly devastated France had not departed the fear and inherent hatred of the enemy who but a few months before had pierced almost to her heart--the traditional enemy who had brought upon her the bitter days of 1870. With the World War already history, the shadow of the Prussian still hung over the Republic. France was fixed in her determination to erect an impregnable wall, economic or geographical, or both, against...", "title": "The Making of the Repartion and Economic Sections of the Treaty", "url": "http://www.goodreads.com/book/show/20281028-the-making-of-the-repartion-and-economic-sections-of-the-treaty", "average": 3.0, "cover": "", "reviews": 0, "authors": [{"url": "https://www.goodreads.com/author/show/5768330.Bernard_M_Baruch", "name": "Bernard M. Baruch"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/20281028-the-making-of-the-repartion-and-economic-sections-of-the-treaty", "http://www.goodreads.com/book/show/1123603.Baruch", "http://www.goodreads.com/book/show/6519794-a-philosophy-for-our-time", "http://www.goodreads.com/book/show/16038620-the-public-years", "http://www.goodreads.com/book/show/2669568-american-industry-in-the-war", "http://www.goodreads.com/book/show/162120.Extraordinary_Popular_Delusions_and_the_Madness_of_Crowds"]}