{"ratings": 7809, "userreviews": [{"userName": "Amalia Gavea", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/56789747-amalia-gavea", "userReview": "‘’The silence at the beginning of a piece of music is always different from the silence at the end.’’\nThe blurb of this beautiful book contained two words that won me over on the spot. ‘’Music’’ and ‘’1980s’’. I was born in 1985, so technically, I am a child of the 90s, but I think that these two decades share the same spirit of a certain kind of innocence, before the coming of the new millennium and all the ‘’gifts’’ it brought (yeah, right…) I’m not a big fan of the music that conquered the 80s, but when I happen to listen to a chart-hit of the era, I travel back to my childhood and the parties when we were 9-10 years old.Joyce pays homage to the beauty of the vinyls, the nostalgia that is connected with them, before the shiny CDs took over. Personally, I never liked cassettes, although God knows we had more than we could count. In this story, we find ourselves in London, during the last years of the 80s and in a music shop that sells vinyls exclusively. Frank, the owner, is surrounded by a quirky set of characters who aid him in his struggle to keep the spirit of the neighbourhood alive against modernity. One day, a lovely young woman, wearing a green coat and with her hands hidden in gloves, faints right outside his shop. And his life begins to change.Now, the blurb may make us think that this is going to be a light, carefree read. Essentially, a romance. It isn’t. Not entirely, at least. And most definitely, it is not a romance. It is a story that contains a heart-warming, tender, well-constructed relationship, but to call it a ‘’’romance’’ wouldn’t do it justice. In my opinion, this is Contemporary Quirky Fiction at its best. (...I just made up a genre in order to justify my silly definition, but anway…) Each character, from Frank to Ilse, to the various customers who have been helped by him, is integral to the story. There are personal stories of sadness and pain, of hope and joy and remembrance, people trying to soothe their wounds and keep the memories alive through music. This is what Frank regards as his mission.The characters of Frank and Ilse are the best example of how an author can create a romantic relationship that will touch even the sworn enemies of anything romance-related (...that is moi…) Frank is loyal to his job, somewhat a loner in the extreme, and perhaps a bit too empathetic and stuck to the past. A realistic protagonist that you wish you had as your friend back in that day. Ilse is sensitive, bright, kind and with a heavy dose of mystery trailing behind her.Initially, I thought there would have been an element of magical realism in her, that’s how ethereal and mysterious she seemed. Father Anthony (loved him to piece, he is everything a priest is supposed to be), Kit and Maud consist Frank’s ‘’gang’’ and they are as sympathetic and weird as you can get. Maud wasn’t much to my liking, I didn’t have any sympathy for her attitude, but to each their own…I am a bit of a potty-mouth myself, but she seemed to be continually disrespectfulJoyce writes in a manner that is immediate, fresh and lyrical at the same time. She provides a treat for every lover of music. At the mention of every composer, every singer, every band, I could hear the notes partying (or waltzing or praying) in my head. I was reminded of all the extraordinary music creations the human mind has conceived. Even the quality pop-rock of the 1980s and the 90s...So it triggers a major level of nostalgia for an era when a singer didn't have to appear on stage, dressed only in the underwear or in a meat-dress in order to become famous or to make up for the lack of any talent. I give extra points for the reference to ‘’Beata Viscera’’, my favourite hymn to the Virgin Mary. Also bonus points for what I consider the most beautiful piece to come from Iceland, 'Heyr, Himna Smiður'.For me, the major question of the novel has to do with the strength of our principles. Frank refuses to go with the flow, if it means betraying his ideals and all he is living for.Why should modern times demand of someone to become an altogether different person? Why should we offend what we don’t agree with and look down on those we consider ‘’old school’’? This is very relevant in our current times with politics, religion, society in general. Some of us stick to certain values. If others consider it ‘’Ancient History’’ that’s all very well, but respecting different opinions should be a bidirectional thing. So, as you see, this book definitely gives you plenty to think about.This is a book that will appeal to practically everyone. The music lovers, the fans of the 80s, the followers of the vinyls, the Londonphiles, the readers who wish for a contemporary read with something to say and themes we can all relate to. I even forgave the somewhat ‘’cheesy’’ ending:)\n‘’I heard the things you told me. The birds and the storm and a dog barking. I heard a summer day.Thunder. I heard the wind. People slipping on ice, and then falling asleep by the fire.’’\nMany thanks to Random House and NetGalley for this ARC in exchange for an honest review."}, {"userName": "Julie", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "The Music Shop by Rachel Joyce is a 2018 Random House publication. A quirky, but sweet love story wrapped inside a loving ode to music-I love stories like this one where a group of people, from various walks of life, all of whom are misfits or eccentric in one way or another, but are kind and giving souls, converge to create a delightful and unique tale of friendship and love.  The music shop is the absolute perfect backdrop for such a story, reminding us of how important a role music, of all kinds, plays in our lives. The story is set in the mid-eighties, in London, where Frank has set up an indie music shop, in a neighborhood struggling to survive in rapidly changing times. As the story opens, we watch in fascinated awe as Frank shows off his unique talent of choosing just the right song for his customers, even if they are initially skeptical. He is never wrong and wins the utmost respect of his clients, who have discovered artists and songs they never would have otherwise, thanks to Frank. But, an ominous threat is hanging over Frank’s shop- CD’s. While vinyl is being aggressively shoved out of the way in favor of compact discs, Frank steadfastly refuses to sell them. He pays a high cost for his stubbornness as fewer people will work with him or they charge him more money for their products.But, life will turn on a dime, when a woman faints in front of his shop. Her name is Ilse Brauchmann, and she cast an uneasy charm on Frank, his shop, and in fact the entire neighborhood. From here, the reader will watch as Frank and Ilse form a wobbly relationship that slowly develops into something much more substantial. But, despite the sincerity and strength of those feelings, old abuses and disappointments may stymie their development and growth. Can they admit their feelings for each other or will unforeseen circumstance tear them apart for good? Movies often release soundtracks, so why can’t we do the same with books? How cool would that be? This book has a definitive musical backdrop that would make a great addition to anyone’s playlist, especially if you love the eighties. The music fit perfectly alongside the eccentric, damaged, and wounded souls in this story, who fight on moral grounds, who were like a family, despite their eccentricities. Some people adapt and change with the times, accepting the inevitable, while others fight against it with nobility, even if it ends up in futility. Yet, there are occasions, despite the odds, they still manage to carve out a niche for themselves, never having to sacrifice their own convictions. Frank was like that, and I admired his tenacity, in standing up to corporate pressure the way he did. I loved all the characters featured in this story, all of whom were flawed in some way, all with heavy burdens to bear, making it easy to sympathize with them. While the story has that oddball quirkiness to it, that whimsical and nostalgic quality that feels so charming, wry humor and a few laugh out loud moments, there is a dark undertone to the story, that our brain acknowledges, but it is so offset by the tone, the bark feels worse than the bite, but it hangs in the air like a thundercloud that refuses to dissipate. It does seem to take an inordinately long time before the sun finally pokes through those clouds. There was one issue I had with the story, which was the whiplash inducing slamming on of the brakes to one section of the story, disrupting the continuity- which left me feeling disoriented for a time. The momentum that had steadily climbed to that climactic moment, almost tanked. I felt like I had lost something significant in that vacuum of time. The warp speed of the last quarter of the book almost choked the life out of the hard- earned love and fragile emotions the reader had steadily built up to that point. However, the story did rally in a come from behind win, earning some redemption points with a sweet and tender conclusion that left me with all the warm and fuzzy feels. Ultimately, this is an offbeat, feel good story, and heaven knows we could all use more of those!! 3.5 stars rounded up"}, {"userName": "Paromjit", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is a wonderful novel set in the late 1980s London, that evokes the culture and music of the era, and the economic decline hitting local communities and the ever encroachment of developers threatening the identity of a place, and its people. In the midst of the change taking place is Frank, running his Indie Music Shop, welcoming everyone and drawing an offbeat crowd. The CD has taken off, but Frank is not interested, preferring vinyl, in which there is a current resurgence. Amidst the growing closure of local businesses, Frank stands by the strength of his convictions, an idealist in Thatcher's Britain that is geared to crushing idealism with its gods of ruthless capitalism and grasping consumerism. Frank is a kind and compassionate man, with a magical gift of honing into the piece of music his customers need, rather than what they may be wanting.German Ilse Brauchmann faints outside Frank's shop, she is destined to rock Frank's world. Ilse is a woman with secrets, getting married, dresses in green and is never to be seen without her gloves. We get a real sense of community as a raft of stories are unveiled about those who visit the store such as the bank manager, that include loss and other troubles that music helps and resolves, all thanks to Frank. Ilse's entry into Frank's life brings back his memories of Peg, his eccentric mother responsible for initiating and informing his unsurpassed musical knowledge. His problematic relationship with Peg haunts him. Frank gives music lessons to Ilse in a cafe, with a waitress that becomes invested in the blossoming love affair between the couple. Frank struggles to express his feelings to Ilse, which is ironic given how effectively Frank tunes into the feelings of others. This is a tale inhabited with a wide array of quirky characters, Maude the tattooist, Father Anthony, Kit and others, that charm and beguile. Frank and Ilse's relationship founders, years pass until Ilse returns to a changed landscape and people. Is it possible that love can be resurrected against all the odds with the power of music?Rachel Joyce writes a love letter to all that music can be in this lovely novel. It is a story of loss, love, pain, friendship, and community solidarity. A community that tries to support Frank, after he has helped them despite the wrecking ball to community support that are the developers in London. Above all else, it is about the healing power of music, its capacity to unite, ease trauma, evoke and access memories, inspire and help address our deepest needs. It forces Frank to connect with his past and with his feelings. It highlights how music is nothing without the silences, which have a power of their own. Joyce has a knack for creating a range of characters which cannot fail to engage the reader. Additionally, the book is bound to serve as an education in music to many readers from the classical composers, to Aretha, and to the inimitable Sex Pistols and so much more. An engaging and entertaining book. Thanks to Random House Transworld for an ARC."}, {"userName": "Larry H", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'm somewhere between 4 and 4.5 stars.\n\"Music expresses that which cannot be put into words and cannot remain silent.\"\n—Victor HugoMusic has always been one of my greatest passions, alongside my love of reading. I have the largest iPod Apple ever made, and it doesn't accommodate my entire music collection—how can I get rid of a song?For me, music is such a trigger of emotion, and a specific song can easily transport me to a time, a place, a special memory. So why it took me so long to read Rachel Joyce's lovely \nThe Music Shop\n, I'll never know.\"Frank could not play music, he could not read a score, he had no practical knowledge whatsoever, but when he sat in front of a customer and truly listened, he heard a kind of song. He wasn't talking a full-blown symphony. It would be a few notes; at the most, a strain. And it didn't happen all the time, only when he let go of being Frank and inhabited a space that was more in the middle. It had been this way ever since he could remember.\"Frank owns a record shop on a rapidly deteriorating, dead-end street in a London suburb. It's the late 1980s, and vinyl is struggling to survive over cassettes and the increasingly popular CD, but Frank is a purist. He'll never sell anything other than records, despite the reps from the different labels trying to convince him that he's making a huge mistake. Vinyl sounds the best, and provides so much more of an experience for the listener.Even though his store, and the other stores that surround it, isn't doing that well financially, the store serves as a gathering place for people in the neighborhood, people who come to Frank in need of help, and he finds them the exact song they need, even when they don't know it. Into this chaos one afternoon comes a beautiful woman, Ilse Brauchmann. Frank feels an instant connection to her, with her regal bearing and her slight German accent. He finds himself thinking of her constantly, yet Ilse talks of a fiancée, and clearly has secrets she doesn't want to divulge.Nearly all his life, Frank has never let anyone get too close to him, for fear of getting hurt as he had in his past. But he has fallen head over heels in love with Ilse, despite the fact that he knows next to nothing about her. When she asks him to give her music lessons, after some initial reluctance, he dives in wholeheartedly, teaching Ilse about all different songs, artists, and genres of music, and sharing the way those songs made him feel. It is the closest he can come to sharing his heart with her.As he tries to come to terms with his feelings, Frank is struggling financially to keep the store afloat, to fight those who refuse to sell him records because he won't buy CDs. He tries to keep his neighbors feeling secure despite the street's falling into greater disrepair, and a development company making everyone offers to buy their property to build something new. When Frank finds out that Ilse isn't quite whom she says she is, it threatens to debilitate Frank for good, as the betrayal opens old wounds and revives old hurts he had never quite gotten past.\"Sometimes all that people needed was to know they were not alone. Other times it was more a question of keeping them in touch with their feelings until they wore them out—people clung to what was familiar, even when it was painful.\"\nThe Music Shop\n is a book with such heart and charm, such vivid characters, and it was truly such a lovely read. Joyce perfectly captures the mood of London in the late 1980s, as the gulf between the haves and the have-nots grew ever wider. She also captures the passion of a true music lover, the beauty of friendship, and the walls we build around our heart to protect ourselves after we've been hurt too many times.As I learned from one of her earlier books, \nThe Unlikely Pilgrimage of Harold Fry\n (see my review), Joyce is a consummate storyteller who draws you in and makes you care about her characters. One character in particular, Frank's employee Kit, felt strangely underdeveloped, and you never really understood him despite his key role in the plot.I did feel the story took a little too long to truly get going, and then dragged a bit toward its conclusion. But in the end, even if I wasn't surprised by the ending, the book really touched my heart, and the music lover in me savored every note. \nThe Music Shop\n is one of those books that felt like a warm hug, kind of like Gabrielle Zevin's \nThe Storied Life of AJ Fikry\n.See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"userName": "Miriam Smith", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/35740838-miriam-smith", "userReview": "What a delightful and enjoyable read \"The Music Shop\" by Rachel Joyce is! It doesn't demand constant attention or keep you awake at night, it's just a lovely nostalgic story that makes you feel so happy when reading it, it's almost like you're floating through the pages (though the ending did have me in emotional goosebumps). \"The Music Shop\" is a very character driven novel. Set in 1988 the story is about Frank who owns a music shop selling only vinyl records - don't mention Cd's!! He knows everything about music and always finds the right album the customers need. One day a mysterious woman walks into his life - German Ilse Brauchmann - and from then on everything in his world changes.There's some really wonderful characters in this fabulous story from the main protagonist Frank (everyone needs a Frank in their life) to Maud a tattooist who says so little but expresses so much. I loved the developing relationship between Frank and Ilse and with Kit the endearing naive shop assistant added into the mix, things don't always go to plan.There's such a lovely community feel to Unity Street where the shop is located, with its multicultural residents and shop keepers living their simple and uncomplicated lives, where every event or change in routine is picked over and analysed in such a humorous and light hearted way. Customers would go into Frank's shop lost and come out found, having discovered the right music for their troubles and feeling healed.I really enjoyed reading this book, there's nothing to not like about it - without a doubt it's made me feel differently about music and I will certainly be listening to it in a completely new way from now on. Rachel Joyce is a very talented and established author and I look forward to reading more books by her. 5 stars!"}, {"userName": "Cheri", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "!! NOW AVAILABLE !!4.5 Stars\n”There was once a music shop. From the outside it looked like any shop, in any backstreet. It had no name above the door. No record display in the window. There was just a homemade poster stuck to the glass. FOR THE MUSIC YOU NEED!! EVERYONE WELCOME!! WE ONLY SELL VINYL!!”\nThe shop was difficult to navigate with boxes packed in everywhere one looked; every nook and cranny had records, although none were classified. There were two booths for listening with turntables in between. And Frank, as much of a fixture as the records, felt it was best to keep the shop open late into the evening for those passing by in need of music. You could find what you needed, as long as it was on vinyl. And if you didn’t know what you wanted or needed, Frank could always tell exactly what you did need. Stacks of classical, rock, blues, jazz, punk, heavy metal, he carried it all – as long as it was on vinyl. \n”Frank could not play music, he could not read a score, he had no practical knowledge whatsoever, but when he sat in front of a customer and truly listened, he heard a kind of song. He wasn’t talking a full-blown symphony. It would be a few notes, at the most, a strain. And it didn’t happen all the time, only when he let go of being Frank and inhabited a space that was more in the middle. It had been this way ever since he could remember. ‘Intuition,’ Father Anthony called it. ‘Weird shit’ that was Maud.”\nIn 1974, the year Frank bought his shop, Britain was beginning a recession that year, but he didn’t want to quibble over the asking price, and so he bought this place, despite the stench, despite the condition it was in, despite the crumbling masonry falling now and then. He began to tackle the things that needed tackling right away. Slowly, he began to make repairs, plastering walls, repairing pipes, fixing the roof, and replacing the windows. People begin to pop into the shop just to see how it’s coming along, and he begins to know his neighbors better. Word spreads about his shop, and slowly, over time, he builds up a somewhat regular clientele. His customers are amazed that he always seems to know just the right music for them. \n”Music comes out of silence and at the end it goes back to it. It’s a journey. You see?”\n His mother had told him when he was six. \n”And of course the silence at the beginning of a piece of music is always different from the silence at the end.”\n Why? He questioned her. \n”Because if you listen, the world changes. It’s like falling in love. Only no one gets hurt.”\n By the time his shop is up and running, music has changed. Moved beyond vinyl to 8-track tapes, then cassette tapes, and then, by 1988, came CDs. Shiny, eye-catching and new. But Frank remains steadfast in his determination to keep in the old and blocking the way for those new, shiny objects. In this neighborhood, it feels as though time has marched on, but time seems to have forgotten this neighborhood, these people. Throughout this story are many quirky and endearing characters, but there is one character that really stands out from the rest: Ilse, a young woman who may wear her heart on her sleeve, but that sleeve is made of amour. He first meets her when she faints just outside the door to the music shop. A new person in this neighborhood is worthy of notice, but there’s something about her that sets her apart from them. It’s not just the clothes or the gloves that she wears, it’s not her green coat, or her German accent that sneaks through when she speaks, and she’s just a bit of an enigma. And that difference is something they all seem to find intriguing. There are a host of other characters, Father Anthony, Maud, and Kit, with the occasional glance back in time to Frank’s memories of his mother, Peg. Each character is uniquely charming, even grumpy Maud. There are also those that wander into the shop as a break in their day of wandering the streets.There is a considerable amount of conversation about music, which should be obvious since it is a book that is based on the comings and goings of people in a music shop, but the range of eras and genres of music is fairly eclectic. I loved this, the discussions which were less about music than about the feelings evoked, what the artist was trying to say, to convey to those listening. The description of this book says that it is “a love story and a journey through music,” however there are many different kinds of love stories, as many as there are different songs, and this story deals with more than one way that love is shared. I would say that this is a love story / song to music, and the ability that both music and words have of breaking, and healing, our hearts.In a very basic sense, there’s an essence to \n”The Music Shop”\n which charmed me as much as her \n“The Unlikely Pilgrimage of Harold Fry,”\n which I loved. There’s a raw, but not overly sentimental charm to these characters, as well as an emotional journey over time, as well. Like Harold’s followers, you’ll be cheering these characters on in their journeys. Pub Date: 02 Jan 2018Many thanks for the ARC provided by Random House Publishing Group / Random House"}, {"userName": "PattyMacDotComma", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/1128612-pattymacdotcomma", "userReview": "4.5★“‘I don’t care what anyone tells me. The future’s vinyl,’ he said.. . . ‘Life has surface noise! Do you want to listen to furniture polish?’Frank is a rumpled older fellow with a large, eclectic collection of vinyl records in a rundown shop in a rundown little side-street in a rundown part of London, which developers are eyeing for new housing.Kit is the clumsy kid he’s taken under his wing to help out in the shop (when he isn’t breaking things), and there ae various side characters who also do business in the street: undertaker, tattooist, you get the idea. There are some people who have lived there for years, and there are some cheap rooms to let. It's a neighbourhood. Yes, it's run-down. Yes the buildings are crumbling. But yes, these people need each other and their homes.Frank’s shelves are arranged in such a way that only he knows where anything is. He sorts his records by putting like with like. The thing is, only Frank know why one piece of music belongs with another, a symphony with an Aretha Franklin along with Johnny Cash or someone.Frank ‘reads’ people. He doesn’t know how, but he listens, truly listens when they tell him why they’re looking for music – a breakup, a celebration, a moment of reflection. They don’t know what they’re looking for, but Frank does. He might hand them a concerto and a pop song, send them into one of his listening booths (converted wardrobes) and watch their faces light up when they hear their just-right selections.This reminds me of Mr. Penumbra's 24-Hour Bookstore, with its peculiar collection of books and odd customers, but this is a unique story about some very particular music. We are given snippets of Frank’s growing up with his self-absorbed mother, Peg, a musical genius (in her way). He always call his mother by name.“‘Music comes out of silence and at the end it goes back to it. It’s a journey. You see?’‘Yes, Peg,’ Though he didn’t see. Not yet. He was only six.”She loves Beethoven, Handel, Miles Davis. Frank says she crashes through the boundaries like jazz musicians do. She told him“Jazz was about the spaces between notes. It was about what happened when you listened to the thing inside you. The gaps and the cracks. Because that was where life really happened; when you were brave enough to free-fall.”Peg’s musical influence obviously soaked deeply into him, and it’s all very well that Frank loves the shop and people love Frank, but it doesn’t pay the bills. Is he doing all right?“Frank said he wasn’t sure. He wasn’t in the red exactly, but he was probably heading (kind of) in that (sort of) general (pinkish) direction.”When the mysterious, lovely German, Ilse Brauchmann wanders in, everything changes. I think some readers have made lists of all the music mentioned, and I can see why. I didn't, but I will have to go listen to Miles Davis though. Here’s why.“‘This is the record that will change history,’ said Peg. ‘Why?’ She blew a plume of smoke towards a tea-coloured patch on the ceiling.‘Because it takes music to a whole new place. Miles Davis booked all the best players but they had hardly any idea what they were going to play. He gave them outlines, told them to improvise, and they played as if the music was sitting right with them in the studio. One day everyone will have “KIND OF BLUE”. Even the people who don’t like jazz will have it.’How could she be certain?‘Because it’s the dog’s bollocks. That’s why.’”Good enough for me! (And to think I was going to give away all of our old vinyl – yikes!)Many thanks to NetGalley and Random House for the preview copy from which I’ve quoted (so quotes may change)."}, {"userName": "Angela M", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "2.5 rounded up A cast of quirky, misfits who are drawn to each other with Frank at the center in this neighborhood in Great Britain in 1988. You might call him the music whisperer with his knack for choosing songs that tend to elevate people depending on their circumstances. Frank owns a music store selling only vinyl records, refusing to go with the popular CD. His talent for knowing just what music will fix what ails other people is fun to watch as lonely, sad people listen to the music he chooses for them and then come to some realization of themselves. Sadly, while Frank can figure out what strangers need, he can’t quite deal with his own feelings. I don’t know enough about music to really know some of the classical or jazz titles but certainly recognized some of songs. This is an ode to music, a sentimental love story, a story of friendship. However, it just fell a little short for me. Harold Frye and Queenie Hennessy, characters I loved from Joyce’s previous novels were the reasons I decided to read this book . But this book just didn’t grab me in the same way and neither did the characters. Chalk it up to expectations that were too high. It’s a quick read with a predictable ending. I rounded up since it turned out to be a feel good story that we all can use once in a while. There are many who have loved this story and rated it higher. I recommend that you read those reviews as well. I received an advanced copy of this book from Random House Publishing Group - Random House through NetGalley."}, {"userName": "Esil", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "Barely 3 stars. So dull... I loved Rachel Joyce's The Unlikely Pilgrimage of Harold Fry and The Love Song of Miss Queenie Hennessy. She has a talent for delving into deep emotions through quirky characters. The Music Shop set off to do the same, but unfortunately I didn't feel like it delivered. In the 1980s, Frank runs a small vinyl record shop. He is huge and sensitive. He has a knack for connecting people with music that soothes their troubled souls. Visitors to the shop adore him. But vinyl is going down the tubes and Frank refuses to get with the times and sell cds. A few other misfits form part of the ensemble, including distressed Ilse, with whom Frank seems to be engaged in a push me pull you awkward tangle. And I won't say more to avoid spoilers but it's not hard to guess where this one ends up heading. Maybe I'm just being grumpy, but unlike her previous books, this time it felt like Joyce's characters were missing emotional depth or originality. I'm not going to give up on her yet, but I hope she gets back in her game next time round. Thanks to Netgalley and the publisher for an opportunity to read an advance copy."}, {"userName": "Liz", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "It’s 1988 and Frank sells vinyl records on a small street in a depressed part of town. He refuses to sell CDs even when the distributors all threaten to drop him. He loves music and is able to match a person with the music they need. What he doesn’t think he needs is love. There’s a dry wit to the book. The characters are a group of misfits and oddballs and there’s humor in their dialog and activities. It’s also a well written book. A book that makes you think. When Peg discusses how music is about silence, you just get it. “And of course, the silence at the beginning of a piece of music is always different from the silence at the end.” “Why Peg?” “Because if you listen, the world changes. It’s like falling in love. Only no one gets hurt.”Joyce manages to really get the time and place. The atmosphere- the grafffiti, the developers trying to buy up the properties, the falling down condition of the properties, is as much a character as Frank, Ilse or Kit. Unfortunately, the book is not consistently interesting. It goes through numerous dry patches where nothing happens. Just when I would begin to think I should stop reading, it would get better and I would decide to stick with it. The memories of Peg talking about music were my favorites. An interest in music is a must for this book. Not just classical, but all. The ending made the dry patches worth it. My thanks to netgalley and Random House for an advance copy of this book."}, {"userName": "Susanne Strong", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "3.5 Stars* (rounded down).A quirky, sweet, easy read.Frank has always loved music, it was a gift from Peg, his mother. He is a music shop owner who only sells Vinyl records. The year is 1988. Everyone under the sun wants him to start selling CD’s but Frank refuses. For him, Vinyl is where its at. Frank has a gift - he can feel what music a person needs to hear. The person could be a stranger or a friend. They might come in asking for a specific record or just asking for a song or a type of music. Regardless, Frank will pick out what he knows they need to hear. And he is always right. Music is his life. Always has been. Frank imagines that it always will be, as he is terrified of actually living.One day a woman in a green coat passes by his shop and then she faints. Frank takes care of her, with all of his friends and neighbors looking on. The woman, Ilse, comes to and Frank gives her a record, “The Four Seasons” even though she claims not to like or listen to music of any kind. Thereafter, Ilse asks for music lessons and Frank provides Ilse with a window into his soul. “The Music Shop” by Rachel Joyce is both a sweet, endearing novel and a character study about a group of misfits who are quite lovely together. The characters were full of life and quite interesting! In addition, “The Music Shop” was a quick easy read and it made me feel good inside. Thank you to NetGalley, Random House Publishing Group – Random House and Rachel Joyce for an ARC of this novel in exchange for an honest review. Published on NetGalley, Goodreads and Amazon on 1.28.18"}, {"userName": "Phrynne", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "This is one of those books where I want to use the phrase \"I liked it but I didn't love it.\" In other words it was nice but not as good as I had hoped. The Love Song of Miss Queenie Hennessy still remains my favourite book by this author by far.I liked the setting in the run down music shop in an even more run down area of town. I really liked the time period and I enjoyed several of the characters especially Frank himself and the accident prone Kit. It was unfortunate that I also liked the Singing Teapot waitress more than I did Ilse who I never actually warmed to. The author gets lots of points for her ability to write quirky characters without slipping into stereotypes.This is not a romance by any stretch of the imagination, but the love story is there and is very poignant. A few tears, or at least wet eyes, at the end. There is lots and lots about music and many references, some to pieces or songs I don't know and others I do. I listened to a few online and did not always understand why Frank found them appropriate but then that was his skill not mine!Overall a nice contemporary novel with a great cast of characters, well written and enjoyable to read."}, {"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "Instagram || Twitter || Facebook || Amazon || PinterestHere's the thing: the concept is great. Frank owns a record store in the 1980s, when records are beginning to be replaced by CDs. He holds fast to his beloved records, falls in love, and his favorite music becomes the soundtrack to his pursuit of the forbidden woman, interspersed with the memories of the music from his childhood, with his tempestuous, eccentric mother.I think Rachel Joyce wanted to write the next HIGH FIDELITY, but she doesn't have the charm or the wit of Nick Hornby. Instead, she writes what I call \"hand-holding fiction.\" Maggie Stiefvater does this, too. The prose is lovely but often overly precious, and everything is explained to you in great detail, as if the author doesn't trust the readers enough to let them figure it out for themselves. We must always be told what a character is feeling, and why, instead of being allowed to infer that ourselves.It's. So. Freaking. Annoying.Another thing that really galled me about this book is the manic pixie dreamgirl element. Frank is lost, adrift, and it's the entrance of a tortured, quirkygirl that grounds him and gives him meaning. I hate the manic pixie dreamgirl trope, because in such stories the heroine becomes a means to an end: a reward to the male character for dutifully completing his character arc. As if that weren't enough, they're both pretentious AF. Frank gives her \"music lessons\" where he mansplains to her for hours about what musicians are good and what the records mean (kindly eff off, Frank), and Ilse is flighty and mysterious and utterly flat, apart from having a fancy accent and fancy clothes.If you ever wondered what the little shits in John Green novels would be like in middle age, pick up this book and satisfy your curiosity, because these characters are totally the little shits in John Green novels all grown up and in the midst of a mid-life crisis.I received an ARC of this book for review. 2 stars"}, {"userName": "Tucker", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/39633342-tucker", "userReview": "Rachel Joyce is a master at writing about ordinary people and their often hidden struggles, and celebrating their courage and resilience in the face of those struggles. In “The Music Shop” she once again writes about those “ordinary” people in a clear-eyed, unsentimental, and inspiring manner. The book focuses on a group of seemingly unremarkable people who have businesses on Unity Street. At the center of those shops and of the story itself is Frank and his music shop. Frank has an unusual and magical gift; he can listen to people’s conversations and suggest specific pieces of music to help with whatever difficulties they may be having. As Frank describes it, “Sometimes all that people needed was to know they were not alone. Other times it was more a question of keeping them in touch with their feelings until they wore them out— people clung to what was familiar, even when it was painful.” Because of this gift Frank has devoted customers, but the music delivery business is changing and Frank is unwilling to accommodate those changes. He knows that the totality of the musical experience provided by vinyl records cannot be matched by cassettes or cd’s. (I heartily agree!) When devastating losses occur in Frank’s life, he finds himself unable to cope. He has always been able to rescue others but doesn’t know how to rescue himself. But rescue does occur, and the manner in which it plays out is joyous and heartwarming.In addition to a great story, Rachel Joyce’s knowledge of all types of music, from classical to punk, adds a wonderful sonic dimension to the book. I frequently found myself interrupting my reading so I could find and listen to specific pieces she refers to. (That search would have been much easier if I had known that at the end of the book there is a Spotify link for all the music!) Thank you to Random House and NetGalley for providing an advance copy of this book in exchange for my honest review."}, {"userName": "Bianca", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/29843800-bianca", "userReview": "This novel has the ingredients that I love to consume: quirky characters, music references (I LOVE music!), David vs Goliath situations, unlikely friendships. Unfortunately, the way they were mixed up resulted in a hard to swallow, boring dish. I never got a clear image of the characters, and worst of all, I never really cared, so that made the reading of this novel feel like work when it shouldn't have been.I hate to say this, but all the music trivia, at times felt like unnecessary information dumping. While there were occasional quotable passages, the rest of the writing was contrived and the flow and pace were off.I am so annoyed I didn't enjoy this novel more.So this is getting the dreaded 3 stars because I was underwhelmed.I've received this novel from the publishers via NetGalley, in exchange for an honest review."}, {"userName": "Heather 'Bookables'", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/5376236-heather-bookables", "userReview": "4 starsOverall a very heartwarming, beautiful story about friendship, love & a neighborhood full of amazing shop owners. If your a big music fan, this book is for you. The whole book centers around a vinyl record store and the owner loves music and often reflects on some of his favorite bands and memories associated with music."}, {"userName": "Eve", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/1283951-eve", "userReview": "\"Sometimes all the people needed was to know they were not alone. Other times it was more a question of keeping them in touch with their feelings until they wore them out—people clung to what was familiar, even when it was painful.\"I so enjoyed this book, which seemed like the music version of one of my favorite books from last year, How to Find Love in a Bookshop. Frank has a special gift for helping people find the music that they don't realize they need. Some come looking for healing, others want a different music experience. Whatever ails them, Frank comes to their rescue, operating from a rundown record store (that only sells vinyl, mind you) on a dead end street in London in 1988. As the cover implies, one day a woman in a green coat walks into his shop...and the rest is history.I adored all the music references, especially to classical composers and their work. Joyce made it so accessible to me, and that's saying something because although I enjoy listening to it, I always feel out of my depth. I also loved the hodgepodge of friends and neighbors that rounded out the little community in the cul de sac. Highly recommend if you're looking for something light but uplifting."}, {"userName": "Jill Croce-McGill", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/9119740-jill-croce-mcgill", "userReview": "This is my first book by Rachel Joyce and definitely won't be my last! The Music Shop is a heartwarming story about Frank, a vinyl-only music shop owner. Set in 1988, the music shop attracts the lonely and sleepless crowd. Frank has a special gift for connecting his customers with just the right vinyl record they need. Then one day Ilse Brauchmann, a beautiful young woman, walks into the shop and turns Frank's world upside down. Wonderful, quirky, and eccentric characters fill this nontraditional love story throughout. I really enjoyed reading this book, and I absolutely loved all the talk about music and the feelings it raised.*I want to thank NetGalley and Random House Publishing/Random House for the ARC."}, {"userName": "Sherri Thacker", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/36561653-sherri-thacker", "userReview": "The Music Shop is not just about a music shop - it’s a love story unlike any other. I was undecided whether to give this book 4 stars or 5 stars but when I got tears in my eyes at the end, that decided for me! A FABULOUS book!!"}, {"userName": "Rachel Hall", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/28372189-rachel-hall", "userReview": "DNF at 50%I won this novel courtesy of a Goodreads Giveaway and although my regular reading material is crime fiction, I am not averse to some of these whimsical novels with quirky characters and a sense of optimism that often make for a genuinely feel-good read. I loved both The Rosie Project and Effect, for example, but have never found myself drawn to the work of Rachel Joyce despite the many rave reviews I have read.Sadly, I found The Music Shop to be so interminably slow that at 50% I had to put this novel down. Maybe as I reader of largely crime fiction and thrillers, I demand more action and momentum in a plot, but this was not so much as a meander as like wading through treacle. I won’t describe the plot as other readers, who I suspect will have enjoyed this more, will do so, but so very little happens and Rachel Joyce manages to drag it out to a soul destroying length. An entire one-hundred-pages is devoted to pondering on a woman with an accent and a green coat who faints outside of Frank’s music shop. Joyce begins her novel in 1988 and lonely Frank with his awkward and unusual upbringing is devoted to serving his customers and giving them the music they need in order to solve their many dilemmas in life. Frank learnt all of his music knowledge through his non-conventional mother, Peg, and there is a huge amount of repetition in this novel as first Joyce shows Frank learning from Peg, before Frank then goes on to deliver the same lesson to a customer. I think the most irritating aspect of Joyce’s writing is that she is so acutely aware that she has captured the niche end of charming contemporary fiction that she deliberately serves up awkward characters with common problems with the intention that there will be something within the pages that strikes a chord with every reader. The problem with doing this, however, is that it entails contrived characterisations and necessitates an overload of saccharine sweet schmaltz to complete the setup. The literary equivalent of pulling teeth. I shall not be reading anymore of Rachel Joyce’s work although I have no quibbles about her writing, just the genre. On a positive note (!), I did learn some very interesting facts about classical music and I suspect if I had continued to the end, I would have learnt about the more modern classics too. Clearly the background of this novel has been well-researched."}, {"userName": "Cindy Burnett", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "The Music Shop is a beautifully written novel about a small street in a London suburb in the late 1980s. It is an homage to music, and as a lover of music myself, I found it a joy to read. I savored the musical references, lyrics and band/composer trivia. Joyce also highlights the benefits of community and relationships while crafting genuinely wonderful characters that will stay with me for a long time.My favorite part of the book is the focus on music and its benefits. Frank, the main character, has a gift of knowing exactly which song will help or appeal to a customer. I also loved the characters; Joyce created such a wonderful group of people that I thoroughly enjoyed getting to know. What didn’t appeal to me as much was the long gap in time between the two parts of the story. I felt that too much time passed for the events to seem realistic. The only aspect of the time gap that I did like was seeing was what became of Kit and Maud. The Music Shop is a fabulous read, and I recommend it to anyone who loves genuinely drawn characters and a good plot. I received this book to read and review; all opinions are my own."}, {"userName": "Brenda", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/2337007-brenda", "userReview": "Frank was wandering with no particular purpose in mind when he saw the abandoned old shop with the for sale sign in front. He knew without a shadow of doubt that this was what he wanted – a quiet street, other small shops around – the shop was a mess, and Frank wasn’t that handy. But it wasn’t long before Frank’s music shop was filled with records; vinyl only – no tapes or CDs (trashy stuff!) – his records had customers coming to his door. Frank found them the music they needed, much to their astonishment.When Ilse Brauchmann arrived at the front of his shop one day, Frank was struck by her. For some reason, one he couldn’t fathom, he was drawn to Ilse, and she seemed to be to him. But mystery surrounded her – when she wanted Frank to teach her music he knew in his heart that he should say no. Was Ilse who she seemed? Frank certainly didn’t understand her…The Music Shop by Rachel Joyce is filled with quirky characters; some I loved, some not so much. The bumbling Kit was a charmer, Frank himself and of course the Father who was an ex-priest (and an ex-alcoholic) – but Ilse was enigmatic and didn’t tug at the heartstrings like the others. All in all, an enjoyable read by the author of The Unlikely Pilgrimage of Harold Fry, which I loved. Highly recommended.With thanks to NetGalley and the publisher for my digital copy to read and review."}, {"userName": "*TUDOR^QUEEN*", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/25976435-tudor-queen", "userReview": "This was a lovely book spanning a twenty-one year period about a stretch of shops in London with the address of \"Unity Street.\" This turns out to be a metaphor for the way the various shop owners band together to support each other through personal and financial challenges. There are twin brothers with a funeral parlor, a female tattoo artist, a Polish baker, a religious store run by an ex-priest, and the music shop. These business establishments face a row of apartments opposite that have seen better times, along with a corner bomb site that was never redeveloped. The main character in the book is Frank, a staunch devotee of vinyl records with a knack of advising customers of what music they need. They might come into the shop thinking they want Chopin and walk out with Aretha Franklin instead...and be thankful for it. Frank had a wealthy and eccentric mother named Peg (and wanted to be called as such by Frank) who relentlessly taught him a wide array of music along with the personal stories of their composers. It was a fervent passion for Peg which she passed along to her son. Unfortunately, in her eccentricity she deprived Frank of a normal childhood and destroyed the most serious romantic relationship of his young life. These experiences reverberate through Frank over the years along with the music. It lands Frank into his music shop business surrounded by his coterie of interesting workers/friends. Then one day an attractive young woman in a pea green coat peers into the music shop's window and everything changes for Frank. A real estate development corporation is pressuring the shop owners to sell, the record company reps are coming down on Frank because he won't sell CDs or cassettes, and Frank is battling strong feelings for the mysterious German girl that wandered into his shop months ago. I once read another book by author Rachel Joyce called \"Perfect\" which I enjoyed very much...which is why I wanted to read this. This is a very different storyline from that book, and almost as engaging. Joyce is also famous for the award winning \"The Unlikely Pilgrimage of Harold Fry\" and \"The Love Song of Miss Queenie Hennessy\" (both waiting to be read in my kindle library). Many thanks to the publisher and NetGalley for this advance reader copy in return for my honest review."}, {"userName": "Celia", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/30261451-celia", "userReview": "I am a sucker for books about music. And music as therapy: even more so. (Did you know you can obtain a college degree in music therapy? Well, you can). So… about The Music ShopThere is a music store on a dead end street in England somewhere owned by Frank. “Frank could not play music, he could not read a score, he had no practical knowledge whatsoever, but when he sat in front of a customer and truly listened, he heard a kind of song. And that’s how he helped people.”Frank not only helps strangers who walk in the door but the other shop owners on Unity Street. Maud – a tattoo artist. He introduces her to Adagio for Strings by Barber. It moves her. She loves Frank. Frank does not love her back. That’s just the kind of guy Frank is (or isn’t).Father Anthony – an ex-priest who runs a religious articles shop – Frank introduces him to jazz.But most importantly – Ilse Brachmann – a beautiful German woman to whom Frank eventually gives music lessons and who is not as she seems.This is a lovely book that teaches lessons on difference (the characters in this book really are DIFFERENT) and new beginnings. It was a wonderful read and I highly recommend it.BTW, I have reached my goal for 2017 – read 200 books. Yes, this Is the 200th. The way I feel about this book, its inclusion as Number 200 is very fitting.Playlist for the 24 songs mentioned in The Music Shop can be found onbit.ly/TheMusicShopPlaylist"}, {"userName": "Michael", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/5143619-michael", "userReview": "Ever since Harold Fry went on a walk across the UK in Rachel Joyce's 2012 debut novel The Unlikely Pilgrimage of Harold Fry, I like many readers the world over have been enthralled by the author's ability to represent ordinary people with grace and dignity.This is something that continues in what is Rachel's fourth novel. Set in the late 80's in recession hit England, Frank runs a record store. Not only does he have a love for vinyl and will staunchly resist pressure from record companies that want him to stock the new in thing \"CD's\", but he also has the uncanny ability to find a customer exactly the tunes they need to cure their blues.Frank also fits in perfectly with the shop owners of Unity Street, who are a motley bunch of disenfranchised souls. There is the Tattooist Maud, Religious paraphernalia seller Father Anthony, Baker Mr Novak, funeral parlour owners the Williams brothers and Frank's hapless assistant Kit. Together they are a family that although have all faced adversity, thanks to Frank are happy.Time though, they are a changing with Unity Street under threat. A local development company has their eyes on the land and wants to demolish all the shops and homes and put up new housing. The shop owners themselves face a battle to maintain customers and are starting to look favorably at the incentives the developer is offering them.Amongst all this chaos along will come into Frank and the rest of the Unity Street communities lives a mysterious German woman in a green coat, who faints outside Frank’s shop. Ilse will slowly make her mark on the residents and Frank in particular as her presence will force him to embrace his past, even if it is to his detriment.At the heart of this beautiful novel is the themes of people, community, and music. With musical stories that range from Vivaldi to Aretha Franklin and the Sex Pistols, it is not hard to be swept up in the exquisitiveness of a story that at its purest is a love story that celebrates the silence between words."}, {"userName": "Jennifer Blankfein", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/8904243-jennifer-blankfein", "userReview": "Follow Book Nation by Jen https://booknationbyjen.wordpress.comFor all my reviews and recommendations. I picked up The Music Shop at the perfect time! So enjoyable, I laughed - I cried- it touched me.... review to come!"}, {"userName": "Karen", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/3060349-karen", "userReview": "I highly recommend this quirky and charming book, especially for music lovers. Within the bigger picture is a love letter to music masters that will touch your heart.It is 1988 and Frank’s world is changing. He is the owner of a dying vinyl record store located on a run-down street soon to be demolished in the name of ‘progress’. The music world is also changing but Frank is digging in his heals, refusing to move on to the new craze of cds and cassette tapes. I loved Frank’s steadfast dedication to vinyl even as his suppliers and customers dwindle.Ilse Brachman enters Frank’s life after she faints outside of his shop. Ilse is a mystery, a newcomer to town with an air of sadness. I appreciated how the author kept me hanging with elusive details of Ilse’s situation and I resisted the temptation to read ahead. When Frank first sets eyes on Ilse, it appears to be one-sided love at first sight though he can’t admit it and is awkward beyond belief. As time goes by, the dynamics change, the ebb and flow of the relationship tease and the touches of humor with tinges of sadness are well written and feel genuine.The story methodically moves between present and past when Frank is raised by his single mother Peg, a free spirit who passed on to Frank her intense passion for music. Frank’s reflections on this past make for some emotional moments. Thanks to Random House and Netgalley for providing an ARC in exchange for an honest review."}, {"userName": "Julie  Durnell", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/4566472-julie-durnell", "userReview": "Rachel Joyce's books are so well written for \"modern novels\". I enjoyed this slow romance between Frank and Ilse and music of all genres. There is even a playlist on Spotify to accompany the story's musical threads!"}, {"userName": "Marianne", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/5067228-marianne", "userReview": "“He played the whole record, side one and then side two. As he listened, Frank smoked and danced in the cramped space behind his turntable, rolling his shoulders and swinging his hips – watching him, even Maud began to sway – while Kit did something that was possibly the funky chicken, but could equally be to do with his new shoes hurting his feet”The Music Shop is the fourth full-length novel by best-selling British author, Rachel Joyce. Frank would only sell vinyl. It didn’t matter that this was 1988, cassettes were still popular, CDs were the in thing; vinyl was what Frank knew and loved. The shop was in Unity Street, a dead-end street with a parade of run-down shops, a pub and houses opposite. “Frank could not play music, he could not read a score, he had no practical knowledge whatsoever, but when he sat in front of a customer and truly listened, he heard a kind of song. He wasn’t talking a full-blown symphony. It would be a few notes; at most, a strain. And it didn’t happen all the time, only when he let go of being Frank and inhabited a space that was more in the middle. It had been this way ever since he could remember.” Frank had a talent for knowing what his customers needed.Frank’s equilibrium (and that of his friends, the neighbouring shopkeepers, customers and residents) is upset when Ilse Brauchmann, newly arrived in the country, peers into his shop window. A developer seems intent on destroying this little corner of England and Frank galvanises the street into resisting, but is distracted from his campaign by the music lessons he has promised to give this strange but charismatic lady.Joyce gives the reader a cast of quirky characters, some of whom definitely qualify as eccentric: the alcoholic (but dry) ex-priest who runs the religious gift shop; the teenaged assistant who bubbles with enthusiasm over every project; the bad-tempered tattooist; the hand-holding twin brothers running the funeral parlour; the grumpy waitress in the tea shop; and, of course, Frank, forty, single and living above his music shop, whose very unconventional mother had taught him about music: “…if you listen, the world changes. It’s like falling in love. Only no one gets hurt”Joyce is wonderfully skilled at characters and their interactions, using vignettes to give their backgrounds and anecdotes to illustrate their social ineptitude, their awkward courtship, their miscommunications. There are plenty of wise words: “There is no guarantee that just because you are ready to go back and claim something, it will be there”, and there is, obviously, a lot of music, music of all genres, some of which is bound to arouse nostalgia. For readers of a certain vintage, all sorts of memories will be invoked by this: “You ease the record from its cover. It’s years since you’ve held one but you do it without thinking. Slide your fingers inside the sleeve, careful not to touch the vinyl. Draw it out. Hear the rustle of paper. Balance it in the span of your palm, the outer rim on your thumb, the label on the tip of your middle finger. As it brushes your wrist, feel the soft static kiss of it. Smooth as liquorice and twice as shiny. Light spills over it like water. Breathe in the new smell.” Sweet and funny and moving."}, {"userName": "Malina Skrobosinski", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/46824567-malina-skrobosinski", "userReview": "\"Bon appetit\"\nI devoured this enchanting tale created by Rachel Joyce. It was captivating, enlightening, moving, and even exasperating at times. It's not the kind of novel that is overly gratifying... at least not at first... that's where the exasperation comes in, but in the end, I found it to be very rewarding. Meet Frank... Frank is a 40 year old single man that owns a music shop. \"I'm going to help people find music.\" Frank could not play music, he could not read a score, he had no practical knowledge whatsoever, but when he sat in front of a customer and truly listened, he heard a kind of song. Frank was committed to music, but love... that was something he was never going to consider again. \n\"I'm done with all that. My shop is all I need.\"\n Yes, Frank was content with spending the rest of his days in his music shop selling vinyl records and helping people find music. Only fate had other things in store for him... times were changing. Vinyl was no longer being sought after, CD's have become the new way to listen to music. Music reps are encouraging Frank that if he wants to make it in the business, he's got to sell CD's, but Frank's not budging. As if this wasn't enough frustration for Frank, a mysterious German woman faints in front of his shop, leaving him and everyone in the community stunned. She returns later to thank Frank for helping her, and it's then that Frank realizes that he can't \"hear\" this woman... she has no song, she's completely silent to him. Silence was where the magic happened. The story between Frank and Ilse Brauchmann is so unconventional... it's really like nothing else. It's not a classic love tale that you would hope for. It's complicated... but isn't all love? What's so great about this story is that they come together through a love of music. Only they're both broken and with each others help, they find a way through. The cure is in the disease. I really enjoyed the character development in this novel despite the fact that many of the characters were not given very robust roles or titles in the novel. The overall sense of the community on Unity Street really makes the novel come alive with warmth and... well... unity. There was something unique about each character, I enjoyed Maud's feisty and snappy dialogue. Kit, and his clumsy, can't do anything right, but always wanting to get it right attitude. The waitress... such a simple character in the novel, but yet she added so much in those chapters I felt. Those are just to name a few, but the community really does come alive. I'm going to have to check out some of Rachel Joyce's other work. This was such a fun and quick read. I realize it probably won't be for everyone, but if you love music and enjoy a simple (okay, maybe not so simple) love story, then I say give it a chance. I'd like to thank NetGalley, Random House Publishing Group, and Rachel Joyce for allowing me the chance to read this novel in exchange for my review. I really, really enjoyed it!"}], "description": "A love story and a journey through music, the exquisite and perfectly pitched new novel from the bestselling author of The Unlikely Pilgrimage of Harold Fry and The Love Song of Miss Queenie Hennessy", "title": "The Music Shop", "url": "https://www.goodreads.com/book/show/26854212-the-music-shop", "average": 3.84, "cover": "https://images.gr-assets.com/books/1503590162l/26854212.jpg", "reviews": 1721, "authors": [{"url": "https://www.goodreads.com/author/show/5309857.Rachel_Joyce", "name": "Rachel Joyce"}], "type": ["Fiction", "Music", "Contemporary", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/26854212-the-music-shop", "http://www.goodreads.com/book/show/31348215-the-music-shop", "http://www.goodreads.com/book/show/34203744-the-music-shop", "http://www.goodreads.com/book/show/35103141-the-music-shop", "http://www.goodreads.com/book/show/32614368-the-music-shop", "http://www.goodreads.com/book/show/35818806-the-music-shop", "http://www.goodreads.com/book/show/31869154-the-music-shop", "http://www.goodreads.com/book/show/13227454-the-unlikely-pilgrimage-of-harold-fry", "http://www.goodreads.com/book/show/20890479-the-love-song-of-miss-queenie-hennessy", "http://www.goodreads.com/book/show/17192373-perfect", "http://www.goodreads.com/book/show/19191545-a-faraway-smell-of-lemon", "http://www.goodreads.com/book/show/24909831-a-snow-garden-and-other-stories", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}