{"ratings": 1683, "userreviews": [{"userName": "Margaret", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/991805-margaret", "userReview": "Tim Farrington’s The Monk Downstairs is sweet novel about two middle-aged people who have lost their ways in life. He (Michael Christopher) has left the monastery after twenty years as a monk, and she (Rebecca Martin) is a graphic artist (who once considered herself an artist and now finds herself making advertising videos of dancing light bulbs) who is also the recently divorced mother of a six year-old daughter (Mary Martha). Mike and Rebecca meet when she rents out the basement “in-law” apartment in her house to him. She’s not sure at first he’s a good financial risk as he doesn’t have a job, but she accepts his twenty years in the monastery as an indication of good character. He is natural and kind to her daughter, and Rebecca figures he’ll figure out how to live in the world again.Tim Farrington presents his third-person narrative mostly through Rebecca’s viewpoint, but we do get glimpses from inside Mike’s head through a series of letters he writes to Brother James, a young brother from the monastery Mike just left. James had seen Mike as a seasoned monk who knew God well and has taken it upon himself to try and persuade Mike to return to the monastery. Those letters to Brother James appear in most chapters and they add depth to Mike’s character and introduce the readers to his spiritual struggles, which both explain quite a bit about the man and are fascinating discussions in their own right of loss of vocation and of the relative values of the contemplative and active life. Mike is struggling to maintain his faith and his letters to Brother James show him trying to convince the young monk, who is still back at the monastery (and still very young), that the emptiness Mike felt there that made him leave the monastery is a truer message from God than are James’s exhortations that Mike reconsider his vocation.As for Rebecca, she has been trying to maintain control of her life after her recent divorce from her first husband, Rory, who is a professional surfer and not exactly a good provider or an ideal father and role model, although he does love his daughter. Mary Martha is a beautifully written and a convincing six year-old girl; Farrington gets her exactly right from the piles of unicorns to her insistence on carrying a picnic basket that is way too heavy for her. Rebecca’s mother lives not too far away, and as annoying Rebecca feels she is, I just loved her. Bob Schofield is a decent man Rebecca has been half-heartedly dating, and there are the friends from the office. The narration unfolds quite naturally and at a leisurely and comforting pace. I found myself becoming quite fond of all of the characters in the book as I read. And the spiritual issues may seem parochial or as side issues, but they are in fact at the center of what it is we all are doing as we try to live good and meaningful lives by working to earn our keep and by caring for and loving each other. There is a sequel (The Monk Upstairs), and while such books don’t usually appeal to me, I just might look for this one, as I would like to spend more time in the company of the characters Tim Farrington has created."}, {"userName": "Sherry", "userReviewDate": "May 15, 2016", "userURL": "http://www.goodreads.com/user/show/5652025-sherry", "userReview": "Fantastic novel! A former monk rents an apartment from a cynical single mom and as their relationship deepens both find hope for the future. Filled with warmth, gentle humour, and intelligent writing, this book was one I didn't want to end. Luckily for me, there is a sequel- The Monk Upstairs!"}, {"userName": "Christa", "userReviewDate": "Oct 05, 2008", "userURL": "http://www.goodreads.com/user/show/261662-christa", "userReview": "The Monk Downstairs was a sweet and very different love story. Both the hero and heroine had many issues to deal with from their respective pasts. Michael Christopher has just left a monastery after twenty years as a monk. He is disenchanted with life, and doesn't believe happiness is in his future. Rebecca Martin is a single mom who has all but given up on finding love. These two characters are flawed, and both have issues to deal with that stand in the way of a relationship together, but watching them work through their baggage makes them more likeable. I thoroughly enjoyed this book, and I look forward to The Monk Upstairs.Rebecca Martin is a graphic artist and single mom who rents out a downstairs apartment. When ex-monk, Michael Christopher shows up wanting to rent the apartment, Rebecca agrees even though she has some reservations because of his seeming lack of job prospects. There is something about Michael Christopher that Rebecca likes, and as they begin to know one another, an attraction develops between them. Mike has an instant rapport with Mary Martha, Rebecca's six year old daughter, and he immediately relates with her widowed mother. When their attraction results in an idyllic afternoon of passion, Rebecca is overjoyed to have found this man. Reality intrudes harshly when her mother phones and Mike panics, not wanting Rebecca to admit that he is the man she is with. Rebecca is enraged, and she doesn't speak with Mike for weeks. When Mary Martha finally causes Rebecca to be in Mike's presence again, Mike expresses his intense and heartfelt regret over his actions, and they resume their relationship. A family crisis rocks Rebecca's life, and she relies heavily on Mike during the difficult time. As they begin to meld their lives together during this time of turmoil, her disdain for his faith causes Rebecca to lash out at Mike when he takes Mary Martha to a chapel. Mike is patient and kind to Rebecca, and she realizes that she wants to keep him in her life, but she has issues to work through before she is ready to agree to a permanent commitment.This was a very enjoyable book. Michael Christopher, ex monk turned McDonald's employee, seemed to be an unlikely hero at first, but he turned out to be a great one. He was steady, caring, and had a great sense of humor. Rebecca Martin was a likeable heroine, and even though she had trouble deciding to make a permanent commitment with Michael, she realized that he was a treasure of a man. I found this to be a sweet and touching story."}, {"userName": "Jennifer", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/2048385-jennifer", "userReview": "I discovered this book years ago, quite by accident, while browsing at a bookstore. What a lovely discovery.The Monk Downstairs is basically a love story: a jaded, smart single mom (Rebecca) with all the kooky baggage that comes with that title rents an extra room to a kind, spiritually lost, wanderer (Mike) who turns out to be a runaway monk with a penchant for gardening, cigarettes, meditation, and candor. Their relationship grows into a romantic one, and the story tells how.But what makes this book special--really an exceptional work of fiction--is the emotional insight and depth Farrington is able to plumb as he crafts a deceptively simple story. The relationship between Mike and Rebecca's daughter, Mary Martha, is delicately, deftly articulated dialogue about the nature of childhood, God, and family. At the same time, Rebecca and Mike's relationship negotiates a complex and profound intimacy as it grows between two good, but very tired, people.Farrington's grace comes in depicting the depth of important relationships without every overwhelming the reader with heavy or self-conscious language. The dialogue is natural and authentic, and there are delightful dashes of wisdom, kindness, and humor which serve to make this novel compelling and rich.A beautiful book with quiet but magnificent grace. Read it."}, {"userName": "Claire", "userReviewDate": "Jul 15, 2008", "userURL": "http://www.goodreads.com/user/show/1332973-claire", "userReview": "I was surprised by how much I liked this book--not being religious myself, I was dubious about how much I could be pulled into the story of an ex-monk and a middle aged single mom with one child. That I was pulled in to this quietly contemplative novel is, I think, a testament to the artistry of the author (who is male, by the way, and creates a very convincing and deep female character.) What touched me most about this novel was its portrayal of grief and the characters' reactions to it. It was very real, very deep, and yet very quiet, such that when I finished the book I sat quietly for a bit to let it all sink in."}, {"userName": "Salimah", "userReviewDate": "Jun 12, 2007", "userURL": "http://www.goodreads.com/user/show/88902-salimah", "userReview": "the current cover of this book is a disappointing cop out. I own this book in hardback, with an original, much more poetic cover (a sepia photograph of a woman's foot and a bit of her dress), but I digress. I dreamt in the language of this book for days. After I was finished I held it for a long, long time... I was in love with this monk, who is sexual, charming, innocent, funny, spirited, and true believer, and who makes a believer of the woman who loves him. If you'd like to read a compelling story about a love that is actually possible, then give this one a whirl."}, {"userName": "Amanda", "userReviewDate": "Aug 10, 2007", "userURL": "http://www.goodreads.com/user/show/118177-amanda", "userReview": "I liked this one. I don't have a crappy ex-husband or a monk living downstairs - but I think this book was well written. She captured the brittle way that damaged people guard their privacy and their hearts, and how difficult it is to let anyone in.I have the new book, The Monk Upstairs, and look forward to reading it."}, {"userName": "Brenda (b)", "userReviewDate": "Oct 06, 2008", "userURL": "http://www.goodreads.com/user/show/915184-brenda-b", "userReview": "I read several enthusiastic reviews about this book and was curious so I picked it up. It was a terrific story. Since its genre is fiction rather than romance, it wasn't from my normal reading category, but one of the main elements of the story is the development of the romantic relationship between Rebecca and Michael. I was pulled into their struggle with their feelings for one another and trying to make their lives work together. The other element was that of religious belief and I'll admit that this aspect of the story had me feeling a bit out of my depth. Being that I'm an agnostic, I felt a connection with Rebecca, but not so much with Michael. Overall, I found The Monk Downstairs to be quite an enjoyable read, even considering the lack of a romantic happily ever after ending. I understand that there's a sequel, \nThe Monk Upstairs A Novel\n."}, {"userName": "Mary Helene", "userReviewDate": "Jun 09, 2007", "userURL": "http://www.goodreads.com/user/show/39944-mary-helene", "userReview": "How often do we read about the real spiritual lives of people? It's more elusive than sex. This book includes all of it - a lovely romance and a struggle for faith. I was sorry for it to end, and delighted to hear there's a sequel."}, {"userName": "Kat", "userReviewDate": "Jul 09, 2008", "userURL": "http://www.goodreads.com/user/show/591761-kat", "userReview": "An unexpectedly good love story, unexpectedly written by a man. There is something fascinating about the idea of an ex-monk, and Farrington deftly makes use of it. It is a sweet, engaging tale--not at all over the top."}, {"userName": "Bill Glose", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/23108003-bill-glose", "userReview": "A lost monk finds his way again through his upstairs neighbor. A cynical, single mother learns to hope again through her downstairs tenant. At its core, The Monk Downstairs is a love story, but it is so much more. Farrington’s storytelling is philosophical, spiritual, and whimsical, and somehow he pulls off this complex mix without seeming condescending. As the single mother and the monk downstairs move past earlier, regrettable decisions into an unknown future, readers can’t help being filled with wonder as they turn one captivating page after another.As with Farrington’s two previous novels (The California Book of the Dead and Blues for Hannah), he holds the reader’s interest through beautifully crafted prose and well-constructed characters. Michael Christopher, the downstairs monk, starts out as a stranger, “a lanky man with rounded shoulders and a long, sad face muffled by a beard in need of trimming...his hair was cropped close, the merest new dark stubble on a skull that had obviously been kept shorn until recently.” But as he adjusts to life outside the monastery, he evolves into the next-door neighbor we can all recognize and love.The story’s point of view is that of Rebecca, a single mother struggling to find comfort in her not-so-comfortable rut. Her daily routine is made up of simple experiences, each unremarkable but personable. Though we see the world through Rebecca’s eyes, we also gain insight into Michael Christopher’s mind through letters he writes to a monk in the order he renounced. We see events through Rebecca then share in Michael’s perception by his tone in the correspondence.Farrington crafts his scenes with vivid imagery, but not in a manner that bogs the reader down in minutia. By focusing on a few telling details, he gives us peripheral information about the characters. After Rebecca returned home from a failed date, she “passed through the kitchen to the back porch. The abalone shell on the top shelf was filled with butts; she kept meaning to empty it. She sat down, tugged her coat around her, and lit the day’s last Marlboro. Above her, the stars themselves seemed weary in a sky bleached thin by the city’s lights.” The fact that Rebecca hides her smoking from her daughter is touching. When she needs a relaxing drag, she sneaks out to her back porch, and it is imperfections such as this that make her quest for a better life so endearing.As I discovered the characters’ quirks, I grew closer to them, and as I got deeper into the story, I forgot I was reading a book. Instead, I was walking through the downstairs apartment with Rebecca and Michael Christopher, seeking comfort in their company, and searching for a perfect peace."}, {"userName": "Kristin", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/22789267-kristin", "userReview": "A sweet yet realistic modern romance with a thought-provoking spiritual twist that made for a surprisingly pleasant read. Rebecca and Mike (aka, the titular monk living downstairs) both carry with them plenty of mundane baggage and enough life experience to harbor no romantic illusions, making theirs a refreshingly mature love story. With her wry sense of humor and pragmatic approach to life, Rebecca is especially relatable. For a member of the male persuasion, author Tim Farrington is surprisingly deft at articulating the mind of a woman - and a tired, harried, disillusioned mother, at that. When Rebecca bluntly warns Mike, \"I’ve got a wonderful, pathetic little life that is precious to me,\" I nodded in solidarity. And this quote, in particular, perfectly encapsulates my entire middle-aged essence:All she really wanted was to protect her daughter's joy in unicorns. It was like loving a soap bubble, she knew, treasuring that innocence. Yet nothing else in her life right now moved her in the least. She often thought that must be a little pathetic; surely she should have found a larger cause by now. But the larger causes of her youth had bled away. Her sense of the Big Picture had fractured and decayed. She loved her daughter, the blessing of a good book, a glass of wine after the day's wave of vanity had passed.That said, The Monk Downstairs did suffer at times from an overabundance of monastic navel-gazing. Mike was a sexy monk, to be sure, but he was also very intense. He'd actually probably drive me a little nuts in real life, now that I think about it. But beyond the tendency for existential contemplation, Farrington writes in a language that is poetic, melodious, often somewhat haunting, and certainly full of beauty. If you're in the mood for a little romance with a side of quiet introspection, then I recommend The Monk Downstairs. She had a fleeting sense of his God out there somewhere, like the sea itself, invisible and dangerous, a vastness wrapped in darkness, just a long fall away.We are born to love as we are born to die, and between the heartbeats of those two great mysteries lies all the tangled undergrowth of our tiny lives. There is nowhere to go but through. And so we walk on, lost, and lost again, in the mapless wilderness of love."}, {"userName": "Janet", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/1162386-janet", "userReview": "I raced through this book in one day -- not because it was slight, but because the prose was so graceful and easy to read, the characters so engaging, and the spiritual aspect so deft but satisfying, that I simply could not put it down. Mike, a monk who has fled his monastery after eighteen(?) years, rents a basement apartment from Rebecca, a divorced single mother disillusioned by life, but fiercely loving toward her daughter and mother. Mike is a contemplative who spent more than a decade in conflict with this activity-focused abbot, and Rebecca a busy woman with no sense of an inner life. Each is a modern archetype of the New Testament figures of Mary and Martha (not-so-subtly referenced by the daughter's name: Mary Martha), and as they fall in love, Mike learns what it's like to be lovingly engaged in the world, and Rebecca begins to experience the inner peace of spirituality. Not because either explicitly teaches the other, but as a natural outgrowth of their experiences together.Which sounds hideously heavy-handed -- but it's not. Mike and Rebecca are more than their archetypal roots: lovable, flawed, earnest, and striving. Their spiritual challenges are explicit, but arise naturally out of their personalities and their lives. This isn't \"Christian fiction\" as I would usually characterize it. The characters' spirituality is understood within a Christian context, but there is no formal \"redeemed by Jesus\" arc. I found what I consider to be very wise theology throughout the book, theology which transcends Christianity, in my opinion as a former Christian.This is a really, really good book for anyone who enjoys romance between grown-ups and who appreciates the pervasive presence and significance of spirituality in life without a preachy tone."}, {"userName": "Dannielle Insalaco", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/3132471-dannielle-insalaco", "userReview": "I thought this was a lovely story."}, {"userName": "Andi", "userReviewDate": "Nov 09, 2008", "userURL": "http://www.goodreads.com/user/show/52752-andi", "userReview": "Some weeks ago someone (identify yourself if you will) reviewed this book on their blog, and I thought - well, I should read that. Now, usually I think that, put it on a list, and don't get back to it for years or decades. But this book - The Monk Downstairs by Tim Farrington - actually came through BookMooch right away, and I happened to want to read something romantic but not silly. So last night, there I was finishing the book in an evening - I can't remember the last time that happened with an adult book (Harry Potter, Twilight - those are one night books). Farrington's book is thoughtfully and carefully written. In brief, it's the story of a single mother (and yes, he does write the perspective of a woman very thoughtfully -I should know) whose downstairs tenant is a monk who has just left the monastery. The novel details their building relationship, his coming to terms with life outside of the cloister (wisely told through a series of letters to another monk), and her acceptance of her life as it is now - grief and all. I won't give you must more of a synopsis than that because I don't want to spoil it for you - but that's the gist. I really liked Farrington's work because it is, first of all, a fairly normal story. There are no car chases or gun fights, no wild or kinky encounters, no throw it all to the wind decisions. Instead, it's the story of real people in a real place (San Francisco - I liked that, too, because I could see all the places they went - his description of the sea beyond Tamalpais brought me to tears of longing), and it's just simply about people trying to live life the best they can. I appreciate that. Also, there's a great study in the contemplative life here - is it better to a person of prayer or a person of action? To be Mary or Martha? This is a question I struggle with often, and I was glad to see Farrington's monk wrestle with that angel, too. In fact, as I was reading, I had this thought - not profound and very yogic but still - perhaps all we can do is what we know to be needed at the moment. Action when called for; prayer when space is beckoning. All in all, I loved this book, really, and I would like to share it with you guys."}, {"userName": "Anne", "userReviewDate": "Oct 08, 2007", "userURL": "http://www.goodreads.com/user/show/223993-anne", "userReview": "I borrowed this book based on the title alone. Who wouldn't want to read a book about a monk living downstairs? In this case, an ex-monk, who has left his monastery, disenchanted with his life of prayer and inaction. He moves into the in-law unit of single mom, Rebecca, who has decided once and for all that she no longer needs love in her life. Her 6-year old daughter plays with unicorns, adores her good-for-nothing surfer father, and takes an immediate liking to Michael Christopher, the monk. Obviously, we know Rebecca and Michael are headed for romance - and a clash of cultures. The concept for this one was ripe for a fun romantic comedy with a little theology on the side, but sadly even though the book is pretty short, it seemed to drag on and on. Throughout, Michael writes letters to a monk back at his old order, explaining his new life and his decision to leave the monastery - but the letters aren't particularly insightful, and while he hints at a scandal or major blowout with his abbot, it never turns out to be of much interest. A downstairs monk held so much promise, but unfortunately, my faith led me only to disappointment."}, {"userName": "Carolyn", "userReviewDate": "Jan 12, 2012", "userURL": "http://www.goodreads.com/user/show/1911275-carolyn", "userReview": "This is a warm and intelligent book about a single mother who rents the basement apartment in her house to a man just leaving a monastery after 20 years as a monk. I found it on the book sharing shelf of a business in my neighborhood. The monk, Michael Christopher, ends up getting a job at McDonald's and some of the reflections on his work there, shared through letters with Brother James back at the monastery, are wonderful. \"...as my colleagues at McDonald's put it, \"My bad.\"...The ritual response to a penitential \"My bad,\" incidentally, is a benevolent \"It's all good.\" The drama of Christ's gift of forgiveness is reenacted a dozen times a day over the deep fryer and the grill, by teenagers, with refreshing succinctness.\"Of course, Michael Christopher and his landlord, Rebecca, end up falling in love and the action ensues. There are few literary characters I can think of who can reflectively quote scripture and preside at liturgical events and yet are great in bed. This book is a pleasure to read!"}, {"userName": "Heidi", "userReviewDate": "Nov 20, 2008", "userURL": "http://www.goodreads.com/user/show/1064531-heidi", "userReview": "While I enjoyed the conversations between Rebecca and the monk and how their relationship grew, the book became weighed down with what was supposed to be deep spiritual thoughts, but I found to be nothing more than vain rhetoric meant to make the author sound smart. Is the monk life a manifestation of religious conviction or escape from the responsibilities of the real world? I guess the monastic life seems like a waste to me. Who are you serving, but yourself if all you do is pray and in the case of the monks that lived on the hill above my high school, make chocolates to sell, but not interact with or actually serve anyone? But I guess my respect for the author flew out the window when I read that he was a monk for 2 years before running off with the dish girl. Really, he did."}, {"userName": "Kathleen Valentine", "userReviewDate": "Nov 28, 2009", "userURL": "http://www.goodreads.com/user/show/1471504-kathleen-valentine", "userReview": "This book started out really, really well. I loved Michael, the monk, who is hard not to love --- he's sweet, kind, sexy and disarming. Rebecca's little daughter Mary Martha is darling and she and Michael have a charming relationship. Rebecca's mother Phoebe is a hoot and highly likable. But Rebecca was hard to take after awhile. Her little hissy-fit when poor Michael, who had been out of circulation for 20 years, hesitated about telling her mother that they were sleeping together after their first weekend together was completely childish. I had a hard time liking her after that.It's a sweet story but Rebecca could use a good kick in the pants."}, {"userName": "Ana", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/10673016-ana", "userReview": "A wonderful surpriseI have a soft spot for books about people who are \"God haunted\" so I was of course drawn to a book about an ex-monk. This book is not so much about religion and it's disillusionment it's about more. It is a love story but also this thoughtful meditation about what it means to live \"in the world\" and balancing living a life with being contemplative. The tone is meditative and thoughtful. The writing is rich, and descriptive. I read it slowly and savored every well crafted sentence. My favorite parts are the letters he writes to his friend in the Monastery. I find myself wanting to read everything this author has ever written."}, {"userName": "Doris", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/11781529-doris", "userReview": "The 'monk' of the title is Michael Christopher, who has just left the monastery after some 20 years and becomes the tenant in the downstairs 'in-law' apartment belonging to Rebecca Martin, divorced mother of 6-year old Mary Martha. That a romance shall result is predictable from the start. Michael is a little too good to be true: nothing ever seems to anger or even disturb him. Rebecca, on the other hand, is a little too prickly. Mary Martha, though, seems dead-on, and the other supporting characters are well written and engaging.Engaging and easy to read."}, {"userName": "Barb", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/7430371-barb", "userReview": "Story of a 38 year old mom who rents her downstairs apartment to a newly released monk, Michael Christopher. Although the love story is predictable, there were plenty of twists of friends and love and her spontaneous daughter, Mary Martha. The daughter's name is a metaphor on the biblical story of contemplation/meditation and a life of service. This theme plays out for several of the characters. I really enjoyed the funny awkward situations the mom and monk find themselves working through. I could visualize the engaging scenes from the authors clear writing. I'd recommend it."}, {"userName": "Kayne Spooner", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/2750611-kayne-spooner", "userReview": "This story is about a single mother that rents her downstairs apartment to a Monk going through a crisis of faith. The book is full of eccentrics and thoughtful humor. I heard Julia Roberts ahd bought the movie rights and wish she would get around to making this movie! I was glad to see the sequel, A Monk Upstairs, come out and would love to see another."}, {"userName": "Jessica", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/1053059-jessica", "userReview": "I unabashedly loved The Monk Downstairs.I wasn't quite sure what I was in for, but I think it was something close to a standard level romance novel. It certainly was not.Mike, a former monk, rents a small apartment from Rebecca, a single mother to six year old Mary Martha (which, side note, is quite the name to saddle a six year old with!) Mike, unused to life on the outside after 20 years in the monastary, takes a job at McDonald's and starts learning what it is to live in the world. He finds himself drawn to Rebecca, who struggles with the idea of opening herself up to another man.For me, the main thing that stood out was the discussion of spirituality. I'm Catholic, and most books get it wrong. This book got all of its theology correct, and even managed to introduce some interesting theological discussions. Mike is trying to find his new relationship with God, while Rebecca isn't sure that she has the right to one anymore. She doesn't get there in this book, which felt very realistic. After I finished, I read the author's notes, and discovered that he was a former monk, so the accuracy makes sense.The romance was sweet. In books, as in real life, I prefer quieter men (what the romance world calls betas.) Mike is not your typical hero, which made me like him all the more.Highly recommended."}, {"userName": "Bibliothekerin", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/13181332-bibliothekerin", "userReview": "I give this 4 stars as general fiction, 5 if viewed as romance. The book is very good, and I appreciate authors who add a spiritual element, one with out the fundamentalist holier-than-thou attitude.The character of Michael Christopher is humble yet brave enough to take a risk that would be extremely difficult for someone concerned with the soul, and anyone who has spent two-thirds of one's career in one place. How many of us could do the same? He didn't have to leave. No one forced him to. In a way, he reminds me of Martin Luther, who was also a Roman Catholic monk, and who also wrestled with doubts. He too went through a 'dark night of the soul'. This is obviously no theological treatise; it's just a story about a man and a woman who have both experienced challenges difficult to survive unscathed. It is more than an average love story, though. it has heart, and soul--a nice change from the norm, if you care about such matters.I had written a lot more, but once again I was composing online, rather than safely typing offline in a doc then Copying & Pasting into the GoodReads text box. Yes, once again my review was zapped when the website froze. So this is it for now—time to move on."}, {"userName": "Carlin", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/11565234-carlin", "userReview": "While this was a novel of love, I would never call it a \"romance\" in the literary meaning of the genre. I think having a male author had a lot to do with it and that the author had a personal history of being on a contemplative spiritual retreat in a Buddhist-like place in California as a young man. The novel largely revolved around Michael Christopher's journey into \"real life\" after spending 20 years in a monastery. He rented an in-laws apartment from Rebecca, a feisty, funny single mother of precocious 6 year old Mary Martha. It is a book about relationships, between Michael and his old monk advisor, told in his letters to Brother James, between Rebecca and her mother, Phoebe, between Rebecca, and subsequently Michael with Mary Martha, between Rebecca and Michael, and ultimately with each one's personal idea of God. It is not a \"religious\" book but definitely has a spiritual aspect. It was a lovely book and I highly recommend it. I would note that it was published in 2002. I plan to read the sequel which was published 5 years later. I found the changes in technology over the years to be a facinating subtext in the first book."}, {"userName": "Theresafic", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/1758995-theresafic", "userReview": "Simplistic book with some glaring holes. Rebecca has a six yr old daughter at the beginning of the book in the summer, however in the fall she is not in school but still in day care. It was mentioned she was learning to read.Also what Mom stays in a hospital for days without going home to her daughter just letting her new boyfriend not only take care of her daughter but going grocery shopping. Where was her Father?Also her Moms room was suddenly filled with flowers but no mention of her huge group of friends helping out at all.Also way too religious for me. I just wanted to finish it."}, {"userName": "Kit", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/933362-kit", "userReview": "I have mixed feelings about this book. On one level, it’s a light read with a fairly predictable romance. The more interesting component is the correspondence between the monk who left the monastery and one who stayed. Without diving into what I would have considered an undesirable discussion of religious beliefs, their dialogue raises interesting big picture philosophical questions. This part of the book was more deeply felt as it was (not surprisingly) fueled by the author’s life experience."}, {"userName": "Jamie", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/5072262-jamie", "userReview": "An engaging and unusual novel. Some of the meditations on God and the difference between the active and contemplative life were somewhat beyond me. The meditations were pertinent to the story, although you could probably scan or skip them if they aren't meaningful to you. I liked the characters and of course San Francisco and Marin make for a fine setting."}, {"userName": "Virginia S Branham", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/26884187-virginia-s-branham", "userReview": "Life, easy and hard and that stuff in the middleThis was a very well written book with the most unusual character and I found I liked him very much. Monks are not usually the stuff of romance of any kind but this was more about living life, loving God and trying to be the best you can be when you are human. I enjoyed this book and would suggest to my friends."}], "description": "Rebecca Martin is a single mother with an apartment to rent and a sense that she has used up her illusions. I had the romantic thing with my first husband, thank you very much, she tells a hapless suitor. I'm thirty-eight years old, and I've got a daughter learning to read and a job I don't quite like. I don't need the violin music. But when the new tenant in her in-law apartment turns out to be Michael Christopher, on the lam after twenty years in a monastery and smack dab in the middle of a dark night of the soul, Rebecca begins to suspect that she is not as thoroughly disillusioned as she had thought.Her daughter, Mary Martha, is delighted with the new arrival, as is Rebecca's mother, Phoebe, a rollicking widow making a new life for herself among the spiritual eccentrics of the coastal town of Bolinas. Even Rebecca's best friend, Bonnie, once a confirmed cynic in matters of the heart, urges Rebecca on. But none of them, Rebecca feels, understands how complicated and dangerous love actually is.As her unlikely friendship with the ex-monk grows toward something deeper, and Michael wrestles with his despair while adjusting to a second career flipping hamburgers at McDonald's, Rebecca struggles with her own temptation to hope. But it is not until she is brought up short by the realities of life and death that she begins to glimpse the real mystery of love, and the unfathomable depths of faith.Beautifully written and playfully engaging, this novel. is about one man wrestling with his yearning for a life of contemplation and the need for a life of action in the world. But it's Rebecca's spirit, as well as her relationships with Mary Martha, Phoebe, her irresponsible surfer ex-husband Rory -- and, of course, the monk downstairs -- that makes this story shine.", "title": "The Monk Downstairs\n      \n          (Monk)", "url": "https://www.goodreads.com/book/show/382555.The_Monk_Downstairs", "average": 3.49, "cover": "https://images.gr-assets.com/books/1440833706l/382555.jpg", "reviews": 256, "authors": [{"url": "https://www.goodreads.com/author/show/96378.Tim_Farrington", "name": "Tim Farrington"}], "type": ["Fiction", "Romance", "Contemporary", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/382555.The_Monk_Downstairs", "http://www.goodreads.com/book/show/1479713.The_Monk_Downstairs", "http://www.goodreads.com/book/show/1479712.The_Monk_Downstairs", "http://www.goodreads.com/book/show/382556.The_Monk_Downstairs", "http://www.goodreads.com/book/show/9441647-the-monk-downstairs", "http://www.goodreads.com/book/show/10547320-the-monk-downstairs", "http://www.goodreads.com/book/show/917108.The_Monk_Upstairs", "http://www.goodreads.com/book/show/165861.Lizzie_s_War", "http://www.goodreads.com/book/show/473700.Blues_for_Hannah", "http://www.goodreads.com/book/show/6072688-a-hell-of-mercy", "http://www.goodreads.com/book/show/473701.The_California_Book_of_the_Dead"]}