{"ratings": 9626, "userreviews": [{"userName": "Aly's Bookish Wonderland", "userReviewDate": "Dec 06, 2014", "userURL": "http://www.goodreads.com/user/show/22178203-aly-s-bookish-wonderland", "userReview": "“But this is life, and when bad things come to us, there isn't much choice. You survive them or you don't.”\nI doubt I have ever given five stars to an ARC. I'm pretty easy to please when it comes to books, and I do give out a large amount of near-enough or full-on five stars, even if others have rated it one. As long as it keeps me hooked and the characters are enjoyable, I'm happy.The Magician's Lie is all of that and more.What I liked:- Amazing Arden's amazing life story.- Amazing Arden's torturous love stories.- Amazing Arden's mind.- The writing.- The amazing plot.What I didn't like:Nothing. Shocked? I am, too. Because The Magician's Lie is perfect in every single way. There is absolutely nothing I would change about it.Full review to come on 100% Rock closer to the release date.EDIT: 04/02/2015: Okay, so last time I checked, this was coming out in April.Apparently, it came out last month.This is not okay."}, {"userName": "Carol", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "The Hook - Imagine my confusion while listening to The Magicians on my mp3 player when all of a sudden the transformation from one disc to the next throws me into a different narrator and unfamiliar story. After my initial thoughts of “What the heck?” I realized I had intertwined this and The Magician’s Lie on my player. In those few moments of listening to The Magician’s Lie I knew it would have to be read soon.The Line - “I might be a prisoner but I didn’t have to be a victim.”The Sinker - Stories about magicians have always interested me. I love to hear how they perform their illusions and even though I know the magic can be explained, the magic remains in how I perceive it. Most reviewers jump right into the crux of this tale, one that teeters on the edge of the late 1800’s into the early 1900’s. Told in dual timelines, we learn that in 1905, a disabled officer of the law, in the town of Janesville, Iowa, fears his career is at an end but fate offers him one last chance to save his job. The husband of the famous Amazing Arden, a renowned circus owner, one who performs the most incredible magic, is found dead, victim of a horrific axing. Arden, the most logical suspect flees and happens into Janesville where she is captured, shackled and handcuffed to a chair at the one room prison by Virgil who hopes to get Arden to talk. Though the murder and subsequent flashbacks of what brought Arden to Janesville are interesting, this is not where the whole story begins. Born as Ada Bates in Philadelphia with aspirations to become a dancer, her dreams are dashed with the arrival of an evil older cousin, Ray who seems bent to control every aspect of her life. It is here that Ada’s first flight takes place and eventually leads her to becoming a premiere illusionist who perfects the controversial act, not trick, called The Halved Man. Much more is unveiled as we read what happens in between Ada’s beginning and Arden’s end. Brutal scenes of abuse are counter-balanced by the power of love and healing in this historically accurate, absorbing debut of a determined woman. The comparison to Water for Elephants harms in this case. Though The Magician's Lie might be considered a circus story, it should be read on its own merits. I vascillated between 3 and 4 stars and decided to go with a strong 3. The audio was narrated by Julia Whelan and Nick Podehl, each giving distinctive voice to their character’s story; Ada by Whelan and Virgil by Podehl. I had minor quibble when each spoke as the opposite gender but this was a small distraction and shouldn’t keep anyone from listening to this performance."}, {"userName": "Kaora", "userReviewDate": "Jan 07, 2015", "userURL": "http://www.goodreads.com/user/show/7983564-kaora", "userReview": "Tonight, I will do the impossible.The impossible is nothing new to me. As I do every night, I will make people believe things that aren't true. I will show them worlds that never existed, events that never happened. I will weave a web of beautiful illusion to ensnare them, a glittering trap that drags them willingly with me into the magical, false, spellbinding world.The Magician's Lie was a thrilling book about a female illusionist, who is well known for her trick of sawing a man in half. When her husband is found dead in the very coffin where her trick is performed, the policeman Virgil Holt takes her into custody. There she begins to tell the story of her life, a story that may see her hanged, or set her free.Tonight, I will escape my torturer, once and for all time.Tonight I will kill him.I have a secret. If a book compares itself to The Night Circus it is pretty much a guarantee it will end up on my to be read pile whether it deserves to be there or not.However much to my surprise I was hooked from the very start with this book. The Amazing Arden, or Ada was an intriguing character. While I spent the entire book in doubt as to her innocence, I was still rooting for her. I could identify with her.So, now you know one of my weaknesses. I believe the things people tell me.The book was slow moving but that worked in its favor, allowing me to get to know the protagonist, and building suspense that made me unable to put the book down. My only issue was that once I reached the end, it fell short of my expectations. It was still a good conclusion, but it wasn't all I thought it would be due to the suspense built.However the magic was still there, and I did truly enjoy the journey."}, {"userName": "Tania", "userReviewDate": "Jan 04, 2015", "userURL": "http://www.goodreads.com/user/show/6450088-tania", "userReview": "There were so many other lives I wasn't leading, all because of a handful of choices, mostly made by others.I couldn't decide on a rating for this book - I enjoyed most of it, although I definitely did not agree with the blurb's statement of Water for Elephants meets The Night Circus. Three quarters of the book was a quick, fun read and I especially enjoyed reading about the tricks of the magic trade. I hated the ending though, it felt rushed and did not fit the rest of the story. I decided on a 2.5 star rating as it was ok for me, but nothing I'll remember in a week or two."}, {"userName": "Diane S ☔", "userReviewDate": "Oct 01, 2014", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "3.5 The amazing Arden, caught fleeing into the night after the murder of her supposed husbands murder. Virgil Holt is the lawman who catches her and he has a big problem of his own. Started off vey slowly and in the beginning it was hard to accept the premise that makes this story work. It is when Arden begins to tell her story to Holt that the novel becomes fascinating, that is if you are a lover of magic and illusions. Loved reading about how these illusions are performed, the planning behind them. All the performers and props that are needed. Arden's life itself is astounding and she has a secret gift of he own that will be part of the reason Virgil will continue to let her tell her story. The writing itself gets stronger as the story continues.In the end Virgil will not get exactly why he wanted from her but will learn something very valuable nonetheless. As for what happens to Arden, well to find out you will have to read the book.ARC from NetGalley."}, {"userName": "Snooty1", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/56024443-snooty1", "userReview": "This book was such a pleasant surprise.It's gothic, dark, sensual and has a touch of a thriller in it. I know that I was more than a little tense at the end. This story starts in Waterloo, Iowa in the early 1900s. (pure excitement I realize...I can say that because I lived in Iowa for a while..so there.) Our Amazing Arden is an illusionist, and not just any illusionist but a FEMALE illusionist. That matters...because sadly...it matters. The very early scenes of the book are of her amazing show then subsequently the body of her husband is found...and she's missing. The story is told from two points of view. The first is the young police officer that finds Arden and is holding her to be turned into the police officially, and then the POV of Arden. She weaves us the story of her life to prove her innocence to her captor.IT'S WONDERFUL. There is love and intrigue, revenge and of course...MAGIC. I love the idea of hearing about the life of a woman in the late 1800s-early 1900s."}, {"userName": "Darlene", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/1809697-darlene", "userReview": "As Jane Austen said, 'Those who tell their own story, you know, must be listened to with caution.\" When reading this novel, The Magician's Lie, those words of caution apply. This story, which begins in 1905, is told by a very unreliable narrator… Ada Banks, currently known and lauded as 'The Amazing Arden'.. a famous magician/illusionist. On a summer evening in 1905, 'the Amazing Arden' has just finished a show in Waterloo, Iowa. Arden has kept the audience transfixed, skillfully using scarves and coins to misdirect their attention to lead them to see what she wished for them to see. She ended the evening with the illusion which had perhaps become her signature… 'the Halved Man'… using an axe to appear to slice a man lying in a box in two (complete with screaming and bloody special effects)….. and then pulling that man from the box seemingly healed and in one piece. On that particular July evening, the police were called when a man was found murdered in the very wooden box Arden used during the show…. and what made the crime all the more sensational was that the man discovered was thought to be Arden's own husband…. or WAS it?Arden was arrested that night by Officer Virgil Holt in nearby Janesville, Iowa and she spent the night and the early morning hours relating her story to Officer Holt and of course, to the reader…. who was murdered that night?; who committed the murder?; and what led up to the tragic event? This novel aims to answer these very questions; but DON'T expect the answers to be laid out succinctly and in order…. Officer Holt and the reader are taken on a wild and often confusing and frustrating ride! 'The Magician's Lie' is told in the voice of Arden and she takes the reader with her, moving backward and forward through her life story, starting from her early childhood in Philadelphia in 1892… telling the story of a young girl who would do anything to please her distant but not unkind mother…. telling the story of love lost and found again… and telling the story of a young woman who learns to reinvent herself over and over, finally becoming a famous illusionist. Through these flashbacks, the reader discovers not only the strength and resilience that characterizes this young woman but also that she has been hiding some very painful secrets…. secrets of a tormenter.. an abuser… who has stalked and followed her every move throughout her life. The reader becomes aware that Arden is a complicated character but one question always remains… just what parts of her story are true?…. and what parts are fabricated to manipulate Officer Holt and the reader? Although I have mixed feelings about stories told by unreliable narrators, I have to admit that I enjoyed the suspense that was created in 'The Magician's Lie'. I found myself eagerly turning the pages to discover Arden's story, even though I maintained the thought in the back of my mind that she was likely manipulating my emotions, trying to evoke sympathy and understanding for her predicament. I have always enjoyed stories about magicians/illusionists… such as Harry Houdini… and I enjoyed the story of this self-made woman who also excelled in the art of creating illusions. Perhaps it is simply my habit to read too much into a book, but I couldn't help but wonder as I read, if this story was not about, on some level, how easily people are led to see what others want them to see…. and just how easy that process can be in the hands of skilled manipulators. Regardless, if you enjoy stories told by unreliable narrators and you enjoy historical fiction, I believe you will enjoy this story. It kept me reading.. and wondering until the very end."}, {"userName": "Edward Lorn", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "This cover really speaks to me. The image... the title... the position of the hand...It says: \"The magician's lie is that, instead of making the doves disappear, she hides them in her butt.\"Right?Pardon me, but... HAHAHAHAHAHAHAHA!!!No offense meant to fans of the book or the author, but the unintentional symbolism of the title and the cover is hilarious. Keep on keeping on, Greer Macallister. I'll give you five stars just for giving me a chuckle."}, {"userName": "✨Susan✨", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/21276121-susan", "userReview": "A woman is kidnapped by a lawman in order for him to privately interrogate her for a murder that has just occurred. When she begins her story starting with her childhood he is exasperated, but as she goes through the events of her life he becomes more curious, hopefull and a bit empathetic. Many truths are revieled and he begins to belive that she may actually be innocent. A good mystery with just a hint of magic."}, {"userName": "Liz Barnsley", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "I have mixed feelings about The Magician's Lie. Thought the writing was GREAT, got all caught up in the story then it fell somewhat flat. The ending was just, I don't know. The title suggested some sort of something that never really materialised. The Magician's life story as told to the policeman that arrested her was highly compelling but somewhat unexpected based on the blurb which seems to imply either a kind of \"now you see me\" type magic twisty story or at least a strange or unusual outcome. This was more drama than thriller. I still liked it very much. Fuller review will appear for the blog tour."}, {"userName": "Sarah", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/305349-sarah", "userReview": "A while back, in the comments I made following my review of Timothy Schaffert’s The Swan Gondola, I confessed that I don’t usually go for novels about circuses and fairs and things of that nature. Although I loved that particular book.Then I read and reviewed Rosie Thomas’ The Illusionists, about a troupe of magicians in Victorian London, and enjoyed that one, too.Now, when presented with a 3rd recent historical novel about magic and magicians, I had no qualms about picking it up, and I’m very glad I did. The storyline grabbed me from the first paragraph, and the pacing and narrative tension remained strong through the end. Although I had correctly guessed part of the conclusion, other aspects were a surprise.Guess it’s time for me to revisit my reading preferences – at least in terms of magicians. (I still don't like circuses.)Set amid the alluring world of stage magic at the turn of the 20th century, Greer Macallister’s The Magician’s Lie is a novel about reality and illusion, love and betrayal, wealth and destitution, confidence and fear, truth and deception – and how quickly one can transform into the other.The premise is thus. In Waterloo, Iowa, one evening in 1905, hours after the renowned female magician known as the Amazing Arden performs a unique variation on her controversial “Halved Man” trick, the bloodied body of a man – her husband – is found stuffed into a smashed wooden container beneath the stage. Had she killed him before the crowd as part of her act? Seizing the opportunity, Virgil Holt, a down-on-his-luck police officer from the nearby town of Janesville, catches the beautiful young woman during her planned escape and carts her into the station for questioning.Arden claims not to know that anyone was murdered, but Holt doesn’t believe her. She insists he’ll be killing her if he doesn’t let her go. Not convinced, but willing to listen, he handcuffs her wrists to a chair to prevent her from fleeing and demands to know the truth.And so she spins a tale about her life and career that takes her from Tennessee farm country to the vaudeville circuit and on to national fame as a brilliant and daring performer. (There’s plenty more, but I won’t be giving it away.) Is it fact or fancy or some of each? Either way, her story is so diverting that it’s easy to forget the author behind the curtain.Edgy and exciting, The Magician’s Lie is a fast-moving historical novel that I would also recommend as a “gateway book” for introducing historical fiction to newcomers. Arden’s voice is fresh, appealing, and (seemingly) sympathetic. Without overburdening them with details, Macallister offers readers many informative new tidbits, such as the inner workings of specific magic tricks. She also presents the life of an itinerant performer in the late 19th century from an unusual viewpoint: that of a woman.In the “conversation with the author” at the end (please save it until later if you plan to read the book!), Macallister says that since she was new to historical fiction, the writing process took about five years from initial idea to final draft. It may have required a lot of time and effort, but I think she got the difficult balance of fact and fiction pretty much right. This review was first posted at Reading the Past. I received this ARC from the publisher's booth at BEA last year."}, {"userName": "Vicki", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/1592696-vicki", "userReview": "Absolutely spellbinding historical fiction. One of the first female magicians in the country in 1905, the Amazing Arden is accused of murdering her husband. Fleeing the scene of the crime, she is captured by local lawman Virgil Holt. As Holt tries to determine her guilt or innocence, Arden weaves a mesmerizing tale. But what is the truth? Did she do it or not? And will Holt turn her in or let her go? This is a great read for book groups and fans of Water for Elephants."}, {"userName": "sue", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/7377874-sue", "userReview": "This book starts off quite dramatic which help pull you in right away.The Magician and her axe! And is that fake blood?The stage smoke as it lingers and goes over toward the audience and in the audience that night was the Towns only police officer.Its the 1800's, we have folk riding on horses to get to their destination. So you need to put your mind back to that era and how people lived. The name of the arresting officer is Holt. Some interesting conversation and dialogue go on between Hold and the lady magician, it really gripped my attention, I did feel I was eavesdropping on a private conversation. The author threw us back in time to learn more about Ada and how she became a magician and her life, so it jumps from the 1800's to 1905.Holt question her, why did she kill her own husband.This beggars the question throughout the book is, is Ada telling the truth and is she telling the entire truth.Going back in time again with Ava it sheds light on her past and why things were pretty dynamic I got easily lost within the pages.I have to say I didn't know what I was getting into with the book when asked if I would like to join the tour by Legend Press, I am glad I agreed."}, {"userName": "♥ Sandi ❣\t", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/4984609-sandi", "userReview": "4 stars Another great book by Greer Macallister. This author is so easy to read. Her words just flow. You actually visualize what she has put on paper. The story of an Illusionist. One who is being arrested for murder - the murder of her own husband in Waterloo Iowa, right after her performance. Having just that night performed the 'saw a man in half' illusion, Arden instead of the saw, used an ax. Her dead husband found, she is arrested and begins to tell her sordid tale. Police officer Holt needs to determine the truth - how much of her personal story is illusion, how much truth? Arden starts at the beginning, long before she was an Illusionist, with her dream of being a ballet star. Throughout the night she tells her story. Come the dawn her fate is sealed."}, {"userName": "Tammie", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/3506989-tammie", "userReview": "The Amazing Arden is the most famous female illusionist of her day, renowned for her notorious trick of sawing a man in half on stage. One night in Waterloo, Iowa, with young policeman Virgil Holt watching from the audience, she swaps her trademark saw for a fire ax. Is it a new version of the illusion, or an all-too-real murder? When Arden’s husband is found lifeless beneath the stage later that night, the answer seems clear. The Magician's Lie kept me hooked pretty much from start to finish. It's historical fiction and magical realism with a touch of mystery thrown in. I was actually expecting much more investigation of that mystery, but instead we get the back story of the main character after she is arrested as she tries to explain what happened and why. The story was very interesting and I got sucked into it right along with the police officer in the book, it kind of felt like Scheherazade spinning her tale all through the night to save her life. It really left me wondering throughout most of the book whether or not she was telling the truth and what the lie is that the title eludes to.Probably the biggest flaw of the book for me was the police officer didn't seem very competent. Nothing he did seemed very much in line with what a police officer would do, even back in the early 1900s. I could also probably pick the book apart and say that the way men and women acted around each other wasn't always in line with the way they would have behaved around each other during that time period, but it really didn't bother me in this particular story. I'm happy to say that this one lived up to my expectations.Review also posted at Writings of a Reader"}, {"userName": "Jen", "userReviewDate": "Aug 09, 2014", "userURL": "http://www.goodreads.com/user/show/145234-jen", "userReview": "I'm sorry to say, this book waivered between holding my interest and losing my attention. There were moments of suspense, followed my pages of dull storyline."}, {"userName": "Katie(babs)", "userReviewDate": "Jun 14, 2014", "userURL": "http://www.goodreads.com/user/show/179852-katie-babs", "userReview": "If you liked The Night Circus, with the feel of Downton Abbey, you’ll enjoy The Magician’s Lie by Greer Macallister. It has this near seductive narrative from the POV of Arden, the main protagonist as she tells her story to the detective who’s holding her captive until she admits she killed her husband.There are a great deal of flashbacks that really add to the flavor of the story and gives the reader great insight on who Arden is. She’s illegitimate, and moves with her mother to her relatives’ farm where she meets her cousin Ray, who she soon realizes isn’t right in the head. Ray is a sociopath who enjoys hurting animals (and himself) with the purpose to see if he can heal them. He becomes obsessed with Arden and wants to break her so he can heal her, which he almost does. She runs away in fear for her life. She goes on an adventure and meets another man who makes her stronger, wiser and then breaks her heart. Years later, Arden becomes a master illusionist, although the audience she astounds thinks of her as a magician. And then her entire world comes crashing down when Ray reenters her life and forces her to do whatever he wants to her.The Magician’s Lie is well written and so very engaging. Arden’s story grabs hold of you until the very end. There are many twists and turns regarding Arden and how she can be an incredible illusionist. This twist is revealed half way through and has a bit or irony behind it in regards to Ray and his goals. Ray is a real nasty number, and you shudder alongside Arden as he stalks her with malicious intent. I wish he was more well-rounded because he comes across as a bit one-dimensional (reminds me of a mustache twirling villain), but his purpose with Arden is chilling.The dialogue and descriptions are rich and you end up cheering for Arden as she tries to escape a horrible psychopath, whose purpose is to destroy her for no real reason. The last 30 pages are fantastic. You will cheer for Arden as she ends up creating her best illusion in order to save her life."}, {"userName": "Jenny Kim", "userReviewDate": "Dec 05, 2014", "userURL": "http://www.goodreads.com/user/show/26072770-jenny-kim", "userReview": "Overall, this book had a lot of shortcomings which stood out too much for me to forgive. Too many holes and hard to believe contents made the good stuff not as good when seen as a whole. As well, potentials were not fully explored – Ada’s gift, Ray, and Virgil. The concept worked partially, in that I found Ada/ Arden’s story interesting but the set up to get to her back story was awkward and didn’t make sense to me. Ada gets arrested by a small town cop, Virgil, accuse of her husband’s murder, and in order to save herself, she tells him about her life story. The whole story is told within five hours but the fact that Virgil decides to listen to her story during wee hours didn’t make sense to me. I think the author could have set up this better because Ada’s story is not bad. Finally, the ending that felt flat, rushed and hard to believe, made my rating drop.  The writing itself is okay, nothing special, just basic.I'm being nit-picky but I also had an issue with the title. The title indicates something that is not the case hence misleading and conjuring something that is not there. Is her story a lie or truth? Based on what I’ve read, except for one thing nowhere does it indicate that Ada was lying to Virgil."}, {"userName": "Erika Robuck", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/2103117-erika-robuck", "userReview": "Greer Macallister handles the reader with the command and brilliance of a world class ringmaster. THE MAGICIAN’S LIE is a mesmerizing novel of illusion, secrets, and suspense. Bravo!"}, {"userName": "Lucy Banks", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/57486568-lucy-banks", "userReview": "I received a copy of this book from Netgalley, in exchange for an honest review.A quick, thoroughly enjoyable read, delving into a world of magic and illusion.When I saw that this book was compared to The Night Circus, and hailed as a great read by none other than Oprah Winfrey herself, I felt duty bound to request a copy. I'm a total sucker for anything relating to magic, and this promised to be an entertaining read.Whilst I didn't feel that it was anything like the Night Circus (not sure who came up with that comparison), it was an enjoyable, well imagined read nonetheless. We meet Arden, one of the world's only female illusionists, on the run. She's suspected of killing her husband on-stage, and looks as though she'll escape, until Virgil, a policeman, catches her and handcuffs her to a chair.Whilst imprisoned, she begins to tell him the story of her life; starting off as the daughter of a weak-willed woman who married for money, she quickly falls foul of Ray, a sinister boy with a penchant for hurting people. After a rape attempt, she flees, finding safety as a servant. But, as you might expect, this lady is destined for better things, and along with the handsome, feckless Clyde, she runs away to New York.It's there that she joins a travelling magic show, run by a formidable female called Adelaide, who gives her a taste for the magical life...which she manages perfectly, until the fateful day she's collared for murder. There was much that was great about this book. I love a good old 'quick read' sometimes - and that's not me being disparaging; sometimes it's a welcome change to have a book that you can devour easily in a few sittings. The action was well paced and compelling, and kept me turning page after page, eager to know what happened next.Likewise, it was impossible not to like Arden (or Ada, as she starts out). She's a feisty little thing, strong-willed and thoroughly in charge of her own destiny throughout, which is always nice to see. Likewise, Ray was genuinely horrible (ugh, the body scars - terrifying!) and Clyde was a loveable rogue. One criticism I'd level at the book, is that the 'present day' chapters didn't feel nearly so rich or well-realised. I didn't feel I knew the policeman much, and nor did I particularly care about him. I know he was only a foil against which to spin the yarn of Arden's life, but it felt like a bit of a wasted opportunity, as his character could have been much better utilised. But I could overlook this just fine, as the rest of the book was a rippingly fun read."}, {"userName": "Sandra", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/30575518-sandra", "userReview": "Oh how I love this. I was in need a good five star book and here it was.This is a simple premise. Ada (Arden) a female illusionist in the early 20th century who is accused of a murder when someone ends up death at one of her shows. A police inspector followers her and tries to get a confession to help his career. Which is why we end up at Arden telling about her life these last few years.It is vivid and beautifully written. You could really get a feel for the characters (Ray is sure to give me nightmares in the future) and eventhough Arden told us all about her lifestory we were still left guessing and wondering what was real and what was fake. If any of it was to begin with.It was quick, engaging and light. But then I happen to love books about illusionists/broadcasting/filming/radio so me liking this was no great surprise. I hope you will as well."}, {"userName": "Vonia", "userReviewDate": "Dec 29, 2015", "userURL": "http://www.goodreads.com/user/show/5204784-vonia", "userReview": "I expected more. After the first chapter, I already strongly suspected that I would be disappointed. Water For Elephants, Finding Houdini, Vaclav & Lena, Luminarium. The Magician's Lie does not even deserve to be in the same category. The magic is inventive, the descriptions exciting, costumes creative, performances descriptive enough on paper to appear in the mind's eye. Sadly, the magic played a relatively minor role in the novel. If it had taken center stage, the novel itself would have been far better. The novel focuses on a murder that takes place within the first few pages. During a pivotal act during The Great Arden's (Ada's) performance (The Halved Man), something goes wrong, and a man ends up dead. Real dead. Not magically dead. Of course, the first suspect is his wife, the illustrious Arden herself, whom has fled the scene. Virgil Holt, dealing with his own secrets and fears, finds her and apprehends her, holding her in a deserted station for a night of interrogations. He soon finds himself weakened by her beauty, her charisma, her insistence on her innocence, and the story she keeps asking her to tell. This is my first problem. Supposedly Ada is narrating this story. Her memory is not so precise that she will be able to relate all the details, even dialogue to Holt. Next, from the very beginning, Holt tells her that she needs to tell him about the murder. Ten hours later, 5 AM in the morning, she still hasn't. And he, the one with the power, is still listening patiently. Unbelievable. Unbelievably frustrating. Another thing that may seem minor but was significant in how many times it was used was how each segue in Ada's story began with \"Until... \" Until 11899. Until the next performance. Until Ray showed up. Until Chicago. There are many ways to indicate a transition. *** Spoilers *** My favorite parts of the entire book were those that involved The Great Arden. Except when she was under the tutelage of Adelaide. One of those great boudoir woman that had a difficult time showing their sweet side, she had a special affinity to Ada and acted as the mother she never had (whom said in not-so-vague terns in regards to Ray's abuse: Those are not the facts, though, are they? You know why? Because if so, we would all lose our homes.). She protected her, led her, taught her, brought out her talents, and raised her confidence, leaving her with everything she needed to be to continue the show after she retired.The reappearances of Clyde and Ray were so damn predictable. These are the two men in Ada's life. That take over her, literally. Clyde loves her, until (haha) he proposes to her in order to get them some extra money from his parents. But she doesn't know this. That it was a fake proposal. Her heart is broken and she loses his trust in him. Ray, her sorta stepfather, believes he has healing powers. he cuts up his own body, cuts all over the place, and then finds further pleasure in hurting others, believing he can heal them. He focuses on Ada, however, because somehow his powers work especially well with her. The truth is he has no powers, but Ada does. But only on healing her own wounds. All she has to do is make a wish and she will heal ten times faster than anyone else would. Anyways, the ending is pretty expected as well, her running away from Holt by breaking her hand (which will heal soon) and being found by Clyde. Clyde was the one who murdered Ray. We all live happily ever after."}, {"userName": "Miranda Lynn", "userReviewDate": "Nov 22, 2014", "userURL": "http://www.goodreads.com/user/show/7417265-miranda-lynn", "userReview": "3.5 starsSuch a promising story full of so much potential...until the last twelve pages ruined the entire thing.From pretty much the very first page, I was completely hooked by this novel. It was just...entrancing. Stories about illusionists have always been a draw for me, so of course I had to pick this one up as soon as I heard about it. And, for much of my time spent reading it, it did not disappoint. I was totally captivated by Ada's sweeping tale full of intrigue, mystery, horror, and pain. And I really enjoyed the way the book was set up — part of it in the present, most of it in the past. The Magician's Lie opens up during one of The Amazing Arden's shows, with the final most-harrowing illusion about to take place. A skeptical policeman from a nearby town is in the audience, and little does he know that a murder is about to be committed. When Arden's husband turns up dead and the illusionist nowhere to be found, everybody assumes that she killed him and ran off. But when the policeman happens across Arden, captures her and brings her back to his station, he figures out that there's way more to the story than he originally thought. Arden begins to tell him her side of things, starting at the very, very beginning, hoping that she will eventually be able to convince him of her innocence.And I loved it. Arden/Ada's story had me madly flipping through the pages. I had no idea if she was innocent or guilty, and I had to find out. I ended up staying up until 4am just to finish it! But the ending was such a lackluster finale to what, in my opinion, was a really good book. I probably would've rated this 5 stars if the ending was anywhere near as good as I thought it was going to be. But instead of some shocking surprise or any sort of twist, all that's awaiting the reader in the final pages is an obvious, sloppily-put-together conclusion that does nothing but slaps the rest of its 290 pages in the face. I'm still semi-interested in reading more from this author, just because of how much I liked everything except for the awful ending, but I'm definitely going to have low expectations going in."}, {"userName": "Care", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/60613428-care", "userReview": "The Magician's Lie tells the story of female illusionist Arden - born Ada Bates - telling her story to police officer Virgil Holt who is interrogating her with regards to a suspicious murder that occurred after one of her shows. Arden describes growing up in a small farming town, working as a servant in a mansion, moving to New York and falling into a magic show. A book that presents Arden's life retrospectively, the story depicts how Arden became the illusionist she is and the two boys-turned-men who most shaped her life. Perhaps the most jarring aspect of the book is how misleading the blurb is. The book is not set in a traveling circus and in fact the setting itself has very little to do with the overall meat of the story. It also was incorrectly billed as Arden's trustworthiness in her storytelling being questioned. While the police officer obviously expressed doubts, nothing would at all create doubt in the reader's mind, and it was much less of a psychological book than I was expecting. There was so much potential for more depth and engagement. However, the plot is interesting and moves quickly, and I appreciated the strong female elements. The characters are perhaps a bit one-dimensional, and there were some plot lines that didn't feel tied up at the end. But I would recommend this as a quick and entertaining read, particularly by those interested in magic. Please note there are elements of abuse and self-harm in this novel. Thanks to the publisher for a digital copy in exchange for a fair review!"}, {"userName": "Charlie Lovett", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/17947845-charlie-lovett", "userReview": "Sometimes I get to meet authors. Sometimes their books sound interesting. And when I'm really lucky I hit the trifecta—the book actually is interesting. I'm not reviewing The Magician's Lie because Greer Macallister is a nice person (though she certainly is) or because it's a great premise (though that is undeniable). The fact is it's a riveting story beautifully told. I read it in just a couple of days, which is fast for me, because I couldn't put it down. The narrative structure that the author creates in which Arden tells her story gives the novel an urgency and drives what would have been a great story in any construct forward to its breathless conclusion. In a word: magic!"}, {"userName": "Debbie", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/6121188-debbie", "userReview": "Amazing, amazing, amazing.......I don't want to disclose any spoilers, but on January 13th, run out to your local bookseller and buy this book in hardcover. It is a wonderful read."}, {"userName": "Catherine McKenzie", "userReviewDate": "Sep 25, 2015", "userURL": "http://www.goodreads.com/user/show/2796203-catherine-mckenzie", "userReview": "Beautiful imagery and a fast-paced story."}, {"userName": "Mary Kubica", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/18174103-mary-kubica", "userReview": "Absolutely fantastic! Such a terrific book."}, {"userName": "Poppy fairy ", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/18322003-poppy-fairy", "userReview": "Review by Suzanne www.ireadnovels.wordpress.com Twitter@favouritenovelsI have never read a magical story involving a magician. I loved how the story combined magic and a murder. The point that I liked here is that in most cases an illusionist is a man and I like the way this subject was turned around on its heel to a woman illusionist. This is the life of the most famous female illusionist in the world. Now this is the time which Arden has decided to leave it all behind. This is the life she will end. Arden every night, will make people believe things that aren’t true. I was sitting reading this book with my mouth wide open in a gasp. In the theatre in front of the audience she entertains them by cutting a man in half. It will look totally real to the audience. But what the audience doesn’t know is that tonight, she will escape her tortutre, once and for all time. Tonight, Arden will kill him. Officer Virgil Holt is placing her under arrest on suspicion of murder of her husband . The unexpected happens next and I found it totally hilarious! Oh yes this is a great read. Find my review on Amazon Waterstones"}, {"userName": "Meg - A Bookish Affair", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/1132408-meg---a-bookish-affair", "userReview": "In \"The Magician's Lies,\" Arden is a illusionist who is truly a woman in a man's world. This book takes place before there were many female entertainers so she draws an audience merely for being a woman. She becomes very famous because her tricks are good. One night it appears that she killed her husband on stage during one of her illusions, Arden becomes a wanted woman. It'll be up to one man to determine whether or not Arden really committed the murder or was it just another illusion. There seems to be a lot of historical fiction books that have come out recently that take place in a circus or show setting. I've eaten so many of these books up and I was very attracted by the setting of this book!Even though it's the setting that initially attracted me, the real reason that I ended up enjoying this book is that the way that the book is told is utterly engaging. The book flashes back between Arden's past and her being questioned by Virgil after her husband's murder. We get to know Arden and what makes her tick and how things are not always the way that they seem. To some degree Arden is an unreliable narrator, which I really enjoyed. Because there are so many flashbacks back-and-forth between the past and the present, readers definitely have to pay attention and it can get a little bit confusing. However if you're willing to pay attention, the payoff is great.Overall, I really enjoyed the story because of the characters but the way that the action of the story is laid out. It definitely kept me on my toes and I love that."}], "description": "Water for Elephants meets The Night Circus in The Magician’s Lie, a debut novel in which the country’s most notorious female illusionist stands accused of her husband's murder --and she has only one night to convince a small-town policeman of her innocence.The Amazing Arden is the most famous female illusionist of her day, renowned for her notorious trick of sawing a man in half on stage. One night in Waterloo, Iowa, with young policeman Virgil Holt watching from the audience, she swaps her trademark saw for a fire ax. Is it a new version of the illusion, or an all-too-real murder? When Arden’s husband is found lifeless beneath the stage later that night, the answer seems clear.But when Virgil happens upon the fleeing magician and takes her into custody, she has a very different story to tell. Even handcuffed and alone, Arden is far from powerless—and what she reveals is as unbelievable as it is spellbinding. Over the course of one eerie night, Virgil must decide whether to turn Arden in or set her free… and it will take all he has to see through the smoke and mirrors.", "title": "The Magician's Lie", "url": "http://www.goodreads.com/book/show/25085921-the-magician-s-lie", "average": 3.67, "cover": "https://images.gr-assets.com/books/1442821712l/25085921.jpg", "reviews": 1588, "authors": [{"url": "https://www.goodreads.com/author/show/8137823.Greer_Macallister", "name": "Greer Macallister"}], "type": ["Historical", "Fiction", "Mystery", "Fantasy", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/25085921-the-magician-s-lie", "http://www.goodreads.com/book/show/21897317-the-magician-s-lie", "http://www.goodreads.com/book/show/22782057-the-magician-s-lie", "http://www.goodreads.com/book/show/29220157-the-magician-s-lie", "http://www.goodreads.com/book/show/32446456-the-magician-s-lie", "http://www.goodreads.com/book/show/22916122-the-magician-s-lie", "http://www.goodreads.com/book/show/32446457-the-magician-s-lie", "http://www.goodreads.com/book/show/29946121-girl-in-disguise", "http://www.goodreads.com/book/show/38728901-woman-ninety-nine", "http://www.goodreads.com/book/show/28627395-author-in-progress"]}