{"ratings": 12796, "userreviews": [{"userName": "Lily", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/19625959-lily", "userReview": "So disappointing. I love Marian Keyes and I love the Walsh sisters. Granted, I haven't loved each and every one of Marian Keyes's books, but when she gets it right her books are amazing: the perfect blend of silly chick-lit shallowness (lots of talk about shopping, fashion, being irresponsible with money, etc) and the harsh reality of addiction, depression, abuse, and so on. I had to force myself to finish this book, which makes it better than Angels which I couldn't bring myself to finish. But it is really rather boring. It could have been a great book if it dealt with the first time Helen became depressed and the reactions of those around her and all the crazy ideas people suggested to her to help her overcome her depression (which is only briefly mentioned in one of the many flashbacks). The mystery in the story was really boring and the book seemed confused as to whether it was chiefly about the mystery or about Helen's depression. The book doesn't do a good job of explaining why Helen is depressed and I just couldn't believe that she would end up in a relationship with a divorcee with three kids. Also, the revelations about Bronagh and Jay at the end were really rather mundane. I'm glad Marian Keyes is writing again after her horrible depressive episode, but it could have been so much more!"}, {"userName": "Bree T", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/3913428-bree-t", "userReview": "Private investigator Helen Walsh is going through a rough patch. The economic downturn means that no one has the money to hire PI’s anymore. The sort of business that once kept her income steady has dried up and now Helen has had almost all of her possessions repossessed and had to move out of her beloved flat and back in with her parents.When her ex Jay Parker comes offering her a job, Helen doesn’t want to take it. But Jay’s money is too good and Helen desperately needs the work. Jay is putting together a reunion of one of Ireland’s most popular boybands and one of the members, Wayne Diffney has disappeared without a trace. Wayne was reluctant to take part in the reunion concert but he swore he’d be there and now with just a week to go there’s no sign of him. Jay wants Helen to find Wayne and find him fast – there’s a lot of money riding on this and a lot of people stand to lose big time if the tour gets canned.Helen can’t help but end up intrigued. She falls in love with Wayne’s place, painted and decorated exactly to her tastes, had she been able to afford it. She’s distrustful of the other band members who all seem to have various things riding on this tour and things they might not be telling her. And most of all she doesn’t trust Jay Parker – she hates Jay Parker, even if he does feel sorry for what happened between them a year ago.Helen’s personal life is also in a bit of a tangle – she’s met a man named Artie that she fancies rotten only Artie comes with the added complication of three children, one of which hates her guts and an ex-wife named Vonnie who is alarmingly all too present in Artie’s day to day life. Helen isn’t the domestic type, so she’s okay with the fairly separate lives at first but she finds herself wondering where she stands in the life of a man who already has one. And lurking at the back of her mind is the blackness she thought she’d beaten, a dark depression that threatens to rear its head again and drag her back down under.I love Marian Keyes. I’d read that woman’s grocery list. I’ve read (and adored) all her novels but the Walsh sister’s books are my favourites, in particular Rachel’s Holiday and Anybody Out There?. This is the fifth and final Walsh sister book, the story of the youngest sister Helen, a periphery but forceful character in the previous books. Helen was well known for her sharp tongue and even Keyes herself mentioned in interviews she was frightened of writing Helen’s story because she is such a formidable character, even in books that weren’t about her. However Helen’s story is finally here and I regarded it with equal parts excitement and anticipation. Would I be able to like Helen as a protagonist?The short answer is yes – Helen is smart and funny but still retains her disdain for people and most things in general. She has a “Shovel List”:‘It’s more of a conceptual thing. It’s a list of all the people and things I hate so much that I want to hit them in the face with a shovel.’Various things on the Shovel List are hot drinks (doesn’t believe in them), Birkenstocks, all types of music (doesn’t trust girls who like music), any type of spiritual New Age book or CD and people who shudder and say ‘EWWWW’. Helen is still as grumpy as she ever was but Keyes manages to soften and humanise her with the fact that Helen suffers from depression. Keyes’ own battle with depression is something that has been well documented through interviews and it’s obvious she draws upon her own experiences in the past to help flesh out Helen’s. There’s some truly chilling descriptions, such as:….But I knew it was more than that. Blackness was rising inside me, rolling up from my gut like an oily poison, and a heavier outside blackness was compressing me, like I was descending in a lift.andI’ve heard people say that having depression is like being hounded by a big black dog. Or like being encased in glass. It was different for me. I felt more like I’d been poisoned. Like my brain was squirting out dirty brown toxins, polluting everything – my vision and my taste buds and most of my thoughts.Helen often thinks about ending her life within the book – regular readers of the Walsh sisters books will remember what a strong and forceful, confident character she was so Keyes has used her as a gentle reminder that anyone can be struck down by this. Helen will readily admit that she’s close to her family – they have an unconventional relationship, but they’re close. She’s pursuing things with Artie, taking it slowly. And she loves her job. Her home life or childhood was not traumatic or a catalyst. It’s not the spiral into the economic depression that fueled hers, the depression that resides with in her over the course of this novel is recurring – something she thought that she’d beaten once before and she’s devastated that it has come back. She isn’t sure she has the strength to keep fighting these feelings, to face the knowledge that it could be months, even years before they go away. And that even if they go away, there’s no guarantee they’ll never be back.The Mystery Of Mercy Close is such a multi-layered novel. On the surface it’s an innocent story of Helen searching for a boyband member who has up and disappeared but dig a little deeper and it’s so much more than that. The mystery itself is truly enjoyable and quite unexpectedly complex as Helen deals with dissolute and ego-maniacal boyband members, Wayne’s suitably distraught family and an underground ‘personality’ named Harry who seems to have a vested interest in Wayne’s reappearance. There’s also Helen’s personal life – Keyes went a heck of a different route than I expected her to go, romantically, with Helen and it really works. Artie and his family are well fleshed out characters with enough distance to make you wonder whether or not he and Helen can really make a go of it – or is he looking like heading back into the arms of Vonnie, his apparently friendly ex-wife? And then there’s Jay Parker, who clearly has a history with Helen, but what is it? Will they sort out their differences?This book has been worth every minute of the wait. Anybody Out There? the previous Walsh sister book was published in 2006 – so fans have been waiting 6 long years for Helen’s story (two other novels have been published in that time, This Charming Man and The Brightest Star In The Sky, taking a break from the Walsh girls and also Saved By Cake, Keyes’ story of finding solace in baking) and Keyes has delivered on all levels. Helen keeps her acerbic and grumpy nature, but she’s not so unpleasant when you’re peeking into her own life as she was about everybody else’s. There’s a lot of laughs in this book but it retains a serious core, of looking at an important issue, highlighting and addressing it, stripping it bare for people to see, experience and try and understand. It works."}, {"userName": "Megan Readinginthesunshine", "userReviewDate": "Nov 29, 2012", "userURL": "http://www.goodreads.com/user/show/11829532-megan-readinginthesunshine", "userReview": "Fans everywhere were eagerly awaiting the return of Marian Keyes and her latest book, The Mystery Of Mercy Close, and we weren’t disappointed This book not only sees the return of one of the greatest authors around, but also the return of The Walsh sisters, and in this particular book, focusing on Helen.Marian Keyes has to be praised for doing a fantastic job in highlighting mental health and depression. It seems to be something that isn’t addressed as much as it should be, and Marian Keyes has not only just highlighted it, but she has given her many readers a big insight into what life is like with mental health, not only adding a lot of depth to the story but a lot of knowledge too. As someone who has relations who suffer with mental health, I really loved that Marian Keyes has had the courage to write about this, and I think this book could help change opinions on mental health, and help towards acceptance and a wider knowledge of these serious issues.I loved the writing style of the book, it was almost as if Helen was sat chatting and narrating her life so far in front of me. as I’ve mentioned before, in the book it is discovered that Helen has previously suffered with depression and is living in fear of being hit by it again. Helen is brilliantly written as a character, she has a lot of depth and through her narrative we slowly learn about her background, her personality and we are given an insight into the world of Helen and what life is like for her.I enjoyed learning about Wayne.Throughout the story we slowly discover little bits about Wayne and all of these pieces put together help us to build up a picture of him. I loved the mystery of Wayne, it was gripping, it was interesting and it had me keen to find out what had happened to him.Even though there is focus on mental health and depression, this is not a sad book. There are some funny moments, and Helen’s personality and the way she describes the world makes you warm to her instantly. There are many humourous moments throughout, with a cast of likeable characters around Helen.Marian Keyes has written a book that truly gets the message across to its readers. It is an engaging story that has many layers throughout. It is great to see Marian Keyes back!"}, {"userName": "Shelleyrae at Book'd Out", "userReviewDate": "Sep 06, 2012", "userURL": "http://www.goodreads.com/user/show/1607230-shelleyrae-at-book-d-out", "userReview": "Watermelon introduced the Walsh family in 1995 featuring Claire, while subsequent titles focused on her sisters, Rachel ( Rachel's Holiday), Maggie ( Angels) and Anna (Anybody Out There?). I was excited to discover that with The Mystery of Mercy Close, Marian Keyes, after a six year gap, features the last of the sisters, Helen.The youngest of the siblings Helen Walsh has proved to be acerbic, strong-willed and a little eccentric during her cameo appearances in her sister's books. After trialing a number of careers, Helen had finally found success as a private investigator only for the GFC to erode her client base. Now unable to pay her mortgage and with the fog of depression rolling in, Helen is forced to move back home with her parents, and keen that her lover of six months doesn't learn the truth. When Jay Parker, an ex boyfriend, wants to hire Helen to find a missing member of the boy band on the comeback trail he promotes, she is is too tempted by the offer to double her fee to refuse. Wayne Difney proves to be maddeningly elusive though and with only days to find him, and an uncanny ability to alienate any possibly helpful leads, Helen is wary that she will break before the case does.Helen is both a hilarious and sympathetic protagonist, brusque and cynical she is also vulnerable and fragile. The Mystery of Mercy Close has a serious issue at it's core, as does all of the Walsh sister's novels. While it is amusing that Helen adores a range of (house) paint with shades named Gangrene, Wound and Decay and loads her pockets with tins of strawberries in an attempt to drown herself, the author explores Helen's struggle with herself, and others, as she tries to push back the dread and anxiety that is creeping over her. Helen is devastated that her battle with depression is not over after defeating an earlier episode that saw her hospitalised. Given Keye's own admitted history with depression, such keen insight into her character's illness should not be surprising.While Helen's journey, including the development of her relationships with Artie, Jay and her family, sustains the book, the plot surrounding the mysterious disappearance of Wayne Diffney provides a solid framework for the story. The Laddz, desperate for a successful reunion concert to reverse their fortunes, have their own secrets and Helen has to navigate their past to save their future.I really enjoyed The Mystery of Mercy Close and fans of the Walsh sisters will be thrilled to see the return of the siblings. It's not necessary to have read the previous installments as this is truly Helen's book and works well as a stand alone, though fair warning, you will want more of the Walsh girls and Marian Keyes when you have finished.My Shovel ListPeople who leave shopping trolleys in car park spaces even though the trolley return is just a few meters awayAny heel height above 1 inch (I don't believe in them)Brussel sprouts - ughTelemarketer phone calls at dinner timeAnyone who says they don't have the time to read"}, {"userName": "Allie", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/5190788-allie", "userReview": "I have been waiting for Helen Walsh's story for a long time. I started to think it wouldn't be written, simply because it couldn't be written. How was Helen ever going to come off as a real, let alone sympathetic, character when she was so snarky and over-the-top in all her guest appearances? That was half the fun of the other Walsh books--waiting for Helen to show up and say something wildly inappropriate and insensitive. But could she sustain a whole book?I should never have underestimated Marian Keyes, though, because we've finally gotten Helen's story and she is real, believable, and completely sympathetic while still being the slightly dangerous, unpredictable Helen we've come to know, love and fear (just a little).As usual from Marian Keyes, this book has laugh out loud funny moments (particularly Mammy Walsh's description of a pop star's dance moves...I won't give it away, just trust) and the slow reveal of the main character's personal trauma that lies in the background. Helen still has her edge, but she has been softened by what she has experienced and that is what makes her work as a character. And Keyes is still the best at describing and depicting emotion so that you almost feel it right along with the character. This is especially true in her last Walsh book, Anybody Out There, but true for this one as well.The mystery is not as mysterious as fans may want if they are also hard-core mystery readers. But anyone who has dealt with depression or grief on any level will recognize that what is obvious in your clear moments is NOT obvious when you are dealing with the crap attention span, brain fog and memory issues that go hand in hand with mental illness. I thought it was very realistic that it took awhile for the dime to drop for Helen even though she had the clues fairly early. So that didn't bother me at all.One thing that did keep me guessing throughout was how the love story was going to pan out. At one point there was enough of a complication pile-on that I just could not see how Keyes was ever going to resolve everything. But she did, and Mercy Close has one of the most satisfying endings of all her books. I am still a huge fan and dying to read her next. 4.5 stars."}, {"userName": "Christine Ryan", "userReviewDate": "Sep 28, 2012", "userURL": "http://www.goodreads.com/user/show/12297999-christine-ryan", "userReview": "As a Marian Keyes fan, I'm afraid I was deeply disappointed with her latest work. The editor must take a fair portion of the blame for failing to hit the 'delete' button where meanderings and wafflings threaten to overwhelm the plot. The protagonist is a private detective who tends to rely on instinct rather than actual clues to find the missing member of a re-united boy band. The fact that the reader picks up on the clues before she does becomes irritating, as does the relentless jokey tone. The severity of the depression from which our PI suffers is almost compulsively undermined by this tone. Which is a shame, because Keyes' take on depression comes from personal experience and she provides us with some deeply moving and insightful glimpses of how the the depressed mind functions (or doesn't), before tripping off into funny land. There is a good book between the covers, it just needs a strong edit."}, {"userName": "Lisa", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/17591646-lisa", "userReview": "Marian Keyes is so fabulous because she can weave laugh out loud humour with serious issues and somehow it works without belittling said issues.I have read a couple of books about the Walsh family series (my favourite so far is \n) and find them funny but poignant - Mammy Walsh is hilarious!This book is about Helen Walsh who is (currently) a private investigator asked to look into the disappearance of the integral member of a boy band making a big comeback in Ireland.Helen is in a bit of a pickle - the recession has been hard on her and the bailiffs have called and turfed her out of her flat, she is struggling to find time with her boyfriend because of his children and ex-wife and the depression she had successfully battled is creeping back causing lack of sleep and suicidal thoughts - oh yes this is an angst filled romp!Unfortunately I didn't love this book as I found it a bit too leggy in places and Helen's mind is sometimes an exhausting and hysterical place to be (no wonder she is ill!) but there were enough laughs and shenanigans to keep me going.This is NOT a mystery book (perhaps the title is a tad misleading) but it is an amusing farce with an interesting insight into depression and people's attitude toward it (if you are familiar with this illness you will be nodding your head with a wry smile on your face)."}, {"userName": "Sharon", "userReviewDate": "Jan 30, 2013", "userURL": "http://www.goodreads.com/user/show/16688413-sharon", "userReview": "Such a disappointing book. The pace of the story is too slow and there is so little action. Romance is light on the ground and there is little exploration of Helen Walsh's relationships, which is a pity as both Jay Parker (the ex) and Artie Devlin (the current one) are interesting characters. There wasn't enough involvement by Mammy Walsh, who would have added some humour to a humourless story.Although the other characters are well drawn, they seem to float around the periphery and rarely are asked to participate in the story. Make no mistake, this is a story about Helen Walsh's depression and little else. They mystery element of the story is non-existent. I'd guessed early on what had happened to Wayne Diffney and it was excruciating waiting for the reveal.Marian Keyes had the potential to take Helen Walsh on a witty, fun and engaging ride, but plodded on in minute detail about her depression and buried a great character under a heavy cloud. Although I do understand that Marian was coming out of a deep depression as she wrote this book, a better editor would have pulled back some of the detail. A better editor would also have used their red pen on the excessive use of the word \"very\" - it was clunky and amateurish.I refuse to give up on Marian Keyes, despite this stumble, and I'm looking forward to her finishing her current story."}, {"userName": "AngryGreyCat", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/13236257-angrygreycat", "userReview": "I will start this brief review by saying that for me Marian Keyes can do no wrong. I love her books and her sense of humor. This book was no exception. The characters were funny and engaging. The mystery was well thought out, with red herrings, some quite clever. The book is ostensibly about a missing “rock star”, I’ll use that term loosely since he is a former boy band member. What the book is really about is depression, both having depression and others reactions to it. I found it to be an honest and refreshing treatment of the subject. Too often women’s fiction about depression takes itself so seriously that the books themselves are depressing and having been there I can tell you that is the last thing you need. The dialogue, both inner and actual, reveals truths about depression with an accuracy that can only be expressed by someone who has been there. Overall, an interesting mystery plot, enjoyable characters, laugh out loud humor all add up to a highly recommended read."}, {"userName": "Su", "userReviewDate": "Apr 27, 2013", "userURL": "http://www.goodreads.com/user/show/804502-su", "userReview": "I absolutely adore Marian Keyes' wriying style. Most of her books have centered on the Irish Walsh family and their five daughters. This book was all about Helen Walsh who has resorted to being a private detective to make ends meet. At the same time as being hilariously funny, it also manages to descibe the terror of living with depression. She has nailed the stultifying blackness and aloneness that depression casts on its' victims. But she also has such a wonderful way of describing characters. Helen, for example has a shovel list. We all need one. Anything minute or major can go on the list. It then becomes something you want to hit with a shovel. I am already starting my own list. Read all of Keyes' novels. You won't be disappointed."}, {"userName": "Dani Jade", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/41664104-dani-jade", "userReview": "Favourite Marian Keyes I've read in a while. Typical 'Walsh Family' book, funny and sassy."}, {"userName": "rubywednesday", "userReviewDate": "Sep 27, 2012", "userURL": "http://www.goodreads.com/user/show/5896025-rubywednesday", "userReview": "I have a real fondness of Marian Keyes' books. I've been reading them since I was a young girl and they would be passed around our family, as well as various neighbours and friends. Her writing has a quality that really resonates with people and with the Walsh family, she's at her very best.I have so much respect and admiration for the empathy, warmth and sensitivity in her books. This is most obvious when dealing with more difficult topics, in this case depression. But it also shines through in her characters and it's a real joy to read something so non-judgemental. The reader is never looking down or looking up at the characters. You're right on the ground with them and it makes all the difference.I wish more authors I read had this skillThis book is funny. It's full of wry observations about current culture that made me smile constantly. The characters, too, are funny in their ways of speaking and their actions in general and it adds a wonderful spark to a fairly gentle plotline.I thoroughly enjoyed this book. It shows tremendous insight into depression and it's also a fun, warm and engaging story. A cut above other books in its genre and the flow of the first person pov is top notch."}, {"userName": "Sophie Narey (Bookreview- aholic)", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/37868613-sophie-narey-bookreview--aholic", "userReview": "Published: 11/04/2013Author: Marian KeyesRecommended for: fans of chick litWell another excellent book from Marian Keyes. Loved the book with its quirky Irish humour. It follows the trials and tribulations of Helen Walsh private investigator and her battles with depression. The way Marian Keyes describes the main character with such depth makes it feels as though you know her personally. Helen's family especially her mother is hilarious to read about. The book is hard to put down once you have starting reading: about Helen losing her flat, her ex boyfriend's reappearance and current boyfriend Artie complete with kids and ex wife Vonnie popping in and out. Will Helen find Wayne the missing member of The Laddz who are having a come back concert? Will she get together with Artie or ex Jay Parker? And who hit Helen over the head and tried to knock her out? Read this book...it's a must!!!!!"}, {"userName": "Hildy", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/5033175-hildy", "userReview": "I've never loved Helen as a person but I've always loved reading about her because she's such a unique character. I enjoyed being in her head (even though it's a bit scary) and as always I love the way Keyes writes her male characters. She also writes about tough situations but with humour. My problem was that this book seemed a little long and repetitive. I think if things had been tightened up it would have been really great. I also wish that we'd been given a bit more time on the page with Helen's love interest. Keyes never gives us a lot of relationship-time because it's never the focus of her books but her men are so great that I always find myself wishing for more."}, {"userName": "Peggy", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/3941502-peggy", "userReview": "I was surprised (category: pleasant) by this book. Chick-lit used to be my favourite genre and almost all I read when I was in my late teens and early twenties, but around four or five years ago I started to lose interest and I didn't even care for my favourite authors (including Marian Keyes) anymore. After a short reading break I switched to other genres, mostly historical fiction and fantasy. The only reason I picked up this book is because I participate in a year long series challenge in which the goal is to finish unfinished series. This one, being part of a 6 books series and the only one left to read (not counting the short Mammy Walsh's A-Z), would give me easy points. Considering my declining interest in chicklit and the fact that although I enjoyed Marian Keyes' books in the past but never was overly exicted about the Walsh books, I had low expectations. I figured I would just quickly read it to get it out of the way and have another series completed. But it was not at all what I expected. Not so chick-litty or filled with sappy romance as you might think, but instead a very likeable but cynical main character, and as with all of Marian Keyes' books, serious issues as well. In this case, depression. Marian Keyes aims to show people that depression, like cancer or other horrible diseases, is not something that doesn't exist, or something you can snap out off/get cured from if you forget you have it or focus on something else. Like it is said in the book: “People get sick and sometimes they get better and sometimes they don't. And it doesn't matter if the sickness is cancer or if it's depression. Sometimes the drugs work and sometimes they don't. Sometimes the drugs work for a while and then they stop. Sometimes the alternative stuff works and sometimes it doesn't. And sometimes you wonder if no outside interference makes any difference at all; if an illness is like a storm, if it simply has to run its course and, at the end of it, depending on how robust you are, you will be alive. Or you will be dead.” And that is so important. Too many people nowadays misunderstand mental illnesses, and I think it's great that books can hopefully give people a better understanding."}, {"userName": "Thomas Strömquist", "userReviewDate": "Sep 08, 2015", "userURL": "http://www.goodreads.com/user/show/32669562-thomas-str-mquist", "userReview": "Another fantastic book from Marian Keyes, it's been far too long since I read one of hers I realized. This one misses the full five stars because of two things; the hilarity of the comedy sometimes goes all the way to the slightly absurd and I very much appreciate her characters to be life-like and plausible. This is only on a couple of occasions, though, so don't let it stop you! The second thing is that very little actually happens in the book and, it being close to 600 pages, this makes for a few repetitious passages. At the same time, I'm very impressed that a book that little actually happens in can have me so hooked that this one did! Anyway, parts, and certainly the ending are five-star all the way!The youngest sister of the Walsh family, Helen, is an out-of-work PI, that is assigned by a former boyfriend (not a nicely ended relationship) to find a runaway member of a boy-band about to make some reunion-gigs. A lot of money is at stake for a lot of people, but Wayne (\"The Whacky one\") is seemingly up in smoke.Helen Walsh' style and detecting methods are very unorthodox, she relies heavily on positive thinking (which is hard to do when you are fighting depression), knowledge of human nature (which is kind of hard, when you are a bit of a misanthrope) and irrational behavior. She's kind of like a mix of Dirk Gently and Precious Ramotswe, with pinches of Harry Hole and Evert Bäckström thrown in.Often laugh out loud funny, I caught glances on the bus when chuckling into my lap. I also made a firetruck impression with my ears at one point (but I think no-one saw), was the sex this explicit in earlier books? Only one scene, so don''t be scared off/get hopes up too high :)"}, {"userName": "Charlotte", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/650832-charlotte", "userReview": "http://charlotteswebofbooks.blogspot....Marian Keyes has always been known to write Chick Lit novels with a somewhat dark overtone, but The Mystery of Mercy Close is the only one that somewhat parallels her own life. In 2009 Marian Keyes experienced a crippling bout of depression, much like Helen Walsh, it nearly destroyed her. Her experience with depression is the reason why this book was so good. The darkness that envelopes Helen is almost as terrifying for the reader as it is for Helen. When she even went so far as to buy a knife and start planning her suicide I was so tense and found myself so concerned for her well being.Bottom line, The Mystery of Mercy Close, has everything you would want in a novel. Mystery, romance, rock-stars,divas, crazy families and more. At the heart of everything is the severity of mental-illness. It is an important message to get out there and one that I think needs to be discussed more often, like maybe at this month's book club meeting?"}, {"userName": "Diane S ☔", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "3.5 One of my favorite authors when I am in need of some serious amusement. There has not been one of her books that have failed to deliver just that. In this one Helen Walsh, attempts to return home, to parents who would really rather she didn't. The conversations between them had me laughing out loud. Than her new love interest has three children and her relationship with them and his ex-wife were another source of amusement. There is really nothing Keyes holds sacred, so if you are easily offended this is not the novel for you. Then, however, it gets a little serious and covers topics of depression and the effect of that on ones life. Even here though, she handles her characters problem, which also has been the authors very real problem, with self deprecating humor. Enjoyable."}, {"userName": "Kitty", "userReviewDate": "Sep 11, 2012", "userURL": "http://www.goodreads.com/user/show/8727183-kitty", "userReview": "I love Marian Keyes. She is an ambassador for Irish women, a humanitarian and a seemingly decent human being. She is also the one of the best and most under rated writers in the known universe and when people describe her books as chick lit it makes me want to put them on my Shovel List (read the book and you'll see). I have just finished Mercy Close, and I have laughed, cried and cheered in equal measure. It is fabulous, but more importantly, if you've ever suffered from depression this book offers understanding and hope. Marian Keyes, you are a goddess amongst women and this book is utterly classy."}, {"userName": "Jen", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/9611806-jen", "userReview": "I have loved Marian Keyes from the start and have been waiting and waiting to finally read Helen Walsh's tale. I can't wait!"}, {"userName": "Marleen", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/348805-marleen", "userReview": "Helen is the youngest of the Walsh sisters and going through a bit of a rough spot. Working as a private investigator was great while the economy was up, but now that the Celtic Tiger has gone and died there just isn’t any work available. And no work means no income which means no money to pay the bills. Months behind on her mortgage, with her electricity cut off and most of her furniture repossessed, Helen leaves her apartment and moves back in with her parents. Her six month long relationship with Artie is good, and Artie is everything she could wish for in a man except that he comes with three children and an ex-wife he is still very (too) cosy with. When she receives a phone call from an ex-boyfriend, Jay Parker, Helen’s first instinct is to ignore it. But Jay has a job for her. He wants her to find Wayne Diffney, the Wacky One from boyband Laddz. Laddz is about to make a big comeback but with Wayne missing the whole project is at risk and Helen is Jay’s last hope of finding the missing man without involving the authorities and triggering unwanted publicity.An active investigation to keep her busy is just what Helen needs. She is sliding into a deep depression and is finding it hard to keep herself going. Investigating Wayne’s disappearance is keeping Helen’s mind of her own despair, most of the time, but the man has managed to vanish without a trace and his house on Mercy Close doesn’t produce any useful clues. Strangely enough the house does attract Helen. In fact she feels completely at home there and finds herself spending a lot of time in Wayne’s world. It is strange that in her life filled with people all wanting a piece of her, Helen feels closest to the one person she has never met, who is missing and who she can’t seem to find.I loved this book. The story is interesting on several levels. The investigation into Wayne’s disappearance brings mystery and action. The host of characters in Helen’s life provide entertainment, smiles and laugh-out-loud moments. And her struggle with depression gives both Helen’s character and the book depth and the reader food for thought.I really liked the way this book was written. It is as if Helen Walsh is sitting across from the reader and narrating her life. She just talks away, at times hopping from subject to subject as people do in conversations, without ever losing her thread. She is brutally honest about herself and her shortcomings, which are plenty. While she never tries to make herself look nice or sympathetic I couldn’t help but like Helen.I admire the way Marian Keyes dealt with the issue of depression in this book. Such a subject matter could easily turn a story into a dark and hard to read narrative, but Keyes managed to avoid that. Helen’s descriptions of her struggles with depression are both heartbreaking and funny at the same time. It is very easy for the reader to feel and/or imagine her despair. On the other hand, because Helen is looking back on events she can tell her story in such a way that actions, thoughts and feelings make you smile, despite their darkness.The fact that Marian Keyes has had to battle depression herself means that she can tell this story from first hand experience. Her description of how others deal with somebody who suffers from depression is as accurate and heartbreaking as it is amusing. She completely gets how illogical a depressed person’s thoughts can get. This becomes very clear when Helen, despite her urge to kill herself, finds she is very afraid of one character in the story who might actually threaten her life. The thing that put the biggest smile on my face while reading this book was Helen’s “Shovel List”:“ It is a list of all the people and things I hate so much that I want to hit them in the face with a shovel.”I haven’t read all of Marian Keyes previous books, but of the ones I have read this one is by far my favourite. It is a well written book with funny and life-like characters and a perfect balance between light relief and dark moments. All I can say is: read this book and enjoy!"}, {"userName": "Tania", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/6450088-tania", "userReview": "I adore Irish audible books, the accents are so beautiful and Niamh Daly always does a stellar job. Although the story was not as good as  The Break I still had a lot of fun while listening to this. Marian is brilliant in that she can deal with big issues - depression and suicide in this one - and still have you laughing out loud. I also feel like I have a much better understanding of what people feel and think when they suffer from this mental disorder. I can't wait for her next one."}, {"userName": "Angela Oliver", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/5594267-angela-oliver", "userReview": "This is the fifth, and final (?) of Keyes' Walsh family series, dealing with youngest sister, Helen. Like its predecessors it is written in first person narrative, and like the others it has a darker underlying message. On the surface: it is a mystery - not as crazy as those of Janet Evanovich, but instead a moderately amusing, interesting mystery in which Helen is hired to track down a missing member of the once popular boy band, \"Ladz\" so that they can undertake their reunion concert. Under the surface, however, Helen is suffering. Like many in Ireland, she has suffered badly with the economy crash - losing first her work office, then her home. Forced back into living with mum and dad, you might think that this book would focus on the \"returning to the nest\" syndrome, but sadly (for those of us familiar with the Walsh's), very little is made of this fact. The romance too, is somewhat more lacklustre than in previous Keyes' novels - Helen begins with a boyfriend (divorced, three children) and their relationship also does not play a major focus to the plot. The underlying, darker shadow is Helen's depression. Depression is something that I, thankfully, have never suffered excepting during the teen-angst period and to a very low extent on occasion (but never the suffocating fear, apathy or dread experienced by many). It is also something that I rather find the concept of it hard to grasp - and Keyes does a fine job explaining it, in first person terms, with convincing sincerity. It would be a good one to read, perhaps, if you have a friend or colleague thus afflicted and wished to understand what *might* be happening in their mind.Overall, a rather mature, somewhat dark-themed novel that is handled with Keyes' characteristic skill and charm, with the wit mingling with the shadows. Helen is an excellent character, and Keyes captured her \"voice\" well, with her snarky, sometimes downright rude comments, some sligthly demented internal monologue (particularly relating to interior design) and, of course, her shovel list. I always imagined her book would be light-hearted and crazy, over the top fun, and although it suceeds somewhat on the latter, this is definitely not light-hearted, Helen certainly has a haunted side."}, {"userName": "Anne", "userReviewDate": "Sep 22, 2012", "userURL": "http://www.goodreads.com/user/show/2464996-anne", "userReview": "It’s a while since I read a book by Marian Keyes, and for the first 100 pages this one just didn’t pull me in: I felt I was missing something in the way of background on the Walsh family, and wished I’d followed the tip of downloading to Kindle Mammy Walsh’s A-Z Guide. But once the story gets going, the background really doesn’t matter. Helen Walsh, the youngest daughter of the family, is a private investigator who has fallen on hard times – and at the same time, is struggling with depression and thoughts of suicide. Then her ex-boyfriend Jay offers her a well-paying job to track down Wayne Diffney, the “Wacky One” from ex-boyband Laddz, and she takes it on. The book follows Helen’s attempts to find Wayne, and her difficult relationships with a large cast of showbiz and ordinary (but occasionally extraordinary...) people.Liking Helen was the thing I found most difficult about this book – as the story’s told in the first person you do find yourself inside her skin but it’s rarely a comfortable place to be. There are parts of the book that are laugh-out-loud funny – despite all the sleuthing, a major plot twist hinges on something Mammy read in Grazia – but inside Helen is a rather dark place to be. That said, I did feel Helen’s struggles with depression were exceptionally well written – a real attempt to portray its many facets by someone who obviously has an extensive experience herself. And I liked (a lot) the telling of her relationship with boyfriend Artie and his family.So what do we have here? Firstly, it’s a well-told mystery and pursuit told at good pace, with plenty of twists and turns, and highly entertaining. Secondly, it’s an in-depth exploration of a troubled young lady’s mind. Then there’s the humour, and the popular culture references that come thick and fast... this book isn’t going to suit everyone. And it’s a long book – over 500 pages in my copy, and I do think it could really have been trimmed by a quarter without any real damage. But overall I did enjoy it, and it’s good to see that Marian really hasn’t lost her sureness of touch."}, {"userName": "Andrea", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/5028591-andrea", "userReview": "I started to give this 4 stars, but it honestly deserves 5 stars. The Mystery of Mercy Close was interesting, hilarious, sad, emotionally heavy —all in equal measure. It's a mystery and a story of one woman's struggle with mental illness. This is also a Walsh Family story, so even when the road turns deeply introspective, brutally honest, and a little dark, there usually comes moment so perfect and sometimes so outrageously funny that it's just trademark Marian Keyes. Honestly, it's why I love her books so much. I don't know why I was surprised by the darkness in Mercy Close. Helen Walsh, the youngest in the family and the last sister to get a book was always brutally honest and kind of cranky in the prior books. There is a difference, though, in having a darkish personality and having mental illness. In this book, Marian Keyes has done a true service to those with mental illness and the people who love them. As much as it made me anxious to be that deep in Helen's psyche, I got it. I've never personally experienced depression to that extent, but I seriously *got* it. I'm thrilled to have finally finished the Walsh Family series. It's one I associate with happiness and good reading experiences. When I started, I never imagined everything I would experience with the five sisters: infidelity, betrayal, addiction, loss, grief. Through it all, there was love. Love from Mam and Dad Walsh, among the sisters (as harsh as each sister could be with each other!), love from a great and truly worthy partner, and the strength and love each found in herself. The Mystery of Mercy Close was terrific. This is a series I will cherish many times over the years."}, {"userName": "Gail", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/7052436-gail", "userReview": "I cannot express my absolute delight at my beloved Marian Keyes writing this book after 5 long (and,I know, very painful) years. I was counting the days to its release and I read the brilliant Mammy Walsh's A-Z of the Walsh family in one sitting in eager anticipation of this being released. I was not disappointed. I have all of Marian's books and I have loved every single one of them. Helen was always my favourite Walsh sister and I wondered which road she had taken since our last visit to the Walsh household. It is literally laugh out loud funny, as are all her books, and heartbreaking in places too. I would advise caution when reading this in public places, especially the Laddz rehearsal part, which Helen attends as, sadly, I was reading this bit whilst in my hairdressers and the look on the staff and customers faces, when I eventually looked up after wiping my tear stained face from laughing so much, was a sight to behold. I think they thought I'd completely lost the plot and swiftly finished my hair in order for me to leave the shop so that it wasn't upsetting the other customers!!I know Marian has had her own battles with crippling depression so it's especially poignant when Helen is writing about her feelings on this subject. I loved the mystery part of the story too and was urging Helen to find Wayne before the concert!I am left utterly bereft that I have finished it but I sincerely hope Marian has some peace in her life now and that we don't have to wait so long for her next book. These books should be issued on the NHS to bring fun and laughter into everyones life. Highly recommended, of course. 20 out of 5."}, {"userName": "Clare", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/967243-clare", "userReview": "Damn! Marian Keyes is soooo good. She writes compelling stories about real people, real families and real problems. Not with the cutesiness of Sophie Kinsella, but plausible mishaps and problems. I of course, was deeply moved by \"Anybody Out There?,\" but this book was perhaps even better. Helen Walsh is a broke, unemployed private detective who suffers from occasional bouts of depression. She is contracted to find a missing member of a boy band currently launching a comeback tour. Helen, despite generally disliking people, is very good at reading them and makes a great detective. She is depressed, yet realistic, kind yet grumpy, fanciful yet persistent. Yet there is such humor tied in with the hopelessness and practical assessment of terrible things - reading this book was almost like therapy. Helen has one close friend who dumps her - but we don't find out why until later. What friend am I? What would I do? What are people hiding from me? Am I the weird one? It's not a light sexy summer read (although there are one or two hot sex scenes), it's more an engaging mystery combined with narrator growth and quirky dark (dare I say Irish?) humor."}, {"userName": "Arielle Walker", "userReviewDate": "Jun 14, 2013", "userURL": "http://www.goodreads.com/user/show/6762949-arielle-walker", "userReview": "3.5 starsMarian Keyes has a real gift for character voice. Helen isn't my favourite of her characters, but she certainly is amusing and kept me very entertained for the short time it took to read this. Yes - short time, even though the book is actually fairly hefty in hardback, but it's simple and delightful to read and that makes the time go fast. Not her best work, perhaps, but still great nonetheless."}, {"userName": "Richard", "userReviewDate": "Dec 21, 2014", "userURL": "http://www.goodreads.com/user/show/18181601-richard", "userReview": "I bought this on Sunday and am finished by Thursday. Tells you all you need to know. I have whipped through every Marian Keyes book. She's a genius and manages to tell a story and talk about 'issues' using her magnificent sense of humour.The Mystery of Mercy Close is as the title suggests a bit of a detective story too.Unreservedly recommended. Read some Marian Keyes. She will enrich your life!"}, {"userName": "Sam Bok", "userReviewDate": "Sep 22, 2012", "userURL": "http://www.goodreads.com/user/show/6320872-sam-bok", "userReview": "Not as good as the other Walsh sisters books. In the middle there was a hundred pages where nothing happened. I figured out where Wayne had gone pretty early. I thought the ending was obvious. Helen was conveniently dense about the 'mystery' and didn't follow up obvious leads. Of course the book was still funny and charming with fantastic characterisation but if you're a Marian fan, lower your expectations now."}], "description": "Helen Walsh doesn’t believe in fear – it’s just a thing invented by men to get all the money and good job – and yet she’s sinking. Her work as a Private Investigator has dried up, her flat has been repossessed and now some old demons have resurfaced.Not least in the form of her charming but dodgy ex-boyfriend Jay Parker, who shows up with a missing persons case. Money is tight – so tight Helen’s had to move back in with her elderly parents – and Jay is awash with cash. The missing person is Wayne Diffney, the ‘Wacky One’ from boyband Laddz. He’s vanished from his house in Mercy Close and it’s vital that he’s found – Laddz have a sell-out comeback gig in five days’ time.Things ended messily with Jay. And she’s never going back there. Besides she has a new boyfriend now, the very sexy detective Artie Devlin and it’s all going well, even though his ex-wife isn’t quite ‘ex’ enough and his teenage son hates her. But the reappearance of Jay is stirring up all kinds of stuff she thought she’d left behind.Playing by her own rules, Helen is drawn into a dark and glamorous world, where her worst enemy is her own head and where increasingly the only person she feels connected to is Wayne, a man she’s never even met.", "title": "The Mystery of Mercy Close\n      \n          (Walsh Family #5)", "url": "http://www.goodreads.com/book/show/12724978-the-mystery-of-mercy-close", "average": 3.63, "cover": "https://images.gr-assets.com/books/1340719307l/12724978.jpg", "reviews": 1292, "authors": [{"url": "https://www.goodreads.com/author/show/6104.Marian_Keyes", "name": "Marian Keyes"}], "type": ["Womens Fiction", "Fiction", "Mystery", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/12724978-the-mystery-of-mercy-close", "http://www.goodreads.com/book/show/15931331-the-mystery-of-mercy-close", "http://www.goodreads.com/book/show/15843782-the-mystery-of-mercy-close", "http://www.goodreads.com/book/show/17393367-the-mystery-of-mercy-close", "http://www.goodreads.com/book/show/17630616-the-mystery-of-mercy-close", "http://www.goodreads.com/book/show/15811502-the-mystery-of-mercy-close", "http://www.goodreads.com/book/show/18114267-the-mystery-of-mercy-close", "http://www.goodreads.com/book/show/9300.Watermelon", "http://www.goodreads.com/book/show/82748.Sushi_for_Beginners", "http://www.goodreads.com/book/show/9301.Rachel_s_Holiday", "http://www.goodreads.com/book/show/165030.Anybody_Out_There_", "http://www.goodreads.com/book/show/9303.Lucy_Sullivan_Is_Getting_Married"]}