{"ratings": 380, "userreviews": [{"userName": "S.K. Munt", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/15406032-s-k-munt", "userReview": "http://www.amazon.com/dp/B00DQOM8G6I wrote The Marked Ones because I felt as though mermaids were a very underplayed genre- virtually inaccessible to adults. I'll let the other wonderful mer-fiction writer's tell you a tale about underwater kingdoms and inter-species battles... if that's what you're after, read those because in my world, Mermaids live among us, spend as much time with two legs as they do their tails and are slaves to their wants, needs and the environment.... oh and they raise hell.Just to preface, The Fairytail Saga is set in Australia with characters from across the globe, and is a knock 'em down, drag 'em out Love triangle which gets a tiny bit (okay a lot) erotic in PLACES ( this is not erotica- but hotter ;) and I don't recommend it for readers under the 'smouldering' age or those opposed to the occasional cuss word, that isn't written like: Cuss. This book will frustrate the hell out of most readers- and I pride myself on that! Before the conclusion, I'm going to make you want to track me down and throttle me BUT hopefully you do so with a song in your heart and a really big crush on one of the absolutely wonderful heroes or heroines. And just be warned, I do Happily Ever Afters.... I just drag you through the forest naked and fighting for your life first and twist when you least expect it ;)"}, {"userName": "Rebecca", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/10248156-rebecca", "userReview": "I LOVED this book!! Kept me up all night, I refused to put it down until I'd finished it. Such a great read, I really connected with the characters, the storyline is fantastic and I just want more! I highly recommend it and I cannot wait for the next installment!"}, {"userName": "EroticaAfterDark (Lilith)", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/33416536-eroticaafterdark-lilith", "userReview": "[ the whole magic thing (hide spoiler)]"}, {"userName": "Sally906", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/4949011-sally906", "userReview": "A very easy to read mermaid romance. BUT, I hated the ending. The ending didn't end, it stopped - to be continued. I understand that series don't come to a complete end, but this didn't even have one part end and then have threads that take you through to the next. It just stops."}, {"userName": "Howard Parsons", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/6545639-howard-parsons", "userReview": "We all have fond and not-so-fond memories of adolescence and those summer crushes: The girl at your dad’s Army reunion. The boy who visited his grandparents next door to you.  They were there every year and things developed from a simple ‘like’ to something you dreamed about from the moment autumn breezes began to blow until the time when school was out and the summer really began. You saw them every summer until you didn’t and wondered where they were and what had happened to keep them away. Most of us got over those crushes and relegated them to the fond memories box in the back of our minds.For some of us though, the emotional wound failed to heal when school started up again and festered inside of us for years afterward. The long-needed healing would only come when we finally saw them again ten or fifteen years later and discovered that the perfect person from summers long ago suddenly had a beer-belly, six screaming kids, copious tattoos or all of the above. Reality can be a bite but it can also be a great curative.Sometimes though, reality can only make things worse. Lincoln Grey is one such victim. He has carried a torch all this time for his long-lost summer love and the years have not been kind to him. Although he’s only twenty-eight, he appears to be in his forties. Hard work and the sense of loss that just won’t go away have sapped his joie de vivre and aged him beyond his years. He is the reality that his summer crush will see when she returns to the resort where they met so many years ago. She seems to have not aged a day and yet so much has taken place in the interval. Even so, that long-forgotten lamp in the dark reaches of her heart is still lit and soon makes its presence known.Her name is Ivyanne - this reviewer so wishes that he had a daughter to bestow this moniker upon - and her life of privilege is very complicated. She is pursued by three suitors amongst who she must choose a mate within the relatively near future. She has already been promised twice before and in each case, the intended lost his life. Suddenly, Lincoln is a dark-horse fourth candidate for a match that can never take place for you see, Ivyanne is a princess and . . . a mermaid. And so begins a tale of emotional conflict, lies, deceit, forbidden love and broken hearts. The happy ending almost seems to be an endangered species.Ivyanne is shocked both to discover her long-lost love at the resort and to see the physical and emotional state that he is in. She wants Lincoln to be able to move on with his life and find whatever his destiny may be. It won't include her but she wants him to be happy so she herself can move on as well. After all, she is responsible - at least indirectly - for his present condition.Ivyanne landed her job at the resort solely upon the recommendation of some of the other merfolk who work there. One such person is the lady who runs the spa. Ivyanne asks/commands - she is a princess after all - that Lincoln be given a bit of the spa treatment usually reserved for other merfolk with the reasoning that if some of the decade's worth of physical damage is erased, he will feel better about himself and will be more attractive to human females. If he feels better, then she will feel better about what has happened.Or so she thinks. The best laid plans oft go astray and this one will be a prime example. Lincoln has his afternoon at the spa and subsequently attends the staff beach party later that evening. Everyone is shocked and amazed . . . most of all, Ivyanne . . . to see the difference that a single afternoon has wrought on Lincoln. In that pivotal moment, she discovers that her feelings for him are deeper and more alive than she thought. One of her three suitors notices this as well.And what was the deal with the human? Ardhi hadn’t been close enough to hear them conversing, but he’d seen Ivyanne’s face alight with animation-seen her knock back a full drink in one gulp the moment the tall man had loped away. She’d then turned to the ocean, and rested her hand against her heart with a ridiculously moved smile on her face. A smile Ardhi had never seen before. A smile no human should be capable of gleaning from their princess.S.K. Munt has penned a smart, compelling and emotionally wrenching story that is difficult to put aside. It is book one in her Fairytail trilogy and is an impressive debut. \nThe Marked Ones\n is a fish in a very small pool of adult _ with a little ‘a’ - mermaid/man fantasy novels. The recent upwelling of mer-fiction has been mostly limited to the Young Adult market. While so much of that sub-genre contains well-written tales of sub-aquatic teen angst, there are those of us who long to read a good story of sub-aquatic adult angst now and then.The Marked Ones differs from the all too common adult story where a so-so plot is used to tie together a series of hot sex scenes. Throw in the aquatic angle and you have a tale of tails and titillation. This is not to say that there is nothing steamy about Ms Munt’s novel. There is one scene covering two chapters that is guaranteed to curl your tail-fin but that is the only one requiring a cold shower. Without a doubt, The Marked Ones is probably unsuitable for all but the very upper end of the YA range. Nonetheless, there are some of those who will discover it just as this reviewer discovered Herman Wouk’s Marjorie Morningstar in the 11th grade. Unless they have led sheltered lives, readers in the awkwardly named \"New Adult\" category will be able to relate to the story along with the general adult population.\nThe Marked Ones\n is a good . . . really, really good . . . read. By all means, buy a copy of this novel and read it for the mer-folk, read it for the drama, read it for the heartbreak and read it for the unexpected ending. In all respects, the story is a memorable and well told tale. This reviewer is left with the feeling that this novel is merely a knock-up and there are greater things to come from S.K. Munt. She is an up and coming author that fans of this genre would do well to keep an eye on.There are two more installments in this series and this reviewer is eagerly awaiting their release. Once you have read \nThe Marked Ones\n, you will too.Read my interview with S.K. Munt at The Parsons' RantThere are more reviews of Mer-fiction at The Parsons' Rant"}, {"userName": "Mara", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/23051278-mara", "userReview": "Is it possible to love a book too much? I want to hold up a poster and run around telling everyone to read this series, but that would be weird so I’ll stick to writing a review about how awesome this series is. I rarely ever find a book series where I can come back to it and not be as engrossed into it as the first time, but I’ve read this three times now and I love it just as much as the first, the only thing I regret is not finding out about it sooner. I loved the writing, the mermaid mythology, the setting and the characters’ (maybe not Lincoln but that’s because Tristan outshines everyone and he was standing in the way of the most beautiful ship ever). \nThe story is set in Australia, and S.K Munt’s description of the sunny resort really makes me want to go down under, I’m actually going to go and try to find some mermaids. Well maybe not mermaids, but I can hope to find a Tristan Loveridge right? \nOur heroine is a mermaid princess; Ivyanne Court, she is beautiful and currently frustrated; she has to choose between three potential suitors for marriage that will carry on her bloodline. \nTo get some breathing space to think (away from the very persistent infatuated best friend Ardhi) she works at the Seaview. And then we get introduced to a ton of new characters, her childhood love Lincoln, who is still very much in love with her the other mermaid workers and the very sexy Tristan. The focal point of this story is a love triangle that had me wanting to rip my hair out but I loved every bit of it, be warned I only loved it this much because Ivyanne ended up with the right guy (according to me). The writing is very refreshing, and the third person perspective allows us to get insight into all the character’s minds, I would have probably gone crazy in just Ivyanne’s head. My previous experiences with mermaids books has been terrible (Syrena series) which is why I was reluctant to read this novel but I thank my lucky stars I took the risk and discovered one of the best books I have read in a very long time."}, {"userName": "Jen", "userReviewDate": "Aug 12, 2013", "userURL": "http://www.goodreads.com/user/show/6589908-jen", "userReview": "This series will become a world wide phenomenon! Read it now so you can tell your friends you loved it before there are 200 copies on the shelves of K-Mart ;) The marked ones will leave you thinking Twi-what? Kellan who? and not Christian Grey but Lincoln Grey!Seriously though The marked ones ticked all of my boxes. It was beautifully written, heartbreaking but hilariously funny also, full of angst, not one but three gorgeous fellas. It's a page turner with twists and turns that will leave you completely torn. I cannot wait for the next one!!!"}, {"userName": "Emm Cole", "userReviewDate": "Aug 29, 2013", "userURL": "http://www.goodreads.com/user/show/12110334-emm-cole", "userReview": "The Marked Ones starts out with Ivyanne, a mermaid princess who must fulfill her duties to her people by choosing a husband from several suitors who can ensure the pure Mer bloodline continues.I know some readers will say they’re bored to death with a heroine being pursued by multiple (Mer) men. BUT guess what? S.K. Munt pulls you into her story like a tidal wave. The Marked Ones successfully finds a way to show three very different and genuine love stories— one that originates from childhood friendship—one that has that deep and beautiful strength of young love—and (my favorite) one that starts out as merely raw, sexual attraction and slowly develops into something much more.Ivyanne is a character that’s easily relatable. This book is unapologetic about Ivyanne’s struggle to live up to her kingdom’s expectations while dealing with the hormones and emotions any single woman in her 20’s probably does. I love the honest vulnerability of her character, because while she makes mistakes, Ivyanne’s not a flighty pushover either.I was aware before reading this adult mermaid book that many readers were fans of this series because of the sexy scenes and hunky heroes throughout. But truth be told, although those scenes will make your Kindle smoke, my favorite part of this book was the dialogue.Munt writes some spectacular and snappy dialogue. She really has a gift for it. This is a series that is going to take off. I can just feel it. So if you’re an adult who enjoys a steamy romance, you should pick this one up. Add me to S.K. Munt’s ever-growing list of avid fans."}, {"userName": "Suzanne", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/5999683-suzanne", "userReview": "Ivyanne is a mermaid princess who has been sheltered her whole life. As the princess, it is her duty to marry a merman who is worthy enough to be king as well as help her create the purest offspring possible. She had been previously promised to two others who died so she thinks she has been cursed. Three men have stepped forward as suitors but she just needs some time to herself to contemplate her choices since she has resigned herself to marrying for duty rather than love. The three men are from marked families, Ardhi, her best friend, and Tristan and Bane who she knows very little about. She chooses a resort where she spent many summers not expecting to come face to face with Lincoln, her childhood human love. So instead of a quiet time to gather her thoughts, Ivyanne has to contend with two out of the three suitors vying for her attention plus Lincoln who has always held her heart but cannot be her future.I'm really glad I read Urchin first so I understood the mermaid history and family hierarchy. This was a great progression of the mermaid story that I thoroughly enjoyed, fell in love with Tristan, and was surprised with some great action and twists I didn’t see coming. Looking forward to starting the next book in this awesome series! I have read several of S.K. Munt's books and can count on her amazing writing and wit to completely draw me in."}, {"userName": "Trisha", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/21955241-trisha", "userReview": "omg what can I say. amazing book I'm glad I have the 2nd book already to go. this book has had me suxed I'm from the beginning and I just had to keep reading till I finished haven't read a book like that in a very long time. I still can't pick a fav but I hope link wins the girl"}, {"userName": "Kerris", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/18846474-kerris", "userReview": "So... pribeh 4 chlapu, co se perou o ruku jedne \"zeny\" (berte velmi s nadsazkou, protoze se chova jako mala holka). Divci postava je naprosto dokonala, uzasna a vsichni za ni slintaji. V prubehu pribehu zvladne neco mit hned se 3 z hlavnich hrdinu. A nutno dodat, ze jsou to vsechno stejne kreteni.Takze...Ocekavani: Fajn pohadka o morskych pannachVysledek: Reality show o tom, jak sbalit blbku.Konec: Cliffhanger (one down, three to go)."}, {"userName": "Lydia Sass", "userReviewDate": "Sep 25, 2013", "userURL": "http://www.goodreads.com/user/show/16096303-lydia-sass", "userReview": "This was my first read to review book and I did not know what to expect. I was very pleasantly surprised.Ivyanne is a mer-princess who was incredibly sheltered all of her life. As the princess and one of the few full blood mermaids, it is her duty to marry a merman who is worthy enough to be king as well as help her create the purest offspring possible. Three men have stepped forward, her best friend, a pain in the ass, and a rather neutral party. Having had two previous engagements ending in disaster, Ivyanne is understandable resistant to choose and spends some time on the main land to collect her thoughts and come to a decision. Enter, Lincoln, her childhood human love and, instead of a quiet time of reflection, Ivyanne gets to contend with two out of the three suitors vying for her attention and the guilt of keeping her secret from the man she truly loves.I really enjoyed the world that the author created. It was complex, detailed and enthralling. The mermaids were very well thought out and descriptions of their transformations and little tricks to fool the humans were imaginative and usually believable. I also enjoyed that the author did not shy away from a mermaids natural instincts to be selfish and tunnel visioned. They're not just mermaids but sirens and can be flawed and dangerous. We see this come out quite a few times in the main character and it makes her all the more believable. The one difficulty I had with the the author's world was that the history of the mer-people is so detailed and complex that I had a hard time keeping up with who was who. I still don't think I quite understand the lineages and who is special to whom and why. I think it would have been nice to have almost a family tree worked into the book so that when I was having trouble remembering who a character was and why he/she was important, I could refer back to the tree and understand a little better. It took me at least halfway through the book if not more to be able to sort out all the different characters and histories.In \"The Marked Ones\" no one is really as they seem. Ivyanne is portrayed as a \"good girl\". She's virginal and sheltered but knows her own mind and doesn't shy away from her sexuality as one would expect from a virgin, which is refreshing. Must be the siren in her. Tristan and Ardhi, the two lead suitors, will definitely surprise you and not necessarily for the good. I was really surprised by one of the plot twists at the end. I think out of everyone, Lincoln, Ivyanne's human love, was my least favourite character. He came across whiny and a little too vulnerable for me. I found myself rooting more and more for one of the mer suitors, not only because of her duty to her people, but because the human was such a pansy.Finally, the author's writing style was easy to read but not boring. Many times, it can be difficult to blend literary interest with actual story telling without being either too flowery or too bland. \"The Marked Ones\" was definitely a quick read for me. The story picked up pretty much from the very beginning and did not lack a variety of language and style.I'm really looking forward to the next book. Keep 'em coming!"}, {"userName": "Becki", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/22660480-becki", "userReview": "Ivyanne Court is next in line for the Mer throne. She's being pressured to marry to carry on the royal line. Feeling trapped, she runs off to the seaside resort of her youth to think things over. Should she marry the hottest merman alive, her closest friend or someone who seems to show no interest in her? They've all put their proposals in but she loves none of them. To complicate matters more the love of her life, Lincoln, is now the owner of the resort. The problem? He's human and off limits to Ivyanne. She's only allowed to marry a Marked One and Lincoln is not one of them. She must choose between the best man for her people or the best man for her heart.This story grasped me from the start. I have yet to read a Mer story and Munt's plot is intricate and well thought out. Fantastic story of creation and history of the Mer people.Munt has a way of making “to-die-for” men. Tristan is one of these. At first, you just want to kick him where it counts but halfway through you're wishing he'd come crashing through your bedroom door. I'm not a huge fan of love triangles, though, so that part for me was a little trying but it was also the antagonist in the story so I got through it.This is the 3rd book by Munt that I've read and I'm currently reading a 4th. She has written about so many different paranormal beings, I believe she can write a book about paint drying at this point and I'll still read it. She is quickly becoming one of my favorite authors."}, {"userName": "Monica", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/24307172-monica", "userReview": "I was given a copy of this book in exchange for an honest review for the Lovers of Paranormal group on goodreads.com I thoroughly enjoyed reading this book! It was a well thought out and imaginative take on mermaids, their hierarchy, origins and lives. I have always been fascinated by mermaids so I had a lot of expectations of this book, and S.K. Munt didn't disappoint! There were a few typos but it didn't detract from the enjoyment I got out of reading this.We are introduced to the mermaid Princess, Ivyanne and she is a 28 year old mermaid, although she only looks to be about 16-18. That would be fantastic lol. She has come to the point in her life when it is time for her to chose her husband and future king. Her prospects are not what she wants them to be and she is expected to chose from a Marked son, a Mer that is pure blood with royal lineage. She is overwhelmed by the gravity of the decision she must make so she decides to spend some time on dry land among the humans to have some life experiences on her own. Things quickly turn harder than she could ever have imagined when she starts her new job and it all escalates from there. I'm not gonna tell you so that you'll read it for yourself! You will be rewarded!The ending is a real treat and I am on pins and needles waiting to read the next one!"}, {"userName": "Cheryl Duval", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/23380336-cheryl-duval", "userReview": "I received this book in exchange for an honest review from the Author and the “Lovers of Paranormal” Group on Goodreads.comThis is one of the best books I have read in a while! The author made mermaids actually believable. To be honest, when I first received this book to review I was sure I would not like it, I was thinking it would be like \"The Little Mermaid\" type of a story. No, definately not! This story has everything you could possibly want in a book. Love, hate, betrayel, action and much more. The twists in the story were great....didn't see them coming. The characters were compelling and believable. The mermaid life and traditions she created were awesome.In conclusion, when I finished this book I immediately bought the next two books in the series....there was no way I could wait to find out what happened. This is saying a lot for me because I only rarely buy digital books, and never if they are more then $0.99.I love this book. I highly recommend it. If you think this is just a story about mermaids you are wrong....give it a try, I think you will love it as much as I did.Thank you S.K. Munt for inviting me into this awesome world you have created. It swept me away and I think it would make an incredible movie!!"}, {"userName": "sarah ▸ ɪғ ʏᴏᴜ ɢᴇᴛ ᴋɪʟʟᴇᴅ, ᴡᴀʟᴋ ɪᴛ ᴏғғ", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/23574110-sarah", "userReview": "Reasons I didn't like this book:- over-sexualises women- too much drama- Ivyanne complains too much instead of doing things- boring love square- Tristan is a diva- zero likeable assholes- Lincoln is an asshole and an assaulter- romanticises assault- missed the gory element of sirens- ‘I won’t have another man’s bruised ego on my conscience!’ -Ivyanne. Honey, the most fragile thing in the world is a man's ego. Bruises come easily, stop feeling guilty- everybody's in love with the main character apparently- get over yourselves- apparently every man is hot to the main character- MC is boring- too many beauty stereotypes- bad grammar in terms of apostrophes (plurals is written like that and not like plural's)- occasional spelling errors- no queer representation which was a lil disappointing (although then again, most books don't have queer representation)What annoyed me most was the sexualisation of women and the scene where Lincoln advances on Ivyanne when she makes it clear she doesn't want it, and then she finally joins him and lets him assault her... :/// It's not okay to romanticise that."}, {"userName": "Mallery", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/12020296-mallery", "userReview": "So while this book has some of the frustrating bits of an ebook (it could probably use a teensy bit more editing and I am having trouble finding the sequel in the Nook store), I really enjoyed it. It has strong fairy tale roots in that the main narrative is suitors vying for the hand of the princess. And let me tell you, that was so much easier to read than the story with guys fighting over the normal girl who doesn’t even think she’s pretty. I had no trouble buying that there would be 3 dudes ready to destroy each other for the hand of the smokin’ hot mermaid princess. And maybe this is a sign that I am outgrowing the YA level, but I thought it was great that marriage was on the line and not just a date to prom or whatever. Another thing that I liked/found super frustrating is that there isn’t an obvious choice for husband. I definitely have a favorite, but I can’t tell if he is going to win or not. He was so close, but then circumstances changed. I think that maybe I am supposed to be rooting for the childhood love to win out, but I don’t even like the guy."}, {"userName": "Renni", "userReviewDate": "Aug 16, 2016", "userURL": "http://www.goodreads.com/user/show/6876267-renni", "userReview": "Not usually a fan of love triangles, but I was convinced by Ivyanne's emotional entanglements and developing relationships to make this exception.While the beginning was rough, the power of the entangled plot carried it through to the end. Lot's of high dramatic emotion! There were a bit too many players and too much action for all the characters to get their due development. For all the power, magic, and legacy, I wish there had been a bit more plot than just the fight for Ivyanne's hand, but since that matter isn't settled, this series may get more and more interesting. And the sexual tension and sex scene, whew, fantastic. No spoilers, so I won't say who with. Great paranormal romance: definitely recommend."}, {"userName": "Sandi Walsh", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/30020116-sandi-walsh", "userReview": "Oh my fish! Where do I start? The characters sucked me right in, I despise the villan with all I am right now, I haven't harboured this much resentment towards a villan since I read about \"bodachs\" in Koontz's \"Odd Thomas\". The first love of your teen years,,,, swoon, captured so perfectly I actually had a flashback to mine! I held my breath so many times through this that I think I can give a few 'mer' a run for their money. this story will suck you in, drown you & throw you up on shore wondering if you seriously just saw that! S.K. Munt you're gifted & this story is a gift! Thank you! Now on to download the next one!!"}, {"userName": "Jessica", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/7795634-jessica", "userReview": "I didn’t really get into this book until I was about 25% of the way through it. But once I got to that point I couldn’t put it down. Most of the fantasy books I read include vampires, angels, aliens, or werewolves. It was refreshing to be introduced to a new world. What girl doesn’t grow up wanting to be a mermaid? I enjoyed this story, fell in love with Tristan, and was surprised with some twists I didn’t see coming. As a bonus… who doesn’t love a good love triangle? I am excited to start Three Rings."}, {"userName": "Mark Holborn", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/18272412-mark-holborn", "userReview": "I didnt know what to think of this book at first it had me wondering in the begining yet it pulled me along as I got deeper into it. A mermaid princess torn between high born suitors and the love of a human male that plays out much like a fantasy soap opera with twist and turns that you dont see coming. The book will be enjoyed by those who love the romance/fantasy themed stories, kinda like \"Twilight\" but for Mermaids."}, {"userName": "Dina Roberts", "userReviewDate": "Apr 23, 2014", "userURL": "http://www.goodreads.com/user/show/29824726-dina-roberts", "userReview": "A mermaid princess is torn between two men...one is a merperson like herself and the other is human. Plus there's another merperson who's interested in her. It's a forbidden love story and a love-triangle type story. But not exactly a triangle, because there are other men and other women in the picture.I liked the story, though I felt maybe it could be a tiny bit shorter. I think my favorite character was Lincoln, the human."}, {"userName": "Sheelagh", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/20334882-sheelagh", "userReview": "I am sentimental, and loved the idea of a mermaid based story. This failed to deliver. While it had one or two steamy moments, and a whole lot of promise - it was a poor story that kept getting worse and worse as it went along. It failed as a romance, because there was no chemistry between the main characters, it failed as human interest, failed as a new take on an old story, failed as an action, failed miserably overall. What a shame. Spare yourself and do not read this."}, {"userName": "Vicky Bix", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/21856345-vicky-bix", "userReview": "I absolutely loved this book...the characters are so full of sassyness and sexyness..once the characters had me in their grasp I could not put it down..my life was consumed by ivyanne and the men in her life...was up till 3am just reading to find out what would happen next...the author has done an amazing job in bringing her characters to life..so much so that u wished you had a Tristen or a Link in your life.."}, {"userName": "Emma", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/18296356-emma", "userReview": "This book is not what I usually read, When I read about it I thought oh mermaids and thought of Disney and singing lobsters! Which didn't bode well. ( Although there was singing.) If anyone doesn't like love triangles you'll want to read this there are five in the mix! and found myself shouting go for Tristan it's a no-brainer! All in all it was a great book and I will be reading the series."}, {"userName": "Tezz", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/22914652-tezz", "userReview": "Omg This book had me captivated from the start! It had me laughing, crying, angry and excited! lol if you know what i mean! The Author knows how to get a person addicted to her way of writing!!! CANNOT WAIT FOR BOOK 2 AND 3!!!!!!!!!! A MUST READ!!"}, {"userName": "Erica", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/526185-erica", "userReview": "Enjoyable and interesting take on modern-day mermaids. Has romance, intrigue, drama and humor. If you enjoy a new twist on mer-stories, you should check out this one."}, {"userName": "Janine", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/12007950-janine", "userReview": "Great book. I got sucked in from the from first page. Can't wait to read the next instalment."}, {"userName": "Melissa", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/23212054-melissa", "userReview": "I enjoyed this story. Apparently there is an newer version that has been edited, but I didn't get that one. So, my main complaint is that there were a lot of errors."}, {"userName": "Krissy Mulder", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/21956616-krissy-mulder", "userReview": "Completely captivating book. READ IT NOW! Hurry up book 2 :)"}], "description": "Librarian's note: This is an alternate cover edition for ASIN: B00DQOM8G6.Mermaids have three purposes in life; To breed, to protect their environment and to keep the knowledge of their existence limited to pages in fairytale books.Ivyanne Court is the personification of a mermaid princess-Breathtaking, pure, kind, sharp and strong, she is the envy of everyone she has ever met, human and mer alike. And yet she hasn’t known a day’s happiness since she came of age and was forced to abandon the human boy she loved, Lincoln Grey.Ivyanne has always known that she was to marry one of ‘The Marked Ones’ sons of a carefully cultivated bloodline created for the sole purpose of breeding with the royal family, and she had resigned herself to it. But now two betrothals have been severed in cruel twists of fate, leaving her untouched and lonely at twenty-eight, while being frozen both physically and emotionally, as a sixteen year old girl.When her parents declare that she can choose her next match, Ivyanne is overwhelmed by the weight of her decision, specifically because her best friend Ardhi, has put himself, and his heart, forward in an unprecedented declaration that cracks the foundation beneath her. Ivyanne begs permission to return to the Seaview Resort while she weighs her options, to live and work as a human, and gain some peace.But when she arrives, she is startled to learn that Lincoln has never left the Seaview. He is now the owner, and he has been waiting a decade for her return. The moment their eyes lock, Ivyanne knows that their chemistry hasn’t faded any more than her memories, and though she tries to push him away, the siren inside her draws him closer.But Ivyanne’s belief that her life couldn’t get any more complicated dissolves when Tristan Loveridge, the most arrogant and desired specimen of merman within the kingdom, arrives at the queens bidding, to lure the princess into a swift marriage. And Tristan Loveridge has never failed at anything. Only this time, he gets caught in his own magnificent net, because he has finally met a girl who's raw sexuality and brilliance, eclipses his own.And as Ivyanne is torn between what her heart wants, and what her body and kingdom demand, her best friend Ardhi is lurking in the shadows, growing angrier with each passing minute, and vowing to do whatever it takes to win the crown-with catastrophic consequences for all.", "title": "The Marked Ones\n      \n          (The Fairytail Saga #1)", "url": "http://www.goodreads.com/book/show/24704529-the-marked-ones", "average": 3.77, "cover": "https://images.gr-assets.com/books/1422321143l/24704529.jpg", "reviews": 96, "authors": [{"url": "https://www.goodreads.com/author/show/7159848.S_K_Munt", "name": "S.K. Munt"}], "type": ["Fantasy", "Mythology", "Romance", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/24704529-the-marked-ones", "http://www.goodreads.com/book/show/18158596-the-marked-ones", "http://www.goodreads.com/book/show/18159251-the-marked-ones", "http://www.goodreads.com/book/show/20646008-urchin", "http://www.goodreads.com/book/show/24704586-heads-or-tails", "http://www.goodreads.com/book/show/24704560-three-rings", "http://www.goodreads.com/book/show/22654840-palpitations", "http://www.goodreads.com/book/show/25645525-the-given-garden", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}