{"ratings": 840741, "userreviews": [{"userName": "Izzy", "userReviewDate": "Mar 04, 2010", "userURL": "http://www.goodreads.com/user/show/3382003-izzy", "userReview": "This book was recommended for fans of the Hunger Games series, a series that has become one of my favorites. I began The Maze Runner excitedly, hoping for an equally enjoyable, dystopian adventure. I didn't find it.The plot was intriguing and kept me reading; in fact, it was probably the only reason why I kept reading. Some writers are able to seamlessly integrate characterization and good writing with a fast-moving plot; James Dashner is not one of them. The pacing is strange, and Dashner's use of cliches became very irritating.The main character, Thomas, was annoying. Rather than allowing his readers to feel what Thomas feels, Dashner chooses to tell. We are told many times how \"frustrated\" and \"confused\" Thomas is, but we can't identify with him. Some of the supporting characters, such as Minho and Newt, could be interesting, but they remain secondary to Thomas. In addition, I was frustrated with the character Teresa. Teresa is the only female main character; instead of making her an intriguing, powerful female, she is christened with flimsy adjectives such as \"very pretty\" and \"smart\", becoming yet another 1-dimensional character. I realize that this is a plot-driven story and not a character-driven one, but I would hope that the characters would at least be appealing to the reader.Criticism aside, I found the book enjoyable, and the plot kept me hooked. I felt that the epilogue was well-written and I might seek out the rest of the series when it is published. Ultimately, it's unfortunate that Dashner's poor writing takes away from a good story line; in the hands of a writing master, I believe that The Maze Runner could have been something extraordinary.2.5/5EDIT: More than a year later, I have not procured any other books in the series, nor do I intend to. Personally speaking, this is one series better left alone."}, {"userName": "Tatiana", "userReviewDate": "Oct 10, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "This book would have been great IF:1) the characters had some personality2) the main character - Thomas - weren't such a Gary Stu and showed some character development and growth instead of conveniently \"remembering\" important information to advance the plot3) the book weren't filled with atrocious made-up slang - \"shuck-face,\" really, is this supposed to be cool?4) the villains - Grievers - were actually scary or dangerous5) the maze had some kind of mystery about it and not limited to moving walls and un-threatening prickly Grievers6) the plot weren't based on constant withholding of information by everyone and releasing it 200 pages later than it should have been7) the smartest of the smartest kids actually did something smart and uncovered some mysteries of the maze during the 2 years spent there8) the death of main characters evoked any feeling in readers9) the book weren't so slow-moving (thanks to constant withholding of info) and BORING!In the present form \"The Maze Runner\" deserves nothing more than an OK rating for moderately interesting premise. The hype and comparisons to \"The Hunger Games\" are unwarranted."}, {"userName": "Joe", "userReviewDate": "Mar 13, 2012", "userURL": "http://www.goodreads.com/user/show/406752-joe", "userReview": "[the moving walls of the maze actually form patterns of letters (that Thomas will eventually and conveniently know what to do with after experiencing the Changing himself), (hide spoiler)]"}, {"userName": "Meredith Holley", "userReviewDate": "Mar 15, 2012", "userURL": "http://www.goodreads.com/user/show/1302775-meredith-holley", "userReview": "Q: if you could edit this book, what would you take out?A: the words.. . . Have you ever had an eight-year-old kid try to describe to you winning a level of a video game? Have you ever had a middle-aged man try to describe to you completing the games section of the New York Times? Did those experiences involve multiple conversations like this:“What is the maze?”“Stop asking so many questions!”I have to say that this book was more boring than having someone tell you in painful detail about winning a video game or finishing a crossword puzzle. It is more boring if only for the constant, \"What are you talking about?\" \"No! I won't tell you!\" This book is astonishingly boring. I know that I am predisposed not to like it because there are no female characters (no, I do not count the leggy, blue-eyed girlfriend as a female character), but, really, I ask you: are there any male characters either? If you say, yes, then I challenge you to prove it. Are Mario and Luigi and Princess Toadstool characters in Mario Kart? What about the ducks in Duck Hunt? Are they characters? We have to draw the line somewhere. And I submit to you that there are no characters in this book. Or, at least, there are fewer characters in this book than there are in Duck Hunt.Also, a couple of things that bothered me throughout: 1. What famous scientist was Minho named after? Okay, I just googled that and apparently Dashner “purposely” named a few characters after scientists who will supposedly exist in the future. Like the only Asian kid in the book. Because there are no Asian scientists today that he could name someone after. *facedesk* And like Zart. Zart and the Asian kid were not named after scientists. *double facedesk*2. Why can’t the grievers climb over the wall? They obviously can climb. But not over the wall? Did I miss this? At first I thought the kids were in some kind of dome, but then it seemed like it was just a really tall wall. . . . That it was impossible to climb? WHYYY?????3. What purpose does the telepathy serve? None is the answer. It serves no purpose. 4. Why is this book so, so, so long and boring?So, maybe a third of the way through the book, I developed this false hope that this book would be some kind of pretty metaphor for children going through the grieving process and supporting each other in loss. I thought, “Oh, grievers! Maybe the challenges of the maze and the bonding of the boys in the glade will have some larger message.” No. This book is not about that. It is about doing the NYT games section and then maybe vague talk of zombies later. Total bullshit.I have to think this book came out while LOST was still on and before its terrible conclusion, which forced millions of Americans to face the fact that when it looks like a story will have no purpose, it probably has no purpose. I have to think Dashner thought he could bank on the millions of us willing to suspend our skepticism and keep watching a show whose writers clearly had no plan. I am hoping that in the wake of that disaster, we will have grown up a little and be less willing to stand for bullshit like this. I googled it, and, yes, I was right. Cashing in on gullible LOST audience. Unacceptable."}, {"userName": "Emily May", "userReviewDate": "Dec 22, 2010", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "“You are the shuckiest shuck faced shuck in the world!”\n\n2 1/2 stars. It's funny how just a few years can change everything - your reading tastes, your expectations, your standards... because when I read The Maze Runner in early 2011, I enjoyed it a lot. It seemed fast-paced, exciting and a little scary. Plus, I thought the slang was a nice touch. Three years and a million dystopian/sci-fi books later and everything about me has outgrown this book. It's not terrible. I can still see why someone who is new to YA dystopias might get caught up in the loosely-plotted (read: nothing happens) drama and think that \"shuck\" amounts to a clever invention of a new language. But as I was rereading this before seeing the new movie, I realised just how much it pales in comparison to many others in the genre.The thing about this book is that it is so simplistic and... immature, I guess. I'm not here to simply piss off the book's fans - I enjoyed it too, remember! - and I can still see why it might provide some light entertainment. But... the characters and plot are so underdeveloped. The language seems silly now. The scary Grievers no longer seem scary, but cartoon comical instead. Dashner uses that tiresome old writing technique called \"withholding information\" to propel the non-existent plot along. The whole book is built around a single mystery - that of the maze - and our supposedly intelligent-beyond-belief characters keep the novel going by standing around and scratching their heads. It's so lacking in any depth, layers or complexity. Comparisons to The Hunger Games are frankly quite hilarious when you consider Collins' intricate world, complex characters and clever plot... then consider what Dashner offers up next to it. Not to mention that Thomas is an extremely boring, self-sacrificing MC.In its defense, though, I was still affected by what happens near the end. I would recommend the book - with some hesitation - for younger readers or those who are new to YA dystopian fiction.Blog | Facebook | Twitter | Instagram | Youtube | Store"}, {"userName": "Etnik", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/34369915-etnik", "userReview": "Okay so before I start I want to say something.I personally hesitated to read this book because I heard too many bad reviews and things about this book.But let me tell you something.Yeah it has it's problems like the written style but this book has one of the best story plots I have ever read about.And believe,once you get into the book,you will not care about the writing or anything else.I am seriously so angry I haven't read this book early and even more for listening or reading those really bad reviews for this book.I know everyone has their own taste but really I heard things that really discouraged me to read this and they are not true.And one last thing before I continue with my review,this book is awesome without having instalove,or love at all,without having nakedness or anything like that.So if you find this interesting,pick it up and decide for yourself,because for me is totally worth it!\n____________________________________________\n\n“If you ain’t scared… you ain’t human.” \n\n____________________________________________\n☆☆☆☆☆4.8 RUNNY STARS!☆☆☆☆☆\nYou can find the full review and more about this book on my blog!I admire this book,really from the first page to the last.I have been waiting for a dystopian like this.The Maze Runner is a full action pack novel with awesome badass moments and thrilling and suspense scenes.____________________________________________\n\n“I've been shucked and gone to heaven.” \n\n____________________________________________The world,the maze is one of the greatest ideas,and it was awesome.The way it was build,with sections and everything,the glade,the grivers,they were all so thoughtful and really well made.I also watched the movie and I must say it is a lot similar to the book,and it has visualized my thoughts.____________________________________________\n\n“You are the shuckiest shuck faced shuck in the world!” \n\n____________________________________________The characters were also great.What I liked was the conversations they had with each other.They felt normal and real,exactly according to their age.Thomas is a great main character,but I don't know he has a thing for crying,and somehow he seemed weak sometimes.Newt was my favorite character.I also liked Teresa and Minho.____________________________________________\n\n“Shouldn't someone give a pep talk or something?\" Minho asked, pulling Thomas's attention away from Alby.\"Go ahead,\" Newt replied.Minho nodded and faced the crowd. \"Be careful,\" he said dryly. \"Don't die.” \n\n____________________________________________The reason why this is not a 5star book for me,is because of the writing style.Like a lot of people,I had a problem,a minor problem with it.It was annoying,especially at the beginning.Also annoying were the repeated phrases like the names,and the sentences were somehow short and not very rich.But beside that everything was perfect for me!____________________________________________\n\n“It's kind of hard to ask a dead guy what he did wrong.” \n\n____________________________________________The story follows a boy named Thomas who finds in a unknown place,with unknown boys.He doesn't remember anything beside his name.Others don't neither.He learns that he's placed in a maze,and there is no way out,at least not found yet.After his arrival,strange things start to happen,things that has never happened before,things that could bring only destruction and death.There must be a way out,and he has to find it!____________________________________________\n\n“Just follow me and run like your life depends on it. Because it does.” \n\n____________________________________________I highly recommend this book to every reader out there,and as I said don't judge it before reading it.For me it was awesome,for someone is not,but you should try for yourself!"}, {"userName": "Nataliya", "userReviewDate": "Dec 30, 2014", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "The last page is turned and all I have to say is this:\n What for the love of all that's good and pure was this foolishness?\n...Aaaaand ..... rant!-----When I'm sick - the snotty phlegmy febrile kind of sick - and my brain feels sizzlingly fried, I sometimes turn to easy reading \"fluff\" to give my neurons a break. Sometimes this strategy backfires and the 'fluffy' book actually tries to break my long-suffering brain cells with its sheer stupidity.It's not even mediocre; mediocrity would be elevating this book to the undeserved heights. It's simply boring, uninspired, ridiculous and poorly executed. ------Let me sum up the things that I thought were awful, stupid or just plain ridiculous (apparently my febrile brain likes making lists):# The dumbed-down plot full of holes that relies on pointless withholding of any useful information. Seriously. When there is no reason for keeping the characters in the dark, all suspense goes out of the window. There was no reason why nobody could tell Thomas what was going on when he showed up in the Glade or when he saw the Doors or the Maze.While I'm at it, can anyone please explain why the klunky shanking shuckface are the words randomly capitalized? Is the book meant to evoke the thoughts of the German language where the nouns are capitalized? Or was the author too lazy to come up with proper names for places and instead just threw in some capitalization? Foolishness, I say.The frustrating to me approach of never discussing what happened with those who went through the Changing. The lack of curiosity about the only potential exit from the Maze that the boys have found in two (!) years. The pointless doing the same thing over and over again just to come up with the same results, relishing in the special status of the Runners instead of just sitting down to discuss the situation and their findings.# The atrocious unbearable awkward slang. Replacing 'fuck' with 'shuck' and 'shit' with 'klank' for PG purposes does not work when you shove it unto the readers' faces every sentence or so. At least be inventive or make it sound organic, but all that's achieved is sounding like a five-year-old complaining to her Mummy.\n\"You're the shuckiest shuck-faced shuck there ever was.\"\nI rest my case in the face of this nonsense.# The silver plate on which everything is handed to the absolutely special protagonist. Because Thomas is so special at fragging everything. He doesn't even need to try. Instead, when we need a proof of his awesomeness, the get the sudden impulses and urges that are never wrong, or if that fails, simply a quasi-recollection that saves the day. Which segues into my next frustration point:# The lack of any character development besides the-author-wants-it-so approach. The author knows what he wants to happen in this book, and he moves the characters along like checkers pieces, just to make plot happen. The characters are just sorta there, are static, and therefore I could never get invested in them enough to care even when some of them died. Especially when the death of at least one of them was pointless.# The pointless villains and scares that should have been comic relief instead. Yes, the Grievers and the strangely non-menacing way they were portrayed. The Maze that is anything but intimidating (that effect is due to the non-spectacular writing, really). The Changing - oh so scary of experience! - that does not really affect Thomas the Special Snowflake, not even a minor inconvenience.# The pointless vilifying of perfectly reasonable characters for the sole purpose of making our special protagonist even more snowflake-ish. It's poor Gally, who's labeled as a \"bully\" before he's had a chance to do anything even remotely bully-ish except for staring at Thomas with dislike. To cement his unlikeability, Gally is described as physically unattractive - because in shallow books like this one if you look like a villain, you must be one. Gally, whose distrust of Thomas is perfectly logical (if any of the characters would take any time to think about it instead of singing accolades to the Special Snowflake).# The too-stupid-to-live characters. Seriously. Every few pages my reaction was - really? You guys haven't tried that? You haven't thought of this?? You haven't talked about that???? Ugh.# The action scenes that read like a video game narration. This does not work in real life - even the kind of 'real life' that involves a few dozen of teen boys stranded in a few square miles area where they successfully run a farm, a slaughterhouse and an industrial-size kitchen.# The \"big reveal\" that is simply told to us, without anyone really earning it. No, the characters do not work hard just to get the pay-off; they get told all that's happening, like a cheap trick.# The absolute lack of any suspense or motivation to help propel the plot forward. No, everything is simplistic, childish and therefore strangely light and unconcerning. There is no depth, no real substance, and no complexity. It's page-filler, easy to read, easy to forget.1.5 stars.Yawn. A frustrated yawn, at that."}, {"userName": "Cara", "userReviewDate": "Oct 17, 2010", "userURL": "http://www.goodreads.com/user/show/1876075-cara", "userReview": "Reading this book + No sleep= brain shock\n. Oh more like my brain was blown into freaking little bits. I kept thinking about it after I was done. I finished it into the late hours of the night and I kept circling in my head what was going to happen next. The point is moot but I am definitely going to read the sequel The Scorch Trials.From the start as the reader we have NO idea what is happening. All Thomas can remember is his name. Not where he came from or any specific details of his life. Neither do any of the other Gladers who he meets in the beginning of the book. The place is filled with boys whose sole purpose is to try to get out of this place by solving the maze. They haven't had any luck in two years, but that may all change with Thomas's arrival. Strange things start to happen, and people are pointing fingers at Thomas. Will he be the one to get them out, or the boy who will bring them down?At first I was having a hard time getting into this book. Nobody wants to answer Thomas's questions, and I got just as frustrated as he did. I actually still don't completely understand why they didn't want to answer all his questions right away. The plot does pick up speed though and you get to meet Newt, Chuck, Minho, and Alby (all important characters in their own right). The world building is good because I got the creeps just thinking about the grievers, and I can feel the desperation but at the same time the camaraderie the guys have with each other. There is also a unique language setup that was a tad-bit confusing at first but you pick it up as Thomas does. The ending certainly is gonna give the series a big shakeup. I really want to see what Dashner has up his sleeve this time.I read this because of the good reception it was getting, but also because of a display at Barnes & Nobles. They had all these books that were hugely popular within the young adult realm and I had read all of them except, you guessed it, this one. I couldn't have any of that!Added later: Great news guys, there are making this into a movie! Here is a link to the little info that is out about the movie. Basically nothing but hopefully in the coming months that will change!Okay the trailer is out! I am officially excited guys."}, {"userName": "Inge", "userReviewDate": "Oct 29, 2011", "userURL": "http://www.goodreads.com/user/show/6278820-inge", "userReview": "EDIT 09/05/2013\nHoly crap, that looks perfect.--I am way better at writing reviews for books I hated, but I’m gonna give it a go anyway.--Okay. Breathe, Inge, breathe.\nOh, this is gooooood.The Maze Runner was like a breath of fresh air to me. I needed a nice, clean cut from the typical YA books filled with whiny protagonists, insta-love and love triangles, and I got exactly what I asked for. This book is like a giant puzzle that you solve along with the characters. It is filled with unexpected twists and turns, full of action and I sighed every once in a while because it was so much to take in at once. It started off highly confusing, but soon took a turn for the exciting and left me hanging with so many unanswered questions; after the last page, I was still begging for more. The Maze Runner had me gripping my seat until the very end. A great and very thrilling read.Thomas was a curious, smart and brave protagonist and basically everything the Gladers needed at the time. I didn’t really connect to any of the characters because they were a bit snappy and unpredictable, but I could definitely understand all the reactions and feelings. I felt all the emotions myself. I felt the sorrow, the despair, the excitement, the need for survival, everything. Though the idea of slug-like creatures didn’t really appeal to me at first, I got used to the image of the deadly Grievers after a while. They ended up being quite gross and I started fearing them as well. The arrival of the girl definitely lightened things up, not much, but enough. The deaths were very predictable but they did add to the story.And that ending! Ooooh, that ending killed me! I was so happy when I read the last sentence, and then I read that freaking epilogue. That was heart-wrenching. I knew it wouldn’t be a happy ending because it’s a trilogy, but I didn’t really know what to expect. I definitely didn’t expect this. Now I must get my hands on the sequel as soon as possible. Damn you, James Dashner.Like the publisher said, ”Thanks, James! It’s not like I wanted to sleep for a week anyway!” And it’s not like I had any studying to do or anything. *whistles innocently*"}, {"userName": "Mohammed Arabey", "userReviewDate": "Feb 26, 2013", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "[وللاسف ميكملش معانا لاخر الجزء (hide spoiler)]"}, {"userName": "Nic", "userReviewDate": "May 28, 2010", "userURL": "http://www.goodreads.com/user/show/2813423-nic", "userReview": "I've just finished and all I can say is holy shuck! This book is awesome! I was a little bit scared when I started this book that I wasn't going to like it as it is my first real dystopia/sci-fi book I've read. After about 110 pages it got to the point where I couldn't put it down for anything even while eating dinner I had it one hand and when bedtime came I wanted to stay up all night and read it.The plot was fast paced, suspenseful and full of suprises. The twists and turns this book took shocked me unlike any other book I've read. It also has some creative lingo but I found it easy to understand and I actually think it added to this books charm. The ending was amazing but left me with so many questions that I need answers for RIGHT NOW and I really wish October 12th would hurry up so I can read The Scorch Trials. All I have to say is read this book (especially you, Morgan :D)."}, {"userName": "Heather", "userReviewDate": "Oct 12, 2009", "userURL": "http://www.goodreads.com/user/show/2098381-heather", "userReview": "At first I was a bit put out with this book. I don’t know what it is about male authors, but they can be down right infuriating. Men truly do think on a different wave length and speak another language than women. I was becoming rather frustrated with the lack of information being given, and I wasn’t sure I would be able to endure that sort of aggravation for 300 plus pages. Luckily around page 60 or so, Dashner hit his stride and I became enthralled with this story.It’s so difficult to write a review that divulges information about the plot without simultaneously giving the plot away. Dashner mastered the art of dolling out need to know information in spades while maintaining an air of mystery that keeps you immersed in the story, craving for more.The Maze Runner begins with Thomas finding himself memory-less, surrounded by teenage boys of varying ages, in a strange place called the Glade. Thomas immediately begins asking questions, attempting to get his bearings, though answers aren’t forth coming, and the Gladers are none to helpful. Nonetheless, life doesn’t seem too shabby in the Glade. There is a homestead, crops, barns filled with livestock, the sun always shines, and various supplies appear in “the box” each week upon request. There even appears to be order within the Glade, though it is filled with nothing but testosterone fueled teenage boys. There appears to be only a handful of rules, 1. Never threaten your fellow Gladers, 2. Everyone must pull their weight, 3. No one is allowed in the Maze aside from runners, 4. No one is allowed in the Maze after dark. Though the rules are rather self-explanatory, their necessity becomes all to clear once Thomas is allowed to know what lurks behind the stone walls protecting the Glade. While no one knows how they came to arrive in the Glade, why they were sent, or who sent them, they all strive towards a common goal, solving the Maze and leaving the Glade. But once the first ever girl arrives into the Glade, a trigger is pulled, and the stakes for survival are raised.Despite the fact that I didn’t have an emotional reaction (crying when it was clear that I was meant to), I couldn’t set this book down. I wasn’t scared for any of the characters, my heart didn’t race, but I desperately wanted to solve the freakin mystery. Luckily, there is a conclusion of sorts; however, this is clearly a series as you gain new information that tickles your intrigue before coming to a major halt. Grr. So like all the other suckers, I’m sure I’ll be reading the sequel."}, {"userName": "Wendy Darling", "userReviewDate": "Apr 06, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "A premise full of promise, but after 150 pages, how can there still be no answers? Deliberately withholding information becomes frustrating not only for the protagonist, but for the reader as well. The fact that Thomas does not demand more answers from his fellow captives makes it difficult to sympathize with or care what happens to him. The spoilers for the book make it sound intriguing, but I can't wade through another 200 pages before it gets to the point. Aside from a few physical differences and \"bad\" or \"good\" actions, the boys tend to blend together as well. They're not fully fleshed out or unique in any way, and for a book that's centered around characters in a bleak environment in a desperate situation, this is a most unfortunate weakness."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Mar 20, 2014", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Thomas comes to the maze in a box, he has no memories of anything other than his name. He learns that he is the \"GreenBean\" or the newest boy to arrive. They get arrivals once a month.\nThere's a ton of questions about how he got there and why there is a maze that has walls that move every night.Then there are the Grievers. Which for the life of me I could not find scary. A machine-like slug? Pour some salt on that fucker.The next day a girl arrives.\nIt throws the boys into an uproar. A GIRL! and never before has a newbie came through the box the day after another one. Then they realize she has a mysterious note. It's all about to change. I wish it would because I am dang confused. No complete answers are ever given in this book. So a sum up of the whole book could be this very gif:\nWill I move on in the series? Probably not, it's not the worst book ever but I hate not having answers so I'll just get pissed off if I continue."}, {"userName": "Miranda Reads", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "[ Mostly because I'm so fed up with the whole Government-secretly-knew-everything-and-manipulated-every-single-string-to-bring-this-about\" (hide spoiler)]"}, {"userName": "Charlotte May", "userReviewDate": "Mar 17, 2016", "userURL": "http://www.goodreads.com/user/show/14002983-charlotte-may", "userReview": "“How could anyone be evil enough to do this to us?” Just as awesome the second time round!Thomas wakes up in the Glade with no memory of who he is or his past. He is surrounded by boys all just like him, no idea why they are there, some have been there as long as 2 years. They all keep the Glade running, they grow food, raise livestock and perhaps the most important job - the runners. The runners go out everyday exploring the giant maze surrounding the Glade, attempting to find an escape. Every night the doors close, and no one can get into the maze, or back out! When another Glader arrives, Teresa - the first girl Glader, things go from bad to worse. Eventually they have to decide what to do. It was so exciting to watch everything unfold, with the terrifying grievers that live in the maze! To see all the secrets and answers come out. I also really liked the ‘glader slang’ the characters used, I thought it was imaginative and at times pretty funny! Onto book 2!"}, {"userName": "Brian Yahn", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/22849115-brian-yahn", "userReview": "The Maze Runner is a masterfully plotted mystery. It's intriguing. It draws you in quick and then reveals details at just the right time to keep you turning the pages for more.While many criticize the characters for being flat, which they are, Thomas and his fellow Maze Runners are at the very least likable. They play pranks, they crack jokes, they bond in inventive ways, and most importantly they're just fun in general. You can't help but like characters that are trapped in an almost literal Hell and somehow make the most of it to the point you secretly wish you were part of it. There's something magical in that.A story can only go so far with characters that don't really have any meaningful connection to the plot or the setting, though. Any of these guys could've been replaced for any other personality with barely any notice. I think James Dashner really squeezed the best possible plot he could out of the characters he created.The real pitfall of The Maze Runner is the writing. As Dashner might write, It's really, really bad. So bad, it leaves you feeling nothing in a lot of scenes you should feel loss or adrenaline or relief or... anything."}, {"userName": "May", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/20416955-may", "userReview": "OMG OMG OMG OMG OMG OOOOOOOH MY GOOOOOOOOOOOD QUIERO MÁS. DIOS. INCREÍBLE. ADICTIVA. AAAHDEBRFTHNJ. DASHNER CÁSATE CONMIGO. O MEJOR, THOMAS.El corredor del laberinto es la primera parte de la tetralogía que lleva el mismo nombre. Es una novela cuya película salió el año pasado y que vi antes de leer el libro. Ahora que he leído el libro puedo decir que estoy fascinada con el mundo que ha creado el autor y que nadie puede morir sin leerlo.Como comentaba, lo más fascinante de la saga es la ambientación y el mundo que crea el autor. Sin duda la idea del laberinto no es nada original, pero sí el claro que hay en medio y la trama que se desarrolla en él. Además de los monstruos, laceradores, que crea el autor y con los que juega todo el tiempo.La trama de la novela es muy buena. Es original, tiene giros y un desenlace inesperado y que deja con muchas ganas de más. Me gusta la línea argumental que sigue el autor y también cómo entrelaza a los diferentes personajes con la trama. Me gustó mucho la idea general y todo el desarrollo que hay en la novela.Los personajes también me encantaron. Todos los personajes masculinos tienen una buena profundidad y los protagonistas son fantásticos. Me gusta que cada uno tenga una caracterización diferente y que tengan algunos giros inesperados.El único personaje que no me ha convencido para nada es Teresa porque es demasiado plano. Parece jugar un papel demasiado importante casi al final y siendo, según la trama, un personaje clave debería haber tenido una mayor profundidad y en sí desarrollo, porque es planísimo.El corredor del laberinto es una novela ya muy famosa y de la que queda poco por decir, quien no la conozca es porque vive debajo de una piedra. Tenía unas altísimas expectativas por esto mismo y las ha superado, algo poco habitual. El ritmo es frenético, es una novela adictiva que se bebe rápidamente. Tiene una buena densidad que podría hacer de esta novela algo pesado y difícil de leer, pero sin duda el autor tiene una pluma ágil y sabe enganchar al lector.En resumen, El corredor del laberinto ha sido una novela que me ha encantado, que me ha dejado con ganas de más y que recomiendo a cualquier tipo de lector porque merece muchísimo la pena."}, {"userName": "Kate ♡", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/15154637-kate", "userReview": "It's 1am, just finished this and it was aMAZEing, see what I did there ;)Review to come!!Review (more like gush):Where do I even start this review...Okay, so, The Maze Runner is absolutely incredible! I loved it so much!This book instantly sucked me in, when I really just got it off my shelf to look at it! Haha, I had always been a bit hesitant to read this book, because I didn't think I'd like it much... Boy, was I wrong. I even broke a book-lover rule and saw the movie first, because I was never actually sure if I'd read this! Yet, I still enjoyed the book so much, even though I knew what was going to happen! (Makes me so excited for book 2, because I don't know what's gonna happen)Reading this made me feel like it was Christmas morning, all jittery and happy. It gave me nostalgic feels even though I'd never read it before... maybe I felt a bit like I did while reading the hunger games... Idk, it's hard to place.This book caused me severe lack of sleep, not even just by reading late into the night, but also because when I wasn't reading, I was thinking or dreaming about this book! I even read it at every break I got on my biology excursion! I've never said 'just one more chapter' more in my entire reading life! Which I think is fair to say I'm pretty obsessed with it!I'm SO happy that I loved this book the way I did, because it's been soo long since I've completely and utterly enjoyed a book! Go read this if you haven't already!Might go read Scorch Trials now... See ya Goodreads people <3"}, {"userName": "Ellie ", "userReviewDate": "Sep 23, 2011", "userURL": "http://www.goodreads.com/user/show/4827159-ellie", "userReview": "3.5Well. There was....well, first of all, I have to get a cup of water because I have a major headache.*Goes to get cup of water**Returns*Aah. Much better. Okay, first second of all, my friend recommended this book. So I requested it, and (foolish me) left it lying on the table where I do my homework, in plain sight of my parents. Oops. So THEN my dad says, at dinner:\"Oh, Ellie, by the way--I borrowed that book of yours, Runner? Or something?\"*gulps nervously* \"The Maze Runner?\"\"Yeah, that's it.\"\"Oh. Um. Howw...are you liking it?\"\"Well, it's keeping me turning the pages.\"And I was freaking all about this to my friend. Lucky me, there isn't any sex or even kissing. ;D And even if there IS in the second one, it won't matter, because this was his comment to me a week or so later:\"Oh, Ellie, I finished The Maze Runner, by the way.\" (He says \"by the way\" a lot.)\"Oh? How was it?\"\"It was....grim, gritty, cheerless, joyless, unrelentingly....unrelentingly dark.,\" he said in a leaden, hopeless tone. (Yes, he actually said that.)So there is pretty much ZIP chance of him reading #2. :D Hoorah! Seeing my dad reading fantasy was just too weird.On another note, I liked it. Except Teresa, who, from her description, reminds me of a vampire. And the fact that my friend, who read it first, claimed Minho. Harumph."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "[What's the catastrophe? Why would the Powers that Be think a bunch of teenagers, however smart, can solve it?  (hide spoiler)]"}, {"userName": "Neal Shusterman", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/5092518-neal-shusterman", "userReview": "I enjoyed the Maze Runner, but not as much as I wanted to. It was a great concept, and the story was compelling, the characters and plot twists interesting, and there was no limit to Dashner’s creativity. My big problem was that the characters were manipulated by the story, and not the other way around. There were so many times when the characters would have figured things out. They’re supposed to be brilliant kids, and yet they are continually clueless about things that are pretty obvious to the reader. And it’s not like the reader has information they don’t. The only reason the characters don’t figure things out is because the author doesn’t want them to. I think Dashner should have trusted his characters a little more, and let the story flow from them, rather than letting them be constrained by the plot he wanted to maintain."}, {"userName": "mark monday", "userReviewDate": "Jan 20, 2014", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "[oblique spoilers ahead]A is for Apocalypse!  A modern craze; a timeless fantasy. What shall bring us to this place? Can there be life after such an event? And if so… what kind of life would that be?B is for Banzai!  “Banzai” is a traditional Japanese exclamation meaning “ten thousand years”. A Banzai charge is a last, desperate charge. C is for Cube!  “Cube” is a 1997 film by Vincenzo Natali. The characters in this film are trapped in a kind of maze, and must pass from one cube-shaped room to another. The characters do not know why they are in this place. They must escape or die.D is for Despair!  As Thomas Jefferson once said: “My theory has always been, that if we are to dream, the flatteries of hope are as cheap, and pleasanter, than the gloom of despair.” E is for ESP!  Extrasensory Perception involves reception of information not gained through the recognized physical senses but sensed with the mind. ESP includes TELEPATHY!F is for Flare!  A solar flare is a sudden brightening observed over the Sun's surface, which is interpreted as a large energy release of up to 6 × 1025 joules of energy.G is for Goethe!  Johann Wolfgang von Goethe was a German writer and politician. He believed that “in the totality everything redeems itself and appears good and justified” … but do the means justify the ends when it comes to reaching that redemption? A timeless question!H is for Hybrid!  A cross between a giant slug and a killing machine equipped with pincers & needles would be considered a sort of hybrid. Machine-animal hybrids often appear within genres such as science fantasy, steampunk, and the post-apocalyptic young adult adventure novel. I is for IQ!  The Intelligence Quotient is a score derived from standardized testing in order to assess intelligence. Some have questioned its use… J is for Janissary!  As children, the Janissaries were taken from their parents to become elite soldiers in the Ottoman Empire. They revolted against their masters during the “Auspicious Incident” of 1826.K is for Killing Zone!  Strictly speaking, there is no actual “kill zone” in The Maze Runner. But the phrase just really fits.L is for Lord of the Flies!  A bunch of boys stranded in a dangerous environment! They revert into savages! Murder and Mayhem and Malice, Oh My! But why was it so hard for them to maintain their own sort of society, to stay civilized? They should have consulted the lads of The Maze Runner!M is for Maze Runner! see A-L & N-Z.N is for No Exit! “No Exit” is an existentialist play by Jean-Paul Sartre. The play is about three deceased characters who are punished by being locked into a room together for eternity. Hell is other people!O is for Ouroboros!  It goes around & around & around!\nP is for Pandemic!  A pandemic is an epidemic of infectious disease that has spread through human populations across a large region; for instance multiple continents, or even worldwide.Q is for Quotient!  In mathematics, a quotient is the result of division.R is for Runner!  “The Runner” is a song by Ian Thomas, covered in 1984 by Manfred Mann’s Earth Band.S is for Survivor!  “Survivor” is a ‘reality’ game show created by Mark Burnett. Contestants attempt to outwit, outplay, and outlast each other; the key goal is to not be voted out. Last person standing wins.T is for Tenacity!  I would say that running around in the same maze for two years is pretty damned tenacious.U is for Unanswered Questions!  Some readers felt frustration or anger at the end of The Maze Runner – too many questions left unanswered, too abrupt of a cliffhanger. I felt quite a bit of frustration as well, but for the opposite reason: I would have appreciated less questions answered, more ambiguity. I wanted less of a plunge into a rather typical post-apocalyptic adventure and more running about in a maze for reasons unknown. Although I did enjoy the actual cliffhanger.V is for Vendetta!  The characters in The Maze Runner use the idea of Vendetta to fight back, to inspire themselves, to fling themselves into the unknown. “V for Vendetta” is a graphic novel by Alan Moore. The movie adaptation of that comic contains this quote: “There are no coincidences, only the illusion of coincidences” … which of course is an approximation of Albert Einstein’s quote: “God does not play dice with the universe” … indeed! But who is this “God” in Maze Runner's universe? W is for Waiting for Godot!  “Waiting for Godot” is a play by Samuel Beckett in which two characters wait in vain for a person named Godot. The characters wait for answers that never appear. Beckett, describing his creation: “It is a game, everything is a game”… the game of life?X is for Xbox!  The Xbox and its various successors are video game consoles. I trust you can connect the dots here.Y is for Young Adult!  I think that many of our classic and modern young adult stories together form the fables of our times. A handful of narratives that are repeated and reshaped, told through hundreds - thousands? - of different books and read by millions of readers. Their prose is usually transparent and their meanings overt. The reader and the protagonist are given clear lessons to learn. But the reader may, in turn, choose to project their own meanings onto these archetypical stories.Z is for Zarathustra! “Thus Spoke Zarathustra” is a philosophical novel by Friedrich Nietzsche. It deals with ideas such as ‘the eternal recurrence of the same’ and the Übermensch, or Overman – a goal in which human life would be given meaning by how it advanced a new generation of humans.* 12 letters taken directly from my best friend Wikipedia. thanks, pal! I truly do love you. *"}, {"userName": "Whitley Birks", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/5193512-whitley-birks", "userReview": "See the chapter x chapter breakdown on my blogAs if the simplistic and \"tell-y\" writing in this book weren't bad enough, we also have to content with some truly atrocious pacing, inconsistent characterization, logic gaps out the wazoo, a Gary Stu of a main character, and an ending that kicks this book up into whole new levels of WTFery.The majority of this book is people jealously withholding information that gets revealed a few chapters later, which makes it painfully obvious that all the not-telling going on is just for the sake of dragging things out. The \"puzzle\" of the maze should have been solved in the first week (or at least, parts of it should), the \"monsters\" were so easy to beat that I'm still confused as to why the boys didn't kill them all sooner, and Thomas got way too much praise for merely existing. The rest of the cast had to be dumbed down to some truly paint-eating levels in order to make him look good, but the book went ahead and did that. (At one point, Thomas was actually praised for his \"brilliant\" tactic for getting around the monsters, which consisted of \"fake right, dodge left.\" Toddlers can figure that one out.)And I really have no words for that ending except: no one involved in this project should be allowed anywhere near an environmental debate. Clearly, too many lessons facts about how the planet works need to be re-taught first.To cap off the fail-cake that is this book, we also got the lovely message of \"if anyone disagrees with you and gets angry about it, call them insane. Once they're declared insane, it's perfectly okay to ignore every single thing they say, because as we all know, insane people cannot ever say a true thing; they just spout off nonsense 24/7 are are good for absolutely nothing.\""}, {"userName": "Forrest", "userReviewDate": "Nov 13, 2012", "userURL": "http://www.goodreads.com/user/show/811928-forrest", "userReview": "[memory trick (hide spoiler)]"}, {"userName": "Ariel", "userReviewDate": "Jan 03, 2012", "userURL": "http://www.goodreads.com/user/show/6536286-ariel", "userReview": "My experience with this book turned out to be a unique one: for most of the book I was thinking that it had some redeeming ideas but that it just wasn't good enough, but the last third really turned everything around. Let's discuss.I bought this book over a year ago because of the Dystopia craze.. having read so much dystopia though, I wasn't able to pick it up. It's been a while though, and I picked it up at a time where I was excited for it which turned out for the best.I was first stricken with how fascinating the whole world concept for this books is: it's very reminiscent of The Lord of the Flies in that you have a bunch of kids desperate for life but not knowing what to do. I've always enjoyed reading and thinking about how bodies of people govern themselves, and this made an interesting study. Also, of course!, you have this epic arena: a huge maze infested with giant lizard-robot creatures and no seeming escape, it's great! But here lies my problem with this book: you understand the world within the first few pages, you pretty much understand what's going on. Therefore, I expected \"Okay, I get it! Cool.. what's going to be the plot in this interesting setting?\" .. and you don't find out for 300 pages. SERIOUSLY! Most of this book is the main character, Thomas, asking questions and NEVER getting answers. It was infuriating! I felt all this potential for the story, it honestly has such an exciting prospect, but then you learn nothing further about the world and the plot goes nowhere. A couple of people have told me that this was all necessary information needed for the sequels, and I completely disagree. It's always good to set an over arching idea with details for a series, but that shouldn't take up over 2/3rds of this book! I will not budge on my feelings that this book had a lot of wasted time merely standing around the Glade that should have been cut out to make the story an actual story: I want plot, something to follow!However, and this is where I was so happily surprised, the last hundred or so pages of this book WERE exactly what I wanted (expected). They were completely action packed, very suspenseful, and absolutely thrilling to read. I at first wondered if it would be \"too little, too late\" but my final verdict is no.. it was so very exciting that although it was close to not being good enough, it definitely brought the whole book up for me. The writing in this book was overall enjoyable: one thing I HAVE to praise is the descriptions... they were never too lengthy or distracting and they always left a clear image in my mind. A lot of the time when action scenes are described in books I'm really confused as to who is kicking who/where someone is running/what is attacking them but this writing really nailed good description. However, I do have to point to the lack of suspensefulness: I could feel that the James Dashner wanted things for the first 2/3rds of this book to feel suspenseful, but instead they felt slow, dragged out, and actually kind of annoying. Overall, it was a tough read for most of the way through, but the ending portion really made up for it. I DEFINITELY want to read the next book, The Scorch Trials, and look forward to seeing where this story progresses.. I'm scared that the slow world building won't be eradicated though because we are completely changing arena's, but we will see! I have my fingers crossed! At least I know to push through the slowness because I'll probably have an exciting ending waiting for me!Note on the epilogue: IT WAS PERFECTION. I really appreciate when an author ties of a book well, especially when it's part of a series: I don't want to be left completely hanging having no closure at the end of a book. This book did sum up really well though, it had a conclusion, this chapter ended. The epilogue gave the perfect twist though, absolutely unexpected and brilliant."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Okay so I saw the movie when it came to dvd and I loved it, but here is the faces I got when I said I hadn't read the book yet ↓I know right? I loved the book. I will say I watched the second movie and didn't like it but I'm going to keep on with the books and see. Welcome To The Maze! Imagine, if you will, you wake up in some elevator thing and you have no idea what is going on or your past. You just end up in some place with a bunch of dudes that are calling you greenie until the next person comes up out of the ground. This is how Thomas came into this world. It would suck arse! But Thomas keeps getting vague thoughts and memories of people places and things. Not memories per se, more like feelings that he has been there before. I loved so many of these boys and Teresa when she gets there. <--- part of that sentence didn't sound right, but I digress. There seems to be one main jerk of the group and his name is Gally. He tries to cause a lot of trouble for Thomas and he does do something I will never forgive him for in the end. I will cut him down! Anyway, so they have this little farming structure set up. Everyone has jobs like the crop keeper, or the cook, or the butcher, or runner and etc and so on. At one point they bumped Thomas up as a runner because he saved some peeps and stuff. But you know I can tell you that I would be changing my mind after dealing with all of the crazy stuff in the maze. You have to run through and try to find new ways to get out and not get eaten. Here are two examples why I would not want to be a runner. ↓But you have to do what you have to do I guess. And then some bad stuff happens and the whole group have to get out. Get out now! Some more good and bad stuff happen and they end up finding the CREATORS, or JERKS in my opinion, and they are taken off to go on another mission of sorts. Either way this book and movie was so amazing. Even if I don't like the rest of the series, I will always have THE MAZE RUNNER ♥MY BLOG: Melissa Martin's Reading List"}, {"userName": "Rusty Grey", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/69472742-rusty-grey", "userReview": "4.5 stars BECAUSE IT ALL STARTED DUE TO THIS ONE . I was never much of a reader as a child . The thought of wasting my precious free time , by reading a book , which I may or may not like , was simply appalling for my childish mind. And while I was in middle grade I was pretty busy with cricket and football. So I never even gave a thought to reading till a friend suggested me 'The Maze Runner' in 9th grade. I am really glad he did.  Yeah . This will always be my first read. And I loved it . A guy with no memory of his past , who is sent in a prisonesque glade, which is surrounded by a maze, to live with a group of teenagers . How could I not love that ? Dashner's novel has almost all the essential elements of a brilliant young adult novel . It has an interesting protagonist like, our Thomas . Then the supporting characters are important (especially Newt , Chuck and Minho) . There are some cute , vicious monsters (like grievers). A good dystopia theory. Some fast paced writing and adventure . Everything in this novel is remarkable . And only because of it did I start reading other novels (especially YA and dystopia)."}, {"userName": "Clau R.", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/13061577-clau-r", "userReview": "WHAT DID JUST--- OMG."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "I don't say this often, but I actually liked the movie waaaay more. The plots are pretty similar!If I hadn't seen the movie, I don't think I would've had a strong sense of the characters or connected to very much in the book. The premise is interesting, but the movie pulls you in way more. This book was a really fast read, though! I was surprised at how quickly events were happening... like \"oh wow we're at that part of the story already?!\" Basically, I went into this without a ton of expectations but still ended up being underwhelmed. The writing + plot are kind of simplistic and hinge on withholding all the answers, so maybe seeing the movie first ruined it for me."}], "description": "There are alternate cover editions for this ASIN here and here.If you ain’t scared, you ain’t human.When Thomas wakes up in the lift, the only thing he can remember is his name. He’s surrounded by strangers—boys whose memories are also gone.Nice to meet ya, shank. Welcome to the Glade.Outside the towering stone walls that surround the Glade is a limitless, ever-changing maze. It’s the only way out—and no one’s ever made it through alive.Everything is going to change.Then a girl arrives. The first girl ever. And the message she delivers is terrifying.Remember. Survive. Run.", "title": "The Maze Runner\n      \n          (The Maze Runner #1)", "url": "http://www.goodreads.com/book/show/6186357-the-maze-runner", "average": 4.03, "cover": "https://images.gr-assets.com/books/1375596592l/6186357.jpg", "reviews": 51576, "authors": [{"url": "https://www.goodreads.com/author/show/348878.James_Dashner", "name": "James Dashner"}], "type": ["Young Adult", "Science Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/6186357-the-maze-runner", "http://www.goodreads.com/book/show/7002714-the-maze-runner", "http://www.goodreads.com/book/show/7001102-the-maze-runner", "http://www.goodreads.com/book/show/7805064-the-maze-runner", "http://www.goodreads.com/book/show/20957276-the-maze-runner", "http://www.goodreads.com/book/show/23302190-el-corredor-del-laberinto", "http://www.goodreads.com/book/show/7631105-the-scorch-trials", "http://www.goodreads.com/book/show/7864437-the-death-cure", "http://www.goodreads.com/book/show/13089710-the-kill-order", "http://www.goodreads.com/book/show/16279856-the-eye-of-minds", "http://www.goodreads.com/book/show/23267628-the-fever-code"]}