{"ratings": 1001, "userreviews": [{"userName": "Greg", "userReviewDate": "Jun 08, 2010", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "Memory and what might be better forgotten. So, today, 7/11/2010, I unintentionally wound up walking past the tourist trap known as the World Trade Center site, aka Ground Zero, aka whatever it is called. Roughly it had been 8 years, 10 months and five and a half hours, give or take some minutes since I last happened to be in the neighborhood. My first response to realizing we (that would be Karen and I) would be getting to see that spot was annoyance. As in, what the fuck, I wasn't expecting this today (and I wasn't, stupid me didn't put two and two together and realize that the Fulton St. subway stop was the same stop that I used to take to that area, under a slightly different name). Annoyance shifted to wonderment, as in where the fuck are we exactly? And even though we passed the old church and shit it wasn't until we were near Century 21 that I realized oh, shit we aren't just at Ground Zero, we just passed over the spot where I stood and thought really fucked up things and saw some equally fucked up things that left me sort of feeling all fucked up. I sort of pointed this out to Karen in a very inarticulate way, because I don't talk well about this, rather I talk around it. And even as I told her this, and I realized exactly where I was and looked around nothing felt right about the spot. Nothing was as I remembered it. I'm not just talking a few buildings missing, because obviously those were gone, but lots of other details seemed missing, or changed. My memory really only being orientated by the location of a department store. I trust that my memory is relatively accurate of a) that neighborhood as I was aware of it 8 years ago and b) my experiences of that day. The details of the present space and the space in my subjective experience of it are not the same though. I don't know how much of that is change that happened in the actual physicality, change due to differences of perception (the area seemed more open, lighter, airier, but could that just be the absence of those grotesque and decaying monoliths?), or the ways memory is not to be trusted. Is what I remember an edited version, a directors cut that never was aired in theaters and is different from anything anyone will see until the DVD release?In another act of what humans are capable of doing to one another, throughout much of the 1990's the people who used to live in the country once known as Yugoslavia went a little nutso and started to do some horrific and barbaric shit to one another. Raping and killing and death camps and snipers and all kinds of awful things among people who one would call 'civilized' Europeans. Our collective disgust at what happened here is fairly low, even at the time it was happening we didn't show too much concern or interest in it all. And when we started to bomb them in the late 90's at a time when Clinton just happened to be having some PR problems very few people paid any attention that we were bombing some people and blowing up things like hospitals all because our President was having allegation (x) dropped on him (Fuck that Wag the Dog apologetics bullshit, that since it was a movie our President would never actually blow some shit up just to get his ass out of hot-water. He seemed to rev up the bombers all the time when his personal life threatened to mess with his power... in a perfect world he would hang at Hague for these misuses of power, along with the Bushes, and our current War-Criminal in Chief. Wheeee, the typical Yugoslavia rant from me). Anyway, this time in our collective history is a bleak one if you want to look at the way civilized people can treat one another. At the time a popular explanation for it all was the remnants of ancient tribalism, left-over pre-history bullshit that has no place in our clean and shiny Fukayama post-history time. This is an explanation that turns the whole country and it's problems into a capital oh, Other; sort of in the same way that the whole Africa / Darfur 'murdering asshole problems' can be safely cognitively treated in a similar vein (with 75% Dissonance! ). What treating these 'aberrations' as pre-history / tribal-esque problems does is make it something foreign to ourselves. It lets you and I, and yes even you over there, not have to face the awful fact that we may all be potential state-sanctioned mass-murders, SS guards in waiting, that with the right little push we'd kick in our neighbors door and gang-rape their 10 year old daughter, then the mother, torture the son to death and then castrate the father. But if we can make the people who end up doing things like this so different from us that we (as a people) can never let that happen (again), then, well, that is comforting. In my stupid opinion, the events of the former Yugoslavia are much more of a global tragedy than 9/11; but 9/11 has since put on the mask of a grand global tragedy of nightmarish consequences in the form xenophobia and irrationality, while any lessons of Sarajevo have had dirt kicked over them like cat shit in a litter box. Anyway this novel deals with the aftermath of the events that destroyed a country and dispersed its people. The author was one of the people who had to leave, went into an exile and became a person without a homeland. Her novel is about confronting the memories of a place before a tragedy, and a tragedy itself. It's about confronting people who don't want to remember, and those who remember too much. Dubravka Ugrešić is a great and cynical writer. And I wholeheartedly recommend reading her, although I might recommend you start with Thank You for Not Reading."}, {"userName": "Orsodimondo", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "UNO SCHIAFFO INVISIBILE SULLA FACCIAMi sarebbe piaciuto che Tanja, l’io narrante di questo romanzo, raccontasse ancora più a fondo i suoi studenti, gente con uno schiaffo invisibile sulla faccia, come lei fuggiti dalla Jugoslavia durante i conflitti degli anni Novanta: ma Tanja non poteva farlo, perché una volta scappata all’estero, una volta approdata ad Amsterdam, mentre il suo paese si disfaceva e smembrava e massacrava, Tanja imparava a fondo la lingua della solitudine.Nel suo paese il pane si chiamava in tre modi diversi: kruh in croato, hleb in serbo e  hljeb in bosniaco. Ma per la morte, si mettevano tutti d’accordo e usavano un unico termine, smrt.E mentre nel suo paese il suicidio era un lusso, le persone si ammazzavano per le umiliazioni, la disperazione, la paura, la solitudine, la vergogna. Erano tutte morti silenziose e senza nome, vittime di guerra che nessuno considerava né vittime, né di guerra. E mentre da un paese ne nascevano tanti, i nuovi governi volevano costringere gli uomini a perdere la memoria. Da profuga, all’estero, Tanja conserva se non altro, il diritto inalienabile di ricordare. Anche se andandosene non si cambia solo il luogo, ma pure il tempo, quello interiore. Il tempo che non cura le ferite, ma le procura. Anche se la gente non è fatta per le disgrazie. Le persone non sono in grado di identificarsi con le catastrofi di massa. Semplicemente non possono restare legate stabilmente alla sfortuna. Neppure alla propria… Non esistono la pietà né il cordoglio, si può solo dimenticare. E solo l’umiliazione e il dolore sono fonte di lungo ricordo.L’epilogo non è consolatorio, non arriva a interrompere il flusso di angoscia: è piuttosto l’incontro di due solitudine che, forse per una volta, riescono a comporne una più piccola, invece di una doppia.Dubravka Ugrešić narra lo sradicamento, e procedendo per racconti e aneddoti, sogni e divagazioni, porta a casa un gran bell’esordio letterario, una lettura che avvolge e coinvolge."}, {"userName": "Aubrey", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "I have never been in danger of losing my heritage. The US existed long before I was born, and will in all likelihood still be standing long after I'm gone. English is not going to split itself up into a hydra construction anytime soon, barring a disturbance of apocalyptic magnitude. And even if this language chimera did phase into being, there's little chance of the different strains hating each other to the point of genocide. I take this intrinsic stability for granted. You'd be hard pressed to find a citizen of the US who doesn't.For all those who share my sentiments, and cannot comprehend in the slightest what it means to have your native country pulled from under your feet, your language dismembered into warring partisans, and your people spread to the farthest corners of the globe. This book is for you. Well, if you have an interest in that kind of thing, that is.The book does a very good job of plunging you into a world without absolutes, reflecting the mindset of one of the many refugees from the recently disintegrated Yugoslavia. There's so much confusion regarding language, memory, past, present, all slickly pulling and pushing together like so many snails on the streets of Amsterdam. It's a fantastic read, and does an excellent job of immersing you in the uneasy existence of one ripped away from all that one knows. You may find yourself taking lots of breaks between pages, though, as it's easy to feel increasingly disturbed by the toy comparisons and saliva metaphors that the author loves to use. Disturbing or not, if I had just come to a new country after the destruction of my homeland, I'd definitely be extremely off balance in my current reality. Distrust of reality, as well as nausea, are givens."}, {"userName": "Nathan \"N.R.\" Gaddis", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/7607437-nathan-n-r-gaddis", "userReview": "This Review must be prefaced with an apology. Perhaps a warning for uncharacteristic negativity. Please, excuse this.The Ministry of Pain is one of the worst books I’ve read since joining goodreads. What makes this situation especially difficult/painful/unfortunate is that it came with a very sturdy recommendation from the tripod of MJ-Jonathan-Aubrey. Please don’t cease the recommendations on account of this Review.In short, I found myself constantly groaning and sighing ; lucky that there were few people in the vicinity to witness that kind of behavior which is the extreme opposite of lol. What I mean is the sheer quantity of cliche, clunk, and groan. Scarcely a page went by without some miserable simile, some tired overworked phrase. Nary a reflective passage, what some reviewers call “philosophical musings”, passed by that wasn’t of the, Oh please! variety. Chains and chains of cliche. It reads as what I imagine a Paulo Coelho novel must read ; and that is harsh.I did attempt to find some device, some strategy, which would justify the cliche-ridden prose ; some kind of metafictional thing like what’s made famous in Mulligan Stew, but I found none. Certainly, the novel is framed by the experience of having lost one’s language ; but losing one’s language is to lose the resources of cliche. Cliche is the very heart of having a common language. Blame the translation? Fine. But that’s what we have for to read.Look. If it is said, But this really happened, I’d say, That is the death knell of fiction. And I’d further say that this émigré experience deserves better fiction. I’ve been there. I was there. Mine is a question of fiction. The difference between a diary published as a diary and a diary published as a novel is the difference of the “as” in “as a diary” and “as a novel”, a distance much greater than the two letter “as” might at first suggest. What is missing in this novel is that variety of truth which can only be structured by fiction, the kind of truth which surpasses the trivial truth of, It really happened. Is there a second Ugrešić in my future? No, probably not. I do, however, happen to have another Croatian book on my shelf, The Taste of a Man by Slavenka Drakulić (accompanied with a Hawkes blurb ), which will serve in its stead."}, {"userName": "zahra haji", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/34844269-zahra-haji", "userReview": "في موطن الألم تسلط الكاتبة الضوء على نتائج الحرب الكارثية في يوغسلافية والتي أدت لتفككها لدول وقوميات عديدة ولغات عدة حتى زوال الاتحاد اليوغسلافي نهائيا عام 2006وتتناول الرواية تداعيات ما بعد الحرب وصعوبات العيش والتأقلم في الوطن البديلوبين الاندماج وبين الحنين للوطن وهاجس العودة يجابه أبطال الروايةفي هولندا العديد من الصعوبات الرواية تحمل ملامح من سيرة الكاتبة نفسها والتي لجأت لهولندا .. وجدتها رواية ضبابية كحال الوطن الذي نغادره مكرهين ليتلاشى تدريجيا من ذاكرتنا وإن عدنا إليه نجده محاطا بهالة من الضباب تحجب عنا رؤيته بحلته القديمةتتغير أسماء الشوارع تتغير الوجوه تتنكر لنا ذكرياتنا يتنكر لنا الوطن ونتنكر لهوباردة كصقيع المنفى الذي يستوطن قلوب اللاجئين مدى الحياة وسوداوية كنظرة جميع من فقدوا أوطانهم و فقدهم الوطن"}, {"userName": "MJ Nicholls", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "A profoundly intelligent take on Serb/Croatian emigré life following the death of Yugoslav Prime Minister Josip Toto. Tanja is a teacher living in Amsterdam responsible for a Croatian literature programme, who realises her students are much more interesting than her topic. Very fresh, witty and moving."}, {"userName": "Nathan \"N.R.\" Gaddis", "userReviewDate": "Sep 26, 2014", "userURL": "http://www.goodreads.com/user/show/7607437-nathan-n-r-gaddis", "userReview": "I reread this because I was incredulous about my negative response to it. I've had middling responses to a few books otherwise highly regarded by my fellow readers so I know what that's like ; but I've never found a book so simply bad which others regard at least as competent. But, no, now I'm just incredulous about how bad this book is. Again I started groaning as soon as the cliched simile=dropping started in. But I take little pleasure in ripping a book yet another one. So I'll head off my incredulity here. Give Ugrešić another book-chance? Maybe, or at least I was beginning to soften on that front. I'm still a little incredulous about this one. To end on a positive note, there are perhaps several Croatian composers of note ::http://en.wikipedia.org/wiki/List_of_...Today I'm listening to one of their more prolific composers, Boris Papandopulo::Sinfonietta za gudačehttps://www.youtube.com/watch?v=rKInM...or, Concerto for Xylophone and String Orchestra https://www.youtube.com/watch?v=FSOgH..."}, {"userName": "Galina", "userReviewDate": "Dec 28, 2012", "userURL": "http://www.goodreads.com/user/show/7212144-galina", "userReview": "Проблемът с напускането на родното място е сякаш изначален. Разглеждан е и описван от всевъзможни ъгли, но един от онези, най-ярко врязали се в съзнанието ми, е безкрайно интересната теория на Проп за морфологията на вълшебните приказки. Каква връзка има изследването на руския фолклорист от далечната 1928 година с романа на Дубравка Угрешич, който напомня за една толкова съвременна и близка, в чисто географски аспект, история? На пръв поглед общо няма. От друга страна обаче, традиционно ни учат как човекът е сигурен единствено в дома си, там, където се намира неговият сакрален център. Всичко извън защитената зона е профанна периферия и тя по презумпция е пълна с множество перипетии и антигерои, целящи да отдалечат човека от неговата същност, от опитите му за завръщане. Традициите обаче не помагат дори с хипопетични ситуации и мълчат по въпроса - как трябва да се постъпи, щом домът и сакралното изгубят своята функция и самите те започнат да притежават белезите на профанното. А Угрешич поставя героите си на възможно най-неблагоприятния разклон: на онзи кръстопът, който пресича невъзможността за завръщане вкъщи и неспособността човек истински да си тръгне. И с това пише една съвремена приказка - трудна за приемане и преглъщане, в която границите между правилно и грешно на места са напълно размити.Мислим си, че знаем какво е войната, защото се случи до нас, чувахме, бяхме съпричестни, страхувахме се, че е прекалено близо до къщата ни. Едновременно с това обаче, нямаме и представа как свикваш да съществуваш извън пределите на всичко, с което си израстнал. \"Министерство на болката\" е роман за това какво значи да помниш. И формулата е ясна и точна: да помниш = да те има. Спомените се онези толкова необходими белези, индикиращи пред света, че си жив, че си роден, че имаш право на минало, детство, любови, имаш право да бъдеш човек, пък макар и в минало време. Имаш право дори да си измисляш спомени, за да оцветиш онова късче от време, което не е сега и което никога не е било. Но което е само твое и едновременно с това е колективно притежание.Има една теория, която открих, четейки \"Всичко свое нося със себе си\" на Херта Мюлер, макар че нейният роман е написан няколко години след този на Угрешич (просто на мен ми попаднаха в този ред) - идеята, че щом човекът насилствено напусне мястото, към което принадлежи, то в бъдеще се оказва, че никъде няма място за него. Тъжна и разрушителна теория, която - боя се - не разчита единствено на художествени интерпретации.Хората, разкъсани между дома, който вече не е техен и настоящето си, често се разпадат на малки частици. По същия начин, по който бившата им родина, вече нефигурираща върху картата, е разбита. И от това боли точно толкова, колкото от разпада на кое да е семейство, в което всеки поема по своя самотен път, обвинявайки до вчера най-близките си.Вълшебната приказка предполага героят да се върне вкъщи - след тежко и изморително скитане, след като е скъсал седем чифта обувки, отрязал е три змейски глави, измъкнал се е от къщата на Баба Яга и на финала вече е смел и прочут мъж, а не Иванушка Глупака, треперещ пред тъмната гора. В действителността на Угрешич, героите завършват с куршум в главата, с примирен втори брак, с подземна квартира, със забравени мечти, с отдалечени родители, ако въобще има къде да се върнат назад, то там се чувстват \"като на собственото си погребение\". Сакралното не съществува дори като понятие, защото свят, позволяващ разрушението на войната да бъде истина, няма нужда от приказки. А от жертви."}, {"userName": "Ronald Morton", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/35853560-ronald-morton", "userReview": "I was naturally well aware of the absurdity of my situation: I was to teach a subject that officially no longer existed. What we once called jugoslavistika at the university—that is, Slovenian, Croatian, Bosnian, Serbian, Montenegrin, and Macedonian literature—had disappeared as a discipline together with its country of origin. Besides, the students I was assigned had no particular interest in literature; they were interested in their Dutch papers. I was hired to teach the literature of a country (or the literatures of countries) from which my students had fled or been expelled. The house was in ruins, and it was my job to clear a path through the rubble. I enjoyed this a great deal, though I confess it will likely end up in a general melange of contemporary Eastern European books in my hazy memory at some point in the not so distant future. Which is less a criticism of it then it is a criticism of myself. The geography and history of Yugoslavia and the general region it occupies is mostly unknown to me - I'm truly awful with geography, and this lack of concrete understanding of the spatial arrangement of this part of the world causes a cognitive disconnect where I can't slot the pieces of history and significance in place in a meaningful way.All that said, I really enjoyed reading this book - enough so that even as it ticked past my bedtime I never had any thought but to push the rest of the way to the end. Ugresic's meditations on language throughout the book were easily my favorite parts, and thankfully it was a thread that was continuously teased at right up until the end. I don't think I've got anything else by her on the shelves, hopefully I'll come across more in my future used bookstore rambles, as I think she's worth investing more time given the opportunity."}, {"userName": "John David", "userReviewDate": "Dec 27, 2010", "userURL": "http://www.goodreads.com/user/show/4357283-john-david", "userReview": "From Mishima’s “The Sailor Who Fell from Grace with the Sea” to Kafka to “Winesburg, Ohio,” the themes of alienation and exile have pervaded world literature in the twentieth century so much as to almost become a cliché. The various political disintegrations in Europe of the 1980s and 1990s gave need to another wave of this type of literature, and is whence Dubravka Ugresic’s wonderful novel “The Ministry of Pain” comes. Reading it, I was reminded a lot of Kundera’s novels from the same time period, though Ugresic takes herself less seriously and is a much more successful ironist. While renovating an apartment she is taking in, the main character pops in a random video, and it just happens to be the film version of “The Unbearable Lightness of Being.”The novel follows Tanja Lucic after the breakup of the former Yugoslavia from Zagreb to Amsterdam to take up a position teaching language, mostly to students who (like her) have left Yugoslavia and are now living in Amsterdam waiting for their papers. Living near the red light district, the name of the novel derives from the store where many of Tanja’s students make ends meet constructing sex toys and other leather goods for sex-play. With a highly unorthodox approach to teaching, Tanja chooses to probe her students’ “Yugonostalgia” – memories of family, language, belonging, friends, and anything else that struck them as important about a place that, technically speaking, no longer exists. Tanja figures that her students’ experiences can provide an anodyne for the traumatic displacements their lives have been forced to take on. When an anonymous student reports her for not being academically rigorous enough, she is forced to engage in another teaching style (exiled from her old one?), leaving both her students and herself completely bewildered. But her teaching is really only one of the many parallel stories and musings that go on, taking the novel away from traditional, linear storytelling. Much of the novel takes place through interior monologue where she delivers poignant, sad, and sometimes witty remarks about the brokenness of language, modern culture, her thoughts about her students’ writing, and even one of their suicides.Unlike in times past when the enlightened citizen-philosopher was offered in literature as the non plus ultra in relation to the modern state, Ugresic suggests that it is the exile whose fragmentation, psychic and geographic, provides new ground for understanding the self through literature. As she puts it in “Thank You for Not Reading,” “The exile, like it or not, tests the basic concepts around which everyone's life revolves: concepts of home, homeland, family, love, friendship, profession, personal biography. Having completed the long and arduous journey of battling with the bureaucracy of the country where he has ended up, having finally acquired papers, the exile forgets the secret knowledge he has acquired on his journey, in the name of life which must go on.” After all, exile is just another form of homecoming."}, {"userName": "Antonia", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/13652123-antonia", "userReview": "Har ni hört uttrycket \"att ärva ett sår\"? Det såret, som jag har ärvt, är böckerna av Dubravka Ugrešić ett balsam för. Jag minns oron, pappas långa telefonsamtal med sin syster och annan släkt under kriget. Jag minns att jag inte förstod mycket. Jag vet inte hur kriget påverkade min faster, mina kusiner. Jag har aldrig vågat fråga. Pappa pratar sällan om det. \"Jag satt i rummet med avskalade väggar, med ett yrke som inte \"talade främmande språk\", med ett sönderfallet land bakom mig, med ett modersmål som hade delats i tre likt ett ormliknande monster med en tunga som förgrenade sig. Jag satt med något slags obeskrivlig känsla av skuld som jag hade glömt anledningen till, med något slags obeskrivlig känsla av smärta som jag hade glömt källan till.\"\"1. What was the name of the country in the south of europe that fell apart in 1991?A)Yugoslovakia; b) Yugoslavia ; c) Slovenakia.2. What was the name of the inhabitants of that country? a) Yugoslavs; b) Mungoslavs; c) Slavoyugs.3. Where do these people, whose country has disappeared, live now? a) They are no longer alive; b) They are barely alive; c)They have moved to another country. 4. What should people who have moved to another country do? a) They should integrate ; b) They should disintegrate; c) They should move to get Another country."}, {"userName": "Anaszaidan", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/4222498-anaszaidan", "userReview": "موطن الألم رواية للكاتبة الكرواتية (دوبرافكا اوجاريسك)التى تعيش فى هولندا كلاجئة بعد رفضها استقلال كرواتيا عن يوغسلافيا السابقة وبعد اندلاع الحرب عام 1991 اتخذت موقفا صلبا ضد الحرب والنزعة القومية واضطرت للهجرة وهى حاصلة على العديد من الجوائز أشهرها جائزة الدولة النمساوية فى الأدب الأوربى عام 1999 .والرواية صدرت فى سلسلة إبداعات عالمية من ترجمة وتقديم الأستاذ الدكتور محمد فرغل .وتدور حول النزوح الكبير من يوغسلافيا السابقة إلى الخارج بعد اندلاع الحروب العرقية بين مختلف مكونات الوطن من صرب وكروات وبوسنيين وغيرهم عام 1991 والتى انتهت بتفكك يوغسلافيا إلى دول مستقلة لقوميات مختلفة .يأتى السرد فى الرواية على لسان (تانيا )التى حصلت على وظيفة لمدة فصلين دراسيين لتدريس الأدب الصرب كرواتى فى جامعة امستردام – وهو محور رئيسى فى شخصية الكاتبة التى تقوم بالتدريس فى الجامعات – التى تلتقى فى الدراسة بمجموعة من الطلبة اليوغسلاف الذين التحقوا بالجامعة ليس بدافع حقيقى لدراسة هذا التخصص – الذى لم يعد موجودا أصلا، بعد تفكك الدول اليوغسلافية – ولكن من أجل إضفاء صفة الشرعية على وجودهم فى هولندا .وبدل من أن تقوم الدكتورة تانيا بتدريسهم هذا الأدب حولت الأمر إلى لعبة فى الذاكرة اليوغسلافية إذ اتخذت من أكياس بلاستيك رخيصة الثمن كانت تحمل الألوان الأزرق والأبيض والأحمر – ألوان علم يوغسلافيا- إلى متحف افتراضى وطلبت من الدارسين أن يسترجعوا من الذاكرة ما يوثق الحياة اليومية فى يوغسلافيا الأمر الذى يتحول إلى قنبله موقوته لتعدد انتماءات الطلبة العرقية من صربين وكروات وبوسنين وتاتى محاولات الطلبة لتؤرخ اليوميات اليوغسلافية بحلوها ومرها .ويمتد محاولات إملاء تلك الأكياس بالذكريات إلى خارج المدرج لتصل الى المقاهى مابين سخرية وبكاء نكتشف خفايا تلك البلد التى لم تعد موجودة .وينتهى الفصل الدراسى الأول بشكوى تقدم إلى رئيس القسم ضد تانيا التى لم تدرس أى منهج فتشعر بغدر الطلبه بها لذلك تحول حياتهم إلى جحيم من خلال تقديم منهج جاد لايبقى بالفصل غير أربعة طلبه وتنتهز الكاتبة الفرصة لتلقى الضوء على الادب الكروتى مقارنة بالادب الاوربية ناقدة تكرارية وسذاجة المواضيع التى يتعرض لها وكما يقول المترجم د محمد فرغل أن الرواية بالإجمال قصة ضياع وفقدان هوية تتعلق بالعيش فى المنفى فالعودة للوطن موت والبقاء فى المنفى هزيمة ولم يبقى أمام أبطال الرواية غير ثلاثة حلول اما النواح المستمر والبكاء على الماضى المفقود أو التكيف والانخراط فى حياة جديدة أوالانتحار .الرواية تقع فى 340 صفحة وقد أجادت الكاتبة التعبير عن العمق النفسى لقوم أصبحوا بلا وطن مابين الضياع وازدواج الشخصية وغياب قيمة الحب وأنياب الحرب التى تحفر فى الوجدان جروح لاتندمل .والتى عبرت عنها بقولها (لقد كان الشر عاديا كصناعة يومية للانسان ولم يعد حالة خاصة )وعن الحياة فى المنفى قالت ( فى المهجر تكبر قبل الاوان وتبقى صغيرا الى الابد )منقول من مقال روبير الفارسhttp://www.wataninet.com/watani_Artic..."}, {"userName": "Zayar", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/28518541-zayar", "userReview": "“Croats would eat their kruh, while Serbs would eat their hleb, Bosnians their hljeb: the word for bread in the three languages was different. Smrt, the word for death, was the same.”“Yugoslavia was a terrible place. Everybody lied. They still lie of course, but now each lie is divided in five, one per country.”“One day, passing a group of American tourists that had gathered round an old Kalverstraat organ grinder and hearing them gush over him with the word “cute,” I was reminded of its equivalent, leuk, in Dutch and realized that leukness was the key to the problem. Leukness was an antiseptic, a disinfectant that removed all spots, all bumps, put everything on an equal footing, made everything acceptable. Near my house there was a gay bar called the Quinn’s Head with a display of ten male dolls, ten Kens, in the window. It was a leuk display. Whenever I passed it, I thought of the live Barbies—young women from Moldavia, Bulgaria, Ukraine, Belarus—the traffickers, traders in human flesh, bought up for export.”“Anthropologists studying migration have taken over the term “sleeper” from popular spy novels. Sleepers are emigrants who make “normal” lives for themselves in their new environment: they learn its language, adapt to its ways, seem fully integrated—and suddenly they have an epiphany. The fantasy of a “return to the motherland” takes over with such a vengeance that it makes them into robots. They sell everything they have acquired and move back. And when they realize the mistake they have made (as most do) they go back to the land where they had “slept” for twenty or however many years, forced to relive (as they would on a psychiatrist’s couch) the years of adjustment until—“twice broken, yet twice restored—they make peace with their lot. Many live a parallel life: they project the image of their motherland on the neutral walls of the land where they are living “only temporarily” and experience the projected image as their “real” life.”"}, {"userName": "Lisajean", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/22100142-lisajean", "userReview": "The Ministry of Pain is about emigres from the Balkan countries in the Netherlands and how they deal with the breakup of Yugoslavia and their memories of their former homeland. I think that Ugresic has won acclaim based on her subject matter and because there are few other Croatian writers to compete with. Personally, I found the novel to be heavy-handed, cliched, and lacking in both subtlety of expression and clarity of thought. It definitely wasn't abysmal, but there are too many good books out there for people to waste time on middle-of-the-road, wanna-be-literary fiction."}, {"userName": "Marc Nash", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/5136053-marc-nash", "userReview": "A book about exile and trying to establish your identity in a foreign land living among your own expats whose rivalries and grudges are the reason for the narrator fleeing her war-torn country in the first place. The country is Yugoslavia as it breaks up into 6 different states and these exiles find sanctuary but no peace in Holland. The book is a stunning piece of literary writing. It portrays the human soul, with crystal precision. What it means to be in pain. To be displaced. To be fragmented and adrift of what constitutes reality and yet perfectly sane.\"Our tribe is cursed. Returning to the lands whence we came spells our death; remaining in the lands whither we have come spells defeat\". Quite."}, {"userName": "Ghanem Abdullah", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/5676985-ghanem-abdullah", "userReview": "موطن الألم.رواية دوبرافكا أوجاريسك.ترجمة: د/محمد فرغلمراجعة: د/ سامية دياباصدار المجلس الوطني للثقافة والفنون والآداب-الكويت ضمن سلسلة ابداعات عالمية- أكتوبر ٢٠١١م.تنتمي هذه الرواية لأدب المنفى، تتناول فيه الأديبة الكرواتية \"دوبرافكا\" قصة مقتبسة من أحداثٍ تاريخية عاصرتها وعايشتها، امتلأت بالألم والدم.تدور الرواية حول بعض اللاجئين الذين قدموا لهولندا بعد تفكك يوغسلافيا السابقة لعدة دول، كان اللاجئون قادمين من كرواتيا وصربيا والبوسنة وألبانيا وغيرها، وكانت تجمع بعضًا منهم إحدى الكليات التي تعني بالدراسات الأدبية، وكانت تدرسهم فيها معلمة، هي الأخرى كانت لاجئة كرواتية، تحاول في فصلها الدراسي، ومع لاجئين رأوا العذاب وعايشوه، أن تحييَ فيهم أدب اللغة اليوغسلافية التي تفككت هي أيضًا إلى عدة لغات، ولم تعد كما كانت جامعة للشعوب اليوغسلافية.((يأكل الكروات الـ\"كروه\" ويأكل الصرب \"هلب\"، ويأكل البوسنيون \"هليب\"، فهي كلمات مختلفة في اللغات الثلاث وتعني الخبز، أما \"سمرت\" فتعني الموت، وهي واحدة عند الجميع.))تتناول الرواية الحياة الأليمة التي يعيشها اللاجئون، رغم المساعدات المقدمة لهم، وتتناول الأحداث المأساوية التي تعرض لها اللاجئون أو أقاربهم في \"يوغسلافيا\" قبل هروبهم.((كونك لاجئًا كانت مماثلة لكونك عاجزًا.))في البداية ظننت أن الرواية هي مجموعة مذكرات للأديبة الكرواتية بعد لجْوئها لهولندا، لكن لاحقًا تأكدت أنها رواية مستوحاة بعض أحداثها من التاريخ الحديث، أما شخوصها فهم محض خيال المؤلفة، وإن كنت أرى أن فيها شيء من حياة المؤلفة.الرواية كانت تشاؤمية جدًا تجاه المستقبل الذي ينتظر اللاجئين، سواء هنا في هولندا، أو حتى في أوطانهم الناشِئة، وهذا يعكس موقف الأديبة السياسي، الذي كان رافضًا لتفكيك يوغسلافيا إلى دولٍ عدة، وبالتحديد كانت من المناوئين البارزين لاستقلال كرواتيا عن يوغسلافيا السابقة، وموقفها هذا هو السبب في لجوئها إلى هولندا، بعد أن وصفتها الحركة القومية الكرواتية أنها \"خائنة\".خلال أحداث الرواية، وجدت أن النفس التشاؤمي السوداوي هو الطاغي، كانت تعتبر واقع اللاجئين مأساة حقيقية، أمّا مستقبلهم فيحمل مآسٍ أخرى لا تقل عنها ألمًا.هناك بعض القصص الفردية الجانبية التي عمست هذه النظرة التشاؤمية للواقع، منها تجارب الطلاب التي حكوها، ومنها انتحار أحدهم، ومنها انسحاب بعضهم من الدراسة، وحتى قصة الحب غير الواضحة التي تنشأ بين الأستاذة الكرواتية وأحد طلبتها الصرب، لكنها لم تخرج إلى حيز حقيقي، لما يحمله أبناء كل قومية من تجربة مريرة مع الآخر القومي."}, {"userName": "محمـد بــدر ", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/5525932", "userReview": "\" حين تكون محاصرا بين خيارين .. العودة الى هناك وتكون ميتا , أو البقاء هنا وتكون مهزوما ! \" هذه هي اختصار حياة اللاجيء الذي ترك وطنه الذي تضربه الحروب والفتن والصراعات ورحل الى اللامكان حيث ينتقل من مكان لآخر باحثا عن البقاء على أمل العودة ولكن تطول الغربة وتمر الأيام فيفضل أن ينسى.. هو الغير منتمي الى هنا أو هناك. غربة الأصدقاء , وغربة الأهل وتفرقهم في المهجر , غربة اللغة , غربة النفس.. مشاعر كثيرة ومواقف لأول مرة اتعرف عليها بهذا التدفق الشعوري عن حياة اللاجئين. حياتهم صعبة وقاسية جدا نفسيا قبل كل شيء , الجميع يقسو عليهم.الكاتبة وهي تحكي عن حياة امراة كرواتية تكاد تكون هي نفسها الكاتبة , رحلت عن الدولة اليوغسلفاية اثناء الحرب ونزحت الى أوربا متنقلة بين فرنسا وهولندا ومن وظيفة لأخرى ومن مسكن لأخر , والجميع يتركها أو يتفرقوا في الغالب بدون سبب سوى الحيرة والتيه. حتى بعد ان تفككت الدولة الشيوعية واضحت بلادها منفصلة لم تستحسن فكرة الرجوع الى بلدها لأسباب كثيرة , ارجحها أنها لم تعد تشعر بأنها تنتمي الى هناك أو الى اي مكان , ومن سياق الرواية يُفهم أنها من الباكين على الدولة القومية. تهتم الكاتبة بالاسترسال في شرح العلاقة المعقدة بين اللاجئين وبعضهم , وبينهم حين يعودون _ولو على سبيل الزيارة_ وبين اهل وطنهم. كيف هو الاختلاف بين اللاجيء واللاجئة , وأيهما الأكثر صمودا ومن الأكثر انهزامية وجنوحا للاستسلام ! وللغرابة أن اللاجئة هي الأكثر صمودا ! عن اللحظات والذكريات التي لا سبيل لها الا أن تّنسى .. !الرواية عبارة عن مشاعر متدفقة عن حياة اناس تصادف ان قابلت البعض منهم في مصر خاصة الفلسطينيين , والسوريين مؤخرا ولكني لم اعرفهم عن قرب كما عرفت من الرواية. كما أنها شجعتني للتعرف أكثر عن تاريخ الدولة اليوغسلافية ومعاناة أهلها التي مازالت مستمرة في بعض اجزائها حتى الآن وفي البعض الآخر يعيشون فوق الرماد."}, {"userName": "Visnja", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/7506475-visnja", "userReview": "I feel this book was written for \"us\" Yugo people and the translation fails it. Because of this, I give it 3 stars. I doubt any English speaker reading it would quite understand what I mean, though I do think this book may convince them as a stand-in for a pathetic - though not wholly untruthful - introduction to and depiction of Slavic mentality and its pains- albeit much too singularly dark and angry in tone because I think our mentality is more sad than angry, more suffering than tortured, more creative than all her overused cliches.... The tone was too angsty, overall, and it kept the story from holding together (but perhaps that was intended...?). I'm going to find a copy in Our language and compare because this was disappointing. I wanted to like this book, and I found many beautiful bits in it (one was her visit to Ines's) but the writing, characters, dialogue, it all felt strained; vengeance or an act of passive aggression rather than an honest accessible story."}, {"userName": "Mind the Book", "userReviewDate": "Apr 22, 2016", "userURL": "http://www.goodreads.com/user/show/22692958-mind-the-book", "userReview": "Litterärt lyxproblem; en subhög med citylittslattar har samlats i TBR:en. Romaner jag skaffat för att läsa on location i Seattle, Paris, Sanremo, Southwold (!) och Amsterdam, av abibliofobiska orsaker, eller överentusiastisk bokpackning. The Ministry of Pain är en exillitteraturprofessors anteckningar från ett källarhål - i Amsterdam. Insiktsfullt, intelligent. Utöver Balkanhistoriken finns det mycket här för den med flanörsjäl. Se kärleksbombning på Insta. #BOTNS-bingoruta: 'A dark, upsetting, or sad book'. (Mörkare än såhär kan jag inte gå.)"}, {"userName": "Suketus", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/7369475-suketus", "userReview": "Bosnian sodan repimiä ihmisiä Amsterdamissa, selviytymässä elämässään eteenpäin, kun raaka sota on vienyt maan, kielen ja identiteetin. Karu tarina, joka pitää kuitenkin lopulta aika etäällä."}, {"userName": "Rob", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/1854336-rob", "userReview": "An important but brutally depressing read, the premise is a good one - in the late 90s, a group of students from the former Yugoslavia are enrolled in a Serbo-Croat course at the University of Amsterdam under the instruction of a teacher who has moved from Zagreb. Her way of smoothing out differences and keeping them motivated is to feed them and encourage in them a healthy diet of 'Yugonostalgia' and while Tito's People's Republic is by no means glossed over as an earthly paradise (brutal labour camps were a part of the reality), the petty propagandising and nationalism that followed was clearly no better. Ugrešić is a critic of the extreme chauvinism of Croatia under Franjo Tuđman and while that goes down like a lead balloon with the patriotic in that country, she is by no means an apologist for Serbian atrocities or Slobodan Milošević. The prose, albeit translated, is good too - poetic and minimalist with much imagery, a making of Ugrešić a Balkan Anne Michaels in many ways. I did find the latter third of the novel when things get really dark to be less satisfactory though."}, {"userName": "Tze-Wen", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/60762-tze-wen", "userReview": "What is like to live with Yugo-nostalgia? To be drawn to others of \"your own\", fellow diaspora of former Yugoslavia? To never be at peace, feel at home, be completely yourself or fully recover from having your country torn from you, your memories replaced with new ones and the suffocating guilt of having gotten away?Despite my efforts to really try and like this book, my feelings remained an unwavering lukewarm at the most. The author penned a beautiful, sad, harsh, unforgiving and above all, truthful account of how Tanja and the others experienced the new world (\"after\") and the often unsuccessful quest for their place in it. Nevertheless, she failed to instill a grain of sympathy in me, and her protagonist remained an aloof, overly cautious woman throughout. I am afraid that the continuous emphasis on \"us\", \"we\" and \"our own\", did not help either. At the beginning of the book, I wondered briefly whether a more profound knowledge of the history of the former Socialist Federal Republic of Yugoslavia would have granted me a better understanding of the story... but I don't think so anymore. Ugrešić somehow managed to keep me at an arm's length, and I never got upgraded from my seat as a casual observer.When I first picked up this book, I was attracted by the blurb on the back. You can probably guess by now that this was a mistake: the story deals with a ministry of pain, but it has nothing to do with s&m in the sense of sexual behaviour. Their classroom symbolises this ministry of pain and the reminiscing they do inflicts pain on them. Whether this can be compared to sadomasochism, I really do not know. In short: I expected a tale about former Yugoslavian refugees who get caught up in a crime, that is somehow tied to their parttime work (which is the making of s&m clothing and accessories in the aforementioned location), instead, I had to battle through chapters and chapters of what felt like aimless self-reflection. I also felt let down by the backdrop of the book: a fictional Amsterdam. The casual insertion of Dutch words here and there added nothing to the story, it only managed to give an already alienating novel an awkward feel."}, {"userName": "Malcolm", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5860800-malcolm", "userReview": "I really like Dubravka Ugresic's work (her 'Thank You For Not Reading' is a favourite collection of essays) and this novel does not disappoint, but it also does not quite work. The central character and narrator has a short term contract teaching in the Department of Slavonic Languages at the University of Amsterdam where in the post-Yugoslav era (after the fratricidal war of the 1990s) she has to teach Yugoslav (or Serb-Croat-Bosnian-Montenergin-Slovenian-Macedonian) literature. Her approach, and Ugresic's, is an unsettling and at times painful unpacking of Yugo-nostalgia, of diaspora, of refugee-ness, and all loss – all those things that the former-Yugoslavs had to deal with when their country no longer existed (and through my friends and others in and from the place) are still dealing with. While we quite properly focus on the horrors of the war in Bosnia (and in doing so improperly blame all Serbs for everything and improperly exonerate the other parties ot the war), all of the former Yugoslavia seems to be grappling with its and their place in the world. This novel is a brave, unsettling, critical exploration of that problem and all that it entails. Perhaps the most unsettling is the two brief chapters dealing with a visit to a war crimes trial in The Hague where the characters become utterly frustrated at the meaninglessness to them of the legal proceedings and minutiae of proof.Ugresic, in all her work, refuses to accept the legitimacy of the nationalist exclusivity of post-Yugoslav politics, but is not yearning in a nostalgic manner for the old world – favouring a collectivist inclusive post-Yugoslav politics and culture. She is damning, for instance, about the tendency to claim Yugoslav authors for its various parts (so the someone like Ivo Andric becomes Serb, and Croat, and Bosnian) and points to the problems of labelling (there are references to 'our' language as it remains unnamed, and 'our' people as Yugoslavs have no name any more). All this insight is however weakened by a plot that does not quite seem to hold me. I'm tempted to an assessment of good but could do better."}, {"userName": "Ron", "userReviewDate": "Apr 25, 2012", "userURL": "http://www.goodreads.com/user/show/3961732-ron", "userReview": "In a world rapidly filling with those taking refuge from political turmoil, there is a growing literature of the refugee experience. This novel (which seems more like a memoir it is so detailed in the specifics of finding asylum in another country) covers a year in the life of a young woman from Zagreb in Croatia, who has fetched up in Holland, with a university teaching job in the Slavic Languages department. Here she teaches mostly fellow emigres, from the former Yugoslavia.The narrative device gives opportunity for an ongoing analysis of what it means to be from a country that after bloody civil war no longer exists. In Amsterdam, she mingles with other emigres, \"our people\" she calls them, who like her can remember growing up in a communist country, priding itself in an ethnic diversity that it no longer tolerates. What they experience, living in exile, is what they call \"Yugonostalgia.\" Returning to Zagreb for a brief visit, she learns what all immigrants must discover, that time does not stand still for those who have stayed behind. Soon those who have left, even history itself, are forgotten in a kind of collective amnesia.There is defeat for both those who leave and those who stay, she concludes. The only triumph is at the moment of departure itself, when what is intolerable is left behind and the hope of finding a true home somewhere else is not yet dashed. This is something of an academic novel, the fate of the heroine tied up in departmental politics. Given the literary interests of the main character, there are many allusions to European and American literature, film, and pop culture, while the book also draws heavily on a familiarity with Balkan writers. Ironic, darkly humorous, and thought provoking."}, {"userName": "حنين خطاب", "userReviewDate": "Dec 25, 2015", "userURL": "http://www.goodreads.com/user/show/17565757", "userReview": "'''بدأ مقياس ضغط قلبك بالهبوط، وبدأت عيناك تغرورقان بالدموع  كان يفصلنا جدار غير مرئي من الجليد، كنت في الجهة اﻷخرىهل من الممكن أن يقول إنه كانت لدي رغبة واحدة في تلك اللحظة، وهي أن أضرب رأسي في عرض الجدار؟ احتجت إلى المساعدة. عانى قلبي من خطأ ما، ولكنني لم أستطع أن أحدد مدى خطورته. لقد كنت بحاجة ماسة إلى ملجأ، إلى حضن ألف نفسي فيه، إلى مكان انتظر فيه للتخلص من اﻷلم.مكان آتي إليه، أعود فيه إلى نفسي'''ما أشبه اليوم بلأمس....اغلب ادبيات المنفى تتميز أنها تعيد رسم الواقع بنظرة من الماضي...لتدرك ان الزمن يعيد طحن مسافاته مكررا نفسهوالكاتبة كانت تخوض التشتت كمن يخوض الجليد بمجرفة..ليرفع بعضا منه على فوهة بركان الواقعكل وصف ملامح الهجرة والضياع والتشتت كانت تؤهلنا لنسمع صوت وأصداءه يتردد في داخل كل عربي تمزقت أواصر وطنهبدءا بسوريا عبورا بغيرها من بلادادب المنفى سيتفجر من قلوب عربية دفنتها الهجرة بصمت صادم مؤقت أو تحت جليد لن يذوب...! ثمة خاطر نائح يتردد داخلي*أن هنالك ضحايا لا صوت لهم ولا صور....ولت أثر إلا أثار صرخات بددها الفراغ*يليق بها موطن اﻷلم..فموطن اﻷلم يكاد يكون جحيمنا اﻷرضي....فيه العذاب درجات من أول الشتات إلى آخر معنى ممزق للضياع....!!!!"}, {"userName": "Kaloyana", "userReviewDate": "Aug 24, 2012", "userURL": "http://www.goodreads.com/user/show/3659381-kaloyana", "userReview": "Прочетох книгата за един ден. Надмина всичките ми очаквания, които всъщност нямах в големи количества, предвид темата. А именно - последиците в живота на обикновените хора, след войната в Югославия. Стилът и изказът на автора са на високо ниво. Угрешич пише доста чувствено, честно и открито. Умело ползва думите и ги мята като ножове насреща ни. Не може да си роден на Балканите и да не ти подейства всичко, което описва. Хареса ми това, че няма мрънкане и оплакване, няма оценка, нито политика. Има, чисто и просто, характерно и силно описание на раната в човешката душа. Хубава история, която засяга теми като носталгията, търсенето на себе си, вглеждането в света на все по-малки детайли, урокът на загубата, цената на живота, а и - бягството, умората, борбата и тъгата. Книга, в която децата на героите спят \"като заклани\", докато децата на западния свят спят \"като ангели\". А накрая има цветущ списък с балкански псувни и клетви. Едва ли някъде в световните езици има по-цветущ и изчерпателен."}, {"userName": "Mona", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/24058481-mona", "userReview": "تقدم الرواية قصة ضياع وفقدان هوية وتناقش مواضيع إنسانية في غاية الأهمية ، تتعلق بتداعيات العيش في المنفىمن خلال النموذج اليوغسلافي وأهم هذه التداعيات هو هاجس العودة إلى الوطن ، وتطرح الكاتبة ثنائية مرعبة :فالعودة إلى الوطت تعني الموت ، في حين أن البقاء في المنفى يعني الهزيمة ، وبين هذين الخيارين تبرز قضية الأنتحار المؤرقة وأصبحت شائعة في الوطن كأحد إفرازات الحرب المأساوية مثل قولها (الأنتحار نوع من الرفاهية أثناء الحرب ، إنه مواساة يندر توافرها )لا أتذكر متى لاحظت للمرة الأولى ، أعتدت أن أقف منتظرة الترام في المحطة وأنا أحدق في خارطة المدينة خلف اللوح الزجاجي حيث يؤشر بالألوان على خطوط الحافلات وعربات الترام ،تلك الخطوط التي لم أفهمها ولم تعني لي الكثير أو تعني اي أهمية في ذلك الوقت ، كنت أقف هناك وفجأة ودون أدنى فكرة وأنا ملازمة الخط الأزرق ، تستولي علي رغبة في صدم رأسي بالزجاج وإيذاء نفسيفي كل مرة كنت أدنو من ذلك بشئ أكبر ها أنا هنا ، ومن الممكن أن أفعلها في أي لحظة ومن ، ثم ....توقفي يا رفيقة ، كان يقولها بنبرة فيها شئ من السخرية واضعاً يده على كتفي ، إنك حقاً لن تقومي بذلك .!!!"}, {"userName": "Andrea", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/24860611-andrea", "userReview": "Briljantna knjiga. Nevjerojatno uvjerljiv prikaz iskorijenjenosti nakon raspada Jugoslavije i strategija pamćenja/zaborava. Prisutne su sve karakteristike ženskog pisma, ali proza nije zamorna kakva neka djela u tom žanru, primjerice, Svila, škare, znaju biti. Izvrstan lirizam, ali i nepatvorenost osjećaja i situacija s kojima se zaista može lako povezati. Demistificira mnoge emigrantske narative, ali ni u jednom trenutku s grubošću."}, {"userName": "verbava", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/2219641-verbava", "userReview": "шкода, що так мало перекладів з неї можна знайти, – дубравка угрешич мені подобається в усіх своїх іпостасях: іронічній, інсайдерсько-літературній, публіцистичній, феміністичній, міфотворчій (чи то пак міфоперетворювальній) – і в цій новій, трохи сумній і трохи жорстокій, присутній у \"міністерстві болю\". емігрантський досвід із війною за плечима (здається, балкани – це моя нова канада) – саме по собі діткливе, але вона розмотує цю тему в зовсім проникливий бік, коли \"не знаходити собі місця\" стає перманентним модусом існування, і чого тільки ми не готові зробити, щоб ненадовго цього відчуття позбутися. гірка й хороша книжка вийшла, може, особливо хороша тому, що резонує з оберемком речей, які я собі іноді думаю (а хто не?)."}, {"userName": "Ghaida Alkhateeb", "userReviewDate": "Dec 18, 2012", "userURL": "http://www.goodreads.com/user/show/10732365-ghaida-alkhateeb", "userReview": "An amazing touching novel. I can say it is one of the stories that I did not want to end. Moving between the details, the characters, or the feelings gave me a sense of excitement. The way the writer linked the ideas was incredibly good. I love it as it really embodied my life, I spent away from my family and started to believe,regardless of some frustrations,that being far away form your hometown can be painful and even more damaging than an infectious disease. It goes in the veins and arteries of everyone, making me feel I am part of the novel. I really cried when I read some details of the story and in some more cases I was sad. But in conclusion, it was worthwhile to read such a novel. Strongly recommend"}], "description": "Having fled the violent breakup of Yugoslavia, Tanja Lucic is now a professor of literature at the University of Amsterdam, where she teaches a class filled with other young Yugoslav exiles, most of whom earn meager wages assembling leather and rubber S&M clothing at a sweatshop they call the \"Ministry.\" Abandoning literature, Tanja encourages her students to indulge their \"Yugonostalgia\" in essays about their personal experiences during their homeland's cultural and physical disintegration. But Tanja's act of academic rebellion incites the rage of one renegade member of her class—and pulls her dangerously close to another—which, in turn, exacerbates the tensions of a life in exile that has now begun to spiral seriously out of control.", "title": "The Ministry of Pain", "url": "https://www.goodreads.com/book/show/261423.The_Ministry_of_Pain", "average": 3.77, "cover": "https://images.gr-assets.com/books/1410140236l/261423.jpg", "reviews": 105, "authors": [{"url": "https://www.goodreads.com/author/show/2736291.Dubravka_Ugre_i_", "name": "Dubravka Ugrešić"}, {"url": "https://www.goodreads.com/author/show/66349.Michael_Henry_Heim", "name": "Michael Henry Heim"}], "type": ["Fiction", "Contemporary", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/261423.The_Ministry_of_Pain", "http://www.goodreads.com/book/show/874411.The_Ministry_of_Pain", "http://www.goodreads.com/book/show/16170354-il-ministero-del-dolore", "http://www.goodreads.com/book/show/2425407.The_Ministry_of_Pain", "http://www.goodreads.com/book/show/13432912", "http://www.goodreads.com/book/show/15739113", "http://www.goodreads.com/book/show/26053714-sm-rtans-ministerium", "http://www.goodreads.com/book/show/3437846-the-ministry-of-pain", "http://www.goodreads.com/book/show/22062893-kiputilahallitus", "http://www.goodreads.com/book/show/7675371-ministarstvo-boli", "http://www.goodreads.com/book/show/6011268-baba-yaga-laid-an-egg", "http://www.goodreads.com/book/show/328093.The_Museum_of_Unconditional_Surrender", "http://www.goodreads.com/book/show/5969573-tefica-cvek-u-raljama-ivota", "http://www.goodreads.com/book/show/592578.Thank_You_for_Not_Reading", "http://www.goodreads.com/book/show/249328.The_Culture_of_Lies", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}