{"ratings": 9200, "userreviews": [{"userName": "Evgeny", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/9340136-evgeny", "userReview": "This is a group read with the following people: myself. Yes, this has got to be the loneliest group read I have ever participated in. The novel is an unfinished mystery from a classic of English literature. In the unfinished form my edition has around 230 pages and the actual mystery happens at 66% of the book length. Thus if I say what exactly the mystery is for all practical purposes it would be a complete spoiler. However from the title is can be deduced the mystery is connected to one of the character, Edwin Drood. This young guy lives with his uncle John Jasper. He is betrothed to a beautiful girl Rosa Bud (the couple's fathers took care of this way before their kids understood what it means). Most of the novel takes place in a provincial town called Cloisterham. The sleepy town still has its own shares of excitements - I mean for such place anything breaking the routine constitutes excitement, like coming of orphan twins - Neville and Helena Landless. They were literally dumped in the place by a Philanthropic Society of London. While Helena quickly befriended Rosa, Neville started behaving like a jackass or whatever was the term in the Victorian Britain. At least the gossip mongers had their hands full trying to stay abreast with the new arrivals. If you think this is not enough to make the story interesting let me mention that the first chapter takes place in a London opium den with what surely considered to be disturbing visions at the time of writing. Before I started composing my own review I read other people's thoughts about the novel looking for inspiration. Surprising number of reviewers give low rating because the tale was unfinished. Huh? How is it logical? The guy was laboriously writing the story until his death - unlike some modern writers I do not care to mention. It is not his fault he died before finishing. I strongly suspect had the author had a choice in the matter, he would have chosen to live longer (and finishing the book as a result). While I am on the subject let me mention how the book ends. The identity of the villain is very much clear. It is almost as much clear how the crime was committed and the main clue overlooked in otherwise very careful planning. It is also possible to figure out the identity of the investigator with the high probability. How exactly the tale was supposed to end in anybody's guess.Thus my fairly low rating is not due to this. The rating is influenced by the fact that this is simply not Dickens' best work, or even among his best. He could do much better - and he did elsewhere. For starters I began to think some genres are not compatible with each other. In this case a serious mystery simply refused to cooperate with satire despite the considerable writing abilities of the author. Some characters and situations came straight from satirical stories - just read practically every scene involving Thomas Sapsea and Luke Honeythunder. The mystery itself is very much serious matter. My personal nitpick: I do not like the use of present tense. In here present and past tenses are mixed and once again Dickens' writing skills almost - but not quite - made it work. There was even no good reason of doing it here by the way.On the positive side you can see the writing of a Master. New and inspiring writers really need to read his descriptions to see how it is done. For example his description of Cloisterham was fairly short and made the town truly alive in my imagination. On the other hand he spent one page describing a closet which was forgotten as soon as the description was finished, but this was the only such example. If you want to see this taken into the level of ridiculousness read anything by Victor Hugo. Anyhow even minor efforts by Dickens are well worth reading, but this time it was not an easy read. As a side note my edition has discovered fragments of Mr. Sapsea's tale. Not only they do not move the story by an inch, they also contain none of the characters from the published part except for Mr. Sapsea himself. From this point of view it was a completely pointless addition."}, {"userName": "Simona Bartolotta", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/5312173-simona-bartolotta", "userReview": "➡ REREAD 12/2017: Seriously, there are so many clues in here. My head hurts. Happily, though.---4.5“And yet there are such unexplored romantic nooks in the unlikeliest men, that even old tinderous and touchwoody P. J. T. Possibly Jabbered Thus, at some odd times, in or about seventeen-forty-seven.” The Mystery of Edwin Drood is contained in a book I'm currently reading in Italian, namely \nLa verità sul caso D.\n (in English The D. Case or The Truth About the Mystery of Edwin Drood) by Fruttero and Lucentini, therefore I thought it was the perfect occasion for me to read Dickens's last and unfinished work in its original language as well.It's unfinished, yes; but is it my fault if this man possesses this uncanny ability to make me fall in love with even half a story and half a crime?Mr Jasper and Mr Grewgious are two unforgettable characters, each of them for his own reasons. The latter, especially, is one of those characters you can't help but being grateful to have met. And Jasper, well, he has so many faces that 150 years have passed by, and we still haven't got the hang of him; besides, he is vicious and eerie all you want, but he does know his way with words. (Up to a point; someone should tell him that when you declare yourself you usually stop before the threats. But don't tell me his “I loved you madly” speech didn't make you swoon a little ad shiver -for several reasons- a lot. You totally know what I mean.)"}, {"userName": "MJ Nicholls", "userReviewDate": "Nov 04, 2012", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "An incomplete Dickens novel is like a half-finished jigsaw. How do you rate a half-finished jigsaw? This fragment, being Dickens, actually comprises about 1.5/3 of the intended work, but still isn’t enough to want to invest oneself emotionally and intellectually in the characters and plot happenings (for me, anyway). In this instance, it may be wiser to skip the book and head straight for the recent BBC adaptation (much as it pains me to recommend TV over text). Still: not without its usual charms and flourishes, howevs. Now I have reached the end of my serialised Dickens quest, let me now pointlessly rate the works from favourite to not:1—Little Dorrit. Sumptuous, heartbreaking . . . not an unmemorable moment.2—Our Mutual Friend. Melancholy, dark, haunting and murderous. 3—David Copperfield. The reason first-person narratives are no longer required. 4—Nicholas Nickleby. Extremely funny, rollicking picaresque-esque number.5—A Tale of Two Cities. Exceptionally moving and bloodthirsty historical novel.6—Oliver Twist. Captivating child protagonist, fabulously vicious twists.7—The Pickwick Papers. Dickens does straight comedy to much merriment.8—The Old Curiosity Shop. Scariest villain and cutest child fatality.9—Bleak House. Complex, powerful and yes, a wee bit overlong in places(!) 10—Martin Chuzzlewit. His second best comedy, starring the brilliant Pecksniff.11—Dombey and Son. Extremely tense, extremely meandering. But good.12—Barnaby Rudge. Satire and history together in a messy, bloody epic, with parrots.13—Great Expectations. Beautiful childhood reflections, less successful in adulthood.14—Hard Times. Sublime character Gradgrind in choppy, hectoring effort.15—The Mystery of Edwin Drood. Unfinished."}, {"userName": "Glenn Sumi", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "More like 3.5 stars, but having read many Dickens novels, this isn't one of his best.... so I'm rounding down to 3I came to The Mystery Of Edwin Drood, Dickens’s last and unfinished novel, by chance.Earlier this year I’d read The Last Dickens, Matthew Pearl’s novel about the mystery surrounding Dickens’s final book. Pearl’s literary thriller involved murder, opium addiction, autobiographical elements about Dickens’s American speaking tour and affairs, international publishing rights, “bookaneers” (look up the term – I’d never heard it before). Fascinating stuff.So I thought I’d track down the source material. I was also familiar with the musical based on Dickens’s book – the one in which the audience votes on the show’s outcome. I saw it in its most recent Broadway revival and quite enjoyed it. The book itself, alas, isn’t first-rate Chuck D. One of the main problems is the central character, Edwin, who’s a bit of a cipher. Edwin is engaged to his childhood sweetheart, Rosa Bud, who, like him, is an orphan. Edwin doesn’t have much ambition or personality. Edwin and Rosa aren’t terribly passionate about each other. In fact, they’re more like siblings. Edwin’s uncle, John Jasper, is a much more compelling figure. Besides being an opium addict (and some of the early scenes set in opium dens positively ooze with atmosphere), the haunted, lecherous and terribly unhappy Jasper is also the choirmaster at Cloisterham Cathedral. In his spare time he acts as Rosa's music master, but it soon becomes clear that he’d like to do more to the girl than just teach her music.Two twins from Ceylon, Neville and Helena Landless, also arrive in town. Helena befriends Rosa, and her brother Neville is smitten with her. Neville and Edwin get into a fight that was too subtle for me to really comprehend.Soon, during a requisite dark and stormy night, Edwin disappears. Was he murdered? If so, who did it? Neville, having fought him, is under suspicion, and Jasper seems happy to point the finger at him. Or... does Edwin disappear only to reappear later in disguise? (A couple of characters mysteriously do indeed show up midway through the book.) We’ll never know.Dickens plants lots of details that would likely have popped up later in the unraveling of the mystery: a ring, a walking stick, a black scarf… But a lot of the writing feels laboured, particularly involving minor characters. And it’s a big problem when you don’t feel anything when your “hero” disappears. Still, Dickens was a marvelous plotter, and it’s unfair to comment on the book without knowing what he intended.If anything, this book makes me want to go back to Dickens’s other books. I’ve read the biggies (Great Expectations, David Copperfield, Bleak House, Oliver Twist), but there are still many left.Apparently this book was Dickens’s attempt to write in the mystery genre that his friend, Wilkie Collins, had mastered. So perhaps it’s about time I read Collins’s books like The Woman In White and The Moonstone. I've been meaning to anyway."}, {"userName": "Nancy Oakes", "userReviewDate": "Jan 25, 2009", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "I knew at the outset that Dickens died before he had the chance to finish this novel, but I didn't realize how incredibly frustrated I was going to be because of it! It seems that he was just getting somewhere, and that there was going to be some climactic action coming up shortly, and then poof. No more book. But on the other hand, it was so good getting to that point, and as noted, I am aware that The Mystery of Edwin Drood was unfinished, so I can't say that I was all that frustrated, really. It's the getting to the end (or the leave-off point) that mattered, and it was a great ride. I won't go over the story/plot here; it is very well known. Movies have been made; I believe there was a stage production or two as well, and there are (as I saw written somewhere) entire websites and pundits devoted to solving the mystery and playing \"what-if\" in an effort to provide an ending. This edition has a preface by Peter Ackroyd, a Dickens biographer, and an appendix by GK Chesterton. Chesterton provides several theories about what may have followed if Dickens had been alive to finish his work. One more thing: I read this on the heels of Dan Simmons' most excellent novel \"Drood,\" and it puts a lot into perspective.I would definitely recommend it -- if you MUST have an ending, then don't read it, but as I said above...the getting there is most of the fun. Most excellent."}, {"userName": "Yani", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/13686880-yani", "userReview": "[ (Jasper y Neville están enamorados de Rose, así que hay que sacar a Edwin del medio)  (hide spoiler)]"}, {"userName": "Dimitri", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/69971017-dimitri", "userReview": "La scomparsa del giovane Edwin rimarrà per sempre un mistero perché Charles Dickens è scomparso lasciando incompiuto questo romanzo cupo e fumoso, illuminato da situazioni comiche, ambientato nella città inventata di Cloisterham, tra cattedrali, cripte, cimiteri, collegi per signorine, lussuosi palazzi e quartieri malfamati. Mentre si può intuire come avrebbe potuto concludersi, la storia si gusta soprattutto per la maestria di Dickens nel creare i personaggi e nel scegliere i loro nomi: l’inquietante e doppio John Jasper, un po’ Jekyll un po’ Hyde, di giorno irreprensibile maestro del coro, di notte oppiomane; la bellissima e infantile Rosa; l’impulsivo Neville Landless e sua sorella Helena, dal luminoso volto zingaresco; il reverendo Septimus Crisparkle; l’ubriacone Durdles; l’ex marinaio Tartar, creatore di giardini sospesi.A tratti melodrammatico, molto spesso ironico, Dickens mi ha divertito soprattutto quando descrive i personaggi più anziani. Il sindaco Sapsea, ad esempio. Qualora si assuma l’asino a tipico esempio di compiaciuta stupidità e presunzione – una consuetudine, forse, come alcune altre, più convenzionale che corretta – allora il più genuino asino di Cloisterham è Thomas Sapsea. Oppure l’agguerrito filantropo Honeythunder, la cui filantropia era di quel genere bellicoso che rendeva difficile distinguerla dall’animosità. Honeythunder camminava in mezzo alla strada, facendosi largo tra gli indigeni a spallate, e sviluppando a voce alta un suo piano per catturare tutti i disoccupati del Regno Unito, cacciandoli uno dopo l’altro in galera e costringendoli, pena l’immediato sterminio, a diventare filantropi. Perché, secondo Dickens, Filantropi Professanti e Pugili presentavano somiglianze stupefacenti nella conformazione frenologica della nuca: quanto allo sviluppo degli organi che formano o accompagnano l’inclinazione ad attaccare a testa bassa il prossimo, i Filantropi erano decisamente favoriti.Ma il mio preferito è Hiram Grewgious, goffo e amabile tutore della bella Rosa, molto meno ingenuo di quanto appaia. Ogni suo gesto e ogni sua parola sono puro divertimento.“Da quelle parti ci sono stato di recente” disse Grewgious a Edwin, “mi riferivo a questo dicendo di essere certo che eravate atteso.”“Davvero, signore! Sì, lo sapevo che Pussy stava di vedetta in attesa del mio arrivo.”“Avete un gatto laggiù?” chiese Grewgious.Edwin arrossì lievemente, spiegando: “Rosa la chiamo Pussy”.“Ma davvero”, disse Grewgious, lisciandosi la testa; “che carino”.Edwin lo guardò, incerto se avesse serie obiezioni sull’appellativo. Ma tanto valeva che guardasse il quadrante di un orologio."}, {"userName": "Vanessa Wu", "userReviewDate": "Mar 06, 2012", "userURL": "http://www.goodreads.com/user/show/5771483-vanessa-wu", "userReview": "I don't know what made me buy this book and start reading it. The first few pages were torture. I knew the novel was unfinished. At least it would be short. But why even bother at all?Then gradually there appeared light in the murk. Uncle and nephew, Jack and Eddy, got out their nuts and started to talk about Pussy.No one does dialogue like Dickens. It is crisp, clear, entertaining and lifelike. Even the way the men crack their nuts adds to the drama.Dickens is completely unafraid of sentiment. He allows the two men to be as affectionate with each other as two lovers.When Pussy comes into the story it gets even better. Everyone is in love with her. It's sickening but it's also exciting. I love this kind of melodrama.The way John Jasper stares at Pussy when she is playing the piano is fantastic. You remember it throughout all that follows and so does she. She especially remembers it many months later in Chapter 19 when John/Jack is staring at her again, dressed in mourning for the missing Eddy.At times Dickens can be so verbose that it's hard to catch his meaning but when he is describing passion his sentences are models of clarity. This chapter is called Shadow in the Sundial and the image, like so much that Dickens writes, sticks forever in your mind: This time he does not touch her. But his face looks so wicked and menacing, as he stands leaning against the sundial – setting, as it were, his black mark upon the very face of day – that her flight is arrested by horror as she looks at him. What makes Dickens's writing so thrilling is that he captures the passion of the moment in the very rhythm of his sentences. He isn't afraid of dramatic gestures.  \"There is my fidelity to my dear boy after death. Tread upon it!\"With an action of his hands, as though he cast down something precious.\"There is the inexpiable offence against my adoration of you. Spurn it!\"With a similar action.\"There are my labours in the cause of a just vengeance for six toiling months. Crush them!\"The scene builds and builds like a symphonic poem till Pussy rushes away to her room and faints half way up the stairs.There is a masterful touch at the end: A thunderstorm is coming on, the maids say, and the hot and stifling air has overset the pretty dear; no wonder; they have felt their own knees all of a tremble all day long.My knees were also all of a tremble and my heart all of a flutter while I read, and read, and read. Two semi-colons in a single sentence, by the way! There is a man who is not afraid to flout convention.The ending is, of course, abrupt and dizzying. It leaves you tottering on the edge of a precipice. My imagination was teeming with possibilities. I read a few theories about how the story might have been meant to go on but I wasn't satisfied by any of them. I couldn't help feeling that Dickens's imagination was just too ingenious, too inventive and too mischievous to be pinned down by even the most creative of scholars.So for stimulating my imagination, this was the best book by far that I have read this year."}, {"userName": "Annelies", "userReviewDate": "Jul 21, 2016", "userURL": "http://www.goodreads.com/user/show/23628601-annelies", "userReview": "Another lovely Dickens, though unfinished. His style is grandiose. He really mastered it in this unfinished book. The irony is to the point. His characterisation is superb... What to say more of a wonderful piece of writing by so great an author... Minor point ... unfinished?"}, {"userName": "Alan", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/5650849-alan", "userReview": "Dickens begins Drood with a notable variation on the rhetoric of, say, \"Fog Everywhere...\" in Bleak House. \"Then follow white elephants caparisoned...\" is a fantastic portrayal, avowed to be an invasion of a fantastic consciousness. Dickens' prior intimacy with his characters has been limited to the \"I\" narrative, his portrayal of other characters depending largely on his command of their words in dialog and his descriptive rhetoric in landscaping the situation. The author ruptures narrative distance in this one paragraph; his accomplishment challenges the adequacy of Dickens' previous novelistic art.  For the first time Dickens presents a preliterate consciousness, a consciousness in a fantastic perceptual state, as Hanry James will later do with normal conceptual \"impressions\" as well, and Faulkner of course will build whole novels like The Sound and the Fury on. Faulkner, though, was not elucidating, as Dickens here, the 19th C OPIOID Crisis, namely: opium.In Dickens the preliterate consciousness is distorted by a material catalyst, leading to what the character finds \"unintelligible.\" In our 21st C US, tea-totalling politicians produce unintelligiblity on a daily basis.  On the other hand, is there a more amusing Dickensian character than Mr Honeythunder? Or more Dickensian names than Durdles, Grewgious, Drood? Mr Jasper is the problem, or precipitates it. Dickens' intimacy with his character goes beyond Jasper's articulate consciousness, into preliterate \"impressions\" as H James would call them. Dickens' world creates a unity of self, language and action within a character which become unity of social position, morality and happiness in the finished (or ended) novel. Here Dickens has created a character, the drugged Jasper, in whom his public moral system as well as his public language holds no claim."}, {"userName": "Kyle", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/11665678-kyle", "userReview": "I only partially like Dickens, so in my continuing effort to change my ways regarding Mr. Charles, I thought I would read a Dickens book that was only partially finished. Turns out that idea actually is as bad as it sounds. I don't really feel like writing a more involved review, so I'll keep it short and sweet: If you already like Charles Dickens, you'll probably like this book (though likely not as much as his other, more complete, work). If you're like me and are largely ambivalent towards Charles Dickens, then you will likely hold this book in a similar regard (only less so)."}, {"userName": "James", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/41609617-james", "userReview": "What a great book - and what a great shame for us (and him!) that Dickens never lived to complete it. Despite all the suggested answers to 'the mystery' and all the desperate attempts to 'complete' this novel - we will never know...what came next.... The version I read has the transcript of a 'trail' held in London / Covent Garden in 1914 to attempt to establish to guilt or otherwise of the main suspect - quite rightly, the 'judge' (G K Chesterton) ruled, after a long long hearing that all were in contempt of court and sentenced to prison! A similar attempt was also made thereafter in America I believe? All very entertaining - but ultimately futile.Definitely worth a read."}, {"userName": "Tristram", "userReviewDate": "Mar 17, 2013", "userURL": "http://www.goodreads.com/user/show/18181298-tristram", "userReview": "Frustration or Fascination?Reading Dickens’s last novel, The Mystery of Edwin Drood can be a source of both frustration and fascination, for the one reason that is far more easily explained than borne – that Dickens died while he was midway in writing the story and that he did not leave any notes allowing us to draw conclusions as to how the mystery of Edwin Drood’s disappearance – we do not even know for sure that he has been killed – will be cleared up.The story in a nutshell: We have a young, rather happy-go-lucky, man by the name of Edwin Drood, who has been brought up in the certainty of one day marrying his deceased father’s friend’s only daughter, Rosa Bud, and who therefore never really wasted a thought on the question if he is really and truly in love with her or not. His and Rosa’s fathers wished for that connection in their last wills – without making it the condition of either of the two young people coming into their property –, and after all, Rosa is a pleasant enough young lady. Edwin’s uncle, the Cloisterham choir master John Jasper, loves his nephew dearly, but we soon realize that he, too, has his eye on Rosa, whom he teaches in matters musical. Jasper is not much older than Edwin, but a rather jaded man, because in his heart of hearts he believes that he buried his talents in Cloisterham and that his life has no very special purpose – but then he also thinks it can no longer be helped. Trying to forget his frustration by taking drugs, he has started leading a double-life, being both a respected denizen of Cloisterham and an opium-smoker in London, and somehow his hidden addiction and his secret love for Rosa have helped unhinge his personality in that for all his attachment to Edwin, he also bears the young man a grudge for his connection with Rosa. When Neville Landless and his sister Helena arrive in Cloisterham, Jasper perceives that Neville, too, feels attracted to Rosa and despises Edwin for thoughtlessly taking for granted what he, Neville, himself would regard the source of his ever-lasting happiness and pride, and he cunningly sets the two young men against each other. Consequently, when Edwin suddenly disappears without any trace but a few personal belongings found in a river, public suspicion will centre on Neville, all the more so since Jasper has taken care of bringing the clash between the two hotspurs to public notice.Is it not frustrating and pointless to read a mystery novel the end of which we will never know? It may be so to you unless you are able to enjoy the opportunity of entering into a very close reading of this intriguing text. Practically all the hints we get seem to point in the direction of Jasper as the murderer of his relative, but then the book stops in its very middle, and it seems quite unlikely for the solution to be so near at hand. Dickens was renowned for drawing the most wondrous rabbits in the form of surprising background stories out of his hat in the last third of his later novels, and he would probably also have done this in the case of The Mystery of Edwin Drood – so much so that the rabbits, in this case, might have had the size of wombats or little elephants. Jasper does not let the grass grow under his feet but quickly proposes to Rosa, linking his offer of himself with a mean attempt at moral blackmail, and he seems to exert some kind of mesmeric power over Rosa - Dickens himself was interested in mesmerism - and to manipulate his fellow-men with spiked drinks but still, he is such an obvious suspect that by the rules of the genre, it would be very disappointing indeed if he proved to be the villain in question.But then we must ask ourselves whether Dickens really wanted to join his friend Collin’s bandwagon and write an out-and-out mystery novel, or whether his main interest did not rather lie in fathoming the depths of his character John Jasper, who is the Satanic figure of the novel and shows the potential of a new, more ambivalent Dickensian villain. As my Goodreads friend Peter pointed out, Jasper evokes associations with no lesser work than  Paradise Lost: He regards Cloisterham as his personal hell, his artful machinations fuel people’s basest instincts, in the masterly chapter “Shadow on the Sun-Dial”, he mirrors Satan’s doings in the Garden of Eden, and he even quotes from Milton’s masterpiece, turning the hopeful phrase “The World was all before them, where to chose / Their place of rest” from the last book into an underhanded taunt to arouse Neville’s ire and jealousy against Edwin. Dickens may have thought that the potential of this villain Jasper, his inner, schizophrenic, dichotomy of good and evil held so much interest and promise that it would have been worthwhile to sacrifice the coup de théâtre of a mystery novel in order to grant it full swerve. His treatment of Bradley Headstone in Our Mutual Friend shows that he was striking new artistic paths.On the other hand, how can you explain the stonemason Durdles’s account of “the ghost of a cry” he heard the previous Christmas and Jasper’s dismayed reaction to this tale unless you assume that Dickens was about to unfold a surprising background story in the second half of the book. Maybe, this story would also have shed some more light on the lives of some of the parents, whom we hear about solely through their children, Edwin, Rosa, and the Landlesses?Be that as it may, I felt a lot more fascination than frustration when reading this novel, due to the fact that the absence of a clear solution induced me to pay vivid attention to every little detail of the story, much more so than I usually do when reading a mystery. And then I console myself by thinking that the Great Library in Heaven – there simply has to be one, after all, or it wouldn’t be Heaven – must surely have the missing second part of The Mystery of Edwin Drood, leather-bound and with a ribbon page marker, and, what’s more, written by the Inimitable himself, ready for me to peruse one day. Hoping that much, I also hope that in case I will have, through some error, of course, to go to that other, less well-air-conditioned place, there will be a reliable interlibrary loan system."}, {"userName": "Sandra Bašić", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/32538982-sandra-ba-i", "userReview": "Šteta što je Dickens umro prije dovršetka knjige, ostaju otvorena pitanja..."}, {"userName": "Stacy LeVine", "userReviewDate": "Mar 07, 2009", "userURL": "http://www.goodreads.com/user/show/1705328-stacy-levine", "userReview": "THE MYSTERY OF EDWIN DROOD took me a whopping 10 months to conquer. That kicks the ass of former record-holder MOBY DICK, which took me four.The tedium that slows MOBY DICK results from the plot amounting to a mere short story. The vast majority of nearly 600 pages constitutes a scientific treatise on whales, which can be testy to the patience of a fiction fan—even a fiction fan with random cetacean obsessions (such as myself). The tedium that slows …DROOD, however, is downright maddening.This Dickensophile knew going into it that …DROOD had a dead author in lieu of an ending. But she failed to realize beforehand that it was literally half a book.Only six magazine installments of an intended 12 were committed to paper before we lost Master Dickens forever, and only four appeared in print whilst he lived. Characters like Princess Puffer and Deputy never get the chance to matter. We never find out what opium and all the lugubriousness associated with it have to do with anything.Worse still, several new characters are introduced in the unintentionally “final” chapters and, thus, doomed to eternal superfluousness by the author’s death. This is particularly frustrating, for surely Dickens would have brought them all cleverly into the fold by the end. (He always did.)Worst of all, we never find out what the hell happened to Edwin Drood. Uch!This is the point at which I bitch at the Master for not finishing his book. It’s well known that the Dickens canon is verbose—if not an shamelessly over-written—because he was paid by the word.GREAT EXPECTATIONS (my all-time favorite novel) reads almost entirely as (brilliant) plot, and thus, the verbosity flows quickly. A TALE OF TWO CITIES, on the other hand, is heavy on florid illustrations of history and morbid musings on humanity. With THE MYSTERY OF EDWIN DROOD, we’re talking two-page diatribes on teapots in the homes of minor characters.Because the reader is painfully aware that the book doesn’t end, the wasting of words on inanimate objects becomes deeply upsetting.Thus, I close with a personal message to the Master, wheresoever his divine soul may be:Dearest Mr. Dickens,You should’ve skipped the teapots, sir.But rest in peace, just the same.Stacy"}, {"userName": "Peter", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/23418160-peter", "userReview": "Well, it is rather hard to evaluate a book when it is yet to be completed, but this book will not be concluded, so I must judge it not by its cover, but rather by its incomplete promise. This book marks a fresh style for Dickens. While all his books have some mystery in them, they are not mystery novels as such. Here, however, we do have a mystery as our title tells us. In the early going Dickens develops a wonderful tone with the fictional cathedral town of Cloisterham and offers a grand opening in London, but a London as experienced through the senses of an opium addict. A series of interesting characters form around the narrative, there is love and desire in the air, a clash of egos and emotions and then, voila, Edwin Drood disappears. We are left with one obvious candidate for the person responsible for Drood’s disappearance, but wait, there then is another and another and then, well, it is Dickens so almost all the characters in the novel could be potentially the guilty party, or at least associated with the guilty party.Consider the range of characters in the narrative. Sailors, opium sellers, jealous suitors, seemingly benevolent clergymen and a church official who loves looking around gravestones all rumble towards the reader. The momentum is high, the speculations of the reader are in high gear and then, tragically, Dickens dies. While some friends and his illustrator and members of Dickens’s family all claim to have some knowledge of how the novel will end, the truth is no one definitively knows. The Mystery of Edwin Drood must remain a mystery.Read the novel and join in with the legions of others who have tried to solve the crime. You cannot be wrong because, in truth, no one knows the answer."}, {"userName": "TheSkepticalReader", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/2576681-theskepticalreader", "userReview": "Will not be rating this for obvious reasons—it’s unfinished."}, {"userName": "Paul Brogan", "userReviewDate": "Aug 31, 2012", "userURL": "http://www.goodreads.com/user/show/12006755-paul-brogan", "userReview": "When Ernie produced The Mystery of Edwin Drood at the last Gentlemen's Book Club he took me to one side before the others could muscle in. 'Here,' he said, 'I knew you'd be interested in this.' He was right. After all, when we first formed the club I'd expressed a particular interest in filling the Dickens-shaped hole in my education. I'd rather had in mind something like Oliver Twist or The Pickwick Papers, but this seemed as good a place to start as any. My knowledge of this particular book was more scant than usual. I knew of it only in passing — it was the book that Lucy had been reading when her farm was attacked in J.M. Coetzee's Disgrace. Just as Lucy didn't get to finish reading the book, so Dickens didn't get to finish writing it. It was originally intended as a periodical over 12 instalments, but only six were completed before he died. I hadn't realized this, so it was an immense disappointment to get to the end and discover that it was only the middle. I wish Ernie had told me. Like an un-climaxed session between the sheets, as it were, I had now no choice but to roll over and give myself some pause to consider the thing for what it was. Naturally, my first instinct was to attempt finishing the story in my mind. It was obvious that Mr Jasper was probably Edwin Drood's murderer, if indeed he was actually dead, and I like to imagine that Mr Datchery was really Mr Brazzard in clever disguise, but what's the point of speculating like this? We shall never know, and if your interest lies in endings and denouements, and in those only, let me recommend that you don't even start with this story. Of greater interest to me was Dickens' story-telling and style. If I am really to fill that hole, this is something I shall have to get to grips with straightaway. For want of anything else to analyse, I may as well take from this experience something that will help me through my further adventures with Dickens. Let me start with his characters. Dickens paints them with broad, uncomplicated strokes. The names he chooses for them should be evidence enough of this: Tartar, Landless, Crisparkle, Rosebud. This is not to say that his figures are of few dimensions, but they seem to me to be caricatures nonetheless. I can hardly imagine that those who populated Victoria's England should be any less complex than people of today, but Dickens seems to have preferred this manifest in action than articulated in thought. He spends as little time as necessary examining the internal machinery and far more relating the external evidence of character. It occurs to me that this might have been forced by the circumstances of his time: then, clothes and manners and language made the man, while today we are more comfortable with convoluted assessments of the same man's internal cogs and wheels and how his history and experience shape his unique and multi-faceted set of motivations and drivers, some good, some not. Perhaps I'm mistaken. Perhaps, rather, we like to think today that we are more enlightened in our estimation of others, but I suspect that we are still as black and white in our final appraisal as Dickens ever was. The next thing is his language. This took some practice to understand. There were times when I had to re-read some passages, especially at first. I'm not unfamiliar (falling into one of Dickens' favourite habits — the double negative) with this, having learned Shakespeare's language with great reward, and Chaucer's and even Beowulf's (with less reward), but it took some doing. The circumlocution in both speech and description was especially difficult. More than once I asked myself whether people really spoke, let alone thought, this way a century and a half ago. I don't know — perhaps they did — but here's the thing: once my mind was attuned to the indirect path, to the scenic, long way round, it worked. There was a temptation at first for me to regard Dickens' ambling prose as prissy etiquette, as constricting and unnecessarily circuitous, but as I became more practised, it came into focus as far more colourful and emotionally satisfying than I had thought it capable of being. There is a place for the direct, brutal, Hemingway-esque highway of story-telling, but its opposite, now typified in my mind by Dickens — the country byway of flowery speech and euphemism and sensitive, slow examination of the subject — has risen, by my estimation, to equal status. This must then be the hole I was seeking to fill all along. So yes, Ernie, thank you for allowing me first dibs at this little gem. I wish you'd told me, though."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Apr 20, 2009", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "I'll tell you one thing for free-----the ending sucked! :DI don't know how to rate a book that's only half-written due to author demise. It's not my habit to read unfinished novels. I only read this so I could see Dan Simmons' jumping-off point for his recent Drood novel. Simmons used very little from Dickens' story. There's erratic behavior by an opium user, and some of the characters are similar, but Simmons' book is really his own creation. He focused more on the lives of Charles Dickens and Wilkie Collins. As for the mystery, I decided early on who I thought \"dunnit\" and why. I hadn't changed my mind when I finished. Mysteries were really not Dickens' genre. I think his cleverness with words got in the way of the story. My appreciation of Dickens' work has been uneven. Some of them I've loved (Great Expectations), and some I couldn't get past the first few chapters (Nicholas Nickleby). This one is somewhere in the middle. Readable but not very smooth."}, {"userName": "Laurel Hicks", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/1719730-laurel-hicks", "userReview": "I didn't finish reading this book because Dickens didn't finish writing it. (He died instead, thus creating a real mystery.) As Chesterton wrote, \"And alone, perhaps, among detective-story writers, he never lived to destroy his mystery.\""}, {"userName": "LindaH", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/21018510-lindah", "userReview": "When I was young and foolish I skipped The Mystery of Edwin Drood because Charles Dickens never finished it, and how could I read anything and not know how it ended? But that foolishness then allowed me now, forty years later, to \"discover\" this new (to me) Dickens text, and to read it from the beginning with the question, What is Dickens setting up here? Indeed, my own expectation is that in the first half of a book the Problem has been announced and all the main characters (their motives and flaws, not to mention possible contributions to the eventual resolution) have been introduced, and (Note well!) TMOED is the entire first half of Dickens' planned novel. So I had fun watching him at his craft.The plot is...well, Dickensian. Two wards, Edwin and Rosa, betrothed since they were little according to their fathers' wishes, decide as the marriage approaches to end their engagement and just be friends. Before communicating this development to his uncle, John Jasper (who is in love with Rosa), Edwin disappears. The reader does not see what transpires. Nor is it clear why Jasper, mourning the loss of his nephew, is so distraught over the broken engagement when he hears of it.Even though the word \"mystery\" appears in the title, this book is not a mystery in the whodunit sense. The reader knows the identity of the murderer, the clues that will lead to his indictment, even the murder weapon. What is not known, and never shall be known, is the WHY. Various endings have been proposed over the 140 years since Dickens' death. I lean toward Dickens' own words. In a letter to a friend he told of wanting to write about an uncle who murders his nephew...I take this to mean that Jasper kills Edwin...and in his final hours in prison, the uncle tells his story...I take this to mean that Dickens was looking forward to narrating the grisly, dramatic details of the murder scene and revealing the larger story and Jasper's stake in it.Not only is Dickens' last novel full of wonderful characters and great writing, it is a spur to reading discussions of this puzzling book and to knowing more about Dickens' craft."}, {"userName": "Mary Lou", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/7098587-mary-lou", "userReview": "How does one rate half a mystery? While other Dickens novels have had mysteries to solve, Drood seems to have more of a \"whodunit\" flavor than, say Bleak House. Regrettably, we shall never know whodunit... or if a murder was even committed (I'm not convinced!). Despite this frustration, we're treated to the delightful Mr. Crisparkle and his mother; the prim and proper Miss Twinkleton; the candid Mrs. Billickin; and the particularly Angular Mr. Grewgious - all wonderfully quirky and lovable. We're also introduced to the requisite imp, Deputy; the duplicitous opium addict Jasper; the (also requisite) diminutive, childlike beauty, Rosa; and a cast of other amazing characters that Dickens fans will want to know. The short passage about Luke Honeythunder's visit alone is worth the price of admission. So read and enjoy The Mystery of Edwin Drood, knowing that it will, forever, remain a mystery. You'll certainly be enriched by visiting Cloisterham and its inhabitants despite that."}, {"userName": "Ruthie Jones", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/1119571-ruthie-jones", "userReview": "Even his unfinished novel is brilliant! Too bad Dickens died before Edwin Drood was finished, but what better way to go than to leave a captive audience hanging and wanting more! All the speculation and wondering will never reveal what the good author intended, but what is revealed is a glimpse into a novel that is and would have been purely Dickens.\"Their way lies through strange places.\" ~ chapter 12\"...but no trace of Edwin Drood revisited the light of the sun.\" ~ chapter 15"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Mystery of Edwin Drood, Charles Dickensرمان ناتمام: «معمای ادوین درود» یا «اسرار ادوین درود»؛نویسنده: چارلز دیکنز؛"}, {"userName": "Tim", "userReviewDate": "Feb 09, 2010", "userURL": "http://www.goodreads.com/user/show/730330-tim", "userReview": "Toughest book to rate, EVER. The final novel from a master — but exactly half finished! That makes a five-star rating out of the question, but can I give it four when it isn't otherwise truly great? Well, I did. Maybe I'll change the rating daily (four, three, four, three) for the rest of my life.\"The Mystery of Edwin Drood\" opens with three men and a woman sprawled across an \"unseemly\" bed, two of the men in a stupor, the woman smoking opium, and, emerging himself from a haze, John Jasper, a man who will figure prominently in this novel. We're a long way from \"The Pickwick Papers.\"\"The Mystery of Edwin Drood\" is, in fact, dark, lean, not as panoramic and funny as early Dickens. It also is, despite being a half-told tale, quite good. Jasper is a jealous uncle to the title character; Edwin's future marriage to Rosa Bud is an arranged one. Edwin disappears — very likely murdered — shortly after he and Rosa mutually break off the engagement (a fact of which Jasper, besotted with Rosa, is unaware). The \"mystery\" in the title coupled with the tale's unfinished status might tempt some — likely its non-readers — into thinking that the identity of the perpetrator has vanished in the mists of time. But \"Edwin Drood\" isn't really about whodunnit — we're quite sure we know, and the little evidence that exists of Dickens' plans certainly seems to confirm our obvious take on what happened. What the novel is about, and doubtless would have explored more deeply if completed, is the psychology of Jasper, a voice in the church choir and by outward appearances an upright man, whose darkness sometimes creeps out in threatening body language amid otherwise cool control.Dickens expertly peels away layers of Jasper's cunning; it is presumed the author would have brought us even further into Jasper's head — and taken him into his own.Other strong characters stand out, including Septimus Crisparkle, a canon of the church who also stays in great physical shape by shadow boxing. Personally, I love Deputy, a boy hired by Durdles, a stone mason and inscriber of gravestones. Deputy's duty? Throw stones at Durdles if he stays out past 10 o'clock at night — to, in fact, stone him home. Love that!The book does drag at times, primarily in the first 50 pages (despite the atmospheric opium haze of the opening) — when Dickens seems uninspired — and after Edwin's disappearance, when there's a sluggish recharging of the batteries.What perhaps resonates most, though? What a shame it is that the novel never was finished; it could have been one of Charles Dickens' major works. Instead we're left with questions and empty speculations. Who was the mysterious Mr. Datchery? Could he be another character in disguise? What to make of the opium woman? How would Dickens have resolved the crime (assuming it was a crime)? What would have been Jasper's end, and how would his fascinating psychology have been further explored? Sadly, we'll never know. Onward, then, to more Droodian darkness. Dan Simmons' \"Drood\" is next."}, {"userName": "Squire", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/15986821-squire", "userReview": "Of course I knew it was incomplete before I started it; even those who have never dared a Dickens novel know that Dickens died leaving the mystery unsolved. But, having only read three Dickens novels (A Christmas Carol,  David Copperfield, and Bleak House), I felt I had a good grasp on Charlie and his style to merit making this my fourth Dickens book.I was wrong. I probably should have gone with Great Expectations or another of the titles sitting on my bookshelf.Dickens' trademark eccentric caricatures and sparkling dialog abound in this book; but what was unexpected was that these caricatures were more important that the actual story. The development of the criminal mind of John Jasper, the choirmaster of Cloisterham and main antagonist of Drood, seems to be Dickens' focus. The wit of the whole (or the whole of what we have--only the first twelve chapters were actually published; the remaining 13 were found in Dickens' papers and later published) is creepy and atmospheric, but without the charm of Dickens' earlier works, I found the book to be more tedious than enjoyable. Perhaps I will be able to appreciate this unsolved mystery more at a later time, but for now The Mystery of Edwin Drood will have to remain a book that I am glad I read, but did not enjoy as much as some of the author's other works.Finally, let it be known that Gerald Dickens, the great great grandson of Charles Dickens (who I met in November of 2015 when he performed A Christmas Carol in KCMO) suggested that I get a few more novels under my belt before I tackle Drood. He even suggested Great Expectations (but wished me luck)."}, {"userName": "Alex ", "userReviewDate": "Feb 02, 2010", "userURL": "http://www.goodreads.com/user/show/1808983-alex", "userReview": "This book is a complete enigma, least of all because it remained unfinished at Dickens death and no-one knows the solution to the \"mystery\" of Edwin Drood's death. (As much as the clues point to Jasper being the killer, I can't help feeling it would be so much more like Dickens to have Edwin return alive ...but it's not important, we'll never know!). There are flashes of the genius writer Dickens was that I know and love, particularly in the relationship between Edwin and Rosa who just can't get on despite being betrothed, and there's a wondeful scne where they call it a day and go their separate ways. Tthe inclusion and descriptions of the opium den, the strangeness of many of the characters in the book, their delightfulself-importance (or extreme humbleness) the wonderful names of courses (Mr. Crisparkle!) and the intricate plotting all point to this being typically Dickensian. Yet, there's also a sense that Dickens was trying to push himself in new directions yet again and this time, maybe because of his ill health, he just can't seem to find the compelling voice of his best work and there are many chapters that just feel awkward, out of place and a little dull.It's impossible to judge the book without a conclusion and who knows, Dickens intent may have become clear with the bigger picture. As it stands though, I'd say that this is mostly a curiosity for the Dickens obsessed. Good fun, but hardly essential"}, {"userName": "James", "userReviewDate": "Oct 29, 2008", "userURL": "http://www.goodreads.com/user/show/426277-james", "userReview": "Four years, many speaking engagements, and a trip to America intervened between Charles Dickens' penultimate novel and his final one, The Mystery of Edwin Drood.Ever since his involvement in a train accident in 1865 on his return from France, and perhaps even before, Dickens was ailing with a variety of illnesses, some of which were at least aggravated by overwork and his refusal to reduce his schedule. It was thus in 1869 that he began writing his final novel of which the first six of the originally intended twelve monthly parts were published in 1870. He died in June of that year with the mystery unfinished.Edwin Drood begins in an opium den and the air of mystery that surrounds that venue grows as the story progresses. At the center of the story is Edwin Drood, his fiancee Rosa Budd, his uncle John Jasper, Canon Crisparkle, and the Landless twins, with others to numerous (as was Dickens' way) to mention. The style is fresh and new for Dickens, especially when contrasted with the heavier more convoluted style of Our Mutual Friend which immediately preceded it. The first half of the story introduces conflict and doubt for the young Drood and we see glimmers of danger headed his way in the remaining finished sections. Although incomplete, the novel has appeal and is well worth reading."}, {"userName": "Glen U", "userReviewDate": "Jun 26, 2015", "userURL": "http://www.goodreads.com/user/show/43454226-glen-u", "userReview": "First off, if anybody else but Dickens had written this, I never would have read it. Nobody reads an unfinished novel, unless the value lies in the writer and not in the story. This is a story of a mystery, possibly a murder. Because of the unfinished nature of the book, there are characters that seem superfluous and events that are incongruous. But the writing is superlative. Unlike some of his other works, his writing is a little more sparse. His narratives are still full of grand descriptions, his character building is still the best in all literature, and his dialogue is wonderful. There are times while reading this that you will be immersed and enchanted by Dicken's wordplay and re-read passages just for the enjoyment it brings to your imagination. If he could have finished this piece, it would definitely be my favorite Dicken's novel because of the slightly different style he brings from his earlier novels."}, {"userName": "booklady", "userReviewDate": "Jun 21, 2008", "userURL": "http://www.goodreads.com/user/show/350218-booklady", "userReview": "Oh what sadness! To come to the end of the story and know that it can never be finished. I confess I debated not reading it for that very reason. I knew I would feel this way: cheated, lost, frustrated, mourning for author and his creation.And yet, as with all Dickens' stories, the characters are memorable, the dialogue witty and the situations all too familiar. This master of human nature recorded for all posterity Victorian England in all its eccentricities, vices and whimsies. I love him. I salute him. I will long ponder The Mystery of Edwin Drood.If you can bear the end, the rest of the book is well worth the read!"}], "description": "Charles Dickens's final, unfinished novel, and one that has puzzled readers and inspired writers since its publication, The Mystery of Edwin Drood is edited with an introduction by David Paroissien in Penguin Classics.Edwin Drood is contracted to marry orphan Rosa Bud when he comes of age, but when they find that duty has gradually replaced affection, they agree to break off the engagement. Shortly afterwards, in the middle of a storm on Christmas Eve, Edwin disappears, leaving nothing behind but some personal belongings and the suspicion that his jealous uncle John Jasper, madly in love with Rosa, is the killer. And beyond this presumed crime there are further intrigues: the dark opium dens of the sleepy cathedral town of Cloisterham, and the sinister double life of Choirmaster Jasper, whose drug-fuelled fantasy life belies his respectable appearance. Dickens died before completing The Mystery of Edwin Drood, leaving its tantalising mystery unsolved and encouraging successive generations of readers to turn detective.This edition contains an introduction by David Paroissien, discussing the novel's ending, with a chronology, notes, original illustrations by Samuel Luke Fildes, appendices on opium use in the nineteenth century, the 'Sapsea Fragment' and Dickens's plans for the story's conclusion.Charles Dickens is one of the best-loved novelists in the English language, whose 200th anniversary was celebrated in 2012. His most famous books, including Oliver Twist, Great Expectations, A Tale of Two Cities, David Copperfield and The Pickwick Papers, have been adapted for stage and screen and read by millions.If you enjoyed The Mystery of Edwin Drood, you might like Dickens's Little Dorrit, also available in Penguin Classics.", "title": "The Mystery of Edwin Drood", "url": "http://www.goodreads.com/book/show/18113790-the-mystery-of-edwin-drood", "average": 3.66, "cover": "https://images.gr-assets.com/books/1372074367l/18113790.jpg", "reviews": 658, "authors": [{"url": "https://www.goodreads.com/author/show/239579.Charles_Dickens", "name": "Charles Dickens"}], "type": ["Classics", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/18113790-the-mystery-of-edwin-drood", "http://www.goodreads.com/book/show/329957.The_Mystery_of_Edwin_Drood", "http://www.goodreads.com/book/show/6421941-the-mystery-of-edwin-drood", "http://www.goodreads.com/book/show/6718391-the-mystery-of-edwin-drood", "http://www.goodreads.com/book/show/1907813.The_Mystery_of_Edwin_Drood", "http://www.goodreads.com/book/show/54763.The_Mystery_of_Edwin_Drood", "http://www.goodreads.com/book/show/27775023-el-misterio-de-edwin-drood", "http://www.goodreads.com/book/show/9703503-il-mistero-di-edwin-drood", "http://www.goodreads.com/book/show/400821.The_Mystery_of_Edwin_Drood", "http://www.goodreads.com/book/show/33865873-tajna-edwina-drooda", "http://www.goodreads.com/book/show/15994694-the-mystery-of-edwin-drood", "http://www.goodreads.com/book/show/31145499-the-mystery-of-edwin-drood", "http://www.goodreads.com/book/show/1953.A_Tale_of_Two_Cities", "http://www.goodreads.com/book/show/2623.Great_Expectations", "http://www.goodreads.com/book/show/5326.A_Christmas_Carol", "http://www.goodreads.com/book/show/18254.Oliver_Twist", "http://www.goodreads.com/book/show/58696.David_Copperfield"]}