{"ratings": 137, "userreviews": [{"userName": "Lois", "userReviewDate": "Apr 24, 2016", "userURL": "http://www.goodreads.com/user/show/7963516-lois", "userReview": "I was attempting to read this series in order. The only reason for doing that is to keep the adventures of Roger the Chapman in chronological order. The only way to accomplish that is by copyright date and/or reading the fly-leaf to see if there is an historical date given. I couldn't find the next one on the library shelves, so I just grabbed this one.What a disappointment. Honestly, I couldn't finish it. I'm quite certain the 20th century profanity has no place in 15th century England fiction. Roger in the previous books I read, had a believable and delightful amount of sarcasm. This one started out with him appearing to hate everybody."}, {"userName": "Alan", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/2272354-alan", "userReview": "I think I've read all of the other Roger the Chapman mysteries. For some reason this one took me a little longer to get into than the others. This one takes place soon after the death of King Edward IV and before the crowning of the new king. A young man mysteriously goes missing and Prince Richard sends the Spymaster General Timothy Plummer to fetch Roger from his home and look into the mystery. It involves the seventh son of a seventh son and an underground group of woman who hate men, as well as several attempts on Rogers life before he solves the mystery."}, {"userName": "Spuddie", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/348527-spuddie", "userReview": "It is the glorious days of 1483 and Richard, Duke of Gloucester, is very close to declaring himself King of England. Roger, our friendly chapman who has managed to solve a few mysteries for the Duke, has only just returned to his home, wife and children in Bristol, when the Duke's spymaster once again comes seeking him at Richard's behest.The mystery in this one got to be just plain silly after a bit, and definitely had to suspend disbelief to read on, but I still enjoy these light historical mysteries with the wonderful characters and depiction of the times."}, {"userName": "Kate", "userReviewDate": "Nov 01, 2011", "userURL": "http://www.goodreads.com/user/show/572977-kate", "userReview": "Note to self: Reading Kate Sedley and Pat McIntosh in sucession is just a bit too historically confusing. However, English history here is careening towards some unbearably fascinating bits and I kept hoping Roger Chapman would take part...seems Sedley wants us to keep Richard from becoming the III a little longer. It's worth it to get this locked room and then some mystery. Lovely, lovely as usual."}, {"userName": "Josephine (Jo)", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/5918846-josephine-jo", "userReview": "Another in a line of very enjoyable medievil murder mysteries. Roger Chapman trudges the country selling his wares and solving mysteries as he goes. This one was very good and although I did work out who did what in the last chapter it did keep me guessing for a long time. I love all the historical detail and look forward to the next novel. I wonder it Roger will be able to shed any light on what happened to the little princes in the tower!"}, {"userName": "Gayle", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/2752289-gayle", "userReview": "Yet another good installment of the Roger the Chapman mystery series by Kate Sedley. I started reading these a few years ago and anxiously await each new book. I had most things figured out in this one, but there were a few twists that threw me. But that's OK! It's one of the reasons I like these books so much. If you have not read any of the books in this series, and you like medieval mysteries, I can't recommend these books highly enough."}, {"userName": "Donna", "userReviewDate": "Aug 24, 2011", "userURL": "http://www.goodreads.com/user/show/301807-donna", "userReview": "This series has now progressed to the point of Richard III's ascension to the throne. Having just read Daughter of Time, it was particularly interesting, but if you don't know your history it might be a bit difficult to follow. Roger is up to his usual detecting."}, {"userName": "Amy", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/930247-amy", "userReview": "Roger Chapman is so real - 15th or 21st century! He is so smart, but so funny at the same time. I love it when he realizes he is clueless. The other characters are interesting, the setting is so alive, the storyline compelling - another great book in the series."}, {"userName": "Marian", "userReviewDate": "Apr 13, 2016", "userURL": "http://www.goodreads.com/user/show/4806154-marian", "userReview": "a good read - just like all the others in this series"}, {"userName": "Jean", "userReviewDate": "Jun 01, 2012", "userURL": "http://www.goodreads.com/user/show/4030598-jean", "userReview": "The historical correctness got in the way of the story"}, {"userName": "Maz", "userReviewDate": "Mar 17, 2013", "userURL": "http://www.goodreads.com/user/show/6314827-maz", "userReview": "Haven't read all the series in the correct order need to do so!"}, {"userName": "Deb", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/236708-deb", "userReview": "I knew Piers was a bad one, but Roger was fooled. Meantime, Richard of Gloucester has taken the throne and Roger is going to have to make some hard choices in the next couple of books..."}, {"userName": "Rebecca", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/7955837-rebecca", "userReview": "I like these books, they are interesting with just enough history to be fun."}], "description": "The new Roger the Chapman mystery - In the sultry midsummer of 1483, as Richard of Gloucester begins his bid for the English crown, Roger returns home to Bristol, glad to be out of the capital. But almost immediately, the Duke recalls him to London to investigate the mysterious disappearance of a young boy whose tutor has been found murdered, apparently in a locked room. It is an investigation which has as its background an ancient British legend, and which will imperil Roger’s life as never before.", "title": "The Midsummer Crown\n      \n          (Roger the Chapman #20)", "url": "https://www.goodreads.com/book/show/10057976-the-midsummer-crown", "average": 3.88, "cover": "https://images.gr-assets.com/books/1328829950l/10057976.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/4848.Kate_Sedley", "name": "Kate Sedley"}], "type": ["Mystery", "Historical", "Historical", "Mystery", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/10057976-the-midsummer-crown", "http://www.goodreads.com/book/show/12263607-the-midsummer-crown", "http://www.goodreads.com/book/show/13222362-the-midsummer-crown", "http://www.goodreads.com/book/show/88918.Death_and_the_Chapman", "http://www.goodreads.com/book/show/88921.The_Plymouth_Cloak", "http://www.goodreads.com/book/show/88926.The_Weaver_s_Tale", "http://www.goodreads.com/book/show/1310585.The_Weaver_s_Inheritance", "http://www.goodreads.com/book/show/88916.The_Brothers_of_Glastonbury"]}