{"ratings": 3978, "userreviews": [{"userName": "Jaline", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/7234171-jaline", "userReview": "Thank you to Goodreads friend Celia, whose review of this lovely book first brought it to my attention.The Moonflower Vine was published in 1962 and was re-released in 2009 with a Foreword by Jane Smiley. At that time this book was the only one written by the author (1913 – 1999) and, as Jane Smiley pointed out, it was not about politics or any of the big topics of the day. Instead, this is a family saga that takes place in Missouri and does so over a time span of more than 50 years. The transitions through time are written seamlessly, as are the characterizations.Each person in this beautifully written novel is unique and has their own voice. I loved how this was done: youngest daughter opens the novel with a first person account of the family’s summer holiday together and I was immediately drawn in. From there, we are allowed to be in contact with each person’s inner thoughts and feelings, yet each of them is written in the third person. For me, this technique magnified the story somehow; it gave views and viewpoints and impressions that one person alone would not likely reveal. While we experienced each person through their thoughts and feelings, we were also able to notice scenes and events around each person – sometimes ones they were not fully aware of themselves.This family saga is like a marvelous, leisurely walk through another time and place. It is sometimes funny, sometimes tragic, sometimes inspiring – and consistently interesting. The depths in this novel must be experienced to be fully appreciated, and my one regret is that it had to end at all. I call it “lovely” and “beautifully written”; it is also poetic, earthy and solid. It is softly touched with poetic flare so earth meets with fire, water, and air in an illuminating way that is in turns crisp, dreamy, and crystal-clear.The Moonflower Vine itself fascinated me. It is a night-blooming relative of the morning glory and as is stated in the book, its first breath is very nearly its last. The flowers last only briefly, yet if they are clipped away as soon as they droop their heads, the pods will spring forth with another show the next evening.This book gave me so many gifts – and I highly recommend this story, complete with all its gifts, to everyone."}, {"userName": "Diane", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "What a lovely novel this was. A fellow librarian recommended the book to me, and I'm so glad I sought it out.The Moonflower Vine is set in rural Missouri and follows the Soames family: Parents Matthew and Callie, and four daughters, named Jessica, Leonie, Mary Jo and Mathy. The story opens with three of the daughters -- now adults and some with children of their own -- visiting the farm one summer in the 1950s. Matthew and Callie are now in their 70s or 80s, and everyone is cheerful and excited for the visit. This first section seems almost idyllic, with the biggest problems being neighbors who keep intruding, when all the Soames want to do is have a traditional family picnic. It's in the following sections of the book that the reader learns the family history, and we see that the daughters' childhood was not as quiet as it appears. First we learn Jessica's story, the eldest daughter, who was determined to follow her heart. Next we learn more of Matthew and how he came to be married to Callie. (This section was especially eye-opening.) Then we get Mathy's story, the youngest and wildest child. Then Leonie's story, and finally, we hear from Callie, whose motherly tale surprised me.I'm deliberately being vague on details, because to watch this story unfold was a treasure. Each person had their own secrets, and only the reader knows everything. My one wish for this book was that we had heard more from daughter Mary Jo, who in the novel escaped to a career in New York, and whose character I think represents the author. But the novel is already a gem, and to wish for more seems selfish.The Moonflower Vine was first published in 1962. In 2009, HarperCollins chose to reprint it, with an introduction by Jane Smiley that included this quote: \"Most novelists, no matter how popular, fall into obscurity.\" Happily, Carleton's obscurity has been delayed for another generation, at least. Highly recommended to anyone who likes a good novel about families.Opening Paragraph\"My father had a farm on the western side of Missouri, below the river, where the Ozark Plateau levels to join the plains. This is a region cut by creeks, where high pastures rise out of wooded valleys to catch the sunlight and fall away over limestone bluffs. It is a pretty country. It does not demand your admiration, as some regions do, but seems glad for it all the same. It repays you with serenity, corn and persimmons, blackberries, black walnuts, bluegrass and wild roses. A provident land, in its modest way. The farm lay in its heart, two hundred acres on a slow brown stream called Little Tebo.\"Favorite Quotes\"Once we got there, we were happy enough. We lapsed easily into the old ways, cracked the old jokes, fished in the creek, ate country cream and grew fat and lazy. It was a time of placid unreality. The lives we lived outside were suspended, the affairs of the world forgotten and our common blood remembered. No matter that our values differed now, that we had gone our separate ways; when we met like this on familiar ground, we enjoyed one another.\"\"The truth's hard for some folks to understand.\"\"Suddenly it seemed to me that I looked back from a great distance on that smile and saw it all again -- the smile and the day, the whole sunny, sad, funny, wonderful day, and all the days that we had spent here together. What was I going to do when such days came no more? There could not be many; for we were a family growing old. And how would I learn to live without these people? I who needed them so little that I could stay away all year -- what should I do without them?\"\"Though he had often envied the cultural advantages of a city, and though he sometimes longed to see its parks and monuments, historical shrines and famous buildings, he distrusted the people who made up a city.\"\"You can depart from the rules only when you know them well, and since she had not yet learned the new ones, she was not always sure what was expected of her.\"\"No one can tell anyone anything, not even how much you love them. That was the hardest of all.\"\"Children want to love their parents, but parents make it so hard sometimes.\""}, {"userName": "Melki", "userReviewDate": "May 24, 2016", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "The farm was a little island in a sea of summer.\nDamn, this was good!I usually snort at female centric novels like this one, those family sagas that span decades, and have a lot of kissing and man/woman stuff, but once again - DAMN! This was GOOD!You can read the Goodreads description or some of the reviews if you want more of a blow-by-blow description. This one is exceptional - https://www.goodreads.com/review/show...Here's why I think this book should be on your to-read list.Carleton's writing is sublime, and it's a tragedy that this is her only published work. She easily hops from humor:\n\"Poor old Aunt Cass,\" Mama said, referring to Ophelia's mother. \"Her mind wanders. But my land, for one her age, she's stronger than I am.\"\"She smells it, too,\" I said. \"She was pretty ripe when we were down there last summer.\"\"Why, Mary Jo!\"\"Well, she was--all of 'em were. Ophelia and Ralph holler and carry on at those holiness meetings and work up a good sweat and never take a bath.\"\"They're washed in the blood of the Lamb,\" said Jessica.\"It's no substitute for Lifebuoy.\"\n. . . to a charmingly evocative description of the mother:\nShe had country values. She liked crops and fat cattle, jars glimmering red and gold and green in the cool earth-smelling dark of dirt cellars. She liked the kitchen filled on Sunday with relatives and old friends. And she liked a good visit, a conversation heavy and rich with death and loss and pity.\n. . . to the beautiful philosophical musings of the father:\nA full moon hung halfway up the sky. Crossing the schoolyard, he stepped over the fence into Seabert's pasture and walked on, with his hands in his pockets, into the grove of trees, and through them up the long slope of the hill, till he came out on top among the tombstones. They stood white and peaceful in the moonlight.\"Good evening,\" he said aloud, as to old friends, and moving among the familiar furniture of the dead, he began to feel calmer. Up here the things that troubled him seemed to matter not at all. He sat down, behind a headstone, facing the moon. Looking out into space, where man had found other moons and planets but had not yet plotted heaven, he began once more to contemplate the puzzle of himself.\n If nothing else, this is one of those dreamy summer books, perfect for reading outdoors with your bare feet propped up and a glass of iced tea perched nearby."}, {"userName": "Celia", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/30261451-celia", "userReview": "The Moonflower Vine, written in 1962 by Jetta Carleton, is considered a 'rediscovered classic'. It languished in obscurity for at least 24 years, until 2009, when a new edition, with forward by Jane Smiley was published. This is the edition I read.The book starts in the 1950's when The Soames family is getting ready for a summer reunion. The parents, Matthew and Callie, are seventy. They have four daughters, Jessica, Leonie, Mathy, and Mary Jo. Mary Jo is the voice that introduces us. The novel is then divided into five sections, relating the individual stories and secrets of Jessica, Matthew, Mathy, Leonie and Callie. The reader discovers the characters through an honest, straightforward style. The novel is a loving exploration of sensitive topics of family life. It beautifully captures the mood and times of midwestern rural living, making it seem alive.Not many authors have written only one single, excellent novel. Carleton did, joining Harper Lee and Margaret Mitchell in this rarefied atmosphere. Carleton seems to have started a second novel, but its pages were presumably lost in a tornado in 2003.I really was blown away by this book. Maybe the tornado blew by here too. I know I can be sentimental and a romantic. My love for this book proves it.5 Moony Stars."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Jul 15, 2009", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "Much has been written about The Moonflower Vine because it's been around for many years. I recommend avoiding the commentaries until after you've read the book. It would have considerably diminished my enjoyment of the book if I'd read the summaries and assessments beforehand. What is wrong with these people that they think it's okay to spoil the secrets? If I were you I wouldn't even read the Foreword by Jane Smiley. Better to go in without any preconceived ideas about what's coming. This story is quaint, charming, old-fashioned, sometimes sad, and very well written. It's about rural family life in Missouri in the early 1900s. The book starts in the voice of Mary Jo Soames, the youngest daughter by a far margin. It's the early 1950s, and all the grown daughters are finishing up their yearly summer visit on the farm with their parents, Matthew and Callie. From there it goes back in time to explore the joys and struggles of the various family members. It's all told in the third person, so each section is about the whole family while focusing more on one person.The author showed an impressive understanding of family dynamics and each person's inner battles as they try to find a balance between satisfying their all-too-human urges and doing right by those who love them. And besides all that, it's just a thoroughly enjoyable, revealing, sometimes funny story about a bygone time with no running water or 'lectricity."}, {"userName": "Brian Melendez", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/21631677-brian-melendez", "userReview": "I have re-read this book probably more often than any other book in my adult life. The story unfolds in rural Missouri over the first two-thirds of the 20th century, but its themes and its allure are timeless: family, faith, rebellion, secrets, love, independence, and time. Matthew and Callie Soames raise four daughters: Jessica, Leonie, Mary Jo, and Mathy. The book tells their stories one lifetime at a time, starting with the oldest daughter, Jessica, who introduces us to her parents and siblings and their life growing up in the Ozarks. Then we meet Matthew, the father, whose inner life and story -- and whose foolish heart -- are a far cry from the stern schoolmaster who rules his home and his daughters' lives with an austere and lonely love. (\"To his daughters as they grew up, Matthew Soames was God and the weather.\" His character has often reminded me of the father in Robert Hayden's poem \"Those Winter Sundays.\") Mathy, the youngest daughter, is the family's most vivid and most tragic character, a free spirit who flies a little too close to the sun. Leonie is her father's daughter, but also a child of her era, and through her Matthew is ultimately reconciled to Mathy.But each lifetime is only a piece in the puzzle of the Soames family until Callie, the strong, understated matriarch, who keeps the hardest secret of all; not until her story is told do all the others finally come together into a whole portrait, even though each story before hers seemed whole enough on its own. The book's title comes from the flowers that bloom for one night a year in the Ozarks, when the family reunites to watch them bloom for such a short season. The last chapter of Callie's story, when she suddenly finds herself an old woman and the reader suddenly discovers that half a century has passed with the Soameses, is one of the most penetrating insights into aging that I have ever read.\"The Moonflower Vine\" contains as many tragedies as a family could normally expect in half a century, but not too many, and overall it is an affirming and empowering novel. But its saddest fact doesn't appear in the novel at all -- that Jetta Carleton, whose literary debut is a masterpiece, never wrote another book. \"The Moonflower Vine\" was an overnight sensation when it was published in 1962 -- a Literary Guild selection, and a Reader's Digest Condensed Book in 1963. But four decades later, Jetta Carleton and her book are nearly forgotten. Jetta Carleton Lyon lived a full and happy life, moving in 1970 to New Mexico, where she ran a small publishing company until her death in 1999. \"The Moonflower Vine\" was reprinted by Bantam in 1984, and by Buccaneer in 1995.My grandmother collected Reader's Digest Condensed Books, and I discovered \"The Moonflower Vine\" as a child at her home years later (in the same volume with \"The Shoes of the Fisherman\" by Morris West). Soon afterward, I had to read the whole novel. A quarter century has passed, and I still can't pick it up without reading it again. And I never put it down without a catch in my throat."}, {"userName": "Clif Hostetler", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/793473-clif-hostetler", "userReview": "This novel's setting is rural western Missouri during the first half of the twentieth century. The surface story is one of family relationships complete with deeply intimate portraits. The rural and small town surroundings are fully portrayed to complete this time, place and environment.But under this happy veneer is a deeper level to the story that subtly surfaces to expose a pervasive understanding of religion that instills guilt over perceived sins—and fear of the consequential judgment. Through careful construction and skilled writing the book's narrative conveys a sense that the author is writing about a time and place with which she was familiar. Indeed it appears that story has autobiographic similarities to the author's childhood.The narrative is structured in an interesting way by beginning at the chronological ending, then skipping around through the preceding half century devoting a chapter per family member, and then ending fourteen days prior to the book's beginning. The beginning and ending of the story's narrative takes place in the 1950s and focuses on the return of three adult daughters to the family farm where their parents still live for a two week summer visit and reunion. The opening chapter takes place on the next to the last day of that fourteen day period, and the closing chapter takes place a day prior to the beginning of the reunion visit. The story's characters are introduced in the first chapter and certain events are alluded to in this chapter that become clear in the following chapters. This introductory chapter allows the reader to know what becomes of the children that they will be reading about later in the book, but the allusion to various events of family history will provide a motivation to reread the first chapter after the book's conclusion is reached.The character development that occurs through the rest of the book portrays a fascinating array of personalities among the family members. Two daughters escape from their home as soon as they get a chance, one hangs around perhaps too long, and the youngest daughter—baby of the family and probably the character that represents the author—isn't described much in the core of the book, but she does narrate the first chapter. The rest of the book is narrated in third person. The title suggests that the nightly blooming of the moonflowers must be symbolic of the book's story—beauty in the dark? The writing is smooth with beautiful descriptions of flora and fauna of the farm and maintains the reader's attention with perceptive insight into the psychology of each family member with each having their own failings and struggles. Perhaps you've noticed that I apparently can't say enough good things about this novel. I think it may become one of my all time favorites. I think one reason I'm attracted to it is because it covers the time period of my parents and grandparents, an era with which I feel familiar through stories I've been told. Its rural setting and conservative religious concerns are an environment similar to my own childhood."}, {"userName": "Rosina Lippi", "userReviewDate": "Jan 11, 2010", "userURL": "http://www.goodreads.com/user/show/3139413-rosina-lippi", "userReview": "I first read this novel in 1974 when I was 18, and I have read it every year since. Before it was rediscovered and reprinted, I bought every used copy I could find and gave them away, sometimes as many as six a year. Everyone who reads it is immediately drawn in, because it is a perfectly balanced, beautifully structured story about people you don't know, but wish you did. Each of the Soames family members is drawn so clearly, and with such a distinct voice, you can hear them talking. The end of the opening chapter is so incredibly well realized that I often use it in creative writing classes to demonstrate the way to build tension and bring it to a full resolution. If To Kill a Mockingbird is the iconic novel of the mid 20th century South, then The Moonflower Vine serves the same purpose for the Midwest. It deserves to be widely read."}, {"userName": "Katherine Stewart", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/5687230-katherine-stewart", "userReview": "When I was a little girl, I would watch things like figure skating, baseball, and gymnastics and think, \"wow, I can do that. It looks so easy!\" My mom would always comment, \"it looks easy because they are so good at what they do.\" That is how I feel about this book. This is an unassuming novel, that is elegant in its seeming simplicity and hushed atmosphere. However, when look deeper, you realize that this is a masterpiece of writing and it is not simple in the least. It isn't until you are finished with the book, or at least a good pace into it, that you realize how perfect the narrative is. It unfolds on every page, with not one superfluous detail. It amazes me how the narrative forms a perfect circle. I can't even imagine how many drafts Carleton would have had to do to make it so. It flows like a clear brook, with no sticks or snags. However, you don't think about this while you are reading it -- the story just carries you along, enjoying every moment, getting lost in it. Additionally, Carleton's writing style is immaculate. While the narrative is never mucked up with unnecessary ramblings, it is peppered with rich atmospheric detail and beautiful meditations on life, loss, family, relationships, and nature. It's never too little or too much, it's just....perfect."}, {"userName": "Irene", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/56219968-irene", "userReview": "Me ha gustado, es una lectura placentera, como un largo y cálido verano sureño, en el cual la importancia de la familia, necesitarlos y no saber qué hacer sin ellos, destaca por encima de todo.La historia va in crescendo, de menos a más. Mucho mejor la segunda mitad que la primera. Los numerosos diálogos, muy ágiles, facilitan la lectura, y hacen que sea una historia absolutamente normal y real con personajes creíbles, historias reconocibles, emociones humanas y habituales.Los personajes muy bien dibujados,y da la sensación de que la autora sólo nos muestra lo que hay, nos invita a contemplar un paisaje real de la evolución en el tiempo de una familia con sus contradicciones, lastres y alegrías.Aunque el personaje de Mary Jo, me parecía absolutamente prescindible. Al final no es así, pero claro, hay que llegar (casi) al final.La desripción de la naturaleza humana, sus dudas y anhelos, y las insatisfacciones que nos hace ser complejos en nosotros mismos es increíble.Es un libro transparente no hay, engaños,ni recovecos.Una joya desconocida"}, {"userName": "Melissa", "userReviewDate": "Apr 09, 2009", "userURL": "http://www.goodreads.com/user/show/528350-melissa", "userReview": "After 20 years of obscurity, The Moonflower Vine by Jetta Carelton, was re-issued recently after author Jane Smiley cited it as one of 100 great novels in her book, Thirteen Ways of Looking at a Novel.Why this book ceased to hold the interest of readers is a mystery. I loved this book. It was reminiscent of Cold Sassy Tree or To Kill a Mockingbird, with its rural setting and cast of familial characters. The tale of the Soames family spans 60 years beginning at the turn of the 20th century. They suffer thru trials, the Depression, death, lies and secrets. They also celebrate life, forgiveness and their love for one another.Matthew Soames, an educator in small town Missouri, his wife Callie, daughters Jessica, Leonie, Mathy and Mary Jo, live a bucolic life divided between their home “in-town” and their summer farm. Each section of the book is narrated by a different member of the family. They all have their secrets to hide. Carleton describes Matthew’s struggle with two of the seven deadly sins with Shakespearian emotion.My one critique was Callie’s narration was almost an afterthought and given far too few pages of exploration. Her secrets seemed forced and manipulated and not in harmony with the woman described throughout the book. (Is the roll of mother always marginalized?) This book was a joy to read. Have you ever felt like you have closed the cover on the best book you’ve ever read? That's how I felt when I finished. “The Moonflower Vine\" is not just a rediscovered classic -- but truly a classic."}, {"userName": "Judy", "userReviewDate": "Jun 20, 2014", "userURL": "http://www.goodreads.com/user/show/3333943-judy", "userReview": "This novel was a reading group pick and I loved it. It is completely American heartland family fiction with feisty daughters, a dad who is imperfect, and a long-suffering but wise mother.The writing is wonderful and fits the story perfectly. It reminded me of Rebecca West's The Fountain Overflows in the way it investigates the flaws of each family member. While it might feel old fashioned to a young woman reading it today, being set in the first half of the 20th century, I think Jetta Carleton paints an accurate picture of life for an American housewife living then in a rural area.The author herself lived an interesting life running a small publishing house with her husband. She was my mother's age, had a master's degree, and worked in radio and television when that was an exotic career for a woman. The Moonflower Vine was her only published novel.When I picked up a copy from the library it looked familiar. I realized that we carried the book on our \"Books You Always Wanted to Read\" shelf at Once Upon A Time Bookstore when I worked there. In addition, Jane Smiley included it in the list of \"A Hundred Novels\" that wraps up her unique take on being a novelist: 13 Ways of Looking at the Novel. Smiley writes brief reviews of each of those hundred novels and her three pages on The Moonflower Vine are typical brilliant Jane Smiley criticism. She says, \"Jetta Carlson wrote only this novel, which appears to be autobiographical, at least in part, but Carleton's style is so dense and precise and her method of imagining the inner lives of each character so daring that she seems to have been unconstrained by fears either of remembering things wrongly or of offending her relatives.\" (page 306 in the hardcover edition)Smiley also wrote the foreward to the 2009 Harper Perennial reprint of The Moonflower Vine, and positions the novel at the immediate forefront of the women's movement, a year before Betty Friedan published The Feminine Mystique. 1962 was that pivotal year and Smiley points out that Ms Carleton \"managed to write her novel in a nonpolitical way; her subject matter has become political in spite of her efforts.\"The appeal of The Moonflower Vine to me was exactly as Jane Smiley indicated. In 1962 we did not yet know that women's lives were about to undergo enormous upheaval but somehow we felt the need for it. Four headstrong daughters working out their romantic and professional destinies portrayed amidst the rural magic of Missouri feels like the perfect fictional format to tell the truth about women's lives in 1962 and beyond."}, {"userName": "Jeanette", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Moonflower Vine is the only published novel of Jetta Carleton. This I can understand, because how can you improve on perfection.The Soames family saga in rural Western Missouri circa 1890-1950 is priceless in more than a few categories. Human psychology, geography, cycles of agriculture, farm mode in a time of no electricity or indoor plumbing, family dynamics and of course, economic class interchange. 5 star in every single one of those, and a 6 for the prose. The husband is a schoolteacher and farmer, his wife more than hardworking, a small sharp dynamo, intelligent and calmly brave, although she is \"just too busy\" to learn how to read. The book is divided into sections narrated by each member of this family except the youngest daughter. Being born far after the others, her story flows from the others and eventually bridges another lifestyle in an urban state. Four daughters, two houses, small but tight community, and simplicity of a faith and chore centered existence.This book has such descriptions of natural woodland, creek, and farm field beauty that it sincerely made me feel the sway and tune of the dance in the midst of the fireflies after watching the moonflower night bloom, counting them as they spiral open and twirling to their number. If there had only been the chapters that included the \"taking down the bee tree\" day or the \"day to set the gravestone\" either one of those, with nothing else of the novel, it would still be a 5 star. How many marrieds and parents of every ilk have planned a special day to have 3 to 5 other events obliterate it! Obligation or inclination which one is my conscience magnet? That's the crux of this splendid story, and in an era when it truly did matter. Some of us are born to fly and risk is their needed oxygen. Others of us are born to timid toe first induction and 10 year contemplation with a side of angst. Some are always from the first minute only themselves and can be nothing else, and others change their cores and slide away as mercury out of the thermometer. Tremendous joys, bottomless sorrow, and one small lie amongst 100,000 truths of 60 years duration. All of that lives where this Moonflower Vine blooms.The only section in which I felt some impatience was Matthew's. His process of constant rationalization for his own feelings and values of intellectualizing snobbery almost made me want to skip ahead. But I'm glad I did not, as I saw he was his own worse enemy. Because his close to the chest held smarts succeeded only to distance and to diminish his own ability in experiencing the joys of this singular precious life we own."}, {"userName": "Raquel", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/60845901-raquel", "userReview": "¡Qué novela más maravillosa! Leerla te reconcilia con la buena literatura. Con toques intimistas y un ritmo narrativo lento pero seguro, la narradora va hilando la historia de una familia en la que todos sus miembros (personajes nítidos, muy bien dibujados, con sus luces y sus sombras) esconden secretos para garantizar la convivencia. En esta obra se ríe, se respira, se llora y se ama, se duda y se avanza, en definitiva, se vive.Puedes leer la reseña completa en http://elmomentoderaquel.blogspot.com..."}, {"userName": "Vicki", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/1503221-vicki", "userReview": "I couldn't help making comparisons the whole time I was reading this to Little Women, although I liked this book more. The characters were dynamic and three-dimensional and I liked the approach of delving into the family members one-at-a-time. If I consider this a classic (as some people do), I loved it. If I compare it to other books I'm reading these days, it was still a great character study, but the it lacked some oomph. As a minor critique, I thought the section on Callie did not do her justice as the matriarch of the family."}, {"userName": "Karen", "userReviewDate": "Aug 02, 2009", "userURL": "http://www.goodreads.com/user/show/2265358-karen", "userReview": "The Moonflower Vine, by Jetta Carlson, originally published in 1962, is an old favorite my sister and I discovered years ago. I liked it so much, I bought my own hardcopy (the original being my sister's), as well as a beat up paperback to carry in my beach bag. It is the story of four sisters and their parents, and how life bends and shapes them through the years. I originally thought of my grandmother and my mother's aunts the first time I read the book, that this is what it must have been like growing up in the early 1900's - 1920's. But as I grow older myself, I realize that although the world has changed drastically since those times, people -- with their wants, needs, and desires, have not changed at all."}, {"userName": "Ruth Turner", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/17861817-ruth-turner", "userReview": "Absolutely perfect!"}, {"userName": "Karyl", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/1462387-karyl", "userReview": "I admit I am a sucker for books set in an era long past, and even moreso for books detailing a family saga. There is nothing I love better than to watch a family grow and change through the years. And The Moonflower Vine certainly delivers. What makes this novel so interesting is that it begins at the end, when the Soames girls are all grown, home for a couple of weeks in the summer to visit their parents Matthew and Callie. The first chapter is told by the youngest daughter, Mary Jo, born when her sisters were already grown, and this chapter gives us her view on her parents. Yet she really hasn't got any idea of the full story of her family, of the secrets and desires they keep to themselves. It's only as the reader makes her way through the novel that the truths are revealed. This book is beautifully written. It's hard to fathom that this wasn't just Carleton's first novel, but that it was her only novel. She grabs the reader's attention from the beginning and never lets go, even though the subject matter is almost mundane. She draws each character so deftly, flaws and all, that the reader greedily wants to know even more. Highly recommended."}, {"userName": "Kristen", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/5103605-kristen", "userReview": "This book started off as a sleepy little family tale, then flourished into an epic of the Soames family in Missouri. Each character had their own part of the saga to tell - from Matthew's indiscretions to Jessica's first love - and each of the stories was interwoven with the others in such a way as to make these characters real and flawed and their stories heartbreaking and triumphant. Once I started getting into the story, I could not put this book down."}, {"userName": "Jon", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/899665-jon", "userReview": "DNFWe were split down the middle again I'm this one. Half loved it, going so far as to say it was as good or better than To Kill a Mockingbird. I and the other half couldn't finish it."}, {"userName": "Jeannine", "userReviewDate": "Feb 11, 2010", "userURL": "http://www.goodreads.com/user/show/805197-jeannine", "userReview": "May, 2013I liked it even more the second time through and found that I'd mellowed towards some of the things that bothered me about the characters the first time. Really appreciated the writing - beautiful narrative, the author really brings us inside the characters, dialogue is well-placed. A book I'm sure to return to again. ***I almost passed this one by because of the title, which brings to mind something sappy and \"romantic\" from, say, Nicholas Sparks. Well.This was a really good read, mostly narrative, about a MO family before WWII and up to modern times, splitting their time between city and country. Lots of contrasts and people calibrating various choices.The writing is straightforward, definitely NOT flowery or sentimental. One of my favorite passages as Leonie contemplates going against type (her type) and \"raising cain\" in Kansas City:\"Her parents wouldn't approve, but they wouldn't know about it. And they needn't get worked up if they did. Times had changed. Nowadays, perfectly respectable people went to shows on Sunday, they went dancing and played cards; lots of girls even smoked - and it didn't mean they were going to hell. Hell had shifted its location; it was farther away than people used to think.\"Didn't think much of the intro by Jane Smiley. People from the 1960s see absolutely everything through that prism and it gets old and stale. I enjoyed it in my own way and through my own lenses.Great read."}, {"userName": "Stephanie", "userReviewDate": "Jan 10, 2011", "userURL": "http://www.goodreads.com/user/show/2554661-stephanie", "userReview": "The Moonflower Vine by Jetta Carleton is the story of a family living and growing in rural Missouri. Matthew and Callie have four daughters, each one distinct, following a path truly her own. Matthew is a schoolteacher, more than willing to escape into his work and books even if it means his family comes second. Callie is loving, hardworking and wants nothing but the best for her family. Jessica is the tomboy of the family. Leonie is the good girl, wanting nothing more than to please her parents and do what's right. Mathy is the wild child, not content unless she's off exploring the world. Mary Jo is the baby of the family, growing up in a time so different from the rest of her sisters.This is a timeless novel where each character carries a secret burden. Each comes to terms with his or her faults and learns to live with them and sometimes in spite of them.This was the most realistic novel I have ever read in my life. The characters jumped off the page and became part of this world. As the novel went on Jetta Carleton revealed more and more about her characters from multiple points of view so that each layer was peeled away. This novel was rich with life and so incredibly captivating. I'm so glad I listened to the reviews saying that this book will stick with you because I feel changed by this book, and I know that I will remember it always. Do yourself a favor: go out and read this book. You will not be disappointed. I certainly wasn't!"}, {"userName": "Mary", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/1620680-mary", "userReview": "This is a beautifully written book. It is the portrait of the Soames family who live in rural Missouri. It follows their lives during the first half of the 20th century. The Soames family is composed of Matthew and Callie and their four daughters. There are 6 parts to the book and each part is given from the perspective of each family member. Almost like 6 intertwining short stories that span the family's lifetime.It made me stop to think about how each member of my family views the events that we have shared together. We each have our own perspective of what we are experiencing.The descriptions of their farm remind me so much of the area where I live today and remind me of the simplicity of rural life when I was a child.This is a book that I will want to reread again. I'm going to find some moonflower seeds to plant next year and I will reread this book while I watch the moonflowers open.It is sad that this is the only book that Jetta Carleton ever wrote because I would definitely want to read more of her work."}, {"userName": "Kathy", "userReviewDate": "Nov 29, 2010", "userURL": "http://www.goodreads.com/user/show/2589014-kathy", "userReview": "From the glowing reviews, I thought I would like this book more. It was okay; but it was so bogged down in the small-town/farm interactions and activities, and very light on any lessons learned or self-awareness on the characters' parts. That is, until the middle of the book, when the story of Mathy comes into play. After the tragedy that befalls Mathy (and the entire Soames family), we glimpse how the devastating loss changes the whole family and gets the characters to do some serious soul-searching and reflecting upon the meaning of their lives and the decisions they've made. The second half of the book was much better than the forgettable first part; but people who grew up in small towns/farming communities might enjoy the descriptions of the simple life with all their Christian underpinnings and social propriety. Jetta Carleton definitely writes well, and this is a pretty quick read. 3 Stars"}, {"userName": "Shari Larsen", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/2751691-shari-larsen", "userReview": "A story of a Missouri family during the first half of the 20th century. Matthew and Callie Soames create a life for themselves and raise four headstrong daughters. One will break their hearts, one will fall in love with the wrong man, one escapes to New York, but wild child Mathy's fate will be the family's greatest tragedy. Over the decades, they will love, deceive, comfort, and forgive; and ultimately, they will cherish the bonds of love that hold them together.The story is told in turns by the viewpoints of each daughter and Matthew; each of their stories are almost complete on their own, but the last story told, that of Callie's, ties them all together.I really enjoyed this story; the reviews I have read say that it was an overnight sensation when first published in 1962, and reading it, I can see why. A well done story of about 50 years in the life of a rural family, each one with a secret."}, {"userName": "Katherine", "userReviewDate": "Sep 08, 2011", "userURL": "http://www.goodreads.com/user/show/2837258-katherine", "userReview": "Some of the writing in this book is breathtaking, so perfectly descriptive that I found myself re-reading passages for the sheer beauty of it. I don't often finish a book and find myself wanting to begin it again immediately--I do with this one. Definitely deserving of the reissue and rediscovery promoted by author, Jane Smiley. Highly recommended!"}, {"userName": "Mimi", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/4474787-mimi", "userReview": "This came to me with a lovely note from my mom telling me that she first read it at 13 and just found and re-read. With a recommendation like that, how could I go wrong ? It's a book of quiet longing, spare, and an interesting story of the Midwest and the depression era . A bit too sad to be a favorite, but I definitely feel that the vines of the story will hold me for a long time."}, {"userName": "Bekah", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/34189280-bekah", "userReview": "I sure hope I don't jinx it but 2017 has been a great reading year for me. By some happy chance, I've managed to pick up nothing but wonderful books. I started this almost three years ago and loved what I had read of it then but because of hefty required reading lists from three different classes I was taking at the time, I was forced to abandon it 100 pages or so in. I finally got around to picking it up again this year and am so happy I did. I love family sagas, I love books set in the country and I love flawed but thoroughly loveable and relatable characters. The Moonflower Vine offers all these components and so much more. If you haven't yet read this rediscovered classic, I highly recommend that you do! It is a great spring or summer read--not too light but thoroughly enjoyable and beautiful."}, {"userName": "Cheryl Anne", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/67704013-cheryl-anne", "userReview": "Another deceptively simple, deeply wise gem of a novel, characters to recall as fondly as kin."}, {"userName": "Diane", "userReviewDate": "Oct 09, 2009", "userURL": "http://www.goodreads.com/user/show/1390765-diane", "userReview": "The Moonflower Vine, by Jetta Carleton (1913-1999) was first published in 1962 by Simon and Schuster. The Harper Perennial edition was released in 2009, ten years after the author's death.The story begins in summer in the 1950's as the adult children in the Soames family are visiting their parents, Matthew and Callie on their rural Missouri farm. The story begins as Mary Jo, the youngest of the four girls, tells of the annual visit to see their parents, which is both a reunion, and a sense of duty. The parents are now up in years and need help around the farm. Much of what occurs during their visits seem to be focused on the blooming of the \"moonflower vine\".\"The vine stormed to life, and the blooms exploded---five, twelve, a torrent of them, tumbling their extravagant beauty into the evening air\"........\"The blooming of the moonflowers was a kind of miracle, and like all true miracles it had the power of healing\".Although on the onset, the Soames clan seems the idyllic, happy family, all is not as it appears to be. The father Matthew, a former teacher and principal, is a God-fearing religious man, emotionally cold and distant, and yet a man driven toward wrong, and faced with guilt. The mother Callie, is good woman with a big heart, submissive and lonely, and longing for the closeness she is often denied. Bit by bit, each of the family members: Mary Jo, Jessica, Mathy and Leonie recall events from an earlier time (early 1900's), where the good times and bad times, private secrets, passions and temptations, and even sorrows, of each family member is revealed.What was fascinating about this character driven novel, is the way the human side of each person shines through. We meet individuals who give in to temptation, make unwise choices, and then must live with aftermath. We see how choices made by one person, affect the rest of the family. Sin, lust, guilt, and forgiveness are themes that surface on a regular basis in this novel. Considering this book was initially published nearly 50 years ago, it was a bold and daring piece. I can imagine that more than a few eyebrows were raised as romantic love, sexuality, lust and desire were prominent throughout this novel.What started out as a bit of a slow moving story, quickly picked up and became a novel that made me anxious to read on. Unlike anything I've read in a long while, I did enjoy this book. Sadly, it was the one and only novel published by the author."}], "description": "On a farm in western Missouri during the first half of the twentieth century, Matthew and Callie Soames create a life for themselves and raise four headstrong daughters. Jessica will break their hearts. Leonie will fall in love with the wrong man. Mary Jo will escape to New York. And wild child Mathy’s fate will be the family’s greatest tragedy. Over the decades they will love, deceive, comfort, forgive—and, ultimately, they will come to cherish all the more fiercely the bonds of love that hold the family together.", "title": "The Moonflower Vine", "url": "http://www.goodreads.com/book/show/31112710-the-moonflower-vine", "average": 3.93, "cover": "https://images.gr-assets.com/books/1468416562l/31112710.jpg", "reviews": 653, "authors": [{"url": "https://www.goodreads.com/author/show/809913.Jetta_Carleton", "name": "Jetta Carleton"}, {"url": "https://www.goodreads.com/author/show/212101.Natalie_Ross", "name": "Natalie Ross"}], "type": ["Fiction", "Historical", "Classics", "Family"], "outlinks": ["http://www.goodreads.com/book/show/31112710-the-moonflower-vine", "http://www.goodreads.com/book/show/1767774.The_Moonflower_Vine", "http://www.goodreads.com/book/show/4018791-the-moonflower-vine", "http://www.goodreads.com/book/show/11990832-the-moonflower-vine", "http://www.goodreads.com/book/show/8317912-cuatro-hermanas", "http://www.goodreads.com/book/show/12811929-the-moonflower-vine", "http://www.goodreads.com/book/show/12410756-clair-de-lune", "http://www.goodreads.com/book/show/10232840-condensed-books", "http://www.goodreads.com/book/show/36314249-quatre-germanes"]}