{"ratings": 3507, "userreviews": [{"userName": "Paul Bryant", "userReviewDate": "Aug 13, 2013", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Gentle warning note added here because it seems fans of this book can find the below review a little disheartening. So if you're a fan, you might want to skip this review.  But, everybody knows that one reader's dogpile is another reader's marzipan souffle with attendant hummingbirds. I myself cannot conceive of anyone reading this haemorrhaging fount of bullying bilious babytalk and not be crying for mercy by page 134. Why would anyone persist? People love this book. Me, I hated it like poison. Original review:I finally got to the SLAP moment. What is the SLAP moment? It is when you are reading a longish book and thinking you hate the fucking thing but it’s not quiiiiiiiiiite bad enough to say THAT’S ENOUGH and there are these great billowing clouds of praise for this thing urging you onwards and you’re looking, looking for the scene, the page, the paragraph which will make you stop dead and say THUS FAR AND NO FARTHER…. It finally happened to me in my reading of The Slap, so now I call it a SLAP moment. In The Slap it was the scene where Gary, the sex-starved husband, is wrestling with his young son for control of the mother’s breasts – please feel free to check my review which goes into some detail, but have a sick bag handy. In The Man who Loved Children, the SLAP moment arrived on page 133-134. It’s worth discussing in detail because this is a very well-loved book and I feel like a right pillock in not being able to join with the glad band of happy four and five star bestowers. I feel I’ve let the side down. I don’t feel good.But fucking hell, guys, seriously?You’ll all know that this long novel is about a husband named Sam who hates his wife Henny who returns the hatred with interest. Between them they have 6 children. The novel is about this family. Everyone uses the word “dysfunctional” to describe this family but I think that word, along with “subversive”, should be retired to the Home for Worn-Out Words because never have I heard a family described as “functional” and if one was the members thereof would probably feel mildly insulted, so “dysfunctional” is another horrible modern cliché, let’s find a different word.Vast swathes of this novel are about the insufferably pompous, all-knowing, all-self-regarding, all-put-upon, all-martyred, all-wise father Sam and his creepy babytalk with the kids. Other swathes are Henny’s sudden diatribes about how she wants to kill Sam, boil the children and throw herself in the Potomac. At least I could get behind Henny’s sentiments, because if I was her, I’d be thinking the same thing.I have read too many novels which describe in detail some insufferable male and his Everest- sized ego, from I the Supreme to John Hawkes’ Travesty to The Book of Evidence to Money and I don’t need another one, but especially when they indulge in this pukesome babytalk. Sam the father is speaking to his 11 year old daughter. The words in [brackets] are in the text.“Will you miss your poor little dad?”“Yes,” she lowered her eyes in confusion.“Bring up your tea, Looloo-girl : I’m sick, hot head, nedache [headache], dot pagans in my stumjack [got pains in my stomach]: want my little fambly around me this morning. We’ll have a corroboree afterwards when I get better. Mother will make the porridge.”You see she has to translate the babytalk as she goes along. So this stuff gets going very early on and you have to be pretty iron-willed to plough through it. I kept repeating the mantra “neglected modern classic”.But it doesn’t stop. Sam never shuts up. He’s supposed to be going off on a nine month foreign trip but by page 134 he’s still there. In fact only 48 hours has passed since page 1. Yeah. So here’s where I stopped. He’s talking to 11 year old Louise again and explaining exactly how and why her mother and father hate each other, in the course of which Louise queries Sam’s relativism in regard to the act of murder :“The Polynesians don’t think it’s murder: you said so. Old women collect money, then they get a young man to murder them and bury them. You said so. You said, it doesn’t matter if the people in the country don’t mind it.”“Oh! Yes I did say that, Looloo, murder depends upon the meridian, so to speak : the thousand and one tables of morality (when we objectively consider the facts of ethnic mores), teach us not to be hidebound about our own little prejudices, even in law. Consider what is supposed to be a heinous offence, murder. Now call it war, and it becomes a patriotic duty to urge other people to go and murder and be murdered. Foolish old Jo, who is a goodhearted woman, sent dozens of white feathers during the Late Unpleasantness or, in other words, desired young men to go and be murdered. En she could hev done with a young man herself: it was a combination of the sacred folly of race suicide, wilful sterility, and murder. En ebblyone thought Jo was a big gun of patriotism : I bleeve your little foolish Aunt Jo will get herself ‘lected to the DAR’s yet – she’s bin and discovered a Pollit what had no more sense than to go and fight long time ago…Now, wimmin is prone to murder. In wicked old Europe still, you get the village witch planning to murder husbings for them wives what is a bit tired of making coffee for the old man.”There are pages of shite like this. What are we to make of it? That Sam is a monstrous parent, yes. That he just uses his kids to broadcast monologues on all frequencies because he’s in love with his own voice, yes. That the kids themselves love him in spite of his egregiousness, yes. That this is in any tiny shred of a way representative of the real world? I hope not. He segues from patronising this 11 year old girl with babytalk to pontificating way above her head and back again. Okay we get this point, he’s awful. But by page 134 this same point had been made about 134 times. I did not wish to listen to another word. I wanted Looloo to turn into Hayley Stark in Hard Candy and lash him to a chair and threaten to chop his goolies off. Anything to stop that endlessly gurgling crap.\"Shut the fuck up, jackass.\""}, {"userName": "Flora", "userReviewDate": "Feb 04, 2008", "userURL": "http://www.goodreads.com/user/show/873514-flora", "userReview": "It's a travesty that this novel isn't one of those twentieth-century classics that everyone's heard of and has either read or knows they must read, like \"The Sound and the Fury\" or \"Ulysses.\" Sure, people, praise it, but in the same way that Jonathan Franzen praises Alice Munro: with patronizing awe, not peerage. I don't know that Christina Stead ever wrote anything nearly as good, but \"The Man Who Loved Children\" is epic and brilliant -- strange, gorgeous, devastating, hilarious, flawed, original. Plus, her prose style... it takes genuine risks, and when they don't work, the failure is honorable, because she's in genuine pursuit of an object, a very small but tremendous thing that she wants to get at and will worry, worry, worry 'til she does. When I think of her writing in light of, say, the onanism of Joyce, or much of Faulkner's diarrhetic nonsense (sorry, I just don't buy it), I appreciate its courage -- and its rigor -- all the more."}, {"userName": "Lark Benobi", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/73768036-lark-benobi", "userReview": "Two days after having read The Man Who Loved Children and I'm finally settling down. I don't think I've ever changed a 1 star review to a 5 star review before, but there it is. I've moved from feeling \"this is a brilliant book, but I hate it\" to feeling: \"I may hate this book, but it's brilliant.\"More than any read I can remember, this novel made me feel dreadfully insecure about my role as a parent. I've decided that is interesting and amazing rather than something to blame it for. The parents in this novel are dreadful in all the ways I dread being, I suppose. I was so unsettled by Stead's portrayal of a father who tries to be a friend to his children but ends up doing so in all the most damaging ways, smothering them, obliterating their individuality, so that they become supports for his ego and nothing more. Sam Pollitt is such a dreadful father, and yet he thrives on attention of his children, and his children adore him even when he is his most self-centered and cruel. Only Louisa, the eldest, begins to see through him, and her journey and insight become the redemptive arc in this otherwise bleak story. Henrietta Pollitt is the kind of mother who not only resents her children but also freely shares with them every resentment she feels toward them; who tells them openly how they have ruined her life; who plays with the notion of suicide in their presence; who barely acknowledges her obligations toward them. I have to confess that I am -not- in the company of those parents who have not ever wondered, however much I love my children, what it would have been like to have lived a life without them, what I might have achieved or enjoyed if I didn't have an obligation to love and care for them. Just having had that skinny thought in my head, in my past, made me vulnerable to the horror novel that this novel is at its heart.I applaud Stead for taking my parental insecurities to the farthest darkest place in this novel. The story is extreme, but it is accurate and educative, in the way only a great, classic tragedy can be.My original 1-star review, below the line.=============================What it does, it does extremely well.Imagine \"To Kill a Mockingbird\" where every character is like Bob Ewell. \"Harry Potter\" where every character is like Draco Malfoy. \"Picture of Dorian Grey\" where every character is like Dorian Grey. That's what it felt like to read The Man Who Loved Children. There is no doubt that this is an exquisitely written novel. Every sentence is masterful. Open any page and you'll find a sentence that amazes. And there is also something amazing and uncanny about Christina Stead--that she could have such a pure approach, such laser-like genius of dialog and scene and setting; that she could bring to brilliant three-dimensional life these greasy, selfish, repulsive, narcissistic people. The relentlessness of Stead's take on humanity overwhelmed me, though. If it had been a shorter book I'd probably be praising it. But eventually its meanness overcame its art for me, and my final feeling after having read the novel was one of nausea and despair."}, {"userName": "Lars Guthrie", "userReviewDate": "Oct 09, 2010", "userURL": "http://www.goodreads.com/user/show/757602-lars-guthrie", "userReview": "Jonathan Franzen—everyone who reads knows who he is, don’t they? Second novel as wildly popular as the first, cover of TIME. Yet no one seems to admit that they like him.Say what you like about his prickly personality, Franzen always seems willing to subsume his ego in the service of unrecognized writers whom he feels deserve the same attention he gets. I might never have read Paula Fox’s ‘Desperate Characters,’ had not Franzen touted it in a number of interviews when ‘The Corrections’ came out. That led to discovering Fox’s amazing catalog of children’s books. Just before the release of ‘Freedom,’ Franzen wrote an appreciation of Christina Stead’s ‘The Man Who Loved Children’ in the New York Times. I put off reading it, because I wanted to read Stead's book first. Now that has happened. I’m here to tell you to trust Jonathan Franzen’s recommendations. Corrosive, harrowing, exhilarating, pathetic, sympathetic, comic, heartbreaking, real to the bone, ‘The Man Who Loved Children’ is like nothing else. It’s truly a masterpiece. Franzen notes the ‘long and dazzling’ essay by Randall Jarrell that prefaces the 1965 edition, and points out ‘one very good reason to read the novel is that you can then read Jarrell’s introduction.’ The same goes for Franzen’s excellent, and lengthy, piece in the Times. The time to stop and think about what this book means is after you’ve read it.You surely won’t be able to as you read ‘The Man Who Loved Children.’ It grasps you in the strongest of grips, refusing to let you go until its perfect, dazzling, dizzying ending. Written in 1940, it is absolutely modern. Over 500 pages long, it is still spare, naked and brutal, yet replete with extremely acute observation rendered in gorgeous, precise language. The book starts with a scene of charming normality: ‘All the June Saturday afternoon Sam Pollit’s children were on the lookout for him as they skated round the dirt sidewalks of and seamed old asphalt of R Street and Reservoir Road that bounded the deep-grassed acres of Tohoga House, their home.’ Pollit is a marine biologist who works for the government, and the proud father of five children running amok in a rambling old house in a pleasantly lazy Washington, D.C., neighborhood. Lest you think you’re in an Eleanor Estes novel, Stead zooms in on a far less cozy picture. It’s ‘The Moffats Meet Blue Velvet.’A large man of overpowering whiteness, unbearably earnest, Sam Pollitt is the kind of person who takes up all the space in a room, not by getting in your face so much as by his total assurance that he is always completely right. He controls his family with a sort of benign ruthlessness, using a self-invented language of neologisms drawn from baby talk and Artemus Ward, and naïve social theory that mashes up More, Malthus and Marx. He’s cruel and scary, deviously gentle and kind of likable in the way that magnificent failures can be.You’d think such a title character would be the dominant one. But Sam’s candle merely flickers next to the fierceness of his wife, Henny, not fooled for an instant by her husband’s genial front, just barely putting up with the ugly cul de sac in which she finds herself. Nothing but bitter truth for bitter Henny, painfully honest even as she desperately seeks some kind of happiness in a tawdry affair and shopping sprees financed by worthless IOUs, sometimes issued to her own small children. Henny runs toward her own destruction with determined authority. The reader can’t look away, and her children can’t stop loving this remarkable and mysterious woman. The Pollitt children are just as endearing as those in any Estes novel, and just as authentic, managing the best they can, sometimes thriving, in this dysfunctional domestic nightmare. Which brings me to the unlikely star of ‘The Man Who Loved Children,’ sluggish, clumsy, heavyset, plodding Louisa. A dreamy young adolescent with a wealth of unrealized dreams, Louie, it turns out, has the soul and the intelligence to make them come true. And the cold-bloodedness. She’s a girl who can kill a cat and then sleep soundly. She certainly realizes that she does not want to be her father’s daughter, although she has to struggle to escape him. Louie screams out that she is the ugly duckling, and at heart, ‘The Man Who Loved Children’ is an ugly duckling story, with all the brooding darkness and calamitous, bizarre episodes that people sometimes forget are a major part of Hans Christian Andersen tales. Stead tells her tale in unforgettable prose, always framing places and people with exactly the right words and comparisons, and in unforgettable events, building in a riveting momentum, one after the other. They’re events that leave the surprised reader open-mouthed in shock, laughing in appreciation, and appalled at the hurt and sadness. Cat-killing is just the beginning.Highly recommended."}, {"userName": "Zanna", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/22591633-zanna", "userReview": "After my first day of reading this I concluded that Sam Pollit is the most extravagantly awful character I've ever met. Better acquaintance did nothing to ameliorate my first impression, so how does Christina Stead make it bearable to spend over 500 pages with him? Because Sam's awfulness, his sexism, his white liberal oblivious scientific morality is the groan-inducing, painfully familiar sort, I think. It might be exaggerated (or not – presumably people really did talk enthusiastically about eugenics in the age of 'innocent' enthusiasm about science and its methodology before WWII woke folks up. Sam's cheery invocations of gas chambers certainly ring a note sharper than irony.His thoughts ought to be unspeakable, but he not only shares them earnestly but works hard to inculcate them in the young children in his power, and if someone appears not to be attending to him, he disparages them. He wakes everyone up in the morning so that he can enjoy them and be served by them; he has no respect for the body or mind or soul of any of his children, and the examples he sets them are toxic. He kisses women he finds attractive in a magazine while the kids look on, saying how virtuous they must be and declaring that he will marry them, regardless of their mother, his wife, who begs for a separation he refuses to grant. He treats his girl-children as servants, shoe-horning the whole brood (this is a book that induces deep gratitude for reliable, affordable contraception) into gender roles at every turn. Sam is the most annoying sort of liberal, a bigot who thinks he is enlightened. His misogyny is vile, and towards his own daughter it's outrageous. I wanted to strangle the douchecanoe myself repeatedly. When he is in Singapore, CS gives us a view of him in the eyes of an Indian clerk who is working for him, Naden, and some conversation between them. You can see some of the very broad spectrum of insight and curiosity to be found reading this book here and some of CS's wit:“You know the white man, the stupid white man feels superior to those of other colours. How do you feel about that?”“They feel, sah, that the darkest races are the oldest; it is not so long since the white man became powerful. He thinks what he thinks because he is young in the world, as a child, as my child will feel when he is a two-year-old and will be butting me with his head. That cannot last very long. The Kings of Egypt were dark; all the world was dark until a very little while ago. Then the white man came from some little crack in the earth. He does not know about the times before he came. That is how we feel sah, he is an accident.”This surprising answer quieted Sam for a space; at length he answered,“This is a wrong idea you have Abishegenaden; the Egyptians were pale (coppery at best); even the very darkest among you are descended long ago from whitish or pale people like the ancient Persians. The Chinese are almost white, too, for the most part. The black man is rather rare. Do you really think, Naden, that primitive man was black? Do you think he was black and got white?”“Perhaps there were two or three primitive men,” said NadenIs Sam satire? Maybe, but it's not his cartoonish aspects, or that of the other main characters Henny (Sam's wife) and Louie (Sam's daughter from a previous marriage), that forms their appeal, but their realism, which is almost painful.I recommend this book highly to readers whose first pleasure in literature is chraracter. Sam cannot develop – he is a grotesque man-child, and Henny's development, if it can be so called, is negative, a disintegration under pressure, but Louie, abused, neglected, exploited, talented, resourceful, brilliant Louie – this is her Bildungsroman. And though it is terrible, tragic, agonising, comical, its salient quality is veracity, vividness, extraordinary depth of perception and variety of description. CS's world is chewy, relentlessly material, fleshy, redolent, unwieldy. Nothing is smooth; its texture is lumpen it is poorly mixed instant custard, it is disenfranchised masses! I can't feel just one emotion towards Louie, I must feel five at once, while I rage at Sam and Henny for the way they treat her. Reviled as a fat clumsy adolescent, Louie is actually forbearing, compassionate, responsible, resilient. She's a whole person, wretched and damaged and unique. Why aren't people reading this book? There's nothing else like it, and it's fabulous."}, {"userName": "notgettingenough ", "userReviewDate": "Sep 25, 2009", "userURL": "http://www.goodreads.com/user/show/2658311-notgettingenough", "userReview": "If Shakespeare had written this, we'd call it one of his 'difficult' plays. If Donna Tartt had written it we'd be dead from the shock. As exquisitely tailored as The Goldfinch is, this book is not. It's a meandering, repetitive quagmire. Christina Stead, who was capable of great neatness in prose, took it upon herself in this book to write as people actually live and actually speak. The result makes one realise how important the writer is to the process of making ourselves bearable in print. Writers may need editors, but they are nonetheless the front line of editing themselves. Can a writer get away with telling it - really telling it - how it is: every mundane statement, tedious repetition, tawdry detail. I'd say, based on this book, a qualified 'yes'. Rest here:http://alittleteaalittlechat.wordpres..."}, {"userName": "Josh", "userReviewDate": "Feb 08, 2008", "userURL": "http://www.goodreads.com/user/show/868037-josh", "userReview": "The greatest novel I've ever read about a certain type of family life. Stead is simultaneously intimate and expansive: it's like we're reading an adaptation of some deep myth or television sitcom. Bonus: Sam's \"little language,\" the familyspeak that swamps Hetty because her own is so much less vigorous. And that's what I love about the book. It's like Christina Stead took all of American culture and spirit, wrapped it up into a single character (Sam Pollit), and then blew it off her finger. Sam as a sort of fat Emerson (another man who loved mankind, but hated people)."}, {"userName": "C.", "userReviewDate": "Jun 30, 2009", "userURL": "http://www.goodreads.com/user/show/1425694-c", "userReview": "I have to admit that my reading of this book did not do it justice: I've been busy, and tired, and I took a big long break in the middle because I had to finish another book, and it's very long. But: it is so very excellent.I read somewhere that books about families are often shoved into a little, neglected category of their own - usually called 'domestic fiction' or something similar. I wonder if I'm not guilty of this myself, with my 'family-drama' shelf. I meant it originally for books like On Beauty and A Spot of Bother, books which I didn't particularly like, and so which I felt justified in belittling slightly by giving a label that made them sound like the sort of soap-opera I thought they were. But then, I suppose, it turned into a shelf for books about families, which this one is. At first, the Pollit family seems to be nothing particularly special - colourful, interesting, mildly dysfunctional, going through a rough patch perhaps - but the book continues and at some stage (you can't tell exactly where) the horror begins, and it intensifies as things go on and on, apparently with no end. I was inclined at the beginning not to take things seriously: it was a nice book about an interesting family, written by an underappreciated Australian Marxist woman who knew how to turn a damn fine phrase. Henny was just a frustrated housewife with an unfortunate melodramatic streak, Sam was just an overgrown child with an inflated ego, Louisa was just going through that 'awkward phase' that some girls go through. But the book progressed and they begin to rip each other apart, and it hurts, it really does. It's not a game any more, it's not family-drama, there is nothing soap-operatic about it, it is real and it is painful. The characters are so wonderful - the father, Sam, Sam-the-bold, Poor Little Sam, The great I-am, who is so idealistic, so naive, so innocent, so laughable, and yet such a loathsome monster. When he pries into his children's lives, refuses to allow them any privacy or will of their own, whistles them up in the mornings, speaks to them (or to himself) in the horrid baby-talk language he's made up, tries to force feed them with food from his own mouth! Turns Evie into a harried housewife at seven years old, tries to bind Louie to his side for the rest of her life... you hate him, hate him, hate him.\"Sam asks for everything and with the same breath asks to be admired for never having asked for anything.\" - Randall JarrellI didn't much like Jarrell's introduction, but he got a few things right.And then, poor Henny, the mother. At first she seems horrible - an old witch, one of the moneyed landowners thrust into the real world and not coping well with it, with her frayed hair and fainting fits and absurdly repetitive tantrums - but never, never, have I read anything - anything! that made me really feel like I understood what it was like to be a woman living in a world completely constructed by men. Like, I thought I understood what it was like - I thought I could imagine it, but I had no idea. What the craziness of war does to Yossarian in Catch-22, Sam does to Henny. His complete ignorance of everything that goes on in her life, of all the things she does to make the household run, that she has no money - no money to buy new clothes for the ridiculous number of children he insists on having, no money to buy food for them to eat. It drives her to distraction, to madness, and it's a credit to Stead that I could understand this so vividly. It's a picture of horror that I won't quickly forget.The last main character is Louie, the eldest daughter, the one through whose eyes we see the world. There are many things about her that are frankly unconvincing, for example the whole section that described her going to school. Schools simply don't work like that! I felt like there was something going on there, like it was a huge metaphor, something about women, something about feminism, something about women being proud of who they were and revelling in it and congratulating each other for it and there was a whole lot of oestrogen flying around and it was kind of weird, to be honest. But there is so much grandeur in her view of life! Where you are fat and ugly, but it doesn't matter because you know that there is a whole other life inside you that you show to no one. \"By my faith and hope I conjure thee, throw not away the hero in thy soul.\" To be young, to have a future that is so full of possibilities, where you can leave behind the trauma of your childhood and become whatever you want to. \"...she sometimes let them snuggle into the shawls, old gowns, dirty clothes ready for the wash, and blankets thrown over her great easy chair, hold their small parliament on the flowered green carpet, or look at all the things in her dressing table, and in what they called her treasure drawers... A child could question both father and mother and get answers: but Sam's answers were always to the point, full of facts; while the more one heard of Henny's answer, the more intriguing it was, the less was understood.\"She knows how to capture a single thought to perfection in one beautifully-turned phrase, but then follows another such phrase, and another, and another, and the cumulative effect of 527 pages of densely-packed beautifully-turned phrases overwhelms you until you are there, surrounded by the insanity of Pollitry.This isn't much of a review, but please, please read this book. I'm actually begging you. It's completely extraordinary. It deserves at least six stars but I was tired so I had to give it four."}, {"userName": "david", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/67794375-david", "userReview": "Disturbing…An uncomfortable fiction…About a family…A plausible text one would expect to find in a Woman’s Studies course in University…A look at Narcissism and its slow but alarmingly malignant effects within a household…Abuse, in its worst form, invisible…Six hundred pages about dysfunction under one roof…Prose as vexing and errant as Joyce, Faulkner.Discord, warring, struggles between 'husband and wife'-'father and children'-'mother and children'-siblings between themselves...misogyny, misandry…penury…the cancer that is silence, the silence that is cancer…the false facades we implement without thought but often by design, not only in society but in living rooms…tolerance and intolerance…boundaries…fresh air and suffocation…all behind closed doors…Kith and kin, a bus ride without democratic stops…the twins…the obese daughter…'the ugliness of a family-contrary to the commandments, lifestyle zines, our addled perception of the neighbors,' without external props…the caprices of mother…the doting, zany, intrusive father…each child’s weltanschauung…the purview from a ten-year-old, a twelve-year-old…a daughter, a son, six-year old twins…The subjective and individualized ruminations of husband and wife…The animus that exists silently, percolating, illegible…the inability for either spouse to understand the other...the grappling between hope and reality, desire and need…the acceptance, ambivalence of loss…Oh, how pitiful are we. How base are our thoughts and actions. A tale without expectations. A full-length mirror masquerading as pages. A laser into who and what we really are; less than we think of ourselves.For the reader aware of his/her fragility, weakness, smallness, insignificance. In support of the readership who owns their transgressions, peccadillos, malice-unintended or not, lack of frugal emotions, the thwarting of magnanimity.In search of escape, sci-fi, fantasy, comedy, love? Fossick elsewhere. This semi-autobiographical tale is anathema and will dissatisfy."}, {"userName": "Douglas Dalrymple", "userReviewDate": "Dec 23, 2010", "userURL": "http://www.goodreads.com/user/show/1013182-douglas-dalrymple", "userReview": "A family is a language to itself, but from dumb beginnings and single-syllables, any child of the house moves inevitably to perfect fluency. Reading Christina Stead’s The Man Who Loved Children is something like being born into the Pollit household yourself: you are mesmerized and disoriented by a dialect, a cadence, a register that mysteriously cohere to become a world. Stead’s verbal exuberance is astonishing, of a caliber (perhaps) with Melville or Shakespeare. Her characters – Sam and Henny and Louie especially – so weigh down the text that the paperback swells to ten times its size, pulpy with flesh and blood. It babbles and complains when left alone on the desk. It shouts for tea and sings and sweats and coughs on you when you open it to read.If the book has its faults – and there are plenty of people, like Randall Jarrell in his introduction (better read as an afterword), glad to point them out to you – they are nature’s own: gratuitous detail, excess of vitality, general overabundance. Rather than leaving a sloppy mess, the book manages to reproduce life where life exceeds art while still fully containing it."}, {"userName": "Rae", "userReviewDate": "Feb 16, 2011", "userURL": "http://www.goodreads.com/user/show/4989412-rae", "userReview": "I absolutely do not get the appeal of this book. How it shows up on some \"great reads of the 20th Century\" lists, I don't know. It was difficult to read and bizarre...neither in a good way.The story surrounds a dysfunctional family, but the conflicts never peak, or even simmer with appeal. The creepy father (who drives you crazy with his baby talk), carries on in oblivion while the family collapses. Many reviews indicate that the last two chapters are worth the wait; I disagree.I regret the time I invested in this book. I pushed through it in hopes of finding redemption. I was initially, and ultimately, disappointed."}, {"userName": "Theresa Leone Davidson", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/2456844-theresa-leone-davidson", "userReview": "The man who loved children could have killed all of his children, his half-witted sister, his irritating wife and himself in the first chapter and saved me lot of boredom. I can sort of see why some might like the novel; I did not. I thought it was boring. REALLY boring. You would think a novel about spouses who hate each other, the wife always threatening suicide, various other small homespun dramas thrown in, would be interesting to read. It was not. It was boring. REALLY boring. Perhaps if it had been interesting I could have forgotten all of the really annoying aspects of it. Prime example: the father constantly talks in baby talk to his kids, although none of them are still babies. I could have painted a wall, sat on a chair, and stared at the paint as it dried for a week and been more entertained. Boring! REALLY boring!"}, {"userName": "Jimmy", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/1325473-jimmy", "userReview": "I both loved and hated this book, which is fitting since it's about family! So I totally understand anybody who gives this book one star, or even abandons it. You're thrown into a large family and asked to accept things as normal which you know are not, the way the many children in the family do, simply because it’s the only way things have always been. Meanwhile, nothing happens for the first 150-ish pages. You’re just stuck inside of the worst hell with the most insufferable pieces of shit. A father (Sam) who believes in eugenics and gives long rants about killing off people who aren’t fit to survive, elaborates endlessly on his own virtues and talks constantly in a made up baby-talk. Oh yeah, and he’s a fucking racist and sexist too, but of course doesn’t realize this, he thinks he’s so kind to the lesser races and an admirer of women. He's the perfect un-self-aware character convinced of his own greatness, would never be able to see anything from anyone else's perspective. There's such purity in his portrayal that is both larger than life and totally believable. Probably one of the most horribly brilliant characters ever dreamed up. A mother who is always brooding in her own room (but who could blame her?), whines constantly about her situation, insults her children to their faces, etc. And the parents don’t talk to each other, preferring to send messages to each other through their children. “Tell your father I said this…” “Tell your mother that…”It all gets unbearably torturous, and maybe that’s the point. During the first 150 pages I kept wondering if it would ever end, if the book would continue in this fashion, with nothing happening and more unspeakable speeches and horrible insults. It's hell! And yes, it continues, but also other things start to happen, so it’s worth sticking it out. These are horrible people, but you start to see why it was necessary to live with them for those first pages, to understand that caged mentality outside of any plot, to see them for their everyday shittiness before you can fully embark on the journey that is this novel.Because you slowly are moved from being an outsider looking into the family into an insider, belonging in the family. And you hate them but you can also see why they’re the way they are. You start to understand and sympathize with them and their situation even as you hate them. Well, maybe not the father, but at least the mother and definitely the eldest child, Louisa, a daughter who acts cruelly at times, but is treated like a servant around the house and constantly called fat and ugly. There’s a lot of mixed emotion here, and Christina Stead cleverly avoids relaying it directly. We don’t get told how each insult lands, but we feel it all the more in our stomachs. When Louisa writes sonnets to her favorite teacher, or writes a play about a father and daughter (and somehow expects a positive reaction to it from her father), or when she writes an absurdist masterpiece about a horse, we understand the depth from which it bubbles forth.This is a long messy strange yet familiar journey in which you will be in painful recognition of elements of your own family, though the horribleness may come up in different forms, and you will remember how much you wanted to run away or to grow up already so that you can start your own shitty family someday which will probably be horrible as well but in new ways. Innovation baby!Update: I just finished reading the introduction (I had to take a couple days break to think about it on my own before I could attempt it) by Randall Jarrell, and it is an excellent, observant, and very fair essay on the novel. Very few introductions tell us of the flaws of a novel, so I was surprised how even handed Jarrell was, and how well he balanced those flaws against what made the novel great and also how it fits within the entire oeuvre of Christina Stead without putting too much emphasis on biography (I hate that!). So yeah, read the introduction, but not until after you've read the book and had some time to process it."}, {"userName": "Chris", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "This is a strange book. My knowledge of Australian based or influence literature is very lacking. The writer, Stead, was born down under but the book takes place in Washington. So really what is it? It reads like magic realism, but it’s not really. In some ways, Stead reminds me of Angela Carter with a slightly less dark and gothic. Then again, it reminds me of a more tragic version of Monty Python.\tThen again, another turn, it reminds me life.\tThe novel tells the story of Louie who lives with her father and stepmother who can and cannot stand each other. Henny, the stepmother, knows what drives Sam and herself, while Sam is far less sympathic though at first he might come across as more sympathy. \tThere are so many layers to this book, just as so many types of children scurry across its pages. But the writing is so rich and wonderful. There are great truths hidden the diatribes that spew forth from the mouths of the characters.\tIn many ways, it is what the Last Station should have been, far more realistic, far less romantic, and far more real. Far more female, if I can say that without being accused of being sexist. And it is in that instance, it conveys the truth of life. The truth of being the eldest, the truth of marriage, the truth of a bad marriage."}, {"userName": "Josh Friedlander", "userReviewDate": "Mar 29, 2014", "userURL": "http://www.goodreads.com/user/show/7226831-josh-friedlander", "userReview": "The one prominent critical Goodreads review of this book is by someone who gave up on it around page 130, which makes sense, because at that point I was sorely tempted to give it up myself. Sheer bloody-mindedness compelled me to continue. I'm so glad that I did. This book grows on you slowly, and, in adjusting you to the sharply realised Pollit crew, demands your complete emotional investment.The titular character is the immensely annoying patriarch, Sam, the prime factor in one's desire to put down the book - that is, until you realise what a monster he is; that his childish speech, sexism and huge egotism make living with him impossible. His wife Henny - plagued with plenty of her own issues, as becomes clear later on in the book - gave up on her marriage from the outset, spending most of her free time engaged in playing solitaire (the focus of one of the phenomenal set pieces towards the end). There are some powerful scenes where the two parents have it out, reminiscent of the Sopranos episode \"Whitecaps\" in their emotional intensity, crackling with the repressed frustration of wasted decades. There is a black thrill in seeing the toxicity of the Pollit family dynamic seep outward, starting from Sam, the oblivious source of all the trouble.Sam is self-pitying and self-centred. He takes for granted that his opinions are supremely important to the world, that he is a martyr held back by his loved ones. Anyone familiar with such a character in real life will recognise the tendency to hold forth at length about issues instead of discussing them, to flinch from criticism or see it as a personal attack, and to alternating spite and wounded humility. By contrast, the children adjust to their circumstances fairly well, as children tend to do. Ernie is calm and prudent, carefully planning out the savings in his money box and accounting for the expenses of birthday presents. Saul and the younger ones are generally cheerful, relating perfectly to their father. In this sense he does love children: young, malleable minds, eager to learn, interested in nature, accepting authority without question. But in the oldest daughter Louise he finds a resistance that curdles into hatred: his dismissal of her complexity, and insistence that she fall into his entourage of admirers, drives her into open, not quite futile, revolt.This is a challenging but beautifully written book. It requires the reader to learn about a family mostly by observing their speech patterns and chaotic daily life. Like reality TV, but less polished, it places before us regular people in whom we will see myriad things wrong, but nothing that we would know how to improve, because we know how our own relationships tend to tangle into Gordian knots of denial and dissatisfaction. Like real life, the family in the book is irreducible to simple dichotomies or pop-psychology cliches. (It was apparently based mostly on Stead's own upbringing in Australia.) At first it resists you, but eventually you begin to love its sad, well-intentioned characters, and by the time the closing sequence of events commences, bringing wave after wave of heartbreak, you are too firmly in its grip to let go. This is a big-hearted novel, which paints growing up and family life in spectacular dimensions."}, {"userName": "Squire", "userReviewDate": "Nov 20, 2014", "userURL": "http://www.goodreads.com/user/show/15986821-squire", "userReview": "I found this book difficult to get into because I began with the introduction. I found it almost unreadable and started it twice before I gave up and just dove into the book. (which was a good thing because the into contained major spoilers).But as soon as I did, I was hooked. I've never read a book that brought back memories of my own childhood in such a rush as this book did. From the sing-songy lingo of baby-talk and pet names Sam uses to control his children (bringing back the forgotten lingo my brothers and I used) to the cycle of sonnets Louie writes about her teacher Miss Aiden (recalling the mad crush I had on my second-grade teacher Mrs. Mai for instilling in me a love for an ever-increasing vocabulary) to Ernie discovering his mother's theft of his secret money box (the first time I ever encountered one of my family's skeletons), this crazy, frustrating, infuriating, painful, terrifying and absolutely beautiful novel held me spellbound. Everything in The Man Who Loved Children is over the top and over done, but that's the way it was in my family as well.In the end, this book deserves the resurgence it is experiencing, but it is a book that I admire more than I love. I read the introduction as an afterward and it made a lot more sense. I believe Jarell's assessment that it is more real than other family sagas is correct, but it is that reality that, for me, makes it more admirable than lovable."}, {"userName": "Andrew", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/442654-andrew", "userReview": "A novel I'd heard about ever since I was a kid, but never referenced outside of especially mildewy paperbacks, I read this (I'm guessing like most people on here) because of J. Franzen's essay on it. While each member of the family is quite well sketched out, it's the father figure-- as the title would imply-- who is the focus of the action, repugnant, sentimental fuck that he is, like a minor character from a really bleak Cassavetes film. It's not an easy read, and it took me quite a while to get into the groove of it. But by the time the book moved to its climax (a difficult word to use, considering how sorry-assed the whole situation is), I was hooked.Everyone talks about how this book shows a \"certain kind of family.\" Now, as much as I bitch about my own family's dysfunction, Christina Stead reminded me of that one family you always knew down the street, and why you always hesitated when one of the kids asked you over for dinner."}, {"userName": "Rose", "userReviewDate": "Aug 28, 2010", "userURL": "http://www.goodreads.com/user/show/1363667-rose", "userReview": "This is one of the great, largely unread books of (more or less) our time. Originally published in 1940, it was dismissed by both critics and public. Randall Jarrell gave it a bit of a revival in the 60s (and a perceptive introduction, reproduced in the new edition) and Jonathan Franzen recently gave the novel high praise in the New York Times Book Review, saying that its depiction of the psychological violence of family life \"makes Revolutionary Road look like Everybody Loves Raymond.\" It is a remarkable book, and it deserves readers, but those readers will not be in for an easy time. The mid-20th century's Moby Dick takes you on a voyage deep within an idiosyncratic yet absolutely convincing American family. Stead's Ahab is a man named Sam Pollit, a progressive of the Roosevelt era, a moralist, a scientist -- and believer in eugenics -- a man resolutely in love with himself, and above all, a baby-talker. His talk is not easy to take, nor is his towering self love or his zealous belief in his own righteousness. He's one of the most repugnant characters in all of literature and one of the greatest villains. The great white whale of this novel is Sam's wife Henny, a skinny, dark, implacable force of nature (her own), a mother who is trapped, hopeless, who lives a life of violence and despair. And its Ishmael is the young future genius, the ugly duckling who knows she'll one day be a swan, Louisa, Sam's daughter and Henny's step-daughter. And of course, there's a gang of kids. I sometimes felt impatient while reading this book. But the prose is magnificent, and I was swept along, and by the time I put the novel down, I felt the way I felt after reading The Brothers Karamozov, like I'd not only read something, but lived it."}, {"userName": "Lizzie", "userReviewDate": "Sep 10, 2012", "userURL": "http://www.goodreads.com/user/show/590722-lizzie", "userReview": "This was another hard book to challenge myself, like Tinker, Tailor, Soldier, Spy. I got to page 69 and I just wanted something to happen. I get it, everybody's miserable and they all hate each other. I gave up. Do I get to count it as \"read\"? I didn't mind that the characters weren't likeable, but I wanted something to happen, and I realized I was dreading opening it for my morning read on the exercise bike. So I started an easy book about trash pickers in New York (Mongo). Later I flipped through it (not even skimmed, it's too long) and read the ending. Huh.I just didn't see it as the masterpiece it's said to be. I'll read the Randall Jarrell introduction and the recent Jonathan Lethem essay in the NY Times. Maybe someday I'll be mature enough to appreciate it."}, {"userName": "Debra Hunter", "userReviewDate": "Oct 04, 2010", "userURL": "http://www.goodreads.com/user/show/3514012-debra-hunter", "userReview": "Oh, how I hated this book. I should have known when Jonathan Franzen recommended it so strongly in the NYT book review. There is not a single likeable character, and the book is tedious, unpleasant, and very hard to read. I was the only hardy soul in my book group who didn't put it down in disgust..I actually finished it. This is sad, since I probably could have read several actually good books while I wrestled with this one."}, {"userName": "Domenico Fina", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/69926492-domenico-fina", "userReview": "L'uomo che amava i bambini (1940) è un libro anomalo, quando venne pubblicato non ebbe alcun successo, anche oggi nonostante le lodi di alcuni critici le cose stanno come allora. È un libro che affatica, è intenzionalmente estenuante. Parole inventate dal marito per sorprendere i figli, filastrocche, teorie sul mondo inventate in famiglia, quasi a voler riprodurre nelle strampalate liti della famiglia Pollit, un'atmosfera da famiglia americana moderna che in realtà non esiste. La famiglia Pollit è anzitutto una creazione letteraria di una grande scrittrice. Come lo fu Auto da fé per Elias Canetti, per fare un accostamento con un libro per certi aspetti affine. Due libri dai quali ti aspetti un finale poco rassicurante. Per leggerlo ci ho messo un anno. Perché non c'è niente da fare è un libro che non si fa leggere con partecipazione e allo stesso tempo non si fa lasciare, ti richiama indietro per più ragioni, per la lingua divagante, prodigiosa e un tantinello svitata di Christina Stead, per la critica alla pedagogia familiare, suo marito un campione di retorica dei buoni sentimenti e buone azioni da impartire ai figli come fossero giovani marmotte, racconta aneddoti edificanti, li intrattiene in modo bislacco ma trasmette un mondo falso, inesistente. Sua moglie Henny, viceversa, è un campione di scetticismo verso gli uomini e più in generale verso l'intero genere umano: è un personaggio grandioso nel suo furioso sconforto. I 7 figli si trovano in mezzo ma non è un libro cupo, è un libro spesso comico. La bambina più grande (figlia del primo matrimonio del marito) osserva tutto e si rifugia in Shakespeare, scrive commedie in cui riproduce tutto ciò che vede e vive, lei è l'occhio che incombe."}, {"userName": "Steve", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/17550624-steve", "userReview": "I know this book is a product of its time, but I found this incredibly difficult to pick up, and very easy to put down. It's a classic, and everyone raves about the style of writing, which just strikes me as rambling, with paragraphs that stretch on for pages, and descriptions of everything ad infinitum. Further, the phonetic way of speaking, and attitudes of the two parents was so incredibly grating. The plot, such as it was, moved very slowly, and occasionally presented some incredibly shocking ideas, and then dismissed them without any discourse. There was no real climax as such, and even less of a resolution."}, {"userName": "Jennyfleur", "userReviewDate": "Apr 10, 2013", "userURL": "http://www.goodreads.com/user/show/4930097-jennyfleur", "userReview": "The Man Who Loved Children has long been one of my mother's favourite books, and a well-thumbed, dog-eared copy is one of my most vivid memories from childhood. And yet, somehow, I wasn't ever quite ready to read it until recently. Perhaps now I have finally stopped believing in bogeymen and monsters hiding in cupboards, and could read with some sense of detachment. There is something in Sam Pollit, a man who drags his wife and children through the most extreme of poverty, that hits close to home, and I found the novel engrossing and compelling, without finding it the easiest of reads. In his misplaced sense of superiority, he neither notices nor cares that his children go hungry and are badly dressed, and that his wife distresses herself to meet his needs. Pushed to her limits, his wife, Henny, has become bitter and hopeless. Essentially she lacks the strength of character to weather her own poverty. Sam truly believes his children adore him because they could ask for nothing more in a father, when all the while not realising that they are simply children, and know no better. He believes that he understands them like no other, while in reality he fails to meet their basic wants and needs. And as they grow into adults, the children begin to see through his fine feathers, rebelling in the way only desperate children can. And in the end, we are left wondering if that will set them free."}, {"userName": "teresa", "userReviewDate": "Nov 05, 2007", "userURL": "http://www.goodreads.com/user/show/58321-teresa", "userReview": "I am still chugging along faithfully. i am now nearly half-way through. Sam Pollit and Henny Pollit are such unlikeable characters but the book illustrates Tolstoy's claim that Happy Family are all alike but unhappy families are unhappy in their own ways. Stead's book drags you through not only and unhappy family but one might say miserable. Sam is a self-obsessed man who sees himself as a great father and lover of all fellow human beings but is so stuck inside himself that he cannot see how he mistreats and misunderstands almost everyone he comes into contact with. Henny was born to a rich Boston family but after marrying Sam and left raising the children and running the house of a man too busy living in his dreams has become a nasty, screechy, awful woman. If you have ever ran into someone who thinks that the whole world is set up as some awful farce to fuck her over you have met someone of Henny's ilk. Will I finish this book? or will it be put in the pile with Mason and Dixon and Infinite Jest of books that have called my bluff and taunt me from my bookshelves? you ain't got the stuff....you will never, ever finish us. you will die never having finished us....ha....ha...ha."}, {"userName": "Simona", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/6222130-simona", "userReview": "In \"Anna Karenina\", Tolstoj a incipit del romanzo diceva: \"Tutte le famiglie felici si assomigliano fra loro, ogni famiglia infelice è infelice a modo suo\" e conoscendo meglio la famiglia Pollit, si potrebbe dire che questa citazione è appropriata.\"Sabba familiare\" è una saga familiare di cui Christina Stead tesse benissimo le fila, fila che riflettono più un esercizio di stile che una vera e propria trama. Ciò che colpisce è il modo in cui la scrittrice entra in questa famiglia descrivendo in modo analitico il loro vissuto, il loro modo di vivere e di essere, a cominciare dal padre, un 40enne spensierato che ama i suoi figli in modo ossessivo e quasi maniacale (da qui il titolo inglese The man who loved children) sino alla moglie che vive tutto in modo molto cupo.Tutti i personaggi vivono in totale isolamento e immersi nella propria solitudine. Prolisso e a tratti ripetitivo, \"Sabba familiare\" è un romanzo di non facile lettura che non permette di empatizzare con i personaggi, che risultano freddi agli occhi del lettore."}, {"userName": "Helen", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/1933175-helen", "userReview": "Meh. 527 pages of two people hurling verbal, emotional, and physical abuse upon one another and their children. 527 pages of no growth or character development in any of them, no regrets, very little else happening. Not one likable character in the whole book. In fact, I would nominate Sam Pollit, the father, as perhaps the most despicable, evil, vile character in American fiction. Mostly because he really doesn't notice, ever, how misogynistic,racist, mean, cruel, and ignorant he is. And he spends most of the novel talking in a weird baby talk that's just inexcusable. Give me Hannibal Lector any day. With a nice bottle of Chianti. Anyway, supposedly an American classic, blah blah blah. But not worth reading."}, {"userName": "RB", "userReviewDate": "Sep 26, 2015", "userURL": "http://www.goodreads.com/user/show/44768225-rb", "userReview": "No. No. No. No. This book is a masterpiece like I am worth billions. Fans of Christina Stead's \"The Man Who Loved Children\" praise it for its realistic depiction of a large family life and her mastery of everyday speech - so what? Both my parents grew up in larger families than the one depicted here and this book does not come close to approaching what that life is like and for readers to proclaim that it gets that type of family right are simply incorrect. The wife is a snob who treats everyone like trash while expecting everyone to conform to her standards and if they don't, they're simply a terrible person and her husband - an aloof, misguided nitwit who seriously does not.stop.singing.bloody songs with his equally annoying children, save poor Louise - is nearly as unbearable. But, you might say, we don't need to like the characters: of course not. Let me provide you with a comparison: I recently watched \"Three Billboards Outside Ebbing, Missouri\" and the characters in that movie are not easy to like but I felt for them, I could relate to their struggle under their exterior actions and interior hatred, but with this novel, I just wished the worst to happen to each of them and as they go on and continue to do asinine things, like bringing yet another kid into this world and into their lives, I reached the point where I was saying out loud, \"good, destroy your life, find a new home or don't, I really could care less\". As you can probably gather by this point, this book is about a large family, so what else is there to this you might be wondering? Nothing. Absolutely nothing. If Sam name drops some scientists and politicians or gives an idealistic speech or his wife moans about how terrible everything is it does not make this \"Revolutionary Road\" or any of its imitators. There is nothing to like here save some passages describing nature and what it was like to live in Washington and Baltimore in that time. At over 500 pages long, you'd be better off re-watching \"Titanic\" on a loop for a week while you take time to stab yourself with the end of any sharp object every time James Cameron drops another bit of horrendous dialogue until you're finally rushed to the hospital due to lack of blood and finally, after all that time, the doctor brings you back on course and perhaps you get a hit of something, anything, to numb what you just went through and, for a time, hopefully, possibly, make you forget that you just wasted a large portion of your life on something so meaningless and painful when you could've been re-reading \"Blood Meridian\"."}, {"userName": "Tien", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/1396651-tien", "userReview": "This Aussie classic has been on my tbr forever! It’s Aussie in the sense that the author is Australian but the book is actually set in Washington & Baltimore areas. Unfortunately, not a book that enchanted my heart… a horrible marriage between 2 people unwilling to work together, to compromise as life partners. A horrific pulling to and fro of the children between the parents. I didn’t like the wife/mother as she is a weakling however at least she seems to be who she is but the husband, all charms and goodness (or so it seems) but such a child (as was pointed out a number of times in the novel, unwilling to grow) and his made up words used throughout the novel nearly killed me. I & my husband, of course, have some made up words we use with the kids when they are tiny but NOT whole sentences and a full conversation of them. I knew as well that things will NOT end well though the ending wasn’t really what I expected. My inability to enjoy this book was probably made worse as I was also listening to an audiobook where the husband killed his wife (true crime!); she was leaving him after 2 decades of marriage to escape his controlling & rather violent nature. I say ‘NO’ to domestic violence!"}, {"userName": "Kate.", "userReviewDate": "Jun 14, 2010", "userURL": "http://www.goodreads.com/user/show/638250-kate", "userReview": "Perhaps I was naive to be so shocked by this grotesque 1940s tale of chaos and family dysfunction set in D.C. Baltimore heiress Henrietta Collyer is married off to a zany, hardscrabble conservationist named Sam Pollit -- and what follows is an explosively unhappy (if high-yielding) marriage. I'll be damned if almost every page didn't made me cringe: the father's narcissism, the mother's hysteria, the sheer filth of their encroaching poverty, the childrens' constant suffering and neglect. It about wore me out.I picked up this book after reading this review by Jonathan Franzen in the NYT. And though the plot bobbed along slowly as trash in the Anacostia, it provided time for me to think about its greatest theme: the entrapment of its women characters by incessant pregnancy, spinsterhood, poverty,and psychological torment."}, {"userName": "Ariel", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/2144526-ariel", "userReview": "This was unbearable. The story of the most miserable marriage ever. I hadn't read an older book in a while, and I had heard it was an amazing classic, so I gave it a try. But this was not the book for me. At first I thought it was going to be funny. Christina Stead is a wonderful wordsmith. The writing style is a little like A CONFEDERACY OF DUNCES, in which the writer delights in unusual words, building up word pictures like sand castles in torrents of phrases. But the misery just overcame me midway through. It's hard to decide whom to hate more: the vicious, selfish, spoiled wife Henny who sees the world through shit-colored glasses, abuses her children (and especially her stepdaughter) and whines constantly about her come-down in life of having married a self-made made man. Or her husband who is manipulative, inappropriately needy and whiny with his children, blathers on fatuously about the joys of life and children, and basically just does whatever he wants the whole time. Argh."}], "description": "Every family lives in an evolving story, told by all its members, inside a landscape of portentous events and characters. Their view of themselves is not shared by people looking from outside in--visitors, and particularly not relatives--for they have to see something pretty humdrum, even if, as in this case, the fecklessness they complain of is extreme.", "title": "The Man Who Loved Children", "url": "https://www.goodreads.com/book/show/27909738-the-man-who-loved-children", "average": 3.58, "cover": "https://images.gr-assets.com/books/1448368907l/27909738.jpg", "reviews": 392, "authors": [{"url": "https://www.goodreads.com/author/show/76328.Christina_Stead", "name": "Christina Stead"}], "type": ["Fiction", "Classics", "Cultural", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/27909738-the-man-who-loved-children", "http://www.goodreads.com/book/show/304344.The_Man_Who_Loved_Children", "http://www.goodreads.com/book/show/18885523-the-man-who-loved-children", "http://www.goodreads.com/book/show/14744529-l-uomo-che-amava-i-bambini", "http://www.goodreads.com/book/show/24199045-sabba-familiare", "http://www.goodreads.com/book/show/16072881-the-man-who-loved-children", "http://www.goodreads.com/book/show/1902118.The_Man_Who_Loved_Children", "http://www.goodreads.com/book/show/1437766.For_Love_Alone", "http://www.goodreads.com/book/show/132508.Letty_Fox", "http://www.goodreads.com/book/show/1671759.Seven_Poor_Men_of_Sydney", "http://www.goodreads.com/book/show/2258395.The_Little_Hotel", "http://www.goodreads.com/book/show/2104153.The_Salzburg_Tales"]}