{"ratings": 36243, "userreviews": [{"userName": "Stephen", "userReviewDate": "May 29, 2011", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "A Goodreads Pop Quiz:QUESTION: What do Gilligan, Jean-Claude Van Damme, Homer Simpson and this Star Trek alien** have in common?\nANSWER (select the one that best applies):1. None of them could act their way out of a puff of smoke.2. They all starred in adaptations of Richard Connell’s famous short story “The Most Dangerous Game.”3. They are all very happy NOT to be Jan Michael Vincent.\n4. All of the above.Yes, it was an easy, soft ball of a question; the correct answer is 4. **Removing the last vestiges of doubt regarding my nerdness, the alien is \"Tosk\" from the Star Trek DS9 episode, “Captive Pursuit.”UNNECESSARY PLOT SUMMARY:Given the number of movies and TV shows that have adapted the plot of this story, I feel dumb even summarizing it. Therefore, I will be brief, like Kim Kardashian's marriage. Big game hunting expert and luminary, Sanger Rainsford, falls off his yacht in the Caribbean and winds up on the island of Dr. Moreau General Zaroff and his towering, gigantinormous Cossack servant Ivan. General Zaroff, a fellow hunter and admirer of Rainsford has grown bored with the ease of murdering even the most dangerous of big game. Removing his moral compass and setting it behind the glass of rationalization never to be touched again, the General has cured his malaise by tracking and hunting soylent green people. Next target….Rainsford. THOUGHTS:Intelligent, well-written and a lot of fun. General Zaroff is a wonderful nemesis and Connell’s development of him at the beginning of the story was impressive. He could have been content to portray Zaroff as a one-dimensional, cardboard sociopath, but Connell gives the general depth and a backstory. This does not excuse or provide a basis for acceptance of Zaroff’s actions, but it does make him relatable and thus far more sinister. He is cold, detached and brutal but he is also well educated, polite and a rugged class of gentlemen who has, if not a sense of honor, at least a sense of good sportsmanship. All of this simply makes Zaroff appear more diabolical. Rainsford for his part is tough, clever and competent and provides a suitable counter-point to Zaroff in the tale. Rainsford navigates the plot effectively and makes reasoned decisions without inducing pangs of “don’t do that idiot” from the reader. He is a more than worthy adversary for the General.Oh, and I loved the ending of the story. I thought it was appropriate and subtle and perfectly in keeping with the tone of the story. To put a line at the bottom of this review, this is a classic short story that merits the title and is one that I would politely impel people to peruse if they have not done so. Being acquainted with the plot didn’t hamper my delectation of the story and I don’t believe it will impede yours.4.0 stars. HIGHLY RECOMMENDED!!"}, {"userName": "Duane", "userReviewDate": "Jul 24, 2016", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "A man accidentally falls off a yacht at night, luckily (or unluckily) close to an ominous, dark island. He soon discovers it is inhabited by a Russian big game hunter who has become bored with his easy success, and has now taken up hunting Man as it proves to be a bigger, more entertaining challenge. Very well written and certainly deserves it's inclusion in the \"50 greatest short stories\" list."}, {"userName": "PattyMacDotComma", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/1128612-pattymacdotcomma", "userReview": "5★“‘Off there to the right—somewhere—is a large island,’ said Whitney. ‘It's rather a mystery—’‘What island is it?’ Rainsford asked. ‘The old charts call it “Ship-Trap Island,” Whitney replied. ‘A suggestive name, isn't it? Sailors have a curious dread of the place. I don't know why. Some superstition—’This is why I love short stories. It’s a wonderful, well-known classic, first published in 1924. Who needs a whole novel? Who needs The Hunger Games? I wouldn’t be surprised if this was the inspiration (but don’t quote me) if only a subconscious one. It’s a dark night when Rainsford, an experienced American hunter is aboard a yacht with Whitney, headed for new hunting grounds. Whitney comments.“‘We should have some good hunting up the Amazon. Great sport, hunting.’‘The best sport in the world.’ agreed Rainsford. ‘For the hunter.’ amended Whitney. ‘Not for the jaguar.’‘Don't talk rot, Whitney,’ said Rainsford. ‘You're a big-game hunter, not a philosopher. Who cares how a jaguar feels?’‘Perhaps the jaguar does,’ observed Whitney. ‘Bah! They've no understanding.’‘Even so, I rather think they understand one thing—fear. The fear of pain and the fear of death.’‘Nonsense,’ laughed Rainsford. ‘This hot weather is making you soft, Whitney. Be a realist. The world is made up of two classes—the hunters and the huntees. Luckily, you and I are hunters. Do you think we've passed that island yet?’”It’s not giving anything away to say NO, they haven’t. Whitney goes below to turn in for the night while Rainsford enjoys a smoke of his favourite pipe on deck. When the pipe falls overboard . . . I’ve given it 5 stars for what I think it would have been like to read it for the first time, before becoming jaded by the current overload of grisly thrillers. There was a short film also, which I haven’t seen but which is also a classic of its kind, I think.http://www.imdb.com/title/tt0023238/ This is now in the public domain and you can download it on the Goodreads page for the title.I read it years ago and was reminded of it just today. Hope you enjoy it, too!https://www.goodreads.com/ebooks/down..."}, {"userName": "Fred Shaw", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/44212467-fred-shaw", "userReview": "The Most Dangerous Game, by Richard Connell. A very short classic story published in 1924. Regardless of the length, I don't think I have been more scared by any book. The story begins as 2 friends, skilled big game hunters, are sailing in the Caribbean on their way to hunt jaguar along the Amazon River. One of the men loses his footing and falls overboard while on a moonlit stroll around the deck. What happened to him is for you to find out. I don't do spoilers! Leave it to say that you should read this in a well lit area, preferably with company or a large mastiff. The writing is incredible but horrifying. I salute Mr. Connell."}, {"userName": "Bobby Underwood", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/17994985-bobby-underwood", "userReview": "Richard Connell’s The Most Dangerous Game is one of the most enduring and timeless short stories ever penned. Its reputation is well deserved, as Connell grabs the reader instantly and spins a tale that while exciting, has broader implications than a simple adventure tale. It is probably most famous today due to the film starring Joel McCrea and Fay Wray, which was shot around the same time as King Kong and used many of the same sets. The short story, while not having the feminine character or her brother, is equally atmospheric, and terribly exciting.Big Game hunter and writer Sanger Rainsford and his friend Whitney are aboard a yacht somewhere in the Caribbean, on their way to Brazil to hunt jaguars. There is talk of a nervous crew as they pass Ship-Trap Island, a mysterious place the sailors dread. The talk of Rainsford and Whitney turns to the hunt, and it is this conversation between the two men about what the jaguar does or does not feel while being stalked that lies at the heart of this tale.Shots are fired, and in an effort to discover what is happening on deck, Sanger falls overboard, making a harrowing escape to said island. There he discovers not madness, but the ultimate extension of himself. The “hunt” which eventually ensues is tremendously exciting, the brevity of the story creating great movement in the narrative.Sanger, General Zaroff, and his towering right-hand man, Ivan, are memorable in this thrilling tale of adventure which also ponders larger questions. Connell was perhaps most successful at the short story, a slew of them published in The Saturday Evening Post and Collier’s. But he was also a journalist and screenwriter. Though Robert Riskin wrote the screenplay for Frank Capra’s wonderful film, Meet John Doe, the original film treatment was written by Connell and Robert Presell, who received an Academy Award nomination for it.Despite its age, this tale feels timeless, and is near perfect. On the technical side, there are a few typos in the transfer to Kindle, but rare, so not too distracting. A thrilling story everyone who loves the short story form should read. Marvelous stuff."}, {"userName": "Nataliya", "userReviewDate": "Apr 06, 2012", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "My favorite part of this 1924 story was a brief but satisfying cameo appearance by BORSCH, as in \"the rich, red soup with whipped cream so dear to Russian palates\". Excuse me for a second while I salivate.\n\"Great sport, hunting.\"\"The best sport in the world,\" agreed Rainsford.\"For the hunter,\" amended Whitney. \"Not for the jaguar.\"\n Rainsford is a hunter who (very conveniently for the plot purposes of this very compact story) utters statements such as, \n\"The world is made up of two classes—the hunters and the huntees. Luckily, you and I are hunters.\"\n Just a few pages later, having fallen off his yacht, he comes across a depraved Russian emigree General Zaroff. The two man share a common passion - hunting. What they don't share is the idea that Rainsford should become prey in Zaroff's boredom-induced hunting game on a secluded tropical island. Rainsford, as you can imagine, is not too thrilled. \n\"Life is for the strong, to be lived by the strong, and, if needs be, taken by the strong. The weak of the world were put here to give the strong pleasure. I am strong. Why should I not use my gift? If I wish to hunt, why should I not?\"\n The strength of the story is the antagonist. General Zaroff is a perfect villain - gentlemanly calm, brutal, sociopatically-pleasant, competent, and rather sinister in his almost-supernatural hunter skill. His attitude towards his cat-and-mouse hunting game with his prisoners is effectively chilling. This story of murder/hunt for entertainment sake may have inspired The Running Man, Battle Royale or The Hunger Games. It aged well despite being almost 90 years old (spiffy Grandpa!). The story is well-written, quick and short (only 48 pages) and has a non-contrived logical and satisfying (even if predictable) ending. \nHe had never slept in a better bed, Rainsford decided."}, {"userName": "Alex ☣ Deranged KittyCat ☣", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/13555222-alex-deranged-kittycat", "userReview": "You can listen to this story on YouTube.I've seen many film adaptations of The Most Dangerous Game, but I've never read it until now. I liked it and I think the ending was befitting of General Zaroff. He had never slept in a better bed, Rainsford decided."}, {"userName": "Pooja", "userReviewDate": "Dec 05, 2015", "userURL": "http://www.goodreads.com/user/show/30059190-pooja", "userReview": "[image error]"}, {"userName": "Candi", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "3.5 stars rounded up"}, {"userName": "Mike (the Paladin)", "userReviewDate": "Nov 05, 2010", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "I read this in college, in a \"Lit\" class. It was one of those exercises where the Professor gives you two stories and your supposed to compare them \"qualitatively\". I don't remember what the second story was, I found this one vastly superior...and really \"ticked off\" the prof. You see, I was 30 when I went back to school to get a degree and apparently didn't have the \"proper deference\" for the professor's....position. The man was an elitist snob who was impressed enough with himself for all of us anyway. I have trouble with someone who believes he can tell everyone else \"what's\" to be found in a piece of fiction. Maybe he can tell me what the writer said was in it...but to tell others what to find there still gets under my skin.By the way, I graduated with honors in spite of butting heads with a couple of profs...This is a well know story, it's been made into a movie, been used as the basis of other movies, for episodes of various TV series and copied unashamedly by hosts of writers. The rabid crazed hunter who, when people end up on his island, forces them to serve as \"game\" for his hunt. The story begins when this has been going on for a while and a well known hunter (the sane variety who hunts as it should be done) lands on the island and is in turn forced to be \"the game\"."}, {"userName": "Enchantress  debbicat ☮", "userReviewDate": "Oct 01, 2015", "userURL": "http://www.goodreads.com/user/show/12436728-enchantress-debbicat", "userReview": "I loved it!!! One of my favorite stories. Very memorable and has stuck with me for years. First read it when student teaching in 1996 in a 9th grade literature class. What a thrilling story. It has some really beautiful writing. Some of my favorites are:\"Ugh! It's like moist velvet.\" (Rainsford speaking of the night.)\"The best sport in the world,\" agreed Rainsford.\"For the hunter,\" amended Whitney. \"Not for the jaguar.\"\"Don't talk rot, Whitney,\" said Rainsford. \"You're a big-game hunter, not a philosopher. Who cares how a jaguar feels?\"\"Perhaps the jaguar does,\" observed Whitney.\"His eyes made out the shadowy outlines of a palatial chateau; it was set on a high bluff, and three sides of it cliffs dived down to where the sea licked greedy lips in the shadows.\"I don't like hunting. Personally I am an activist for animals. Rainsford's attitude is that of many. The story unfolds and without giving away much ...the plot is a fast paced and edge of seat thriller. The ending is superb. If you want a quick read and adventure story, this one will hold you til the end. My advice is to sit back in front of the fire with a drink or hot tea and hold your kitty cat tight. Enjoy the ride."}, {"userName": "Jim", "userReviewDate": "Nov 18, 2011", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "[ Rainsford's use of of his knife in the trap & his chagrin that he doesn't get the General with it. While this act heightens his & the story's tone of desperation, it's always struck a false cord with me. He had just made stakes for the pit & by using the knife, deprives himself of his only weapon. He knows that Ivan is leading, so I don't know why he would expect the General to have died. (hide spoiler)]"}, {"userName": "Pop", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/24432934-pop", "userReview": "I read this little short story when I was about 12 or 13 years old, in what we called grammar school, some 50 years ago. It has always been in the background of my memory as a story that gave me the desire to read and explore the world of literature. I had to reread this again, and thanks to Bobby Underwood I remembered this great classic and found it. Thanks Bobby, it was a fun read, one I'll probably read again sometime if I live long enough. It is a masterpiece of classic literature IMHO. Maybe l'm just being nostalgic in my Old Age. I hope not, it was a great re-read and I enjoyed it immensely!"}, {"userName": "Sarah Marie", "userReviewDate": "Aug 28, 2012", "userURL": "http://www.goodreads.com/user/show/6515737-sarah-marie", "userReview": "The Most Dangerous Game by Richard Connell5 stars (Originally 4.25 stars) Update: It's been almost five years since I read this short story as a freshman in high school and recently I read Zodiac by Robert Graysmith. Since becoming familiar with the killings the Zodiac executed, as well as the possible ones he may have committed, I wanted to reread this short story. Zodiac pretty much copies all of Zaroff's obsession with hunting humans. It's quite fascinating to read such an old short story that has hints of the psychological stamping that most serial killers have: a hatred of others (he is the same race and background as Ivan and undermines his intelligence), feeling superiority, the need to dominate. It's a very interesting story, but it sets me on edge and I feel dirty reading it. Sometimes it's too much to be close to those who have no caring for human life. I do still enjoy the story and highly recommend it. Connell captures a lot within a few pages and sets up a remarkable story. Even more interesting is the implication of killers. Are men of war serial killers? Does killing someone who is hunting you constitute as murder and how is that any different from an animal killing a person to save itself from death? Is survival of the fittest a real concept when it comes to free will or does it kick in when we are on the brink of death? These are interesting questions posed by this short story and I don't know the answer to one of them. I think that's what makes this story so relevant even today. Whimsical Writing Scale: 4.5Villain Scale: 5Character Scale: 5Plotastic Scale: 5Original ReviewThe Most Dangerous Game is a short story about a hunter who falls overboard and ends up on an isolated island where he discovers a mansion that looks like a castle. The owner of the mansion is a hunter as well and he wants to hunt play the most dangerous game with Rainsford. I had to read this for school and was surprised by how much I enjoyed it. It’s a wonderful short story with vivid pictures of the island and the way the story is told is suspenseful. Even though from the very beginning my class started guessing at what was going to happen (I was hoping cannibals and a human sacrifice) and though most of us seemed to have a valid or close guess the story was still enjoyable. I feel immature for saying this but I laughed at how Rainsford ended up becoming shipwrecked. I mean me and my friends were pretty much making fun of him for about the rest of class. I would recommend The Most Dangerous Game if you’re in for a short read and one that’s entertaining and somewhat suspenseful."}, {"userName": "alyssa ♛ semi-hatius ", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/56485897-alyssa-semi-hatius", "userReview": "Definitely a very intriguing and thrilling read for me! Though it could've been a little longer because it took me only 10 minutes to read this XDRecommends It For: Someone looking for an extremely short read with a bit of horror, thriller, excitement, and just a whole lot of awesomeness!"}, {"userName": "Sara Santos", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/18775374-sara-santos", "userReview": "Interesting premise, if it was a full book not a short story."}, {"userName": "Sara", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "This was not a new story for me. I read it years ago, probably in high school. I cannot recall the reaction I had then, and this is one of those tales that you cannot react the same way once you know the outcome.It does spark some interesting thoughts about putting yourself in someone else's shoes. I liked this line:Sometimes I think evil is a tangible thing--with wave lengths, just as sound and light have. An evil place can, so to speak, broadcast vibrations of evil.\"I'm not sure an evil place broadcast's vibrations of evil, but I do know that we have a tiny voice in our heads that will warn us when we are in the presence of evil. I have heard that voice, and sometimes even though it is muffled, it is there, hoping it will not be ignored."}, {"userName": "Tiffany Neal", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/2916079-tiffany-neal", "userReview": "Oddly enough, this morning my husband and I were watching a show on Robert Hanson, the serial killer that hunted and murdered women in Alaska as if they were prey. That led to a discussion about a book that he remembered reading (I use that term loosely, since he is not a big reader, but more of a skimmer) back in high school. He couldn't remember the name of the book, but he swore it had something to do with games (he even suggested The Hunger Games at one point - lol) and there was a picture on the inside that had a scope and a deer. It was bothering him so much that he couldn't figure out what the name of the book was, so I googled \"book where man hunts people\" and found this, and to my excitement, I was able to download and read it for free. This was written way back in 1924 and the topic of humans hunting humans (which I wonder if it was any inspiration for Suzanne Collins) is one that has been brought up in many different books, movies, and tv shows, so the storyline was obviously predictable. Even so, it was extremely eerie because of the man hunting. He was such a calm, calculating individual which makes his hunting human sport that much more creepy. The setting, the characters, the writing, and the subtlety of the ending is one that more authors might want to look in to. I enjoyed reading this because it reminded me yet again how so many authors choose to declare their readers too stupid to figure out what is going on and spell every little detail out instead of hinting at it and letting the readers figure it out on their own. Overall a good, solid, creepy classic."}, {"userName": "Allison Tebo", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/60149806-allison-tebo", "userReview": "Classy and chilling at the same time - a fast paced adventure full of atmosphere and set on a claustrophobic setting. Also an interesting commentary on how man without God--living with an evolution based mindset--sinks into the sickening mindset of viewing humans as animals and prey to be hunted down and destroyed. Because of the intense subject and some violence - this short story is best for older readers."}, {"userName": "Karla", "userReviewDate": "Nov 18, 2011", "userURL": "http://www.goodreads.com/user/show/2846441-karla", "userReview": "It's been awhile since I've seen the 1930s movie version with Joel McCrea, but I think I like the story better by virtue of the lack of padding that was done to make it a feature film. The story itself is a lean and mean little tale of terror, with a simple moral of hunter becoming the hunted and a final sentence that caps it off brilliantly."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Jun 30, 2009", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "I always loved the 'pulpy' type stories we had to read in school more than the serious, cerebral ones. This is a favorite. I loved the irony of the situation faced by the characters in this book: the hunters becoming hunted. Really thrilling, yet short read."}, {"userName": "Zuky the BookBum", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/37830213-zuky-the-bookbum", "userReview": "So. Many. Short. Stories.Sometimes these kinds of weird, old school, random books really hook me, but I can't explain why. This is one of them. This story has the most simple of plot lines, yet it does so well to inflict fear and excitement into the reader.I loved the writing. I loved the tension. I loved the plot. I loved the psychopath. I loved the ending."}, {"userName": "F.R.", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/1309606-f-r", "userReview": "So, the hunter becomes the hunted….What we have in ‘The Most Dangerous Game’ is a fun, old fashioned, boy’s own tale. A big game hunter (who, in an opening more comic than its supposed to be, leans too far over the rail of a boat and drops into the ocean – which hardly suggests the steely-eyed precision we’re supposed to expect from this character) finds himself the prey of a madman on a deserted island. The dialogue is clunky and the prose can be kindly called basic, but the sense of by-gone adventure inherent in the tale is such that it's impossible not to be swept along.In other hands this would be a ‘the evils of hunting’ story, but that’s not really the way this shakes out. Instead, if there is a moral to this story, it would seem to be that when Western machismo meets Eastern machismo, Western machismo wins. That’s just the kind of unapologetic, manly tale ‘The Most Dangerous Game’ is."}, {"userName": "Marianne", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/5067228-marianne", "userReview": "The Most Dangerous Game is a short story by American journalist and author, Richard Connell. Rainsford is on a boat with Whitney, headed south to do some big game hunting in the Amazon. But a slight accident sees him swimming for shore, and shore is an island known on old charts as Ship-Trap Island. There, encounters a strange fellow and soon finds himself in an unenviable position. A classic short story with quite a twist at the end."}, {"userName": "Jack Marryatt", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/71482784-jack-marryatt", "userReview": "This was a very interesting book, and a quick read. The book was slowly getting more interesting page by page which made me want to read more each time. Richard Connell could have wrote the book a little farther back to give the story more details but it was good none the less. I did enjoy the ending, it was unexpected and had you wanting to read more. Very good book if you are looking for a short read!"}, {"userName": "Diane", "userReviewDate": "Mar 04, 2012", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "Short stories are an underappreciated art form. Most people praise long novels for their ability to hold a reader's attention and create a graceful story arc, but I think it's just as challenging to tell a fully developed story in a small number of pages. \"The Most Dangerous Game\" is one of those short stories that stays with you for years after you have read it. I put it in the same class as Shirley Jackson's \"The Lottery,\" which is another story you can never forget. Connell's story is one you have probably seen adapted in a movie or TV show, in which a skilled hunter is shocked to learn that he has become the prey and that a sadistic hunter is tracking his every move. Our protagonist has to keep his wits and outsmart his pursuer if he wants to survive.I recommend reading the original Connell version, which was first published in 1924 in Collier's Weekly magazine. It's a tight, well-constructed story that you'll read in one sitting because you have to find it how it ends."}, {"userName": "Kerrie", "userReviewDate": "Nov 27, 2011", "userURL": "http://www.goodreads.com/user/show/3202093-kerrie", "userReview": "I don't often read things in one sitting, but this was an excellent half hour. The classic story that has been done to death since it's publication in 1925, but it still packs a powerful punch. Very clean, sparse prose with nothing wasted. Apparently this is popular required reading in middle school (according to Wiki, anyway) which is odd considering the subject matter even though it isn't violent in the slightest. My public library cataloged this as a children's book, so I was somewhat confuzzled about that!"}, {"userName": "Will \"The Ramen Man\" Lanham", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/71478820-will-the-ramen-man-lanham", "userReview": "This book is a very good book. It is quite interesting because of the way it ends. It stats that Rainsford has never slept in a better bed. This makes us infer that General Zaroff has lost the \"duel\" in between Rainsford and him. He says that the person that loses the duel will be fed to the hounds and the winner will sleep in the most comfortable bed imaginable."}, {"userName": "Bettie☯", "userReviewDate": "Jan 04, 2015", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "[Bettie's Books (hide spoiler)]"}, {"userName": "Linda", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/5346734-linda", "userReview": "I wish that I could have experienced this book with the same sense of surprise as someone reading it when it was first published. Although, I don’t think that I’ve read it before, it is so much a part of pop culture that the story didn’t heighten my senses or give me a feeling of anticipation. I bet this story was a delight in 1924.The Most Dangerous Game is certainly worthy of its distinction of being an outstanding short story. It tackles timeless themes. General Zaroff is a colorful villain countered by a solid protagonist, and the plot is interesting. There is really not much more you can ask for in less than 50 pages."}], "description": "The Most Dangerous Game features a big-game hunter from New York who becomes shipwrecked on an isolated island in the Caribbean and is hunted by a Russian aristocrat.", "title": "The Most Dangerous Game", "url": "http://www.goodreads.com/book/show/157076.The_Most_Dangerous_Game", "average": 3.92, "cover": "https://images.gr-assets.com/books/1386885674l/157076.jpg", "reviews": 1164, "authors": [{"url": "https://www.goodreads.com/author/show/90864.Richard_Connell", "name": "Richard Connell"}], "type": ["Classics", "Short Stories", "Fiction", "Horror", "Academic"], "outlinks": ["http://www.goodreads.com/book/show/157076.The_Most_Dangerous_Game", "http://www.goodreads.com/book/show/25880935-the-most-dangerous-game", "http://www.goodreads.com/book/show/31743884-the-most-dangerous-game", "http://www.goodreads.com/book/show/30059258-the-most-dangerous-game", "http://www.goodreads.com/book/show/249184.The_Most_Dangerous_Game", "http://www.goodreads.com/book/show/22940668-the-most-dangerous-game", "http://www.goodreads.com/book/show/18307281-the-most-dangerous-game", "http://www.goodreads.com/book/show/10899958-the-most-dangerous-game", "http://www.goodreads.com/book/show/157079.The_Most_Dangerous_Game", "http://www.goodreads.com/book/show/157075.The_Most_Dangerous_Game", "http://www.goodreads.com/book/show/5978278-the-most-dangerous-game-and-other-stories-of-adventure", "http://www.goodreads.com/book/show/20959240-the-most-dangerous-game", "http://www.goodreads.com/book/show/8282266-the-sin-of-monsieur-pettipon-and-other-humorous-tales", "http://www.goodreads.com/book/show/35876450-delitto-in-mare", "http://www.goodreads.com/book/show/16040852-what-ho", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}