{"ratings": 9874, "userreviews": [{"userName": "Jose Puttanani", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/24358181-jose-puttanani", "userReview": "Awesome is the word for this book. This is a book from a person with high IQ, likely to be over 120. Here are my reasons: (1)The story unfolds within a period of one year with a large number of charecters playing their role. Frederick Forsyth has shown an unparelleled skill in crafting their roles carefully and the timing for bringing them into the story. (2) His understanding of US, Europe and Middle East is so great that places and cultures fit very well into the story line. (3) The story is not just interaction between humans, but governments, particularly the police and secret services, and writing a story on such a not so known platform neeeds much more than superficial knowledge. Great Work."}, {"userName": "Deepak Eshwar", "userReviewDate": "Aug 24, 2012", "userURL": "http://www.goodreads.com/user/show/12163813-deepak-eshwar", "userReview": "Read it for Quinn the main protagonist. This novel is spine chilling with twists and turns, that will make you lose your way deep inside the novel. When you come out of it, you ll feel like the one who built the maze. Hats off to \"the master story teller\"."}, {"userName": "Bob", "userReviewDate": "Feb 11, 2011", "userURL": "http://www.goodreads.com/user/show/2401232-bob", "userReview": "A 1998 Forsyth thriller has the US and Russia worried about the supply and cost of oil which is pushing $20 a barrel. The US President and Russia’s Gorbachev are about to sign a disarmament treaty that has Military hardliners on both sides angry at loss of funds and material. A US oil Barron who talks to God and gets personal responses has gathered a group of oil men and industrialists, all who stand to loose big money if the treaty goes through, in a plot to get the US President out of office.When the President’s son is kidnapped in England, the White House contacts a retired American who had great success in negotiating hostage releases. Going by the sole name of Quinn, this negotiator reluctantly agrees to help with the recovery, but only if is allowed to do it his way. This is reluctantly agreed to, but certain members of the US task force have doubts and suspicions which at times compromise Quinn’s efforts. This tale ranges from England to the US and Europe in non-stop action. Kept me up late last night to get it finished."}, {"userName": "José Luis", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/5788254-jos-luis", "userReview": "https://30dediferencia.com/2016/07/31...Leer un libro de Frederick Forsyth es enfrentarte a una lectura con acción, con muchísimo ritmo, con unos personajes algo estereotipados, sin demasiada profundidad, pero ¿buscamos eso o entretenimiento sin más?Una historia en la que se mezclan personajes reales (Margaret Thatcher o Mijail Gorbachov), supongo que con la idea de hacer más creíble la historia, con un presidente de Estados Unidos ficticio y que trata temas muy actuales en la época en la que fue escrito el libro, como por ejemplo la Perestroika. El mundo pasa por una situación complicada y los dos líderes mundiales, presidentes de las dos grandes potencias, apuestan por el desarme y por poner límites a los gastos militares entre otras razones porque no hay más dinero… Son la excusa perfecta para llevarnos a través de un thriller de ritmo trepidante, algo lento quizás al principio, con su punto culminante en la negociación para liberar al hijo de presidente de los Estados Unidos y es ahí donde comienza de verdad la historia, una caza sin cuartel y sin piedad de todos contra todos y donde te puedes encontrar con los amigos más insospechados. Una historia bastante entretenida y recomendable para los amantes de este género literario.Un pequeño detalle antes de terminar, la traducción de la historia me pareció bastante floja, curioso como llaman al avión del presidente de los Estados Unidos, el Air Force One… y además encontré bastantes erratas a lo largo del texto, algo totalmente incomprensible cuando hay una editorial de prestigio, como se supone, detrás.El libro, como decía al principio, está comprado en Amazon y voy a contar un pequeño detalle, otras tiendas y me refiero a Lektu por ejemplo cuando compras un libro digital si este sufre modificaciones por parte de la editorial te hacen llegar un correo avisándote de que puedes descargarte la nueva versión de forma totalmente gratuita como no podía ser menos. A veces los más grandes tienen mucho que aprender de los pequeños (sólo en tamaño)."}, {"userName": "Ram", "userReviewDate": "Mar 04, 2011", "userURL": "http://www.goodreads.com/user/show/1125607-ram", "userReview": "Just finished reading \"The Negotiator\" by Frederick Forsyth, an international espionage thriller involving more than a dozen countries and a plot that keeps you riveted to the book. Brilliant."}, {"userName": "Benjamin Thomas", "userReviewDate": "Nov 25, 2011", "userURL": "http://www.goodreads.com/user/show/4209082-benjamin-thomas", "userReview": "I pulled this one from my book store because I was looking for a Cold War era thriller and have not yet read much from Mr Forsyth. I understand that he does an enormous amount of research for his books and that certainly showed here. This was a well-though out novel and well-structured even though it suffers from amazingly bad publishing timing. It was written in the late 1980s and the traditional Cold War relationship between the US and USSR continues throughout the novel. Of course the author could no more see the incredible events of 1989 (the Wall coming down, the desolution of the Soviet Union, etc.) than the rest of us.I was a little worried as I read the first several chapters as the author spends a lot of time building the background for the story. We get a lot of back story on numerous characters, including high ranking politicians in both countries as well as businessmen, Senators, etc. but it was unclear just who the POV character would be. It isn't until around page 100 or so that we meet Quinn, the Negotiator himself and the novel settles down into a nice coherent plot. On the surface, the story centers around the kidnapping of the US president's only son but there is so much going on here that it is not at all predictable. Very enjoyable and now, of course, I want to read more from this author, especially his more famous works such as \"Day of the Jackal\"."}, {"userName": "Jim Puskas", "userReviewDate": "Nov 12, 2013", "userURL": "http://www.goodreads.com/user/show/7429967-jim-puskas", "userReview": "Quinn is much more than a negotiator: he's also a highly trained and experienced commando, typical of Forsyth's central characters. Of course, in a Forsyth novel things are never quite what they seem; we're never quite sure who can be trusted and who the traitors are. As usual, Forsyth introduces a large cast of characters, whose lives intersect in complex ways.One minor quibble: Forsyth's research, usually impeccable, is a bit suspect in his depiction of winter in the hill country of Vermont as extremely frigid, almost od arctic proportions; setting that episode in North Dakota would have made more sense. But in most respects this is a typical Forsyth adventure, complete with incompetent FBI agents, scoundrelly politicians, evil, sadistic villains and KGB operatives who can work both sides of the street when it suits their purposes.Not up to Forsyth's best such as The Devil's Alternative etc. but a very engaging read."}, {"userName": "Stefan", "userReviewDate": "Sep 07, 2009", "userURL": "http://www.goodreads.com/user/show/851219-stefan", "userReview": "The first two chapters of The Negotiator were very slow and uninteresting and I feared that this would be a tedious read. Fortunately, the pace began to pick up and I became immersed in the story. The plot contains several sub-plots (all of which are satisfactorily wrapped up in the conclusion), a number of interesting characters (notably the protagonist, Quinn), a number of neat settings (Vermont, Washington D.C., Corsica, Germany, the Netherlands, France, Russia, Texas, and others, all of which are described in vivid detail), and dialogue which was superbly crafted. This novel is far above most books in the thriller genre because of its intelligent and gripping narrative."}, {"userName": "Randy Pradhana", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/23587792-randy-pradhana", "userReview": "Saya mulai menyukai pengarang ini, segala detail yang terkait dengan hubungan, intrik, maupun konspirasi internasional, teknik negosiasi, teknik spionase dijelaskan oleh Forsyth di buku ini. Beberapa orang menganggap novel-novel yang dibuatnya merupakan \"investigative journalism in fictional guise\", mengambil hal-hal yang nyata terjadi, pernah terjadi, atau bisa saja terjadi yang diblurkan dengan cerita fiksi dan gabungan antara karakter nyata dan fiksi.Sebuah novel yang sangat informatif dari mantan agen MI6 ini, tapi saya rasa novel ini bukanlah novel terbaiknya."}, {"userName": "Umang Chhawchharia", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/57068091-umang-chhawchharia", "userReview": "The book was excellent, a typical Frederick Forsyth masterpiece.... It gave me new insights into the oil scenario of the world, the vanity and selfishness of American companies in and about kidnapping in high profile cases..... Also how the inner functions of the American and British bodies like the COBRA work..In all an awesome book, a fun read, and recommended to all ...keep reading :)"}, {"userName": "Kanna", "userReviewDate": "Jun 05, 2009", "userURL": "http://www.goodreads.com/user/show/2354613-kanna", "userReview": "Superb.... awesome.... what else can I say.... What a suspence.... what a narration..... At the beginning it looks like a boring novel but after some 20 pages the momentum gains and after that, whenever I found some free time available, I read it."}, {"userName": "Marija", "userReviewDate": "Jul 04, 2015", "userURL": "http://www.goodreads.com/user/show/25293314-marija", "userReview": ""}, {"userName": "Rajan", "userReviewDate": "Jul 18, 2015", "userURL": "http://www.goodreads.com/user/show/11662595-rajan", "userReview": "Very intelligent book. Highly enjoyable."}, {"userName": "Chetan", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/6035200-chetan", "userReview": "Clear 5 for Frederick Forsyth... I like his books, the reason being he writes fiction.The way he moves you along with the story is wonderful."}, {"userName": "Marcy Speer", "userReviewDate": "Oct 22, 2012", "userURL": "http://www.goodreads.com/user/show/13481592-marcy-speer", "userReview": "I did not expect to enjoy this tightly woven novel but I could hardly wait to turn the page."}, {"userName": "Robbie", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/10450152-robbie", "userReview": "Haven't read a bad Forsyth book yet. You'll love this one!"}, {"userName": "Bronislava Sencakova", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/22310109-bronislava-sencakova", "userReview": "Chronologické rozprávanie o jednom spiknutí s viacerými motívmi a cieľmi z obdobia konca studenej vojny (cca 1989 až 1991) s občasným výskytom suchého britského humoru. Veľa postáv, veľa stretnutí, telefonátov, zločincov, silových a spravodajských zložiek - plus jeden vyjednávač, jeden americký prezident a jeden Gorbačov.V hlavnej úlohe známy štvorlístok: politika, obchod, moc a prachy. Geografické kulisy: USA, Sovietsky zväz, Saudská Arábia, UK, Irán. Každá postava primerane uvedená na scénu, každá scéna podaná v súvislostiach. Ak boli potrebné fakty, dostali sme prehľadný brífing o geopolitickej situácii či rozbor moslimských teroristických nálad a hnutí. Čiže aj geopolitická lama ako ja mohla vďaka tomu mať z tejto knihy maximum :)Zaujalo ma, že:- už koncom rokov 1980-tych existovala hlasová databáza. (Ale tá asi existovala od vynálezu magnetofónu.)- mladý Američan Simon v jednej scéne na Oxforde preberal so svojím profesorom husitov.- Hizbaláh (pred transformáciou na politickú stranu) mal sídlo v Iráne. Lebo Wikipedia udáva Libanon.- sa spomínali československí teroristi. Pokiaľ viem, tak Československo nemalo vlastných teroristov, len poskytovalo zbrane a údajne aj výcvik.Druhá kniha v poslednej dobe, v ktorej sa (okrajovo) vyskytli európski žoldnieri z de-kolonizačných afrických vojen (po druhej svetovej) - tou prvou bola wallanderovská Pátá žena. O Afrike a jej osamostatňovaní neviem skoro nič. Ale už som spomínala, že som v tomto lama :)Goodreads výzva 2018:48. dočítaná kniha"}, {"userName": "Warren", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/30844201-warren", "userReview": "Frequently wooden, occasionally terrible, prose; rather too much tell-not-show; an excess of cardboard characters; a big fat cliche involving a pretty FBI agent who wins the hero's heart; the road map of Europe described in excessive detail... this book is full of faults.BUT! It's a cracking story! The pace, slow at first, builds to a fabulous crescendo. Forsyth's dialogue is crisp and on point, the way people actually talk. The twists keep you turning the pages until way past your bedtime. The research and detail that sometimes bog the book down also give it heft and substance, and you feel as if you've learned something from reading it. I ended up enjoying it far more than I thought I would at the start."}, {"userName": "Jitse", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/27574170-jitse", "userReview": "3.5 stars. Decent Cold War intelligence novel: a good easy read, but the ending missed a climax and didn't tie all the different story lines together as much, while they were carefully built-up. Characters were a bit stereotypical, but not in an annoying way. Good novel to take your mind off of things in the holidays"}, {"userName": "Diane Anderson", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/52789682-diane-anderson", "userReview": "This book took a little while for me to get into it.......I almost gave up! But it's Frederick Forsyth!! so I persevered and was very happy I did. Very interesting story with some twists and a clever plot."}, {"userName": "David", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/35591874-david", "userReview": "Too long. So many cinematic twists..."}, {"userName": "Helen Elias", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/59131000-helen-elias", "userReview": "I enjoyed the book but found the spelling mistakes annoying. A spell check had been used instead of a proof reader so some sentences were rubbish."}, {"userName": "Víctor Arturo Mercado Fernández", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/8705648-v-ctor-arturo-mercado-fern-ndez", "userReview": "Una novela llena de acción e intriga con giros bruscos y resultados inesperados que mantienen al lector al borde de la silla desde el principio. Lo usual del autor."}, {"userName": "Shivang Nagaria", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/57833868-shivang-nagaria", "userReview": "Realistic, trilling, detailed."}, {"userName": "Lis", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/50818506-lis", "userReview": "Un bel thriller: non ai livelli di Quarto protocollo o de Il giorno dello sciacallo dello stesso autore ma resta comunque un romanzo scorrevole e godibile."}, {"userName": "Richard", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/28010956-richard", "userReview": "One of his better books. Toured Europe, great conspiracy."}, {"userName": "David Alonso vargas", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/13088915-david-alonso-vargas", "userReview": "Magistral. Te tiene en vilo desde la primera hasta la última página! Forsyth en estado puro."}, {"userName": "Pawan Chahar", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/45190970-pawan-chahar", "userReview": "Just the kind of book I wanted to read during my laid back holidays."}, {"userName": "John Uzzi", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/3775263-john-uzzi", "userReview": "Very engaging. I did figure it out but it moved right along"}, {"userName": "Hemant Joshi", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/45259366-hemant-joshi", "userReview": "Love the way how Frederick Forsyth details the story through the middle and keeps the grip till almost the end of the book."}], "description": "Frederick Forsyth,  master of the international thriller, retums with  an electrifying story of a man of immense power and  a conspiracy to crush the President of the United  States. Only one man--Forsyth's most  unforgettable hero yet--can prevent the plan from succeeding.  His name is Quinn. He is the  Negotiator.President Cormack is  bent on a signing a sweeping U.S.-Soviet  disarmament treaty, and the master conspirator is  determined to stop him. The kidnapping of a young man on a  country road in Oxfordshire is but the first  brutal step in the explosive plot engineer the  president's destruction. Enter  Quinn.  Quinn plays the  kidnappers like a master musician. . . until, in a shocking  tumabout, he discovers that ransom was not their  objection after all--and that he has been lured  into a cunningly woven web. Now he must draw upon  his deepest strengths--to save not only the victim  but the entire free  world.", "title": "The Negotiator", "url": "http://www.goodreads.com/book/show/109510.The_Negotiator", "average": 3.96, "cover": "https://images.gr-assets.com/books/1320493289l/109510.jpg", "reviews": 178, "authors": [{"url": "https://www.goodreads.com/author/show/36714.Frederick_Forsyth", "name": "Frederick Forsyth"}], "type": ["Fiction", "Thriller", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/109510.The_Negotiator", "http://www.goodreads.com/book/show/65426.El_Negociador", "http://www.goodreads.com/book/show/18658277-the-negotiator", "http://www.goodreads.com/book/show/22860184-vyjednava", "http://www.goodreads.com/book/show/922077.The_Negotiator", "http://www.goodreads.com/book/show/13553119-de-onderhandelaar", "http://www.goodreads.com/book/show/19174357-the-negotiator", "http://www.goodreads.com/book/show/9553294-il-negoziatore", "http://www.goodreads.com/book/show/9697440-el-negociador", "http://www.goodreads.com/book/show/540020.The_Day_of_the_Jackal", "http://www.goodreads.com/book/show/149572.The_Odessa_File", "http://www.goodreads.com/book/show/327255.The_Fourth_Protocol", "http://www.goodreads.com/book/show/460717.The_Dogs_of_War", "http://www.goodreads.com/book/show/825473.The_Devil_s_Alternative"]}