{"ratings": 5679, "userreviews": [{"userName": "Julie", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "The Night the Lights Went Out by Karen White Is a 2017 Berkley publication. Karen White reigns supreme when it comes to modern day southern fried storytelling. I love Karen White’s novels, so it’s fair to say I’m a little biased when it comes to her books, but this one is really special. Marilee and her two children are uprooted from their lives after her husband, Michael cheats on her with their child's third grade teacher. Moving to Sweet Apple, Georgia, Marilee rents a cottage from a gruff elderly woman everyone calls ‘Sugar’. As Marilee gets settled in, she meets the other mothers in town, forges friendships, and may even have a love interest. But, one of the most important relationships she cultivates is with Sugar, as the two women begin sharing a type of quid pro quo confession of their painful past and sins, while unearthing a few old mysteries and solving a crime along the way. There are books I enjoy, books that touch me or move me, books that make me laugh, or keep me on the edge of my seat. Some books combine all those elements, like this one did, but few of them hit all the notes with perfect tone and pitch and harmonizing, quite like this book did. I haven’t read a book like this one in a long time and I really, really, really needed this kind of story. While books often focus on marriages, romance, and relationships within the family, allowing friendship bonds to lurk around the surface, this book places friendship front and center, and teaches a few valuable life lessons in the process. We all have regrets, have all made mistakes, suffered painful losses, some more than others, and confession can be good for the soul. This is something Sugar discovered, albeit kicking and screaming and determined not to allow anyone to melt that carefully constructed exterior she hides behind. Marilee finds in Sugar a dependable friend, a mother figure, and an unlikely kindred spirit. Sometimes, we still, even well into adulthood, seek approval, a salve for our loneliness, and a way to seek redemption for things we wish we could take back or redo, which is something Marilee goes through in this novel, while Sugar watches from the sidelines, ready to step in if and when necessary. The characters in this book are going to stay with me for a long time. They are so well crafted, realistic and vivid I would swear they came to life. The plot is amazingly well crafted, quirky, emotional, witty and humorous, but also suspenseful and edgy. The southern setting is a Karen White trademark, and as I've said many times before, there is just something about a story told with a southern flair that pronounces everything, from the food, (cookies in this case), to the scenery, to the dialogue. Karen White has that flair down to a science, and this novel is no exception, in fact, it’s exceptional. In other words, this story has something for everyone, and can be read by anyone, and enjoyed by all, and is the type of story that is good for your soul. I loved it! So, you’ve heard me gush long enough. Go forth and pre-order this book, you won’t regret it!"}, {"userName": "PorshaJo", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/5464046-porshajo", "userReview": "What a fun read just full of Southern charm! There is an author who writes about the South and I love her books but I've read all but one. So I was looking for another author who gives you that fun, chicken-soup-for-the-soul read. This book just fit the needs for me. I bugged my library for the audio after reading the wonderful review by Norma on this one.The Night the Lights Went Out is told from three points of view. Merilee, a recent divorcee under scandalous circumstances, Sugar, the stubborn, firecracker landlord of the property that Merilee moves into with her children, and an anonymous blogger who dishes out gossip on the locals. Many who wish they are not mentioned in this blog. The story takes place in Sweet Apple, Georgia. Come on, with a town name like, that you know your in for a story. When the point of view switches to Sugar, it goes back in time and you learn of her past. What makes her that spunky, Southern woman that she is today. So many Southern saying explained and rules that women in the town must follow. Don't get me wrong...it wasn't all fluff. There was revenge, deceit, and murder involved too. Let's just say this one takes the concept of 'Mean Girl' to a whole new level.I listened to the audio narration and it was wonderful. The two narrators had the heaviest Southern accents and it was perfect for the book. There was a third narrator, but the accent wasn't the same as the others. Oh there were times I laughed out loud at this one. Now, it is a bit predictable but I was not disappointed in this one bit. Merilee was a dunce for most of the story, when you can see what is going on, but she just can't. I will have to say, I was completely shocked by who the blogger was as I had thought of it being someone else. A fun read that I would highly suggest if you just want to relax and laugh and forget about what is going on for a bit."}, {"userName": "Pouting Always", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "[ Sugar ended up being behind it  (hide spoiler)]"}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "This was an impressive first book for me by this author and a delightful listen with enjoyable narrators that was entertaining and filled with southern charm! I will definitely be reading more books by this author.THE NIGHT THE LIGHTS WENT OUT by KAREN WHITE is a relaxing, comforting, and amusing women's fiction and suspense/thriller novel that had me totally engrossed and savouring every moment while I was listening to this book.I absolutely love the cover of this book and found the title also appealing and very fitting which draws you right into this modern day southern tale of family drama, a murder mystery, revenge, secrets and lies while exploring the true meaning of friendship.THE NIGHT THE LIGHTS WENT OUT is cleverly told in three different points of view of Merilee Talbot Dunlap, Sugar Prescott, and an anonymous blogger all from Sweet Apple, Georgia. Sugar’s point of view also alternates between stories of her past and her present day voice bringing past mysteries into the storyline which come together in the present. Sugar was my favourite character but I am not going to say why as you have to experience her personality all on your own! I absolutely loved each installment of the blog as the blogger was extremely entertaining, funny, cheeky, and spirited. I even loved the title of the blog! The Playing Fields Blog: Observations of Suburban Life from Sweet Apple, Georgia; Written by Your Neighbor. The blogger reveals some local gossip, observations, life lessons, and offers a few entertaining Southernism sayings at the end of each installment which I found absolutely amusing! No one knows who the anonymous blogger is but I had a sneaky suspicion who I thought it might have been and my observations were correct and it was pleasing.I really liked KAREN WHITE’S writing style, narrative, and how the storyline was delivered as I was entertained and interested to the very end. Even though I had a good idea how it was all going to play out it was still an extremely enjoyable listen. Would recommend!All of Brenda and my reviews can be found on our Sister Blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Lori", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/3332895-lori", "userReview": "I am always absolutely giddy when I am able to get my hands on an advanced copy of Karen Whites novels. What I like most about Whites novels is her ability to create memorable characters and, of course, her great southern humor. I felt a great affection for Sugar who reminded me so much of my grandmother, who grew up in rural SC working on a tobacco farm located on a dirt road named after her family. Like Sugar, she spoke her mind and was as spunky at 95 yrs old as she was at 25. Though parts of this were a bit predictable, I still really enjoyed it."}, {"userName": "KAS", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/20691061-kas", "userReview": "4.5 StarsWell, hush my mouth! What a southern stunner!Karen White is a master at spinning a southern yarn. Just the names alone, Merilee and Sugar, clue you in right away you are about to get knee deep into the lives of women born and bred in the south. Ms. White's ability to develop unforgettable characters is superb and her writing skills are exquisite.We first meet Merilee Talbot Dunlap and her two children, Lily and Colin, ten and eight respectively, as they are packing up the van and moving. After eleven years of marriage, she is still reeling from her recent divorce. Her ex-husband, Michael, had an affair with their daughter's third grade teacher, and got her pregnant, no less. They are moving into a cottage owned by a ninety-three year old woman by the name of Sugar Prescott. And, of course, the children will be attending a new school. The scandal is front and center news in the small town of Sweet Water, Georgia.Sugar is quite particular with whom she befriends, and they have always been few and far between. She has no filter, and says whatever is on her mind.. She has her \"stink-eye\" look down to a science. When Sugar hears a newly divorcee and her children are in need of a place to stay, she is willing to rent out the cottage behind her farmhouse, but wants to keep their relationship strictly as landlord and tenant. But Merilee and her children stir up feelings from her past, and she can't seem to keep her distance from them. An unlikely friendship blossoms between the two women, and they discover just how much they have in common once they begin to share stories they would much rather keep buried.And then ..... there was Heather. An unforgettable woman of which I could write six paragraphs, but I won't. The role she plays in this story is pivotal, but I will let you discover all about her personality for yourself.I loved the following quote from Heather ..... \n\"I can always tell a native Georgian. Hard to hide it, isn't it? It's almost like no matter how far you go in life, all you have to do is open your mouth and somebody knows exactly where you're from.\"\nThis was a delightful read with twists, turns and unimaginable events the residents of Sweet Water, Georgia, have never seen the likes of. Bless their heart!*I received an advanced copy of this book, via Netgalley, in exchange for an honest review*"}, {"userName": "Margitte", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "This is one of the most skillfully crafted mysteries that I have read in a very very long time.Starting out as a one-way street to happiness for Merilee Talbot Dunlap, a newly divorced mother of two in the Southern idiom of chicken-soup-for-the-soul read(s), so aptly named by Porsha, the story completely turns the mystery genre on its fine head. Included in the upside down view are the botoxed, helicopter-moms of Sweet Apple, Georgia, with their bling medals of social standing in the suburban road to social nirvana. The Windwood Academy got them all grouped together: the sleek perfected bodies of yoga-ed, gym-ned, tennis visor-ed, dark Chanel sunglass-ed, SUV-ed gang of super beautiful moms, who had all men insisting to take the kids to school. Such a parade of beauty cannot not be missed. Instead of opening with the murder, like all well-respected, good murder mysteries is suppose to do, and working the story backwards as the sleuthing progresses, this story begins with an introduction and focus on bitchdom at its finest with no criminal intent anywhere near the plot. Head of the pact is the childless 93-year-old Sugar Prescott, or Alice Prescott Bates, a vigorous opponent of consumerism and social aspirations, who rents out The Craftsman cottage on her land to Merilee. Soon the ruler of bitchdom, Heather Blackford, enters the story with her clinging troupes of desperate wannabe groupies, opening up like the red sea for her to reach Merilee at the school gates. And as they say... the mix is on ....Just one fly in the happily-ever-after soup: THE PLAYING FIELDS BLOG written by 'Your Neighbor'. And boy, does this blogger have the goods on everybody. A lot of huffing and puffing ensue when old secrets and new threats are charmingly woven into the weekly word feasts. Merilee, not named in the blog, is embedded in the blogger's introduction of an old southern expression: the new broom might sweep clean but it's the old broom who knows the corners. Merilee is the past-expiry-date ex-wife, who is replaced by a trophy wife, and Merilee is hardly in her Thirties! Euphemisms isn't the blogger's beat. It is clear that the blogger knows the way around the perpetually haunted, and is slowly but surely flashing them out of their hiding places...Truth, after all, was as sticky as molasses. Yes, Truth, like oil, will always rise to the surface.You better clean up your own backyard before you start talking trash, another favorite expression of 'Your Neighbor', has many faces red, veins at aneurysm point, with nervous fluttering of eyes when nobody is around to witness the effect of the blogger's southern wisdoms. Sugar Prescott and Merilee slowly become friends when their co-habitation on the same land encourages a new bond which neither of them ever had with anybody before. Their tragic pasts enfold in trusted conversations around Merilee's kitchen adventures as Sugar teaches her to cook proper southern meals for the kids. The old dame, with her yoga classes three times a week at the Prescott Bend Country Club; her Fitbit which forces her to walk everyday; her Bible classes; and her giant old baby blue Lincoln car, has a firm grip on life, which she does not plan to exchange for a room in a godforsaken old age facility. She also does not have the problem to be always nice to her children who will choose her nursing home one day. ...the indignity of being moved into such a place, like a box of old toys that a child has outgrown but doesn't want to get rid of completely, passes her by in her childless state. She is happy in her own home, tapping out long letters to her dearest and oldest friend, Willa Faye Mackenzie Cox, on her 1949 Smith-Corona typewriter, her bottle of White-Out sitting nearby. She has a bag of principles left at her age, but also the promise to herself that she would never love anything again that she could not bear to lose.Merilee has to come to terms with her past, her divorce and her future. The new bond opens up the possibility for her to become the person she always wanted to be. Not only must she confront all the events in her earlier life, but also her ability to handle it all. In the history of Sweet Apple, the next thirty days promise to become like The Tower of Terror, Times Square and Armageddon rolled into one. Life no longer will be an unbroken road full of wonderful for the town. The new curves in the road, winding through old memories, heartbreak and tragedy will test the people of Sweet Apple's mettle and character. But with the friends and those who loved each other along for the ride, the bridges to overcome will be put into place where the puddles wait.But first they have to weather the storm. An extraordinary tornado is brewing over the town. Wade Kimball fixes the cellar doors at Merilee's house, for just in case. However, metaphorically it becomes a lake on the make, with old resentments and bad karma becoming fast friends in a very short span of time. The calamity becomes critical to the plot, central to the The Night The Lights Went Off. It will be the night when sound waves will solidify and become lightning - the sawmill of a storm, and split pine trees in half. Mimetic, like the real thing, it will flash down into the middle of everyone's secrets. It becomes the portal to new beginnings. A meteorological phenomena in the lives of everybody. (Using the storm, lightning and rain as pathetic fallacy in this book, was highly effective.)Needless to say, this is a must-read for those who need a chicken-soup-for-the-soul read. Brilliantly constructed. Excellent entertainment. Funny, soul-enriching, pleasant, sad, but just beautiful! Chick-lit fluff present, but not annoyingly so."}, {"userName": "Elizabeth of Silver's Reviews", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/1882027-elizabeth-of-silver-s-reviews", "userReview": "A new town, a new home, a friend you really don't want, a blog that tells the town's gossip, and Merilee has to deal with all of this along with her divorced husband and his pregnant girlfriend.Living in Sweet Apple, Georgia, seemed like a good town to start over and for the most part it was.Merilee was renting a house on the property of the town's oldest citizen, Sugar Preston. Sugar was portrayed as anything but sweet, but actually she was.Merilee and Sugar became friends and shared stories from Sugar's childhood that made sense as to why Sugar was the way she was.Sugar and quite a few town residents had secrets, and now that Merilee arrived in town, the anonymous blog writer had more ammunition for her daily posts and Southern sayings. As Sugar knew, there were more people in this town that had better stories than Merilee had. Sugar's past was a soap opera in itself and filled with stories but no one dared to tell them except Sugar herself and many stories were told for the first time to Merilee.Totally and completely enjoyed the characters and the story line of THE NIGHT THE LIGHTS WENT OUT. Sugar was very lovable, Merilee was sweet, and I didn't like Heather from the minute I met her. Readers of women's fiction will again be transported back to the days of Southern ​hospitality and then brought back to current day with women who keep secrets and have everything and like to flaunt it.Ms. White has done it again with a marvelous story filled with wonderful characters with Southern charm​. If you have ever read any of Karen White's books, you will love this book just like all of her books and not want to put the book down. I have LOVED all of Ms. White's books, but this has to be my all-time favorite. 5/5​This book was given to me free of charge and without compensation by the publisher in return for an honest review."}, {"userName": "Esil", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "My ratings often depend on my expectations. I decided to read The Night the Lights Went Out because of two recent mediocre literary fiction reads. I was ready for something light and entertaining, and I had room to tolerate the comfort of some predictability. Karen White delivered what I was looking for. Set in Georgia, the story focuses on the parallel lives of recently divorced Marilee and her 93 year landlady Sugar. Marilee is trying to fit into her new community and Sugar is way past the need to fit in anywhere or ingratiate herself with anyone. They both have secrets. The town has a few secrets. The story moves back and forth in time. Things are not always as they seem. Tensions build up somewhat predictably, but not to the detriment of my enjoyment. It was the characters and their back story that I enjoyed the most and that made this one worth reading. I especially liked Sugar. I won't say more to avoid spoilers. It's a good book to read for light entertainment-- maybe a good beach read. It did the trick. Now I have to continue my quest for something more meaty. Thanks to Netgalley and the publisher for an opportunity to read an advance copy."}, {"userName": "Book of Secrets", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/3453249-book-of-secrets", "userReview": "In THE NIGHT THE LIGHTS WENT OUT, Karen White intertwines the lives of two strong Southern women while telling a story of secrets, survival, starting over, and friendship. The star of this book is most definitely Miss Sugar Prescott. She's a lifelong resident of Sweet Apple, Georgia, a place that may seem perfect on the surface, but what lies beneath is a different story.Now in her mid-90s, Sugar is still tough, headstrong, and sharp as a tack. Sugar rents a cottage on her property to Merilee Dunlap, a recently divorced mom with two children in tow. Merilee's life in Sweet Apple won't be what she expected, but luckily she's got Sugar on her side.This book alternates between Sugar in the past (early 1930s) and Merilee's ordeal in present day Sweet Apple. All around I just enjoyed Sugar's story and character the best. Other parts I found a bit predictable and hard to believe, but overall it was an enjoyable read - nice blend of mystery, historical fiction, Southern drama, and a dash of romance. The ending was very exciting! Disclosure: I received a copy of this book from the publisher through NetGalley in exchange for an honest review."}, {"userName": "Suzanne Leopold", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/9004645-suzanne-leopold", "userReview": "Merilee Dunlop is entering into a new stage of her life. She is recently divorced and is moving with her two children to Sweet Apple, Georgia. The divorce was amicable after her husband was found cheating with their daughter’s third grade teacher. She rents a cottage house from an elderly woman named Sugar Prescott. Sugar at ninety-four is very opinionated and is the self appointed town matriarch.Merilee has enrolled her children in an elite private school to avoid the gossip around her failed marriage. The children adjust quickly to their new life while Merilee struggles with her social status. Merilee feels different because she is a divorced, working parent who doesn’t play tennis. Heather Blackford is the poster child for this stereotype and is living the life that the local women crave. She is at the top of the social ladder and others seem to worship her friendship. Heather eventually befriends Merilee and starts to dominate her life with carpools and awkward gifts. At the same time, Sugar starts to take an active interest in Merilee and her children. They forge an unlikely friendship that becomes stronger as drama and secrets unfold. This is a story about a woman transitioning into a new phase of her life. She is forced to evaluate new acquaintances and along the way discovers a lot about herself. Karen White does a great job of blending drama, mystery, southern fiction, and romance in her new novel."}, {"userName": "Judy Collins", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "The 30 Best Books of 2017Destined for the Big Screen (see my cast selection on my blog) The queen of the south, Karen White returns following  Flight Patterns on my  Top 50 Books of 2016  with the highly anticipated THE NIGHT THE LIGHTS WENT OUT.  As sweet as a Georgia peach, and as scandalous as Desperate Housewives’ Wisteria Lane, and Big Little Lies.  Set aside the time, readers . . . you are going to love Sugar! The Southern Queen B  has created her best yet! Yay Atlanta . . . From the stunning WOW cover and the memorable characters, Karen White grabs you and pulls you into this Southern suburban neighborhood filled with drama, revenge, secrets and lies, while exploring the true meaning of friendship. It is not always as it appears. Alternating between the 1930s  Depression-era Georgia and a modern-day 2016 Sweet Apple, Georgia (fictional) suburb of north Atlanta. Let the games begin. Meet the 3 leading ladies:  • Merilee Talbot Dunlap, newly divorcée, single mom, mysterious past • Alice Prescott Bates, Matriarch aka Sugar Prescott, landlady • Heather Blackford, Socialite, beautiful, perfectionist  An anonymous blogger  offers up entertaining essential Southernisms any Yankee in the South should know, sprinkled throughout. “It’s never about the secret itself, but the keeping of it.”From the wealthy private school, social climbing moms to a young single divorced mom who discover (the hard way) . . . the true meaning of friendship and the dangers of deception. Against the modern-day scandals, we meet matriarch Sugar Prescott who is at the center of the novel. A grounding force. A courageous woman you want on your side. Sugar is wise, and has had her own share of tragedy and can relate to her new tenant, on more than one level. Merilee Talbot Dunlap  had learned in eleven years of marriage, it was the simple fact that you could live with a person for a long time and never really know him. One day the mask slips. Her husband, Michael has an affair with their daughter’s third-grade math teacher, Tammy. Merilee decides she does not want to stay in the house with all the reminders. She was traded in for a younger woman. She needs to escape from all the gossip. However, she is unaware, it may be the lesser of two evils. What lies ahead at the new location, maybe even more devastating. Merilee is the mother of ten-year-old old daughter Lily and eight-year-old Colin. They were now moving into a quaint furnished Craftsman historic cottage (with a cellar) for tornados, located behind Mrs. Prescott’s farmhouse in Sweet Apple, GA. The landlord is a southern matriarch and well-respected in the community. Some say she is harsh. She is known as Sugar. She is widowed (Tom killed in the war) and no children. A mystery, to some. Fascinating and eccentric to others. Sugar Prescott  (Alice Prescott Bates) is ninety-four years old (what a great character)! She lives alone in an old farmhouse on her family’s land. Her loyal best friend Willa Faye Mackenzie. Willa Faye moved to a senior living facility. While Sugar was staying put as long, as possible. A realtor had found the young mother and her two children as her new tenants. Not that she had any desire to befriend her new tenants and neighbor, but Sugar had the feeling that Merilee was suddenly on her own and in need of help. Sugar was in a position, to understand that need more than most. She suspected but would deny if anyone asked, that she was getting soft in her old age.Of course, Sugar  did not realize this single mother would be this young and pretty. Mid-thirties. She wonders what happened to her marriage? Surely the woman had flaws. Sugar soon discovers a few. Heaven forbid, the woman does not even know how to cook, nor does she know her proper Southern graces!  Sugar must teach her a thing, or two.  . . . “At least by the end of the day, you’ll know how to bake cookies and fry okra. It might be against the law for a Southern-born girl not to know how. Along with changing a tire.” . . . Despite all her attempts  to keep her new tenant at arm’s length, a tenuous connection had been formed. They may have more in common that they may suspect. Merilee at first thinks Sugar is a little strange and is judging her. However, soon their bond strengthens. The best award-winning part  Think: To Kill a Mockingbird This is where White always \"shines\" with the historical past and dual timelines. Sugar begins telling Merilee bits and pieces of her life on the farm as a girl during the Depression, starting from 1934. She usually is closed-mouthed about her past (in a world of oversharing), she likes keeping some things to herself. However, somehow, she feels comfortable opening up to this younger version of herself. Sugar’s dark life  during the Depression in Sweet Apple provides a very different look at life compared to the present-day of the same town, especially those in Heather’s world. A great addition to the story: Wade Kimball  is Willa Faye’s grandson, and he looks in on Sugar. The developer, and handyman. He helps with any of the maintenance issues for Sugar and her new tenant. As Merilee and her children  begin to get settled in, she meets a variety of moms. One, in particular, Heather, which is like “perfection.” The perfect wife, mother, house, children, food, social standing, glamorous, clothes, and home (s) with the good-looking nice husband, Daniel. Merilee feels inferior next to her. As the kids become involved in their new school and Merilee in carpools and committees. She just wants to be accepted, like a kid at school. Peer pressure is tough. Soon her daughter comes home and tells her about this anonymous blogger. It is called: THE PLAYING FIELDS BLOG.  Observations of Suburban Life from Sweet Apple, Georgia Written by Your neighbor. Who is this person and how does she know so much about their Sweet Apple lives? The blogger dishes  out a variety of gossip and offers a few Southernism tidbits for all the newbies at the end of each installment. No one knows but they think it could be a mom at Windwood since she seems to know a lot about what goes on at school, the community, and their lives. (yes it is spicy, sassy, and oh so funny)! In the meantime, the perfectionist mother Heather at school is befriending her. Merilee gets pulled in by the attention and her affluent lifestyle. She has taken her under her wing. Merilee grabs on, desperate for new friends and acceptance. Looks can be deceiving. Of course, Sugar does not trust her. A backstory. Merilee also has a mysterious past; however, she is not so forthcoming, until it all unravels later.  Between Sugar’s stories  from the past, Merilee’s own drama with her wealthy friends in the present; the school, her children, her ex-husband, his girlfriend, and a baby on the way, worrying about measuring up to her new friend Heather, and the constant reminders of her life from an unknown blogger and social media —she feels like she is on a reality TV show. . . . and there are some other strange happenings. Daniel and Heather are acting weird. Plus, Merilee has her own memories and guilt from the past which may be coming back to haunt her. Then someone is murdered  at the lake house (Lake Lanier). The suspicions are pointing to Merilee. Is someone setting her up? How will she prove she is innocent based on her past? What motive do they have for hurting her?From murder, attempted murder, revenge, and a tornado.  It wouldn’t be the South without a little drama and deceit sprinkled with some sugar. Female friendships are at the heart of this page-turner. 5 Stars +++ Top books of 2017!  Move this one to the TOP of your list. You are going to love it! (cover obsession) Karen White just keeps getting better and better. From southern \"grit lit\", a murder mystery, historical, women's fiction, domestic suspense, family drama, motherhood, social media, bullying, friendship, romance, humor, contemporary, to psychological and suspense! THE NIGHT THE LIGHTS WENT OUT  has it all! Grab a hammock, a swing, head to the beach, or a front porch rocking chair. Mark out the time and sit back and be prepared to be entertained Southern savvy style!For my movie cast wishlist and more about this exciting book and author,  Visit my Blog A special thank you to Berkley and NetGalley for an early reading copy. I also purchased the audiobook for an outstanding Southern performance.  JDCMustReadBooks Santa just arrived. Just scored an ARC Dreams of Falling #NetGalley, Coming June 5, 2018. Cannot wait to start reading."}, {"userName": "Myrna", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/8789819-myrna", "userReview": "Wow! This book is a jumble of all things that make a novel fantastic! There is so much going on with the main characters as their stories are told in present, past and an anonymous blog. Some parts are predictable but some are not and they take you on wild and crazy ride (to quote Steve Martin). I had a hard time tearing myself away from reading the latter part of the book. The Night the Lights Went Out is southern, full of charm, wit, and heartache. I need to read more of Karen White. 4.5 stars!"}, {"userName": "Cindy Burnett", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "Karen White’s new book The Night the Lights Went Out ranks at the top of my list of books I have read in 2017. It is a must read for those who loves Southern fiction or truly anyone who loves a great read. In this book, she creates the perfect combination of wonderful characters, a highly entertaining story line and an interesting method for unfurling the plot developments. Merilee Dunlap is recently divorced and rents a cottage in Sweet Apple, Georgia from Sugar Prescott, the sourpuss grand dame of Sweet Apple. Poor Merilee is overwhelmed with her job, her kids, and moving to a new town. As Merilee and Sugar slowly get to know each other, various secrets emerge, and events that none of them foresee begin to unfold. While I loved every aspect of the book, my favorite part was the way White chose to tell the story. The book alternates between a mixture of a clever blog written by the anonymous “Your Neighbor”, a standard present day story line, and a narration by 93-year-old Sugar Prescott of various events from her early life. This synthesis of storytelling techniques produces a unique reading experience which I thoroughly enjoyed. Frequently when various time periods are used in a novel, I will like one story line much better than the other, but here I loved every aspect of the book and couldn’t wait for each new development.White’s characters are well-crafted and very authentic. While I was partial to a variety of the characters, Sugar Prescott is a clear stand out who I have thought about so many times since I finished The Night the Lights Went Out. She is a true literary gem.I highly, highly recommend this book and cannot wait to hear everyone else rave about it as much as I have been to everyone I know. Thanks to Great Thoughts, Great Readers for the chance to read this ARC in exchange for an honest review."}, {"userName": "Amy", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/14045562-amy", "userReview": "All of my reviews can be found on www.novelgossip.comLet’s start with that cover, I just LOVE it! It’s gorgeous and though the ebook version (which I read) is pretty enough, I’m ordering a physical copy too. The Night the Lights Went Out is a perfect blending of genres with a southern flair, it has drama, intrigue, betrayals, history, a small dose of romance, truly something for everyone. Plus, it’s set in Georgia which always makes a fantastic setting in my opinion. Merilee moves into a new home following her divorce with her two young children, Lily and Colin. She rents a place from Sugar, a life long resident of Sweet Apple, Georgia. Though these two seemingly have little in common, their proximity allows them to strike up an unlikely friendship and discover they may have a whole lot more in common than meets the eye. I felt for Merilee right from the start, we’re the same age and imagining trying to start my life over in a small, tight knit is terrifying. Especially when it’s a small town in the south, some of the grown women in this book were worse than Regina George in Mean Girls! Sugar took me a little while longer to warm up to, she’s a bit crotchety but as she slowly shares her past with Merilee, I begin to really empathize with her. Both women were so deeply developed, resulting in characters that will stay with me for a long time. I simply loved everything about this book, it was super entertaining, magically blending past and present as Merilee and Sugar both narrated sections. There are also sections from an anonymous blogger who only will reveal they’re a neighbor, preferring to keep their identity a secret, but they dispense some great life lessons and hilarious southern sayings. I did figure out a plot twist, but I was having such a fun time reading this, I didn’t even care. It beautifully captures small town Southern life and had enough gossip and whisperings to make it even more juicy."}, {"userName": "Abby Welker", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/756268-abby-welker", "userReview": "I have NO IDEA how this book has been rated so highly. I was actually quite excited to read this book based on all of the rave reviews. Pretty much every cliche regarding women, Southern women, best friends, crushing on the guy next door, and revenge stories was included in this book. I mean, cliche all the way to the END, including \"a best friend is someone, who, when you ask her to help you bury a body, she asks for a shovel...\" (gag and eye roll) I couldn't end this book fast enough...so happy I can move on to something (hopefully) more interesting.***SPOILERS***I MEAN SERIOUSLY......I get it that Marilee was a recent divorce, but are women really that naive?! And do they really fall for a guy that fast after getting a divorce?! And did she really not recognize a girl whom she went to school with and tormented?! I belive that plastic surgery, cosmetics, fitness, and hair color can make a person look quite different, which is what I'm assuming happened with Heather, but SERIOUSLY. Marilee giving out her phone & Facebook passwords and the spot she hides her spare key to get into her house?! Honestly. Also, I knew the whole time that it was Sugar who was writing the secret blog posts. Those were actually the only decent parts of the story for me. And seriously? Heather was that cold-hearted to kill her husband with a stiletto?! Oh, and my ultimate favorite part to hate about this book is the fact that the whole revenge break-in happened on.....get this......a stormy night!!! With a tornado!!! Merilee makes bail, comes home and, naturally, she'd want a bath because that's how all horror movies are written, right?! And then...the house looses power, of course, because of the storm and they fight in the dark....with flashes of lightning giving away the position of each other!! (the suspense, right?!) They scramble out in the pouring rain with lightning flashing and Merilee almost gets killed - but the sweet little old lady comes to save the day. oh my GOSH, the cliche is SO BAD here!!!"}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "DNF 76%!Seriously, I can't take it anymore. This story started off good and I enjoyed especially the anonymous blog posts that dealt with town gossip. etc. However, the main plot went from \"a bit dry, but OK\" to \"slightly annoying and dry now and then, but still OK\" to finally \"This is so obvious that a 5-year old could figure out the plot and it's is BLOODY annoying\". That's when I stopped reading!"}, {"userName": "Kathryn", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/3076351-kathryn", "userReview": "The Night the Lights Went Out by Karen White was an absorbing read, that I thoroughly enjoyed.On the one hand we have Merilee, recently divorced, with two young children stepping into a new phase in her life. Refreshingly, Michael her ex and herself have a reasonable relationship. Her two children fit in perfectly to the story. Merilee has secrets, she has that look in her eye that she has experienced loss and lived on. She is resilient and strong.Sugar her elderly landlady recognises Merilee's qualities and even though Sugar is known for her crustiness, Merillee is not long in discovering the woman has a heart and eye that sees and cares. I so loved Sugar and her little pearls of wisdom. Her life connects with Merilee in many ways, they have seen similar things and their hearts understand and connect.Then there is \"the blog\" from your local neighbor that comments on life in the town and the people there in. It tells it like it is and makes connections, often going against the local gossip and innuendo. It is full of southern says which I totally adored, down to earth sayings that made me ponder, like \" You can't tell the size of the turnips by lookin' at the tops\". And so many more. Who is the author of the blog? Well that's just one small secret in a book that abounds in secrets.Every detail that is dropped foreshadowing something is followed up. Nothing is left dangling. I like that in a book. The plot was full of interest, moved along at a very good yet relaxed pace. Lots of things happened.I liked how it explored friendship and resilience. And that dreadful emotion or motivation - revenge. I am always partial to a book that has someone going for a little revenge on the party that hurt them. However this book I think has cured me! Revenge is taken to a new level here, I'll never look on it in the same way. Who is the executor of the revenge and why? You'll have to just read this book to find out!"}, {"userName": "Christina (Confessions of a Book Addict)", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/2418140-christina-confessions-of-a-book-addict", "userReview": "Merilee, mother to Lily and Colin, leaves her cushy life behind after her divorce and moves into a cottage on a farm in Georgia. Sweet Apple, Georgia is the quintessential Southern town and of course everyone knows everyone's business. She is renting a charming cottage on Sugar Prescott's farm, an older woman who has a no nonsense reputation around town. Merilee's children are starting over at a private school, but things are a bit different than she expected. The other moms are very high maintenance and are helicopter parents. Think Desperate Housewives meets Gone with the Wind. While trying to figure out her place in all of this, Merilee meets another mother, Heather, who takes her under her wing. Heather is pretty much the Queen Bee of Sweet Apple and they surprisingly hit it off. Thanks to Heather, Merilee finds her niche in the community, volunteers for a committee at school, and meets a whole new world of people. This is all juxtaposed by Sugar and her way of life, which is entirely different than Heather's. Sugar grew up when things were different in the South and is the polar opposite of Heather. Sugar is all about farming, home cooked meals, no technology, and other remnants of days gone by in Georgia. Although Sugar doesn't take to many people, she cares about Merilee since she is a single mom just trying to get by. Readers get to know a bit more about Sugar as we flashback to her memories of growing up on the farm and the various people that lived in Sweet Apple in the past. But as things progress for Merilee, she comes to find that behind the perfect people that live in Sweet Apple are secrets and things aren't what they seem. Perhaps things aren't so perfect after all, especially if you dig a little deeper and look closely. Karen White's The Night the Lights Went Out is a fantastic novel. It has everything that I want in a read. There's a Southern setting, some romance, some flashbacks to the past, compelling charcacters, and an edge of your seat mystery. Read the rest of my review here: http://www.confessionsofabookaddict.c..."}, {"userName": "Chris  Carroll", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/16768971-chris-carroll", "userReview": "The author used her typical story lay out in this new book. A little bit from yesterday through the eyes of Sugar, a crotchety yet supportive older woman Merilee rents a house from. Her family history and story is woven through the events of today to make this an intriguing read.With her main character, Marilee, she has crafted a recently divorced woman trying to make it on her own. Juggling life, work, children, and even balancing friendships and maybe a love interest, she is put to the test each day. But Marilee has history too! Things she has not told anyone. And, unfortunately, her nativity may backfire in ways she cannot fathom.You know that something is going to happen, you just don't know when or what. All things are not as they seem in this engrossing story. The author dropped hints and clues on the way to an exciting and suspenseful ending.Karen White is a master at blending history and stories from today with the flavor of the south. This book is loaded with so many different aspects, there's no way you can be bored. Highly entertaining, suspenseful, and even a bit gruesome, this is a read you cannot put down.* copy received for review consideration"}, {"userName": "i.", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/11422082-i", "userReview": "My first thought when I started reading this novel was: this is one of those books that would make an incredible film. It oozes southern charm. The reader can feel the heat of the humid summer, taste homemade cookies and even learn some proper manners.The author depicts very strong female characters.Sugar and Merilee are two women who have had to struggle in life but despite their age difference find themselves sharing difficulties and inspiring each other. They end up being \"two peas in a pod \". The plot is engaging and although it is slow paced, you can feel that something is about to happen and you really want to warn the characters since they are incredibly likeable and it is easy to relate to them.I read the book before going to sleep while listening to the sound of crickets and distant thunderstorms on my phone and I slept like a baby. The novel just \"dilled my pickle\".www.theleisurediaries.blogspot.com"}, {"userName": "Carole", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/7630646-carole", "userReview": "I so enjoyed the southern women in this book. Sugar is a spunky 90 something who rents her cottage to Merilee and her grade school aged children. Despite the generation gap, these 2 women become friends. The mystery of who writes the local blog was fun. It became a bit predictable is why I lowered my rating to a 4 star. An enjoyable, light read though!"}, {"userName": "Bj", "userReviewDate": "Apr 16, 2017", "userURL": "http://www.goodreads.com/user/show/27341466-bj", "userReview": "5 \"True Friends & Secrets\" Stars for the story and 4.5 Stars for the narration!The Night the Lights Went Out is a combination of two Southern mysteries and a women's fiction title all wrapped up in one. Told from three points of view, a 93 year-old small town matriarch, the main protagonist who is a recent divorcee with two children, and an anonymous town blogger, this audiobook is a must listen to gem! 15 hours went by in a flash when I listened to this intriguing title that has a little something for everyone. As I'm an avid romance book listener I think its important to note that while this title is not a traditional romance, it does have a romance undercurrent with a HFN outcome, so I also encourage romance listeners who enjoy women's fiction titles to give this book a listen.Merilee Talbot Dunlap has to start a new life after discovering that her husband had an affair with a third grade teacher from their two children's elementary school. Knowing that the kids would never survive the gossip at their old school, Merilee moves with her two children to the small, affluent town and Atlanta suburb of Sweet Apple, Georgia. Think of Sweet Apple as a yuppie, small town where roundabouts, SUVs, and coffee shops abound. Of course the exclusive private school that Merilee enrolls her children in is no different and Merilee quickly is thrown into the rich culture even as she's adopted by the \"queen\" of the town, Heather Blackford. But Merilee is not as rich as the town's inhabitants and is only able to afford the expensive private school because her ex-husband's parents are paying for it, so keeping up with the Joneses is not easy for Merilee. Fortunately, and yet unexpectedly, Heather tries to ease some of this burden by subsidizing some of its social burdens as well as by including Merilee on some of the prestigious school committees and inviting her to exclusive town parties. Further helping Merilee make ends meet is the fact that she was fortunate to have found a sublet from Sugar, the 93 year-old matriarch of the town whose family at one point owned much of the land. At the same time that Merilee is developing her relationship with Heather, she is also slowly developing a parallel relationship with Sugar (to the town's great surprise because Sugar has not been particularly friendly to many people much less allowed them to sublet from her). Then there is also Sugar's best friend's grandson who starts visiting Merilee to help out with home projects and they start forming a bond, and Merilee's ex-husband, and even Heather's husband who due to the frequent get-togethers between Merilee and Heather, also begins to form a friendship with Merilee. However, not all is what it seems, and secrets and sins pervade the small town. Additionally, as the anonymous town's blogger seems to see all, and starts revealing some gossip worthy observations, Merilee is put in some rather uncomfortable positions (especially as her children also seem to be aware of the blog). Just who are her true friends and who in Sweet Apple can Merilee truly count on? The Night the Lights Went Out is narrated in a somewhat unusual and yet especially fitting fashion for a book that is told from 3 POVs. Therefore it is no surprise that we have three narrators: Carolyn Cook , Susan Larkin, and Tiffany Morgan. I must admit that as all three narrators are new to me and all narrate from a female character's perspective, I'm not really sure which narrator reads which POV. However, I can tell you that one narrator is assigned to each of the 3 POVs being shared: Merilee's, Sugar's, and the anonymous blogger's. This style works well to differentiate the POVs. Additionally as Sugar's passages are told from the past (revealing things that happened to her and her family and friends in Sweet Apple when she was a child/young adult), it also helps differentiate whether the story is being told in the present or past tense. The narrator who narrates the blogger's perspective has a perfect snarky tone as you would except someone revealing some tongue-in-cheek gossip which I thought worked perfectly in this book. Sugar's narrator in turn gives Sugar a much more pronounced Southern and elderly sound which I thought also worked well for her passages too. Merilee's narrator, as you would expect of the main protagonist, had the heaviest load of the narration burden. This narrator does a relatively good job in most aspects juggling the large cast that plays a part in Merilee's passages. Perhaps my only critical observation of this narrator, however, is that while she excelled at delivering distinguishable female characters, her male characters were all pretty similar in pitch (and not very deep, so somewhat similar to some of her female characters) making it a little more difficult to differentiate the male characters just by her voice.All in all, this is one of the best suspense/thriller and women's fiction titles I have listened to this year. I found every aspect well done: from the dual unfolding of the current mystery and the revelation of the past one to the bilateral parallel stories of how \"friendships\" both aided and led to the evolution of these mysteries. This is a book that will leave you both questioning who your true friends are as well as appreciating how necessary true friendships are to a life well lived.This was my first Karen White book, and wow was I impressed! I will definitely be looking to listen to more of her titles in the near future.Source: Review copy provided for review purposes."}, {"userName": "Dale Harcombe", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/4800708-dale-harcombe", "userReview": "Three and a half starsAfter her divorce, Merilee Dunlap moves with her two children to Sweet Apple Georgia. There she rents a cottage from long-time, elderly resident Alice Prescott (known to all as Sugar.) The children, Lily and Colin, settle easily into their new school and start to make friends, But Merilee feels like an outsider until the wealthy and popular Heather Blackford, takes her under her wing. At the same time someone is writing a blog that reveals more than Merilee would like about her failed marriage. The anonymous blogger seems to know all that is going on in town and comments on various other aspects of people’s lives. The blogger comes up with some homespun philosophy as well as a regular dose of gossip. Despite her intentions to remain uninvolved Sugar finds herself responding to Merilee because she reminds her a bit of herself when young. She ends up revealing more other life to Merilee than she ever planned, so readers get not only Merilee’s story in the present but Sugar’s story from the 1930s and onwards.I liked some of the thoughts that came out of the anonymous blog, especially this one. ‘Life shouldn't be an unbroken road of wonderful. It's the curves in the road that build character and show us our mettle. Every path has its puddles, but that doesn't mean we can't or shouldn't travel them. We just need to remember to wear our boots and bring along our friends and those who love us. They can lift us over some of the puddles, or pull us out when we fall in. And we can do the same for them.’ To me, the identity of the anonymous blogger was fairly evident.I found the characters of Merilee and Sugar interesting. Sugar is strong and opinionated, but also has a softer side. Both Sugar and Merilee have secrets and incidents in their past that have profoundly affected them. I also liked Wade. He is a sweetie. I enjoyed this story although it did take a turn that I didn’t expect. That includes a murder. Once that happened, it seemed to get a little farfetched to me. It was this that led me to adjust my rating from a four star read back to three and a half. Still, it was an entertaining read about friendship and second chances, and that people are not always what they seem. Anyone who enjoys Southern fiction or books about friendship should enjoy this one. Oh and, did I mention there is also a romance?"}, {"userName": "Pamela", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "\"Nothing like single and pretty to get a room full of married women as nervous as a long-tailed cat on a porch full of rocking chairs.Southern Fiction, like its female characters, are: a bit catty, passive aggressive, humorous, wise, vengeful - yet forgiving, gracious but not always kind, appearing to be one thing - \"Bless your heart\" - and being something else entirely, often gossipy, and always full of sweet tea and sass. \"Do you think you're the only woman who's ever had to live a life she hadn't planned on? Or even wanted? Life is a hard business; we both know that. Sometimes you're the bug, and sometimes you're the windshield, and that will never change no matter how old you get.\"The Night the Lights Went Out is all of the above, and then some. \"Life shouldn't be an unbroken road of wonderful. It's the curves in the road that build character and show us our mettle. Every path has its puddles, but that doesn't mean we can't or shouldn't travel them. We just need to remember to wear our boots and bring along our friends and those who love us. they can lift us over some of the puddles, or pull us out when we fall in. And we can do the same for them.\"It's a story about friendship, regrets, failed marriages, starting over, and learning what it means to extend grace and forgiveness without being taken advantage of, and learning which secrets should stay buried and which need to be set free. \"Don't go digging where you're not wanted. Most people have secrets. And most of them should be allowed to stay hidden. No good has ever come from poking a stick down a hole. Sometimes you get a garter snake, but sometimes you get a rattler.\"On one hand, the book is predictable Chick-Lit. A good portion of it, anyway. Oh, but keep on reading. Everything isn't as it appears to be. The last quarter of the book..... WOW! Pulled a three-star to four. Like Handsel and Gretel, breadcrumbs might lead to a candy house . . . but a wicked witch just might be living there waiting to exact a deep dish of deadly revenge. FOUR **** Sweet Tea and Mimosas, With a Licorice Twist **** STARS"}, {"userName": "Cindy", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/54600009-cindy", "userReview": "review\nI have not read a book that I have loved as much as this book in a long time! A sassy 90 something lady named Sugar and the main character Merilee who unfortunately has a lot to overcome, mix the two together along with a few other characters and you have a great story! My least favorite character was Heather, the perfect wife, mother, room mother etc. We may all know someone  a bit like her, super organized, volunteers for all the school events and is just too perfect. Merilee has a lot to overcome and I loved seeing her get stronger as the story unfolded. I loved the blog posts by an anonymous ( until we figure out who the author is...) author was great! I cannot resist a book with a bit of an underlying mystery to it and a surprise twist. I was not sure if I would grow to like Sugar, at first I thought that her character was too taciturn but she really grew on me. The southern food and sayings were a nice touch to the story, another thing that I cannot resist in a book!I have read all of Karen Whites books and I can honestly say that each one is better than the next!This review was originally posted on A WordPress Site"}, {"userName": "Deanna (A Novel Glimpse)", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/13456003-deanna-a-novel-glimpse", "userReview": "Original review: A Novel Glimpse4.5 StarsNote: I received an ARC from the publisher in exchange for an unbiased review.Every time I pick up a book by Karen White, I'm impressed. It's like I forget what an amazing writer she is and how well she weaves a story. Those are just a couple of the reasons she is one of my all time favorite authors and on my auto-buy list.The Night the Lights Went Out completely captivated me. In the beginning, it was the writing that did it. The southern setting of Sweet Apple Georgia was beautifully described. I could hear the characters' Southern accents as I read the book. Not too long after beginning, it was the plot that kept my attention. The four points of view that delivered it were very engaging.First, there was Merliee. She was a recent divorcée trying to navigate her new world. She had recently moved into a rental house on Sugar Prescott's land, and her children were attending a new private school. Merliee was trying to develop new friendships with other parents and Sugar. Trying to fit in was stressful for her. I found it very easy to relate to. Making friends in your adult years is really hard.The second and third point of views were both Sugar's. One was her current 90-something-year-old current day voice. Sugar was crotchety and stubborn, but a great person underneath her rough exterior. She saw people for who they really were. The old lady made me smile a lot. Sugar's second perspective was told through stories of her past. Bit by bit, she unfolded the mystery of her life. I loved learning how Sugar become the strong, outspoken woman she was today from her history.The fourth and final perspective was an anonymous blogger. The blogger claimed to have all the insight into what was happening in Sweet Apple. The blog gave insight into not just local business and construction happenings, but also social gossip. What showed up on the blog was scandalous.All four perspectives wove into a couple of different fascinating mysteries. The first, I mentioned above about Sugar's past. The second involves things that begin happening after Merilee makes some new friendships with parents from her children's school. The mysteries weren't too hard to figure out. I may have guessed some major plot twists early on, but it didn't keep me from enjoying the book. It actually made the revelations all that more fun.The Night the Lights Went Out was truly a great women's fiction/mystery read. I enjoyed every minute I spent with it. I highly recommend reading it to anyone who enjoys great mysteries in a Southern setting."}, {"userName": "Donna", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "I love Karen White's writing. The flair she lends to the southern culture and its women always has me glued to the pages. She also does a great job with building relationships with layers of depth that pull me right in. I will probably read whatever this author puts to paper. The Sound of Glass was the first book of hers that I read, and I've been a fan ever since.Now with that being said, let me first say the enjoyment factor of this book was at least 4.5 because of all the things I mentioned above. I love love all those things. I will even say I liked the story line even though I could see the set up coming a mile away and even pegged the \"who\" from early on. That wasn't really a negative because I liked the characters. What I'm having a problem with letting go of, are some of the holes in the story (especially regarding witnesses). That sucked some of the fun out. So 4 stars it is."}, {"userName": "Erin *Help I’m Reading and I Can’t Get Up*", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/20486043-erin-help-i-m-reading-and-i-can-t-get-up", "userReview": "2 stars. The Night the Lights Went Out has few successes. As a Georgia peach myself, I found the portrayal of Sweet Apple provincial and caricature-ish, not to mention incongruous: Setting the town north of Atlanta and making it home to multiple big/private schools? All the super-Deep-South, cutesy small town stuff is entirely unbelievable. You can't have a swarm of Upper East Side-wannabe moms in Range Rovers and yoga pants in what essentially is a 2017 cartoon of a one-stoplight town. You cannot have your pound cake and eat it, too.Apart from that, this book's main (and fatal) flaw is the lack of any real drive to the plot. An anonymous blogger is writing... what? true things, and they are just not that scandalous. In truth, the anonymous blogger is the only voice in the story whose writing is interesting-- but even that didn't make me care enough to wonder who the writer is!! The main character drifts along in her busy life (so busy, in fact, that she takes frequent breaks to perfect sweet tea and cookie recipes with her landlady) wondering which man is in love with her today. Even Sugar, who is a moderately interesting character with regard to her past and her perspectives on old age and modernity, had nothing in her plot line to make me turn the pages asking, \"Ooh what will happen next?\"2 stars, DNF with only about 15% left because  I just did not care."}, {"userName": "Lisa", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/15493045-lisa", "userReview": "A fabulously sparkling southern book about new and unexpected friendships and the keeping of secrets. SUMMARYKaren White tells a story of friendships that develops between three intriguing women when Merilee Talbot Dunlap moves to Sweet Apple, Georgia, not far from Atlanta. Merilee has just divorced her husband of eleven years after discovering he not only was having an affair with, but had also gotten their daughter's third grade math teacher pregnant. Devastated, Marilee and her two children, Lily age 10, and Colin age 8, give up their house, furniture and Mercedes SUV to begin a new life.The first person Merrilee meets in Sweet Apple is the long-time widow Sugar Prescott who greets the trio at her farmhouse with a batch of chocolate chip cookies. They had sugar on sell at Kroger, she says. Sugar is the town's 93 year old matriarch, her family had at one time owned much of the property in the county, before her older brothers had chosen to sell it off. Sugar has agreed to rent Merrilee the old cottage behind her farmhouse. Having heard about Marilee's divorce from a realtor, Sugar suspected that Merilee was suddenly and unexpected on her own and in need of help. She understood that need. Sugar is quick to disapprove of Merilee serving her children pizza, and even more appalled to find out that Merilee can't cook. Sugar takes it upon herself to give Merilee cooking lessons. Merilee and Sugar form a strong bond as they share stories, and ultimately the secrets from their past. Merilee meets Heather Blackford the first day of school at Winwood Acadamy. Heather is the epitome of southern perfection: rich, blond, glowy, dressed in tennis whites, and driving a Porsche SUV with a trunk full of gift bags for all the kids on their first day of school. She is just to much. She is the class mother and heads up the school upcoming Gala. While there is no love lost between Heather and Sugar, Heather takes a shine to Merilee and just demands that she chair the fundraising auction at the gala. The gala is held at Heather's beautiful mansion on Lake Lanier. It's a huge success and everyone is dress to the nines. At the end of the evening Merilee discovers a body floating in the lake. Several days later, Merilee is brought into the police station as a suspect for the murder. \"You only need one really good friend to get you through the hard stuff.\"Humor, southern charm and wisdom are being dispensed to the Sweet Apple, Georgia community in the form of a new blog titled \"The Playing Fields: Observations of Suburban Life in Sweet Apple, Georgia...\" which is tagged as \"Your Neighbor.\" Sweet Apple folks are abuzz wondering who this anonymous blogger could possibly be and how do they know so much. REVIEWThis was my first book by the best selling author, Karen White, and l was so impressed by the depth of her character development and the breadth of the story she tells. This story was both immediately engaging and entertaining. Can't wait to read more Karen White books! Thanks to my friend, Marion Hoffman for the recommendation!The overall story alternates between Merilee and Sugar. Sugar's portion of the story occasional jumps from the 2016 to the 1930's and 1940''s for Sugar's backstory. These transitions and jumps in the book are effortless for the reader. I absolutely loved the inclusion of the \"The Playing Fields\" blog. The posts are creatively interspersed throughout the book and add much humor and levity. And while White keeps the the Sweet Apple community in the dark about the identity of the blogger, you will know who it is at the end, if not before!And what's not love about Sugar Prescott. She is by far my favorite character in the whole book. She reminds me so much of my grandmother, Mamie, who was born and raised in Magee, Mississippi. Everyone in town knew Mamie. She was always baking something wonderful. Mamie cooked lunch for the Lion Club every Wednesday for 30 years and she made the best fried chicken, chicken and dumplings, and sweet pickles ever! And she was not shy about telling people what she thought, just like Sugar. The Night The Light Went Out has so many intertwining stories that the book is definitely not boring. There are friends to meet, stories to uncover, secrets to share and mysteries to solve. Throw in a romance, a tornado and the lights going out and this book is just down right great! Favorite Quotes:\"Life shouldn't be an unbroken road of wonderful. It's the curves in the road that build character and show us our mettle.\"\"Life's journey doesn't mean much without friends.\"\"Every path has its puddles, but that doesn't mean we shouldn't travel them. We just need to remember to wear our boots and bring our friends and those who love us.\""}], "description": "15 hours, 19 minutesFrom the New York Times bestselling author of the Tradd Street series comes a stunning new novel about a young single mother who discovers that the nature of friendship is never what it seems....Recently divorced, Merilee Talbot Dunlap moves with her two children to the Atlanta suburb of Sweet Apple, Georgia. It's not her first time starting over, but her efforts at a new beginning aren't helped by an anonymous local blog that dishes about the scandalous events that caused her marriage to fail.Merilee finds some measure of peace in the cottage she is renting from town matriarch Sugar Prescott. Though stubborn and irascible, Sugar sees something of herself in Merilee--something that allows her to open up about her own colorful past.Sugar's stories give Merilee a different perspective on the town and its wealthy school moms in their tennis whites and shiny SUVs, and even on her new friendship with Heather Blackford. Merilee is charmed by the glamorous young mother's seemingly perfect life and finds herself drawn into Heather's world.In a town like Sweet Apple, where sins and secrets are as likely to be found behind the walls of gated mansions as in the dark woods surrounding Merilee's house, appearance is everything. But just how dangerous that deception can be will shock all three women....", "title": "The Night the Lights Went Out", "url": "https://www.goodreads.com/book/show/32281670.The_Night_the_Lights_Went_Out", "average": 4.05, "cover": "https://images.gr-assets.com/books/1483454144l/32281670.jpg", "reviews": 996, "authors": [{"url": "https://www.goodreads.com/author/show/160033.Karen_White", "name": "Karen   White"}, {"url": "https://www.goodreads.com/author/show/107378.Carolyn_Cook", "name": "Carolyn Cook"}], "type": ["Fiction", "Mystery", "Womens Fiction", "American", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/32281670-the-night-the-lights-went-out", "http://www.goodreads.com/book/show/32283422-the-night-the-lights-went-out", "http://www.goodreads.com/book/show/32284000-the-night-the-lights-went-out", "http://www.goodreads.com/book/show/32609836-the-night-the-lights-went-out", "http://www.goodreads.com/book/show/4505161-the-house-on-tradd-street", "http://www.goodreads.com/book/show/23398961-the-sound-of-glass", "http://www.goodreads.com/book/show/10283872-the-beach-trees", "http://www.goodreads.com/book/show/7250052-on-folly-beach", "http://www.goodreads.com/book/show/6330979-the-girl-on-legare-street", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}