{"ratings": 29, "userreviews": [{"userName": "Dawn Livingston", "userReviewDate": "Jan 04, 2015", "userURL": "http://www.goodreads.com/user/show/28140212-dawn-livingston", "userReview": "I've been curious about Native Americans (I live in the US) for ages. I've read enough to know Native American's history involving Whites is beyond tragic, dozens of stories involving the lies and deception and cruelty of Whites toward Indians. I got this book out of curiousity because I'm not really familiar with other indigenous peoples, like Aborigines and the Maori though the only thing I know about them I learned from Crocodile Dundee and Once Were Warriors.This book was amazing, not only in the details but the overview of indiginous peoples around the world. So much that I didn't know anything about, so many peoples I'd never heard of.Apparently, Native Americans aren't the only peoples to be so deceived and taken advantage of. However, another thing they have in common which seems somehow worse is that they have not recovered from being mistreated, they have not been able to crawl out of the hole they were thrown in.Of course, there is some hope, some peoples are starting to use the system to their advantage. Good for them!I'm white and I don't feel guilty because I'm white, but I do see that grave injustices were done over and over to the Native Americans. In my curiousity I've read this book and found that those injustices were not unique to Native Americans but so many others. I don't like injustice, I like to help where I can. What's been done can't be undone, but I'd really like to know what I can do to help. There doesn't seem to be any practical book on how to help NOW. I don't think I can help those in other countries so I'd settle for what I can do for Native Americans today. Half seriously, the only thing I can think of is go to a Native run casino. It seems quite fair that since Whites took things from Natives for profit \"legally\" that Natives now take money from Whites legally."}, {"userName": "Stacie Nishimoto", "userReviewDate": "Aug 14, 2009", "userURL": "http://www.goodreads.com/user/show/2352791-stacie-nishimoto", "userReview": "Very bummed that I have to return this book to the Tinku libraryProvides information on complex and contentious topics (land rights, NGO's, ethnic equality, shamanism, biopiracy, development, fertility, colonization, global law, etc.) through case studies, quotes by indigenous group leaders, and song/poem lyrics. (my only complaint: the beginning chapter is fairly dry as Hughes attempts to pin down a workable definition of 'indigenous')'Once I moved about like the wind. Now I surrender to you and that is all...My heart is yours and I hope yours will be mine.'-Geronimo (N. American folk hero)"}, {"userName": "Jeffrey", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/9317864-jeffrey", "userReview": "Such a clever and useful overview of Indigenous people globally - helps to provide a lot of perspective"}], "description": "Indigenous peoples have long suffered from exoticization. Outsiders elevate their beauty, remoteness and difference and do not see beyond this to the real problems they face. The No-Nonsense Guide to Indigenous Peoples looks beyond the exotic images, tracing the stories of different indigenous peoples from their first (and often fatal) contact with explorers and colonizers. Much of this history is told here by indigenous people themselves.They vividly describe why land and the natural world are so special to them; how it feels to be snatched from your family as a child because the government wants to “make you white”; why they are demanding that museums must return the bones of their ancestors; how can they retain their traditional culture while moving with the times; and what kinds of development are positive. This short guide discusses all this and more, raising countless issues for debate.", "title": "The No-Nonsense Guide to Indigenous Peoples\n      \n          (No-Nonsense Guides)", "url": "http://www.goodreads.com/book/show/777027.The_No_Nonsense_Guide_to_Indigenous_Peoples", "average": 3.83, "cover": "https://images.gr-assets.com/books/1374000550l/777027.jpg", "reviews": 3, "authors": [{"url": "https://www.goodreads.com/author/show/408709.Lotte_Hughes", "name": "Lotte Hughes"}], "type": ["Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/777027.The_No_Nonsense_Guide_to_Indigenous_Peoples", "http://www.goodreads.com/book/show/16565511-the-no-nonsense-guide-to-indigenous-people", "http://www.goodreads.com/book/show/1577028.Moving_the_Maasai", "http://www.goodreads.com/book/show/4835744-interviewing-children", "http://www.goodreads.com/book/show/1090497.Environment_and_Empire", "http://www.goodreads.com/book/show/13417177-a326-empire", "http://www.goodreads.com/book/show/17454497-managing-heritage-making-peace"]}