{"ratings": 1435, "userreviews": [{"userName": "Jerry Jose", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/41460658-jerry-jose", "userReview": "I have learned a great deal about Zombies; wish I could say the same about International Politics.Intention behind reading this book, and the book as well, was to make International Political theories interesting for a casual reader, under the pretext of hypothetical apocalypse involving flesh-eating ghouls. Author demonstrates rigorous scholarship in defining zombies, using movies and social science literature as data source on events akin to an attack of the undead: pandemics, disasters, bio-terrorism, and so forth. Book then proceeds with variegated predictions of different international relation theories at the wake of outbreak, with references and footnotes from Romero's Night of the Living Dead to Zombieland and World War Z , which had me fuming with pride over my reading choice.Author tries his level best in using contemporary movies like Shawn of the Dead and Resident Evil as reference material. But he easily falls short on the same and ends up finding solace in George Romero flicks, which readers of my age might not easily relate with. As for political theories, zombie contagion is considered with cross-border relations, military tactics, evacuation logistics, refugee policies, homeland security measures and all other jargons that you can include in etceteras. Though the book discusses psychological response quite well, things turned a bit apprehensive with responses from anarchist, realist, liberalist, neo-conservatalist, constructivist povs in domestic and international scene.Zombie culture has got this infesting nature much like zombies themselves, from Fallout to Call of Duty to Pride and Prejudice, which make it an ideal parable premise to go cold turkey on complex theories. But even with such an ambitious theme, this is just another non-fiction book, trying its level best to look cool."}, {"userName": "Deniz Cem Önduygu", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/2459318-deniz-cem-nduygu", "userReview": "I started this book with high expectations, partly because of its great cover design, but mainly because I was excited by the sense of humor of an author putting together the topics of international politics and zombies. Never have I been so wrong.Ever since I first heard about the book, I'd been envisioning a tongue-in-cheek, sarcastic or absurdist attitude; instead, the author is almost apologetic about writing such a book, repeatedly explaining why he dared to bring these topics together and what good it can create. On top of that, the whole book (except its cover design) lacks the dead-seriousness that could have made this project a success in my mind. The forced analogies, the cheesy jokes, the cuteification of charts and graphs with brushes and comic fonts, the cartoons, all steal away from the force and the message of the cover. But maybe most importantly, the book is so short and the bringing-together of international politics and zombies is so superficial that it just doesn't work. I love the zombie canon, and I was eager to learn some things in international politics, but the whole experience for me consisted of waiting for when things would get interesting. In the end, I don't feel like I learned anything, and I sure wasn't entertained by all those grandpa jokes about zombies. I wish the editor had the vision to tell the author \"The idea of bringing these two topics is funny enough, and if you do it thoroughly and seriously, it will be highly informative and funny at the same time.\"I mean, zombie governments? Come on."}, {"userName": "Brian", "userReviewDate": "Mar 30, 2012", "userURL": "http://www.goodreads.com/user/show/1938805-brian", "userReview": "Take an insightful professor of international politics with a great sense of humor, mix in the entire canon of zombie lit and cinema, and you have the recipe for a delightfully fun and irreverent look at the \"what ifs\" of a world gone mad with brain eating hordes.Drezner's preface to the book uses a Graceland tour guide as the analogy to what his treatise hopes to be; and it works. His posits are well researched and plausible - even though he is dealing with a subject matter pure fiction. Yes, he's jumping on the financial bandwagon for everything that is zombie (the hottest horror ticket in town over the past few years), but that doesn't detract from a real think-piece that places the reader in his world of possible outcomes of a world-wide pandemic. This book is worth the invested time (most should be able to finish it in one sit)."}, {"userName": "Harrison", "userReviewDate": "Nov 22, 2011", "userURL": "http://www.goodreads.com/user/show/5835580-harrison", "userReview": "I'm not entirely proud to say I read this. Still, it was far better than I expected. I honestly checked it out for the International Politics angle rather than the \"braaaaains\" angle. I took several courses in International Relations while in college and I always had problems keeping the distinctions between the various schools of thought straight. This book explained them in a way that made sense, and was entertaining. Still, Drezner could've gone deeper into explicating the theories without losing his audience. His reliance on external sources as opposed to explicating a clear definition of one zombie threat and analyzing alternate theoretical reactions was a rather weak approach. He would've been better off had he relied less on the fictional 'primary\" sources, and instead stuck to even more real world examples. While the puns were occasionally groan-inducing, they were definitely amusing. I'd recommend it to either a student of International Politics, or a fan of zombie literature, but I can't really say a casual reader would become a fan of either just by reading Theories of Intl. Politics and Zombies."}, {"userName": "Mike", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/1885544-mike", "userReview": "I heard an interview with the author of this book on public radio and it sounded great. Use the idea of a zombie outbreak to explain the different schools of thought in international relations. How would a neo-conservative think the world would respond to this crisis? And how does this same neo-con believe we should respond? What about those from realist or liberal schools of thought? And so forth.Problem is, I think it made a much more interesting and funnier interview than it did a book. It's not that I hated it but the joke seemed to get old pretty quickly. I think that ultimately, this would have been better if just left as a long article in a magazine rather than trying to stretch it into an entire book."}, {"userName": "Will", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/1121158-will", "userReview": "This book started to concern me when it said that Marxism would be pro-zombie as it would view them as the proletariat -- which is ridiculous, zombies don't own the means of production, they're a plague on the workers.It lost me completely when it started showed a picture of a woman in a miniskirt, holding a zombie head on a spike while talking on a cellphone and feeding fast food to a five year old, with the caption \"Debates about whether women can “have it all” are likely to persist during the apocalypse.\" And keeps going with a chapter that talks shit about feminism. (See the quotes to the side for details.)Fuck this book. Aborted."}, {"userName": "Atila Iamarino", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/5648532-atila-iamarino", "userReview": "Uma leitura bem curta e rápida sobre como seria tratada politicamente uma epidemia zumbi. Estava esperando uma análise do cenário político atual usando esse pretexto, mas não foi bem o caso. Acaba sendo mais um livro sobre como o mundo se comportaria com uma epidemia zumbi, algo que já foi bem explorado e escrito de maneira bem mais interessante no World War Z: An Oral History of the Zombie War."}, {"userName": "Tucker", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/308912-tucker", "userReview": "Drezner presents good questions. Why, indeed, does every Hollywood zombie outbreak cause an instant apocalypse? Wouldn't it be more likely that zombie infections would move more slowly like a regular plague, that people would be skeptical at first, that they would cooperate with each other to survive, and that governments would react like the human organizations that they are? Much to chew on."}, {"userName": "Nostalgia Reader", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/6560108-nostalgia-reader", "userReview": "2.5 stars.This was a great overview of the various theories of international politics... I had read most of the theory parts before my IR class started, so I was going into this with a bit of a blind eye. However Drezner summarizes the main aspects and points of the theories quite well at the beginnings of each chapter. Looking through my IR book at their definitions, I can certainly see why this book was written! But once each theory started being broken down into zombie terms and how each type of theorist would deal with a zombie outbreak, I started getting more confused. The zombie-less summary made sense, but with the zombies, it started just becoming a bit jumbled. It also didn't help that this is essentially an IR/poli-sci journal article in book form, and since I'm not at all a poli-sci scholar (just casually interested in a few aspects of it), I probably missed out on some connections, simply because I just... didn't know what they were talking about.However, it was a fast read, and I did gain a lot from the book--I never would have known about the various theories until my class started, and I know that my class would have just delved right into the complexities. This gives the reader a \"lighter\" introduction to the theories. If you've taken IR before and know these terms but are still confused, I would definitely recommend this. This book is more intended to clarify the theories, rather than actually teach them, so if you don't know anything about it, it might be helpful to look into the theories as your reading about them.Rounded up to 3 stars because this is a great book, and the zombie correlation is a great one."}, {"userName": "Christopher", "userReviewDate": "Mar 23, 2011", "userURL": "http://www.goodreads.com/user/show/772327-christopher", "userReview": "So, you all have read the Facebook challenges about what you would do if the zombie apocalypse comes. You know what your weapons are, who your teams are. I assume you've been to the ZombieSquad webpage and built your bug-out-bags.But what will our leaders do? How will nations act when cross-border zombie infiltration and infection becomes a problem?This book looks to answer those questions. By surveying popular media portrayals of zombies and human responses and combining that data with leading theories of international relations, this Tufts University professor begins to provide a framework in which to predict government actions in such crises.In all honesty, this really is an accessible primer on realism, liberalism, constructivism, and other IR concepts. The application of zombies as our \"testing to destruction\" format allows for humor (although the body-part puns do get a bit heavy at times) and an analysis that doesn't get too bogged down in specifics.Reading this through, I find I have new-found respect for Max Brooks and World War Z. Now I have to build in IR theory in any of my world-building efforts....and I was still trying to figure out how to model plate tectonics."}, {"userName": "Kushal Saharan", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/32006527-kushal-saharan", "userReview": "Though I have virtually no formal knowledge of International Relations Theory, I thoroughly enjoyed reading this one. I am not sure how useful this would be for anyone looking for an introduction to International Relations Theory (not much I guess) but this book gives a good overall view of different ways the problem of Living Dead would be addressed. The book contains amusing references to popular Zombie-related movies and books, using them to illustrate and buttress variegated responses by the humans ( non-flesh devouring ). Also scattered throughout the book, are interesting takes on the status quo sometimes stated more explicitly than others.For the record my personal favourite response-cum-outcome (no I don't look forward to it) description was the norm cascade (I will refrain from giving out any details for the sake of the probable-readers )."}, {"userName": "Benny", "userReviewDate": "Jun 09, 2011", "userURL": "http://www.goodreads.com/user/show/5503156-benny", "userReview": "It's quite an amusing book, and I had fun reading it. It also clarified the basic principles of some schools of international relations that I hadn't been exactly clear on. However, I think you'd have to be a) very much MORE into international relations than I am and picking up on some of the subtle cleverness of his presentation, b) very much LESS into international relations and the social sciences in general than I am, and have this as a true introduction, or c) very much more familiar with the zombie canon to really love it."}, {"userName": "Melanie", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/6167913-melanie", "userReview": "I don't normally read and review academic texts on Goodreads, but when the academic text is about zombies, how can I resist? All kidding aside, this is a brilliant work on internationals relations theory. It takes a subject which can easily be boring, dry, and borderline incomprehensible to anyone outside the field and makes it fascinating, hilarious, and incredibly accessible to the layman. I would advise anyone with interest in international politics (or in zombies!) to give it a read."}, {"userName": "Amanda Lynn", "userReviewDate": "Sep 28, 2014", "userURL": "http://www.goodreads.com/user/show/30240392-amanda-lynn", "userReview": "I was rolling with laughter because of how hilarious I thought it was... until a little after halfway through the book when I came to the realization that Drezner wasn't actually trying to be funny, but prove a point. I solemnly finished the book. Each page turned there afterwards left me with a more depressing and sobering realization than the next that, no, he was indeed not just making a funny."}, {"userName": "Yair", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/5093351-yair", "userReview": "This felt like a Cliff Notes version of a dry international text, spiked with zombies a la Grahame-Smith. It was often a bit dry and strained and nowhere near as enjoyable as, for example, World War Z, but Theories of International Politics and Zombies was still a quick enough read and laugh-out-loud funny enough in enough places I'll generously give it four stars."}, {"userName": "Tree", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/2697615-tree", "userReview": "All around interesting read. I bought it to learn a little about international politics. And zombies. And I actually learned about both! It actually made the material... come alive, shall we say? It's definitely food for brains, which beats brains for food."}, {"userName": "Mwakamui Iluya", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/48789913-mwakamui-iluya", "userReview": "I'm a bit bitter because one of my favourite schools of thought and critical theory in International Relations theory was missed out - post colonialism. I'm a bit bitter. Otherwise good for summarising and a reminder of IR theory. The constructivist paradigm was a fave."}, {"userName": "Wes", "userReviewDate": "Jul 08, 2016", "userURL": "http://www.goodreads.com/user/show/28310731-wes", "userReview": "As he enters into the conclusion of Theories of International Politics and Zombies, Daniel W. Drezner notes that zombie cannon, in both film and fiction, is often in a hurry to get right to the seemingly inevitable apocalypse. Drezner, however, is in no such hurry. this is appropriate for two reasons, the first being that his study is primarily one concerned with politics (and so not a new addition to zombie literature), and the second being that in considering the most likely state and international response to a zombie threat, Drezner makes a convincing argument that such a biblical reckoning is in no way assured.The book progresses logically, outlining and detailing its central independent variable - zombies - according tot he available literature, before considering the likely policy responses of sovereign states and international coalitions according to the political theories of realism, liberalism, neo-conservatism, and constructivism. Additionally, a very broad sociological view is taken to consider the domestic American response, the role of bureaucracy, and the effect of bias and behavior in individuals. The application of these theories toward the undead problem would be entirely fanciful if only the zombie cannon was considered, but absent historical incidence, analogues satisfy Drezner's base from which to consider expected human responses to the undead. Global power dynamics and social networking are used in some areas, but the primary analogue is the spread of infectious disease. This method of consideration has some precedent, as the Center for Disease Control has made repeated use of zombies to encourage pandemic and disaster preparedness, first in 2011 with a brief zombie preparedness guide and later in 2012 with a graphic novella. Drezner's conclusions on the international response to the undead proceed logically enough if deficient in depth, but with tongue planted firmly in cheek, the book provides an introductory guide to international politics that succeeds in attracting those uninitiated (or disiniterested) in world politics and in giving future zombie literature a point of reference for the expected policy responses and outcomes of nation states - one that is imminently less hopeless.In the acknowledgements following Drezner's conclusion, the author thanks political scientist Kenneth Waltz for his contribution of his book, Theory of International Politics, from which Drezner bases his book's title and the chapter on realism, which resembles the structural realism introduced by Waltz (popularly \"neorealism\"). The two books are fundamentally different in approach however. In the opening chapter of Waltz's book (excerpted in Keohane), the author states his intentions quite clearly, which is, paraphrasing, to 1) examine existing political approaches and their theoretical importance, 2) construct a remedial theory to those theories, and 3) examine the applications of this new theory, structural realism. Drezner's intentions are not so grand, nor are they so earnest. Instead, the tone and intention are described well in Zombie's preface, where the author equates himself with a tour guide of American cultural schlock, whose goal it is \"to provide a veritable font of knowledge\" to the devout, while \"acknowledg[ing] the absurdist nature of the experience.\" This description comes close, but as the \"veritable font\" never seems to exceed a shallow pool of general summaries on the theories discussed, even while the absurdist cup runs over, it becomes clear that this is a work directed toward an audience just wetting their feet in the study of international politics, and not for those who have already been baptized in it.The absurdist nature of Theories of International Politics and Zombies is supplanted into every chapter - if not every page - of the book, and serves primarily to provide the humor which maintains the engagement of readers less concerned with the greater narrative. In presenting himself as an impartial scientist, he frequently regards the living dead in terms that avoid demonizing or stigmatizing them, referring to them as the \"viably challenged\" and \"differently abled\" when most political correct, although \"ghoul\" is clearly used as a pejorative term. Drezner also relates to great comic effect the social behavior of the undead to social norms. This is especially true in the chapter on constructivism where he notes that in some ways zombies conform to favorable norms; zombies do not discriminate, and they lead a very ecofriendly existence, \"walk[ing] everywhere and eating only organic foods.\" Expanding on the rule of social norms in constructivist theory, Drezner suggests that as zombism became the dominant social norm, humans would act similarly in order to fit in. Equally absurd, on the subject of zombie dominance in political realism theory the author suggests sovereign states allying with a zombie nation to prevent increased zombie national power at the expense of their own. Even as these passages amuse they provide the reader with a general outline of how each theory understands political cooperation, competition, and responses to threats against the security, prosperity, and power of a sovereign state, although the latter descriptor (power) is ephemeral and its meaning varies in accordance with the theory that perceives it.Drezner is largely successful in meeting the informational needs of the reader just entering into the discussion of international politics, but falls short of similarly informing the critical devotee to which he, as tour guide, also aims to address. Had he been trying to appease such a critical class of reader his work would have had to open with a litany of carefully considered and thoughtfully arrived at definitions to terms that are taken for granted in Drezner's text, as is the case of Waltz's work, which tries to exhaustively define law, theory, model, and a number of other terms fundamental to the discussion. Drezner would have also needed to contribute something new to the discussion of international politics, a distinct - or at least iterative - theory beyond the description of what exists presently in the field. Of course the introduction of the zombie is somewhat novel, but in many cases you can substitute \"zombie\" with \"H1N1,\" \"SARS,\" or \"Ebola\" and have a description of events in documented history rather than hypothesis meriting closer inspection. But surprisingly, this is exactly why Drezner's book is so effective. Without delving into the complicated definitional narrative of a more scholarly work, Theories of International Politics and Zombies serves as an overview of international politics outside the walls of academia and the sciences. Its content is made more memorable by the inclusion of humor and more relatable by antagonists familiar from both fiction and real life (in the case of infectious diseases). At the same time it meets the needs of the political scientist as a piece of entertainment, rather than a piece of informational theory.Theories of International Politics and Zombies does have a couple stumbles in its presentation of existing theories, particularly because the nature of humor makes bias an endemic problem. This is especially noteworthy in the chapter focusing on neo-conservatism, in which Drezner's own political stripes seem to intrude. As a vocal critic of the War in Iraq after its inception (he supported it initially), Drezner notes with biting humor that while neoconservatives would be quick to identify potential threats from the undead, there would be concern that \"the initial neoconservative response to a zombie outbreak would be to invade Iraq again out of habit.\" He further goes on to suggest that hardcore neoconservatives would expect such actions to inspire the nearby undead to want to rejoin the living and somehow liberate themselves from teh oppression of not being alive. This is immediately familiar to the Iraq war idea that by engaging the Iraqi regime America was leading Iraqi civilians to liberate themselves. If you believe in such a doctrine then this is a straw man argument, whereas Drezner might argue he is using the absurd to illustrate the absurd -that is, people affected in military conflict zones will no more be inspired for (or capable of) self-liberation than zombies to regaining their vitality.When measuring the success of Drezner's work against its arguable weaknesses, the book is stil an excellent introduction (if not the best introduction) to the subject of international politics available to readers unfamiliar with the subject. This is even true in cases similar to that of this reviewer, who while familiar with the goings-on of world events had never developed or considered a formal theory of politics based on any established paradigm. As to whether or not the book is a suitable companion to coursework in the political sciences, it depends on the intentions of the course. It is certainly a strong introduction to greater critical theory of political science in historic context, but it is important to consider that no single theory is applicable across all the actors and actions in the anarchy of international politics, despite many claiming as much. So long as a wide swath of policy, actions, and motivations are considered, Theories of International Politics and Zombies makes a great companion to considerations of everything from democracies to despots.Except for developing nations. Drezner and zombie cannon both agree that developing nations will be decimated by a plague of the undead.This book is of no help to them."}, {"userName": "Tara van Beurden", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/4987429-tara-van-beurden", "userReview": "In an International Relations Theory class a year and a half ago, my lecturer mentioned this book, probably because myself and my friends kept suggesting aliens as a solutions to all IR related problems. Being of the nerd persuasion, I immediately went out and purchased the book, though its been sitting on my pile for sometime since. In the middle of reading a much longer book on network theory, I decided to pick this book up to break up my reading. It's a nice, fun, quick read, that introduces readers to the key IR theories in a fun way. As I've already got a pretty good grounding in IR theory (I topped that IR theory class - haha!), I found it really easy to read - not coming at it as a newcomer, I can't say whether the book is deserving of the recommendations it gets to new students. As for its application of theory, I think its relatively sound. I don't agree with all of it to the letter, but the core is there, and though I would have preferred Drezner explained more of the critical theory part of the book (I personally would have gone with the racial aspect of critical theory than feminism, but to each his own), ultimately, I think it had good coverage. It's a silly fun book, that I probably won't quote in any assignments, but will recommend to anyone who shows a passing interest in IR theory."}, {"userName": "Declan Fleming", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/82807124-declan-fleming", "userReview": "This is a great introduction to international relations theory, particularly for undergraduate university students (or those about to commence university) and people with a general interest in the subject matter. Having personally read this in the holiday between high school and university I found that this book helped introduce some key theoretical ideas to me that were useful to know going into an introductory international relations course. This is because it clearly communicates many of the fundamental features of the major theoretical approaches in the discipline via frequent pop culture references/analogies. Understandably this aspect may annoy some readers, particularly if one is reading for personal entertainment/interest. As a learning tool however, these references are very helpful. The main weakness with this text is that its introductory nature and brief length mean a lot of nuance is missing in the descriptions of each theory. I read the book a while ago, but I recall Drezner's explanations of certain critical theory approaches to be particularly simplistic. He does however provide decent footnotes and suggestions for further readings on each theory if one does want to understand them more deeply."}, {"userName": "Jose Edgardo", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/24814664-jose-edgardo", "userReview": "The importance of incorporating pop culture into policymaking was very much highlighted in this book. How would individuals, governments and international organizations respond to the threat of a zombie outbreak? The author made use of several theories in international politics for the audience to better understand the different factors of human behavior, organizational culture and gender and how they would affect or disaffect our decision making.Though the book was very much well-researched in both zombie and international relations literature, I felt like it still was still lacking in terms of other explanatory concepts such as religion, culture and class in predicting how humans would react. I think it still served as an interesting introductory text into non-traditional security and behavioral psychology in a very interesting and engaging manner."}, {"userName": "Will Staton", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/5853504-will-staton", "userReview": "An entertaining and useful intro to theories of international politics, but ultimately limited in its scope and utility. Drezner does a good job of highlighting the strengths and limitations of various international relations paradigms, but his overarching point - think outside the box to find creative solutions for unique, 21st century problems - is limited by his own and assumptions and constraints in his hypothetical zombie apocalypse scenario. If as he's saying, think outside the box, but only within these parameters. A quick, fun, and helpful introductory read that brings includes some entertaining sarcasm. Worth it for someone looking for an easy intro, or perhaps someone who wants to rethink their old understanding, but not deep enough to really probe important issues."}, {"userName": "Todd", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/12256565-todd", "userReview": "When I decided to read this book I was looking for an amusing and light hearted primer on the basic concepts of international relations. The language of the book was much dryer and academic than I expected, and it took me far longer to get through such a small volume than I had anticipated.Further, its focus was much more on zombies, and less on the basics of international relations that I was hoping for.This book is a tongue-in-cheek textbook whose humor consists of repeating the same joke over and over. \"Haha I just finished that dry and difficult to read sentence with 'flesh-eating ghouls.'\""}, {"userName": "J Everett", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/48444106-j-everett", "userReview": "It is what the title suggests. It's funny in a dry way. It's enjoyable, though quite short. It doesn't get five stars because I wanted a bit more. I wanted a comparative analysis of policy and security problems faced in the real world with zombies as an analogical bridge. I wanted more discussion of refugee and migrant crises, disaster response, national security challenges. Instead, it focuses mostly on the most popular camps of ir, and gives a couple dozen pages to exploration of how domestic and international pressures might help or hinder state response to a zombie outbreak. Pretty cool, but I was left hoping for something more in depth."}, {"userName": "Hataipat", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/13345983-hataipat", "userReview": "ชอบหนังสือเล่มนี้นะคะ ตอนเเรกหลังจากได้รับคำเเนะนำ (ค่อนข้างไปทางโน้วน้าวจากเพื่อนท่านหนึ่ง) ให้ซื้อมาอ่าน ตอนเเรกเราค่อนข้างไม่ได้ตั้งใจจะซื้อเลยสักนิด เพราะเราเคยอ่านเวอร์ชั่นต้นฉบับมาก่อนเเล้วด้วย เเต่เพราะทนความอยากรู้ไม่ไหวเลยซื้อมาจนได้ ความเเตกต่างของต้นฉบับกับเวอร์ชั่นเเปลนั้นไม่ได้มีอะไรเเตกต่างกันมากมาย เเต่ที่เห็นได้ชัดคงเป็นอารมณ์ขันของหนังสือ ซึ่งนับว่าเป็นเสน่ห์ของหนังสือเลยก็ว่าได้ ที่อาจจะไม่ได้อรรถรสเท่าต้นฉบับ เเต่เวลาอ่านฉบับเเปลเรารู้สึกได้ถึงความพยายามในการถ่ายทอดเนื้อหาของผู้เเปล ถึงเเม้ว่าจะไม่ได้ตลกขบขันอะไรเท่าต้นฉบับ (ซึ่งลึกๆเเล้วเเอบหวังว่าจะตลกกว่านี้) เเต่เวอร์ชั่นเเปลทำได้ดีในการให้ความรู้สำหรับผู้ที่สนใจทฤษฎีIR ได้ดีเลยทีเดียวค่ะ"}, {"userName": "Apinya", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/73868262-apinya", "userReview": "เนื้อหาสนุกและเข้าใจง่ายมาก หนังสือพาเราไปเรียนรู้เกี่ยวกับทฤษฏีความสัมพันธ์ระหว่างประเทศแบบต่างๆ ทั้ง Realism, Liberalism, Constructivism และ Feminism โดยใช้เรื่องของซอมบี้ ซึ่งเป็น pop culture ที่ทุกคนรู้จักดีมาอธิบาย ตรงนี้ที่ทำให้หนังสือสนุก เพราะภัยคุกคามไม่ใช่ การก่อการร้าย สงคราม หรือภัยธรรมชาติ เหมือนหนังสือ IR เล่มอื่นๆ อย่างไรก็ดีคิดว่าการแปลยังไม่ค่อยสละสลวย แนะนำให้อ่านฉบับภาษาอังกฤษเลย เพราะมุกตลกบางอันในเรื่องถ้าอ่านจากต้นฉบับเลยจะสนุกและได้อถรรสกว่า"}, {"userName": "M J  Harrow", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/47406348-m-j-harrow", "userReview": "Surprisingly goodA short but fact filled journey through the different situations that would likely occur if the Zombie apocalypse ever came. If you're thinking that this can teach you something about real world scenarios, then you would be right. It is a good by for a first year I.R student."}, {"userName": "Sean Cox-marcellin", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/16264842-sean-cox-marcellin", "userReview": "Brief overview of basic theories of international relations, by exploring how they might react to the kind of \"zombie apocalypse\" that has been so popular in pop culture these days. I've got only limited exposure to zombie tropes, and felt the tongue-in-cheek approach was fun and instructional."}, {"userName": "Ayushman", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/38523311-ayushman", "userReview": "A reasonably good, light-hearted take on the rise of zombies and international relations."}, {"userName": "P P.", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/67942019-p-p", "userReview": "Interesting topic but I would like more information and details (maybe too high expectation)."}], "description": "What would happen to international politics if the dead rose from the grave and started to eat the living? Daniel Drezner's groundbreaking book answers the question that other international relations scholars have been too scared to ask. Addressing timely issues with analytical bite, Drezner looks at how well-known theories from international relations might be applied to a war with zombies. Exploring the plots of popular zombie films, songs, and books, Theories of International Politics and Zombies predicts realistic scenarios for the political stage in the face of a zombie threat and considers how valid--or how rotten--such scenarios might be.Drezner boldly lurches into the breach and \"stress tests\" the ways that different approaches to world politics would explain policy responses to the living dead. He examines the most prominent international relations theories--including realism, liberalism, constructivism, neoconservatism, and bureaucratic politics--and decomposes their predictions. He digs into prominent zombie films and novels, such as Night of the Living Dead and World War Z, to see where essential theories hold up and where they would stumble and fall. Drezner argues that by thinking about outside-of-the-box threats we get a cognitive grip on what former U.S. Secretary of Defense Donald Rumsfeld famously referred to as the \"unknown unknowns\" in international security.Correcting the zombie gap in international relations thinking and addressing the genuine but publicly unacknowledged fear of the dead rising from the grave, Theories of International Politics and Zombies presents political tactics and strategies accessible enough for any zombie to digest.", "title": "Theories of International Politics and Zombies", "url": "http://www.goodreads.com/book/show/9076475-theories-of-international-politics-and-zombies", "average": 3.73, "cover": "https://images.gr-assets.com/books/1348751077l/9076475.jpg", "reviews": 169, "authors": [{"url": "https://www.goodreads.com/author/show/219033.Daniel_W_Drezner", "name": "Daniel W. Drezner"}], "type": ["Nonfiction", "Politics", "Horror", "Political Science", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/9076475-theories-of-international-politics-and-zombies", "http://www.goodreads.com/book/show/23449115-theories-of-international-politics-and-zombies", "http://www.goodreads.com/book/show/21981704-theories-of-international-politics-and-zombies", "http://www.goodreads.com/book/show/36574976", "http://www.goodreads.com/book/show/32335738-the-ideas-industry", "http://www.goodreads.com/book/show/18695374-the-system-worked", "http://www.goodreads.com/book/show/385030.All_Politics_Is_Global", "http://www.goodreads.com/book/show/1086912.U_S_Trade_Strategy", "http://www.goodreads.com/book/show/6452102-avoiding-trivia"]}