{"ratings": 7433, "userreviews": [{"userName": "Annet", "userReviewDate": "Jan 31, 2009", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "Truly, a beautiful book. About a young woman running for her two brothers in law, in the Canadian wilderness, around 1900, after having killed her husband, this is not a real spoiler, it is clear right from the start I guess. Fighting to survive. A little slow in the beginning, especially the scenes where the Widow, Mary, is alone, were too long for me. The language and descriptions of the wilderness are beautiful, but after three pages of it, I thought, ´ok, noted about the wilderness beauty and cruelty, and now some action please´. But once she gets into contact with other people in the story, it comes alive. Especially the mine town part of the story is wonderful. I can see the comparison with Cormac McCarthy, one of my favorites, it being a dark story of an individual struggling to stay alive in wilderness surroundings, but the difference is that Cormac´s style is sober and direct. This writer has done poetry I understand, and I can see that, because the descriptions are sometimes beautifully poetic. The ending is great. You think you are heading towards a clear ending and then.... Great book, a recommendation. I can also see this book turn into a movie, and a great one too. Note: now my bf is reading the book. At first he was quite hesitant, he´s more of a fantasy story fan, but just now he said, ´well, the story is gripping indeed´..."}, {"userName": "Melki", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "[She even manages to make sex with an unwashed mountain man sound vaguely appealing. (hide spoiler)]"}, {"userName": "BrokenTune", "userReviewDate": "Dec 25, 2015", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "“Drop it. She’s done. Who knows who they were. Who knows where they took her. And even if you knew”— he spread his small hands out —“what could you do? Are you Sam Steele?” The two of them drunk for two days, until the Ridgerunner could drink no more, and merely sat holding his head. Then a long, sorry, sober night during which the dwarf had chattered to stave off his companion’s unnerving silence, telling story after story, every one about her. Wondering at the particulars of her past, the whiff of crime, her dreadful pursuers, recounting the incredible fact of her firing upon them. Questions that were unanswered and unanswerable. It had been a wake.I wish there was a better start to the new year, but this is the first book I finished and it was disappointing.Not that the book was a total waste of time but the story was just bland - especially after having read Alias Grace, The Tenderness of Wolves, and The Silence of the North.This book follows the story of Mary Boulton (\"the widow\"), a nineteen year old woman who is on the run after killing her husband. This is not a spoiler, by the way. This is given away within the first few pages of the book (and it's all over the blurb, too).Now, given that we already know why \"the widow\" is on the run and there is not much mystery to her story, I expected the book to come up with another element that would keep me guessing what happens next or how certain characters would interact or develop. Apparently that was too much to ask.I really liked the main character Mary, the widow, but there wasn't much of a journey of discovery with her or any of the other characters. It did not help that it was quite hard to get close to any of the characters because the author decided to be quirky and instead of referring to them by name referred to the characters mostly by their description or some other form of label which somewhat reduced the characters to just that preconception which was implied by the label.So, we have \"the widow\", the \"dwarf\", the \"old woman\", the \"Ridgerunner\", etc.This did not work for me. It made the book read like it was still a draft and the characters still needed a lot of work before they could gain any depth.The other elements that did not work for me was that, while the \"widow\" was on the run, there was no contemplation on her part about where she was running to or how she would escape prosecution by the \"twins\". She's on the run but seems get caught up in every encounter she makes. How is this being on the run?The second issue I have with the book is that it quickly turns into a romance, which is quite far fetched in the first place and actually distracts from what could have been an interesting book."}, {"userName": "Nancy", "userReviewDate": "Jan 26, 2009", "userURL": "http://www.goodreads.com/user/show/1956252-nancy", "userReview": "I thoroughly enjoyed this book—it’s a real page turner. It concerns a young woman who murders her husband and is on the run. The characters she encounters on her journey remind me in a way of “The Odyssey.”—The loner who saves Mary's life and steals her heart; the mining town minister who becomes her protector; the dwarf who runs the only store in the mining town of Frank; the miners, the stragglers, and the settlers—each has his or her own vitality and consciousness. Even the old tracker who dismounts \"with arthritic languor\" to read the traces of Mary's flight is memorable. She grows into a self-sufficient woman able to take care of herself as she escapes from one perilous episode after another. She falls in love with a gentle man, but discovers that even though she loves and wants him, she doesn’t need him. The writing is beautiful—descriptive and poetic, but not over done."}, {"userName": "Jo Barton", "userReviewDate": "Jun 30, 2009", "userURL": "http://www.goodreads.com/user/show/2090731-jo-barton", "userReview": "This is a remarkable first novel, reminiscent of Tenderness of Wolves, with a smattering of Cold Mountain, it's beautifully written. Very descriptive, not just of the landscape, and believe me the Canadian Rockies sound very bleak, but also of the despair and hopelesness that existed at this time. As her story unfurls,we realise that Mary is a real heroine, not always likeable, but as courageous as a lion. She meets some wonderfully quirky characters throughout her journey, who add some spice and colour to what could have been a very dark story.As you can tell I loved it ."}, {"userName": "MomToKippy", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/4631503-momtokippy", "userReview": "Pretty impressive for a first novel but I suppose the beautiful prose makes sense for a published poet. This was quite an adventure! This felt to me like a combination of Frazier's Cold Mountain and Mrs. Mike. Some passages were so visually and emotionally rich that I read them numerous times over, like tasting a good wine, you can't just have one sip. Like this one,\"As a little girl, she had lain awake at night, staring hard into her lightless bedroom, imagining that the darkened room congealed and shifted - a shadow play, black on black - and she had waited for what chimera might show itself. A strange child, she had been unafraid of these things, monstrous figures reaching for one another, sickly shapes boiling up like dumplings in dark broth. Her only fear was that they pantomimed her flaws and sins. Some nights she said her own name over and over again, as protection, as explanation.\"Or this,\"How cruel that she had really seen him, touched him. That he had been real, not another phantasm drifting greyly among the trees, a little gasp of loneliness from her afflicted mind. But a beautiful face, and a voice not merely familiar but in her bones. The Ridgerunner was gone, and she could still smell him on her hands.\"This sort of writing becomes less frequent though as the story progresses. I would have liked more. There is a lot of action for the most part which contrasted nicely with the very poetic contemplative passages, however there were some points where I felt the story was not progressing. Rather than a distinct arc, the plot has many ups and downs. There were many interesting characters with endearing qualities but the main character was a bit of a challenge for me to like. She is hopelessly lost and running and does not seem to progress out of this - every time she seems to get a life line it fails or she fails. And the constant reference to her as \"the widow\" makes her seem so distant. There is probably a purpose in that I am not getting.Overall a really strong historical novel with a unique plot, setting and time period. Would make a great movie."}, {"userName": "Linda Hopf", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/2809533-linda-hopf", "userReview": "A story about nothing, full of characters you care nothing about. Sure there are some great descriptive passages - about rainbows, darkness, the smell of horses... yada, yada, yada; but all these mental pictures connect a whole bunch of empty. I dunno - something about new Canadian writers and trying TOO hard to be clever. All those words completely got in the way of developing the story. I did not care one speck about the main character - the widow - and so her \"adventure\" meant nothing to me. I have been to all of the places/towns Adamson mentions in this story and her tale did nothing to bring out the mystery/romance/possibilities of this area and its history. And then the ending OMG - if this had been a movie you would have thrown your popcorn at the screen. Not sure why others give this 4 or 5 stars. I had to force myself to pick this book up to read and I only did it because it was the selection for my bookclub."}, {"userName": "Mary", "userReviewDate": "Aug 30, 2011", "userURL": "http://www.goodreads.com/user/show/803773-mary", "userReview": "Well, I read this all the way through, so that's something, I guess. Seems I cared enough to see how it would end, so I had to give it another star for that reason.In the books defense, I think the author almost created a female Homer's Odyssey, and that's what kept me coming back to it. A lot of running away and crashing through the woods, and then a period of bonding and domesticity, then crazy events and feats of superhuman survival and escape. The author did manage to build some sense of suspense. However, one of my first problems with the book was the way she insisted on referring to Mary Boulton, throughout the entire book, as \"the widow\". It got in the way of my being able to picture and relate to the character. Every time I read it, it irritated me. The widow\" kept making me see a gray-haired old lady, not the young, vulnerable, unprepared and quite frankly really stupid girl that she was supposed to be. I could not get a feel for who Mary was. The real problem may be that Mary just had no personality. She stumbled along in a catatonic state throughout the book. I don't know how anyone came to care enough about her to rescue her. She barely ever spoke, and when she did, she never revealed her real self. Must have been her stellar cooking, which included \"glutinous porcupine stew\". It was an impossible stretch to imagine anyone this ill-equipped and senseless surviving one night, let alone however long she was supposed to be out in the wilderness all by herself. Then the plot turns, Oiy!; I will save you the trouble-she is rescued at deaths door by a hermit who just happens to be healthy enough, young enough, and sane enough to be sexually attractive, they make mad passionate love for days on end, and then low and behold he abandons her to die in the woods (because he can't change, dammit, and all this sex is just too distracting!). Indian saves her, takes her to town; Town explodes, father figure dies, she miraculously survives; she's captured, her pregnancy is revealed, she miraculously escapes; The hermit (realizing his mistake)tracks her down, they are happily reunited. Whew, hours of reading there, folks. Spared you that. It's like a bad Novella. All that's missing is amnesia and an illegitimate brother she never knew (who turns out to be the hermit, of course). And it might have worked as a fantasy odyssey if I cared about the characters. All the Cormac McCarthy ravs in other reviews made me question what I was missing,but Balderdash, I say.(yes,you heard me, Balderdash!) Compare this to The Road and you'll pull your hair out at the insult to McCarthy. This one does not come close. I would recommend The Tenderness of Wolves if you're interested in a good historical Canadian winter murder mystery. Cormac McCarthy's The Road, of course, is the ultimate modern desperate odyssey across desolate landscape."}, {"userName": "Maria", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/1879634-maria", "userReview": "This is an absorbing narrative written in 2007, not to be confused with D. Galbadon's Outlander series. While there are some maddening stylistic inconsistencies and awkward sentence structure at times, it's a compelling story of a young woman's struggle to survive in the Banff wilderness at the turn of the last century. Ingenious plot devices include the true occurrence of a devastating landslide in 1902-03, the worst in mining history. This gets a 5 from me because it's THAT interesting, so who cares about some annoying flaws? She'll get better, or get a better editor, next time."}, {"userName": "Rachel", "userReviewDate": "Jun 14, 2008", "userURL": "http://www.goodreads.com/user/show/467866-rachel", "userReview": "A suspenseful plot drives this story of a widow on the run through the mountains for Canada from her vengeful brothers-in-law. Even in the sections where she is no longer running, there is a sense of anxiety because the reader knows her brothers are still out there searching for her. I liked this book because the plot moved swiftly but it didn't sacrifice character development. It has one brief but very PG-13 section. It is handled with tenderness but may be too much for sensitive readers. Otherwise I would recommend it without hesitation."}, {"userName": "Leo Robillard", "userReviewDate": "Sep 23, 2011", "userURL": "http://www.goodreads.com/user/show/5676638-leo-robillard", "userReview": "Gil Adamson’s first novel is a yarn well-spun, full of improbable, implausible, and near-mythical events. It is the stuff of legend, with one foot planted firmly in accurate history, and one foot treading the ether-sphere of picaresque adventure. Mary Boulton is a murderess, plain and simple. One may argue that she is the victim of postpartum depression, or overwhelming grief at the death of her child; she may even be insane with jealousy over her husband’s indiscretions. But no matter which way you slice it, Mary pulled the trigger that blew a hole in her husband’s thigh \"so the bone came out the back...[and] a pink mist suffused the air.\" Then she \"sat down to wait\" as he bled out on the floor of their isolated cabin. \"Eventually, she took up her sewing.\" On the lam, Mary scrambles half-crazed into the Crowsnest Pass and through the rocky mountains, pursued at first by dogs, and later by something more sinister – her late-husband’s brothers. Mary is taken in, befriended, apprenticed, and loved by a host of eccentric characters throughout her flight. She bears witness and survives the Frank Landslide at Turtle Mountain where \"for a full minute, the mountain seemed to billow, then slowly collapse, floating downward.\" But always and relentlessly, she is hunted by \"red-headed brothers with rifles across their backs...and fine black boots.\" Adamson recreates turn-of-the-century Canada and its vast tracks of wilderness in assiduous detail. Her language is poetic and elevating, so that even the harsh savagery of the land and its inhabitants take on an otherworldliness, a sweeping cinematic beauty. Conversely, however, the novel’s history can hijack the story. Each character Mary encounters or rubs up against during her adventures opens a new world to be explored and plumbed by the author. This can take wind from the novel’s sails. Fortunately, we have the brothers to get us back on track. All in all, it is an engrossing tale. One may well have to suspend disbelief while reading The Outlander, but Adamson does well to remind us that books still have the power to transport us beyond the mundane."}, {"userName": "April", "userReviewDate": "Jun 18, 2009", "userURL": "http://www.goodreads.com/user/show/1187958-april", "userReview": "This one was another for book club, and I have to say that when I finished it I shut the book with a snap and said “That’s it?!”This is the story of Mary Boulton, the young widow who killed her husband. That we know from the outset, as Adamson tells us this as we are introduced to the fleeing Mary. Or, as Adamson constantly refers to her, “The Widow”. As if the two frightening brothers-in-law aren’t enough to remind us of her past, this moniker is necessary as well. Don’t forget, dear reader, that Mary killed her husband.Why does Mary kill her husband? I’m not sure if Adamson intended that to be a mystery, but if so, it was a wholly unsatisfying one. And if it wasn’t meant to be a mystery, and Mary’s reasoning behind her act was meant to be obvious and sympathetic, well, Adamson doesn’t succeed with that either. Finally if it’s meant to be an illustration of her madness, perhaps he shouldn’t have told us she was half-mad on the first page.Really, I suspect Mary killed her husband so that the author would have something to keep her running.And run she does. For several hundred pages of drawn out, boring description. The Outlander can be seen as both Mary’s story and the story of those who come to assist her on her journey, and frankly I cared more for her angels than for the widow herself. There just wasn’t a whole lot there.Not in terms of characterization, anyway. In terms of mind-blowingly detailed (boring) description, well, there was more than sufficient amounts of that. In fact, I wouldn’t say I read this book so much as I skimmed it for actual plot.I almost dropped it halfway, but was spurred on by the question of those two scary brothers-in-law who are relentless in their pursuit of Mary. Do they ever find her? That was what kept me going until the rather predictable end."}, {"userName": "Wanda", "userReviewDate": "Sep 29, 2015", "userURL": "http://www.goodreads.com/user/show/1990904-wanda", "userReview": "1 OCT 2015 - a terrific read. Superb descriptions of a vast landscape coupled with strong writing skills propel the story from start to finish.2 OCT 2915 - add'l comments written to Karen: Thank you, Karen. My brief review does not do justice to the story. But, others have written more eloquently the sane thoughts. The book begs an almost immediate second reading. The first reading you are trying to stay ahead of the brothers. The second reading is when you will enjoy the writing and the evocative descriptions. The landscape becomes an additional character. (I am including this in my review.)"}, {"userName": "Lata", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/13126933-lata", "userReview": "Enjoyed this, primarily for the style of writing. And I learned a little bit too about an incident in western Canada's past."}, {"userName": "Elizabeth (Alaska)", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/2026178-elizabeth-alaska", "userReview": "Second page: Nineteen years old and already a widow. Mary Boulton. Widowed by her own hand. By this we know her name and her status as a widow. Nearly all of the book is written from her point of view and yet in nearly all of that she is called \"the widow.\" Why isn't she called Mary? Aren't we supposed to sympathize with her, even though we know from the above that she murdered her husband? I felt this constant continual reference to her status, rather than calling her by name, kept us distant from her. Characterization is important to me. The reader is never able to get close enough to her to be sympathetic. Sometimes discontent is unknown to the sufferer, a shadowed thing that creeps up from behind. It had been that way for Mary. Of course, she knew there were reasons for her unhappiness, there are always reasons. One thinks, I am unhappy, I am discontent, because of this or that. But such thoughts are like a painting of sorrow, not sorrow itself. Then one day it comes, hushed and ferocious, and reasons don't matter any more.This paragraph where she is called Mary is one of the few contradictions to my complaint. I chose this quote about halfway in, and hoped the story would now tell us of the time leading up to this discontent. I wanted justification for the murder. I did get it, but it was thin, and I felt a bit cheated. I have complained in other places about a reader wanting the book the author didn't write. I guess this would be true for me with this.So that's the negative. While the activities of the widow take up most of the novel, there are other characters as well, for she is pursued. Tracked might be a better word, for much of the action takes place in the wilderness of the Canadian Rockies and in the real town of Frank, Alberta. The plot is good and this is primarily a plot-driven novel. Perhaps what the author does best is to build tension, relieve tension, and only to build tension yet again. The ending - the very last 4 pages in fact - are superb. It is not so much a twist - a surprise - as it is fitting, though I certainly did not see it coming. It left me with a wry smile. Wry, not in a negative way, but in a fitting, even ironic, way. Due to my earlier complaints I was prepared to give this a high 3 stars, but these last 4 pages redeemed it to 4 stars. This is a debut novel. I suspect she will get better and I'll be happy to read the next one."}, {"userName": "Jamie", "userReviewDate": "Feb 11, 2009", "userURL": "http://www.goodreads.com/user/show/2015800-jamie", "userReview": "This book is hard to get into and once you sort of like it, it really is disappointing. There is just too much extra info. that, I think, takes away from the story itself. And the other problem is the amount of cursing is distracting. The intimate scenes aren't too bad but the author just writes very graphically and it's just not my choice of entertainment. Choosing and reading a good book is my outlet and as a mom w/very little extra time, I wouldn't waste it on this one."}, {"userName": "Ron Charles", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "Gil Adamson's first novel bolts off the opening page: Men with hounds are chasing a young woman through the woods at night. Nineteen-year-old Mary Boulton has murdered her husband and now, still wearing a black mourning dress made from curtains, she's running from her brothers-in-law, massive, red-headed twins with rifles across their backs.Welcome to The Outlander, an absorbing adventure from a Canadian poet and short story writer who knows how to keep us enthralled. Of course, the Girl Being Chased is one of the most enduring figures of chivalric and chauvinistic literature, a staple of television dramas and horror films (the dark street, those panicked backward glances, that plaintive cry: \"Oh, why did I wear these heels?!\"). But Gil is short for Gillian, and her strange and complicated heroine has nothing in common with Hollywood's worn-out damsels in distress.For almost 400 pages, we follow \"the widow's peculiar trajectory into the wild. The route like a skittering mouse, light-footed and almost aimless\" through the mountains of Alberta, Canada, in 1903. She has no idea where she is or how long she's been running. \"Trained for another life,\" a lady's existence of \"sonatas and etudes; the art of a good menu,\" she discovers only through trial and error which plants are edible or how sick carrion can make her. \"The widow felt the burden of her own existence,\" Adamson writes, \"the endless labour of it.\"Yet despite its momentum and the relentless fear of capture, this is a strikingly pensive novel, anchored by the stark beauty of its setting and the harsh wisdom of its narrator. Adamson almost always refers to Mary simply as \"the widow,\" and she parcels out tiny bits of information about her with tantalizing deliberation. Throughout much of the book, Mary remains a mysterious, almost abstract figure in black.We learn about her mostly during her mental lapses, when the horrors of the past briefly break through her exhaustion and hunger: \"booming in her ears, yes, but also voices, strange and distorted. . . . She was like a woman forever woken from a nightmare, afraid to go back to sleep lest it pick up where it left off.\" In those dreaded visions, we catch haunting images of Mary's privileged upbringing in the home of a severely depressed ex-minister, her hopeful marriage to a dashing gambler and the ordeal that eventually drove her to murder him -- \"the seeds of her despair and madness.\"But these are just brief interruptions in a story that remains largely in the present tense, as Mary races against starvation, exposure and those unstoppable twins, \"their identical faces vigilant and sober [with] the keen, predatory look of hyenas.\" The only corny element in this otherwise deadly serious novel, Mary's enormous, implacable brothers-in-law seem to have stomped out of a Cormac McCarthy novel or maybe one of the Terminator movies.The story catches its breath now and then when Mary runs into people willing to offer her shelter, including a kindly old woman who treats her almost as a guest, an Indian man who saves her from stumbling into battle, and a minister who challenges his parishioners to fistfights every Sunday morning.The most significant of Mary's good Samaritans is William Moreland, who, despite his allegorical last name, was a real person, a legendary woodsman who roamed all over this part of the world. He annoyed U.S. forest rangers for years by living off supplies stolen from their cabins. Adamson works actual newspaper reports into the novel to portray him as a man of almost magical stealth, \"disappearing into the woods like a djinn,\" so elusive that spotting him would be \"like seeing a real leprechaun.\" Nicknamed the Ridgerunner, Moreland is a fugitive, like Mary, and nothing about her strange manner or ghostly visions strikes him as alarming, but he has an entirely different attitude about the forest. \"Here was a man who suffered no loneliness,\" Adamson writes, \"who spent his days as he wished, who believed he could so deeply commune with nature that deer would eat from his hand and allow him to scratch their heads.”He comes upon Mary's emaciated, unconscious body and nurses her back to health. Slowly, with exacting politeness, the widow and the Ridgerunner become friends. They're both hesitant, as easily startled as wild animals, but attraction wins out. Moreland describes their woodland romance with exquisite charm and sweetness, and it seems all the more passionate for that. A lifetime of emotional deprivation has made Mary thirsty for the simple kindness Moreland offers, but living alone for so long has not prepared him for the intensity of his feelings for her. \"Thirteen years alone in the woods, no change except the seasons wagging,\" Adamson writes. \"And then there she was on the ground, demented, half-starved. Change came roaring in. Her warm body in his tent like a salacious dream, her beautiful voice, that unnerving gaze.\" His impulse to flee, to run from all human contact, \"from life itself,\" complicates both their lives in tragic ways.Meanwhile, as those monstrous red-headed twins close in, there are pages here you can't read slowly enough to catch every word. Adamson is as captivating with descriptions of vast mountain ranges as she is with the smaller calamities, like the drowning of a yearling \"frightened into madness.\" The spectacular conclusion mingles Mary's fate with a thunderous real-life disaster that took place in Alberta during the early 20th century.Several of the scenes in this novel began as poems Adamson published in a collection called Ashland in 2003, and the sharp intensity of The Outlander suggests its origins in verse. The end of a gripping narrative poem titled \"Mary\" describes men still dreaming of a woman who murdered her husband: \"They wake yelping like dogs,/striking out terrified in the dark/defending against the quick, descending fury.\"The heroine of this novel earns a very different legacy, but her story will unsettle your dreams just the same.http://articles.washingtonpost.com/20..."}, {"userName": "Julie Christine", "userReviewDate": "Jul 09, 2011", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "I love being drawn in and surprised by a great story. And when the writing is as beautiful as Ms. Adamson’s, a celebrated Canadian poet, it becomes an all-too-rare treat: a book I must tear myself away from as the clock ticks into the start of my work day. The text of The Outlander is followed by a conversation between the author, Gil Adamson, and the writer Michael Ondaatje. Ms Adamson describes an image that came to her unbidden, one which she set to paper. She saw a young woman in a black dress fleeing an unseen pursuer. The image became the opening scene of this powerful historical suspense.This is a thriller, not a mystery. We know who committed the crime, and as the story unfolds, we learn why. But the chase grabs us from the first sentence and holds us to the story’s final words, “Find me.” At times the followed become the pursuers; at times they become the left behind. The thrills are woven into a rich and deeply satisfying tale set in the Alberta Rockies at the turn of the 20th century. In the author’s gorgeous prose, the awesome and dreadful beauty of the setting is revealed. We are presented with a host of vivid, unforgettable characters: grim, ginger-haired twins bent on revenge; a Jeremiah Johnson-like recluse who runs from the shelter of love; a pugilistic preacher and an enterprising dwarf who provide moral guidance and whisky to exhausted miners; and the protagonist, Mary, a beautiful runaway, driven nearly mad with grief and terror. Her Odyssey through the mountains and plains of central Canada holds us captive. We shrink as she slowly starves, we soar when she is saved by strangers, we will her to survive as tragedy crushes her hope. There are dark and terrible images, balanced by sweet moments of humor and grace. Ms. Adamson has created a thing of magic in The Outlander- a literary Western deeply connected by careful research and intricate details to the history of its setting that is also a wonderfully imaginative thriller you cannot put down."}, {"userName": "Tara", "userReviewDate": "Nov 09, 2009", "userURL": "http://www.goodreads.com/user/show/1663300-tara", "userReview": "Not for everyone, but I loved this. If you can get through the first 100 pages, you'll be hooked. In the beginning, that dreaded literary curse of not much happening is laid down. Personally, I love nothing better than to read work by a writer who can take you from nanosecond to nanosecond in pages, if the writing is good enough, but many don't have the patience for this. Some overwrought language and metaphors at the beginning (\"Grasses grew on the heaped soil like hair on a bee-stung dog\") made me pause now and then and grimace, but I was still compelled to keep reading, and her prose eventually became smoother and oh so voluptuous (\"On every flat surface lay the gluey fossil impressions of maple keys\"). I see the criticisms from some about it being too much. For me, this is the best of what writing has to offer. Think female Cold Mountain. Or, if you've read my story collection, a female Sin Eater on steroids. If you love soft thrillers, history (though she admits to some poetic license), wildlife, nature, you'll likely love this book. Canada has some damn fine writers.Incidentally, this is a much better cover than the original and totally captures the beauty and fierceness in this novel. And concludes with a wonderful, honest, detailed interview by Michael Ondaatje."}, {"userName": "Leni Iversen", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/36264060-leni-iversen", "userReview": "The plot is quite basic: In the early 20th century, a young woman, widowed by her own hand, flees into the mountainous wilderness of Alberta, Canada, doggedly pursued by her intimidating twin brothers-in-law. And that's pretty much it. I wasn't convinced at first. I was only mildly curious about the widow's backstory and why she had killed her husband. And I'm not really into excessive nature descriptions, no matter how beautiful and elaborate the language. But then the widow started meeting \"good helpers\", and they were as outlandish as in any fairy tale. I feel the urge to list them here, but that would be taking away some of the surprise and delight of meeting them for the first time in the book. I'll just say that the reader is treated to a string of highly eccentric individuals, and I loved them all. There were times when I thought the story descended into tropes, but the author then managed to either surprise me with a twist, or at least make things less straight forward. The storytelling also had enough of raw realism to keep it real. I've often wondered that authors will write about women trekking through the wilderness, but never address the problems of hygiene and going to the toilet in the freezing cold. As if women don't have a few extra challenges in that department compared to men. Gil Adamson addresses these issues, to the extent that the distracted widow is coherent of her own state. That said, the descriptions never become crude. The author is a poet, and it shows.An example how the author joins harsh realism with the beauty of language and bittersweet humour:She took up a needle and thread and willed her fingers still to sew the boy's wound closed, while he winced and whined like a dog, the skin rolling grossly away from the dull needle, like a worm from a hook, until punctured with an audible pop. This, she thought, is what the embroidery lessons were for. And finally a heads up to those who like their reads to be clear of sex: There are a couple of sex scenes. They are, however, not excessively detailed, and not at all gratuitous."}, {"userName": "Jessaka", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/4659464-jessaka", "userReview": "“It was night, and dogs came though the trees, unleashed and howling. They burst from the cover of the woods and their shadows swam across a moonlit field. For a moment it was as if her scent had torn like a cobweb and blown on the wind, shreds of it here and there, useless.”What drew me in to this book? Her lyrical prose in the very first paragraph, and the suspense it produced. This is a story of a woman who had killed her husband and was being hunted by his two brothers. What drew me out was that the author was unable to sustain the suspense, and like the cobweb mentioned above, the story began to unravel, to be blown in the wind.Once she is out in the wilderness, starvation sets in, and a man finds her, nurses her back to health, and then they fall in love. After a graphic sex scene or two, I wouldn’t know as I don't like reading erotica, he leaves her with some food to get by on. She wants him back. What? By now, I am disgusted with the book anyway. This isn’t an adventure; it is a romance and not a very good one. What kind of man would leave a woman out in the wilderness knowing she hadn’t been making it before he showed up? And what kind of woman misses a man like this? And what does this add to the story? I think it will get better, so I read on. The author’s story continues to unravel. The girl's life becomes too mundane, and other stories that I didn’t care about began to be written into the story.At this point I wish I had been her editor. In time I didn’t care if the brothers found her or not, but I wanted to know why her baby died, and why she killed her husband. And then when I vaguely learned that, I wanted to know if she met up with that scallywag, who left her in the woods, and if they got together or if she shoots him too?"}, {"userName": "Melissa Reddish", "userReviewDate": "Sep 11, 2010", "userURL": "http://www.goodreads.com/user/show/4232839-melissa-reddish", "userReview": "I cannot recommend this book enough. There have been several references to Cormac McCarthy, a comparison that is quite apt. This is Cormac McCarthy if he was female and a poet. The language is beautiful, precise, and constantly surprising. From the first paragraph, the book compels your forward, making it difficult to put down. While we know that the widow killed her husband, we don't know why or under what circumstances, and the withholding doesn't feel cheap or gimmicky, but instead like a natural result of the widow's fractured consciousness. It just so happens to create excellent tension along the way. As the widow's memories force themselves upon her, we as readers are allowed small glimpses into her past. I love that this book doesn't provide any easy answers for what happened nor does it allow the reader to sit and ponder and wallow for long periods of time. Of course, Adamson has a way not only with language and tension, but also with character. There are many memorable characters in this book who are full of realistic quirks that make them a pleasure to read. All in all, this is a book that needs to be read immediately."}, {"userName": "John Acy Reinhart", "userReviewDate": "Feb 01, 2009", "userURL": "http://www.goodreads.com/user/show/1974554-john-acy-reinhart", "userReview": "There are books that set you up for disappointment. The writing is graceful, yet muscular, the characters are vivid and the narrative springs to life with a propulsive rhythm that makes reading joyful and as effortless as sliding across an icy pond. Yet, the ending rings hollow, as disappointing as socks for Christmas.The Outlander, Gil Adamson's debut novel, is not one of those books. The writing, the characters and the narrative are all as described above. But the ending, the ending is a wonder. It's wholly unexpected yet fitting; delivering on the expectations promised in the novel’s opening pages.A tale of a Canadian woman fleeing two implacable pursuers, The Outlander calls to mind Cold Mountain or Kent Haruf’s Plainsong. It is a powerful and promising debut."}, {"userName": "Joanne", "userReviewDate": "May 21, 2008", "userURL": "http://www.goodreads.com/user/show/340133-joanne", "userReview": "This lyrical novel is a wonderful prose poem by Gil Adamson. Prepare yourself for a cadre of characters that somehow ring true regardless of their idiosyncrasies. Ms. Adamson's imagination and frontier knowledge blend rhythmically resulting in a consuming read set in the Canadian wilderness."}, {"userName": "Bettie☯", "userReviewDate": "Jun 13, 2009", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "mp3 - this is really good as a dog-walking audio book; anyone handy to pull off my wellies?Denica Fairman reads from the novel by Gil Adamson, set in Canada in 1903.In 1903 a mysterious young woman flees alone across the West, one heart-pounding step ahead of the law. At nineteen, Mary Boulton has just become a widow - and her husband's killer. As bloodhounds track her frantic race toward the mountains, she is tormented by mad visions and by the knowledge that her two ruthless brothers-in-law are in pursuit, determined to avenge their younger brother's death. Responding to little more than the primitive fight for life, the widow retreats ever deeper into the wilderness - and into the wilds of her own mind - encountering an unforgettable cast of eccentrics along the way.With the stunning prose and captivating mood of great works like Charles Frazier's Cold Mountain or early Cormac McCarthy, Gil Adamson's intoxicating debut novel weds a brilliant literary style to the gripping tale of one woman's desperate escape. First broadcast in 2009 on BBC Radio 4.About the Author:---------------Gil Adamson has written two acclaimed books of poetry, Primitive and Ashland, and a collection of stories, Help Me, Jacques Cousteau. Her work has also been widely published in magazines and literary journals. The Outlander is her first novel. It has won the International Association of Crime Writers' Dashiell Hammett Prize and the Amazon.ca/Books in Canada First Novel Prize. It has also been shortlisted for the Commonwealth Writers' Prize and nominated for the International IMPAC Dublin Literary Award. She lives with writer Kevin Connolly in Toronto."}, {"userName": "Rob", "userReviewDate": "Aug 27, 2008", "userURL": "http://www.goodreads.com/user/show/1074513-rob", "userReview": "I was tricked into reading this book. For whatever reason, I don't read a lot of women writers. After reading reviews (many of which compared the book to works to \"Cold Mountain\" and works of Cormac McCarthy, I picked up the book. I was very surprised to find out that Gil was a woman. However, that being said, I'm glad I did. This is the story of a widow on the run across the turn of the century west from her two brother-in-laws after she murdered her husband. During her journey she encounters memorable characters as details of her past are unveiled. Early on it reads a lot like \"The Road\" because of its simplicity of language and lack of detail, and given the time period and characters encountered I can understand the comparison to Cold Mountain. And, interestingly, without a jacket cover photo, I could have gone through the first half of the book believing that this was written by a guy. However, half-way through, the point of view turns distinctly feminine, which is actually kind of a nice surprise. Overall, this was a pretty compelling read due to its simplicity of language and intriguing plot."}, {"userName": "Melissa", "userReviewDate": "Mar 30, 2011", "userURL": "http://www.goodreads.com/user/show/1494412-melissa", "userReview": "This is one of the stranger books I've read. At first, I wasn't sure where it was going and if it was going to get beyond the first big situation. But it did, and in surprising ways. I don't think anything I expected happened in this book. I weaker author would have had trouble tying together all the story chunks. But it does hang together. The author is especially good at a kind of indirect storytelling. She reveals key bits of info not always through the eyes of the person experiencing it, but through the eyes of someone watching the person experience it. It's an interesting way to handle situations that otherwise might be told in more obvious, direct ways. I had the copy that included an interview with the author by Michael Ondaatje. It's well worth your time to read this interview. A lot of what I found odd about the book is explained in the interview.Definitely worth reading. It's a glum little book that ends up being a very joyous exploration of the life of a person recovering from an extreme trauma. That may not sound possible, but read the book and you'll see."}, {"userName": "Eric", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/10855593-eric", "userReview": "This novel was published in 2007 and I have no idea how it had escaped my attention. What a wonderful treat. It gives nothing away to write the story is about \"The Widow\" and her flight into the 1903 wilderness to avoid the two, red-haired brothers of the husband that she has murdered. The novel depicts her flight from her past and the two brothers bent on returning her home to face what she has done. The writing is excellent and flows with such vivid descriptive power that you can almost smell the pines and other odors of nature. Along the way \"The Widow\" meets a variety of interesting characters, with the story being told in partial flashbacks. For those that enjoyed Wolf Road or the writing of William Gay and Daniel Woodrell, The Outlander is for you.Very highly recommended."}, {"userName": "Ms. S...........", "userReviewDate": "Jun 25, 2008", "userURL": "http://www.goodreads.com/user/show/1196664-ms-s", "userReview": "Not every book that has people spending time in the mountains is on the same literary level as Cold Mountain. Despite the book jacket's comments, however, Adamson gives us an interesting adventure story, possibly better compared to Enger's Peace Like A River. I did not feel close to the characters in this story as I did to Frazier's, but the story is tight, the landscape is its own character, and I enjoyed the last line!"}, {"userName": "Kimberly", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/7837519-kimberly", "userReview": "I read this book as part of a postal book club, but it had been on my radar for some time. I think it caught my attention when it was on the Globe and Mail’s top 100 list and sounded like a fascinating story. It did not disappoint.We follow “the widow” as she is on the run from her two brothers-in-law; she has no name. She doesn’t know where she is running too, escape is the only focus of her journey. As her pilgrimage continues, she meets various characters who in one way or another aid her without asking much of her, and come to protect her. She, in turn, learns from them and assists them.This was a very readable novel, even somewhat lyrical. I enjoyed the journey, but found myself wishing that there was more character development. Four characters in particular interested me greatly: the widow, William Moreland, the Reverand, and Charlie McEchern. There were glimpses of their past lives, but never more than that. So, the story, for me, became one that was very much plot driven. It wasn’t a bad thing, but it did leave me feeling a little bit deprived, like something was missing.Still, it was an enjoyable book and one that will stay with me for some time."}], "description": "In 1903 a mysterious, desperate young woman flees alone across the west, one quick step ahead of the law. She has just become a widow by her own hand.Two vengeful brothers and a pack of bloodhounds track her across the western wilderness. She is nineteen years old and half mad. Gil Adamson's extraordinary novel opens in heart-pounding mid-flight and propels the reader through a gripping road trip with a twist -- the steely outlaw in this story is a grief-struck young woman. Along the way she encounters characters of all stripes -- unsavoury, wheedling, greedy, lascivious, self-reliant, and occasionally generous and trustworthy. Part historical novel, part Gothic tale, and part literary Western, The Outlander is an original and unforgettable read.", "title": "The Outlander", "url": "http://www.goodreads.com/book/show/6034162-the-outlander", "average": 3.69, "cover": "https://images.gr-assets.com/books/1328552513l/6034162.jpg", "reviews": 1285, "authors": [{"url": "https://www.goodreads.com/author/show/193302.Gil_Adamson", "name": "Gil Adamson"}], "type": ["Fiction", "Historical", "Cultural", "Historical", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/6034162-the-outlander", "http://www.goodreads.com/book/show/995815.The_Outlander", "http://www.goodreads.com/book/show/2321879.The_Outlander", "http://www.goodreads.com/book/show/6034163-the-outlander", "http://www.goodreads.com/book/show/12351186-the-outlander", "http://www.goodreads.com/book/show/10133555-the-outlander", "http://www.goodreads.com/book/show/6233730-the-outlander", "http://www.goodreads.com/book/show/2321880.The_Outlander", "http://www.goodreads.com/book/show/6953565-help-me-jacques-cousteau", "http://www.goodreads.com/book/show/337147.Mulder_It_s_Me", "http://www.goodreads.com/book/show/1127173.Ashland", "http://www.goodreads.com/book/show/1127175.Primitive"]}