{"ratings": 14697, "userreviews": [{"userName": "Anne", "userReviewDate": "Mar 20, 2008", "userURL": "http://www.goodreads.com/user/show/940777-anne", "userReview": "The short version:Plot schmot, do you really think it’s accidental that The Other Wind is more contemplative than adventuresome? Ursula Le Guin is a very deliberate writer. The long version:Reading the Earthsea cycle in order will do more for you than simply get you up to speed on who’s who and what went before: so don’t start with this, the final book to date, if you want to really appreciate what Le Guin is doing. She created Earthsea in 1964, introduced Ged in 1968, and finally ended the series (?) in 2001 with The Other Wind. After 37 years, it’s a testament to her writing skill that Earthsea, and Ged within it, have the coherence to support a generation’s-worth of changing focus without losing their own integrity or internal logic. Just as Ged, in his old age, is “done with doing,” by now Le Guin is far less interested in plot or character than in the implications of the one-sided world she created a generation earlier. Early on, she’s still essentially working out the technical, practical details of how Earthsea and its cultures, creatures and magic work--and the fast-paced action of A Wizard of Earthsea gives us exposition without making it dry. We as readers learn about Earthsea, and wizardry, and dragons, as Sparrowhawk does, in typical bildungsroman fashion. As time goes on, however, Le Guin realizes there’s a lot more to be said about Earthsea than What, Who and How, but Why. The story of Earthsea as told in the first three books is fascinating, exciting, and fun--but also superficial. At this point Le Guin’s emphasis on balance stops being a preoccupation of her characters’ magical theory and turns into her own task as a writer. In Tehanu and “Dragonfly” she opens up several flip sides to her early subjects: women rather than men, ordinary people instead of wizards and kings, everyday concerns like chores and crime rather than magical catastrophes, and the simple behavior and merits of dumb animals rather than dragons. Sleeper agent Tenar opens a window for us into the effects of the one on the other within the structure and society of Earthsea, and everyone severally ties up the loose ends in The Other Wind. What good is it to be a wizard in an ordinary world, or an ordinary man or woman in a magical world? Does magic solve problems or create them, or both? What is the source of power, and what makes sentience? How can magic that conquers death in one society be reconciled with a non-magical society of humans in the same world? In The Other Wind Ursula Le Guin has the guts to examine her world for its flaws and inconsistencies and successfully address them within its own myth. Earthsea is still recognizably Earthsea, but more soundly so. Collaboration, understanding, wisdom, labor, and everyday virtues like kindness, open-mindedness, and patience achieve as much as any single hero, noble deed or spell when all is said and done--and this is why more is said than done this time around. As a standalone book, it’s merely okay--but having seen the arc of Le Guin’s preoccupations played out across the years lends it a depth and satisfaction you won’t get if you haven’t read the other books first. Ged the wise old cabbage-grower, plum-picker, and other-people’s-kittens-lender becomes much more interesting--the answer to a question you didn’t know was asked--if you’ve also experienced him as a young, almost all-powerful wizard."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Sep 27, 2009", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The other Wind (The Earthsea Cycle, #6), Ursula K. Le GuinThe Other Wind is a fantasy novel by the American author Ursula K. Le Guin, published by Harcourt in 2001. It is the latest novel set in the fictional archipelago Earthsea. It won the annual World Fantasy Award for Best Novel. تاریخ نخستین خوانش: ششم ماه فوریه سال 2008 میلادیعنوان: دریای زمین کتاب 6 - بادی دیگر؛ نویسنده: ارسولا کی. لوژوان (لگوین)؛ مترجم: پیمان اسماعیلیان خامنه؛ ویراستار: نیلوفر خانمحمدی؛ تهران، قدیانی، 1386، در 376 ص، جلد ششم از مجموعه شش کتاب در شش جلد؛ شابک دوره: 9789645365835؛ شابک کتاب ششم: 9789645362827؛ موضوع: داستانهای خیال انگیز از نویسندگان امریکایی قرن 20 مافسونگر آلدر هر شب خواب همسر جوان و تازه درگذشته اش را میبیند، که فراز دیوار سنگی - مرز میان مردگان و زندگان - به سوی او دست دراز میکند، و از او یاری میخواهد. ا. شربیانی"}, {"userName": "Bradley", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "This is one of those novels that you have to see through to the very end before the total shape becomes clear and casts the entire series in a new light. Unfortunately, the buildup to get there is kinda middling for me. Don't get me wrong, the dragons are great and the whole introduction of new characters and getting back to the King and to the question of Ged and the role of women in this world is pretty good, but the best part is the return to the dry lands, the realm of the dead.As before, there's a balance between wizards and dragons, and all of this becomes even more pronounced as the reveals keep coming, as we learn mankind's place in the world and where we fit into the scheme of things along with our dragon brothers.Pretty cool stuff, really. I just wish that I didn't have to do a re-read of the weaker novels in order to get to the really cool stuff.I really wish that I could have the joys and the pacing and the coherency of the first two novels repeated in the ones to come after, but it just isn't to be. Maybe I expect too much.That being said, I can truly appreciate the end of the Earthsea cycle as it has become, and not be truly dissatisfied. Dualities can be a real pain. :)"}, {"userName": "Robert", "userReviewDate": "Aug 21, 2008", "userURL": "http://www.goodreads.com/user/show/1433865-robert", "userReview": "[ Roarhi! {{hugs}} I'm Flagon the Fierce and Friendly Red Dragon! I read along with Robert in the evenings and so I get to enjoy lots of stories. Some of those stories have Dragons in them and the Earthsea books are my favourite stories about Dragons except for the story about my Mum, who is on the Welsh flag and the stories of my own Adventures.Roar - so the first time we learn about Dragons in Earthsea it seems they are really Pesky, burning places and chomping folks and making them flee from their island homes. It seems like Dragons are really naughty! This is bad because Dragons have an undeserved bad reputation with all sorts of dubious and distorted myths and legends that make us out as EBIL! Roar! But later on, we discover that the older Dragons are wise as well as wiley and know things that Humans have forgotten! So it seems that Dragons are a bit like Humans - not all good or all bad, which is better! Then, later still, we learn that Humans and Dragons have common ancestors! We changed because we were more interested in different things than the Humans who didn't change. Interesting. Then, near the end we learn that the reason the Dragons are annoyed with Humans is because they stole something from us so long ago that only Dragons remember and the Humans have forgotten all about it! The Dragons decide they want their property back and set about getting it. Luckily the Humans realise that their theft was a big mistake and that they don't even want what they took anymore, so they give it back! Everybody understands each other a little better afterward, which is good and what I try to achieve as Ambassador to Humans. So these are my favourite books about Dragons! (hide spoiler)]"}, {"userName": "Oscar", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/1754850-oscar", "userReview": "La lectura de este libro de Terramar no ha sido tan satisfactoria como con los volúmenes anteriores. En mi opinión, no aporta nada nuevo a la saga y difiere bastante con lo que llevaba leído. Me sucedió la primera vez que lo leí, y me he vuelto a pasar."}, {"userName": "A", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/7547650-a", "userReview": "My first Ursula K. Le Guin book was The Left Hand of Darkness: a cold strangeness of passive powers and mutating gender. After that, I was somewhat lost in this exceptional author's catalog and reluctant to read such a traditional fantasy as A Wizard of Earthsea. But eventually, starved for female authorship and coming off Frank Herbert's high science fiction epic Dune, I discovered a copy of the first entry of the Earthsea Cycle and picked it up. Reading the books of Earthsea is like opening a series of nesting dolls in reverse. Inside the first book is a beautiful box, classical and intricate. Then with the next book, it opens to reveal a larger and more beautiful and complex box. The box inside that is even wider in scope and implication and inside that is a box that contains the whole universe. The first three books of Earthsea reveal a world like ours: divided between East and West and dominated by the power of men. Through careful crafting, Le Guin interweaves the lives of three main characters into a shifting balance of the powers of light and dark. Even in a world of temperamental magic, Le Guin's characters are refreshingly relatable. Our guides of Earthsea aren't babbling or overly emotional. Through her artful economy, Le Guin vitalizes characters we learn to love for their thoughtful goodness and resiliency. The fourth book, Tehanu, introduces an unknown element into Earthsea: the feminine. Fleshed into being in The Tombs of Atuan, Tenar shows us how the magic of Earthsea's women reaches deeper than the skill of the mages and into the elemental power of the dragons. The Other Wind fully realizes this connection between women and dragons, between magic and humans, life and death, dreams and waking reality. Featuring a wider cast of characters than the previous volumes, the last book brings together everything we have learned about Earthsea to change the foundations of the world.Truly the master Patterner, Le Guin gives us something mythic in reach and universal in meaning. Not to be read without its companions, The Other Wind is a fitting finale to an amazing series. These books are highly rewarding reads, easy to finish and never insulting to the reader's intelligence. Le Guin is a modern keystone of women's writing."}, {"userName": "Shane", "userReviewDate": "May 09, 2007", "userURL": "http://www.goodreads.com/user/show/81463-shane", "userReview": "Let me preface this with my Earthsea background. I read the first 3 books when I was young and loved them. Then did them again on audio a couple years ago and enjoyed the 1st and 3rd books but thought the 2nd one was slow. Then I read -Techanu- and thought it was more like an interlude with a plot added in at the end for good measure. -Stories of Earthsea- was barely passable and now this -The Other Wind- left me with a final bad taste for a series I loved for a long time.It was nice to hang out with some old friends (Ged, Tenar etc...) but at some point toward the end it started this downward spiral into incomprehensibility. There would be a section I just didn't get but I'd just move on hoping that it would make sense later. It never did. When it ended I had no idea what had happened. Was it just too simple? I do see a lot of reviewers saying that the ending was predictable. I don't even know who was still alive at the end. It seemed like a bunch of snippets of action that never got resolved. Was it some type of literary experiment?I'm not sure, but my final stance on Earthsea is: Read the first 3 books and pretend the others don't even exist."}, {"userName": "Berfin Kanat", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/5669204-berfin-kanat", "userReview": "Yerdeniz'in son kitabı hakkındaki düşüncelerimi kelimelere tam olarak dökemeyeceğim. Sanırım hislerimin karşılığı kadim lisanda mevcut, ama onu da ben bilmiyorum. Seriyi bitirmem yıllar sürdü, ara vererek okudum. Bunun sebebi ağır olması vs. değil tabii, sadece öyle denk geldi. İlk kitapları düşünüyorum da, Yerdeniz Büyücüsü'ndeki Ged, Atuan Mezarları'ndaki Tenar... Son kitaptaki hallerine göre ne kadar farklılardı. Yaşlandıklarını okurken onlarla bir yaşlandım, görüp geçirmiş bir ruh haline büründüm. Bu hal hem üzücü, hem de huzur vericiydi. Her şeyi oluruna bırakıp, korunun ötesini seyrettim, batının da batısında uçan ejderhaları düşledim. Hala da düşlüyorum. Yerdeniz'i herhangi bir seriyi bitirir gibi bitirmedim çünkü kitaplar boyunca yaşananlar; büyümek, yaşamak, ölmek, kadın ve ejderha olmak içimde bir yere işlendi. Ve içimize işleyen yerdenizler bir olup ejderhalara dönüşerek batınında batısında esen rüzgarda raks edecekler, bir gün bizim de gideceğimiz diyarlarda."}, {"userName": "Nikki ", "userReviewDate": "May 24, 2016", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "The Other Wind ends the Earthsea Cycle by resolving an issue which, for attentive readers, has been present since the very first book. Despite all the joys of wizardry and the great things the wizards can do, the world of death looms from the very first, and it doesn’t sound like a great place. In the second book, Tenar’s background reveals that her people believe their souls are reborn, but that wizards’ souls are not. In the third book, we see the world of death: a dead, dry, empty place, surrounded only by pain, where lovers can pass each other on the street and not recognise one another.That’s not a world we want to see Ged or Lebannen condemned to, and so The Other Wind is a fitting end in that it dismantles that — and brings in another female character who is Kargish, makes Lebannen examine some of his issues, makes Tehanu grow up, and ties in the thread of Irian from the novella ‘Dragonfly’. Other themes that’ve been a big part of the books previously (the role of women, for example) are still here, now integral to the world where perhaps they weren’t in time for A Wizard of Earthsea and Yarrow.It wasn’t my favourite of the series when I first read it — I think I have to concede I love the first two books most and always will, though Tehanu and The Other Wind are growing on me — but reading it this time, it seems like a very fitting ending point. I think I’m right in saying that Le Guin isn’t writing novels anymore, so it’s likely this really is Earthsea’s end, and it’s a good way to finish, with Ged and Tenar in their house and the dragons flying on the other wind.Originally posted here."}, {"userName": "YouKneeK", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/25923230-youkneek", "userReview": "The Other Wind is the sixth and final book in the Earthsea series. I really enjoyed the series, although I thought this last book was the weakest. The story started off very strong, and I especially enjoyed the first 25% or so. After that, while there were still good parts and I was still interested in the premise, I thought the story itself became kind of slow and repetitive. One thing I enjoyed was that we had the chance to revisit a lot of favorite characters from past books in addition to meeting some new ones. A lot of plot threads from the various books were brought up and woven into a bigger picture. The problem is that I thought that bigger picture was blurry. We learn a lot about what happened in the distant past that made the world the way it is now, and what the price was, but I felt like it was all too light on logical reasoning and rational explanations, even for a fantasy world. This book has a lot of scenes with people gathering together, in small or large groups, catching each other up on recent events, or sharing what they know about things that happened in ancient history from stories they've heard. The reader had to sit through some of those stories being told multiple times, if slightly differently and with different levels of detail each time, and it started to feel repetitive.I really wanted to give this book four stars on the strength of the rest of the series, and I’m rounding up to four here on Goodreads, but this was really a 3.5 star book for me at best. There are a few short stories set in Earthsea that I haven’t read yet, but I think I’m ready to move on now."}, {"userName": "Maria Xanthoudaki", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/30963527-maria-xanthoudaki", "userReview": "Το φινάλε όπως έπρεπε να είναι! Δεν μπορώ να φανταστώ πως κάποιος διάβασε τα 5 προηγούμενα και αποφάσισε να μη διαβάσει αυτό. Ο Άλντερ, βυθισμένος στη θλίψη μετά το θάνατο της γυναίκας του, αρχίζει και βλέπει όνειρα που τον φέρνουν σε επαφή με τις ψυχές της άγονης γης. Αναζητώντας βοήθεια, οδηγείται αρχικά στον Κίρκο και από εκεί στην Τενάρ, την Τεχανού και στη συνέχεια την Ίλιαν, τη γυναίκα-δράκο που εισήγαγε η Λε Γκεν στο προηγούμενο βιβλίο. Οι Χάρντικ και οι Καργκ, μάγοι, θνητοί και δράκοι καλούνται όλοι να παίξουν το ρόλο τους και να επανέρθει ο κόσμος στην ισορροπία. Η συγγραφέας αγγίζει ξανά το θέμα του θανάτου και της αναγέννησης και κλείνει το έπος της Γαιοθάλασσας, χωρίς να αφήνει καμιά εκκρεμότητα για τους χαρακτήρες και τον κόσμο τους. Τέλειο!http://diavazontasvivlia.blogspot.gr/..."}, {"userName": "Melody", "userReviewDate": "Sep 10, 2007", "userURL": "http://www.goodreads.com/user/show/369112-melody", "userReview": "Oh, my word, the second three are different books from a crone's viewpoint. Of course, UKL's words are glorious no matter where or when one comes to them, but oh, how these words burn. Meditations on life and death, on women and men, on dragonkind and humankind, on mage and commoner. Masterfully done. And of course, this:“I think,\" Tehanu said in her soft, strange voice, \"that when I die, I can breathe back the breath that made me live. I can give back to the world all that I didn't do. All that I might have been and couldn't be. All the choices I didn't make. All the things I lost and spent and wasted. I can give them back to the world. To the lives that haven't been lived yet. That will be my gift back to the world that gave me the life I did live, the love I loved, the breath I breathed.”"}, {"userName": "Laila", "userReviewDate": "Feb 26, 2016", "userURL": "http://www.goodreads.com/user/show/16125182-laila", "userReview": "Ged, Tenar ve Tehanu... Gulumseyerek biten seri, ejderhalar ve kadim zamanlar. Oyle guzeldi ki... Okumadan ölmeyin!"}, {"userName": "Tamora Pierce", "userReviewDate": "Nov 12, 2008", "userURL": "http://www.goodreads.com/user/show/1451591-tamora-pierce", "userReview": "Is it me, or is the only way someone can be a good guy in this book (maybe in all of her work--I'm not a fan) by giving up something that's vital to themselves and the people around them? Not just a few, but everyone has to do this? That in the end she'd strip all her mages on their power if she could find a way to do it, or leave them nasty, mingey, sour people tightly clutching their skills to their chests and only reluctantly doling out bits of their knowledge to others because it's expected of them? And that a woman's lot is to give things up and be in pain, or smile and be ready with hugs when the kids and the men venture out to do the rough stuff? That true, ultimate love is found in a moment while the other person isn't paying attention?I read the Earthsea trilogy in my late twenties, couldn't face TEHANU after hearing about the clapping songs, and I read LEFT HAND OF DARKNESS in college. It left me simmering in a deep pit of rage I have yet to climb out of. (An Earthman is isolated in a shack with one of a race that turns from male to female, and the first signs the other creature gives that he's turning female is PMS hysterics? Degradation much?) So no, I'm not a fan, but Michelle West said THE OTHER WIND was the book LeGuin was born to write, and it was okay--I finished it. It was okay for a book where a growing number of interesting people went places and talked and acquired more people to go places and talk and put together the problem--and I won't do a spoiler. And during the story and previous to the story people had to give up the core of themselves as payment so many times that it got on my nerves. Yes, I believe that great victories demand great prices, but where was the feeling of victory? Where was the feeling of battle? And for all the mentions of the strong Karg women with their strong bare arms and strong bare feet, they got to be strong and wait."}, {"userName": "Jacob", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/637062-jacob", "userReview": "The Other Wind ≥ Tehanu ≥ The Tombs of Atuan > Tales from Earthsea > ... > A Wizard of Earthsea > The Farthest Shore.(The Other Wind is greater than or equal to Tehanu, which is greater than or equal to The Tombs of Atuan, which is greater than Tales from Earthsea, which is several orders of magnitude greater than A Wizard of Earthsea, which is greater than The Farthest Shore.)THAT IS ALL."}, {"userName": "Nikki ", "userReviewDate": "Jun 04, 2008", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "The Other Wind is a beautiful book. I don't think I liked it all that much the first time I read it, but now I see exactly how it fits. It's less incongruous than Tehanu, for me, but follows on neatly enough -- and it does use all the ideas and feelings that are brought up in Tehanu. Set a long time after it, it makes most sense if you've read Dragonfly, from Tales from Earthsea, before you read it. The first time I tried to read it, I don't think I had, and I had no idea who Orm Irian was or why she was significant.One thing that I disliked in The Farthest Shore was the picture painted of death. It was difficult to think of it as such a crime to come back from there, when it was so miserable, where lovers could pass each other in the street and not care. The Other Wind sets this right. It's interesting to me that, at the end of The Farthest Shore she thought the series had ended, and presumably also at the end of Tehanu, but this book fits so cleanly, so clearly, as if it was intended all along.The writing is once again beautiful, in places. I found it rather commonplace in Tehanu, matching the subject matter, but there are some really gorgeous quotes in this book. This one is perhaps my favourite:\"I think,\" Tehanu said in her soft, strange voice, \"that when I die, I can breathe back the breath that made me live. I can give back to the world all that I didn't do. All that I might have been and couldn't be. All the choices I didn't make. All the things I lost and spent and wasted. I can give them back to the world. To the lives that haven't been lived yet. That will be my gift back to the world that gave me the life I did live, the love I loved, the breath I breathed.\"Along with the recurring theme of life and death, and the one giving value to the other, we also have more criticism of the male-dominated system, and of the male way of thinking in Earthsea. How much of this is meant to be political commentary, and how much of this is Ursula Le Guin exploring her own world, I doubt we need to know. It's interesting that she introduced what is basically a burqa, without any particular comment on whether it is anti-feminist or not. Sesarakh comes out from behind her veil, of course, but I didn't feel like Le Guin was saying omg burqas r evol!Character-wise, we have a lot of characters from other books, but there are some new ones as well. Chief among these is Alder, and Sesarakh. I don't think it's really explained quite thoroughly enough why Alder is the centre of all this -- it doesn't really make sense, when he's just a town sorcerer -- but it does break the pattern of Roke-wizards being all-important, as does the inclusion of Seppal, and it is something that would happen... an 'ordinary' person getting swept up in great events. Also, isn't Ged ordinary, at the beginning? So maybe it needs no better explanation. Anyway, I didn't get as attached to him as to Ged or Lebannen, but he did make me smile sometimes, reading about him. And I was sad, at the end.Sesarakh is an interesting character, another vector for the discussion of the female in Earthsea. I didn't get to love her as a character, or really feel the romance between her and Lebannen, but that wasn't really the point. I did want to kick Lebannen rather, for the way he treats her and thinks about her. But Tenar had him well in hand, really.I was going to say that The Other Wind isn't my favourite book of the series, but really I don't see why it shouldn't be. It brings together and carries on the work that, in retrospect, all the other books began. It offers some bright, beautiful images and some hope for what happens after death, and I don't see why it can't be an education and a comfort to us, too. \"Only in dying, life,\" is a truth for us, too."}, {"userName": "First Second Books", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/3181817-first-second-books", "userReview": "AH! PURE PLEASURE!"}, {"userName": "Davis", "userReviewDate": "Aug 13, 2012", "userURL": "http://www.goodreads.com/user/show/5364902-davis", "userReview": "An amazing ending to the Earthsea series. The final book ties together many of the threads from earlier books that have been left hanging. The tone of the whole series has evolved over each book, and this last entry more mature in writing style. While many characters that were old favorites come back for this final chapter, it never feels like Le Guin is shoehorning them in just to say hello. Everything in the book is included for a reason, and never feels contrived. The book addresses and solves problems of previous books that I didn't even know were problems. There is no evil villain or MacGuffin to chase, only the characters dealing with the world around them as they work through the changes that have recently been brought about. The difference between dragon and human, Old Speech and Hardic, Kargic and Archipelegan, men and women, magical and common, living and dead; all are used and tie into the overall plot beautifully. Amazingly, this book not only makes itself and the series even greater, but makes previous books better in retrospect. With \"The Farthest Shore,\" I thought Cob was a generic villain that didn't fit with Le Guin's original Earthsea stories. Now, his story has become extremely important and has had effects for the past three books that stretched farther than I could have imagined when I first read about Cob's meddlings. While Le Guin's writing is always excellent, I found the first four pages of the last chapter, where she goes through every characters dreams the night before the world is forever changed, to be one of the most beautifully written scenes in any book I've read. Le Guin really outdid herself with the imagery and tone of those few pages, and took something that could have been boring and made it stunning. The only complaint I could have, not that I need to have one, is that the chapters are too large. There are only five, and they are arbitrarily larger than any others in the series. This is hardly even worth noticing, but I did find it odd. Overall, there was no better way to end an already amazing series."}, {"userName": "Alberto", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/7072361-alberto", "userReview": "Otra vez han pasado años entre novelas y otra vez se nota demasiado la influencia de los cambios interiores de la autora sobre la continuidad de la trama. Este libro, mucho más filosófico que los anteriores, representa una auténtica subversión de los valores del ciclo: los dragones, que eran claramente seres caóticos y muchas veces malvados, pasan a ser espíritus superiores, un ideal en el que reflejarse. Los magos de Roke, aunque con buenas intenciones, están profundamente equivocados y son responsables de un crimen de lesa humanidad. Los malvados bárbaros de la segunda novela han sido más fieles a los compromisos de los hombres cuando se separaron de los dragones... Muchos cambios y demasiada contradicción para llegar a un clímax simbólico y que en mi opinión podría haber sido resuelto con más elegancia."}, {"userName": "Ananya Rubayat", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/814019-ananya-rubayat", "userReview": "This is not necessarily a review of only this book but rather of the whole series. For me what set Earthsea apart was the fact that the books managed to be captivating without any of the typical storylines that drive high fantasies, i.e Good versus Evil, fairytale romances, a super duper bad guy.In the afterwords of her first book the author clearly said that she found that defining right or wrong seems very limiting to her - and that has echoed throughout all the books. Almost all the books are about journeys - about finding and reconciling with your dark side, about finding freedom ( often from invisible bonds), learning to love what you are instead of what you do, learning to trust another person, and finally about shaping your destiny, rather than being defined by it. Earthsea is not just about magic, spells or dragons ( although the dragons are pretty damn amazing). It explores deeply human issues that exists in our earth - and these were handled with great honesty. None of the charactors were perfect - they were sometimes egoistic, untrusting, rigid, they had appalling things done to them, they were beaten and raped and traumatized. But in the end, everything was reconciled. The charactors lives suddenly didn't become perfect, all problems of earthsea wasn't magically solved - but balance was restored by making hard choices. Like the book says in the end \" We broke the world to make it whole..\""}, {"userName": "Artnoose McMoose", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/708054-artnoose-mcmoose", "userReview": "Having blown through the previous five books, I admit I was already a little ready to be done with Earthsea. I also expect this to be the final Earthsea book. Perhaps I had expectations for things to tie up neatly.I enjoyed many aspects of this book, especially the deep relationship between Ged and Tenar, in contrast to the growing relationship between the king and the princess, one that we can see coming from a mile off but apparently the king cannot.I had more disappointments with this book than I expected to, which may have been my own fault, but I didn't feel like I got any resolution about the major mysteries that the book began with: what is going wrong with the world, what is the Archipeligan afterlife, and is it different than Kargad reincarnation? Simply put, I still am uncertain about what actually happened at the end of the book. I understand that the dragons left, but I don't understand if Archipeligans still have dry purgatory as an afterlife, or if that's just for people who practiced magic in their lifetimes. It reminded me a lot of the Amber Spyglass, where the dead get released from their imprisonment of purgatory. In that book, two people had to make a sacrifice in order for it to happen. In the Earthsea finale, I was unsure whether magical practice was going to phase out as a result of the dragons leaving.Usually it's fine to end a book with a continued sense of mystery, but this time it seemed like a bunch of loose ends."}, {"userName": "Xime García", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/25821784-xime-garc-a", "userReview": "3.5TENGO una muy buena explicación de por qué leí esto antes que todo lo demásFue por errorLes juroLa cuestión es que sé que a la autora le gusta escribir novelas \"spin off\" de su saga de Terramar, por lo que, cuando me topé con esta preciosura en oferta, tapa dura y el apellido de la autora allí reluciendo en el medio, no dudé en comprarlo. Además, la tapa no decía que era \"Terramar #6\", ni en ninguna otra parte lo aclaraba, por lo que pensé que se trataría de una novela independiente ambientada en este mundo. Bueno, a pesar de haberme salteado *cof cof* cinco libros *cof*, lo disfruté bastante, y la narración de esta mujer siempre me es bienvenida. Estoy aprendiendo a quererla. Una lástima que arranqué, sí, al revés con su saga. Ahora necesito más de Tehanu. Iré del final hacia el comienzo."}, {"userName": "Mir", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/29113059-mir", "userReview": "8/10"}, {"userName": "LPG", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/41760947-lpg", "userReview": "Lot of sitting around and talking about stuff in this one. They talked about interesting stuff- just not a physical story as much as the others. Enjoyable & satisfying end to this EXCEPTIONAL series otherwise. I started reading the Earthsea books last September and I think the thing I've most enjoyed about them (aside from the scope of themes addressed in each book) is that they follow the characters from their childhood into their seventies.I'll miss Tenar and Ged, but I'm happy I got to know them for this long."}, {"userName": "Bryan", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/36632319-bryan", "userReview": "Thus, it is complete. For now anyway. Le Guin claims this is the end of the cycle, that this is Earthsea. But I don't know if I believe her. Maybe I just don't want to believe her. I'm not sure she can stay away, and I'm thinking (hoping) that someday soon we'll see a return to the Archipelago, and the magic of Earthsea. When I first read A Wizard of Earthsea, not long ago really, I commented on the Balance of the world. A balance that must be carefully maintained. Over the course of this series that balance has been skewed, slowly but surely. In The Other Wind an attempt is made to finally restore that Balance. And it is a good story. I'm leaving this one with 4 stars, though I think it would also fit the 3.5 that I've left the previous two with. I enjoy these stories, and I'm glad to have read them. But there was always something keeping me from a 5 star rating. I really can't put my finger on it, but I feel it. It's something about the way the story is told. I've tried to put it into words in my other reviews of the series but found that I couldn't. I still can't, but this is my last change to try. The closest I can get is to say that it feels almost impersonal at times, like you're too far above the characters and situations playing out. As I said though, I can't really put what I mean into words, so this isn't entirely accurate. Especially because I feel like I can easily contradict myself by staying that these stories are very personal at times. The stories of Ged, Tenar, Lebannen, Tehanu, Alder, Ogion, Irian, and the rest are personal ones. So what do I mean? I'm really not sure. Maybe I will be able to better articulate it after some future reread. But for now know that I am satisfied with my stay in Earthsea, and hope to return."}, {"userName": "Zeren", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/48381130-zeren", "userReview": "Bu kitabı okuyan, rüzgara ve ateşe sevdalı kadınlar durup bir parça olsun sırtlarında ejderha kanatları, soylarının İrialı ve Tehanu gibi ejderha-insan soyundan gelip gelmediğini hayal etmişler midir acaba? Öteki rüzgarlarda uçmak <3"}, {"userName": "Başak Çolular", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/31919520-ba-ak-olular", "userReview": "Mutlu son. :)"}, {"userName": "selcuk", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/23254641-selcuk", "userReview": "Bana kattıkları ve hissettirdikleriyle çok sevdiğim bir seri oldu. Mutluluk ve hüzün içerisinde bitirdim; üstelik hiç bitmesin isterken. Şimdi canım ne istiyor biliyor musunuz? Tehanu ve İrialı gibi öteki rüzgarlarda uçabilmek ya da birazdan Ged ve Tenar'ın yapacakları gibi bir ormanda yürüyüşe çıkabilmek."}, {"userName": "Cyndy Aleo", "userReviewDate": "May 20, 2011", "userURL": "http://www.goodreads.com/user/show/5475913-cyndy-aleo", "userReview": "After my [ex-]husband got me into the Earthsea Cycle novels by Ursula LeGuin, I was quick to order the three books added after he'd read the books. I delayed reading The Other Wind after I lost the fourth book in the series, Tehanu, but finally gave in to the lure of finding out what had happened to the characters I'd grown to enjoy, but it made no sense. Once I finally found Tehanu, I reread The Other Wind and everything suddenly made sense.::: Dragon Time :::When The Other Wind begins, Ged/Sparrowhawk is alone in the house at Re Albi. Tenar and Tehanu have gone to Havnor at the request of King Lebannen, but Ged receives a visitor, a sorcerer named Alder who has been sent by the mages at Roke to Ged. Alder has been having strange dreams of the Dry Land of death that Ged and Lebannen had visited and returned from in The Farthest Shore, and in them, he has met his dead wife and teacher, both begging him for freedom. When they touch him, he wakes up with burns on his skin, and he is unable to sleep without returning to that land. Ged hears Alder's story and tells him what he knows of the Dry Land, then sends Alder on another journey to Havnor to talk to Lebannen, and also to pose two questions to Tehanu.When Alder arrives at Havnor, he discovers that Lebannen has troubles of another sort; the High King of the Kargad Lands has sent his daughter to Lebannen as a sign of peace, expecting Lebannen to marry her. Now Lebannen has no idea what to do with the princess or Alder's story. As he discusses the situations with his council, Tenar, and Tehanu, it is decided that they will travel to roke: Tenar, Tehanu, Lebannen, the Princess, and two mages: Onyx, and a Pelnish wizard, along with Orm Irian, a dragon who can take the form of a human who had actually been at the school at Roke, even though she is female. Once on Roke, they attempt to determine what to do about the dreams that now everyone in Earthsea seems to be having, and Tehanu finally discovers what she truly is.::: Loose Ends Tied Up :::While LeGuin has stated that she originally felt that the Earthsea Cycle was completed with Tehanu, I'm sure that fans agreed that there were too many questions; what was the Dry Land, and why was there a wall that couldn't be crossed? Was everything truly back to the way it was before Cob attempted to achieve immortality? What did Ogion mean when he said everything was changed? And what was the ultimate destiny for Tehanu?Without reading Tehanu, The Other Wind won't make much sense at all; it's a book that definitely relies on the previous books (especially Tehanu) in the series for an understanding of the characters and situations. For fans of the Earthsea Cycle, just about every question is answered, and the ending of the Cycle is satisfying, if a bit sad.The only complaint that I can think of is that The Other Wind doesn't have nearly enough about Ged. Hopes that Ged might join the party on Roke, or have one last reunion with Lebannen are dashed, and he seems almost an afterthought after his initial time with Alder, disappointing since he had been the central figure up until Tehanu. This review previously published at Epinions: http://www.epinions.com/review/The_Ot..."}, {"userName": "Ian", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/1231281-ian", "userReview": "I have a lot of time for LeGuin’s writing, although I can’t say I’ve enjoyed everything she’s written. I knew The Other Wind was a sequel of sorts to the Earthsea quartet, and I do think those books are very good. Nonetheless, my expectations for The Other Wind were middling, perhaps because I was under the impression it was YA. True, the Earthsea books were published for many years in the UK by Puffin, the children’s imprint of Penguin; but I’ve never really thought of them as YA. The Other Wind is set late in the lives of Ged and Tenar, Ged has long since retired as Arch-mage and no longer has any magic powers. He is visited by Alder, a village magician who has been dreaming about meeting his much-loved late wife at the wall between the land of the living and the land of the dead. Ged advises Alder to consult with Tenar, and their daughter Tehanu, currently on Havnor, advising King Lebannen on recent incursions by dragons. It turns out the dragons are upset because the humans of the archipelago do ont return to the world on dying, but instead gather in the land of the dead. Dragons are apparently trans-dimensional. And all those dead folk are cluttering up their private dimension. It’s a completely new view of the afterlife as presented in the Earthsea quartet, and yet it doesn’t contradict it. There’s a wonderfully elegiac, and yet matter-of-fact, tone to the prose, and a beautifully-drawn cast, from Alder through Tehanu to King Lebannen… but especially the princess from the Kargad Empire who has been sent to Havnor to marry the king. It feels like damning the book with faint praise, especially since the last LeGuin collection I read was a bit dull, but The Other Wind is a thoroughly charming novel. I loved it. It made me want to reread the Earthsea quartet, it made me want to read more LeGuin. Recommended."}], "description": "The greatest fantasies of the 20th century are J.R.R. Tolkien's Lord of the Rings and Ursula K. Le Guin's Earthsea Cycle. Regrettably, the Earthsea Cycle has not received the fame and sales of Tolkien's trilogy. Fortunately, new Earthsea books have appeared in the 21st century, and they are as powerful, beautiful, and imaginative as the first four novels. The fifth novel and sixth book of the Earthsea Cycle is The Other Wind. The sorcerer Alder has the power of mending, but it may have become the power of destruction: every night he dreams of the wall between the land of the living and the land of the dead, and the wall is being dismantled. If the wall is breached, the dead will invade Earthsea. Ged, once Archmage of Earthsea, sends Alder to King Lebannen. Now Alder and the king must join with a burned woman, a wizard of forbidden lore, and a being who is woman and dragon both, in an impossible quest to save Earthsea. Ursula K. Le Guin has received the National Book Award, five Nebula and five Hugo Awards, and the Newbery Award, among many other honors. The Other Wind lives up to expectations for one of the greatest fantasy cycles. --Cynthia Ward", "title": "The Other Wind\n      \n          (Earthsea Cycle #6)", "url": "http://www.goodreads.com/book/show/13658.The_Other_Wind", "average": 4.08, "cover": "https://images.gr-assets.com/books/1309285821l/13658.jpg", "reviews": 701, "authors": [{"url": "https://www.goodreads.com/author/show/874602.Ursula_K_Le_Guin", "name": "Ursula K. Le Guin"}], "type": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/13658.The_Other_Wind", "http://www.goodreads.com/book/show/540413.The_Other_Wind", "http://www.goodreads.com/book/show/6915643-6", "http://www.goodreads.com/book/show/1648122.En_el_otro_viento", "http://www.goodreads.com/book/show/17978525-teki-r-zg-r", "http://www.goodreads.com/book/show/68059.The_Other_Wind", "http://www.goodreads.com/book/show/12376209", "http://www.goodreads.com/book/show/12832537-teki-r-zg-r", "http://www.goodreads.com/book/show/222106.The_Other_Wind", "http://www.goodreads.com/book/show/2674644-en-el-otro-viento", "http://www.goodreads.com/book/show/13356676-the-other-wind", "http://www.goodreads.com/book/show/20204640-the-other-wind", "http://www.goodreads.com/book/show/13642.A_Wizard_of_Earthsea", "http://www.goodreads.com/book/show/13667.The_Farthest_Shore", "http://www.goodreads.com/book/show/18423.The_Left_Hand_of_Darkness", "http://www.goodreads.com/book/show/13662.The_Tombs_of_Atuan", "http://www.goodreads.com/book/show/13651.The_Dispossessed", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}