{"ratings": 3570, "userreviews": [{"userName": "Cecily", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "A simple concept of parallels and contrasts in the lives of sisters, carefully told with gentle irony. It starts in 1864 when Constance and Sophia are 16 and 15 respectively and follows them to the end of their lives. Book 1 covers their teenage years together above and in a draper’s shop in a small town in the Staffordshire Potteries (central England). Book 2 is in the same location, but focuses on Constance. Book 3 is set in Paris during great political upheaval and war, and is about Sophia. In book 4, the two threads come together again. Bennett modelled it on the great realistic French novels of the time (Balzac, Flaubert et al); in some ways it is very mundane, and yet the attention to detail is extraordinary and compelling. As an elderly Sophia muses, “My life has been so queer – and yet every part of it separately seemed ordinary enough.”It opens with a description of the bucolic countryside, observing “But though Constance and Sophia were in it they were not of it” because “no person who lives in the district… ever thinks about the county”, even though it’s so much pleasanter than the busy, dirty town. They are the only children of a bedridden but successful and respected draper whose hatred of “puffing” meant he refused to replace the fallen shop sign lest he “condone, yea, to participate in, the modern craze for unscrupulous self-advertisement”. The draper’s shop and home is their world, and yet their lives end up taking very different paths. Sometimes the contrasts are more parallel than they first seem, and I think this is an aspect that bears further thought and eventual rereading. Constance spends her whole life in the town, living a traditional life as dutiful daughter, wife, mother and widow, whereas Sophia spends many years in France, surviving the Siege of Paris and building independent success. Their lives seem so different, and for Sophia, there is an aspect of missing England when she’s in France and vice versa. However, despite the apparent exoticism of her life, she comes to realise that her “life, in its way, had been as narrow as Constance’s. Though her experience of humanity was wide… she had been utterly absorbed in doing one single thing.”I think the only weak point was some aspects of the ending, but in such a long and wonderful book, it's only a minor issue.SISTERHOODThe sisters are deliberately treated equally: their workboxes “were different but one was not more magnificent than the other. Indeed, a rigid equality was the rule” and yet “in some subtle way, Constance had a standing with her parents which was more confidential than Sofia’s”. This is clear when Mrs Baines confides in Constance about her problems with Sophia: “her tone was peculiar, charged with import, confidential, and therefore very flattering to Constance.”They are close, though they have very different temperaments, with Sophia being the more mischievous and “a prey ripe for the evil one”. She is clever, proud, shrewd with money, independent and obstinate; she would rather suffer than beg or ask for forgiveness. Constance is… suited to her name, like the continuity and familiarity in her life. She is more dutiful and happy to assume she will go into the shop, but Sophia “had always hated the shop. She did not understand how her mother and Constance could bring themselves to be deferential and flattering to every customer that entered”.Their teenage banter, mild naughtiness (trying on mother’s new dress) and sneering at a servant from afar could easily be transplanted to teenage sisters anywhere or when. Curiously, their adult relationship seems more like something from a historical novel than their childhood one. IS BLINDNESS THE PRICE OF LOVE?A recurring theme is the wilful blindness of love, be that of a parent, spouse or even another relative. All the main characters suffer for it in different ways, though one finally acknowledges the truth to herself, if not to others, and “her affection was unimpaired”. Can a child of less than five be bad? Is it “hidden sullenness or mere callous indifference, or a perfect unconsciousness of sin?” And is it misguided to say “If we can be happy only when I give way to him, I must give way to him”? However, that is hard to maintain: “She lived for nothing but to please him; he was, however, exceedingly difficult to please, not in the least because he was hypocritical and exacting, but because he was indifferent… whereas he was the whole of her universe, she was merely a dim figure in the background of his.”MODERNITY AND FEMININE INSIGHT?The book has a curiously modern feeling in some ways. In particular, Sophia’s teenage rebellion doesn’t feel like something from a Victorian novel (though this was written in Edwardian times), either in terms of what she says, or what she does. When defiant, she is sullen and evasive, exhibits a “diffident boldness”, plays the fairness card (“Oh, of course Constance is always right”), answers back with excessive logic (“You tell me not to answer back, and then you say you’re waiting”) and declares “You all want to make me miserable… Put me in prison if you like! I know you’d be glad if I was dead!”. One confrontation ends when, “with a brusque precipitation of herself, vanished upstairs”. I’m sure most modern readers have been involved in such conversations. Although written by a man, all the main characters are women, but they are convincingly and insightfully rendered. For example, Constance’s feelings after her honeymoon are delicately but touchingly described: “She sat there full of new knowledge and new importance, brimming with experience and strange, unexpected aspirations, purposes, yes - and cunnings!...You could see the timid thing [old, virginal Constance] peeping wistfully out of the eyes of the married woman.” And the all-encompassing love of a new mother for her baby, she “dived into the recesses of the perambulator and extricated from its cocoon the centre of the universe, and scrutinised him with quiet passion.” The awkwardness of breastfeeding in front of others, and the stresses of controlled crying (not that it’s called that) are also discussed. At a more trivial level, problems with builders promises, timescales and workmanship are timeless, and the etiquette of all-you-can-eat fare troubled even Edwardians, apparently: the delicate dilemma of “fixed price per day for as much as they can consume while observing the rules of the game… in an instant decided how much they could decently take, and to what extent they could practise the theoretical liberty of choice… they had the right to seize all that was present under their noses, like genteel tigers; and they had the right to refuse; that was all.”(In contrast, it is very Victorian in the way that women can be laid low by severe shock or a bit of a chill.)SYMPATHYIn the Preface, Bennett says “it is an absolute rule that the principal characters of a novel must not be unsympathetic”. I don’t necessarily agree, but he stuck to his principle in this, and the others of his that I have read, which is not to say that his characters are flat or saccharine. And he has no such qualms where some of the minor male characters are concerned. MISCELLANEOUS QUOTES•\t“It is to be remembered that in those days Providence was still busying himself [yes, him] with everybody’s affairs.”•\tThe wakes (regional festival) were “an orgiastic carnival, gross in all its manifestations of joy. The whole centre of the town was given over to the furious pleasures of the people… displaying all the delights of the horrible.”•\t“She was athirst for sympathy in the task of scorning everything local.”•\tTypical Bennett: “One of Maggie’s deepest instincts, always held in check by the dominance of Mrs Baines, was to leave pails prominent on the main routes of the house: and now, divining what was at hand, it flamed into insurrection.”•\tDr Harrop was “common sense in breeches”.•\tWhen Mr Scales mentioned his fox-terrier bitch, he “had no suspicion that he was transgressing a convention by virtue of which dogs have no sex” (and I wonder if any Edwardian readers would have balked at Bennett’s use of the word “sex”).•\tBe careful what may be overheard by servants, “A clumsy question might enlighten a member of the class which ought ever be enlightened about one’s private affairs”.•\t“The era of good old-fashioned Christmases, so agreeably picturesque for the poor, was not yet at an end.”•\t “The remarkable notion that twelve thousand pounds represents the infinity of wealth, that this sum possessed special magical properties which rendered it insensible to the process of subtraction.”•\t“Good clothes, when put to the test, survive a change in fortune, as a Roman arch survives the luxury of departed empire.”•\t“The irrational obstinacy of a physically weak man who sticks to it that he can defy the laws of nature.”•\tBennett loves writing about hotels, and says “critically examining newcomers was one of the amusements of the occupants of the lounge.”•\t“The patched and senile drabness of the [hotel] bedroom.”•\tYou can tell respectable hotel guests because “their clothes… did not flatter the lust of the eye”.•\t“The respectability of a luxury private hotel makes proper every act that passes within its walls.”MODERN BRITISH ASIAN RETELLING!Hugely disappointing, and I suggest avoiding it. My review is here: Marriage Material"}, {"userName": "Paul Bryant", "userReviewDate": "Sep 30, 2007", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "I recall intensely that The Old Wives' Tale had me weeping silently into my mug of tea on more than one occasion as I followed raptly the ordinary tedious lives of two more than a little irritating women from youth to addled toothlessness, whence are we all doomed, although, one hopes, these days, with more humane dentistry and superior bridgework. Ah, humanity! Is it ever thus? Yes, thus it was, thus it is, and thus is to be. Here is a symphony of domesticity, panopticon of disappointment, spouting jugular of forgiveness; and now, this novel sits on my shelf, long untouched but never to be donated to oxfam. It glows faintly and casts a golden deliquescent shimmer on the surrounding brattier volumes."}, {"userName": "Margitte", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "BLURB\"Every stout, ageing woman is not grotesque -- far from it! -- but there is an extreme pathos in the mere fact that that every stout ageing woman was once a young girl with the unique charm of youth in her form and her movements and in her mind. And the fact that the change from the young girl to the stout ageing woman is made up of an infinite number of infinitesimal changes, each unperceived by her, only intensifies the pathos. It was at (the) instant (of this observation) that I was visited by the idea of writing the book which ultimately became The Old Wives' Tale.\" So writes Arnold Bennett in the preface to his masterpiece of realistic fiction, a book that follows the lives of two sisters, Constance and Sophia, from simple days in mid-Victorian England through the chaos and tumult of the modern age. Along the way, a novel is built, detail by rich detail, that rivals the great realistic works of Balzac, Flaubert, Zola, and Maupassant.I don't really know what I feel after the reading this book, apart from exhausted and sad. But digging deeper into the reason behind my feelings, I can only conclude that the realities of the two sisters were nothing really different than what is happening to everyone in life. “Scars are just another kind of memory.” ― M.L. Stedman, The Light Between OceansInstead of hiding behind social etiquette and good manners, the story, published in 1908, is told with blatant honesty, coupled with a subtle dry sense of humor and a profound knowledge of humanity. The historical aspects of events which were either unknown or peculiar, added a deeper nuance to the book. I really enjoyed it.I found a great audiobook version on Youtube and decided to finish the story that way since I probably would have put it down. It was really too slow and too boring. But the deeper I progressed into the narrative, the more I began to enjoy this saga about two sisters who made different choices in their lives and had to do the best they could. They took responsibility with the tools available to them: pride, a sense of honor, resilience and endurance. I think it is more the story of life as we know it, than it is about the two sisters alone. It is like asking a few people to write down their life stories and then choose two mundane, probably boring lives, to highlight our own journeys for us all. Or it can also be the gossip stories about neighbors from the cradle to the grave, and how we react to it.Picturesque, detailed, touching. For me the value lies in the time period it was written and the reminder it is of lives that was lived differently from our own and what we could learn from the experience. I loved it. A great classic."}, {"userName": "Janet", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/1590757-janet", "userReview": "A testament to the power and influence of Goodreads is the discovery of this gem which otherwise would have escaped my notice.Bennett grabbed me with the second sentence of his preface and never let go for a moment. In many ways this 5 page preface is more compelling than the actual novel. Here he relates an anecdote of sitting in a favorite cafe when an old woman comes in talking to herself and dropping her parcels. She is the subject of immediate ridicule by the two waitresses, one old enough to know better and one young enough to be more charitable. He muses that this fat, ugly, old woman was once young, slim, perhaps beautiful but most certainly free of her ridiculous mannerisms. He continues that thought with the realization “…that the change from the young girl to the stout aging woman is made up of an infinite number of infinitesimal changes, each unperceived by her…” This is the story he writes but with two sisters, Sophia and Constance, whose lives he chronicles from girlhood through old age across a canvas that stretches from a provincial English town to Paris and back. Initially published in 1908, the story is set in the mid 19th century.This is a book of small moments – the petty disappointments, jealousies, power struggles and vanities that are woven into every life. There are no grand gestures here. Joselito in his review absolutely nailed it when he wrote, “It's an exciting, unputdownable reading frenzy of non-events.” The lasso? Bennett’s deft observations and characterizations. I can’t think of another writer who has captured youth and aging better than he. On youth: “As for them, they marveled at the phenomena presented in Sophia’s person; they admired; they admitted the style of her gown; but they envied neither her innocence nor her beauty; they envied nothing but her youth and the fresh tint of her cheeks.” On aging: “Nothing could destroy the structure of her beauty, but she looked worn and appreciably older.” On acceptance: “The truth was that, though her bereavement had been the cause of a most genuine and durable sorrow, it had been a relief to her. When Constance was over fifty, the energetic and masterful Sophia had burst in upon her lethargic tranquility and very seriously disturbed the flow of old habits. Certainly Constance had fought Sophia on the main point, and won; but on a hundred minor points she had either lost or had not fought. Sophia had been ‘too much’ for Constance, and it had been only by a wearying expenditure of nervous force that Constance had succeeded in holding a small part of her own against the unconscious domination of Sophia. The death of Mrs. Scales had put an end to all the strain, and Constance had been once again mistress in Constance’s house. Constance would never have admitted these facts, even to herself; and no one would ever have dared to suggest them to her. For with all her temperamental mildness she had her formidable side.”Bennett underscores that no life is ever small to the person living it. Think about that for a moment: no life is ever small to the person living it. Annie Lamott once wrote, “I may not be much but I’m all I think about.” Bennett's sentiments exactly. A pitch perfect novel – recommended without reservation.Note: I read the Modern Library edition which shows a date of 1911 but I don't think that's right. The preface was written by Bennett which may not be included in the edition with the introduction by Francine Prose."}, {"userName": "Joselito Honestly and Brilliantly", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/2190636-joselito-honestly-and-brilliantly", "userReview": "He saw a fat, old, ridiculous, shapeless woman in a restaurant. Then he imagined her once as a vivacious young girl, perhaps pretty when she was a young woman, had some love affairs, married, brought forth children, and now she's like that, most likely alone and forgotten. For a long while he thought of writing a story about an old woman like her. When he finally got himself into writing it, he thought it would be more challenging to write about two of them, so Arnold Bennett made them sisters--Constance and Sophia Baines.Life, aging and death. We follow the story of the sisters' two-penny lives (spoiler alert: read on!). They live in a small English provincial town above their father's draper's shop. We see them when they were small girls, grow up to be young women: Constance marrying a local guy (and later inheriting her father's business), while the more spirited Sophia steals money from her aunt and elopes with a playboy traveling businessman to Paris. She remains childless, abandoned by her husband, but by stroke of luck was able to put up a business and prospered. Constance, on the other hand, stays in their town, has a son, sees her loved ones grow old and die one by one (her parents, friends, her husband). Her son leaves to seek his fortune elsewhere.In old age the sisters are briefly reunited. They shared problems with househelps, their dogs, and Constance's son's apparent neglect of her. Then they, too, die one by one.You yawn and ask inwardly: why then is this a 5-star? Because this is a masterpiece of realistic writing, Bennett's description of the everyday, humdrum happenings of ordinary 19th century people sucks you inside the book and makes you feel the characters like they're real flesh-and-blood. It's an exciting, unputdownable reading frenzy of non-events. A remarkable example of the old-fashioned way of telling a story, utilizing no attention-getting, sophisticated-sounding modern tricks. Something you'll miss when you get back again to the great, unreadable novels of the current times where you have to pretend understanding them, or deceive yourself into believing that you somehow got the point of your 3-week reading labor, to give them a decent rating."}, {"userName": "Ellie", "userReviewDate": "Jan 11, 2011", "userURL": "http://www.goodreads.com/user/show/2908629-ellie", "userReview": "Arnold Bennett is one of the great under-read authors ever. His prose is shining-carved out of marble each word beautiful resonating off the surrounding ones. But really-his craft is so pure and every word counts. Of course, it's good his writing is so unsentimental because it keeps his stories from being unbearable sad (instead of just barely bearably painful). This is the book I would recommend people begin with if they don't know Bennett; I found it the most accessible with even a little humor (irony, actually: Bennett's not really one for funny-or fun). I wish I could enter his written universe for the first time again. Whatever the subject, the people or the plot, his writing (like Bach's music, which for some reason it reminds me of) and like Trollope's writing (only always bleaker) is eminently sane."}, {"userName": "Sketchbook", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/4708498-sketchbook", "userReview": "2 sisters, 2 separate lives : \"I have been through too much, I cannot stand it.\" Yes, we're only concerned with our paltry selves, so why do some whine, Why did this novel not mention this or that war or crisis. Why? Cos outside events never  matter . In his preface Bennett notes that ordinary people are never aware of history's dramatic events. And talented Cyril, the child of one sis : so cute, so spoiled. At 33, his \"habits were industrious as ever. He seldom spoke of his plans and never of his hopes. He was unexceptionable. He imagined that industry was sufficient justification for a life.\"A classic tale covering 60 years by the underrated Arnold Bennett. I refer GRs to the fine review by Cecily for dets. Bennett's decades-long novel influenced authors like the plodding (and, for me, unreadable) Edna Ferber. It will put a lump in your throat, if you have a throat."}, {"userName": "Rupert Smith", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/25290816-rupert-smith", "userReview": "I consider Arnold Bennett to be the most underrated of all English novelists, and The Old Wives’ Tale to be one of the great undiscovered (or ‘underdiscovered’) masterpieces of twentieth century literature. Bennett was despised by the Bloomsbury group, particularly Virginia Woolf, who thought him conservative and vulgar; his popularity made him a figure of envy and ridicule amongst the Modernists. Obviously he’s got much more in common with Trollope, Thackeray and Dickens than he does with Joyce or Woolf herself – but he was also very much influenced by French writers, particularly Maupassant, and this is the ‘Frenchest’ of all his books, with some of the most powerful sections set in Paris. The Old Wives’ Tale is the story of two sisters, Sophia and Constance Baines, their contrasting characters and destinies, their estrangement and final reunion in old age. In the course of the book they run the whole gamut of experiences open to women of that period, and the final section is deeply moving. The prose is breathtakingly good, the characterisation powerful and the subject matter (particularly in the Paris sections) unflinching. Bennett will never be fashionable: he represents a type of prosperous, worldly-wise English gentleman, and obviously that’s just not very cool. But only a fool would dismiss him for that –and it’s worth pointing out that Bennett, unlike the pampered denizens of Bloomsbury, actually wrote to make a living."}, {"userName": "Rob Roy", "userReviewDate": "Dec 26, 2011", "userURL": "http://www.goodreads.com/user/show/2614179-rob-roy", "userReview": "The story of two sisters moving through life to their twilight years. Each faces life's tribulations, and works her way through it, but it is in the end, where they reflect back, that the brilliance of this book comes out. What is life, what contributions and differences do we make, and can we adapt, or should we? These questions permeate the prose of Bennett. One of the better books I have ever read. Possibly, being in my 60's it really speaks to me."}, {"userName": "Melinda", "userReviewDate": "Aug 14, 2009", "userURL": "http://www.goodreads.com/user/show/2299071-melinda", "userReview": "I LOVED THIS BOOK! First published in 1908, it read like a modern-day novel - not tedious and wordy like many Victorian novels. The author painted such vivid characters, scenery and narrative that it was very easy to get swept up in the storyline. Covering a span of 50 years the story is about two sisters, Constance and Sophia Baines, following their lives from youth into old age. The book is broken down into four \"books\": Book 1 is about the teen-aged girls and their mother; Book 2 is a chronicle of Constance's life; Book 3 is Sophia's story and in Book 4 the sisters are reunited in their old age. Constance is the 'constant\" one who remains at home and lives a very provincial life; Sophia, the \"sophisticated\" one chooses romance and adventure and elopes to France with a traveling salesman. There is much in this book that can relate to our lives today."}, {"userName": "Nancy", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/64963943-nancy", "userReview": "Finished: 07 November 2017Title: The Old Wives TalesGenre: fictionScore: A++Review: This was THE best novel on the Modern Library’s Top 100 Novels list I’ve read so far. It is strange how fate has changed the lives of the sisters Sophia and Constance. Sophia’s charm and beauty was dazzling…but she was mischievous, proud. She had sinned in the eyes of the Victorians. She fled to Paris. Constance’s had remained, her father had wanted, quiet and the model of consideration. She lived at St. Luke's Square in Bursley her entire life.I listened to the audio book (24 hrs) over the course of 4 days during a weekend trip. The story was perfect while waiting for the train, a boat trip to a coastal island, walking in the dunes and enjoying an aperitif during a beach sunset. I am very impressed with Arnold Bennett’s masterpiece!#MustReadClassic"}, {"userName": "C.S. Burrough", "userReviewDate": "Mar 25, 2014", "userURL": "http://www.goodreads.com/user/show/29928450-c-s-burrough", "userReview": "First published in 1908, this is considered one of Bennett's finest works. His breathtaking detail and description is something to behold.The story begins around 1840 in the Stafforshire pottery town of Burslem, where young sisters Constance and Sophia Baines work in their parents' draper's shop. They are initially close but contrastingly different girls, Sophie the younger considered incorrigible by the more proper Constance. As they grow up the girls drift, mentally and geographically, apart. Later also set partly in Paris, the tale tracks each sister, separately, into the full bloom of adulthood, the prime of maturity and the frailty of their dotage. It concludes in 1905.The book divides into four parts. The first, 'Mrs Baines', introduces the two sisters and those around them, in their bedridden father's combined shop-cum-house overlooking the town square. With their father ill, the sisters' primary parent is their mother. By the end of this section, rebellious Sophia has eloped with a travelling salesman, while obedient Constance has married her parent's shop employee, Mr Povey.The second part, 'Constance', follows sensible Constance through to her grey haired retirement, when she reunites with her long lost runaway sister. Her unremarkable life is defined not by adventure or outstanding accomplishments, but by deeply personal events, such as her husband's death, her growing worries over her son's life decisions and social behaviour.The third part, 'Sophia', follows passionate young Sophia after her elopement. Deserted in Paris by her husband, she survives the odds, becoming a successful pensione proprietor.The fourth part, 'What Life Is', sees the two sisters reunite. Worldly old Sophia finally returns to her Burslem childhood home, which plain old Constance has never left.It's mindboggling that one man could have created so much intricate detail in these wonderful Victorian characters. How on earth did he achieve this?In his initial published introduction, Bennett mentioned his debt to Guy de Maupassant's Une Vie (that same introduction originally included a nod to W. K. [Lucy] Clifford's Aunt Anne, but her mention is intermittently omitted from various subsequent editions and is permanently absent by the 1983 edition). Bennett's inspiration for the actual story was triggered by a chance encounter in a Paris restaurant, as he recounts:...an old woman came into the restaurant todine. She was fat, shapeless, ugly, and grotesque. She had a ridiculous voice, and ridiculous gestures. It was easy to see that she lived alone, and that in the long lapse of years she had developed the kind of peculiarity which induces guffaws among the thoughtless. I reflected, concerning the grotesque diner: 'This woman was onceyoung, slim, perhaps beautiful; certainly free from these ridiculous mannerisms. Very probably she is unconscious of her singularities. Her case is a tragedy. One ought to be able to make a heartrending novel out of the history of a woman such as she.' Every stout, ageing woman is not grotesque—far from it!—but there is an extreme pathos in the mere fact that every stout ageing woman was once a young girl with the unique charm of youth in her form and movements and in her mind. And the fact that the change from the young girl to the stout ageing woman is made up of an infinite number of infinitesimal changes, each unperceived by her, only intensifies the pathos.Perfect in every way, I have never read anything in this category that surpasses this in literary quality or storytelling. Why this is not more famously celebrated I can't imagine. No major updated screen adaption has eventuated since the 1921 film The Old Wives' Tale starring Fay Compton, Florence Turner and Henry Victor, other than the 1988 BBC TV series Sophia and Constance starring Alfred Burke, Lynsey Beauchamp and Katy Behean.I adore this oft overlooked great classic. Everyone should read it at least once in their life."}, {"userName": "Tony", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "THE OLD WIVES’ TALE. (1908). Arnold Bemmett. ****.\tI have a pile of books “to be read” that comprise my “guilt” pile. They are usually from the group known as classics, and have small print, and are exceedingly long. I put off reading any of them until my guilt level exceeds my capability of enduring it. That’s how I picked up this novel by Bennett. I’ve known for years that this was considered his best work, and had even broken myself into his style by reading one of shorter works first, now I’ve done. It is the story of two women, sisters, Sophia and Constance. Sophia was the younger. We meet them when they are young teenagers, growing up in their father’s house, attached to his millinary shop. At the time, their mother wants to take them out of school so that they can help in the shop. This was fine with Constance, but definitely not what Sophia wanted in life. The two girls ultimately split apart; Constance staying at home and working at the store, Sophia running off with a travelling salesman, who takes her to Paris. The salesman, Gerald Scales, is a bit of a cad, and tried to get her to France without marrying her, but Sophie had more sense than that. Scales had just inherited twelve-thousand pounds from his family and decided that he didn’t want to go into the family business either. The stories of the two girls diverge from there, and the author follows their lives until they are old women – the old wives of the title. This is a slow-reading book, and gets sentimental at times, but Bennett managed to write a novel in the French Realism style and to do it very well. Today, we have heard all of these stories before, but at the time they were a revelation to the English reading public. This edition contains a foreward by Bennett who explains how he came by the title for the book. It is quite revealing about a writer’s inspiration. Recommended."}, {"userName": "Jessica", "userReviewDate": "Jan 18, 2014", "userURL": "http://www.goodreads.com/user/show/2446219-jessica", "userReview": "H.G. Wells may think this book is a masterpiece, but I myself don't see the allure. The Old Wives' Tale tells the story of two sisters, only one year apart, and their journey from lively young girls into unhappy old women. One sister, Sophia, runs away with a handsome man only to be trapped in a loveless marriage until her husband deserts her a few years later. Intelligent and resourceful, she manages to make money running a hotel until her 50's, never truly happy but at least feeling like she has a purpose. Her older sister, Constance, marries a shopkeep, and is moderately happy until he dies, leaving her a widow with a spoiled son to raise. Both women are finally reunited in their old age and live together, both compromising their happiness for some companionship. Eventually they die, tired and used up.Seriously. That is the plot of this book. Sorry if I spoiled it for you, but I sort of wish someone had spoiled it for me before I wasted two weeks reading it. Okay, I'm being a little harsh here. The writing was, at times, beautiful, and the characters really did represent the tragedy of our short time on this earth. But the whole thing was so depressing it was hard not to throw the book across the room. I know that in real life we often end up unhappy and alone, but I don't need to read about it in books. I'm not asking for a sappy, happy ending, and I don't mind a little realistic suffering. I think the problem here is that I didn't care enough about these women to cry for their ruined lives, their unhappiness just frustrated and annoyed me. Perhaps it's a brilliant masterpiece of its time, but I think there's a reason few people read it today."}, {"userName": "Diana", "userReviewDate": "Dec 08, 2013", "userURL": "http://www.goodreads.com/user/show/8443959-diana", "userReview": "Constance and Sophia are two sisters born into the narrow but secure world of their parents' drapery business in the Potteries. The Old Wives' Tale is the story of their lives from girlhood to old age and it is a remarkable masterpiece.The life experiences of the two are vastly different, yet in essence they end up living the same life. As products of a hard-working, respectable trading class, their values are with them for life. Bennett puts the women centre stage, and male characters are peripheral, leaving Constance and Sophia free to make their own choices. The balance between the two stories and the parallels in detail are finely crafted and give resonance and texture. For example, hot air balloons make an appearance in both strands of the story, separated by many miles and years; and an execution features in both.The psychological insight is acute. The account of lives lived in the Potteries between 1860 and 1908 is a fascinating and invaluable document. Is it just me, or is Arnold Bennett a hugely underrated writer?"}, {"userName": "مروان البلوشي", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/17171588", "userReview": "تاريخ القراءة الأصلي : ٢٠٠١ممتعة وبسيطة"}, {"userName": "Peter Ellwood", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/17609571-peter-ellwood", "userReview": "An astonishing, perfect piece of work. I’ve occasionally recognised, over the years, the not-so deep fact that the way one perceives the quality of a book can in fact depend on one’s own mood at the time. I remember once reading Bleak House as part of my student studies and I read it in 100 page chunks: well, it remains one of my all-time favourite books, a complete masterpiece; but pages 301-400 were quite poor…Maybe I happened to be in the right, receptive sort of mood here too. Who cares – try to ensure you are too, gentle reader. If so, you will encounter a quietly unpretentious but nonetheless moving exposition of – simple life. The soul of the book lies in its simplicity, its affectionate insights into unexceptional people. True, part of the novel uses the Franco-Prussian war and its effects on Paris as the backdrop: I found myself almost ‘resenting’ that drama! Because it is the quiet trickling of the sand in the hourglass that is the heart and soul, the glory, of this work. Quietly, almost before you realise what he’s up to, Bennett has described what growing old looks like. Not particularly in any wistful sense of losing one’s strength or faculties (though that’s part of it): but simply, an account of what time does to two normal, very human, sisters.For me it was as if Bennett had played some kind of trick. As if I spent the larger part of the book admiring his ability as a watercolour painter of life. But when the sisters got back in touch with each other I found I had to stop reading: my eyes had got so gummed up with tears that I couldn’t see the pages properly. That’s not the effect of a watercolour; it’s the full-on blast of an oil painting, rich and profound. I had no idea Bennett had it in him – or could find that in me!Lovely book. My only, utterly footling comment in the other direction is Bennett’s tendency to use a kind of Franglais to show off that he knows his French, even though he is writing in English translation. For example, when Sophia is unwell, the doctor does not say “get some rest” – Bennett insists on putting the words “Repose the most absolute” in his mouth. You wouldn’t mind if it wasn’t such a sure-footed, perfect piece of work – but that is plain silly.Never mind. Bennett’s work was once derided by the luvvies of Bloomsbury – not modern enough, too rooted in the narrative traditions of the nineteenth century, and so on. Goodreads’ own, stupidly patronising summary of the book is an example of that too. Well, for me, never mind that either: the nineteenth century was when the art of the novel arguably blossomed to greatest effect, and this is bang in that mainstream for me. A desert island novel."}, {"userName": "Elizabeth (Alaska)", "userReviewDate": "Jun 23, 2010", "userURL": "http://www.goodreads.com/user/show/2026178-elizabeth-alaska", "userReview": "The start of this is very slow with much description. I wondered if I'd started another which would be a slog. Not a bit of it, I'm happy to report. Primarily characterization with some small plot to go with it, it is no wonder this is on both Bloom's Western Canon and Boxall's 1001 Books - and maybe other lists, too.Bennett gives us the inspiration for his story in a preface to the edition I read, wherein he states that he frequented a certain restaurant in Paris. ... an old woman came into the restaurant to dine. She was fat, shapeless, ugly, and grotesque. She had a ridiculous voice, and ridiculous gestures. ... I reflected concerning the grotesque diner: \"This woman was once young, slim, perhaps beautiful; certainly free from these ridiculous mannerisms. Her case is a tragedy.\" He then was reminded of de Maupassant's Une Vie. He thought he could make something of these two observations. Bennett decided to write his novel about the lives of two women - sisters, who he named Constance and Sophia Baines. Their ages were sixteen and fifteen; it is an epoch when, if one if frank, one must admit that one has nothing to learn: one has learnt simply everything in the previous six months. In the first about one-quarter of the novel I noticed such small witticisms. Perhaps they continue, but I stopped noticing them if they are there. Published in 1908, it follows the lives of Constance and Sophia over the next forty plus years, from the mid-1860s to the early 20th Century. It is not a Victorian novel, although it takes place in Victorian England - he is able to say things that I think might not have gotten by Victorian censors. Her passion for him burned stronger than ever. She knew then that she did not love him for his good qualities, but for something boyish and naive that there was about him, an indescribably something that occasionally, when his face was close to hers, made her dizzy. Very tame by today's standards, yet there it is - a woman has passion, a man makes her dizzy. I don't know that I really liked these women to the point I would have wanted to spend time with them, so much as I came to know them and respect them. I feel privileged that this has survived for me to enjoy."}, {"userName": "John", "userReviewDate": "Mar 16, 2010", "userURL": "http://www.goodreads.com/user/show/3445341-john", "userReview": "I have finally finished this thing. So relieved. I really need to quit subjecting myself to the nauseum that is Victorian novels. Absolutely nothing happens in this book with the exception of the sections dealing with the youngest Baines daughter, Sophia.Sophia is the only one in the family that actually lived. She left the tiny town of Bursley for, in my opinion, stupid reasons, but she left. And she lived a life worthy of talking about. Constance, the elder sister, sat around, got fat and complained about her sciatica. I think she needed a backiotomy.Considering this book is old and if you read the introduction (at least the introduction in my copy) there is no such thing as a spoiler, so here comes a spoiler.Arnold Bennett is a stone cold killer. Of all the characters given ample page time, they all die. And they don't die interesting deaths, they die boring old age deaths.Here is the problem I have with Victorian novels. They all center around women. Kidding, there's more to it. They all center around women that are supposed to be bucking the societal trends for women of the time. Either they want to marry for love and not wealth (although they always marry for wealth, love just happens to be a convenience) or they are living the feminist lifestyle and can do anything that men can do aside from peeing standing up without making a big mess.This was Sophia, she fell in love and left Bursley against her family's wishes and mine. She traveled and experienced the world, fell out of love, because it turned out her worthless cad of a husband was indeed, a worthless cad of a husband. He admitted to marrying her just so he could get inside her girdle. Thank god those times are past, have to get married just to get some nookie (right, Fred?). Now, all of that stuff happens on the second date. Intercourse happens on the second date, right?Going on, Sophia's marriage falls apart, she becomes a successful business lady, moves back home to be with her ailing sister. Finds out that her husband, whom she hasn't seen in 36 years is ill. Travels to see his idle body, then gets sick on the ride home and dies. WTF! She was the only interesting aspect of this book. Then you go and kill her, Arnold. I hate you so much.Anyway, I'm putting off these crappy books for awhile. Gonna read some self-help stuff that my mom gave me instead. I can already tell you that they won't help. I'm a wreck.*As an aside, anyone else sick of coworkers not grasping the concept of the reply and reply all buttons? What's the deal? Am I right or am I right?"}, {"userName": "Sylvester", "userReviewDate": "Jan 15, 2011", "userURL": "http://www.goodreads.com/user/show/2289972-sylvester", "userReview": "What did I like about this book? It wasn't really exciting, or novel, nor were the characters that compelling - and yet, it was thoroughly good. The preface helped me to like it, I admit. Bennett writes about seeing two older women in a restaurant and feeling curious about what made them so different and yet brought them to the same place - and wanting for a long time to explore that idea in his writing. So this novel is really focused on the idea that small everyday choices build upon each other and that it is these, more than even the seemingly larger decisions of life, that form our character and even our appearance, and determine where we end up and how. It was this theory that held me throughout the book, and that I could relate to - in fact, I feel as if I have known Constance and Sophia - I have witnessed these kind of lives. And in that sense this book felt contemporary - it is the kind of thing that happens every day. It was about details, about mundane events, and yet, it was not boring or bleak. I respect Bennett's skill to be able to have Constance look at her sister's life and comment that it was largely about nothing (when her own life was equally so, although she took a different path)- to be able to acknowledge that without being overcome by it? Really great writing. Now if only it had been more exciting, I would have given it 5 stars."}, {"userName": "Bob", "userReviewDate": "Nov 30, 2009", "userURL": "http://www.goodreads.com/user/show/82944-bob", "userReview": "With one exception, all of Arnold Bennett's fiction was published in the couple of decades following the death of Queen Victoria, yet in tone it is much more Victorian than Edwardian (certainly none of your post-Eliot modernism can be detected at all). In his stated attempt to emulate Flaubert, Zola and other French realists, he has a few startling passages (for example, an attempt to represent the pains of giving birth) that one is hard put to imagine in Elizabeth Gaskell or even the Brontes.Following two sisters who become separated throughout much of their adult lives, spanning two countries and much of the 19th century, Bennett is credited with being a faithful depicter of the emotional lives of women - in his amusing and informative introduction to my Penguin edition, John Wain comments that it is easy for men to say that but all the women he's asked agree.The crisis points in 19th century literature are not infrequently hinged on medical afflictions and treatments that seem incredible to the modern eye - \"mucous fever\" requiring immersion in ice-cold water at 3 hour intervals for days on end is a climactic but somewhat inscrutable point in this one. While not commenting directly on that diagnosis, Bennett has many engaging asides generally on the inexorable march of technological progress and the reaction of each successive generation to these advances."}, {"userName": "carl  theaker", "userReviewDate": "Apr 30, 2010", "userURL": "http://www.goodreads.com/user/show/3381893-carl-theaker", "userReview": "A momentary self-congrats: with this novel, I finished the Modern Library top 100.Only took me about 5 years, but I did it.This novel was a worthy finale being quite a tome, 620 pages, and since writtenin the early 1900s, was worried it might be difficult.However it was a pleasant read, the story of the Baines family, primarilyConstance and Sophia from their teens through old age and death. Startingaround 1860, you get a look at the working class districts of England,a view of middle class life with attention to money and running a shop.A book in which one might say 'nothing happens'. Constance lives theconforming life, marries, runs a shop, has a son, a fairly, happypedantic life.The author tells most of Constance's story, then pauses and starts all overwith the wild child Sophia, who runs off with a salesman. She endsup making her own way in life in Paris. Various historicevents provide a backdrop, but these pass her by, like they wouldmost of us, as she is busy making a living, struggling along.After many years fate takes Sophia back to her small town and Constance,where they lovingly live together, or is it get in each others way?One could say they have lives of little imagination, as theyare carefree money-wise, and a world is out there to explore,but they choose to stay in the town where they were born."}, {"userName": "Sarah", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/4495744-sarah", "userReview": "I enjoyed this immensly! The story tells the tale of Constance and Sophia Baines' lives from girlhood to death at the end of the 19th century. They were, perhaps, from today's point of view, not very exceptional lives - especially Constance's - but it is so well written and Bennett has such a delightful way of describing everything that you don't really notice this! His main characters have great depth, and the narratve is wonderfully tongue in cheek. My enjoyment was no doubt increased by the fact that I learnt a lot about the Siege of Paris in 1870, and also because I was constantly reminded of my grandparents and great-aunt, although they were born around 1900. This is most likely because they had retained many values and traditions of the Victorian era that are so well painted in this book. Last but not least, thank you Andy Minter, for being such a wonderful storyteller!"}, {"userName": "Priti", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/8039728-priti", "userReview": "The Old Wives' Tale Arnold Bennett This book is a masterpiece of the art of story telling. Its a simple linear narrative but with amazing character study. How well Mr Bennett understood human nature! The book is interesting, amusing, sad and very touching..its excellent and highly recommended."}, {"userName": "Marion James", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/20983581-marion-james", "userReview": "The Old Wives' Tale is a superb story still as readable and enjoyable as ever. After having read this for my English Lit. A level many years ago and 2nd reading did not disappoint. Telling the story of the Baines sisters the quiet, shy, retiring Constance and defiant, romantic Sophia over the course of nearly half a century. This book will grab you and your will always remember the story of the defiant Sophia."}, {"userName": "Doaa Mashaly", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/35333708-doaa-mashaly", "userReview": "I enjoyed this examination of two women's lives from the beginning (young and beautiful) to the end (death in old age). In a couple spots it dragged a little but on the whole, kept me interested and engaged. I enjoyed following these two sisters and their unfolding lives, especially as they made very different choices early on. I found this story poignant and bittersweet."}, {"userName": "David Hambling", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/21554670-david-hambling", "userReview": "A wonderful book. No summary can do it justice -- on the surface it is so utterly mundane, and yet Bennett packs entire lives into a few pages, sketches characters deftly and makes it all so entirely believable. Storytelling does not get any more polished than this."}, {"userName": "Jeanine", "userReviewDate": "Apr 24, 2008", "userURL": "http://www.goodreads.com/user/show/1114065-jeanine", "userReview": "Surprised to find myself hooked on this soap opera from back in the day."}, {"userName": "Claude", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/4490527-claude", "userReview": "I just loved this book and really enjoyed the way it was read by Andy Minter."}, {"userName": "Tracey", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/37756416-tracey", "userReview": "I chose this book as my July read for a book published in the first decade of the 20th century. I started it a few days early and loved it so much continued to read, finishing it today.I loved this book so much I feel like picking it up and reading it all over again. What more can be said?One of the best description in fiction of the lives of 2 sisters. Even though this story is set in Victorian and Edwardian times, these women could be women of today. Even though this was written by a man, I found myself reading about myself in the thoughts of the sisters, their feelings, impulses and choices. Bennett writes with feeling, intelligence and ironic charm.Brilliant. Read it!"}], "description": "Classic novel, one of Bennett's best. According to Wikipedia: \"Enoch Arnold Bennett (27 May 1867 - 27 March 1931) was an English novelist. ... He won a literary competition in Tit-Bits magazine in 1889 and was encouraged to take up journalism full time. In 1894, he became assistant editor of the periodical Woman. He noticed that the material offered by a syndicate to the magazine was not very good, so he wrote a serial which was bought by the syndicate for 75 pounds. He then wrote another. This became The Grand Babylon Hotel. Just over four years later, his first novel A Man from the North was published to critical acclaim and he became editor to the magazine. From 1900 he devoted himself full time to writing, giving up the editorship and writing much serious criticism, and also theatre journalism, one of his special interests. ...In 1903, he moved to Paris, where other great artists from around the world had converged on Montmartre and Montparnasse. Bennett spent the next eight years writing novels and plays. His most famous works are the Clayhanger trilogy and The Old Wives' Tale. ... Bennett believed that ordinary people had the potential to be the subject of interesting books. In this respect, an influence which Bennett himself acknowledged was the French writer Maupassant whose \"Une Vie\" inspired \"The Old Wives' Tale\". As well as the novels, much of Bennett's non-fiction work has stood the test of time. One of his most popular non-fiction works, which is still read to this day, is the self-help book \"How to Live on 24 Hours a Day\". \"", "title": "The Old Wive's Tale\n      \n          (The Five Towns)", "url": "http://www.goodreads.com/book/show/9937104-the-old-wive-s-tale", "average": 3.81, "cover": "https://images.gr-assets.com/books/1302094623l/9937104.jpg", "reviews": 223, "authors": [{"url": "https://www.goodreads.com/author/show/3314.Arnold_Bennett", "name": "Arnold Bennett"}], "type": ["Classics", "Fiction", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/9937104-the-old-wive-s-tale", "http://www.goodreads.com/book/show/188454.The_Old_Wives_Tale", "http://www.goodreads.com/book/show/578586.The_Old_Wives_Tale", "http://www.goodreads.com/book/show/8985951-the-old-wives-tale", "http://www.goodreads.com/book/show/2277053.The_Old_Wives_Tale", "http://www.goodreads.com/book/show/34736594-the-old-wives-tale", "http://www.goodreads.com/book/show/6238153-the-old-wives-tale", "http://www.goodreads.com/book/show/2685515-the-old-wives-tale", "http://www.goodreads.com/book/show/625092.The_Old_Wives_Tale", "http://www.goodreads.com/book/show/2796514-the-old-wives-tale", "http://www.goodreads.com/book/show/7105149-the-old-wives-tale", "http://www.goodreads.com/book/show/4855.How_to_Live_on_24_Hours_a_Day", "http://www.goodreads.com/book/show/4860.Anna_of_the_Five_Towns", "http://www.goodreads.com/book/show/1925773.The_Grand_Babylon_Hotel", "http://www.goodreads.com/book/show/1327976.Clayhanger", "http://www.goodreads.com/book/show/2381867.The_Card", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}