{"ratings": 64, "userreviews": [{"userName": "Chelsea Humphrey", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "[girl's best friend and boyfriend cheating behind her back (hide spoiler)]"}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "[the lead character’s sexual assault. (hide spoiler)]"}, {"userName": "emma", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "This book is...bonkers.I kind of expected and/or hoped that this book would be totally full on bonkers, because it’s a thriller and thrillers are more thrilling if they’re bonkers.Everyone knows that.This book wasn’t all that creepy. Or scary. Or thrilling, I guess. But bonkers? Yes.It might actually be bonkers because it’s not any of those things.I will back up.Natalie’s boyfriend died a couple months back in a car accident and she’s been, understandably, a liiiiiil mopey ever since. So her parents decide to take her (and three of her closest friends!!!!!) on a birthday extravaganza cruuuuuuuuise!!!!They’re not rich or anything. At one point Natalie’s dad is like, Omg lol the cruise is practically cheaper than staying home at this point!!!! To which I say: Unless you’re in some sort of strange Suite Life of Zack and Cody situation, minus the getting the hotel room for free because your mom sings at the hotel, then you stay at home FOR FREE.Are they...are they paying six people to take a cruise?I just do not understand the financial mechanics of this story. But that’s not what we’re here to talk about. Entirely.They get on the cruise, Natalie is a big ol’ meanie to her friends, she meets and plays shuffleboard with a hottie, she presumes said hottie jumped ship immediately after taking a sexiiii shirtless selfie on her phone.Usual cruise hijinks.No, I’ve never been on a cruise before. Why do you ask?This book can be un peu annoying. Natalie is not the best person alive (I love that fun trope of being like I’m not hot lol!! But I do have shiny blonde hair that falls to the middle of my back, clear blue eyes, smooth tan skin…...etc etc). There’s kind of a romance plotline. Which, bleh. But here are the things that I like:1) Kind of diverse??? Not overwhelmingly. But a little. I will take what I can get because wow holy sh*t everyone in every thriller of all time is white.2) Fun friendship stuff about ~healing~ and ~growing~ or whatever. Again, there are so rarely strong female friendships ever in YA that it’s like,,, just gimme.3) AT THE END OF THE BOOK, NATALIE JUST DECIDES SHE’S NOT REALLY THAT INTO LOVE INTEREST NUMERO UN. AND JUST DROPS HIM.I’m sorry if that’s a spoiler but it is truly the best thing I have ever heard in my entire life.Bottom line: This book can be kind of boring, and it’s like...not my favorite ever? But I like the things it does differently a whooooole hell of a lot.thank you to bloomsbury for the arc <3"}, {"userName": "Michelle", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/53328737-michelle", "userReview": "For a young adult thriller / mystery this isn't too bad. Natalie, Lexie, Nora, and Charlotte are BFF's. Natalie's boyfriend, Paul, was killed several months earlier in a fatal car accident. Natalie has been in a funk since it happened and is unable to laugh and have fun as she once used too. Her parents think that booking her and her friends on a cruise for her upcoming birthday, a sail-a-bration, will be just the thing to bring her back to life. The first night on the cruise while in the teen lounge Natalie meets a handsome stranger. The connection between them is instant. She can't believe that she is already attracted to this stranger. They banter easily back and forth as if they've known each other forever. He asks her to meet him at the hot tubs. She returns to her room to fetch her bathing suit. As she makes her way to the hot tub it is clear the handsome stranger isn't there. Why didn't he show? Did something happen to him? Her friends try to convince her to forget about the guy. Who needs a man that's going to blow you off on the very first night? Natalie can't let it go. They hit it off so well that she makes it her business to find out what happened. Now the mystery begins. This book is fast paced and easy to read. Short chapters will have you breezing through the pages. One thing I appreciated about this book is that these teenage girls seemed genuine in the way they spoke and their actions. I didn't necessarily like all of them all of the time but I believed them. I also enjoyed all the nods to Hitchcock movies. What I didn't love is the reasoning behind the mystery. It was just a bit too far fetched to me. On a positive note I do think at the end of the book a very strong message is made about the strength of female friendships and why we shouldn't allow men to define us. Be strong, be brave, and most importantly...BE YOU!!! 3.5 stars! Thank you to Bloomsbury/YA for sending me an ARC in exchange for my honest review."}, {"userName": "Marla", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/4021000-marla", "userReview": "Natalie and her family go on a cruise with three of Natalie’s friends to celebrate her 17th birthday. On the very first day, Natalie meets a guy in the teen area and they hit it off. But then he disappears and because of the things he said to her, she thinks he jumped. She then meets another boy who is his twin named Michael. Together, Michael and Natalie try to find the twin before he does something bad to someone or himself because according to Michael, his brother is not a nice person. Natalie pretty much ignores her friends, only spending a short amount of time with them. Instead she is obsessed with finding a guy who she barely knows. Also, they are on this cruise because Natalie’s boyfriend had recently died in a car crash and her parents wants to help her cope. There are a few surprises, things come to light about Natalie, Natalie’s relationship with her boyfriend, one of her friends who was a little bitchy and the twin brothers. A little bit of Hitchcock was thrown in literally and figuratively. This was an okay story, not one of my favorites. Natalie was a well-developed character but I think her parents showed up maybe three times and you don’t learn too much about her friends. I didn’t care for any of those characters. It seemed like Natalie was putting a lot on the line for a guy she had just met. I wanted to say wake up and just enjoy your vacation, he isn’t your problem."}, {"userName": "Jen Ryland", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/6497049-jen-ryland", "userReview": "Wow - that was actually a lot of fun. Though the ending was a little WTF in the \"seriously?\" way, it was also WTF in the \"WTF-I-did-not-see-that-coming way, which I loved.Full review to come next week on  Jen Ryland ReviewsRead more of my reviews on JenRyland.com! Check out my Bookstagram! Or check out my Jen In Ten reviews on Youtube - get the lowdown on current books in 10-30 seconds!Thanks to the publisher for providing an advance copy for review!"}, {"userName": "Kristina Reads -  Books. Blogs. Memes.", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/51913380-kristina-reads---books-blogs-memes", "userReview": "Trigger warning for sexual assaultSo yeah this was another weird one that just didn’t quite do it for me.This started out with an interesting premise and just kind of went way off the yellow brick road into Wonderland and left us behind.None of Natalie’s actions made sense to me. She meets this guy the first night of the cruise and, after some light flirting (during which he never even tells her his name) she decides she might be falling in love and becomes hugely concerned for his well-being. It’s not really that big of a mystery why her friends want her to let it go – he blew her off.When she finally does figure out his endgame, I was left shaking my head and STILL so confused. It just came out of nowhere for me. And I couldn’t really suspend my disbelief enough to get invested.Some people will probably like this book. The writing’s not bad, I just think the overall plot could have been cleaned up a bit. There’s also a nice ending there about the importance of friendship, honesty, and not defining yourself according to another person. So, if the premise sounds interesting to you, you might go ahead and give it a try anyway.I received a free copy of this book in exchange for my unbiased review"}, {"userName": "Stacee", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "I am a huge fan of twisty mysteries that have a touch of unreliability and with that synopsis, I was eager to get to this one. I liked Natalie well enough. There are definitely some things going on, some fairly obvious and some not quite as obvious right away. As the layers peel back, her actions make sense and yet I was still bummed at how she was treating her BFFs. Plot wise, the story moves, but it’s repetitive. At first I thought it would add to the trickery, instead it was sort of annoying. There are a lot of moving parts here and I’m not entirely sure all of them were needed Overall, I loved the idea of a cruise ship location and there are some things at the very end that I am borderline obsessed with. However, it was definitely lacking some tension that I was expecting.**Huge thanks to Bloomsbury for providing the arc free of charge**"}, {"userName": "Lily (latestreads)", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/41590067-lily-latestreads", "userReview": "3.5, review to come"}, {"userName": "Nina-Tala (JustAddAWord) Shannak", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/27579457-nina-tala-justaddaword-shannak", "userReview": "This book promised more than it could deliver, and therefore I am kiiiiinda pissed off. As my rating, you know, shows. RTC."}, {"userName": "Emily", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/7266521-emily", "userReview": "So many twists and turns I did not see coming! If you're a thriller fan, you won't be able to put this one down."}, {"userName": "Anna", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/80309630-anna", "userReview": "I absolutely LOVED! this book. It took me till the third page (ish) before I was hooked. I will admit I’m usually picky when it comes to the hook. If I’m not pulled in within the first chapter I usually won’t finish it. So I was getting a little worried. But from page 3 on I couldn’t put the book down. Took me 4 hours to read and I wish there was more. (Because I’m now attached to the characters not because it ended in a cliffhanger)Since it’s a thriller it’s hard to explain the plot without giving anything away so I’m going to try and be as vague as possible while still convincing you to GO AND GET THIS BOOK IMMEDIATELY THE DAY IT COMES OUT! (subtle enough?). I love how Tara Altebrando keeps you guessing the whole time but not in an unrealistic way. Each character had their own personality and part to play in the overall story and they all tied together really well. I love how each of Natalie’s friends were unique and they weren’t meant to be “the same, that’s why they fit together”. It was more realistic considering they were on a week-long cruise and they didn’t get along the whole time (teenage girls NEVER get along all the time even if they’re best friends – let’s be real).Natalie’s struggle from the beginning of the book is easy to understand. Her boyfriend was killed in a car accident a couple months before her birthday and she has been struggling to get her life back in order. So when she meets this handsome stranger on a cruise ship, she’s not sure what to do. Is she betraying Paul or is it time to move on? I only gave it 3 stars on romance, but I'm a little greedy that way. I always want more :PThe pace of the book was constant without getting confusing. I was interested the whole time without having to go back and re-read from fear of not catching something. I also love how everything was connected.The only thing that would have made this book perfect was a slight change in the ending but I won’t spoil anything so you’ll have to read it for yourself. And when you do let me know so we can talk about it! It's a thriller, so it's not a book I will likely read again and if I do it won't be for a couple years so I won't remember the ending but it is definitely a book I will recommend to any Ya, Thriller reader. Also, Tara Altenrando (looking at you), the last page was… <3 <3 <3"}, {"userName": "Sionna", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/9530209-sionna", "userReview": "*I received a copy of this book through Netgalley in exchange for an honest review*DNF @ 24%This is such a shame since I really enjoyed The Leaving by the same author. I started to wonder if things would be different if I was reading an official non-ARC copy, but I don't think the formatting was at fault, mostly. See while trying to read this, there felt like a veil between the characters and I, keeping me from getting too close. I couldn't connect, I couldn't understand actions, I couldn't feel them. It is weird to feel so disconnected from a book and my mind kept wandering. Other times I'd re-read a page and realize I hadn't let me mind wander the book literally just switched from present to flashback or detailed background out of nowhere -- this might have been ARC formatting, perhaps there will be more of a divide or marker that things are switching. Then again, I didn't think all the background or details were needed... I might have also stopped caring by then. See, the main character is depressed. Totally understandable since her boyfriend died just months ago. What I don't understand is the need to not hang out with him instead hanging out with a guy whose name you don't know and is kinda a dick. Friends even ask to meet him and she says she'll being him only to totally not truly consider it when she is with him again. So, I'm not sure if I dislike the main character flat out or just her while she is depressed... yet she mentions that whether the boyfriend died or not, she wouldn't want to be on a cruise and acts annoyed the whole time, acts like her friends should flock to her. So, I'm thinking I wouldn't like the main character either way, which makes a book like this very difficult for me to read. 20% in there is no thrilling aspect, I think I left just as things were going to get interesting, but I didn't like the dude either so... I don't think it would have been thriller material for me. Might recommend to people who like mysteries more than thrillers... but, again I'm not sure how often I would recommend this one."}, {"userName": "Amy", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/5126937-amy", "userReview": "Well, this book certainly is the opposite of what you think it's going to be.For one thing, there is the teenage girl friends aspect. Natalie's parents decide to help her celebrate her seventeenth birthday by taking her and her three (!) best pals on a cruise (a \"sail\"-a-bration, as Natalie's mother puts it). You go in expecting the girls to bicker and squabble but then realize that they are BEST FRIENDS FOREVER. While there is some squabbling, it's largely due to Natalie being almost entirely insufferable. Like to the point that you wonder why these girls are friends with her to start. There is another sort of bombshell that isn't all that surprising, given what you know about Natalie and the other people involved by the time you get to the shocking twist.You also expect a little romance at sea. There kind of is one, but it is so secondary to everything else that you almost forget it's there. Instead, Tara Altebrando uses a mystery to keep you hooked: did a guy who Natalie met for shuffleboard (!) jump off the cruise ship?Even this central suspense doesn't follow its trope brethren. But here is where you start to think that this sandwich could have a little less stuffing. I never fault an author for taking the unexpected route. Here, though, Tara Altebrando seems so determined to keep you off-base that she keeps throwing different pieces of meat at you. By the time the book ends, you feel as if you were on a tilt-a-whirl.Will teens enjoy this? Yeah. Maybe. There is a particular subplot that some will connect with, and they may see parts of themselves in some of the characters. The best part about this book is that it's written on a higher level. Tara Altebrando does not dumb down her story, and that is most refreshing indeed."}, {"userName": "Lindsay", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/5328615-lindsay", "userReview": "I expected to breeze through this book and feel detached from the characters and lack of mystery, but I was wrong. This mystery takes place on a cruise ship in the middle of the ocean while Natalie, her parents, and her three best friends celebrate Natalie's 17th birthday. Natalie's boyfriend unexpectedly died months prior so she’s stuck in this stoic slumber with the past on repeat. On her first night of the cruise she meets an energetic guy who breaks her out of her stupor. Fast forward 24 hours and this guy has vanished, leaving clues that lead Natalie to believe that he jumped overboard.There wasn’t any character development other than Natalie. Her friends and parents weren’t included much. Things became interesting when Natalie spies this mysterious guy again and asks why he stood her up, and this guy says that his name is Michael and his twin brother was the one who interacted with Natalie.From there the mystery unravels as Natalie and Michael attempt to locate his missing twin brother and figure out the clues he has left behind. The big shocker happened right on the last page. I never put two and two together so once I finished I had to go back and read the last chapter just to make sure what I read was correct.My only wish was that I was hoping for a specific reveal between Michael and his twin. I’m not going to go into details since I don’t want to spoil anything, but the story would have been more interesting with this specific twist.I received an ARC from NetGalley."}, {"userName": "Emma", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/20585548-emma", "userReview": "Grade: CAn ARC was provided by Bloomsbury in exchange for an honest review. I am now an intern at Bloomsbury, but that in no way has affected my opinion of this book.The Good, the Bad, and the Ugly: I had no idea what to expect from The Opposite of Here. In fact, it's going to be hard to summarize it and my feelings without spoiling too much. But I'll try.Tara Altebrando balances several key plot threads in TOoH - Natalie's friendships, the mystery, Natalie's burgeoning romance, her former boyfriend's death and its impact, an interest in film, and a secret that comes to light part way through the book. I will say most of the plot threads worked pretty well, especially the film one since it was used to enhance the other plotlines. However, the reveal of the secret came about a bit too suddenly, in my opinion. I wasn't sure what was happening, and if it was real or just an imagined scene because it is first presented as one of the many short screenplays in the novel. Afterwards, though, when I realized it was real, I think it was handled a bit better.I will say, the romance was one of my least favorite parts; thankfully, the way it wrapped up was great.I really enjoyed the cruise setting. I liked the friendship dynamics. Each of the three girls besides Natalie - Nora, Lexi, and Charlotte - felt distinct. Content warning: I think I remember a little foul language? There's also sexual assault, underage drinking, and implied suicide/death.The Verdict: Interesting and entertaining."}, {"userName": "Sara (A Gingerly Review)", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/7141648-sara-a-gingerly-review", "userReview": "This was a bit of a struggle to get through. It was neither thrilling or mysterious. I never connected to the plot or the characters. I did finish but I am disappointed with what I read.FRTC.**ARC provided by publisher in exchange for honest review**------------Full review can be found here: https://agingerlyreview.wordpress.com...The premise of this story sounded amazing and I could not wait to start reading! Once I started, I quickly discovered that this was not going to be my cup of tea. Weak plot and flimsy characters kept me from connecting to the story or caring what happened.Short recap: Natalie lost her boyfriend in a terrible accident almost a year ago. Her parents believe she needs to finally get on with her life so they take her and her friends on a cruise for her birthday. Natalie had no idea what mysteries were waiting for her on that boat.See, that blurb sounds pretty good, doesn’t it? I found this story to be far less mystery and a metric ton more confusion. The plot itself had holes so large you could drive a truck through them. The author attempted to connected everything but in doing so with events/things that were just too convenient. You want me to believe that this girl that lost her boyfriend and has been moping for 10 months (a fact that she constantly repeats so it is never lost on the read exactly how long since she lost her boyfriend) was suddenly ready to move on because a cute mystery boy starting talking to her? Break out the crayons and color me Confused. The mystery boy disappears and she was the one who had to find him based on “clues”? Peddle that somewhere else because I’m not not buying.On top of that unbelievable plot, other little details sprinkled throughout the story did not sit right with me. Natalie’s family talked early on about how they were making just enough to get by living in Florida but suddenly they have enough money to buy cruise passes for their family of four AND Natalie’s friends?  DOES NOT COMPUTE.  I know that is such a small thing but I’m the type of reader that pays attention to details because they all add up in the end.Now let’s talk about the characters and the severe lack of development. Natalie lacked any type of personality. I get that she was devastated at the loss of her boyfriend, but I just cannot get on board with her magically coming out of her coma-like-trance because a cute boy talked to her. She never came across boy-crazed until she got on the boat. Maybe this was a magic boat that we were never told about… Hmmm… someone write a story about THAT. *cough* Sorry, got distracted with my idea for a new story. Natalie’s friends felt forgettable and interchangeable. I don’t remember any of their names but it doesn’t matter. They could have been replaced with cardboard cutouts and the story would have read the same. Her parents were absent as well. Sure, they are on the boat but who cares since conveniently one of Natalie’s friends turned 18 and they don’t need no stinking parent!I cannot stress enough how not mysterious or thrilling this story was for me. I found myself skimming the story just wanting it to be over. I can tell you that the “big shocking twist” happened on the last few pages. When that happens, it feels like a huge cop out because there is no resolution nor does the story properly wrap up. I walked away disappointed."}, {"userName": "Reading Teen", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/3329955-reading-teen", "userReview": "This was a fun fast read. The mystery wasn’t quite as exciting or intriguing as I was hoping but I still flew through the book. You can tell by my updates that I wasn’t really a fan of any of the characters. The MC, Natalie was such a downer. I mean, I know there are people like this in the world, and I know she kind of had her reasons, but they just don’t make interesting characters to read about. Her friends were jerks, the love interest(s) were jerks, she was kind of a jerk. I stayed engaged the whole time and just kept on reading, which says something. But in the end, the reveal was more like, “Oh, huh, interesting.” Not, “Woah that’s crazy!”"}, {"userName": "Sarah  ", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/52213752-sarah", "userReview": "I enjoyed this mysterious young adult thriller but I didn't love the pacing. I did enjoy reading it and I was interest to see exactly where the author was going to take it but it didn't grab me and hold on to me as much as I had hoped it would. Over all I do believe a lot of my students will enjoy it."}, {"userName": "Amber", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/5898170-amber", "userReview": "that was trippy!"}, {"userName": "Cocktails and Books", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/3769521-cocktails-and-books", "userReview": "What did I just read??? This book was a trip, but not in a good way."}, {"userName": "KatieLMae", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/58679799-katielmae", "userReview": "It's been awhile since I read a mystery (okay my journal says it was last month but that was like 10 books ago so that qualifies as awhile ) and this did not disappoint! I burned through it one day and a couple of sittings because much like our main character Natalie I had questions and I needed answers! It takes a little bit for things to get going but once the story gets settled in the pacing is great and keeps things moving right to the end- as in literally the last page.. I don't want to give away anything with this one but I will say that the final reveal was a total jaw dropper!"}, {"userName": "Susan", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/4107324-susan", "userReview": "Well I didn’t enjoy this book. It was very choppy and I didn’t connect to any of the characters. Natalie was ridiculously foolish. I think the mystery part of it was supposed to be intriguing. But I honestly didn’t care what happened. Disappointed. I was provided an ARC by NetGalley and the publisher."}, {"userName": "Pauline ", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/6056639-pauline", "userReview": "Full review on release"}, {"userName": "Tara", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/9897195-tara", "userReview": "Natalie is on a birthday cruise with her parents and three best friends. They all thought it would be a good experience for Natalie, who is grieving the death of her boyfriend nine months ago. When Natalie meets an intriguing boy who ends up having a twin, a whirlwind mystery ensues.I really liked the premise of The Opposite of Here, and there were some really well written passages. Overall though, I found it to be very disjointed. The various movie scenes were confusing and messed with the flow of the book. I also wanted the ending to be less far-fetched. Probably not one we'll purchase or promote with our students.I read an ARC from NetGalley."}, {"userName": "Alyssa Marie", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/7858987-alyssa-marie", "userReview": "Well I know which book is definitely going into my worst books of 2018.This book had so many bad elements that I honestly couldn't find one thing that I enjoyed while reading it. Characters: Natalie was the most boring protagonist. She didn't do anything interesting. She didn't feel anything. She just kept doing all these weird, STUPID THINGS for no apparent reason. I ended this book disappointed because I felt that she (and EVERYONE ELSE) was so one dimensional that I couldn't like her or dislike her because she didn't have anything about her to even think about. As to everyone else, I felt like we could totally eliminate two of her friends and her parents and wouldn't have missed literally anything. I felt the author just told us how the characters were and didn't actually give us moments or dialogue to prove that they were actually that way. The love interests were so stupid,underdeveloped and completely ridiculous.Plot: WHAT KIND OF HOT MESS WAS THIS?! The whole reason Ray had for doing all the things he did was so far fetched and unbelievable that I'm still shocked this got published. The first thing natalie does when she meets a boy she thinks is hot is give him her cabin number??? She had one conversation with him and thought it was totally reasonable to give him her room number BEFORE EVEN KNOWING HIS NAME OR LITERALLY ANYTHING ABOUT HIM. She ditches her friends basically their entire cruise, and if she was hanging out with them she was complaining and moaning about how she didn't want to be there and wanted to spend all her time with a random stranger. She treats her friends and parents like such crap when they're all there to make sure SHE has a good time and she was just annoying and rude the whole time. The whole twin brothers thing was just uninteresting and not surprising. I hate how she spent her entire cruise thinking about and pining after this guy/guys and then to end the whole thing with such disinterest was just weird. Like why even do any of it then? The whole side-plot with her friend and her dead boyfriend was so obvious that I saw it from a mile away The plot overall was so bizarre and unbelievable and that was the main reason I kept reading so I was disappointed to say the least.Writing: THE WRITING WAS THE WORST PART. Idk if it was because I had an ARC or what but this entire book needed to be reedited for grammar. So much of the dialogue didn't have quotation marks therefore HOW AM I SUPPOSED TO DIFFERENTIATE WHO'S SAYING WHAT?! IS IT OUR PROTAGONIST? ONE OF HER FRIENDS? ONE OF THE BOYS? SOME RANDOM CHARACTERS? I couldn't tell half the time because it didn't have proper quotation marks! Another horrible part was there would be these awful jumps between scenes and it felt so abrupt. The entire book had such bad pacing issues. Combine the two and it makes for a very confusing,very jarring reading experience. Because of these issues it made it very hard for me to stay invested in the story. Also the weird lack of chapters was the WORST. There was actually a point where the author wrote the words \"Harrumph!\" COMING FROM A TEENAGE BOY. WHAT TEENAGE BOY SAYS HARRUMPH IN THE YEAR 2018?! This book was bad. The end"}, {"userName": "Mandi Schneck", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/8232129-mandi-schneck", "userReview": "When I saw this book takes place on a cruise ship, I knew it would make for a fantastic summer read. The Opposite of Here by Tara Altebrando follows Natalie, who has embarked on a cruise with some close friends and family for her seventeenth birthday \"Sail-A-Bration\".Natalie has been having a hard time, as her boyfriend has recently passed away, and her friends and family hope that this cruise is just the thing she needs to let loose. On the first day of the cruise, Natalie meets a charismatic boy who might be just the person to help her move on. But when he mysteriously disappears and there are rumors of someone going overboard, Natalie becomes obsessed with finding out what happened to him.This book was quite the ride! There were so many twists along the way, and it was virtually impossible to predict anything. Even when there were reveals, they were so outlandish it was hard to get on board (get it...cruise story-on board??) with them even though they were true. The best word to describe this book would definitely be surprising. It's definitely not a scary thriller, more of a psychological, twisty one.I loved Natalie as a character, but really disliked her friends. They were rude, judgmental, and really pushy, not seeming to care that Natalie was still deeply impacted by the tragedy she experienced. There are a ton of Hitchcock references, which I quite enjoyed, especially as they paralleled the story itself so well. This story is also interspersed with cruise newsletters and documents to let the reader know what is happening on board each day. While not really necessary, I thought it was a nice touch that made you feel more immersed in the atmosphere of the book. Having been on multiple cruises myself, I can say that the overall cruise setting was very authentically written.As much as I really enjoyed this read, and do appreciate its entertainment value, I have to take a star off for being extremely unrealistic in the plot department.Overall Rating: 4 out of 5 StarsThanks so much to Bloomsbury for an advanced copy of this mysterious summer read!"}, {"userName": "Bunny", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/1519823-bunny", "userReview": "Received via Netgalley in exchange for a fair and unbiased reviewThe first thing I thought after finishing this book: But what the hell does the title mean?!Seriously, the title has literally nothing to do with what happens in this book. WTF.The premise for this book is pretty intriguing. Still grieving teenaged girl spending her 17th birthday on a cruise ship with her three best friends and her parents. Suspicious stuff happens, and there's no use doing anything but figuring it out, because this is a cruise ship, and there's certainly not anything else going on at the time. This book reminds me quite heavily of the Christopher Pike-esque books of my teenagedom. In saying that, I admit that this would be an excellent read for the junior high-high school age bracket looking for some light thrillers. But also, they could do better. This book is all over the place. So much of it doesn't make sense, and it gets to that convoluted magic-but-not-magic, we-know-readers-like-supernatural-so-how-do-we-do-this-in-a-contemporary sort of plotting that is just going to throw off your average reader. Now, there is a twist literally right at the end that I was pleasantly surprised by. I saw some other reviewers who didn't like it, and I acknowledge it comes out of left field, but after the labyrinth maze I walked through reading this book, I found the prize at the end completely perfect.I can't diss this book, as I said, there is a market for it. I just think a few pinches and tweaks and a firm editor could've done wonders."}, {"userName": "Jana", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/4051653-jana", "userReview": "As summer vacation season begins, many readers are going to be looking for that perfect beach/swimming pool read. A review copy of this young adult fiction novel was sent to me to share with my #BookRelays group, and it would definitely be a good one to hand to a teenager looking for a steamy, Love Boat meets Alfred Hitchcock Presents mystery. Natalie is having a tough time recovering from the sudden death of her boyfriend, and so her parents take her and three of her friends on a Caribbean cruise vacation to celebrate her seventeenth birthday. But instead of cheering her up, the vacation presents a weird mystery. On the first day of the cruise, Natalie meets an attractive young man who invites her to go hot tubbing with him. But while she’s gone to get her swimsuit, he disappears mysteriously. Worried that perhaps he’s gone overboard, Natalie starts trying to figure out who this fellow is and what happened to him. As she gets more involved in this mystery, she finds out a lot about herself and her friends. There are mature, sexual themes presented in this book. So it’s definitely a book that’s geared more towards high school and college kids, than middle grade students. But it’s a fast-paced read for a summertime vacation, perfect for the beach or a cruise ship!"}, {"userName": "Shannon Waugh", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/16644182-shannon-waugh", "userReview": "Thank you @kidlitexchange #partner for this review copy of The Opposite of Here by Tara Altebrando that will be out June 5, 2018!I give it 4/5 stars.This book was an easy young adult read and definitely kept you wondering. Natalie, the main character, is a teenager who has already dealt with the death of her boyfriend at a young age. To try and help her get over it and out of her funk, her parents plan a cruise for her birthday. Her 3 best friends join them and during their sail-a-bration as they cleverly called it, secrets were revealed, new love interests come into play, and crazy mysteries get revealed. The end was a twist I did not see coming but ties it all together like a bow. I will admit, not being a teenager and reading this was a bit crazy with all the \"likes\" in the dialogue of all the teenagers but the author nailed it in regard to it being so realistic. I suggest this book to young adult readers in high school- I think they will really enjoy it. And now, I want to go on a cruise <3 #kidlitexchange #theoppositeofhere #taraaltebrando #youngadult #youngadultfiction #yafiction #reading #bookstagram #currentlyreading #bookreview #bookreviewer #reader #mystery #shannanigans #shannanigansworld #shannanigansreads #bookdragon #bookworm"}], "description": "\"A taut, evocative thriller that's surprising to the last page.\" --Karen M. McManus, New York Times bestselling author of One of Us Is LyingThere's no hiding on a cruise ship-not even from yourself. Natalie's parents are taking her and her three best friends on a cruise for her seventeenth birthday. A sail-a-bration, they call it. But it's only been a few short months since Natalie's boyfriend died in a tragic accident, and she wants to be anywhere but here. Then she meets a guy on the first night and sparks fly. After a moonlit conversation on a secluded deck of the ship, Natalie pops down to her cabin to get her swimsuit so they can go for a dip. But when she returns, he's gone. Something he said makes her think he might have . . . jumped? No, he couldn't have. But why do her friends think she's crazy for wanting to make sure he's okay? Also, why do they seem to be hiding something from her? And how can she find him when she doesn't even know his name? Most importantly, why is the captain on the intercom announcing the urgent need for a headcount? With her signature thrilling storytelling, the author of The Leaving and The Possible explores our vulnerability to the power of suggestion-and the lies we tell others and ourselves-in a twisting, Hitchcock-inspired mystery with high stakes and dark secrets.", "title": "The Opposite of Here", "url": "http://www.goodreads.com/book/show/36314744-the-opposite-of-here", "average": 3.33, "cover": "https://images.gr-assets.com/books/1525719878l/36314744.jpg", "reviews": 45, "authors": [{"url": "https://www.goodreads.com/author/show/168413.Tara_Altebrando", "name": "Tara Altebrando"}], "type": ["Young Adult", "Mystery", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/36314744-the-opposite-of-here", "http://www.goodreads.com/book/show/39351637-the-opposite-of-here", "http://www.goodreads.com/book/show/39016666-the-opposite-of-here", "http://www.goodreads.com/book/show/26073074-the-leaving", "http://www.goodreads.com/book/show/11737265-the-best-night-of-your-pathetic-life", "http://www.goodreads.com/book/show/8715124-dreamland-social-club", "http://www.goodreads.com/book/show/291095.The_Pursuit_of_Happiness", "http://www.goodreads.com/book/show/18079892-the-battle-of-darcy-lane", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}