{"ratings": 49524, "userreviews": [{"userName": "Carrie O'Maley Voliva", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/4837834-carrie-o-maley-voliva", "userReview": "I really wanted to like this book because I've enjoyed Emily Giffin's books in the past. But it was terrible. At first I thought maybe it was just because I'm not a football fan, but the characters are all horrible and poorly developed and (spoiler) I just rolled my eyes every time Shea talked about dreamy Coach Carr. Ick."}, {"userName": "Carolynn Hine", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/19431008-carolynn-hine", "userReview": "What the friggidy frack did I just read?? It was like a really bad episode of Friday Night Lights... Wait, no. That's insulting to Friday Night Lights. I was so looking forward to the release of this book, but it was terrible. A main character that I couldn't connect with, a completely underdeveloped supporting cast, and a bizarre plot with too much random (and sometimes disturbing) stuff crammed in. Overall, 2 giant thumbs-down - and I have a feeling many fans are going to be just as disappointed as I was."}, {"userName": "Stephanie", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/2940618-stephanie", "userReview": "I'll be honest, I was prepared to hate this book. Emily Giffin's work and I have a relationship in which I go in expecting absolute drivel and she either, a.) surprises the poop out of me and I enjoy the book (Hello, \"Something Blue,\" \"Where We Belong\" and \"Love the One You're With\"), or b.) I curse myself for spending the money on exactly what I knew I'd be getting (everything else she's written). It's this sort of question mark that keeps me buying her books. I don't know why. And I read them SO fast because I have to know what happens to these awful, atrocious characters!This was a new low for Giffin. It's no secret that I am not in the camp of women that LOVE \"Something Borrowed.\" Girls that sleep with their best friends fiances...no, thank you. I don't care how perfect you think they are for each other. It's still not cool. But now, NOW we get a chick that sleeps with her best friend's dad!!! WOW!!!Let's go over the basic premise first, though. Because it was, you know, oh-so-creative: A college football coach, a LEGEND (as the main character mentions in the book), REVERED in the small town in which he coaches is not the most morally upstanding human to ever grace the planet?!!? He turned a blind eye once upon a time to possible rape, not reporting the allegation to the university officials or law enforcement?!!? I've never heard a story such as this. Oh wait, hello Penn State and Joe Paterno, maybe I have. All right, so not a creative idea. We can excuse our dear Emily for that, right? The foreshadowing was there from the beginning as we got the scoop on Lucy - she cuts people off if they cross her. And I thought, \"That's my kind of chick.\" She's got backbone. She's got gravitas.....until, she doesn't.Lucy loses her mother to a long battle with cancer and the super hot, delicious coach 20+ years Shea (our main character's) senior loses his wife. Terrible, right? But almost immediately, Shea begins questioning where she is in her life. Logically, Coach, rather than just grieving his wife, decides that he is ultra-concerned about Shea's career trajectory himself. Ok, so tons o' fluff in between as Shea figures out the obvious - she has feelings for Coach, her best friend's dad that has practically raised her and been her only father figure. Can we say GROSS?!?! Look, I will disclose: when I was about 11 or 12, my brother played on a basketball team with a kid who had a super hot dad. So I'm not saying people's Dad's can't be hot. And I'm not saying that this example is even remotely close to the same situation. However, to act on this attraction, in my opinion, is inappropriate when there is an established relationship between the two families. And ESPECIALLY when the man has just lost his wife and the family has treated you like another daughter. GROSS. So yes, from the 3rd chapter, I was hoping Giffin would take the high road and not allow this relationship to escalate (I knew better, trust me). In the meantime, Shea manages to snag the starting quarterback for the Dallas Cowboys. The ONLY thing I liked about this book was that the description of Ryan James had me picturing Chris Evans the whole time. Yum. Ok, so Mr. Big-Time Quarterback becomes super obsessed with Shea and is totally in love with her. And she's....just not feeling it. Why? Because she is hot for the 56-year old Coach that addresses her as \"Girl.\" HE CALLS YOU \"GIRL!!!\" That might be a sign that he sees you as just that! Until...nope, all of a sudden over some beef tacos, Coach realizes he's hot for Shea, too. But he knows they can't act on it...In between all this, it becomes apparent that Chris Evans' hot doppelganger QB has serious anger issues. Shea gets told by his ex-wife that he can be violent. \"Nonsense,\" thinks Shea, \"I've gotta keep up this relationship so I don't do it with Coach. So yes, I love him.\" (Eye roll). He even FREAKS OUT on a night that Shea doesn't call him by 9pm and goes onto have the worst Thanksgiving game of his career. Because she is that powerful! So the relationship is falling apart, even though Shea is fighting to make it work with this super-insanely-jealous-Fatal Attraction-psycho Ryan James...Until (SHOCKER), Mr. Dallas Cowboys puts his hands on Shea and she ends things with him. (She needed an out for this relationship, so conveniently, he is a domestic abuser.) So convenient is Ryan's tendency to abuse his ladies that Shea invites Coach over right after \"the incident\" as Ryan is trying to do God-knows-what to Shea (rape her? beat her? scare her?). I'm glad we didn't go further into that sequence, the book was disturbing enough as is. But Coach to the rescue!!! He beats the poop out of the Dallas Cowboys QB...TOTALLY LIKELY, by the way...and Shea is all, \"Coach, my hero!\"Then Coach admits to Shea that maybe, this one time...well, maybe Ryan raped a girl. I'm sorry, WHAT?! \"Well, no, no, I didn't believe her,\" Coach tells Shea. \"Because, you know, she was probably scheming against Ryan for breaking up with her. And you know, she was the loose type.\" Wow, this just keeps getting better. So obviously, a woman who gets raped and has the courage to come forward about it must have ulterior motives. And if it's not her motives, then, it's her wardrobe. She was asking for it. Boom, Emily Giffin. As bad as the book was up to this point, you TOTALLY lost me here. I'm sure Emily's husband, assistant and her unwavering fans will tell me that this was to prove a point about college and professional sports. That people look the other way. Ok, so let's elaborate on that...Interestingly, one storyline throughout the book that was mentioned in passing and never developed was the most interesting one - the NCAA violations investigation. There's mention of the current superstar of the team getting courted by boosters and a player from back in the day having a car bought for him. There's mention of bias in grades and academic violations. And then nothing.... Shea just decides to resign from her job because she doesn't believe she can be objective in reporting about her school or the investigation. And then that's it. We never hear about the resolution to the investigation. Everything gets tied up in a neat little bow from there. In about 40 pages, Lucy finds out about her Dad and Shea when they make the intelligent decision to share an intimate moment in Lucy's house. Lucy forces Shea to choose between her and her dad. She \"chooses\" Lucy (but not really), gets into a depressed funk, all of a sudden has a fantastic relationship with the father she started out hating in the beginning of the book, gets into a big fight with her vapid mother. Then Walker wins the National Championship and Lucy decides, \"You know what, you two should be together.\" The End. Huh?!?!? I can't believe I finished this thing. And I did so quickly. But don't confuse being curious as to how an author resolves something with the sign of a good book. This wasn't a good book. If you're still going to read this, however, make sure you either get it on clearance, from the library, or borrow it from a friend. I still feel like I need to take another shower the get the skeeve off of me."}, {"userName": "Krishma", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/10360920-krishma", "userReview": "Ugh. No.For the sake of spoilers, I'll just say that this book was definitely a page turner. I couldn't wait to see what happened next, but that's because I was waiting for it to get better. There was a glimmer of hope at page 400 out of 413, but it reverted back to it's crappy self. I'm disappointed, I generally enjoy Emily Giffin books, but this definitely left something to be desired. It wasn't well written, the character development was sub par, the author seemed to be flippant about serious issues, and the relationships were just creepy. It was hard to empathize with the characters. I'm glad it's over."}, {"userName": "Melissa", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/7807770-melissa", "userReview": "[Why is the NCAA investigating Walker? Now that Shea knows about Ryan's past, she really would rather REMAIN QUIET IN ORDER TO SAVE WALKER'S REP than use her journalistic integrity and expose him? She was a weak character, and Giffin's attempts to justify sexual assault in the name of loyalty to the game are grotesque. Not to mention, the love story was beyond incestuous, with super-problematic power imbalances. (HE CALLS HER GIRL FOR CRYING OUT LOUD.)  (hide spoiler)]"}, {"userName": "Betsy", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/201413-betsy", "userReview": "Here is what I learned from reading this book:1. Emily Giffin's favorite word is \"smirk.\" Her characters do a *lot* of smirking. If Emily had been allotted a certain number of uses of the word \"smirk\" (or \"smirked\" or \"smirking\") for the duration of her life, she would have used them all up in the 413 pages of this book.2. Fictional Texans who treat football as a religion are almost as annoying as Texans who treat football as a religion IRL.3. Ms. Giffin needs to learn that the phrase has to do with a bad feeling \"in the pit of one's stomach.\" Here is a direct quote: \"I didn't answer her question, just turned and walked out the door, a pit in my stomach.\" What kind of pit? A peach pit? An avocado pit? An armpit?4. When I am inclined to quit reading a book because it's so annoying, I should listen to my inclinations. For the record, I kept on with this one because I was waiting for the big payoff. I was doomed to disappointment. The characters are one-dimensional and unlikable, the writing is clunky and amateurish, and Emily Giffin needs a much better editor."}, {"userName": "Julie Porter", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/28134637-julie-porter", "userReview": "Too much football and a slightly incestuous-like relationship ruin this book. The characters are great on their own, but their relationships and the story in general don't feel authentic. It is actually a bit disturbing, if you really think about the true dynamics/power structure of it all."}, {"userName": "Sarah", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/7290838-sarah", "userReview": "I was UBER disappointed in The One and Only. I am a huge Emily Giffin fan. Have read all her books and have even met her twice. I also happen to LOVE football. LOVE. Even went to the NFL Draft in early May. You'd think combining two things I thoroughly enjoy would be a good thing. Nope, I was very, very wrong. While, I did enjoy the name dropping of Jon Gruden (hee!) and that Coach Carr happened to be a closet GB Packers Fan (Go Pack Go!) AND that my Aaron Rodgers was named the best QB in the league by Shea's colleague at the Dallas Post (BOOM!), that's unfortunately where the novelty of an Emily Giffin football book ended. Like a few other posts I skimmed, I did not enjoy the saga of Shea and Coach Carr. At the early points in the book, I strictly got a father/daughter vibe from them. Shea was everything Lucy refused to be. When we got the tingly touches and longing looks, I became afraid. Very afraid. I also didn't understand Shea's fascination with Coach Carr outside of football. He wasn't a particularly good father or husband to Connie. He didn't have strong bonds with his players (a la Coach Taylor on Friday Night Lights) I didn't see him caring about them as people or being a \"leader of men\" as Stephen A. Smith so frequently describes coaches on ESPN's First Take. There was simply no emotion there. Yeah, he was an excellent football coach and was adored by the town of Walker for football. Other than that, I just didn't see it. One of my biggest issues with The One and Only was the destruction of the character of Ryan. Right from the get-go, I loved Ryan. He was every girl's dream. Hot, talented, successful NFL QB. As a football loving girl, I totally have had that fantasy! Falling in love with the popular quarterback, sitting in the stands with the other wives and girlfriends and cheering on your man! (Hey-a girl can dream :-). Towards the beginning of the book, Ryan was essentially the perfect guy. He donated to charities, stayed true to his roots by attending Walker games, and didn't take advantage of Shea when she had too much to drink. The thing was....even before the \"twist\" with Ryan, Shea just wasn't that into him! It was glaringly apparent from early on. Sure, she tried, with the weird poofy hair makeover, and the casserole cooking, but she always had an excuse for not attending his games and frequently lied about her whereabouts. Ryan HAD to be thrown under the bus to make the weak Coach/Shea pairing even kind of work. The happiest Shea was in her relationship with Ryan was when she could throw her successful QB boyfriend in her stepmother and half sister's faces. After Ryan squeezed Shea's arm, and his daddy issues and history of domestic violence was revealed, I felt like it was Shea's \"Get Out of Jail Free Card.\" Even when he was the perfect boyfriend, Shea didn't love him. His issues were the excuse she was looking for to pursue Coach Carr. I thought Shea and Coach were inappropriate, chemistry-free, selfish, (I could go on) and was pretty much creeped out during their romantic scenes. I didn't appreciate how Lucy was deemed \"selfish\" for not being thrilled about their relationship either. I would be SO not happy if my dad dated my best friend and told me to deal with it. Ugh. I just didn't care for Shea and her self pity, didn't \"get\" the appeal of Coach Carr, Lucy was selfish and whiny, I feel almost guilty for still liking Ryan after his character beat down. I guess the only characters I still kind of like were Miller and Neil. ha. They were fun. I could see how non-football fans wouldn't dig the incessant references and name dropping, but that was the bit I did enjoy. The relationships and the characters were lacking for me. I will continue to read anything Emily writes, but this one sadly didn't score."}, {"userName": "howsweeteats", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/28366866-howsweeteats", "userReview": "GAH. I ended up staying awake until 3AM finishing this book last night (a terrible habit I have when it comes to my favorite authors) and am still at a loss of how to rate it. Being a gigantic fan of Emily Giffin’s first three books, and not omgloving her last three – I thought this was one of her best (if not thee best) written books. That being said, I am a football fan but the detail and constant football talk was even a bit too much for me. I couldn’t put it down, but more so because it was like watching a train wreck unfold in front of me – it made me SO uncomfortable, maybe because I am close in age to Shea and just can’t imagine a relationship with someone who practically RAISED you. However, my inner hopeless romantic chick-lit loving heart still wanted to see them together at times which made me feel sick and confused all at once. I’d love a sequel to this story because I just can’t fathom the future of this ending. I’d give it 4.5 stars for the writing but 3.5 for the story. I’m all about pushing boundaries but this bordered on inappropriate and weird."}, {"userName": "Emma", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/5315599-emma", "userReview": "I was expecting a beach read, definitely not. Had a looming sense of dread / discomfort through most of the book, and only finished it to find out what happened. Blech."}, {"userName": "Ashley Saar", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/217908-ashley-saar", "userReview": "I really wish the story hadn't gone there."}, {"userName": "Michael", "userReviewDate": "Jun 12, 2014", "userURL": "http://www.goodreads.com/user/show/1177534-michael", "userReview": "On the surface, Emily Giffin's The One and Only is a bit outside my usual reading comfort zone. My wife lovingly teased that I was reading \"romance\" and \"chick lit\" as I read the book over the course of a couple of days, neglecting several other more \"manly\" novels like a Michael Connelly mystery and the latest installment from the Dresden Files.As I've stated before, I find it frustrating when we (readers, authors, marketers, book stores, libraries, etc) have to create such a niche for reading material. I often find myself wanting to create a section called \"Really good stuff that you should take no shame in wanting to read.\" I'd unreservedly recommend this book to anyone who enjoys a good story with interesting characters. I know I certainly enjoyed it a great deal and I don't necessarily think I have to turn in my \"guy card\" for doing so.Part of it could be that our protagonist, Shea Rigsby is a die-hard football fan. For as long as she can remember, Shea has been obsessed with the Walker football program. She can quote stats, recall players and analyze plays with the best of them. This has led to her staying in the small Texas town where she grew up so she can be close to the team, her family and her good friends, including the family of Walker's legendary head coach.It's when the wife of the head coach passes away that the early 30's Shea is given a moment to take a step back and assess her life and if she's really happy or if she's just passing time. That leads Shea to dump her boyfriend and begin pursuing her dream of becoming a sports writer. She also begins dating the superstar QB for the Dallas Cowboys, but it turns out she may have feelings for someone else in the picture.I've read a couple of reviews that really call into question the romantic subplot of Shea developing feelings for the older Walker football coach. But I don't necessarily understand these objections, other than the superficial ones related to the age gap between the two. Giffin's development of this story works well and feels authentic, including Shea's guilt over her feelings in the wake of the coach's wife's death and the fact that she's been best friends with his daughter for years. It's clear that Shea has always admired the coach and had a bit of a crush on him, but it's not until well after his wife passes away that she begins to think he might be something more to her. Again, the journey that Giffin puts Shea on with her romantic life rang true to this reader. Certainly, we've seen a lot of couples overcome obstacles on the printed page and this one is no different than most.What kept me from giving the book a full five stars is the fact that it felt like it needed a bit more time to develop a few things in the last quarter. The novel proceeds at a nice pace, with certain things developing in Shea's life and then suddenly it seems to kick it up into a higher gear with about fifty pages to go and a lot to wrap-up. It feels as if the novel or Giffin started to run out of steam or is preparing for a sequel. As for the issues of this being \"chic lit\" and \"romance,\" yes there are elements of both here. But the romance angle isn't your standard bodice ripper with phrases like \"love muffin\" used so I think you'll be OK if that's a roadblock to your wanting to read this one. And if this is \"chick lit\" with a strong female protagonist who undergoes an interesting character arc all while loving football, then sign me up."}, {"userName": "Nicole A", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/23316333-nicole-a", "userReview": "I am a female sportswriter like Emily Giffin's main character, Shea. Even if I enjoyed the characters and plot development in this book (which I didn't -- a surprise considering how much I loved those in Giffin's other books), I would have still despised the way Giffin portrayed my profession. Actually, the way she portrayed female sports fans in general was insulting. Not all women who know and like football want to date star athletes/coaches. Female sportswriters are professionals, too, and having Shea chalk up her way-out-of-bounds relationships as a conflict of interest that she didn't seem too concerned about until the very end was disappointing. (As was the idea that she could continue along in the industry, at a place like ESPN or the New York Post -- really? After all her journalistic missteps?) I know this is a novel and not real life, but the perception that women only care about sports/work in sports to \"get the guy\" is tired and frustrating. I don't know if I would have liked the book better had it not insulted my profession/passion. But if Giffin was trying to appeal to female sports fans with this heroine, she missed her mark badly."}, {"userName": "Jessica", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/10581704-jessica", "userReview": "Disappointing. Weird relationship storyline-could not get over that age difference and fatherly role."}, {"userName": "Nancy Singel Baker", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/24690508-nancy-singel-baker", "userReview": "Make this \"The One & Only\" Emily Giffin book you never read."}, {"userName": "Tu-Quyen", "userReviewDate": "May 25, 2014", "userURL": "http://www.goodreads.com/user/show/9306192-tu-quyen", "userReview": "Emily Giffin's talent is writing books with characters I absolutely hate and have no respect for, and make me feel like I need a shower to wash the disgust I have for them away. I honestly don't get the popularity of her books. I thought Something Borrowed was shallow and had selfish protagonists but this one beats that hands down. This book was boring, the main character completely unlikeable and self-centered, and I couldn't wait to finish it hoping that it wasn't going down the way it was hinted at in the first couple of chapters. I wish I could get those hours of my life back.Spoilers ahead . . .I could not believe that she would brush aside her concern about the possible rape victim as if it was a necessary evil of football. How utterly ludicrous that after she herself was attacked she could overlook something so awful. Also her hollow sacrifice in the name of friendship reminded me so much of Something Borrowed except much worse because Lucy wasn't wrong for feeling icky about the whole best friend getting with her father issue. It was so gross and I couldn't understand why Lucy suddenly rolled over on the issue. The \"happy\" ending was so thrown together and simply bypassed all of the issues building up to it rather than dealing with it. If I could give this negative stars I would."}, {"userName": "Lana Meredith", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/5749459-lana-meredith", "userReview": "Thoroughly disappointing. I eagerly looked forward to it showing up on my doorstop this week, as I've loved and own most of Giffin's previous books - not to mention I was in serious need of a feel-good read. But this one felt completely different from her others. I felt like I was reading a diluted book version of the TV series Friday Night Lights, except Tami was dead and Lyla fell in love with Coach Taylor, then acted indignant when Julie thought it was weird. Beyond that, though, the characters were choppy, forced, and one-dimentional; her protagonist unbelievable. Not even the most outspoken people say exactly what they think about everything, nor is anyone, even the protagonist in a chick-lit novel, this unthinking or uncomplicated. Combine that with Giffin telling us through the whole novel how perfect her protagonist and romantic lead are, and I felt sick when I finished. Giffin's strength is in writing flawed heroes, plural perspectives, real-feeling relationships, and making her readers understand both sides of a situation that would normally seem wrong. I saw her trying to do that in this one, but it didn't come across as her others. It just felt plain wrong on all levels."}, {"userName": "Molltovcocktail", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/24986579-molltovcocktail", "userReview": "Just remember, ladies, if a man has a really important football game to win, nobody cares if he raped you! That's just one of the many things I learned from this terrible book."}, {"userName": "Sara", "userReviewDate": "May 01, 2014", "userURL": "http://www.goodreads.com/user/show/2250294-sara", "userReview": "1 1/2 stars...it gets the extra star just because I kept reading since I feel like this a book I love to hate. I have read everything by Giffin and usually really enjoy the novels as a fun summer read. This one made me uncomfortable since the main character who was boring and only cared about football falls in love with her father figure. Ew. Not interested in reading a book about a quasi-incestuous relationship. I really enjoy football (although I cannot relate at all to the Texas football culture or Texas in general) but between the cliche characters and endless football stats and rants about the NCAA this book was terrible. It needs mentioning again, the whole father figure part was AWKWARD and GROSS."}, {"userName": "Arlene", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "Rating Clarification: 2.5 Stars“You know in your heart when you’re doing the right thing and when you’re not. And you just have to do everything you can to stay the course.” The One and Only is my first novel by Emily Giffin, which I was excited to dive into. Unfortunately, this didn't quite work out for me, so I’m not quite sure how to proceed with this author. The One and Only shares Shea’s story at a time when a life changing event shifts the town of Walker, Texas – a town that revolves around their football team and worships Coach Carr’s reign over the team. When his wife dies, the team rallies to win the championship for him. And, thirty-year old Shea struggles to make sense of her feelings for the Coach that not only practically raised her, but is also her best friend’s father.First and foremost, I have to admit that I struggled with the relationship between father-figure Coach Carr and Shea. I just couldn't let my imagination float to enjoy the possibilities between these two. Even the main character admitted that there were too many reasons it wasn't right, including (1) he was too much older than her (20+years), (2) he recently lost the love of his life, and (3) he was her best friend's father. What I'm surprised she left out was that he practically raised her. His nickname for his is “girl” and to hear him call her that throughout the book just didn’t sit right with me. I had such a tough time transcending through the dynamic of this relationship. Secondly, I liked the football aspect to the story and loved the main character’s ability to pick herself up and plow forward. Shea being a sports writer was interesting and I appreciated her love of the game and her craft. The games were exciting and all of the elements that go into a football season such as draft picks, investigations, etc. was interesting to read about. Also, the dynamics that the secondary characters added was enjoyable and full of depth. Miller was surprisingly one of my favorites. Lucy was just okay and Ryan lost his appeal quickly.Overall, I feel it would have been a great story if the love interest had been someone else. The particular dynamic between Shea and Coach Carr just didn’t work for me, and I was a bit disappointed in my first and probably only novel by Emily Giffin."}, {"userName": "Christina Hodge", "userReviewDate": "Feb 21, 2014", "userURL": "http://www.goodreads.com/user/show/12863044-christina-hodge", "userReview": "Emily Griffin fans will not be disappointed with this book...after receiving an ARC of the book, I could hardly contain my excitement. This novel definitely contains a love story, along with a deep connection to football...as a fan myself, I could relate to the connection, although others may find this part difficult. The reason for the 4/5 rating is due in part to my belief that parts of this book were a little \"far-fetched\"...all in all, I would recommend this book!!!"}, {"userName": "Ashley", "userReviewDate": "Jan 25, 2014", "userURL": "http://www.goodreads.com/user/show/15405972-ashley", "userReview": "Emily Giffin's long-awaited seventh novel is FINALLY here. The One & Only explores love in all its forms: loving the wrong person, loving the right person, loving your job, loving your family, loving your friends, and learning to love yourself.Let me just preface this review by saying that I love Emily Giffin and I whole-heartedly agree with this review about Emily: “A modern day Jane Austen.” — Cincinnati Enquirer.I loved her books before she was popular and I frequently recommend them to my friends. Her books are charming, well-written, and easy to sink into. I'd even say that her books are cathartic! Better yet, she's actually talented; she doesn't need to write sex to sell books. She creates chick-lit with some real substance, filled with relatable, memorable characters and masterfully writing the moments that make us ache, and smile, and laugh.But sadly, The Only & Only did not stand up to her other books. Not even close. And it wasn't just that it's about a woman who falls in love with a man who is twenty years older... who is also her best friend's father... and a man who JUST lost his wife. It's because Shea is a painful protagonist to deal with. She's weak-willed, foolish, selfish, and a bad friend. She doesn't seem to know what she wants for herself in life, and she's never willing to think about the future in much detail. I found myself reading desperately through the book, hoping she wouldn't end up falling for her friend's father.When her best friend FINALLY finds out and gives her an ultimatum, I was happily relieved. But know that all the uncomfortable reading you do, through the drama and chaos resulting from the relationship, is all for nothing. In the end, Lucy's deep, moral (and RATIONAL) beliefs actually meant nothing at all. Lucy very suddenly gives her friend her blessing, cuing the happily-ever-after for the reader. Ugh.Emily's stories are so powerful BECAUSE of the realistic qualitiy to her books, specifically her characters. She is really good at writing about love, loss, and everything in between. But the relationship between Coach Carr and Shea doesn't feel real anymore than it feels right. A REAL happy ending (and a redeemable one at that) would have had Shea end up alone and starting fresh, dealing with her own personal issues and figure out how to love herself. THAT'S a happy ending!I'm heartbroken to give such a low rating to one of my favourite authors. Emily Giffin is extraordinary and I'm looking forward to an eighth book from this talented author. But this story about a small-town girl with Daddy issues is something I'd like to forget.2.5 Stars"}, {"userName": "Keturah", "userReviewDate": "May 30, 2014", "userURL": "http://www.goodreads.com/user/show/328614-keturah", "userReview": "Ugh. Is Emily Giffin a misogynist? This book was awful. The storyline itself could have been salvaged, perhaps, if Giffin had ever decided to delve into the puzzle she created about Walker University's misconduct investigation by the NCAA. But she left that thread hanging with absolutely no resolution. Instead she decided to reward Walker with a NCAA football championship and excuse its' pretty awful behavior. Giffin sabotaged it the most by having the protagonist decide it was okay to let her super quarterback ex-boyfriend get away with a past history of abusing girlfriends as long as he finally was getting therapy. Did she ever think about pressing charges? Nope. And the worst was how she gave a complete pass to her true love, Coach Carr, for turning away from the hotshot quarterback's abuse of his college girlfriend and her accusation of rape against said quarterback. Our great protagonist, Shea, decided it was fine for him to do that, even though she herself was later attacked by the quarterback. Because the Coach explained it was all about teamwork, not one slightly trashy girl with a bad reputation who was probably lying about the rape. ARE YOU KIDDING ME? I am disgusted with the entire book. These were just the worst aspects of it for me. Major thumbs down, Emily Giffin. You are making money off the entire commercialization of college football just as the NCAA is, which is sickening in its own right. Your book would be laughable, if its treatment of women weren't hideous and heinous."}, {"userName": "Courtney", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/6280062-courtney", "userReview": "I cannot begin to say how much I despised this book. I am a diehard football fan who lives in a small city that lives and breathes for their one professional sports (football) team so I was so excited to read a fictional book - by a female author for once - that I might be able to relate to. However, by chapter 5 I knew what was going to happen (and maybe even before then) and I pleaded to Emily: \"No! Don't go there! Please! Take another route with your plot.\" But she went there. The entire book just made me feel wildly uncomfortable which isn't the reason why I wished I had never wasted time on this book. I felt the writing was weak and the story lines in general. I would have thought that this was Giffin's first novel since it came across rather amateur. I didn't enjoy her last two novels either so I am officially breaking up with Emily Giffin - at least for a while.Also are people being bribed to give this book more than two stars? I simply can't believe that the average rating for this novel is a little over three stars."}, {"userName": "Jennifer", "userReviewDate": "Apr 20, 2014", "userURL": "http://www.goodreads.com/user/show/4498910-jennifer", "userReview": "All this needs at the beginning is the theme song to Friday Night Lights. I'm sure that since they can do greeting cards that play music, the hardcover book could be engineered to have a music chip in it.Not quite the tiny town in FNL, not high school football, but the official state religion of Texas is football, and Shea lives and breathes for Coach Carr and his family and his team. This book is for the girl who sleeps in her sweetie's jersey at night and has her girlfriends over for gossip in the kitchen during the game. I like it better than Something Borrowed, just for that reason. Plus, Shea was born on the day of the Miracle on Ice which is the best single sports game ever played. Great job, Emily Giffin!"}, {"userName": "Kim", "userReviewDate": "Apr 09, 2014", "userURL": "http://www.goodreads.com/user/show/6892828-kim", "userReview": "Well if you're not a die hard football fan maybe give this one a pass (no pun intended). She took a risk here segregating her audience to those who wanna read a whole lot of football lingo. Will make a better movie than book."}, {"userName": "Sara", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/32014561-sara", "userReview": "[ On the age gap I am going to say ‘no comment’, but what about the kids? Isn’t it weird that Coach and Shea never discuss it in depth? I think it was too much of a big question in their relationship for the author to almost ignore it. (Also considering that the topic is so important that she wrote another book on it)  (hide spoiler)]"}, {"userName": "Jess ", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/4448196-jess", "userReview": "I've read and loved all of Emily Giffin's books and cannot wait to read this one! Also excited to see the cover and what color will be chosen for it...? :)"}, {"userName": "Leanne", "userReviewDate": "Jan 25, 2014", "userURL": "http://www.goodreads.com/user/show/5873788-leanne", "userReview": "I think that I couldn't help but love this because I'm a major football fan (albeit NFL, not college) and I also have a huge soft spot for Emily Giffin - she's one of the only straight chick-lit authors I read on a consistent basis. I found this to be inherently readable and addictive, and I finished it in a day on a plane ride. But it certainly had its flaws, and I considered bumping it down to a 3 for that. The most glaring one was the lack of resolution to the NCAA investigation - what was Walker even being accused of?! Were they guilty?! We'll never know! And then we have the ending - a major change of heart completely out of character, all in the name of a sappy happily ever after - it felt rushed, and forced, and is not typical of Emily - she usually has her characters make difficult, realistic choices and hasn't shied away from unconventional endings in the past (hello, Love the One You're With!) However, there's also more depth and complexity to this novel than I've seen from her last few, which I appreciated. And did I mention that I love football? (I can only aspire to one day be half as knowledgable as Shea!)"}, {"userName": "Carla", "userReviewDate": "Dec 29, 2013", "userURL": "http://www.goodreads.com/user/show/5738574-carla", "userReview": "I adored all of Emily's previous books. However, when I read this involved football I wasn't sure what to think of it since I don't like the sport. But to no surprise, one more time she nailed. Yes, it talks a LOT about football but...it has SO much more to the story that it didn't bother me. It actually made me curious. O_o All the characters are engaging: Lucy, Coach Carr, Neil, Ryan...even Miller. Oh...who am I kidding? I LOVED Miller. Shea is likable from the get go and her((huge))life switch can happen to anyone. It feels REAL. I admire how she 'handled' her situation, her loyalty to her friendship and even the sweet way she still cares for people no longer so present in her life. More than half-way into the book I was rooting for an end but totally changed my mind and at the very last page it was impossible to hold my tears. Very emotional. Read!! I totally recommend. Even to no football fans like me."}], "description": "Thirty-three-year-old Shea Rigsby has spent her entire life in Walker, Texas--a small college town that lives and dies by football. Raised alongside her best friend Lucy, the daughter of Walker's legendary head coach Clive Carr, Shea was too devoted to her hometown team to leave. Instead she stayed in Walker for college, even taking a job in the university athletic department after graduation, where she has remained for more than a decade. But when an unexpected tragedy strikes the tight-knit Walker community, Shea's comfortable world is upended, and she begins to wonder if the life she's chosen is really enough for her. As she gives up her safety net to set out on an unexpected path, Shea discovers unsettling truths about the people and things she has always trusted most--and is forced to confront her deepest desires, fears, and secrets.", "title": "The One and Only", "url": "http://www.goodreads.com/book/show/18465837-the-one-and-only", "average": 3.12, "cover": "https://images.gr-assets.com/books/1387399576l/18465837.jpg", "reviews": 5378, "authors": [{"url": "https://www.goodreads.com/author/show/13370.Emily_Giffin", "name": "Emily Giffin"}], "type": ["Womens Fiction", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/18465837-the-one-and-only", "http://www.goodreads.com/book/show/18465657-the-one-only", "http://www.goodreads.com/book/show/42156.Something_Borrowed", "http://www.goodreads.com/book/show/42155.Something_Blue", "http://www.goodreads.com/book/show/2120652.Love_the_One_You_re_With", "http://www.goodreads.com/book/show/42149.Baby_Proof", "http://www.goodreads.com/book/show/7114761-heart-of-the-matter"]}