{"ratings": 10960, "userreviews": [{"userName": "Lyn", "userReviewDate": "Sep 28, 2012", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "I love the reading of Bradbury on a crisp, autumn morning … sounds like October.The October Country is a collection of short stories by the Grandmaster writer Ray Bradbury. Eschewing any connection to science fiction, this group of purely fantasy tales resounds with Bradbury’s fascination with and brilliant creativity in the realms of the occult, macabre and the dark. Bradbury begins the book with this explanation: “The October Country … that country where it is always turning late in the year. That country where the hills are fog and the rivers are mist; where noons go quickly, dusks and twilight linger, and midnights stay. That country composed in the main of cellars, sub-cellars, coal bins, closets, attics and pantries faced away from the sun. That country whose people are autumn people, thinking only autumn thoughts. Whose people passing at night on the empty walks sound like rain.” \tThese are some of his best stories, told with imagination and his deft, descriptive virtuoso use of the language. His is a poetic prose, matched well with the theme of October. M. Night Shyamalan must have been influenced by Bradbury’s “Jack in the Box”, and his influence on modern fiction can be seen throughout the pages. From the odd “The Dwarf” to the creepy “The Jar” to the psychologically unsettling “The Cistern” Bradbury has woven a spider’s web of fiction made for cool days under a cloudy sky, with the autumn smells of campfires and frost. Brew a witch’s mug of warm drink, breathe in the leafy chill, wrap up in an old woolen scarf and enjoy."}, {"userName": "Shawn", "userReviewDate": "Oct 05, 2009", "userURL": "http://www.goodreads.com/user/show/1697111-shawn", "userReview": "One of the first books I ever read, and one of the reasons I still read. I found some of the other reviews dismaying (poor dialogue? silly concepts? antique writing style? - has the world and the people in it really changed that much? Have people lost their hearts? Perhaps, they've just never read \"The Smile\" by Bradbury, not included in this collection).Granted, Bradbury's style does take some getting used to - the man is emotionally honest and as people everywhere become more emotionally guarded, such honesty appears to be naivete. It isn't, but that's an argument for another day. And Bradbury occasionally enjoys being poetic or lyrical, so people marking time until they can rush through volume #17 of \"Lilith McHotpants, Ace Ghoul Slayer\"; \"Part the Twelveteenth of the Saga of Kaaarfgaaasr\", and \"P is for Perfunctory\" or whatever they spend the majority of their time \"reading\" may find such a style annoying. Because, you know, it's about evoking feelings and such - not pushing buttons.But for those with the eye for a well-told tale, and senses neither dulled by crap or so highly attuned by High Lit that they can't enjoy solid pulp, this should go down a treat.\"The Dwarf\" - still as sad and dark and painful as I remember it. You have to love the breezy way Bradbury can just roll a story along with a deft turn of phrase or description (\"the sea was a burning sheet of tinsel and glass\"). So sad but honest that the cruel person doesn't even see what's wrong, and suffers nothing, while the girl's attempt to be human and humane puts the chain of events into motion. And Mr. Bigelow wrote detective stories! Heh! I like the fact that there's no overt supernatural elements in this collection at first, the initial stories all turn on human psyches and neurosis until \"The Skeleton\".\"The Next In Line\" - notorious to me because it was so long I never finished it as a kid. Here, again, no overt supernatural elements, just a woman suddenly overwhelmed by the inescapable awareness of her own mortality, exacerbated by the horrors of unburied mummies of Mexican peasants (they can't afford the rent to remain buried anymore, in the most ultimate capitalist scam ever - something to keep in mind for our futures), the strangeness of culture shock and the unloving husband to whom she's already dead. This might be a tad overwrought/overwritten but the feverish pitch of her nervous breakdown really does drag you along and the scenes in the catacombs (counting to avoid the screaming dead - but you can't avoid them because here they are, and here, and here...and HERE!), the descriptions of the little Mexican town at night (the streetlight blowing in the wind), the desperate race to escape the town (but you can't escape death), the little details (\"whirled and cavorted before the coffin-shaped mirror\") and omens (a sugar skull with your name on it), are all aces! I especially liked the bit where she seeks escape and safety in reading writing from \"her world\" - news + pop magazines - but even those are consumed far too quickly. Also appreciated seeing the gestation for the idea of \"Skeleton\" in her comments on why skeletons do not bother her. Just great, solid writing.\"The Watchful Poker Chip of H. Matisse\" - Nice for a number of reasons, foremost in that it's a horror story but funny at the same time, the horror arising, again, from the psyche and how it responds to the attentions of groups (inspiration for \"The Crowd\" possibly?) and popular culture. Couldn't help thinking of that old George Carlin \"Book Club\" book title - \"Self Mutilation As An Attention-Getter\" as the story wrapped up, and that aspect is really where the dry, bitter horror lies (and why the story is oddly relevant today as well). Loved seeing VIC & SADE get a name-check (the best OTR comedy show EVER!) but I guess that also makes me a hipster doofus like the rest of the Cellar Septet (great band name waiting to be snagged!). I know Bradbury's tone towards the avant gardeians, like the tone of most people towards the artistic fringe, is disdainful but personally I love characters like this, ironic posing or no. So Garvey's eventual transformation into a surrealist object is both sad and cool for me (the Surrealists knew that desire and death were intricately linked).\"Skeleton\" - this rocked my world as a little kid and only impresses me more as an adult. The concept is just wonderfully simple (man at war with his skeleton), then toss in the resonant symbolism (the organic, painful messiness of life - his outsides - pitted against the clean, orderly, solid, reliable support structure of his insides, which symbolize death. \"Only the dead are eternally cool\" - as Hakim Bey said), the little details (he's great at ceramics!), and even some unexpected argument from the other side (the heavy man's fat as a buffer against the battering of life, and a way to trap the skeleton in organic tar), topped off with a bizarre character that makes it a bone fide \"weird tale\" (*salty breadsticks*) and a memorable last line- you've got yourself a killer story.\"The Jar\" has been adapted a few times (I seem to remember a version on The New Alfred Hitchcock Presents TV show from the 80s in which the country bumpkin setting is switched with a modern art one) and it's a pretty solid, creepy story, although Bradbury's tendency to overwrite becomes a bit cartoonish when (at least, I feel) he's writing characters of a \"type\" that he's not directly familiar with. Still, the inchoate mass in the jar is strangely evocative (a blank screen onto which everyone projects their ideas) and it's a nice reversal of \"The Watchful Poker Chip\", in that one man desires to make himself the center of attention from people who don't really care about him.\"The Lake\" is very touching. I have a reading of this by Bradbury himself and it really is an effective, emotional piece about lost childhood love and the uncaring blankness of death.\"The Emissary\" still gives me chills. This was a favorite of mine as a child, and reading it as an adult, I wondered if perhaps it might have just seemed darker or more threatening to me back then, but no - the ending is ominously \"not good\". Bradbury really stretches his evocative language shtick here, conjuring autumn in a million ways while bolting the whole thing to a life-lived memory of being an invalid, and then wrapping it in a strange variation of \"The Monkey's Paw\"...except this time...the door gets to open....\"Touched With Fire\" was also adapted on Alfred Hitchcock Presents (albeit the original b&w version). It is very well done and I like the fact that the terrible events partially arise from the main characters' desire to help people (as in \"The Dwarf\" and, inverted strangely, the presumption of \"The Crowd\" - which is proven wrong). The writing makes the harridan woman a bit cartoonish, but that's part of the point, to draw you into feeling what Foxe (or the other one, I forget) feels and this building of tone and mood (hot, irritable, loud, abrasive) is well-conjured. Cute.\"The Small Assassin\" is a genuine classic, postpartum depression twisted into a horror tale before there was even a term for it. The last line is a killer and the modern resonances it brings, of abortion and sociopatholgy, are especially powerful. What a great story!\"The Crowd\" is another one of those unabashed classics - a simple idea marvelously realized. It's amazing how effective it is. I don't even know if there's much more to say - I love the idea that the people encompass all character types and are immortal. I also love that there's never a specific explanation or explication from \"the Crowd\", so while the ending confirms the narrator's theory, we only ever really have his suppositions to go on. I wish more modern horror writers wrote stories this sharp.\"Jack-In-The Box\" is...okay. It almost seems like an idea more pregnant with possibilities than can reasonably be addressed in the short story form, although I do like idea that the kid thinks he's dead at the end, and that this year's special room was an elevator. For some reason, this story strikes me as a partial riff on Lovecraft's \"The Outsider\".\"The Scythe\" is another great one - solid, well-told, well-imagined, painful. Another great idea that doesn't need world-building or explication - just accept it - because Bradbury is such a good storyteller why would your ruin the story with more questions? It's like reading a young, creative person's first realization that death isn't fair and logical.\"Uncle Einar\" is, of course, not really a horror story, more of a weird tale in that fine old tradition. It's also one of his stories about \"The Family\" that eventually influenced Charles Addams. It's probably the slightest of those Family stories (Cecy's story, \"The Traveler\" is really dark!) and I've never read Bradbury's late-in-life reworking of this material into a novel-form, because I feel so close to \"Homecoming\" and The Family, et. al (having discovered them at exactly the right moment of my childhood). But this one is a wonderful bit of dark fantasy, touching and sweet.\"The Wind\" - a simple idea simply told, as long as it needs to be and no longer. I love how it locates the main narrative away from the important action, and then comments upon that very thing (\"as we sit here, people are dying\"), using the set-up for an effective punchline. Nice.\"The Man Upstairs\" really made an impact on me as a kid. With the imaginings of multicolored worlds seen through glass, the focus on innards of all types, the reinvention of the \"vampire\", and the implied gruesome ending dissection, this is a great creepy horror story. Again, even better for the lack of explanation.\"There Was An Old Woman\" is another charming weird tale, with an unexpected ending (usually, stories like this would be about acceptance of the inevitable). The cantankerous old biddy is strongly sketched and the humor is well-delivered.\"The Cistern\", slight but poetic, is more about evoking Ophelia-like images of drowned bodies and flowers deep underground than telling a full story.\"The Wonderful Death of Dudley Stone\" is also, I fear, a bit slight for my tastes. It's a cute idea and, as expected, well-told, but the central idea - eh, too romantic an envisioning of a \"writer as character\" for my tastes.I left \"Homecoming\" for last because its one of my favorite Bradbury stories ever, ur-text for Charles Addams's famous Family, The Munsters, etc. and thus a component of the whole 1950's \"Monster Kid\" culture. It also still brings tears to my eyes. I hope he continued to walk the fine line the originals tread so assuredly (the \"monsters\" ARE monsters, as Cecy's interaction with the old woman and the mud-pits illustrates) in his later re-use of this material. I wonder if all the Tim Burton fans even know a story like this exists?Great stories from a great writer. What more could you want?"}, {"userName": "Char", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "Finally! Finally, I've read this classic collection of short stories by Ray Bradbury. I'm so glad that I did. What can I say about this that hasn't already been said? It's beautifully written. Some of the stories were so haunting, I know that they will stick with me for the rest of my life: Ones like \"The Scythe\" and \"The Dwarf\", \"Jack in the Box\" and \"Homecoming.\" Bradbury's style is sparse; he packs a lot of meaning into very few words. His prose is so beautiful that, at times, the reader has to pause for a moment and savor it. Seriously, it's amazing.I highly recommend this collection of short stories written by one of the masters of the form!"}, {"userName": "Apatt", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "I am quite useless at reviewing an anthologies so please bear with me. How do you go about reviewing these things any way? Story by story? Sounds like a chore. I'll just muddle through as usual then!The October Country is a collection of Ray Bradbury's macabre stories, I hesitate to label them as \"horror stories\" because they are not particularly horrifying, but they are mostly odd and unsettling, almost \"new weird\" but disqualified on the \"new\" part! The iIllustrations by Joe Mugnaini (a few are shown below) add a surreal atmosphere to the stories. I will just run through them quickly:\"Dwarf\" - A little strange, ends before it should for me, no clear denouement, but a good little morality tale.\"The Next in Line\" - I like the gradation of depths for burial based on the wealth of the family. There is a very creepy, psychologically unsettling scene in the catacombs. I find the story goes on too long yet the ending is a little too abrupt (too \"WTF\" if you will). I do love the lyricism and poetic rhythm of his writing though.\"The Watchful Poker Chip of H. Matisse\" - A humorous observation about the pretentious avant garde. Nice one!\"Skeleton\" - That is gross man! LOL! A darkly humorous story. OK, this one is a bit horrifying. I love it!\"The Jar\" - I like how the entire story revolves around the mysterious content of the jar, the twist at the end is cool.\"The Lake\" - The first overtly supernatural tale in this book, a sentimental and sad little ghost story.\"The Emissary\" - Unexpected twist in this one, to say any more would spoil it. Great story!\"Touched With Fire\" - The story of a couple of retired insurance salesmen and a perpetually angry woman who is a sort of Angry Bird in human form.\"The Small Assassin\" - My favorite story in this book, give me the collywobbles! I'm not saying anything about the plot!\"The Crowd\" - The crowd that materialize in accident scenes are indeed reprehensible. Good story.\"Jack-in-the-Box\" - A weird scifi-ish story. Have you seen M. Night Shyamalan 2004 movie The Village? This story is a bit like that (well, no, that movie is a bit like this, which predates it).\"The Scythe\" - Don't fear the Reaper, or don't fear the reaping. This story left a singularly eerie image in my mind after reading.\"Uncle Einar\" - A pleasant, lighthearted story. Not creepy at all.\"The Wind\" - Supernatural, creepy and sad.\"The Man Upstairs\" - an excellent vampire tale with triangles, chains, and pyramids - genius!\"There Was an Old Woman\" - Annoying bloody woman, good for a giggle.\"The Cistern\" - A weird watery tale which is almost a ghost story.\"Homecoming\" - \"They're creepy and they're kooky, Mysterious and spooky\" - actually may be more like \"The Munster\".\"The Wonderful Death of Dudley Stone\" - Strange mainstream-ish story. It is actually quite wonderful, a great way to end the book.TL;DR: My favorite stories are \"Skeleton\", \"The Small Assassin\" and \"The Wonderful Death of Dudley Stone\".Probably not Bradbury's best collection but Bradbury is always well worth reading. The best Ray Bradbury anthology is - IMO - The Illustrated Man, The Martian Chronicles is great but it is more of a fix-up novel.As I write it is almost Halloween, the best time to read this collection!"}, {"userName": "Ginger", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/14097149-ginger", "userReview": "This was a great collection of short stories by Ray Bradbury! I’m so glad I read this book in October with the leaves coming down, the air was crisp and Halloween was around the corner. It really added to the overall atmosphere for the book.Favorite short stories:“The Next in Line”, “Skeleton”, “The Emissary”, “The Small Assassin” and “The Scythe”!Bradbury’s writing is so beautiful, flawless and fantastical. I definitely recommend this collection to Bradbury fans and anyone that enjoys horror and fantasy genres!"}, {"userName": "Maciek", "userReviewDate": "Mar 18, 2013", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "October Country...that country where it is always turning late in the year. That country where the hills are fog and the rivers are mist; where noons go quickly, dusks and twilights linger, and midnights stay. That country composed in the main of cellars, sub-cellars, coal bins, closets, attics, and pantries faced away from the sun. That country whose people are autumn people, thinking only autumn thoughts. Whose people passing at night on the empty walks sound like rain...\nFall is probably my favorite of all seasons, and every year I walk on the streets, through avenues and parks. There is a smell of burning leaves hanging around lazily, and the skies are still bright, sharp and clear, but the sun is less warm. You can feel the wind getting colder and taste the air, now sharper and fresher. Nights are chilling, with big yellow moons. Leaves change their colors and are now a mixture of yellow, green, red and orange. They start dropping from the trees one by one at first, but steadily gusts of wind grasp them by the handfuls and leave bare branches behind. Although the process is inherently sad in nature as it forecasts the upcoming winter, with its ice and snow, there is an element of beauty in fall leaves on the ground, especially in the afternoon sunlight. It casts a special shine which is not there in other seasons, and yellowing leaves make the streets look as if they were paved with gold.My copy of The October Country has a new introduction by Ray Bradbury, written in 1999, where he claims to remembering being born and the development of his passion for stories and storytelling. He wrote his first story in the seventh grade, and since the age of twelve knew that was the way to ensure proper immortality - being remembered after our limited time on earth runs out. Bradbury saw the process of writing as a match between life and death, each completed story a victory. Days when he didn't write were threatening him extinction, and this is why he wrote every day since he turned twelve, evading death. He died last year, at the age of 91, having published his last novel - Farewell Summer - six years before, along with hundreds of short stories. Death has finally caught with Ray, but not before he had his say - he went out on his own terms, and achieved the exact type of immortality that he hoped for.The October Country contains nineteen very different stories, most of which were previously published in Bradbury's debut colection, Dark Carnival. These are some of Bradbury's earliest stories, published before The Martian Chronicles and Fahrenheit 451. There is a special pleasure in reading these stories - allowing Ray Bradbury's gentle storytelling lull us in and expose us to his imagination. I can see young Kings and Mathesons of this world reading his fiction deep into the night, possibly even with a flashlight under the bedcovers, amazed that a grownup could think such things onto paper. Bradbury was a man who could both turn a phrase and had a great, big heart - his warmth emanates from his writing, which is far removed from the vulgarity of contemporary world. Bradbury was often accused of being too sentimental and too emotional, but I don't think this is completely correct - while it's true that his stories offer a bucolic vision of the American heartland and the nostalgia of small-town life, but didn't shy away from showing the nastiness running behind the curtain of these idealistic visions.This is perhaps best illustrated in the opening story, The Dwarf, which is an achingly sad story of loneliness and cruelty. What makes it sad is that not only the cruelty is pointless - as it always is - but that it's inflicted on someone who is in no capability to defend himself, and by someone who makes an extra effort to make sure that it hits where it hurts the most. There's no need for supernatural elements here - ordinary life is enough, as events like these happen every day, everywhere. The Lake is another touching and sad story, but in another way - it's about a man who revisits his childhood home and is flooded with memories of a lost friend. It's almost a ghost story, but not quite - the ghosts are the memories which flood the main character to the point where he almost re-enters the past, and feels disconnected from - and disappointed with - the present reality.There are great stories with a touch of horror here, too. The Skeleton and The Small Assassin both have great, imaginative premises and work very well. The first one features a man convinced that his skeleton is out to kill him - and tries to fight it; it concludes with a great, memorable last line, true to style of classic short fiction. The Small Assassin is Bradbury's experiment with psychological horror - a woman becomes convinced that her newborn baby is conspiring to kill her. While this might seem to be just an example of postnatal stress and depression, the arguments she uses sound at least a bit true: is there anything in the world more selfish than a baby, with its unending demand for constant care and attention? Do some mothers (and fathers) do not have the feeling that sometimes their baby is acting the way it does just to spite and annoy them? This is a great horror story without vampires or boogeymen, but with cribs, nappies and milk bottles. The last line, again, is a killer - literally!There are more horrific stories here: The Next in Line features a couple exploring a cemetery in a small Mexican town which holds a truly capitalistic policy towards the buried and their families; The Crowd is another great story which truly emphasizes Bradbury's great strength: exploring simple ideas and writing classic tales based on them. Its narrator finds it odd that crowds of spectators always gather around the scene of an accident, and finds people who would stare at someone's tragedy reprehensible: the truth is stranger than any of us could suspect. Same goes for The wind, where a man is obsessed with wind - he's an adventurer who thinks that wind has always been out there to get him, and even though he always managed to escape he's convinced that this time his luck has finally ran out. There was an Old Woman is different, in the way that it takes a scary situation and makes it amusing: it's concerned with an old, cantankerous woman who just refuses to die. It's good and full of fun humor.There's a great mixture of Bradbury's recollection of his youth mixed with his interest in weirdness in Uncle Einar and Homecoming, both of which share characters. Uncle Einar was inspired by Bradbury's favorite uncle, and you can see his love in this weird tale of a man with wings who longs to return to the skies but has to live among people who don't have them. The resolution is heartwarming and memorable. Homecoming is the exact reverse of Uncle Einar - Timothy, its young narrator, is a mortal child living among supernatural beings. Left on their doorstep as an infant, he longs to be like them but at the same time understands that this will never be possible. Unlike Uncle Einar, Homecoming is a sad story of a boy who wishes to belong but will always be an outsider, even with the complete support of his adoptive family.My favorite story from the entire collection is probably The Scythe, which is a great, imaginative story, in the nature of the folk tales that I read as a young boy. Set in what looks like the Depression, a poor family notices an empty house at the end of a road, and upon entering discovers the body of a previous inhabitant and his will - bequeathing both the house and farm behind it to the person reading it. The family is overjoyed at first, and after a few days of rest the father cannot sit still anymore and goes to cut wheat in the field - only to discover strange things about it, and the way it grows. It's a great story in the classic tradition of moral tales - that there will always be a price to pay for what seems to be too good to be true, and that we should be wary of things which seem to be just incredible luck.The Wonderful Death of Dudley Stone is a great coda - Dudley Stone is an extraordinarily successful writer who has quit the profession at the age of 30, without explanation, leaving people without any certainty if he was even alive or dead. 25 years later a group of his most devoted fans cannot bear not knowing, and one of them decides to go to Stone's hometown and find information about him. It's a great story to end the collection, a meditation on the choices we make in life and the things we set as priorities, with a beautiful last line.I could very well discuss all the stories, but I believe that the reader deserves the pleasure to discover the October Country on their own, especially with illustrations by Joe Mugnaini. So come along and open the book to visit that country, the country dusks and twilights linger, and midnights stay, whose people are autumn people thinking autumn thoughts, and who on the empty walks at night sound like rain..."}, {"userName": "Algernon", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "... that country were it is always turning late in the year. That country where the hills are fog and the rivers are mist; where noons go quickly, dusks and twilight linger, and midnights stay. The country composed in the main of cellars, sub-cellars, coal-bins, closets, attics, and pantries faced away from the sun. That country whose people are autumn people, thinking only autumn thoughts. Whose people passing at night on the empty walks sound like rain ... The introduction suggests this one's a good choice for a Halloween read, and indeed the stories selected for the present collection may not all happen in October, but they do share a melancholic mood that often morphs into full blown fright. I am thinking of adding as a subtitle  High Anxiety  for the whole set and then play a game of 'Name That Fear' for each episode: The Dwarf  is a great opening gambit, probably one of the earliest shorts written by the author, illustrating his fascination with carnivals and with the grotesque. A short man visits every night the hall of mirrors in the amusement park, always heading straight for the one distorting silverbacked glass that makes him appear as tall as regular people. The ticket vendor makes fun of him with the callous indifference of bullies everywhere. The anxiety here would be the loneliness of the person rejected from society for being different in appearance. I liked how the dwarf is presented as a succesful pulp writer, how inside his head he's just as good, if not better, than his tormentors: This little guy's got a soul as big as all outdoors; he's got everything in his head!  The Next In Line  highlights the fear of the cemeteries, of the dark, damp and smelly place undergound where the dead are buried. A young couple on a tourist visit to Mexcio comes across a town where the air is so dry that bodies do not rot in the ground and are instead mummified. Because a lot of the local people are too poor to pay for the burial place, these mummies are exhumated and stored in a long underground chamber and then shown to the tourists for a small fee. I have saved a quote from this story, where the young man chides his wife for being superstitious, but I have a hunch that the author sides with her on the issue, as sometimes the fear is too strong for the rational brain: The minute you get a religion you stop thinking. Believe in one thing too much and you have no room for new ideas.  The Watchful Poker Chip of H. Matisse  doesn't seem too scary at first glance - it is the story of a man so dull and uninteresting that he becomes an attraction for a crowd of fashionable artists. Enjoying their attention, the man now tries to remain in the spotlight by artificial means, like wearing an unusual eye-piece painted by the famous French Impressionist. My vote would be again for fear of loneliness, of rejection by social conformists. Skeleton  is fear of illness, of your own body. It is the tale of a hypochondriac who goes to a dubious doctor and becomes aware that he has been walking around all his life carrying a skeleton inside him. Delightfully macabre. The Jar  is a second story that starts with a carnival and its gallery of freaks. It is a variant of the fear of the unknown, and a story about the way our imagination can create monsters out of unexplained physical or biological objects. Here, a farmer becomes fascinated with one of those pale and wobbly things floating in chloroform in big transparent bottles. Ignorance and superstition also play a role, as the man's neighbors from a poor swamp village gather around the jar to speculate on the thing's origins. The Lake  is about fear of death by drowning, but more than this it is about the passing of childhood, about lost friends and the power of love to keep the memories alive. One of the most lyrical and sad shorts in the whole collection. The Emissary  is another variant of the fear of death. In this short story, a boy is immobilized in bed by illness, and his trusty dog is his only contact with the outside world, by bringing in the twigs and burrs and the smells of the places it visits. But what happens when this dog starts visiting a cemetery too often? Touched With Fire  is more difficult to pin down. Two mysterious strangers try to prevent a woman from getting murdered. Are they prescient or simply better observers of human nature than usual? I would class the story as fear of predestination, of the loss of free will, but a more accurate message may be that we cannot force people to act against their nature. The Small Assassin  is a creepy example of a woman with post-natal depression, who believes her child tried to kill her during a difficult birth, and is continuing to attack her after they return home from hospital. It's a clever piece, but not one of my favorites: it fels contrived, even if I accept the supernatural elements. The Crowd  is an illustration of a fear I was spared from until recently. I got my driver's license only a couple of years ago, and my first car only months ago. Since then, I have started to consider more seriously what would happen if I got into a road accident. Bradbury doesn't help me much as he tries to prove that there is a reason you always see a crowd of thrill seekers around the sites of such crashes, and that these people are not there to help you.  Jack-In-The-Box  is about a boy who is afraid the whole world outside his house is gone. He is locked in with his mother and a mysterious teacher inside a huge house with many locked doors and secret passages. He would like to escape, yet is afraid of what would happen if he breaks out of his safe daily routine.  The Scythe  is a good candidate for a 'Best of ...' anthology of Bradbury short stories. It's major anxiety is the fear of a father that he cannot provide sustenance and safety for his family during the Great Depression, most of all that he cannot protect them from the death that must come to us all, sooner or later. Great writing! Uncle Einar  is one of the few happy interludes in an otherwise sad and scary collection. It is a sketch from a bigger story the author was developing about a family of monsters ( The Elliots are similar in many aspects to the more famous Adams Family). Einar is a sort of human bat, six feet tall with big leathery green wings. He flies mostly at night to avoid being spotted by regular people, but after a drunken party, he crashes into a power line and loses his sonar-like abilities. But, like somebody sung about in the Alps, whenever a door closes, a window opens, and by losing his fly-in-the-dark talents, Einar gains the love of a woman and settles down for married life and for playing with his children. My favorite quote here is about how we may be homely in our outside appearance, but there is a world of wonder and imagination inside each of us: We're in our cocoons, all of us. See how ugly I am? But one day I'll break out, spread wings as fine and handsome as you.  The Wind  is another candidate for 'best of' anthologies, very short but also very effective in the idea that destructive winds somehow achieve intelligence by absorbing the minds of their victims. The fear category in my game could be the anxiety over the unleashed forces of nature. The Man Upstairs  is a variant of the fear of the stranger, about supernatural predators living amonst us, disguised as ordinary people. What makes the story special is the young age of the narrator, a young boy whose curiosity and inventivity solves the mystery. Word of the day from his grandfather: Fear nothing, ever in your life.  There Was an Old Woman  is another of the rare stories with a touch of humour, with a colourful elderly lady as a heroine who refuses to accept the inevitability of Death, and is ready to fight to the last breath and beyond for the right to stay in this world as much as it pleases her. The Cistern  is a sort of twisted romance spiced by the fear of drowning. A woman gazes out a window at a rainy city landscape and imagines the water draining into subterranean tunnels, filing them up a carrying along the bodies of strangers. Homecoming  is almost worth the price of admission all on its own. It marks a return to the follies of the Elliott family, as they gather from all over the world to celebrate Halloween together. Uncle Einar also returns to lift up the spirits of a boy without supernatural talents, adopted into the family and slightly envious of his 'monster' relatives. The story has a lot of potential, and I understand Bradbury added more material until it became a novel. Anxiety in this case is the result of feeling estranged from your peers. The Wonderful Death of Dudley Stone  ends the book not with another scare but with an affirmation of life, an invitation to get our noses out of books and run around in the sun. Dudley Moore was a very promising young writer who decided decades ago to renounce his literary career and fade into oblivion. In the present time, he invites a reporter to tell him all about that past decision and the reason for his seclusion: I had been writing about living. Now I wanted to live. Do things instead of tell about things. [...] We've lived every way there is to live, with our eyes and noses and mouths, with our ears and hands. Taken as a whole I found the collection uneven in quality. Some stories feel unpolished, some just simple sketches, but then quite a few are truly memorable, and even the lesser ones display the magical way Bradbury has of creating a mood, an emotion, an intriguing new way to look at the ordinary things around us and see either their beauty or their mystery. Beside the theme of autumn and anxiety, the stories collected here share an interest in childhood, in the ties of family and in the need for friendship and sharing. I am glad I still have so many of his stories and novels still to read. I am sure they will be as enjoyable and well written as this one."}, {"userName": "Gary", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/37678060-gary", "userReview": "Ray Bradbury. He captured in words the longings that always young hearts feel. A stylist, he produced a language that, once learned, is never forgotten and always recognized. In this collection of a few of his short stories, some are Literature, and his genius is only unrecognized beyond our small corner of science fiction and fantasy because the outside world hasn't met him yet. His magic, when they finally do meet him, will open their minds and hearts to his true magnificent talents. Some of these stories are folktales and fairy tales, too. Some are Magic Realism. Some have no touch of science fiction or fantasy and are simply great short stories. Bradbury needs to be read by some scholar and re-evaluated. I have every confidence Bradbury's true place in literature would be secured."}, {"userName": "Kimberly", "userReviewDate": "Oct 10, 2015", "userURL": "http://www.goodreads.com/user/show/17371689-kimberly", "userReview": "Solid writing with some great atmospheric tension! As always in collections, some stories stand out for me more than others. I doubt that I will forget the lingering, oppressive feelings of \"Jack-in-the-Box\" anytime soon. Another that keeps coming to mind was The Dwarf. I can say that there are some stories that will \"click\" with almost everyone out there--something to suit everyone's tastes.Highly recommended!"}, {"userName": "Terry", "userReviewDate": "Oct 28, 2017", "userURL": "http://www.goodreads.com/user/show/22765690-terry", "userReview": "This is a great collection of classic short horror stories by Ray Bradbury. There is no shock and awe here, like you might find from more modern horror writers. Rather, there are well-crafted and well-written tales of suspense, horror and atmosphere. It is an excellent read for the Halloween season."}, {"userName": "Paul Bryant", "userReviewDate": "Sep 25, 2007", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Anyone reading my review of Something Wicked this way Comes might possibly get the idea that I don't think Ray Bradbury is the godlike genius I used to think he was. Well, I don't. But I was like this stupid kid, I hadn't read anything, and stumbling into RB's world was my 13 year old version of Alice falling down the rabbit hole. Suddenly - Light! Colour! Weirdness! Mars!  He did sentimentality - everyone knows that, buckets of the stuff - but he also did gruesome and freaky. The October Country was the gruesome stuff. Such great stories as (this is a sprinkling entirely from memory)- The Dwarf - in which the owner of a Hall of Mirrors and a young carnival-goer observe a dwarf who uses the mirrors to make himself seem taller. That's so creepy. It is though, isn't it! Also, not especially PC. - The Watchful Poker Chip of H. Matisse - Oh my giddy aunt - in which a totally boring guy becomes a mascot for a bunch of avant garde bohemians precisely because he is boring but then he osmoses into a fantastical creature much stranger than any of them, with a false leg with a birdcage set into it, and a monocle made out of a poker chip on which Matisse had painted an eye – this is from memory so don’t sue me – but when I read it I had no idea who matisse was – story blew my head off.- Skeleton - oh my ears and whiskers – this story was totally vomit inducing and also blew my head off, all about a guy who becomes convinced his skeleton is out to get him – great- The Emissary – wow what a shocker, boy is laid up in bed, only companion his jolly dog – dog feels sorry for him, goes and gets him a friend to visit – some neighbourhood woman – anyway, she dies, boo hoo – undaunted, dog goes off and fetches her back…from the cemetery – this story has been ripped off more times than I’ve had hot dinners, and that, my friends, is a lot of times- The Small Assassin - a woman becomes convinced her newborn baby is out to kill her ! Wild!- The Crowd - A man discovers something odd about the crowds which form around accidents. They’re always the same people! – reminds me of a great song by Magazine called Shot By Both Sides (I wormed my way to the heart of the crowd/I was shocked to see what was allowed)So, Bradbury - I salute your gorgeous prose poetry infused horror and your frankly bizarre ideas and your acknowledgement of the terrors suffered by children, no, not just the ones being badly treated, all children, these are the terrors which live in your little head when you're a kid, Bradbury knew it all and he didn't forget it. You made me sorry I didn't live in Green Town Illinois and you made me even sorrier that i finally, with much protesting and complaining, grew up."}, {"userName": "Mohammed", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/6823144-mohammed", "userReview": "ستتوقع الكثير عندما تقرأ مجموعة قصصية لصاحب الخالدة 451 فاهرنهايت، لن تخذلك الأفكارولن يحبطك الأسلوب، ولكن قد تطمح لأكثر من ذلك قليلاً.تُعرف هذه المجموعة على أنها تنتنمي إلى صنف الرعب والغموض، وهي حقاً ترسم على مخاوف الإنسان وكل ماقد يسبب له القشعريرة. لكن الخوف الذي يركز عليه الكاتب هو ذلك الخوف النفسي الخفي الذي يواتي البعض دون الآخر، كلٌ حسب خبراته وصدماته، فلكل منا تلك الغرفة المعتمة الموصدة في زاوية رثة من ذلك الفؤاد الخفاق. تتنوع القصص تنوعاً جيداً وتتنقل في المشاهد والشخصيات والثيمات. هناك الموظف الذي يكتشف فجأة أنه يخشى هيكله العظمي، بل ويمضي به الأمر إلى أن يحاربه ويتحداه. هناك الرحالة الذي يتكشف سراً يتعلق بالرياح فتتعقبه وتقسم على الانتقام منه. معهم أيضاً قصة الصبي الذي رُوع بغرق صديقته ولم ينسها حتى بعد أن شب عن الطوق. القصة التي أعجبتني بشكل خاص كانت قصة المرطبان (أو البرطمان)، التي تتحدث عن مزارع خامل الذكر تقع يديه على برطمان به كائن عجيب في سائل حافظ. يقلب ذلك المرطبان حياته فيجعله حديث المدينة ويحث أهلها على التأمل والتفكر، ماعدا زوجته الغيورة التي ترى أن المرطبان سحب كل السلطات من بين يديها. كما ترون، فالحكايات في الكتاب تتعمق في شخصيات البشر وستجدون أيضاً أنها تزخر بحوارات عميقة ومواقف مؤثرة.المجموعة جميلة ولكن لإخلاء المسؤولية، أحب أن أنوه بأنها لا تنتمي إلى صنف الرعب الخام الذي يجعل نوم يجافي جفنيك، إنما هي من ذلك النوع الذي يجعلك تفكر وتتعجب."}, {"userName": "Quentin Wallace", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/33274222-quentin-wallace", "userReview": "[ It deals with a killer baby, and even more surprisingly, ends with the implied murder of the killer infant with a scalpel. Even today this one would be controversial but for back then? Had to be edgy!  (hide spoiler)]"}, {"userName": "Adam Light", "userReviewDate": "Feb 08, 2013", "userURL": "http://www.goodreads.com/user/show/7004622-adam-light", "userReview": "I've been dipping into this exquisite short story collection for quite some time now, and it is with great ambivalence that I have, at long last, finished reading it. I have paced myself, savored each story, chewing thoroughly every delectable word, sentence, and paragraph. I have supped well and gained much nourishment from Mr. Bradbury's inimitable prose. Though I am happy that I have finally read all of the stories in The October Country, I only wish there were but one more left to consume. But alas, the final page has come, and I must now return this book to its rightful place on the shelf with its brothers and sisters, knowing I will undoubtedly retrieve it for a reread many times in the years to come. I give this collection the highest rating possible, and recommend it emphatically. Truly a sublime combination of stories from a true master working at peak performance."}, {"userName": "Obsidian", "userReviewDate": "Sep 04, 2016", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "All in all I enjoyed this collection. Some stories didn't hit the mark with me though. I ended up giving it four stars because the illustrations that are in here pushed the book to a different level.\"The Dwarf\" (3 stars)- I liked it okay, but was actually disappointed in the ending. I thought Bradbury was going one way with the story and it kind of fizzled for me. \"The Next in Line\" (5 stars)- Loved it from beginning to end. This story of a married couple visiting a small town and the terror the wife starts to feel as she realizes how morbid the whole town is was creepy. The ending was messed up too, and I ended up hating he husband. \"The Watchful Poker Chip of H. Matisse\" (1 star). This was weird and not engaging at all. I read it twice and shrugged. It didn't really fit the mood of the rest of the stories. \"Skeleton\" (3.5 stars)- I am still curious about the doctor. I won't say much more because I don't want to spoil other readers. I thought this was OK, but it didn't blow me away as much as \"Next in Line\" and some of the other stories I really enjoyed. \"The Jar\" (3.5 stars)- Good story about the power of imagination as well as past regrets. The ending was a bit gross because I realized what was in the jar. \"The Lake\" (2.5 stars)- I really didn't enjoy this one. I think because I had so many questions about how a body could be found 10 years later in water and be intact at all. \"The Emissary\" (5 stars)- What a sad and lonely story about a boy and his dog. The ending actually gave me shivers. This story takes place on Halloween and also November (autumn) in case anyone is still looking for stories to read for the bingo.\"Touched With Fire\" (2.5 stars)- Eh. Not really into this one at all. There was way too much going on with this story and saying that murder happens at a certain heat could have been done better. \"The Small Assassin\" (5 stars)- This one was so good. I wish it had been longer. The ending was creepy as anything. \"The Crowd\" (2 stars)- Okay but once again I wasn't blown away by it. There always seemed to be a really awesome story and then an okay story in between.\"Jack-in-the-Box\" (4 stars)- What a sad story and the reveal of what was going on really definitely made me think what could have been if Bradbury decided to keep certain people alive. \"The Scythe\" (4 stars)- I loved this one. What a wonderful idea and enjoyable plot and conclusion. Not my favorite, but almost just because I thought the ending left too many questions though. \"Uncle Einar\" (5 stars)- Not horror really, this was actually a very sweet love story I thought. And the ending was happy. I'm still surprised it ended up in this collection.\"The Wind\" (3 stars)- Eh. Okay, not great. There was too much suspension of disbelief for me to get past. I can't imagine wind coming to life to stalk someone.\"The Man Upstairs\" (4 stars)- Creepy. I think I'm going to be scared of small children for a while. \"There Was an Old Woman\" (3 stars)- okay, I just found it borng after a while and rushed read this to get past it.\"The Cistern\" (3 stars)- Yeah I was still bored reading this one too. Not that engaging. \"Homecoming\" (4 stars)-Taking place before, on, and after Halloween you get to see a family preparing for a special reunion.\"The Wonderful Death of Dudley Stone\" (3.5 stars)- I was so confused while reading this and the story was a lot of talking with me wondering what the heck was going on.I read enjoyed the illustrations in this one and included one in my Booklikes post. Too bad I can't upload via Goodreads."}, {"userName": "Mindi", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/6157592-mindi", "userReview": "I need to say two things right from the very beginning: 1) This is only the second book I've read by Bradbury, which is shameful, but I plan on rectifying that, and 2) I think I would have loved this collection even more if I had read it in the fall. At the very beginning of the collection Bradbury writes the following:...that country where it is always turning late in the year. That country where the hills are fog and the rivers are mist; where noons go quickly, dusks and twilights linger, and midnights stay. That country composed in the main of cellars, sub-cellars, coal-bins, closets, attics, and pantries faced from the sun. That country whose people are autumn people, thinking only autumn thoughts. Whose people passing at night on the empty walks sound like rain...Shivers! This paragraph really speaks to me. I love everything about autumn, and I really wish I had waited and read this one in October. But alas, I picked it up in February, and while the \"twilights no longer linger\" and people are no longer \"thinking autumn thoughts\" it's still always autumn in my heart.This is a really unusual and eclectic mix of horror/weird fiction stories. Most of these stories appeared in Weird Tales before Bradbury became better know for his science fiction stories. The edition I read has a Forward by Bradbury that was added to the book in 1996. I love how he talks about his early writing style, and how for a number of these stories he used real life occurrences as inspiration.Some of the standouts for me in this collection are \"The Lake\", and \"The Emissary\". Both stories are melancholy and sinister at the same time, a mix that I always enjoy. \"Next In Line\" is a story that builds the dread slowly at first until you can barely stand it by the end, and \"Skeleton\" causes you to think about your body in ways that never would have occurred to you otherwise. It also has a delightful gross-out of an ending.Some of these stories I liked much more than others, hence the 4 stare rating. None of them are duds, and they are all very well written, (I mean, it's Ray Bradbury), but some of them definitely stuck with me more than others. I recommend reading this book in autumn next to a roaring fire, with the wind whistling around the house, and a hot cup of tea at hand."}, {"userName": "Michelle Morrell", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/127000-michelle-morrell", "userReview": "A collection of short stories set in, on, around or feeling like October. They are quite indiciative of their time, and I enjoyed the peek back to what people in the early part of last century considered shocking or spooky. And while they are not subtle, in the vein of \"the hook was hanging from the car door!\" they did make me ponder how it seems we've become saturated as a whole and need more scares, unrelenting horror, the busting through of our comfort zones to consider something \"scary.\"Towards the end, I realized it was weaving a tapestry of unease, and the atmosphere started to crawl under my skin. Then I thought of living in a world without electricity, without easy access to community on a 24-7 basis, and how these stories would have seemed in the long dark, with just a candle to read by. 24-hour read-a-thon book #5"}, {"userName": "Maxine Marsh", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/4886804-maxine-marsh", "userReview": "Easily a 5* collection. Something for every horror fan: the gritty truth of life and death, the seedy underbelly of a small Mexican town, the wistfulness of the macabre, evil babies, mystery sideshow jars...A light hand in writing and plotting with such creativity that I wondered how Bradbury even came up with this stuff."}, {"userName": "Wayne Barrett", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/21372390-wayne-barrett", "userReview": "3.5A nice collection of short stories to start my favorite time of year."}, {"userName": "Stela", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/2585926-stela", "userReview": "It seems that Ray Bradbury tried his hand with gothic horror only twice: first in 1947, with Dark Carnival, and second, eight years later, with The October Country. After that he declared that he said all he had to say in the field, which is a pity for all the lovers of the genre, because his “saying” was very promising indeed.The October Country is a collection of gothic and fantastic tales that could be regrouped by subject in three categories: physical and psychical flaws (The Dwarf, The Watchful Poker Chip of H. Matisse, Jack-in-the-Box, Skeleton, Touched with Fire, The Jar), aspects of death (The Next in Line, The Scythe, There Was an Old Woman, The Wonderful Death, The Cistern), and supernatural/ mythological beings (The Lake, The Emissary, The Crowd, The Small Assassin, Wind, Uncle Einar, Homecoming, The Man Upstairs). Although the title of the book does not refer to a particular short story, links them all, sending them, together with the reader, in that faraway land where nothing is what it seems to be, that twilight zone briefly described in the motto:“... that country where it is always turning late in the year. That country where the hills are fog and the rivers are mist; where noons go quickly, dusks and twilights linger, and midnights stay. That country composed in the main of cellars, sub-cellars, coalbins, closets, attics, and pantries faced away from the sun. That country whose people are autumn people, thinking only autumn thoughts. Whose people passing at night on the empty walks sound like rain... “In this mysterious country there is no border between natural and supernatural, illusion and reality, even life and death, and human beings in full process of becoming accustomed with death knowingly or unknowingly shoulder other beings that know everything is to be known about it. In this country a living boy is adopted by vampires and considers the differences between him and them a personal flaw, the wind steals human beings imprisoning them in its embrace, winged men with a longing to fly find a way to do it by disguising themselves as the kites of their children, there is something disturbing and dangerous about the crowds that gather after an accident and so on. However it is not this strange world that makes the book interesting (at the end of the day this is the world of every horror book proud of its name), but the quality of the narrative, its chameleonic ability to change the register from tragic to humoristic and or satiric, from realistic to fantastic, from magical to psychological with every story that comes by and sometimes within the same story. The first and the last story, The Dwarf and The Wonderful Death, are beautiful examples of psychological gothic, but also of the author’s high narrative skills, for the contrast between illusion and reality and the common theme of the artist condition in the world give the book a round, symmetrical structure. In both the main character is a writer who made a Mephistophelic bargain: one to enter the fictional world in order to escape a life where because of his handicap he is endlessly humiliated, the other to close the fictional world forever, in order to live a practical, down-to-earth life. It is no wonder that the last image of the book ironically praises the glory of being nobody heading nowhere:“I watched the dead man stomp and leap across the platform, felt the plankings shudder, saw him jump into his Model-T, heard it lurch under his bulk, saw him bang the floor-boards with a big foot, idle the motor, roar it, turn, smile, wave to me, and then roar off and away toward that suddenly brilliant town called Obscurity by a dazzling seashore called The Past.”That even death cannot end social iniquities is revealed in the very dark satire of The Next in Line: a poor village became famous for its mommies, not ancient but new, for hundreds of bodies are tossed in catacombs where the dry quality of the air stops the putrefaction process. The bodies are there because their families were too poor to pay the annual 20 pesos rent required by the cemetery. The visitors learn that money (or lack of it) created new burial rites: the depth the bodies are buried depends on family’s fortune – two, three, four or five feet under, in order to facilitate its digging out when the payments stop: “And, let me tell you, señor, when we bury a man the whole six feet deep we are very certain of his staying. We have never dug up a six-foot-buried one yet, that is the accuracy with which we know the money of the people.”A very different tone, close to elegiac and nostalgic, is used in The Lake and Homecoming, both reversing two well-known tales: of Undine who is here patiently waiting for her love to come and claim her, and of the cruel monster: a living boy desperately wants to find his place in a family of vampires who lovingly takes care of him and whom he loves back with all his heart:“Timothy prayed to the Dark One with a tightened stomach. “Please, please, help me grow up, help me be like my sisters and brothers. Don’t let me be different. If only I could put the hair in the plastic images as Ellen does, or make people fall in love with me as Laura does with people, or read strange books as Sam does, or work in a respected job like Leonard and Bion do. Or even raise a family one day, as mother and father have done....” ”Classic horror, with all the apparatus, can be found in The Small Assassin – the evil baby tale, The Emissary – the zombie awakened on Halloween night and The Jar – the morbid appetence for the grotesque humanity showed from the beginning of time: “It was just one of those things they keep in a jar in the tent of a sideshow on the outskirts of a little, drowsy town. One of those pale things drifting in alcohol plasma, forever dreaming and circling, with its peeled dead eyes staring out at you and never seeing you...”Merciless irony drips from Touched with Fire and Skeleton. The first is about two old men who decided to reform bullies and hysteric beings only to realize they are beyond redemption. The second is a wonderful case of hypochondria taking over and literally suckling the steadfastness of mind and body. A Mr Harris is endlessly complaining about bones pain, but his doctor says the pain is only in his mind. So he goes consulting an obscure bone specialist, Mr Munigant, who makes him aware his body has a skeleton and gradually he becomes convinced his skeleton is his enemy so the bone specialist comes and sucks his skeleton out of him. The dark humour of the end of this short story when his wife comes home and finds him is priceless:“Many times as a little girl Clarisse had run on the beach sands, stepped on a jellyfish and screamed. It was not so bad, finding an intact, gelatin-skinned jellyfish in one’s living room. One could step back from it.It was when the jellyfish called you by name...”Finally, there are two stories that almost leave the October country to enter the land of comedy: one, with a Limerick title, There Was an Old Woman is about an old lady so determined not to die that she manages to stop her own autopsy and return in her body. The other, The Watchful Poker Chip of H. Matisse, is the tale of George Garvey, a man such ordinary that his only talent seems to be “mummifying people instantaneously” with boredom. To escape his “ordinarity”, he begins to mutilate himself, first a finger, then a leg and finally an eye replaced with a “white poker chip monocle, with a blue eye painted on it by Matisse himself” “I’m still a nerve-wracking bore,” he told his wife, “but now they’ll never know what a dreadful ox I am underneath the monocle and the Mandarin’s finger. And if their interest should happen to dwindle again, one can always arrange to lose an arm or leg. No doubt of it. I’ve thrown up a wondrous façade; no one will ever find the ancient boor again.” Overall, whether you are a fan of the horror genre or not, you will not regret this voyage in a country where is forever fall for its fall leaves are full of color."}, {"userName": "Bettie☯", "userReviewDate": "Oct 17, 2012", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "[Bettie's Books (hide spoiler)]"}, {"userName": "Jon Kevin Melhus", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/59991654-jon-kevin-melhus", "userReview": "A master storyteller."}, {"userName": "Cody | codysbookshelf", "userReviewDate": "Aug 24, 2016", "userURL": "http://www.goodreads.com/user/show/56352820-cody-codysbookshelf", "userReview": "I received this book as a Christmas gift from my sister, and I've finally read it! Before now the only Ray Bradbury works I'd read were Fahrenheit 451 (read it in high school — it was assigned reading, and I felt pretty MEH about Bradbury's futuristic tale of censorship and loss of identity) and Something Wicked This Way Comes (another MEH one for me). I'd heard Bradbury's short stories were ace, so I decided to go for the collection that seemed to have the best reviews on Amazon — that collection being, of course, The October Country.I know many of my book-loving friends don't like short fiction — instead, they enjoy immersing themselves in worlds created and developed over the course of 350+ pages. I've heard some say short stories aren't 'fun' to read because you're planted into a world only to be ripped away twenty pages in. That's a valid opinion, I suppose, though I must disagree. I love short stories (if done well), and this book is one of the finest story collections I've ever had the pleasure of reading. Each story manages to pack a punch in short amounts of time (the longest tale here, \"Next In Line,\" is only 31 pages long). Bradbury's prose has a certain style — a certain swagger — that seems to be lacking in contemporary writers of short fiction. These stories are graceful, the prose absolutely astounding. Stories such as \"Jack-In-The-Box,\" (my gosh, I could write an entire blog entry on that story alone!), \"Skeleton,\" \"The Small Assassin,\" and \"The Scythe\" I now number among my very favorites of all-time. Equally sublime and terrifying, almost all of the stories found here are guaranteed to leave a lasting impression on the reader.If you can't tell, I sort of really really really loved this book. I have two more Bradbury collections now coming in the mail, and I eagerly await their arrival. I'll probably pull this book out again come October — it's only fitting. I would recommend this one to fans of The Twilight Zone, Stephen King, and Richard Matheson."}, {"userName": "Kayıp Rıhtım", "userReviewDate": "Feb 27, 2016", "userURL": "http://www.goodreads.com/user/show/52225890-kay-p-r-ht-m", "userReview": "Bradbury, insan unsuru üzerine eğilir; yaşayış biçimi, davranışları ve düşünce sistemi üstünde durur. Amacı bize düşündürmek ve sorgulatmaktır. İnsanı başa koyar; ırkçılığı eleştirir, insanın kendisini eleştirir, sistemi eleştirir, eşitliği ve insan haklarını savunur.Sonbahar Ülkesi’ndeki öykülerde de bu tutumundan vazgeçmiş değil. Bu öykülerdeki farklılık, bizim düşünüş ve yaşayış biçimlerimizden ziyade duygularımıza eğilmiş olması. Bradbury’nin bu öykülerdeki amacı hissettirmek. Öyküleri okurken içiniz ürperecek. Korkacak, tedirgin olacaksınız. Kimi zaman tüyleriniz diken diken olacak kimi zaman ise yalnız başınıza okumaya çekineceksiniz.Kimi öyküde çocukluk aşkını kaybetmiş birini bulacaksınız, kimisinde bebeğinden korkan bir kadın. Bir başkasında kalabalıktaki farklılığı fark edip üstüne giden bir adam. Diğerinde bedenini kaybettiğinin farkına varan bir ruh. Bir diğerinde ise kendini değersiz gören bir çocuk. Bir Einer Amca bulacaksınız, seveceksiniz. Tavuğun içini merak eden bir başka çocuk bulacaksınız. Sevdiğini kaybeden ve onu mazgalların içinde arayan bir Anna bulacaksınız. “Rüzgar” isimli öyküyü okurken belki de bir rüzgar sesi gelecek kulağınıza, kapının altından bir esinti vuracak ayaklarınıza. 34 santigrat derece sıcaklık ile ilgili verilen bilginin doğru olup olmadığını merak edeceksiniz. Öyküleri okurken belki çocukluğunuzdan bir şeyler bulacaksınız. Belki saçma bulduğunuz korkularınızı hatırlayacaksınız. Ne olursa olsun her öyküyü yaşıyormuş gibi hissedeceksiniz.- Canberk İLERİİncelemenin tamamı için: http://www.kayiprihtim.org/portal/inc..."}, {"userName": "Becky", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/6316460-becky", "userReview": "Perhaps it was my fault- I was love-drunk with Something Wicked This Way Comes, and I wanted the same amount of emotional and seasonal precision that I experienced with that book... and I didn't get it. I wanted skittering leaves and brittle pages, I wanted what I was reading to match the feel in the air, I wanted it to be perfectly time in its writing, in my life, in the year, and that is too much to ask from any book. It can only occur by happenstance.The first page description of the October people, though, was so great. It was titillating, and it teased and exaggerated my expectations. It was what I wanted, pages and pages of that.... and instead I found a collection of hit or miss stories that made me feel like I was doing required reading in grade school. Short stories just really aren't my thing, I've enjoyed a few collections, but not many. I like to sink into books, and its hard to sink into anything when its a pond instead of an ocean. Most of the stories felt dated, or like he was trying to hard to get the reader to quest after his short stories' depths. Meh. Still there were a handful of stories that I really liked, \"The Dwarf,\" \"Next in Line,\" \"Homecoming,\" and \"Scythe.\" And there were ones that I really just did not care for like \"Cistern\" and \"Jack in the Box,\" and the others I was completely apathetic about.Alas. 2.5 stars."}, {"userName": "David", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/31101296-david", "userReview": "Many years ago, when my reading tastes were first being formulated, there were two authors that I really connected to: Agatha Christie and Ray Bradbury. These were the first authors I read that felt like \"mine\". I read everything by them I could get my greasy little hands on.Although I loved everything Bradbury wrote, two books stood head and shoulders above the rest: Dandelion Wine (still my all-time favorite) and this collection of short stories, The October Country. I have read it so many times that I've lost count...but not for a long, long time.Reading it again this Halloween season was like welcoming old friends into my home. There were stories here that I had forgotten were stories, stories that have become such a part of my memory that I couldn't remember who told them to me or where I might have heard them.Bradbury had a beautiful way with language, a way of writing that only sounds good in your head. Speak the lines out loud and they sound affected, bizarre. Read off the page they are poetic and ravishing. He will always be one of my go-to writers, never to be supplanted."}, {"userName": "Guillermo Galvan", "userReviewDate": "Dec 03, 2013", "userURL": "http://www.goodreads.com/user/show/12138532-guillermo-galvan", "userReview": "I'm a big Bradbury fan but this collection was a bit of a let down. I even went into this book with high expectations for stories on par with The Illustrated Man. It's not that the stories were bad; the majority of stories were average. They lacked the philosophical impact that Bradbury masters in his later years, and so they built up like a potentially funny joke deflated by a weak punchline.What saved this book for me were a couple of stand out stories that put literary-static electricity on the back of my neck: \"The Crowd\", \"The Scythe\", and \"Cistern.\"Bradbury wrote the bulk of these tales in his twenties so you have to respect the quality of his work at such a young age. I recommend this book to hardcore Bradbury fans and young readers."}, {"userName": "Chloe", "userReviewDate": "Sep 29, 2009", "userURL": "http://www.goodreads.com/user/show/70078-chloe", "userReview": "It is no secret that science fiction tickles my fancy like nothing else. I've penned dozens of reviews by now declaiming the same thing. Yet for all of my heartfelt ardor for the genre as a whole, I have never been a big fan of Golden Age science fiction. By Golden Age I mean those authors writing either before or during the initial space race, authors whose imaginations were set racing by the vision of Sputnik orbiting overhead and whose Eisenhower minds drew long gleaming phallus-looking rockets flown by Aryan supermen set to spread the ethos of Manifest Destiny to the stars. There’s just something too clean about these visions of the future- nothing worn or battered, nothing broken down. It’s all just a little too neat and tidy, as though these futures had swept the problem of civil rights, women’s lib, or upstart youth collectively under the rug and forgotten about them.All of which brings me to Ray Bradbury. While he only rarely set his stories among the stars, Bradbury has always seemed to embody much of what I dislike about scifi of that era. I remember well the torment of forcing myself through the slow tedium of Dandelion Wine as a pre-teen, not to mention the enormous disappointment of The Martian Chronicles (that’s a review for another day). His style has always struck me as just a tad too simplistic, events occur that are far too coincidental, everything gets wrapped up nice and pat. What I’m saying, in my typically convoluted manner, is that I was predisposed to dislike The October Country from the beginning.A compendium of short stories originally published in various trade magazines, The October Country shows Bradbury flexing a little bit of his gothic might with tales both ominous and, occasionally, humorous. There are a lot of sideshows and carnivals, wide-eyed young boys straight from the pages of Boy’s Life investigating mysterious new tenants in cheap boarding houses, buxom wives with nary a thought in their heads, mad shut-ins, and even the stray mummy or two. While some of these tales are enjoyable- \"Playing With Fire,\" \"The Scythe\" and \"The Jar\" are all a lot of fun- for the most part they come off as dated and cliched- never more evident than in \"Next in Line\" or \"Uncle Einar.\" Of course the very reason that they are cliched is because Bradbury's writing formed the background for generations of writers that have come since then. I can't hold it against him for being inspirational, but at the same time it slows my enjoyment of his works when I see where these tropes have evolved since him. One final note on this book- the illustrations really add to the overall ambiance of dread that Bradbury tries to conjure with this collection. The pen and ink drawing of the old Victorian clapboard house that opens \"Playing With Fire\" was especially striking, but I found that any story that began with one of illustrator Joe Mugnaini's drawings was inevitably one that I enjoyed more than the stand-alone stories. Kudos for that, Mr. Mugnaini."}, {"userName": "Tony", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/66855950-tony", "userReview": "Sometimes I forget about Mr Bradbury and when I remember I have to admonish myself for not reading more. Anyone is capable of producing a picture which paints a thousand words, Mr Bradbury is capable of giving birth to words which paint a thousand pictures. That’s some feat! The man is a true master who uses this art to deliver incredible tales which makes you blow your cheeks out, sit back and smile.Except the one in here which must have been written on a bad acid trip.I love the short stories, but also hate 'em. There’s not enough here to get your teeth into at times, but I suppose to leave us wanting more is part of the art.Just sublime…."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Oct 22, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "I read most of these stories years ago. There was a choice to be made here as to the number of stars but I decided that there were more 4 star stories than there were 3 star. Over all I like these.I could go over each of them or some of them, but I won't. I think the story i remembered most and that stood out most for me was The Small Assassin. One of the more thought provoking (for me) was The Crowd. There were some that mostly left me cold, but only a few. The stories in this book run the gamut from the totally \"mundane\" (so far as the paranormal is concerned) to the \"totally\" paranormal or supernatural.Recommended."}], "description": "The October Country is Ray Bradbury's own netherworld of the soul, inhabited by the horrors and demons that lurk within all of us. Renowned for his five-million-copy bestseller, Fahrenheit 451, and hailed by Harper's magazine as \"the finest living writer of fantastic fiction,\" Ray Bradbury shows with each of these nineteen stories his brilliant knack for extracting the chilling essence of a world's insanities, disorders, and hang-ups. Once again he proves himself to be America's master of the short story. This classic collection of stories includes:The Emissary: The faithful dog was the sick boy's only connection with the world outside-- and beyond...The Small Assassin: A fine, healthy baby boy was the new mother's dream come true-- or her worst nightmare...The Scythe: Just when his luck had run out, Drew Erickson inherited a farm-- from a stranger! And with the bequest came deadly responsibilities...The Jar: A chilling story that combines love, death, and a matter of identity in a bottle of fear!The Wonderful Death of Dudley Stone: A most remarkable case of murder-- the deceased was delighted!Plus fourteen more terrifying tales!", "title": "The October Country", "url": "http://www.goodreads.com/book/show/12471381-the-october-country", "average": 4.16, "cover": "https://images.gr-assets.com/books/1491441043l/12471381.jpg", "reviews": 720, "authors": [{"url": "https://www.goodreads.com/author/show/1630.Ray_Bradbury", "name": "Ray Bradbury"}], "type": ["Short Stories", "Fiction", "Horror", "Science Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/12471381-the-october-country", "http://www.goodreads.com/book/show/1091582.The_October_Country", "http://www.goodreads.com/book/show/32716718-the-october-country", "http://www.goodreads.com/book/show/93251.The_October_Country", "http://www.goodreads.com/book/show/18305823-the-october-country", "http://www.goodreads.com/book/show/1930330.The_October_Country", "http://www.goodreads.com/book/show/91884.The_October_Country", "http://www.goodreads.com/book/show/24745411-sonbahar-lkesi", "http://www.goodreads.com/book/show/21346518-the-october-country", "http://www.goodreads.com/book/show/4381.Fahrenheit_451", "http://www.goodreads.com/book/show/76778.The_Martian_Chronicles", "http://www.goodreads.com/book/show/248596.Something_Wicked_This_Way_Comes", "http://www.goodreads.com/book/show/24830.The_Illustrated_Man", "http://www.goodreads.com/book/show/50033.Dandelion_Wine"]}