{"ratings": 389, "userreviews": [{"userName": "Julie Carpenter", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/33202384-julie-carpenter", "userReview": "A bridge.Two strangers.Lives lost.Irrevocably damaged and changed.A journal.A research project.A journey.Finding your way.Healing.Love returned.Changing course.The Past.The Present.The Future.Those words might not mean much but they very quickly sum up this book. Although this isn't a book to be quickly summed up. It took me a week to listen to it because I had family in town visiting. I enjoyed every moment with them and didn't turn on the story at all. But it was inside my mind, swirling and churning, leaving questions that I didn't know the answers to. I speculated on how it would work, the meetings, the healing, the change. But I was wrong. It was so much more than I expected after pondering it for a week and then returning to the story. I loved it!There are two different points of view in this story. One person, living in San Francisco doing a research project on the Golden Gate Bridge, and coming across something that completely changes her life and perspective, broadening and enlightening everything. The second person, a man who lives outside of Manhattan, whose world comes crashing down. It's gone. He's hanging on by a thread. A dream. When life and his dream slowly converge, he might be able to see that little hope, and seeing that little light of hope begins a journey he only ever dreamed about.I won't say more than that, except that it isn't what you will quite expect. The writing was very well done and the connecting and converging of the two stories was very thought provoking. The loss and healing as well. Content: Clean. Some death and talk about death but nothing graphic.I listened to an audiobook on my Deseret Bookshelf.Happy Reading!!!"}, {"userName": "Aimee (Getting Your Read On)", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/1934633-aimee-getting-your-read-on", "userReview": "3.5. rounding upI was really looking forward to reading this book. The cover alone would make me pick up this book because I LOVE the Golden Gate Bridge. It is beautiful and because I grew up not too far from it, it speaks of home to me.One thing I loved about this book was the bits of history it gave me about the bridge. It made me want to go find a book about the Golden Gate and read it myself. I love when books inspire me to know more about something or someone.This book is basically two different stories in one. One is about Katie, the other about Dave. The two intersect toward the end but it wasn't in the way I was thinking it would be. The story itself is gentle and slow. There is nothing heart pounding or climactic about it, just two people dealing with different struggles in life, trying to find answers.My favorite book by this author is The Rent Collector. I loved that book. I wouldn't say this book is better than that one, but it was still enjoyable. I think every person who reads it will find a bit of themselves in it.Content: death, mild swearing, mention of affairs- I received a complimentary copy of this book from the publisher. All opinions expressed are my own."}, {"userName": "Sheila", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/1256966-sheila", "userReview": "Reading The Other Side of the Bridge is more than just reading a book, it's an experience. Readers are quickly immersed into the lives of two different people, Dave Riley from New York City and Katie Connelly from San Francisco. I enjoyed how the story was told from the two different POV's and it was intriguing how the author slowly wove together their two paths. Dave at the beginning is happy and successful in his life, but experiencing the often mid-life crisis that people go through in their 40's. He has a loving wife, three children, and a good career. Soon in the story tragedy comes into his life changing everything and leaving him sad, grief stricken, and doing a lot of soul searching. Kate is a grad student, single, and dealing with the loss of her father and her fiance'. She is researching about the people who built the Golden Gate Bridge. Her father had worked there his whole life and had found a journal of a man who'd been one of the many who'd built the bridge. Kate becomes obsessed with finding more about the mysterious journal writer, Patrick O'Riley.I loved the journey that both of these individuals go through. I could relate to many of their feelings as they both were going through the grief process. Both Dave and Kate live through many depressing things, but through these experiences their healing is taking place. I truly liked the reality of this story in showing how a journey of healing happens and that it is hard work. It doesn't happen quickly. There isn't a lot of happiness in your life as you grieve. There are many questions someone asks wondering why these things are happening to them. Camron Wright does a fabulous job with his powerful writing, with words and characters that stayed with me even when I wasn't reading at the moment. This story takes you to places that you don't see coming;Dave and his journey on a Harley and Kate finding clues for her project from strangers, brings about some true surprises. I've loved the other books I've read from this author and this one, though different, wasn't an exception at all. Readers will be taken on a powerful and soul changing journey where some important life lessons are conveyed. The Other Side of the Bridge was an amazing novel of hope, healing, and second chances. I highly recommend this book!"}, {"userName": "Mindy", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/956228-mindy", "userReview": "The Other Side of the Bridge is another beautifully written story by Camron Wright. I loved how this book was written. The author did a brilliant job of leaving the end of a chapter by hooking me to read more and more. I enjoyed the alternating stories of Dave and Katie. Katie was researching the bridge that was maintained by her father until his death. And Dave, having to cope with the death of his family and how he is drawn to the bridge. I loved the connection of their stories at the end and I will admit, I cried and cried. The book was different than I expected, in a wonderful way. I thoroughly enjoyed Dave and Katie's journey."}, {"userName": "Kathy", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/1143268-kathy", "userReview": "content: a little mild language"}, {"userName": "Leslie aka StoreyBook Reviews", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/272944-leslie-aka-storeybook-reviews", "userReview": "This is the story of two individuals with ties to the Golden Gate bridge's construction via family members. It is told from two different viewpoints which was a smidge confusing to me at first, but it did not take long to get into the swing of the characters and their lives.Kate intrigued me and I found her passion for research interesting. Of course, at one point it becomes an obsession for her when trying to find Patrick O'Riley after discovering his journal in her father's study.Dave Riley seems to have it all until he loses everything. I can't imagine how he dealt with the tragedy that happens and the journey he begins to find himself.Now you might think that this is a story where Kate and Dave will meet and begin a relationship but it isn't (ok so that is a little bit of a spoiler) but it isn't and is rather a journey for each into the past and looking towards the future. It is also about growth and branching out of their current lives and experience more of what life has to offer.There is a lot of history about the Golden Gate Bridge in this book and I found it all to be very fascinating. I didn't know a lot about how it was built or even those that might have lost their lives in that pursuit. I am thankful to the author for sharing this information with us.This book might make you think about your own life and the direction it is heading and if that is where you want it to go or if you need to make a change."}, {"userName": "Susan K", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/4377518-susan-k", "userReview": "Clean read, mild languageBeautifully detailed grief, mourning, and healing along with the search for a mystery and healing for someone else grieving the loss of a father. The stories intertwine, and the intertwined part, while brief, is poignant and lovely.This is a dream ride of a read, literally. Hurting, healing, reaching, wanting, muddling through it all, and digging for an answer for two sets of problems. Little bit of romance, but not the main part of the story.Loved this read, and will always return back to this author to read! Highly recommend."}, {"userName": "Angie", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/702670-angie", "userReview": "I was hoping for more from this author, after I had enjoyed The Orphan Keeper so much. The story is just quite implausible. I didn’t feel like the male character, Dave, was believable in many of his choices, especially regarding his time in Colorado. That part had me rolling my eyes a few tines. The story didn’t develop very deeply, as Dave had many thoughts from his past but they were all only ever from the week or so lived at the beginning of the book. For example, his wife only ever called him the nickname she jokingly coined in the first few chapters, when that really shouldn’t have been something that meant so much to him when there were so many other facets, never touched upon specifically, as he thought of their 18-year marriage.It might have been me, but I just rarely felt like the story went where it should and a fair amount was not that interesting, just there to keep the story going between the authors few pivotal moments. I didn’t find much to take from this story, it just wasn’t for me."}, {"userName": "Julie", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/45838939-julie", "userReview": "A lovely read. Nothing riveting . Everything works out as it's meant to work out . No red herrings . No untidy endings . It's meant to make you think about your hopes and dreams and are you happy with your life. I can't say it actually did , but can't think of anything bad to say about it either! Just a pleasant read..."}, {"userName": "Jamille Parks", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/20863540-jamille-parks", "userReview": "DISCLAIMER: DON'T READ MY REVIEW IF YOU DON'T WANT MY HONEST OPINION. IT CAN BE VIEWED AS HARSH CRITICISM.Guess I'll be the bad guy here. My honest opinion is that I hated it. The entire book is depressing and when I thought life was going to turn around Dave something gets in his way. Now don't think I'm not empathetic, I know it's hard when you lose your family in a car accident, work is too much to handle because of your loss, and life just sucks. I too have been struggling with depression for years and I know how debilitating it can be. I think the way he handle it was a bit off the rocker. I was also trying to figure out how Dave and Katie (she was a historian working on a project for the Golden Gate Bridge and had a journal and ring she need to give to Dave that was his grandfathers) would meet. For more than three fourths of the book I was asking this question and when they did meet I was really disappointed. Not to mention at the end when he was arrested because they thought he stole someone's identity because he looked like he could be in a biker gang was a bit too much for me. Then when the thug in jail stole his jacket his deceased wife gave him I was ready to set the book down even though I had twelve pages left. It was just too depressing and in my opinion a bit overkill. The guy can't have that much bad luck and if he did I'd rather he jump off the bridge.With all of this being said, my 11th grade English teacher would be disappointed if I didn't the allegory of life being like a motorcycle ride and the ups and downs that come with it. The symbolism of getting on a bike and riding because it gives you freedom from your past and the pain of being chased by your demons and overcoming them was well written in the story. I can see this book being a good candidate for AP English classes in the future. This is a story of overcoming trials along the road that faces you. As for me, it just wasn't my cup of tea."}, {"userName": "Becca", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/953796-becca", "userReview": "When the opportunity came up to review one of Camron Wright's books I jumped at it. His book \"The Rent Collector\" is one of my favorites, so I knew I was getting a good book.This story was so complex, and beautiful. I have to admit I had read some reviews that made me wonder if I would love it as much as I did his other books, lets just say, everyone has their own opinion, and I loved this book. It was so moving.We follow two different stories in this book, that end up being intertwined, but not in a way you think it would be.Katie is a single woman who has been tasked with writing a story about The Golden Gate Bridge. This is something near and dear to her heart, since her father worked on the bridge for years, saving people from jumping to their deaths. I learned so much about the making of this bridge from Katie's research, and I have always had a fascination with the Golden Gate Bridge, but I still have never been. I want to go now more than ever. I feel like I would be able to feel the people who worked so tirelessly to make it such a great site. There were so many lives lost while building the bridge, but also some wonderful friendships and stories that came from it as well. Katie does such a great job researching and bringing to life these amazing people who helped build the bridge. It's so great.Dave on the other hand has a story that is so tragic, that it was hard for me to read. I don't want to give anything away, but his man had a hard go at life for a while. He had a dream to drive across the Golden Gate Bridge on the 4th of July, with the sun at his back and the wind blowing through his hair. His Grandfather had helped build the bridge and had told him that it had helped him find answers. Dave was hoping the same thing would happen for him. But, how could he leave his life and his work and just go take off on a Harley across the country.The story that brings this to life is so wonderfully tragic. We all face loss, disappointment, and anger. What we do with that is what makes us who we are as humans now. Dave seem to be stuck in the anger, until he met Redd. Redd introduced Dave to his first Harley Davidson (which is a bike I swoon over every time I see one.....I don't want to ride it I just want it to sit in my garage and look pretty). When Dave finally decides he is going to go for his dream. He walks out on his work, and his life, buys a Harley and heads towards San Francisco. This book is such a great story of love, loss, anger, friendship, devotion, and new beginnings. I couldn't put this one down. It was so captivating to hear two different peoples look on life and to see how their little lives come together just for a moment. That moment seems to be what they are both looking for.Wright is an excellent writer. He brings the world to life. He brings tragedy to the forefront and makes your heart ache. He also tells such a compelling story that now all I want to do is learn more about the bridge. Pick this one up. I know I always say that, but that is because I love to read and love to share the books I love with others. You won't be disappointed. It is such a beautiful, and meaningful story. We all need to find our place in this world and sometime it takes some longer than others. Sometimes we think we have found it, and learn that there can be more to add to the beauty that is already around us. I cannot say enough good things about this book! Read it. You won't regret it.Source: I was given this book as part of a book tour. I was not compensate in any way for this review. These are my own PERSONAL thoughts on the book."}, {"userName": "Cathy", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/2433931-cathy", "userReview": "Wow, I've read some really great books lately! This is one of them. I loved everything about this book! Camron Wright is one of my very favorite authors. He has a way of making the characters in his books jump right off the page and seem so real. This book starts with Katie. She's a bit of a mystery. From the first chapter, I wasn't quite sure what to think about her. You don't really have all of the pieces of who she is or why she's part of the story. But I liked it that way. I liked her inquisitiveness. She finds a journal and she becomes so obsessed with it that pretty much everything else in her life gets put on the back burner until she can figure out who the author of the journal is, where he came from and what happened to him. Then there's Dave. I liked Dave from the first. He has a great family, a great life really, but he doesn't see it. At one point, he says to his wife that he's looking for something more. I loved her answer that \"Watching my kids grow up, being there with them, with you - I'm living my dream.\" Dave thinks a lot about that during the rest of the book. I've thought a lot about it as well. I love what she says and I want that for my life as well. I liked watching Dave as he goes through hard things and learns from them. And how to move past them.This book is interesting in that it has two almost completely separate plot lines. I loved the way that the author did that! It's not something you see very often. It really made this book have texture and depth that it wouldn't have otherwise had. The plot lines were both great for the two characters. And when the plots intersected, wow, magic! I loved the way the book ended, but I'd love to know what happens after the story ends as well!"}, {"userName": "Karen Nelson", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/26392221-karen-nelson", "userReview": "#TheOtherSideOfTheBridge #NetGalleyA wonderful read with tones of love, loss, and life's purpose with the backstory of the history of the Golden Gate Bridge. The book’s two characters both dealt with grief and loss, with only the bridge in common. The book was well written and brought in both characters, who were joined by a single person. Kate, a researcher, found herself looking for the author of a journal who documented the building of the Golden Gate Bridge. Patrick, having experienced a great loss, who was searching for meaning. For most of the book, it seemed like it would have a formulaic end. I was relieved the book didn’t follow the predictability of many books and sink into a bland ending. You know it is a good story when you feel in touch with the main character and his search for purpose in life. Losing everything you love makes you question life and meaning. I want to thank #netgalley for the opportunity to read and honestly review this book in advance of the publishing date."}, {"userName": "Kathryn", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/1329275-kathryn", "userReview": "What an inspirational book! It started out slow, but once I found the flow it soared. Many life lessons are learned and discovered as lives are lost, hearts are broken and betrayed, and two people from opposite sides of the states try to find understanding and hope for a new day and a new start. “ I think that’s what life must be about- helping others, leaving pieces of us with them, in return fitting borrowed pieces from them into our own voids, each person helping others along the way.” Katie O’connellyThe Golden Gate Bridge history and the quest to ride a motorcycle across it on the forth of July because your grandfathers said it was magical and could give you answers."}, {"userName": "Wendy Jensen", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/7653378-wendy-jensen", "userReview": "It is hard not to compare one work by an author to another work by that same author but to do so would be to miss the beauty of this touching read. Loss is a part of life. Wright brings the emotion and struggle of loss realistically into his telling. The story is beautifully told as it moves forward in believable ways. Two souls with connection to the Golden Gate Bridge search for life meaning and purpose following painful tragedies that leave each heart broken.I listened to the audible while packing up my house. It is well done with a female voice for the story of the west coast university researcher and a male voice for the story of the east coast executive making it easy to follow.Worthwhile ...."}, {"userName": "Kim Dennis", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/31467008-kim-dennis", "userReview": "This is a hard book for me to review. I really enjoyed it. There were a couple of things I would have done differently, which is why the 4 stars instead of 5. There was one scene in particular, that I could more or less figure out why it was in there, but didn't really seem to fit and I felt like the same objective could have been achieved in a way that fit more with the story. However, I loved the lessons that were taught and the characters were really believable. Wright has a way with words that is very impressive. This was my first of his books, but it won't be the last."}, {"userName": "Djbozung", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/4545900-djbozung", "userReview": "This was a well written book. I had never read any of Camron Wright's books. I definitely will plan on reading his previous books. I enjoyed the stories of the two separate characters and how they were eventually tied together in the end of the book. The stories of the characters caused me to ask myself how I would react and feel in their situations. I loved learning about the history of the Golden Gate Bridge. I enjoyed reading this book."}, {"userName": "NaDell", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/1973732-nadell", "userReview": "Book is out on March 6th. I get to read it early as a perk from my job working in a bookstore. Loving it so far!Just finished the book. It was a little hard to get used to the two different voices of narration, especially since they didn't seem like they went together at all other than a connection with the Golden Gate Bridge. Just when I thought it seemed cliche and trite, it threw a major plot twist in that confused me again and sent me digging deeper into the book to try to solve the puzzle, just like the characters are trying to do throughout the book.Well worth the read!"}, {"userName": "Carol Wendkos", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/36343822-carol-wendkos", "userReview": "This is the story of two individuals with ties to the Golden Gate bridge's construction via family members. It is told from two different viewpoints and goes back and forth between the 2 main characters. There is a lot of history about the Golden Gate Bridge and I found it all to be very fascinating. Another Cameron Wright winner!"}, {"userName": "Susan", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/1370508-susan", "userReview": "I’ve read everything this author has written and this book was certainly not disappointing. A wonderful story about love, loss and new beginnings with some history about the Golden Gate Bridge."}, {"userName": "Bonnie", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/1425373-bonnie", "userReview": "Wow. This is an incredible story. I couldn't put it down. I loved Dave Riley from the beginning, maybe because I could relate to him a little bit more than Katie. But as I got to know Katie and see how their lives were going to intertwine, I loved her as well. This is a story of loss, love, frustration, endurance, learning, growing, and so forth. I would highly recommend it to any and everyone, especially those looking for a fantastic book club read. There is a tiny bit of language toward the end, nothing more than you would hear walking down the street."}, {"userName": "Zane Larsen", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/77860800-zane-larsen", "userReview": "Some spoilers ahead, so I suggest not reading if trying to avoid any of those. I feel like the characters almost were completely developed, they lacked in some key areas. For example, Dave’s loss, for as much impact as it has on the rest of the story, is very brief. While accidents may be brief sometimes, you don’t feel enough of a connection to the family before the accident, so it is hard to connect with Dave deeply without having a similar accident in your own life. However, despite the lack of initial push, the recovery and turn of Dave’s outlook is very well written. You feel his change and his soul put into his work, even when he may not be completely confident. His latter story is very connectable. The opposite is of Katie. While the initial feeling and description of her father is very greatly written, not much development is felt from her as the story progresses. She does not seem to change much, which is bittersweet, because she has a good feel at the beginning, but could definitely stand some more deep evolution. The end of the story was quite a let down to me. While I can understand a mellow finale of the two’s meeting and conversing, I feel like for as much build-up is put into the changing of Dave and the closure for Katie, the end was lackluster. Nothing grand stood out, and feels a bit underwhelming. Finishing up, when first reading I felt the story felt like just that: a story. Not much connection, mainly I think because the skim of Dave’s intro. However, as the chapters passed, I felt a deeper connection to Dave, and he began to feel more like a person than a character from a novel. Unfortunately, I still feel like Katie is just a character. I did not feel a connection to her, even as her journey came to an end. So I suppose while the story was a grand idea, it could have been much more impactful had the female role felt more like a female. The connection of the two was mellow, which is fine, but should have been a bit more emotional."}, {"userName": "Adrienne", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/3451098-adrienne", "userReview": "When Katie Connelly, a research assignment, is supposed to be putting together a report about the Golden Gate bridge, instead she is caught up in the pages of a diary she finds among her deceased father's things--a diary written by Patrick O'Riley, who helped build the bridge. Knowing that her father tried to track down Patrick or his descendants, Katie takes up his search, hoping that she'll find some measure of peace after her father's death.Dave Riley, a New York marketing exec, is haunted by the loss of his family. Barely holding it together, when an opportunity to represent a motorcycle company comes along, Dave jumps at the chance to win the account. In the process, his vague dream of driving a motorcycle of his own across the Golden Gate Bridge on the Fourth of July becomes more and more important to him. Two people are searching for answers--but will the bridge give them what they seek?This book was terrific. I loved seeing how things played out. (I was a little worried the book was going to head a certain direction, which would have been overly cheesy in my opinion, so I was really glad it didn't go that way.) I was really pulled in by Katie's story and her search first; the idea of searching through an old journal and trying to find the author really appealed to the librarian in me. I thought both characters were realistic and I really enjoyed following their journeys.I read a copy via NetGalley. All opinions are my own.#TheOtherSideOfTheBridge #NetGalley"}, {"userName": "Alicia", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/877481-alicia", "userReview": "I usually avoid low-lexile, feel-good, emotional, “fluff” books, such as this book. I picked this up because I loved the author’s other books: The Orphan Keeper and The Rent Collector (which have more substance to them). Because I was born in San Francisco and raised in the Bay Area, I appreciated the historical facts about the Golden Gate Bridge.Quotes:“Plan for the very worst, then pray for the very best. Savor the days when the sun shines, but have your raincoat and boots ready for the storms that will always blow in from the bay.”“Courageous men are not fearless men, but those who climb despite fear. Everyone has a bridge to climb. At the end of the day, fear and I shake hands and part knowing we'll meet again when we climb our bridge together.”“I leave the bridge in peace; we part as friends. I take so much of her with me and leave so much of myself behind. I think that's what life must be about-- helping others, leaving pieces of us with them, in return fitting borrowed pieces from them into our own voids, each person helping others along the way.”"}, {"userName": "Debbie", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/2851042-debbie", "userReview": "3.5 starsTold from two points of view – Katie on the west coast and Dave on the east coast – both grieving as they deal with loss, this book looks at love, depression, trials/lessons in life, and finding purpose and meaning. Integrated into the story is some of the history of the building of San Francisco’s Golden Gate Bridge. LIKES: 1) this was more real world, not ultra conservative or preachy, without being crude; 2) the author resisted the predictable ending. DISLIKES/HIGHLY UNLIKELY: 1) never really felt a connection or particularly like Katie, wish her character was better developed. It was disappointing how quick and neat her story was tied up in the end; 2) the term “ponytail man”; 3) Crystal allowing a stranger to come in and sleep on their couch, especially with three young children; and 4) that Katie and Dave never met, the diary and ring were actually boxed up and put in the mail, rather than being hand-delivered, especially given the emotional and sentimental value."}, {"userName": "Marcia Nelson", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/2714094-marcia-nelson", "userReview": "THE OTHER SIDE OF THE BRIDGE—Camron WrightI loved this book because Dave Riley had lost all hope, his life in despair. There are so many quotes that are thought provoking and can even be life changing like: “We’ll be like the cable pulling together—doing what we aren’t strong enough to do on our own”.“In life, always overengineer….plan for the very worst, then pray for the very best. Savor the days when the sun shines, but have your raincoat and boots ready for the storms that will always blow in form the bay”.”life is worth living…keep hope alive and stay strong for others”“I should have done more than just talk, I should have listened.”This book is about relationships and how fear can be developed into courage, how a bridge can help connect people and families. This is a great book!Marcia Nelson"}, {"userName": "Nancy", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/65166806-nancy", "userReview": "Quick read story of two people trying to put their life's together. Dave Riley loose his wife and three children in a car accident he is the only survivor. He can understand why. Works for marketing firm wants motorcycle client. Last think he told his wife wanted to ride motorcycle over Golden Gate Bridge on Fourth of July. Reds teaches him how to ride he fines leather jacket Meghan bought to give him on his fourthly birthday. Other story is katie Connelly lives in San Francisco and father worked on bridge safe twenty eight jumpers he died trying to safe someone. Katie found journal of Patrick o Riley in fathers desk he always wanted to find family member to give it to. Patrick worked on the bridge while it was being build tells his story. Dave drop the o and is Patrick grandson katie saves him on the bridge on Fourth of July good story on how both move on with their live."}, {"userName": "Emily F", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/10389337-emily-f", "userReview": "The author has woven two seemingly unrelated characters' lives together beautifully. I don't know what I was wanting from this book, but I am so glad I read it! It's not about perfect people - the characters have flaws and make mistakes, but that is not the focus. The focus is the inspiration, hope, and freedom that leaps off the page. The characters are relatable, in such a way that I wanted to know more and continue reading. This was so inspiring - I highlighted a lot and look forward to rereading it and recommending it to others. I was kind of surprised initially - I didn't know how the two main characters could be connected, but their stories were perfectly interwoven. This was sweet and clean, I'd rate it PG."}, {"userName": "Stephanie", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/6320378-stephanie", "userReview": "I an underwhelmed. I expected so much more from this author. I thought I knew exactly where this book was headed, and I was somewhat okay with that. But not only was I wrong, the ending came too quickly and fell flat. I found some of the dialogue mildly cheesy, and I didn’t feel like Dave was written with enough depth. I should have felt sorrow over his loss and his pain, and joy at his triumphs, but I didn’t. I felt the same way about Katie. I did think the pacing worked until the end, I loved Redd, and I loved learning about the history of the bridge through Patrick’s words. It wasn’t a book I ever considered putting down, but now I just want to reread The Rent Collector to remind myself why I love Camron Wright."}, {"userName": "Dianna", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/2721643-dianna", "userReview": "An interesting read about the history Golden Gate Bridge the beginning of the Book was a bit difficult since I find the subject of suicide hard to read about. I am aware that people do jump from it. I enjoyed learning the background history as she was doing her research as the story unfolded, it was a bit hard to follow I had to several times relisten to figure out what was happening or if I missed something from one story line to the other. I like the character development but at times I felt it dragged. Over all I liked the book ( I hated the phrase ponytail man because it seemed out of place and awkward.) I felt the story line Dave and Chrystal was to predictable. Over all I enjoyed the read"}], "description": "Two coasts. Two strangers. And a bridge that silently beckons them both.Katie Connelly has lived in San Francisco all her life. Her late father made his career on the Golden Gate Bridge, and the many stories of how he saved jumpers still haunt her. And now her job assignment is to write about the history of the bridge—a history that includes a secret journal about a promise ring and a love story that may be the answer to her unresolved sorrow.  Meanwhile, Dave Riley, a marketing executive in New York, has sorrows of his own. Grasping at straws after tragedy strikes his family, he decides to follow a daydream that has turned into an obsession: to drive across the Golden Gate Bridge on a motorcycle on the Fourth of July. Does the bridge somehow mysteriously hold the answers both Katie and Dave are looking for? Or will they find something completely different when they get to the other side?", "title": "The Other Side of the Bridge", "url": "http://www.goodreads.com/book/show/35909708-the-other-side-of-the-bridge", "average": 3.92, "cover": "https://images.gr-assets.com/books/1506447239l/35909708.jpg", "reviews": 123, "authors": [{"url": "https://www.goodreads.com/author/show/79303.Camron_Wright", "name": "Camron Wright"}], "type": ["Fiction", "Adult Fiction", "Drama"], "outlinks": ["http://www.goodreads.com/book/show/35909708-the-other-side-of-the-bridge", "http://www.goodreads.com/book/show/38902078-the-other-side-of-the-bridge", "http://www.goodreads.com/book/show/35909709-the-other-side-of-the-bridge", "http://www.goodreads.com/book/show/13628812-the-rent-collector", "http://www.goodreads.com/book/show/29502649-the-orphan-keeper", "http://www.goodreads.com/book/show/137056.Letters_for_Emily", "http://www.goodreads.com/book/show/17337982-serann-and-the-prince-of-angkor", "http://www.goodreads.com/book/show/38903011-christmas-by-accident", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}