{"ratings": 316, "userreviews": [{"userName": "Laurie • The Baking Bookworm", "userReviewDate": "Jul 14, 2011", "userURL": "http://www.goodreads.com/user/show/5289134-laurie-the-baking-bookworm", "userReview": "Author: Katherine StonePages: 297Genre: Modern FictionFirst Published: 2003First Line: \"You're not going to marry her!\"Synopsis: On a rainy night Claire Forrester, her beloved husband and in-laws are in a car accident that leaves Clarie's husband and parents dead and Claire in early labour.Thirty years later, Claire's daughter Paige is a talented doctor who goes above and beyond to help her cancer patients to the detriment of her personal life. Gwen St James, a make-up artist at a local TV station, is asked by Claire to come into the hospital to make over one of her patients who has been ravaged by cancer. Paige and Gwen both feel a connection between them and become close friends quickly. Meanwhile, Claire starts to have flashbacks to the night of the accident and can't quite help feeling that she's about to unlock some dark family secrets that her subconscious has kept from her for the past 30 years.My Thoughts: This was one of those books that I picked up merely based on a quick glance of the book cover. I was in the library looking for a book to take to the beach. I wanted a Sydney Sheldon-type read filled with delicious deception, back-stabbing and loads of twists ... and the occasional Alexis Carrington-esque cat fight wouldn't go unappreciated either. In other words, I wanted a perfect beach read.Sadly, this book just didn't measure up. I finished it but barely. The overall storyline that was described on the book jacket sounded intriguing but the writing just didn't cut it for me.First of all, there were quite a few characters but I never felt like I got to know any of them even though, throughout the book, the author continually spoon fed the reader characters' inner thoughts. A character would be speaking but, at the same time, their inner thoughts were printed in italics. Not needed if the writing was better. Kind of like ....\"Hi Paige! I can't believe I just bumped into you here!\" I hope she doesn't think I've been waiting around for her!. That kind of thing. I don't need to be spoon fed character's thoughts. It just comes off as annoying.There was also the added confusion about who was who. I had a hard time remembering which stunningly handsome man went with which utterly gorgeous woman. Everyone was just so darn pretty that no one really stood out and that made my gag reflex start to tingle just a bit. The author couldn't throw in an average gal who may wear Spanx and perhaps a guy without a great tan, a cleft or a dimple??The people and the storylines in this book worked out too perfectly for me and felt contrived and utterly unbelievable. First of all, the happenstance meeting of several of the characters that then turned into long-lost relationships is too out there to be plausible. There's fate and then there's 'Oh pullleeeze!\".There were also a plethora of subplots going on (what is with me picking books lately with oodles of superfluous subplots?!?) which just made the overall storyline feel too convoluted and I ended up not really caring about any storyline. Add to the fact that there was an overabundance of issues being dealt with and it got really drawn-out and complicated when it didn't have to be. For example, this book deals with postpartum depression, kidney disease, organ donors, neglect/child abuse .... Too much goin' on!!The final straw (which happened right at the end --- SPOILER ALERT!!)::::::is when both twins get pregnant and announce their pregnancies to their mother at the same time. Oh ... come ... on!! Really!?! That little gem felt like something out of a Sweet Valley High book. Don't get me wrong, I loved Sweet Valley High .... when I was 12 years old. I'm much too jaded now to believe that all these connections and revelations 'just happen'.This was an intriguing storyline but, unfortunately, was poorly executed. I felt totally let down and a little ticked that the book wasn't nearly as good as the write up on the book jacket made it out to beMy Rating: 1.5/5 starsFor more of my book reviews check out my blog www.thebakingbookworm.blogspot.com"}, {"userName": "Melissa Cunning", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/35859030-melissa-cunning", "userReview": "While a sweet story, I really felt it lacked substance. There were too many storylines going on all at once, and trying to keep them all straight for most of the book since they didn't seem to show obvious links just made things confusing. Nothing really made sense until the very end. If it wasn't for my inability to walk away from a book without finishing it, I probably wouldn't have as there was nothing that gripped me in this story and really made me want to keep reading.The synopsis of this book makes it sound much more exciting than it is. This was the first book I read by this author, and likely my last."}, {"userName": "Jill", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/3136246-jill", "userReview": "I don't remember just why I picked this book. I really did enjoy it. Paige, Gwen, and Claire are all trying to keep a secret of their own. Paige is a doctor but her kidneys are failing and she doesn't want her mother, Claire, to know. She meet Gwen and they seem to understand each other. Claire is Paige's mother who won't leave her home. They all feel something is missing in their lives. Very good story telling."}, {"userName": "Woo Sweeney", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/67876941-woo-sweeney", "userReview": "It was ok...i thought the characters were a bit confusing."}, {"userName": "Holly", "userReviewDate": "Feb 26, 2011", "userURL": "http://www.goodreads.com/user/show/1881626-holly", "userReview": "It's important not to overdo it when it comes to Stone. I really enjoy her novels, but they're definitely on the too-sweet side. The fact that EVERYTHING is tied up in a nice neat little bow can get frustrating after awhile. Plus, it's kind of the same book every time - damaged woman meets damaged man, together they are healed by love. Obviously I read one too many Stone novels in a row. She is infinitely readable. Despite the issues I had with this novel I couldn't put it down. Also, I have to say upfront, if I hadn't binged on her all at once, I know I wouldn't be complaining now. She's my guilty pleasure - her novels should drive me insane, but instead I lap them up.(full review to come)"}, {"userName": "Jo", "userReviewDate": "Oct 24, 2009", "userURL": "http://www.goodreads.com/user/show/2873372-jo", "userReview": "No surprise the writer is a former medical doctor - the medical descriptions in the book were very technical and in depth - I thought it was funny how much one character learned from one night of surfing the net - enough to have a full discussion with a doctor about history and treatment options, including remembering the full names of medicines and surgical procedures. Hilarious.Even though characters meet and are instantly bonded, trusting each other and/or in love etc., I still bought into the unlikeliness of it happening because that's kind of the idea with escapism reading. It's easy. I found it a nice light read."}, {"userName": "Donna", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/1493118-donna", "userReview": "Paige Forrester is a doctor like her father, that she never knew. She has some medical issues that she has kept secret for a while. Other secrets evolve as Paige as she becomes friends again with a college love and a make-up artist named Gwen. Paige's mother is a reclusive. Throughout the novel, that secret is revealed and solved."}, {"userName": "Connie", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/5414464-connie", "userReview": "This is #1 in Sarah's Orchard, Oregon Series. There were too many italics in this book and everything was repeated more than one time. I liked the premise of the story, but the italics took away from the whole story for me. The constant repeating of facts in the same chapter some times was very off putting to me. I am not sure why this is an Oregon series either, when it takes place in San Francisco and last I heard this was in California. I am giving this 3 out of 5 stars. I am hoping for a tighter story next time with fewer italics."}, {"userName": "Sandi", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/45523240-sandi", "userReview": "Good story, but found I had to suspend reality for a couple of character premises that had to be made right in the beginning. How do you go directly from trusting people to, on the very next page, suspecting them of complete and utter betrayal?"}, {"userName": "Puja Chanchlani", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/55688647-puja-chanchlani", "userReview": "Other Twin is such a nail biting book! I like finished this in 1.5 days, So curious, so mysterious and so romantic number. For the people who like to read thrillers, this should be in their reading list!"}, {"userName": "Debbi", "userReviewDate": "Dec 06, 2014", "userURL": "http://www.goodreads.com/user/show/12128668-debbi", "userReview": "Interesting mystery. I had the wrong twin in mind for most of the book!"}, {"userName": "Robin", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/10795477-robin", "userReview": "This was just OK- the ending was just a bit too sweet. It took me awhile to read this book; it started OK but then I got a bit bored with it but felt I had to finish it since I was half way thru."}, {"userName": "Sherry Swindle", "userReviewDate": "Sep 01, 2011", "userURL": "http://www.goodreads.com/user/show/6184422-sherry-swindle", "userReview": "I have read it several times and bought it for my keep collection. I really enjoy her writeing"}, {"userName": "Cherry-Ann", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/8708658-cherry-ann", "userReview": "A bit confusing with some real Mother Teresa sentimentalities."}, {"userName": "Brandi", "userReviewDate": "Jan 29, 2016", "userURL": "http://www.goodreads.com/user/show/45736743-brandi", "userReview": "The beginning of this book was really good and then when it started 30 years later I lost my zeal for it."}, {"userName": "Fran Piercey", "userReviewDate": "Feb 23, 2010", "userURL": "http://www.goodreads.com/user/show/2292713-fran-piercey", "userReview": "\"Ties of love, ties of blood. Sometimes they feel like the sme thing.\""}, {"userName": "Carol", "userReviewDate": "Oct 26, 2009", "userURL": "http://www.goodreads.com/user/show/2509366-carol", "userReview": "Really good. Couldn't put it down. Read it in 2 days...lol. Very touching.."}, {"userName": "Laura", "userReviewDate": "Sep 16, 2007", "userURL": "http://www.goodreads.com/user/show/334836-laura", "userReview": "I enjoyed this book, but not nearly as much as the other book, Imagine Love, I read by this author. A good story with a happy ending, so it was definatly a worthwhile read in my opinion!"}, {"userName": "Lois R", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/22529759-lois-r", "userReview": "Interesting read even though you know the ending right from the beginning. Enjoyed seeing the relationships develop."}], "description": "Over 30 years ago, Claire Forrester survived the terrible car accident that killer her husband and sent her into early labor. Now her daughter, Paige, is a successful oncologist battling her own medical condition, one that requires life-saving surgery. At the hospital where she works, Paige meets Gwen St. James, an accomplished make-up artist whose own past is filled with questions. Raised in a convent, Gwen never knew the identity of her parents. Soon the ties of friendship between Paige and Gwen grow into something stronger, something more like the ties between sisters.", "title": "The Other Twin", "url": "http://www.goodreads.com/book/show/131219.The_Other_Twin", "average": 3.62, "cover": "https://images.gr-assets.com/books/1171999704l/131219.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/34352.Katherine_Stone", "name": "Katherine Stone"}], "type": ["Romance", "Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/131219.The_Other_Twin", "http://www.goodreads.com/book/show/375499.Pearl_Moon", "http://www.goodreads.com/book/show/523235.Another_Man_s_Son", "http://www.goodreads.com/book/show/131215.The_Cinderella_Hour", "http://www.goodreads.com/book/show/131216.Roommates", "http://www.goodreads.com/book/show/3052870-twins"]}