{"ratings": 1028, "userreviews": [{"userName": "Abigail Rasmussen", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/5684454-abigail-rasmussen", "userReview": "These traditional fairy tale stories are rich in character building qualities. The sun may shine purple and zebras may be blue and green polka dots but however fantastical the imagined world may be the stories retain a faithfulness to the moral order of the actual universe. The characters in the metaphors are not just random figments of a fancy imagination but rather reflections of our own invisible world, the supernatural. The audio book version of \"The Olive Fairy Book\" is now complete and has been cataloged here: http://librivox.org/the-olive-fairy-b... Each short story is read by a different reader. I started this book as a project on LibriVox a few months ago. I was the Book Coordinator as well as the Dedicated Proof Listener. Many different LibriVox readers signed up to read one or more of the 29 fairy tales told in this book."}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "As before with the Blue Book, many of these were long in length. I didn't recognize most of these, but my favorite new one is probably The Billy Goat and the King just because the characters amused me - the king with his giggles and the wife with her suspicious glares. Want a perfect life and happiness? Apparently that's achievable only by falling in love with a beautiful prince or princess - the moral of most of these stories.I may enjoy some of these more in print format since I listed to audio, and let's admit that audio and I are a bit out of sync."}, {"userName": "Shauna", "userReviewDate": "May 10, 2012", "userURL": "http://www.goodreads.com/user/show/6394569-shauna", "userReview": "Sadly, this collection ran more in the way of The Billy Goat And The King, in which the happy ending comes in the form of a wise old goat teaching the King to better control his wife by threatening to beat the poor woman. I'm afraid neither women or men come out of the grand majority of these stories at all well.There are a scant few tales in The Olive Fairy Book that I truly enjoyed, but they earn those three stars."}, {"userName": "Lila", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/4656570-lila", "userReview": "Andrew Lang's Colored Fairy Books are classics that I somehow missed as a child. This particular volume has a number of Armenian, Turkish, and South Asian tales in addition to European ones."}, {"userName": "Erik", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/40278190-erik", "userReview": "I got this book for Christmas. It's definitely my favorite of Andrew Lang's Fairy Books. I was lucky enough to get an illustrated version. The pictures are beautiful and the stories are entertaining.My favorite stories:- The Blue Parrot (my favorite one of all)- The Story of Little King Loc- Kupti and Imani- Dorani- The Story of Zoulvisia- The Snake Prince- The Boy Who Found Fear at Last- The Punishment of the Fairy Gangana- The Silent PrincessA few stories weren't to my liking (The Strange Adventures of Little Maia, Grasp All, Lose All, He Wins Who Waits) or flat-out confusing (Geirlug the King's Daughter comes to mind), but overall the stories were excellent. I like how non-European stories dominate the book - it's nice to see stories from other cultures. Definitely a recommendation for fairy tale lovers!"}, {"userName": "Mary Catelli", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/21198579-mary-catelli", "userReview": "A mix of tales leaning toward India and the Middle East. \"The Green Knight\" gives us a new and different promise a dying queen should not extract from her husband. \"The Prince and Princess in the Forest\" and \"The Silent Princess\" are unusual tales. Several literary French ones -- which I was, by this point, able to pick out of the others just by style."}, {"userName": "Elinor  Loredan", "userReviewDate": "Sep 30, 2013", "userURL": "http://www.goodreads.com/user/show/2504970-elinor-loredan", "userReview": "This book is one of my favorites in the Lang collection because all of the stories are so unique and non-formulaic, though, of course, there are themes that appear in many fairy tales. The only story I dislike is The Billy Goat and the King which, though I'm not a feminist, does grate on me. Most of the others I love, and each other I like very much."}, {"userName": "Rachel", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/8387812-rachel", "userReview": "A wonderful collection of tales from Europe, the middle east, and Asia. These aren't the traditional \"disney\" fairy tales that have become so popular. Yes, many have happy endings, but these are traditional fairy tales that contain a point. Help the needy, don't betray your family, have patience, etc. Almost all the stories contain a note of origin, which enhanced their authenticity."}, {"userName": "Sandy Carlson", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/2574593-sandy-carlson", "userReview": "Andrew Lang - 5 start, naturally. Great collection of short stories from around the world. Some are very, very folksy."}, {"userName": "MyzanM", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/54220508-myzanm", "userReview": "As always... I love fairy tales.In this collection there were quite a bit that weren't familiar to me. Some of those were confusing to say the least."}, {"userName": "Kaion", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/2670571-kaion", "userReview": "At this point in the series, Lang must have long run out of the more familiar stories and casted further abroad for this 11th(!) installment of the Fairy Book series. If the volume is somewhat lacking in first-rate tales as a result, it largely makes up for this in freshness. There's also a general cohesiveness to the collection that at times lacking in the Red Fairy Book— sure, there's the same number of literary fairy tales that have been abridged beyond intelligibility— but overall the writing has become more polished. With stories from Sudan, Armenia, Turkey and India, \nThe Olive Fairy Book\n certainly fulfills my wish for more \"cultural variety\" in the series. Anyway, to the highlights!:- Jackal or Tiger? (Indian, unattributed) is an odd little tale of marital dispute, in which the comic exaggeration of greed and selfishness juts up against the darker currents of familial breakdown and suggestions of murder and incest. This is the stuff of Greek tragedy, I'm saying, so it seems especially strange that the king gets a relatively happy ending. Water and blood seem to be the major motifs in the story — the bond of blood which he doesn't owe to his father (and half-sister) vs. the bond of water by which he is connected to the witch. So then, magic is only created through an alchemical reaction of both, a sacrifice given of both honor and blood. Who knows what this has to do with the jackal/tiger though.- Kupti and Imani (Punjabi, unattributed) is a charming take on the classic story of good sister/bad sister in which bad sister is lazy and unprincipled and good sister is hardworking and self-reliant (see \"Tam and Cam\"). Imani is altogether awesome and it's nice for once to have a romance with a long friendship/courting period. As it always is though, no one recognizes anyone else in drag. Also, you should seek medical advice from monkeys: \n\"It's a pity that we can't tell some man of a medicine so simple, and so save a good man's life. But men are so silly; they go and shut themselves up in stuffy houses in stuffy cities instead of living in nice airy trees, and so they miss knowing all the best things.\"\n- Major Campbell is credited with a number of amusing Punjabi folk stories, notably Diamond Cut Diamond, in which we learn the only way to defeat a con artist is a hire a better one. He also provides Dorani, an even more heartening variation of the \"Dancing Princesses\" story than the one I praised from The Red Fairy Book. As in that rendition, Dorani leaves the life of nightly escape of her own accord. Not because she has been bested; rather, having found her voice within the dream, she is ready to take it with her into reality.- Silence as an act of female self-determination/defiance (see The Piano, dir. Jane Campion) rears its head again in the Turkish The Silent Princess. Echoing something of 1001 Nights, the hero must spin a story every night that tempts the princess to speak, or lose his head in the failing. Notably he does so by engaging her intelligence, and even more importantly, each story ends with the exercise of female judgment. Ignac Kunos also provides The Boy Who Found Fear At Last, which true to the title, shares a similar premise to the Grimm's \"The Story of a Youth Who Went Forth To Learn What Fear Was\". Where the Grimm tale is a comically morbid affair that implies fearlessness is a kind of sociopathy, \"The Boy Who Found Fear At Last\" is even more haunting in its implication that it is our ties to society that provide the greatest (existential) horrors: \n‘The king! the king!’ but as he listened to the cries, a vision, swifter than lightning, flashed across his brain. He saw himself seated on a throne, spending his life trying, and never succeeding, to make poor people rich; miserable people happy; bad people good; never doing anything he wished to do, not able even to marry the girl that he loved [...] a cold shiver, that he knew not the meaning of, ran through him.‘This is fear whom you have so long sought,’ whispered a voice, which seemed to reach his ears alone. And the youth bowed his head as the vision once more flashed before his eyes, and he accepted his doom, and made ready to pass his life with fear beside him.\nAnd all that time Lang insisting the Fairy Books are for children. Ha! Rating: 3.5 stars"}, {"userName": "Susan Molloy", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/29670035-susan-molloy", "userReview": "“The Olive Fairy Book,” published in 1907, is the eleventh of twelve collected fairy story books that were researched, translated and compiled by Andrew Lang (1844-1912) and his wife, Leonora Blanche Alleyne Lang. Andrew Lang, a Scotsman, was a literary critic, novelist, poet, and a contributor to the field of anthropology.The twenty-eight stories in this book come from the exotic traditions of from Turkey, India, Denmark, Armenia, the Sudan, and others. Included are “The Green Knight,” “The Diamond Cut Diamond,” \"The Silent Princess,” among others. This was an enjoyable and easy-to-read book. The stories were interesting and held my interest, and I looked forward to reading each one. Not many endings were odd, nor were they predictable."}, {"userName": "Michiyo 'jia' Fujiwara", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/6999278-michiyo-jia-fujiwara", "userReview": "'My son,’ ‘what is the matter?’‘Nothing, father,’‘but I have determined to go into the world and seek my fortune.’‘Be advised,’ ‘and remain in your father’s house; it is better to have half a loaf at home than to seek a whole one in distant countries.’But Ram Singh was in no mood to heed such advice, and very soon the old man ceased to press him.‘Well,’ ‘if your mind is made up I suppose you must have your way. But listen carefully, and remember five parting counsels which I will give you; and if you keep these no evil shall befall you. First—always obey without question the orders of him whose service you enter; second—never speak harshly or unkindly to anyone; third—never lie; fourth—never try to appear the equal of those above you in station; and fifth—wherever you go, if you meet those who read or teach from the holy books, stay and listen, if but for a few minutes, that you may be strengthened in the path of duty.’THE FIVE WISE WORDS OF THE GURUZaitun...190704/01/13"}, {"userName": "Justin", "userReviewDate": "Jan 28, 2011", "userURL": "http://www.goodreads.com/user/show/4517617-justin", "userReview": "I sort of regret that in reading these books, I didn't take the time to make special notes of the stories I liked best. The last story in this volume, \"The Silent Princess\", was a definite favorite. I love it when stories contain other stories."}, {"userName": "Warren Rochelle", "userReviewDate": "Jan 21, 2011", "userURL": "http://www.goodreads.com/user/show/1904708-warren-rochelle", "userReview": "One more color to go--This one--hmm. Some violent stories, and others that I read in adifferent version, such as \"The boy who found fear,\" and then this story of long patience, \"He Wins Who Waits\"--with the husband and wife separated for 20 years."}, {"userName": "Melissa Bee", "userReviewDate": "Dec 27, 2012", "userURL": "http://www.goodreads.com/user/show/5708167-melissa-bee", "userReview": "I love the Andrew Lang \"color\" fairy tale books..... Finding them in ebook format has been wonderful."}, {"userName": "Kjerstin", "userReviewDate": "Jul 26, 2008", "userURL": "http://www.goodreads.com/user/show/1287329-kjerstin", "userReview": "There were so many cool sotries in this book. It was cool to see where some of the childrens stories came from."}, {"userName": "rae", "userReviewDate": "Feb 05, 2008", "userURL": "http://www.goodreads.com/user/show/775046-rae", "userReview": "all of the books in this series are great... fairy tales, fairy tales, fairy tales... absurd and wonderful and oddly familiar...uh, this is a 5-star book, but my stars aren't working right now."}, {"userName": "Monica", "userReviewDate": "Aug 28, 2015", "userURL": "http://www.goodreads.com/user/show/46034847-monica", "userReview": "If you enjoy strong female fairy tale characters you will enjoy this book. It is a little outdated as far as cultural and social norms but still a great read."}, {"userName": "Becca", "userReviewDate": "Aug 20, 2013", "userURL": "http://www.goodreads.com/user/show/1165572-becca", "userReview": "I'm enjoying this collection. I've read both this and the Blue Fairy Book. I want to read the others, too."}, {"userName": "Jenn", "userReviewDate": "Nov 18, 2008", "userURL": "http://www.goodreads.com/user/show/719835-jenn", "userReview": "Another fantastic fairy book. Fabulous illustrations as usual. 300 pages later and I still love reading each fairy tale!"}, {"userName": "Rebecca", "userReviewDate": "Jul 13, 2016", "userURL": "http://www.goodreads.com/user/show/76827-rebecca", "userReview": "Some very interesting fairy tales. Only one more fairy book and I'll have read the set!"}, {"userName": "Nan Silvernail", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/5714624-nan-silvernail", "userReview": "More lovely old fairy tales."}, {"userName": "Stephanie", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/12127769-stephanie", "userReview": "Good fairy tale bookMy children thoroughly enjoyed reading these stories. I actually enjoyed them myself. These make excellent bedtime stories since they are relatively short."}, {"userName": "Leli", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/8230415-leli", "userReview": "Almost entirely Middle Eastern and Indian tales"}, {"userName": "Tortla", "userReviewDate": "Nov 01, 2011", "userURL": "http://www.goodreads.com/user/show/95618-tortla", "userReview": "I read approximately half of these stories...goodtimes."}, {"userName": "Nora Peevy", "userReviewDate": "Mar 02, 2014", "userURL": "http://www.goodreads.com/user/show/4868069-nora-peevy", "userReview": "A wonderful collection of tales from around the world with beautiful illustrations. This book can be enjoyed by children and adults alike and is a good addition to anyone's collection of fairy tales."}, {"userName": "Suzanne", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/1423386-suzanne", "userReview": "The Indian stories are particularly well-written."}], "description": "29 tales from Turkey, India, Denmark, Armenia, the Sudan, and France. The Green Knight is saved by a soup made from nine snakes, the lovely Dorani flies every night to fairyland, heroes hear animals. Eight Punjabi tales, five from Armenia, 16 others. Flying dragons, ogres, fairies, and princes transformed into white foxes. 50 illustrations.", "title": "The Olive Fairy Book\n      \n          (Coloured Fairy Books #11)", "url": "http://www.goodreads.com/book/show/774576.The_Olive_Fairy_Book", "average": 4.16, "cover": "https://images.gr-assets.com/books/1328865504l/774576.jpg", "reviews": 32, "authors": [{"url": "https://www.goodreads.com/author/show/18393.Andrew_Lang", "name": "Andrew Lang"}, {"url": "https://www.goodreads.com/author/show/3486237.Henry_Justice_Ford", "name": "Henry Justice Ford"}, {"url": "https://www.goodreads.com/author/show/7363007.Leonora_Blanche_Alleyne_Lang", "name": "Leonora Blanche Alleyne Lang"}], "type": ["Fantasy", "Fantasy", "Classics", "Fiction", "Short Stories"], "outlinks": ["http://www.goodreads.com/book/show/774576.The_Olive_Fairy_Book", "http://www.goodreads.com/book/show/8804687-the-olive-fairy-book", "http://www.goodreads.com/book/show/11013514-the-olive-fairy-book", "http://www.goodreads.com/book/show/6368840-the-olive-fairy-book", "http://www.goodreads.com/book/show/6343600-the-olive-fairy-book", "http://www.goodreads.com/book/show/543164.The_Blue_Fairy_Book", "http://www.goodreads.com/book/show/774544.The_Red_Fairy_Book", "http://www.goodreads.com/book/show/774571.The_Green_Fairy_Book", "http://www.goodreads.com/book/show/774557.The_Yellow_Fairy_Book", "http://www.goodreads.com/book/show/423177.The_Pink_Fairy_Book", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}