{"ratings": 672505, "userreviews": [{"userName": "Chris", "userReviewDate": "Jan 31, 2008", "userURL": "http://www.goodreads.com/user/show/858949-chris", "userReview": "If you haven't read this book, then all I can tell you is to go out, get it, and read it. Now. Don't bother with the rest of this review, you'll thank me later. It has:Fencing.Fighting.Torture.Poison.True Love.Hate.Revenge.Giants.Hunters.Good men.Bad men.Beautifulest ladies.Snakes.Spiders.Beasts of all natures and descriptions.Pain.Death.Brave men.Coward men.Strongest men.Chases.Escapes.Lies.Truths.Passion. Miracles. For a start.It's one of the greatest love/action/revenge stories ever abridged by a modern author. Well, it seems that Mr. Goldman felt that the original story, as written by the immortal S. Morganstern, was a little too dry for public consumption, as well as damaging to treasured childhood memories, so he went through it and put together this \"good parts\" version, and the world is a better place for it. [1:]Of course, the big gag is that there never was an original version of the book. There never was an S. Morganstern, the greatest of the Florinese writers. Goldman's father may have read books to him as a child, but he never read this book to him. The entire thing is a fiction, beginning to end, but Goldman sells it really well. He tells the tale of how he blossomed as a boy - going from being a sports-obsessed disappointment to a ravenous bookworm, all thanks to this book. He talks about trying to give the same gift to his son, who manages to make it through one chapter before giving up in exhaustion. He talks about the great shock of discovering that his father had done something utterly brilliant - he had skipped the dull bits and left the exciting parts intact.Knowing that all of this is false certainly doesn't detract from the story. It's a story about a story, and the effect that a story can have on a young mind. Or any mind, for that matter. It's about how stories can teach us lessons that only later we understand - such as how life is not fair - and how stories can change us in ways that we never expected. It's about our relationship with fiction, and with the world around us. In his fictional childhood, Goldman learned more about the world from the process of watching the story unfold than he did from the story itself. And so this book is a story about stories. The actual story is just bonus.Which brings me, of course, to the film. Let me say that this is one of the very, very few instances where I will put the movie up on par with the book. 99.9999 repeating percent of the time, the book is better than the movie. This is one instance where they are equal in nearly every measure. I'm sure a lot of this has to do with the fact that Goldman wrote the screenplay for the film, so not only is the story intact, but a great deal of the dialogue is almost verbatim from the book. It was gold in print and gold on the screen. The hardest part about reading the book is trying not to hear Andre the Giant, Christopher Guest, Robin Wright and all the other fine actors and actresses in your head as you read.So, whether you read the book or see the movie, you're in for a treat. And as you read, just remember the books that molded you into who you are today. Think about the stories that taught you life's lessons before life got around to doing it. Think about them and appreciate them, and remember that every book is a lesson, one way or another....[1:] This is a fun type of meta-fiction, writers writing autobiographically about writing about books that never existed. I find it interesting that The Princess Bride can sit comfortably shoulder-to-shoulder with House of Leaves."}, {"userName": "Emily May", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "It's amazing that I've never found time to read this book before. I have seen the movie, but it was years ago and I only really remember the one thing that everyone remembers:The real strength of this book is that is just ticks every box imaginable. It's a fairy tale, full of action, romance and revenge, and it has that timeless quality that the best fairy tales seem to carry. It was published in the 1970s but it feels like it should be a thousand years old, passed down from generation to generation. It's non-stop adventure, comedy gold and full of some of the most memorable characters I've ever had the pleasure of reading about.Goldman's writing style for this novel works so surprisingly well. For one, it's such an unusual idea to write a retelling of a story by a fictional author - Goldman claims his father read him the S. Morgenstern classic as a child and then proceeds to tell us the \"abridged\" version with all the good parts. It's strange how well his constant sidenotes actually add to the story, rather than take us out of it. I think maybe it's the little kids inside most readers who remember the magic of being read a story as a child. Because while this is a fantasy story with magic and princesses, it's also a bittersweet tale about how a father introduced his son to the world of stories.And I found it hilarious. I want you to know how rare it is for me to find a book that successfully combines silly humour with dramatic action and adventure. I've struggled with authors like Terry Pratchett because I felt the humour took away any serious investment I may have had in the story. But this book quietly mocks itself on every page and it works so well. At first I wondered if I would be rolling my eyes at the whole notion of Buttercup as \"the most beautiful woman in the world\", but Goldman rolls his eyes for us with the comic portrayal of obsession with beauty and true love. The characters here are so rich and vivid that it's hard to imagine that they don't exist somewhere in an alternate fantasy world. Everyone remembers and loves Inigo Montoya and the pretty-faced Westley, but I was surprised by Buttercup. My memory of the movie seems to have done her a disservice because I remembered her as a typical, beautiful princess. But no, Buttercup is fierce and brave. She might be silly and naive at the start but she grows and develops with age. She doesn't sit back and let things happen to her, which I like.Honestly, this was a delight to read. I can't believe I waited so long.Blog | Leafmarks | Facebook | Twitter | Instagram | Tumblr"}, {"userName": "seak", "userReviewDate": "Apr 28, 2011", "userURL": "http://www.goodreads.com/user/show/1805180-seak", "userReview": "[This is a short story and addition to the 30th anniversary edition of the book. I'm never a fan of these sorts of things. To be honest, it just messes with the purity that is the original and can leave you with a sour taste in your mouth. The Matrix (the movie) should have been left alone along with things like Ender's Game and Dune. It really is okay to leave people with a sense of wonder and imagination at what could have happened instead of milking things for all they're worth.With that said, this wasn't a terrible addition, it was just unnecessary. It deals with the time after the ending of The Princess Bride when everyone lives \"happily ever after.\" The first chapter is \"Fezzik Dies,\" so already you're world is shattered. Buttercup's baby is stolen and Fezzik is chasing the culprit, but then it never really goes back to this, it goes to a couple chapters that only slightly fit together (even admitted by Goldman), but which explains how they get to someone running away with Buttercup's baby.Before this story is an explanation of how this story came about (in the fictional way, not an actual explanation) and it involves how Stephen King was actually going to do the abridgement, but left it up to Goldman. I guess I just don't get these parts.I'm sure this is better for people who have read the story ages ago and come back to something new, but reading them all together just messed with the original too much. (hide spoiler)]"}, {"userName": "Lola  Reviewer", "userReviewDate": "Jun 17, 2016", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "I must say that the humour in this book is quite special.\n ‘‘I must court her now,’’ said the Prince. ‘‘Leave us alone for a minute.’’ He rode the white expertly down the hill.\nButtercup had never seen such a giant beast. Or such a rider.\n‘‘I am your Prince and you will marry me,’’ Humperdinck said.\nButtercup whispered, ‘‘I am your servant and I refuse.’’\n‘‘I am your Prince and you cannot refuse.’’\n‘‘I am your loyal servant and I just did.’’\n‘‘Refusal means death.’’\n‘‘Kill me then.’’\nIt’s a comedy, with a scoop of tragedy, and an adventure at all times. Not simply an adventure, a journey.Danger awaits the characters at every chapter and the obstacles they are faced with and their ways of dealing with them are peculiar.Even if you try to, you will not be able to take the story seriously. More than half of the characters are sheer idiots – yes, even Buttercup is naïve, unoriginal and, very often, stupid.But that’s, to some extent, normal. One cannot write a comical story without having silly characters in it.There are many overused tropes in this fairytale: a damsel in distress, beauty beyond imagination, a rescuer, villainous villains, villainous villains who lose their villainy and the ‘‘true love’’ theme.The first half is a lot of fun. With a humorous, one-of-a-kind narration, William Goldman entertains us (or at least tries to) throughout the book. The only problem is that the story slows down past the half mark. It’s less hilarious past that point, also. A dark humour stars to appear, and it’s up to you to accept it or not.I was not a fan of it. Or the way the author decided to wrap things up… to rescue the princess. What I can say is that the first half is incredible and the second half very different (but for me, not in a good way).Furthermore, while Westley seems like the perfect gentleman/lover/man/husband at first, he has real issues. Not only does he hit Buttercup, but he also orders her around, brusque as a soldier. I cannot say I admire him or the couple in general. Beauty is such an important theme in this novel it’s hard to see what else Westley may see in Buttercup. We’re left to speculate, because it is not as if they have tons of conversations.To sum it all up, the love story did not convince me, but the characters are interesting to follow around and I truly appreciated the originality of the narration.Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Stephen", "userReviewDate": "Nov 15, 2008", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "5.0 stars. HOW AMAZINGLY GOOD IS THIS BOOK YOU ASK?....so good it is almost\nThis is a literary treasure and one that I can not recommend more highly. Let me start by saying that prior to reading this book I had probably seen the movie version a dozen times or so and ABSOLUTELY LOVE IT!! I only mention this so that you know where I'm coming from in case you are not a fan of the movie as I think if you like one you will like the other and, conversely, if you didn’t like the movie, the book may not appeal to you as much. As for the book, I was AMAZED at what a superb adaptation of the novel the movie was. Along with the Lord of the Rings trilogy and No Country for Old Men, this may be the best adaptation of a classic novel that I have ever come across. This may lead you to ask whether it is even worth it to read the book given that much of what is in the book is on the screen. My answer to that would be a resounding YES!! \nFirst of all, the book is as much fun as the movie and the tone of the writing is unique, playful and very funny. Despite knowing the plot of the book intimately, I found the reading experience to be fresh and new. I am going to assume that people reading this have seen the movie, read the book or at least have an understanding of the basic plot. If not, the book description and other reviews do a very good job of explaining it. Instead, I thought it might be helpful to mention those parts of the book that were not included in the movie or that I thought the book’s treatment was superior (i.e. Book is Better) and those aspects of the movie that I thought were superior to the source material (i.e. Movie is Better). BOOK IS BETTER:1.\tPrince Humperdinck’s Zoo of Death (not mentioned in the movie and I thought it was interesting and gave great insight into the character).2.\tThe Book does a much better job than the movie in describing Prince Humperdinck as a truly evil person and thus a top notch villain. 3.\tThe book contains a whole Chapter on Inigo Montoya that provides details of his childhood and his Father’s original encounter with the Six Fingered Man (this is dealt with in a very brief conversation in the movie). I really enjoyed the expanded version.4.\tThe book also contains a whole chapter on Fezzik and shows his childhood and early years. This was excellent and I really liked learning about his trouble in adapting to deal with his enormous size. 5.\tThe beginning of the book describes how Buttercup becomes the “most beautiful woman in the world” and the fate of the women in front of her. This is absolutely HYSTERICAL. I wish they would have found a way to incorporate this into the movie because it was very enjoyable. 6.\tAll of the interruptions in the Narrative where the author is explaining why he cut out whole sections of the original Morgenstern novel (the fictional novel of which this novel was supposedly the abridged “good parts”) were very funny and made the book a unique experience. MOVIE IS BETTER:1.\tI must begin with Miracle Max. The book is really good, but Billy Crystal was absolutely AMAZING (as was Carol Kane who played Miracle Max's wife). Crystal’s dialogue in the movie was better than the book and is a great example of making the original even better without messing with the feel of the story. 2.\tWallace Shawn as Vizzini (pictured above) gives a truly great comic performance and made the Movie version of the character even more fun then the book version. All I kept hearing in my head whenever he was on stage in the book was him shouting INCONCEIVABLE!!3.\tSimilarly, Mandy Patinkin as Inigo Montoya is another example of amazing casting that made the on screen version of the character even more fun than the book version. 4.\tThe final scene between Westley and Prince Humperdinck was more fun in the movie than in the book. Bottom-line, if you have enjoyed the movie but have not read the book, I strongly recommend it. Similarly, if you have read the book and have not seen the movie, I strongly recommend that as well. Both are terrific."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Okay, I like the movie better than the book. I mean I love watching all of my characters! So There! Anyhoo, I'm adding some pictures from the book. There are a lot of them but I'm just going to add a few. I thought they were wonderful. On the inside front and back pages there is a map but I only added one part of the map so you can get the idea =) Happy Reading! Mel ♥MY BLOG: Melissa Martin's Reading List"}, {"userName": "Icarus", "userReviewDate": "Jul 24, 2007", "userURL": "http://www.goodreads.com/user/show/180472-icarus", "userReview": "I am one of the few people in the world who does not think the book is better than the movie here. There is an undercurrent of bitterness in this book that I find off-putting. I am given to understand by a friend that those elements--i.e., the autobiographical stuff in Goldman's own persona--are actually fictional. But I found that they soured my enjoyment of the story they framed. I couldn't enjoy the writing of a writer who seemed as misanthropic and hateful as Goldman came off to me. TPB is still a great book--better than three stars, but I couldn't quite bring myself to give it four.Stick to the movie. It has the opposite problem, but you can always fast forward through the saccharine Fred Savage bits."}, {"userName": "Anzu The Great Destroyer", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "I’m sorry Kate’s favorite book, but I must destroy you. Two stars. Yep, I am one of those people. Cynical. Have no heart. Have no good taste in books. Just want mindless action and independent sword-wielding women as main characters. Don’t like overpowered men. Nor women, for that matter. Don’t believe in love at first sight. Hate damsels in distress. Hate perfection. You get the point.Do you see why I didn’t like the book? Do you? Well, if you’ve read it you probably do. If you didn’t, then go ahead and read it. I dare you to read it.The Princess Bride started out as an entertaining read. Bill Goldman’s part in the story was a pleasant surprise, even though he didn’t seem like the kindest person out there, I found myself immersed in the story. When the so called “introduction” ended and the actual Princess Bride story began... well, my enthusiasm started to decrease. The more I read the more it decreased.“What were you expecting from a book called “The Princess Bride”?” my husband asked. Well, I thought it may be a parody of all those cheesy romance books that are way too popular than they deserve. Maybe I thought it was a new take on those romances, something that would make me say “Gee, this is one good romance novel. I sure feel silly for bashing the genre so much in my reviews.” I wanted more or less the same true-love-conquers-all story but with better characters. Yes, the characters are the ones who made me dislike the book. My main problem is Buttercup. Oh god how can I express the amount of hatred I feel for this girl? A gif? Would it be appropriate? Sure, why not?She was such a fucking idiot! I can’t believe it. I feel sad to know that the great super-ninja assassin Westley fell for her because she’s so hawt. Don’t worry, I hate Westley just as well, but the thought of everyone wanting to get Buttercup only because she’s incredibly beautiful makes me very angry. Yes, I know things were like that back then. Yes, I know this is not a new idea. Too many books have this “fairest of them all” crap. But that doesn’t change the fact that it makes me angry. Foam at the mouth. Rage. Want to tear things into pieces and then burn them. Yes, burn everything.\n\nButtercup was what he thought of. Her autumn hair, her perfect skin, and he brought her very close beside him, and had her whisper in his ear throughout the burning: \"I love you. I love you. I only left you in the Fire Swamp to test your love for me. Is it as great as mine for you? Can two such loves exist on one planet at one time? Is there that much room, beloved Westley? . .\n\nBarf.I can swallow this “fairest of them all” shit if the character has a purpose other than making beautiful, and hopefully male, babies.Well.. Buttercup didn’t. Surprised? No, you shouldn’t be.  \"Woman,\" Westley roared, \"you are the property of the Dread Pirate Roberts and you . . . do . . . what . . . you're . . . told!\"  (Westley is the Dread Pirate Roberts so… yeah. There you go.) Westley… well my main problem with the dude is that he is overpowered. Sure, the ending made up for it, he did end up being a zombie and all that (ick, try kissing him now Buttercup) so he is not as perfect as one would think. Nice try, Goldman. Nice try.No. The dude is still too overpowered. He is a wannabe ninja who can master any art on his own and can train his mind into standing the most intense of pain. Take that sensei! No one can be better than the all-awesome Westley! NO ONE!!\n\n “Which pain will be least endurable? The physical, or the mental anguish of having freedom offered if the truth is told, then telling it and being thought a liar.\" \"I think the physical,\" said the Prince. \"I think you're wrong,\" said the Count. Actually, they were both wrong; Westley suffered not at all throughout. His screaming was totally a performance to please them; he had been practicing his defenses for a month now, and he was more than ready. \n\nDude. Two words. Get real.I think the reason why I couldn’t enjoy this is the fact that I’m old and bitter. Ok, not as old as you would think, I’m merely 25 atm, but I think I would have enjoyed this more at an earlier age. The Princess Bride needs a decent amount of innocence in order to strike home.On the other hand, I wouldn’t let any children near it. It’s slightly too violent and full of fucked up people. But that’s just me."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/EVERY STAR THERE IS TO STAR!!!!!!\nYeah, a little bit. It’s also the best book in the history of ever. Sure it has a little kissing\nbut it also has pirates\nand bad guys\nand swordsmen\nand giants\nand R.O.U.S.es\nI’m not writing a synopsis. I’m not writing a review. I’m just telling you if you have not already read it, read it now. You ask: “What if I don’t like it????” INCONCEIVABLE!\nIf you read it, hate it, and have the desire to 1 Star it or say bad things, you should probably unfriend me first. I might be inclined to light your ass up. Just kidding. Maybe.\n\n “Come my love, I'll tell you a taleOf a boy and girl and their love storyAnd how he loved her oh so muchAnd all the charms she did possessNow this did happen once upon a timeWhen things were not so complexAnd how he worshipped the ground she walkedAnd when he looked in her eyes he became obsessedThis love was stronger than the powers so darkA prince could have within his kingdomHis spells to weak and steal a heartWithin her breast but only sleepingHe said \"Don't you know I love you oh so muchAnd lay my heart at the foot of your dress?\"She said \"Don't you know that storybook love'sAlways have a happy ending?\"Then he swooped her up just like in the booksAnd on his stallion they rode awayMy love is like a storybook storyBut it's as real as the feelings I feelMy love is like a storybook storyBut it's as real as the feelings I feel\"\n\n©Mark Knopfler"}, {"userName": "Sarah", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/45261627-sarah", "userReview": "Prince Humperdinck of Florin, an adept hunter but terrible human being, wants to start a war with the neighboring, equally tiny, kingdom of Guilder. To this end he schemes to marry a beautiful peasant lass named Buttercup, market her as Florin’s sweetheart, have her assassinated, and frame Guilder. In these machinations he is assisted by Count Rugen, a sadist obsessed with measuring pain.A trio of mercenaries—Vizzini the delusional windbag “dizzying intellect” from Sicily, Iñigo the master Spanish swordsman, and Fezzik the giant Turkish wrestler—are recruited to stage Buttercup’s abduction and dispose of her in the general neighborhood of Guilder. But as they traverse the Cliffs of Insanity, they are pursued by the Dread Pirate Roberts, a black-clad masked man whom no giant fist, well-wielded blade, or pompous brilliant mind can stop.Why is Buttercup so important to Roberts? Is he connected to Westley, Buttercup’s farm-boy sweetheart who sailed away years ago to seek his fortune?William Goldman’s novel, which satirizes old-fashioned swashbucklers and merrily bulldozes the fourth wall every other page, was published in 1975, but largely overshadowed by the 1987 film adaptation, wherein Goldman wrote the screenplay of his own novel. A central conceit of the story is that Goldman’s work is a mere abridged version of a longwinded epic by the fictitious S. Morgenstern. The layers of meta-commentary can feel a bit stifling; luckily the film dispenses with Goldman’s “scholarly” digressions, using a grandpa reading to his grandson as a framing device instead.The book is not quite as family-friendly as the movie. In one of the many forewords—this book has as many forewords as The Return of the King had endings—Goldman finds himself chatting up a bikini-clad woman one-third his age while he’s supposed to be buying his young son a birthday present (both the woman and the son are fictional).Then in the epilogue, “Buttercup’s Baby,” we see Buttercup teasing Westley into bed with her. It’s not graphic or salacious at all—quite tame by adult fiction standards, and substantially less horny than many a modern YA—but stuff like this is intrusive and weird when you remember that people show the movie to six-year-olds.Finally, while I thoroughly enjoyed Goldman’s asides at first, they can seriously disrupt the story’s flow at some points and become a chore to slog through. The multiple forwards are too long, especially combined. The Hollywood secrets and Morgenstern gags are hilarious in moderation, but I think he overused them.The funniest material by far is in the story proper, almost all of which made it into the film:\"True love is the best thing in the world, except for cough drops. Everyone knows that\" ~Miracle Max (GIF unavailable)Also, Buttercup’s horse is named Horse. Goldman tells us she wasn’t very creative.The book I recommend for people who love the movie and are very patient.The movie I recommend for everyone. The jokes work beautifully on screen, and every character is perfectly cast. Watch it today!"}, {"userName": "Lizzy", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/30575403-lizzy", "userReview": "“Good night, Westley. Good work. Sleep well. I'll most likely kill you in the morning.”\nJust a glimpse of  The Princess Bride to wet your appetite. Wow, I loved it! The book is about true love and adventure. It has everything, as William Goldman describes in the beginning: \n“Fencing. Fighting. Torture. Poison. True Love. Hate. Revenge. Giants. Hunters. Bad men. Good men. Beautifulest Ladies. Snakes. Spiders... Pain. Death. Brave men. Cowardly men. Strongest men. Chases. Escapes. Lies. Truths. Passion. Miracles”.\n Despite setbacks and misfortune along the way, there is a feeling that everything will turn out all right in the end, and it does. But it’s also about friendship. Inigo, the greatest swordsman in the world, and Fezzik, the gentle giant that loved rhymes, are great! The scene when they go down the Zoo of Death together is memorable and shows how superb a writer Goldman is. \n“Two things happened:(1) The door, quite clearly, locked.(2) Out went the candles on the high walls.\"DON'T BE FRIGHTENED!\" Inigo screamed.\"I'M NOT, I'M NOT!\" Fezzik screamed.”\nSo yes, read The Princess Bride and see the movie. Maybe even better than the book, hard to tell, as I saw it a long time ago. But it’s worth a rerun!Some other quotes I loved:\n“Now what happens?\" asked the man in black. \"We face each other as God intended,\" Fezzik said. \"No tricks, no weapons, skill against skill alone.\"\"You mean you'll put down your rock and I'll put down my sword and we'll try to kill each other like civilized people, is that it?”“People don't remember me. Really. It's not a paranoid thing; I just have this habit of slipping through memories. It doesn't bother me all that much, except I guess that's a lie; it does. For some reason, I test very high on forgettability.”\n And some more:\n“Love is many things none of them logical.”“Look. (Grow-ups skip this paragraph.) I'm not about to tell you this book has a tragic ending. I already said in the very first line how it is my favorite in all the world. But there's a lot of bad stuff coming up, torture you've already been prepared for, but there's worse. There's death coming up, and you better understand this: Some of the wrong people die. Be ready for it. This isn't Curious George Uses the Potty. Nobody warned me and it was my own fault (you'll see what I mean in a little) and that was my mistake, so I'm not letting it happen to you. The wrong people die, some of them, and the reason is this: life is not fair. Forget all the garbage your parents put out.” \n___"}, {"userName": "Echo", "userReviewDate": "Oct 01, 2007", "userURL": "http://www.goodreads.com/user/show/437515-echo", "userReview": "I feel the need to gush. I've set aside the many books I want to read for the moment in favor of rereading this one. I loved it when I read it way back in about the sixth grade, so I thought it was time I give it another shot.As much as I loved it as a kid, I love it more now. Maybe because I can appreciate it on different levels. I'm only about halfway through on my reread, but I've come to the conclusion that Goldman is a genius. The story, characters, and dialogue are impressive enough, but then you add in the whole bit about Morgernstern. I mean, here Goldman wrote this amazing story, and then he makes up a story about another man who wrote the story. Then he makes up a fictional story about his father reading him this story written by someone else, and later about his process of \"abridging\" the story. He even makes up a fictional wife and son who play their own parts in this. He throws in asides written by himself, and asides written by Mogernstern, and asides written by himself about the asides written by Morgernstern. He claims to have written a reunion scene that readers can request to have sent to them by the publisher, and when people did write in for it, Goldman sent them back a letter all about the legal reasons he could not send them the scene - all fictional, of course. (The man had me going for years. I read this thing when I was in sixth grade, mind you. I didn't realize there was no S. Morgernstern until I was in college.)Anyway, while I was absolutely enthralled with this book, it occured to me today that I would put it on par with some of the greats, like Twain. The literary devices, the story, the wit, the satire (I think he's even satiric regarding satire itself) - I don't care if it got turned into a silly movie with a cult following*, I think this one of the few modern books I've read that I'd call Literature.Plus, you know, it's also an amazing story. Zoo of Death, the most beautiful woman in the world, the Dread Pirate Roberts, a prince plotting murder to start a war, a hunchback criminal mastermind, a giant, the greatest swordfighter on the planet, true love, revenge . . . who doesn't love that sort of thing? The man is a genius.* No disrespect of the movie intended. It's good. Mind you, it was the first movie I'd watched that I'd read the book first, and it devastated me. I mean it absolutely broke my heart. None of the charactes looked right. Everything was changed. The sharks were turned into eels. This person spoke a line meant for that person. Things were left out. It was all wrong. It just wasn't the book and I didn't like it. I've resigned myself to it since then, and admitted that yes, the movie is good and I forgive it it's shortcomings. It did the best it could. The movie can't help it it's not as amazing as the book. There are so many things that just can't be translated to film, and there's no help for it."}, {"userName": "MacK", "userReviewDate": "May 12, 2008", "userURL": "http://www.goodreads.com/user/show/164338-mack", "userReview": "I'm a little biased when it comes to this book. Yes, I saw the movie first and it made me happier than anything I've ever seen before or since. Yes, I do consider how much a person likes The Princess Bride before determining how good a friend to be with them. (I don't insist on it, but it can queer a good friendship)I'm not alone in this, but I do share a similar affinity for the book, despite discrepancies that may make others blanche. And even for me Fezzik will always be a Frenchman and not a Turk, and Goldman's \"Zoo of Death\" will be forever confused with \"The Pits of Despair\" but these are minor points.The fact is that Goldman is a hell of a writer. The movie is great because it uses his screenplay wonderfully. The book is fantastic becasue he employs all his talents. He is a master of dialogue (what else would you expect from a man with two screenplay Oscars?), he details setting and character with a few quick flashes of his pen, and he has enough acerbic wit to have created what is, at once, both a brilliant satire of fairy tales and a compellingly readable fairy tale in its own right.One of the surprising things is that Goldman sticks so doggedly to the conceit that there is an S. Mogenstern, a country called Florin, and that the novel is at once really \"abridged\" rather than written by him, and that everything actually does happen.That becomes a trifle irritating, you almost want the man to admit that: \"yes, I am the man, I did write something that is beloved and adored and will be passed down from generation to generation, just as I claimed this book was passed down to me. Only, it is all me. My imagination, my genius, bow down and praise me!\"But he doesn't. And that, though irritating, is actually one of the best things about the book. Goldman himself suspends his disbelief and forces us to do the same. Imagination takes hold at the beginning and our immersion in it makes every page, every quip tantalizing to behold and easy to savor."}, {"userName": "veronica", "userReviewDate": "Jun 16, 2008", "userURL": "http://www.goodreads.com/user/show/768443-veronica", "userReview": "I know there are people who LOOOOOOOVE the film, \"The Princess Bride.\" While I thoroughly enjoy the movie, I think I may only LOOVE it. I mean, Inigo Montoya is FABULOUS and I really really dug Westley, and the pwiest was vewwy vewwy funny!!!! So, when someone was kind enough to lend me the book, I had relatively high expectations. Now, don't get me wrong, I wasn't disappointed in The Princess Bride, but I just wasn't thrilled or moved to laugh till I cry (which the movie sometimes can).First of all, let's get all English-major on this, and talk about the meta-layered frame narratives going on in this novel. Holy cow! First of all, keep in mind that the book's title is The Princess Bride, S. Morgenstern's Classic Tale of True Love and High Adventure. Basically, what Goldman does is this -- he tells his readers that the book they are holding in their hand (his book) is actually the abridgment of the original PB written by this invented author, Morgenstern. As a child, says Goldman (within the novel, not in the introduction or anything), his father read PB to him aloud, and the boy fell in love with the book. When, as a father himself, he attempted to pass on this beloved childhood novel to his very fat and very spoiled son, he is shocked to find out that the boy can't get into the book -- because it is too long and too boring! It turns out that Goldman's father, when reading to the boy, had skipped hundreds of pages of political and historical satire! So, when Goldman's own son attempted to read the book, he found it overly dry and long. This leads Goldman to undertake the task of abridging PB and basically re-publish the book as his father had read it to him -- just the adventure plot and the romance.While bearing this in mind, you must remember that Goldman is making all of this up. There is no Morgenstern, no original PB. The project in itself is quite interesting and it had me excited at reading a book that really messed with the reader's perception of narrator, of what's real and what isn't. Goldman often includes long parenthesis in which he bitches about his frigid wife or his snotty son, or over some of the stunted romantic liaisons that he failed at. All in all, I must say, that the actual narrator of PB comes off as an ego maniacal and pathetic loser who happens to have been the screenwriter for some awesome movies (think \"Butch Cassidy and the Sundance Kid,\" \"Misery.\" (One interesting aside is the confrontation between Goldman and Stephen King over supposedly abridging the sequel to PB, called Buttercup's Baby, a conversation in which they discuss Kathy Bates' performance in \"Misery.\")Once you get over the self-loathing and self-loving that the narrator is indulging in while writing this book, you get to the actual storyline. Westley hearts Buttercup, but she is to be married to Prince Humperdink. Meanwhile, Inigo Montoya searches for his father's six-fingered murderer, Fezzik plods along like a dumb giant, and about 300 pages into the novel, these 2 team up with Westley in an attempt to steal Buttercup away from Humperdink.The good news is that some of the movie's best scenes are taken verbatim from the book. Inigo Montoya is as fabulous here as he is in the movie. Actually, even more so, because you get a pretty in depth history of his childhood, his training, his thought process. He is by far the most interesting character in the novel.The scene with Miracle Max is also as rewarding as it is in the movie, and the funniest scene in the book is the marriage (mawwiage) scene.Still, a couple interesting scenes do not a great novel make, and for once, I may have found a book that I enjoyed less than its film adaptation! Ring the bells and sound the alarms!!Ah, and I see God is agreeing with me! I have just looked out of our great scenic window, and the most BEAUTIFUL rainbow has just appeared.To wrap up, I must say that I was left a bit deflated by The Princess Bride. It has a little zing, a little sappy romance, and a little adventure, but overall, I think I approached it about 15 years too late. Had I read it when I was 10, I'm sure it would still to this day be one of my favorites.P.S. Take one \"Hello. My name is Inigo Montoya. You killed my father. Prepare to die.\" Repeat until it becomes unnerving. Result -- the best scene in the novel and the film, by a landslide. Oh, Inigo. I love you. And in this book, only you. I should pull a Goldman and abridge The Princess Bride and leave in only Inigo's part, and add on to his story line. Food for thought!"}, {"userName": "Nicole", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/40997852-nicole", "userReview": "This book was so fun!! I actually believed it's an abridged book, Goldman totally got me! I liked the way he wrote this book. The silly humor, the amazing characters, the wonderful story, everything was so damn entertaining!!"}, {"userName": "Montzalee Wittmann", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/32532051-montzalee-wittmann", "userReview": "The Princess Bride by William Goldman and read by ROB REINER, what could be better than that! I loved the movie which was so corny and funny that I think is certainly a classic by now. I have watched it a hundred times and all my kids have grown up with it and one of my grown sons has a shirt with a 'My name is Inigo Montoya, you killed my father, prepare to die\" name tag on the tee. It is too funny. What is funny is that everyone knows what it means when he wears it! The book is just as great if not better, and with Rob Reiner reading it is keeps the great hilarity going. The giant rats, the craziness, the love story, the sword play, the silliness just goes on. It was refreshing to hear. I normally don't listen to books because I read so fast, I can have six books or more finished in the time it takes to finish an audio but I wanted to hear it. So, I rented it from the library and played it around the house. I don't regret it at all. I giggled and giggled. I read the book YEARS ago but it had been soooo long ago so I just wanted to 'read' it again. Thanks Mr Goldman for the funny book and Mr Reiner for keeping it that way!"}, {"userName": "Vane J.", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/19590155-vane-j", "userReview": "I didn't even know what The Princess Bride was until last year, and I wouldn't know what it is if it weren't for this popular meme:Oops, sorry! Wrong meme!That's more like it. Now, what was I saying?Hello, this is sensible Vane interrupting ramblish Vane. She tends to talk a lot without getting to the point, so I decided a quick intervention would do good.What she was going to do was to tell you a very detailed story of how she came to know the book she was supposed to review and then she would go on saying things like \"it was funny, blah, blah, blah\" and in the end, nothing would be said. So I, sensible Vane (SV for short), am going to take the role of abridging this review and so you don't need to read the... boring parts.Ha, talking about rambling, were you? SV thinks she's so wise with her decisions. As if anyone cared. Anyway, continuing with the review (and skipping the personal stories since they bore insensitive sensible Vane so much)...You know you're rambling again, do you? It should be me the one who reviews the book.Shut up, okay? We're not getting anywhere with you interrupting me every second. So anyway (again), I just had to read the book where the quote from the meme above came from.What I didn't expect was for it to be so damn entertaining. It is supposed to be about true love and adventure, but honestly, I think it was about more than just that. For instance-And there she would tell you how satirical it was at points, how mocking the author was, and how she enjoyed, oh so very much, his interventions in the story and how-Well, it's true. I did enjoy whenever William Goldman interrupted the story. He always had sarcastic comments to make. Like the one about Moby Dick:Just as the chapters on whaling in Moby-Dick can be omitted by all but the most punishment-loving readers, so the packing scenes that Morgenstern details here are really best left alone.But that's not the only thing that made me enjoy this book so much. It was also-It was also that the characters were full of life, they were quirky and funny, ramble, ramble, blah, blah. Really, is it necessary to say all that? Isn't a 4 stars enough for saying you liked the book?But I wouldn't be reviewing it if a simple 4 stars were enough for me, and you wouldn't have said a few lines above that you wanted to review it...*silence*Anyway, as useless as this review might seem, I think we've said it all, but in case we haven't, I'll point it out:• There's always lots of things going on. The action never ends.• The interactions between the characters are funny as hell.• William Goldman's interruptions were amazing, especially when he got sarcastic and started talking about his experience on reading The Princess Bride with his father. (Because obviously Morgenstern wrote it).• Life isn't fair.Couldn't you have done that damn summary ages ago?!?!Yes, I could have, but what was the fun of it? This review, of course, wasn't supposed to be serious, yet it was hella funny to write, especially since I indeed was battling between making it like my usual reviews with quotes (but this is a timeless classic, and those don't need that kind of reviews), or leaving no review at all.I'm glad I finally read this book, and I'm even more glad that I liked it this much. I feel sorry for not reading it before (thank to my isolated life in a cave), but hey, now at least I can say I read the book before watching the movie, can I?"}, {"userName": "Carmen", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/25353295-carmen", "userReview": "ETA: Re-read 01/28/2015Wow, I haven't read this book in about five years and I forgot a lot of things about it. For one thing, this time I read the 30th anniversary edition. For another thing, I read it cover to cover instead of skipping over Goldman's \"this is my life\" crap. I don't like reading his thoughts.I'm not as enamored of this book as I was when I was younger (I used to have the whole first chapter (The Bride) memorized). Things strike me now that didn't in, let us say, more innocent years. :) For one thing, Westley slaps Buttercup's face, and I just can't brook that kind of behavior. As my good friend always says, \"There's scum, and then there's men who hit women.\" Yeah. Especially with all the \"true love\" stuff thrown in.So, we've established that Westley is the kind of man scum who lays hands on a woman, and we've got problems with Buttercup herself - she's like a beautiful brainless Barbie. And she's stupid and selfish and basically useless in any kind of crisis, I was so angry with her for leaving Westley to the wolves (metaphorically) when they get out of the Fire Swamp. But at least she suffered greatly for it in the days leading up to her marriage to Humperdinck. It seems like Westley got off scot-free.Such a big deal is made out of Buttercup's beauty that it makes me uncomfortable. If she was plainer, would Westley have fallen in love with her? There's not much to her besides being gorgeous. She's not even particularly kind or noble and she has no skills. It makes me upset in books when it is obvious a person is \"in love\" with another person solely on the basis of their physical appearance. I wish I could say there was more to Buttercup and Westley than this, but there really isn't. And she only loves Westley because he's good-looking and obedient.Lastly, it's a satire. I should lighten up, right? LOL Well, as you've noticed, this is a five-star book for me. Even though it's lost something since I first read it, it's always been a beloved book of mine and I own a yellowed, battered, well-loved copy. It's always going to have a special place in my heart.ETA: 02/08/2015 Sorry, I can't keep this on my \"favorites\" shelf or keep the five-star rating. It's not the book I thought it was years and years ago."}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "Dnf at 60%.How do you even begin to review a much-loved classic when you didn’t even manage to finish it? I tried. I really tried to like this book. But no, it just wouldn’t happen. To think this is Kate Daniels’ favourite book! To think the Beast Lord himself tells her “as you wish” at the end of Magic Burns! Why oh why couldn’t I like this book?! Oh well, I guess it can’t be helped.So, let’s start from the beginning. I had a problem with this particular edition from the very first pages. First we have the introduction to the 30th edition: I read it and thought “wow that was tedious, this Goldman is pretty full of himself isn’t he?” Okay, so here I am ready to enjoy the story. But no, not happening. First you have to read the introduction to the 25th edition. Seriously? The first introduction wasn’t annoying enough so the publishers decided to add a second one? Oookay… I know I should have skipped it but I didn’t: more presumptuous blabbering courtesy of Goldman. Who does this guy think he is anyway?! I must admit, I wasn’t in the best disposition when I started reading the actual story, which probably didn’t help. Soooo, I finally get to the story, yay! Except not. Before you read the story you have to suffer through Goldman’s explanation as to why he supposedly decided to retell Morgenstern's tale. I understand this is part of the story too and it’s not completely uninteresting but at this point I just wanted to read to the freaking Princess Bride! No more Goldman talking about Goldman! And so the story begins! Surprising as it may sound, I loved it at first. Well, I loved the first chapter. Then it all went downhill pretty fast, or, as we French put it, it collapsed like a soufflé. To put it plainly: I was bored to death (I said that already didn’t I?) and I didn’t like the characters at all. Buttercup: beautiful (yes I got that the first time you wrote it, no need to re-hash every two seconds) and utterly useless. I like my heroines badass and butt-kicking (too much UF I’m afraid) so Buttercup and I were on a collision course from the start. Westley: is this guy for real? Doesn’t he have a single flaw? I mean, how perfect can you get? Boring, boring, boring. Come to think of it, what bothered me most here is that the whole thing was so completely, absolutely cliché from beginning to end (which is quite ironic when you think of it, since the story is supposed to be a parody of the genre). I guess I should have thought twice about reading the book because it is, after all, a fairytale. Strangely enough, I was expecting a fairytale with a twist, something that would make it less… fairytale-y I guess. Don’t know why. I did see the movie when it first came out and enjoyed it (as far as I can remember). Then again, I was only a teenager at the time and the whole damsel in distress thing might have appealed to me then. So there you have it. I didn’t like it. I don’t even know why I’m giving it two stars since I didn’t even finish it. Oh well, I might not be a fairytale kind of girl but I too have a heart. Make of it what you will."}, {"userName": "Robin", "userReviewDate": "Feb 15, 2009", "userURL": "http://www.goodreads.com/user/show/1572236-robin", "userReview": "What a charming read. This is one of the few books where I saw the movie first then read the book. I think William Goldman's book was largely \"unknown\" until the movie came out.Like Shawshank Redepmtion and Stand by Me (Based on the novella The Body) this is one of the most accurate book to screen apdaptations. It is almost verbatium from the book and the few variations (Zoo of Death rather than Pit of Despair) have no real impact on the story.Being as I edit fantasy (visa-vie my husband's books) I do often look for and find \"plot holes\" and there is a big one in this story. When Inago hears the torment cry of Westley he assumes it this the man in black because he was enganged to Buttercup but of course he had no reason to suspect anything between the two of them them. Even so I see this as just a kind of \"cool thing I saw\" it did not diminish the book for me in anyway.Now for the big difference between the book and the movie. The book is littered with \"asides\" from William Goldman where he discusses parts in the original Simon Morgenstern version that he omitted to \"keep only the good parts\". He presents his book as an \"abridgement\" of Morgenstern's original and both praises and condems Morgensterns original work. He goes on to give tidbits such as a \"reunion scene\" that he wrote but could not include because his editor felt it was wrong for someone abridging someones elses work to add anything.If you have any of the \"aniversary editions\" (I read the 30th) there are other bonus materials such as recounts of the numerous law suits between the Morgenstern Estate and Goldman and a dispute where they were trying to get Stephen King to write the Sequel \"Buttercup's Baby\" instead of Goldman. Goldman even gives us glimpses into his personal life talking about both his failed marriage and his son (and how much he had to go thorugh to get him a copy of Morgenstern's Princess Bride for his 10th bithday).I'm sorry to say that I fell for Goldman's farce hook, line and sinker. It was only after I tried to find Morgenstern's original work that I discovered that everything in The Princess Bride is fiction including all the asides. That made me appreciate the work even more. The lengths to which Goldman went - (even inventing a familiy and various other characters, editors, lawyers, agents, etc was great. I particularly liked that he told people to write into the publisher to receive a copy of the \"missing reunion scene\" only to take the farce further by sending them letters that he could not comply due to pending litigation!The one and only disappointment in this \"farce in the bonus material\" is the horror which is \"Buttercup's Baby\". This is presented as yet another abridgement of Morgenstern;'s work but only the first chapter as the estate debates whether he or King will \"get the job\". BTW I'm sure King is \"in\" on this whole farse and loves it as Goldman and King have worked on several projects together such as Misery. The story is terrible and certainly comes no where near the brillance of The Princess Bride. I can see why Goldman never wrote the sequel and to be honest I hope he never does. The Princess Bride was so sublime and perfect we should be left with this and nothing more."}, {"userName": "Sarah", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/7477266-sarah", "userReview": "My first read of 2017! Starting off the year with a 5 star book! When I first finished reading this I wasn't sure whether I should give it 4 or 5 stars. While I was reading it, I was absolutely in love with it but once I finished it and thought about it a bit, I noticed a few problems with the story. The main problem I had was with Buttercup. She was the most beautiful woman in the world but she didn't have any other nice qualities. She wasn't kind, brave, smart, funny or talented, she was actually the opposite of all those things. I then had a problem with the romance because if Buttercup only had her beauty going for her, then what did Westley like about her besides her beauty? She was absolutely awful to him but he fell in love with her anyway. But while I was reading this, none of that really bothered me because I was so absorbed in the story and the book had other things going on besides the romance. I think the storytelling is absolutely brilliant. At first I was unsure about the story within a story but the way it was done was genius. William Goldman makes it seem like it's very real and that adds something really magical to the reading experience. His writing was also brilliant, it's very easy to read and everything flows very nicely. The actual story is so exciting. It's like a beautiful fairy tale with lots of action and humour. I was surprised at just how funny this book actually was. I was also super impressed by how effortlessly Goldman made the story flow. It had so many component that fitted together so wonderfully and it just really seemed so effortless. I would definitely recommend this to everyone and I would read more by Goldman. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~“I do not care about ‘the boys.’ Horse loves me and that is quite sufficient, thank you.”“Life is pain,” his mother said. “Anybody that says different is selling something.”“Life is not fair, and it never has been, and it’s never going to be.”“I got a cold wife; she’s brilliant, she’s stimulating, she’s terrific; there’s no love; that’s okay too, just so long as we don’t keep expecting everything to somehow even out for us before we die.\""}, {"userName": "Petra X", "userReviewDate": "Sep 07, 2014", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "I absolutely loved The Silent Gondoliers. It was just a perfect gem in every way, 5 stars was not enough reward for it's brilliance. With that in mind I was hyped to read The Princess Bride and not ready at all for the experience.When I lived in Jerusalem I used to leave the snowy heights in winter for the perpetual summer of the Dead Sea, the lowest place on earth, about an hour away. Swimming was impossible, the water buoyed you up, rejected you even so that body parts were impossible to keep submerged. It was such fun, an amazing experience, something really special. After that I would run for the deep pools of fresh spring water to wash the salt off my skin. You jump in and sink to the bottom. It is a shock to the brain after the floating on the Dead Sea. You can't prepare yourself for the sinking, it is like an optical illusion, but a sensory one instead. And so it was with the Princess Bride.For me, it just sank like a stone beneath the consciousness of the fun and perfection of the Silent Gondoliers. There you go. Maybe I will watch the film one day, I hear it is better."}, {"userName": "Red Panda", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/44824883-red-panda", "userReview": "Unlike the kid (author) in the italicised ('true') sections of this masterful book, I don't have pneumonia. I'm still pretty sick, though. I got a nasty case of cellulitis from a spider-bite (fuck you, Ditko and Lee!) which turned into a life-threatening bout of sepsis. I actually came close to shuffling off this mortal coil in hospital last month when the blood poisoning was at its worst! Sheee-iiit, right? Anyway, I'm happy to report that I'm past the worst of it and am now recovering (painfully slowly) at home... and this wonderful book has been a perfect sickbed read!I saw the movie a couple of times when I was a kid and loved it. I've always meant to read the book but, I'm ashamed to say, it's taken me about a quarter of a century to get around to it. Better late than never, though, eh?This book appealed to the same part of my twisted mind that loves Terry Pratchett and Douglas Adams... In fact, I'm almost certain Goldman's parentheses must have been an inspiration for Pratchett's footnotes. I honestly didn't stop laughing the whole time I was reading this; I had tears in my eyes at one point.If you like a chuckle and you're not put off by a bit of 'meta' humour and the dealing of storytelling cards from the bottom of the deck, you could do a lot worse than read The Princess Bride. I wish I hadn't waited so long!"}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Jan 02, 2010", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "This book has its moments, but I'm not sure what all the fuss is about. It's all very clever and playful and a little bit silly. But for all the originality in the telling, it really doesn't end up anywhere worth going. I did enjoy it on the whole, but I found my mind straying quite a bit thanks to a lot of \"device\" and not enough story. Said device being the premise that the story is an abridgment of a very old classic, with the \"abridger\" insinuating himself into the story to tell you about the parts he cut out. I'm surprised at the very high average rating for the book. My guess would be people loved the movie so much that they let this high opinion inflate their ratings of the book. The film is much more entertaining than the book. Goldman's work in the film industry is strongly evident in the book, and many of the joke scenes are better viewed than read."}, {"userName": "Penny", "userReviewDate": "Jan 18, 2012", "userURL": "http://www.goodreads.com/user/show/7463065-penny", "userReview": "Rating Clarification 4.5 stars.I want to start by saying that I LOOOOVE the movie, I don´t even know how many times I have seen it already. I liked the book too, very much, just not as much; I guess that over the years the movie has reached epic territory in my mind. The Princess Bride is beautiful and funny. I think that all the exaggerations and classic fantasy elements of this book are brilliant, mostly because of the way they are mocked and the way they work perfectly to create such an amazing and beautiful story. This book is the same fairy-tale that all our parents read us as kids, I just think that this one in particular was written more for the parents than for the children, and I found this absolutely awesome, reading this book was like returning to that kid we once were and enjoying all those great adventures once more.Fantastic.P.S.: I didn't like the audio book with Rob Reiner as the narrator. He narrates the whole book without changes, no humorous tones, emotions or voices for the characters, just plain reading out loud."}, {"userName": "Sandi", "userReviewDate": "Feb 15, 2009", "userURL": "http://www.goodreads.com/user/show/811687-sandi", "userReview": "I'm probably spoiled because I have seen the movie version of \"The Princess Bride\" about a gazillion times. As I read, I just pictured Robin Wright, Cary Elwes, Mandy Patikin, et al. as the characters. I even heard their voices in the dialog. That said, \"The Princess Bride\" is a brilliantly executed concept. It's really a novel within a novel as Goldman tells a fiction story about his relationship with S. Morgenstern's \"The Princess Bride\" and his path to abridging it so it only has the \"good parts\". I must admit to reading my own \"good parts\" version as I skipped the numerous introductions, including the fictional introduction to the fictional chapter from the fictional sequel, \"Buttercup's Baby\". I found Goldman's asides about the writing and publication process to be quite amusing. If possible, I would give \"The Princess Bride\" 3-1/2 stars. The basic story is wonderfully funny and romantic and exciting. But, the pages and pages of introduction and prologue and some of the asides detract from the main story. The movie keeps this stuff to a minimum, having only a few scenes of Peter Falk reading the book to Fred Savage. In this case, I believe the movie is superior to the book."}, {"userName": "Athena Shardbearer", "userReviewDate": "Aug 16, 2010", "userURL": "http://www.goodreads.com/user/show/4159427-athena-shardbearer", "userReview": "Buddy read with Shandra, Annette, Cathyrn May 24Actual Rating 4.5 stars\nThere is no room in my body for anything but you. My arms love you, my ears adore you, my knees shake with blind affection. My mind begs you to ask for something so it can obey. Do you want me to follow you for the rest of your days? I will do that. Do you want me to crawl? I will crawl. I will be quite for you or sing for you, if you are hungry, let me bring you food, or if you have thirst and nothing will quench it but Arabian wine, I will go to Araby, even though it is across the world, and bring a bottle back for your lunch. Anything there is that I can do for you, I will do for you; anything there is that I cannot do, I will learn to do. Dearest Westley, darling Westley, adored Westley, sweet perfect Westley, whisper that I have a chance to win your love.\n*le sigh*Epic stories are my favorite. Maybe its the world building, the swords and sorcery, the kings and queens, wizards and medicine men. That is something that sparks my interest, but when you add in a epic love story I'm all in. Now, this book is almost word for word the same as the movie. There are some things left out, like Fezzik and Inigo looking for Westley going through the different levels of the zoo. Prince Humperdinck and Count Rugen were darker and slimmier than I expected. Buttercup was much more annoying, not in a bad way. And Westley was perfect! I think really enjoying these characters in raw form made this book so much better than the movie. Fezzik\n\"Stupid, stupid, go and wait for Vizzini with Cupid\"? That rhymed, but where was the Cupid? \"Dummy, dummy, go out now and fill your tummy.\" That rhymed too, but what kind of instructions were those?What to do, what to do?\"Dunce, dunce, use your brains and do it right for once.\"?\n Inigo Montoya\n\"I, Inigo Montoya, do challenge you, coward, pig, killer, ass, fool, to battle.\"\"Enough of your family is dead for one day; be content,\" said the noble.\"When you beg me for your breath, then I shall be contented. Now dismount!\"The nobleman dismounted. \"Draw your sword.\"The nobleman unsheathed his killing weapon. \"I dedicate your death to my father,\" Inigo said. \"Begin.\"\nWestley\nAs you wish.\nButtercup\nThe boys.The village boys.The beef-witted featherbrained rattleskulled clodpated dim-domed noodle-noggined sapheaded lunk-knobbed boys.How could anybody accuse her of stealing them? What good were they? All they did was pster and vex and annoy. \"Can I brush your horse, Buttercup?\"\"Thank you, but the farm boy does that.\"\"Can I go riding with you, Buttercup?\"\"Thank you, but I really do enjoy myself alone.\"\"You think you're too good for anybody, don't you, Buttercup?\"\"No; no I don't. I just like riding by myself, that's all.\"\n*On a side note: I love her in the House of Cards.*I think I can leave out Prince Humperdinck and Count Rugen cause they are slimy and I do not like them! They were actually better characters in the book than in the movie. I'm glad I finally got to read this book."}, {"userName": "Tortla", "userReviewDate": "May 25, 2007", "userURL": "http://www.goodreads.com/user/show/95618-tortla", "userReview": "I can't believe I thought Morgenstern was real. Not for long, really. But still. When I discovered he wasn't I hated this book for a while.But then I reread it and it was awesome in an entirely new way. I'm still not a huge fan of the fake little tidbits that the \"abridgment\" offers, especially the allusions to Florin as a real place, but I generally just skip over those. Also, I find the story of Goldman and his fat kid vaguely depressing. And I didn't like the part about Westley wearing jeans. That's just silly. But everything else was excellent.I wonder if he's ever actually going to write Buttercup's Baby. I don't like the idea of the giant-talking-bird-thing that he mentions in the thirtieth-anniversary-edition...Maybe just because I don't like birds. They're creepy. Extra creepy if they're giant and they speak."}, {"userName": "Megan", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/3807932-megan", "userReview": "After reading The Princess Bride I realized that this was the book I needed to use to end my review drought. This book has everything you could ever possibly want in a book. There is romance, adventure, comedy, princess and princes, pirates, giants, sword fights, poison, and rodents of unusual size. Is there anything that this book is missing? It is inconceivable how good this book really is. I saw the movie for the first time when I was little. My parents had mentioned it before but I never gave it any thought, thinking it was probably just a crappy old movie. I've never been so wrong in my life. When I finally watched it, it became an instant favorite of mine. Like William Goldman, this was a story that I loved when I was sick. Like I said it had everything and the name Humperdinck always made me giggle for some reason. Alright it still makes me giggle. The movie has been a part of my life ever since. Even when I got to college it became my roommates favorite movie as well. Whenever it was just me and her home alone we would instantly put on the Princess Bride. When our other roommates would get home they would just groan and say, \"You guys are watching this movie again?\" Yeah we watched it that much. It is sad that our conversations sometimes are exclusively quotes from the movie, and the sadder part is the conversations make sense. So why if I loved the movie so much has it taken me 21 years to finally read the book? The honest answer is that I have no idea. I had picked up the book in the bookstore so many times that if I had a penny for every time I touched it I probably could have bought it a few times or got a really nice hardcover edition. Having been a lover of the movie for so long I can honestly say the book was as good, if not better, than the movie. In a way having seen the movie before reading the book made it better in a way. For example Wallace Shawn screaming INCONCEIVABLE in my head, or Mandy Patinkin delivering Inigo's famous line, and Billy Crystal as Miracle Max. Having those voices and characters in my head brought the humor in the book to another level. The whole structure of the book is interesting in itself. William Goldman writes the book as if it is an abridged novel, the original being by S. Morgenstern. He cuts out all the boring parts leaving only the \"good parts\" just like when his father read it to him when he was little. Throughout the novel we get interrupted by Goldman describing why he took out certain parts and giving himself more backstory. While sometimes these parts were entertaining, other times they were not. I'm not sure if this was just part of the person he was betraying himself as or if it was how he actually was, but he seemed very full of himself at times, especially during the introductions and the explanation of Buttercup's Baby. I didn't really care about his conversation with Stephen King about Kathy Bates, I just wanted to read the story not about how awful his wife and son were. But again some of those parts I found witty, just not very many of them. And I especially don't like how he kept teasing about a reunion scene that doesn't exist. There were parts in the book that I wish were in the movie. My favorite parts were the backstories of Fezzik and Inigo. In the movie we know the Count killed Inigo's father and you were pulling for him, but his backstory just made you root for him harder. Even though I knew the outcome I still found myself cheering for Inigo to win and being heartbroken when he gets a dagger thrown in his side and you think for a second that he is going to lose. With Fezzik we didn't really know any of his backstory from the movie. In the book we learn of how his mother and father made him fight even though he never really wanted to. He is just one of those giants that looks threatening but in reality is a big teddy bear. In the book I found myself many times wanting to reach through the pages and give Fezzik a big hug, well comparatively it would be a little hug. Fezzik and Inigo were by far my favorite characters of the novel. I like how Goldman introduces the characters. At first they are merely known as the giant and the Spaniard that kidnapped Princess Buttercup and you are rooting against them. But then you learn their names and their backstories and all of a sudden you are cheering for them. Then you have the lovers Westly and Buttercup.They possess true love, I'm sorry twu luv, which keeps them fighting for each other throughout the novel. While often times it was meant to be over the top the love scenes never came off as cheesy and gag-worthy, though the young William Goldman thought they were. But then again I'm a girl and often times like that romantic stuff. The greatest part of this book is all the wonderful one-liners. I could quote this book/movie all day long. \"Hello, my name is Inigo Montoya, you killed my father, prepare to die!\" Or my mom's favorite, \"Inconceivable!\" \"You keep using that word, I don't think it means what you think it means.\" She makes me rewind the movie if she misses that line. My personal favorite line was smaller in the book but still made me laugh, \"Mawidge.\" My roommate has told me many times that when I give a speech at her wedding it better be that cause apparently I'm fairly good at sounding like the priest! Included after the Princess Bridge Goldman included the first chapter of Buttercup's Baby. Yeah just the first chapter, thanks Goldman. I really enjoyed learning what happened to Westly, Buttercup, Inigo, and Fezzik after the end of The Princess Bride. The chapter starts out running (literally) and before you know it, it was over. I kept flipping back and forth as if by some magic more of the story would appear. I'm a bit peeved that Goldman would did this. I wanted, no I need, more of the story. Sorry to spoil it for people but the chapter is called \"Fezzik Dies,\" and that's where he leaves you. He leaves you hanging with all these questions and then is all like \"I'm sorry they won't let me abridge the rest of the novel.\" Thanks Goldman. But besides that I absolutely loved this book. It is definitely one of my favorites. If you have seen and liked the movie you need to read the book. If you haven't seen the movie you need to go and rent it right now, you have been missing out or go and read the book, you just need to experience The Princess Bride. 6/5 stars"}, {"userName": "Priscilla", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/4731097-priscilla", "userReview": "GOLDMAN, you GENIUS. You had me going there. :D Seriously, I wanted to write to his publishing company to read his version of the reunion scene.Initial Thoughts:1. \"Wait a minute... I thought this was... Okay, maybe it isn't. WAIT. IS IT REALLY? Hmmm...\" I was asking myself this while I was reading this book so many times! When I finished the book, and finally had to confirm or bust my questions, I was laughing. That's how awesome Goldman's writing is. :D And that's what I loved most about this book, the reading experience.2. LOVE all the characters. Inigo is my favourite, but I love the man in black, Buttercup, and Fezzik as well. Really great drama and intensity with all of the characters. I also enjoyed the back stories, especially Inigo's.3. Funny! The humour is actually subtle. With the combination of dramatic scenes, and thorough narrative, the humour balances everything out, making for a fun and fast read.4. So many great elements. From fencing, to revenge, torture, love, and magic, you have more than enough to stimulate your imagination.5. Seriously. I wanted to get a copy of S. Morgenstern's book. X)Love the movie adaptation as well! The tone between the two are completely different, and the film doesn't include back stories, but the dynamic between all the actors and humour is AMAZING!Check out my book and movie video review here!"}], "description": "What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams?As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, The Princess Bride. But as a grown-up he discovered that the boring parts were left out of good old Dad's recitation, and only the \"good parts\" reached his ears.Now Goldman does Dad one better. He's reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere.What's it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex.In short, it's about everything.", "title": "The Princess Bride", "url": "http://www.goodreads.com/book/show/21787.The_Princess_Bride", "average": 4.25, "cover": "https://images.gr-assets.com/books/1327903636l/21787.jpg", "reviews": 16756, "authors": [{"url": "https://www.goodreads.com/author/show/12521.William_Goldman", "name": "William Goldman"}], "type": ["Fantasy", "Young Adult", "Science Fiction Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/21787.The_Princess_Bride", "http://www.goodreads.com/book/show/313378.The_Princess_Bride", "http://www.goodreads.com/book/show/438353.The_Princess_Bride", "http://www.goodreads.com/book/show/35012246-the-princess-bride-deluxe-edition", "http://www.goodreads.com/book/show/6283231-the-princess-bride", "http://www.goodreads.com/book/show/1006502.The_Princess_Bride", "http://www.goodreads.com/book/show/34615097-the-princess-bride", "http://www.goodreads.com/book/show/9525672-the-princess-bride", "http://www.goodreads.com/book/show/17164773-the-princess-bride", "http://www.goodreads.com/book/show/21796.Marathon_Man", "http://www.goodreads.com/book/show/459744.Adventures_in_the_Screen_Trade", "http://www.goodreads.com/book/show/21777.Which_Lie_Did_I_Tell_", "http://www.goodreads.com/book/show/21776.The_Silent_Gondoliers", "http://www.goodreads.com/book/show/21780.Magic", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}