{"ratings": 6192, "userreviews": [{"userName": "Duane", "userReviewDate": "Dec 11, 2013", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "This popular Cather novel has a slightly different feel than her other novels. Godfrey St. Peter, the professor, has a cynical outlook on his future, his relationship with his wife, his two married daughters and their husbands, and especially the new house they are moving into. St. Peter wants his old house, his old study, and his memories. Especially the memories of his old student and friend, Tom Outland. The middle section of the book about Outland's earlier life in the American west was perfect Cather.The beauty of Cather's novels is in her writing and her characters. She captured a time and a slice of American life and history that is unequaled by any writer in her generation. Truly an national treasure."}, {"userName": "Teresa", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "I can't remember (and that's not saying much, as my memory's not what it used to be) the last time I dithered so long before writing a review. Perhaps it's because I ended up strongly identifying with the professor, who is the same age as I am. No, I don't have the issues with my spouse or my adult offspring that he does, but there are other things that can make one feel distant and drained (even temporarily) at such a time in life.The title notwithstanding, this book could also be called \"Outland\" (that would make it sound sci-fi, though, wouldn't it), the surname of the young man at the literal center of the book, a young man who through not much fault of his own has influenced the lives of all the characters, for good or for bad. Though I prefer those in The Song of the Lark, Cather's descriptions of the mesas and cliff-dwellings in the Southwest shine. These are healing places and in stark contrast to ineffective, even debilitating, urban areas. Outland's futile excursion into post-WWI D.C. not only illustrates the latter, but points out to us today that nothing has changed in the political arena. (To paraphrase a movie title: Mr. Smith hasn't gone to Washington yet; but when he does, we know his positive effect can only be temporary.)A transformative scene near the end reminds me of an episode with a similar purpose near the end of Bleak House. Cather not only excels with her sense of place in terms of character, she excels at getting to the heart, soul and mind of her professor."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Sep 04, 2015", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I've recently started listening to a few reading/book podcasts, now that I'm almost two years into my own. I've grown quite fond of The Readers and Books on the Nightstand, and the four hosts of the two shows have some interaction. They will all be at Booktopia this month, and each of them picked a favorite book to discuss that will hopefully also turn into a podcast episode for those of us not at the event. This was one of the books mentioned, selected by Thomas from The Readers. It's funny how books or authors come back around, because one reading friend mentioned Willa Cather after I waxed (eloquently, I'm sure) on Laura Ingalls Wilder and her effect on my childhood. This novel follows a professor in the \"midwest,\" as far as I can tell an unnamed state, but one that must be near Lake Michigan. Two of the three sections of the novel are about him, his family, their recent fortunes, and his writing space in the older home (which he refuses to leave.) The other section, the one in the middle, is the story of Tom, a student of his who died young and left money to his daughter, allowing her to live quite comfortably with her new husband. I may have rated this a full five stars had I not so recently read Stoner by John Williams, which is just a more deeply impactful novel for me. But I suspect this novel is more complex than it seems on the surface. I wonder about the relationship between the professor and Tom; at some point he mentions plans they were making together that seemed like lovers' plans. How would a novel from 1925 treat such a topic except for with great delicacy and vague mentions? The midwest is not satisfactorily written as a place anyone would want to live, but the professor and his family are clearly in their home there. The professor's wife is very much enjoying her new status and comforts of having a rich son-in-law and daughter, and the professor is being left pretty much alone in his old house as he wishes. He feels he has worn out all the newness of life, regardless. \"'My dear,; he sighed when the lights were turned on and they both looked older, 'it's been a mistake, our having a family and writing histories and getting middle-aged. We should have been picturesquely shipwrecked together when we were young.'\"and later...\"It's not wholly a matter of the calendar. It's the feeling that I've put a great deal behind me, where I can't go back to it again - and I don't really wish to go back. The way would be too long and too fatiguing. Perhaps, for a home-staying man, I've lived pretty hard. I wasn't willing to slight anything - you, or my desk, or my students. And now I seem to be tremendously tired. A man has got only just so much in him.\" and later...\"He did not regret his life, but he was indiffernt to it. It seemed to him like the life of another person.\"He also isn't much of a fan of his family, his wife as she acclimates to her new role, his daughters as they grow up with their own opinions.\n\"I was thinking about Euripedes; how, when he was an old man, he went and lived in a cave by the sea, and it was thought queer, at the time. It seems that houses had become insupportable to him. I wonder whether it was because he had observed women so closely all his life.\"\nIf the midwest seems boring, it might only be in contrast to Cather's descriptions of the landscape of New Mexico. That is the backdrop (and a character) to Tom's story of cattle driving, archaeology, and museum capers. Discussed on Episode 042 of the Reading Envy Podcast."}, {"userName": "Sue", "userReviewDate": "Feb 21, 2014", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "Willa Cather has moved into my group of favorite authors: those who create characters and worlds that are consistently intriguing, human, interesting--in the best sense of the word, and real. She also writes in a way that is both simple and beautiful. The Professor's House is my third of her books, after Death Comes for the Archbishop and, more recently, O Pioneers!.In this novel, the titled Professor is actually conflicted, caught between two worlds, that of his old house with the study he has used to write books for years, and his new house, largely designed by his wife and a great step up. The differences between the two are signs of the growing discomfort in St. Peter's life: his occasional discomfort with his eldest daughter, his wonderment at his wife, his increased love of playing hookey from his regular life of teaching and socializing.Within this story we also learn of a young man who is very influential on the entire St.Peter clan, Tom Outland, a man who died too young during WWI. He's almost mythic to some and is awarded his own section to narrate some of his own history, especially his time on the mesas of New Mexico.Far up above me, a thousand feet or so, set in a great cavern in the face of a cliff, I saw a little city of  stone, asleep. It was as still as sculpture---and something like that. It all hung together, seemed to have a kind of composition: pale little houses of stone nestling close to one another, perched on top of each other, with flat  roofs, narrow windows, straight walls, and in the middle of the group, a round tower....The village sat looking down into the canyon with the calmness of eternity. The falling  snow-flakes, sprinkling the pinons, gave it a special kind of solemnity. I can't describe it. It was more like sculpture than anything else. I knew at once that I had come upon  the city of some extinct civilization, hidden away in this  inaccessible meas for centuries, preserved in the dry air and almost perpetual sunlight like a fly in amber, guarded  by the cliffs and the river and the desert. (pp179-180)Cather also describes natural surroundings in St. Peter's midwest setting: the gardens, the colors of the changing seasons and changing skies and lakes.But most central is St. Peter's changing sense of himself---or perhaps his regaining his past sense of self. This is a quiet novel. There is no Virginia Woolf to be afraid of here. There is introspection and discovery, remembrance of people and things lost.I've now decided that I will try to read everything that Cather has written. I have several on hand and will gradually make my way through them.Highly recommendedP.S. Anyone who has visited the Southwest, even in these modern times, has probably had a touch of the experience written by Cather for Tom when seeing cliff dwellings. Even with tourists swarming, they are something \"other\"."}, {"userName": "Cphe", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/14907696-cphe", "userReview": "A beautifully written story with many undertones to it. On the surface it appears a story of family life, quite mundane really but there are hidden depths here. Wonderful characterisation of all the characters I felt not just Godfrey St. Peter, even the periphery characters all had their time on the page.A gentle novel, but heartfelt and reflective."}, {"userName": "Sketchbook", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/4708498-sketchbook", "userReview": "Willa Cather pops the big question : How do wekeep living when there's nothing to look forward to?Midwest prof in his 50s has finished his book.With 2 married daughters, a bizee wife and thememory of a prized student killed in WW1, hescalpels his soul.\"He knew that life is possible, may even bepleasant, without joy, without passionate griefs.But it had never occurred to him that he might haveto live like that.\""}, {"userName": "Joselito Honestly and Brilliantly", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/2190636-joselito-honestly-and-brilliantly", "userReview": "I would say that this is a very \"clean\" novel. The characters are respectful, their dialogues are polished, and there's not a hint of any major mischief in the plot. Professor Godfrey St. Peter is fifty-two. He has two married daughters and a wife (Lillian) of many years. He teaches and writes history books. His family is financially secure, one of his daughters is even rich, having been the beneficiary of his (St.Peter's) former student's posthumous wealth from a gas-related invention. this former student, Tom Outland, died very young during the first world war.There are some minor tensions in several places mainly brought about by this gas money. But one can see for himself that these can't possibly be unsolvable problems or things one can base a tragic novel on. You would have preferred to see these come to some sort of a resolution, but Willa Cather probably fell asleep going towards the ending, woke up still lethargic, then decided to just let everything hang.Why do I like this novel very much? Because I fortunately read it at the proper time. A couple of years more and I may see all of my children married too and no longer asking me for money. They will have their own homes and one day, like Professor St. Peter and his wife Lillian, me and my wife would be watching something (here, the professor and his wife are watching a play) and we'll also have an introspective moment like this: \"When the curtain fell on the first act, St. Peter turned to his wife. 'A fine cast, don't you think? And the harps are very good. Except for the wood-winds, I should say it was as good as any performance I ever heard at the Comique.'\"'How it does make one think of Paris, and of so many half-forgotten things!' his wife murmured. It had been long since he had seen her face so relaxed and reflective and undetermined.\"Through the next act he often glanced at her. Curious, how a young mood could return and soften a face. More than once he saw a starry moisture shine in her eyes. If she only knew how much more lovely she was when she wasn't doing her duty!\"'My dear, ' he sighed when the lights were turned on and they both looked older, 'it's been a mistake, our having a family and writing histories and getting middle-aged. We should have been picturesquely shipwrecked together when we were young.'\"'How often I've thought that!' she replied with a faint, melancholy smile.\"'You? But you're so occupied with the future, you adapt yourself so readily,' he murmured in astonishment.\"'One must go on living, Godfrey. But it wasn't the children who came between us.' There was something lonely and forgiving in her voice, something that spoke of an old wound, healed and hardened and hopeless.\"'You, you too?' he breathed in amazement. He took up one of her gloves and began drawing it out through his fingers. She said nothing, but she saw her lip quiver, and she turned away and began looking at the house through the glasses. He likewise began to examine the audience. He wished he knew just how it seemed to her. He had been mistaken, he felt. The heart of another is a dark forest, always, no matter how close it has been to one's own. Presently the melting music of the tenor's last aria brought their eyes together in a smile not altogether sad.\"That night, after he was in bed, among unaccustomed surroundings and a little wakeful, St. Peter still layed with his idea of a picturesque shipwreck, and he cast about for the particular occasion he would have chosen for such a finale. Before he went to sleep he found the very day, but his wife was not in it. Indeed, nobody was in it but himself, and a weather-dried little sea captain from the Hautes-Pyrenees, half a dozen spry seamen, and a line of gleaming snow peaks, agonizingly high and sharp, along the southern coast of Spain.\"\"The heart of another is a dark forest, always...\"--could this be true? And will there really be a time--after you've succeeded in every aspect of your ordinary life--that all you'd want to do is to get away from everyone who had been a part of you, even from your spouse or partner, like the one I have right there on the top left hand portion of this review?-\"He (Professor St. Peter) loved his family, he would make any sacrifice for them, but just now he couldn't live with them. He must be alone. That was more necessary to him than anything had ever been, more necessary, even, than his marriage had been in his vehement youth. He could not live with his family again--not even with Lillian. Especially not with Lillian! Her nature was intense and positive; it was like a chiselled surface, a die, a stamp upon which he could not be beaten out any longer. If her character were reduced to an heraldic device, it would be a hand (a beautiful hand) holding flaming arrows--the shafts of her violent loves and hates, her clear-cut ambitions.\"'In great misfortunes,' he told himself, 'people want to be alone. They have a right to be. And the misfortunes that occur within one are the greatest. Surely the saddest thing in the world is falling out of love--if once one has ever fallen in.'Will we, as we grow old, and as claim have been universally observed, go back to the young boys and girls we all had been? Will we meet them again and embrace them, tightly, until we are them again? Is this the common great misfortune those of us who will not die young shall suffer in the end?\"St. Peter had always laughed at people who talked about 'day-dreams,' just as he laughed at people who naively confessed that they had an 'imagination.' All his life his mind had behaved in a positive fashion. When he was not at work, or being actively amused, he went to sleep. He had no twilight stage. But now he enjoyed this half-awake loafing with his brain as if it were a new sense, arriving late, like wisdom teeth. He found he could lie on his sand-spit by the lake for hours and watch the seven motionless pines drink up the sun. In the evening, after dinner, he could sit idle and watch the stars, with the same immobility. He was cultivating a novel mental dissipation--and enjoying a new friendship. Tom Outland had not come back again through the garden door (as he had so often done in dreams!), but another boy had: the boy the Professor had long ago left behind him in Kansas, in the Solomon Valley--the original, unmodified Godfrey St. Peter.\"This boy and he had meant, back in those far-away days, to live some sort of life together and to share good and bad fortune. They had not shared together, for the reason that they were unevenly matched. The young St. Peter who went to France to try his luck, had a more active mind than the twin he left behind in the Solomon Valley. After his adoption into the Thierault household, he remembered that other boy very rarely, in moments of home-sickness. After he met Lillian Ornsley, St. Peter forgot that boy had ever lived.\"But now that the vivid consciousness of an earlier state had come back to him, the Professor felt that life with this Kansas boy, little as there had been of it, was the realest of his lives, and that all the years between had been accidental and ordered from the outside. His career, his wife, his family, were not his life at all, but a chain of events which had happened to him. All these things had nothing to do with the person he was in the beginning.\"The man he was now, the personality his friends knew, had begun to grow strong during adolescence, during the years when he was always consciously or unconsciously conjugating the verb 'to love'--in society and solitude, with people, with books, with the sky and open country, in the lonesomeness of crowded city streets. When he met Lillian, it reached its maturity. From that time to this, existence had been a catching at handholds. One thing led to another and one development brought on another, and the design of his life had been the work of this secondary social man, the lover. It had been shaped by all the penalties and responsibilities of being and having been a lover. Because there was Lillian, there must be marriage and a salary. Because there was marriage, there were children. Because there were children, and fervour in the blood and brain, books were born as well as daughters. His histories, he was convinced, had no more to do with his original ego than his daughters had; they were a result of the high pressure of young manhood.\"The Kansas boy who had come back to St. Peter this summer was not a scholar. He was a primitive. He was only interested in earth and woods and water. Wherever sun sunned and rain rained and snow snowed, wherever life sprouted and decayed, places were alike to him. He was not nearly so cultivated as Tom's old cliff-dwellers must have been--and yet he was terribly wise. He seemed to be at the root of the matter; Desire under all desires, Truth under all truths. He seemed to know, among other things, that he was solitary and must always be so; he had never married, never been a father. He was earth, and would return to earth. When white clouds blew over the lake like bellying sails, when the seven pine-trees turned red in the declining sun, he felt satisfaction and said to himself merely: 'That is right.' Coming upon a curly root that thrust itself across his path, he said: 'That is it.' When the maple-leaves along the street began to turn yellow and waxy, and were soft to the touch,--like the skin on old faces,--he said: 'That is true; it is time.' All these recognitions gave him a kind of sad pleasure.\"When he was not dumbly, deeply recognizing, he was bringing up out of himself long-forgotten, memories of his early childhood, of his mother, his father, his grandfather. His grandfather, old Napoleon Godfrey, used to go about lost in profound, continuous meditation, sometimes chuckling to himself. Occasionally, at the family dinner-table, the old man would try to rouse himself, from motives of politeness, and would ask some kindly question--nearly always absurd and often the same one he had asked yesterday. The boys used to shout with laughter and wonder what profound matters could require such deep meditation, and make a man speak so foolishly about what was going on under his very eyes. St. Peter thought he was beginning to understand what the old man had been thinking about, though he himself was but fifty-two, and Napoleon had been well on his eighties. There are only a few years, at the last, in which man can consider his estate, and he thought he might be quite as near the end of his road as his grandfather had been in those days.\"The Professor knew, of course, that adolescence grafted a new creature into the original one, and that the complexion of a man's life was largely determined by how well or ill his original self and his nature as modified by sex rubbed on together.\"What he had not known was that, at a given time, that first nature could return to a man, unchanged by all the pursuits and passions and experiences of his life; untouched even by the tastes and intellectual activities which have been strong enough to give him distinction among his fellows and to have made for him, as they say, a name in the world. Perhaps this reversion did not often occur, but he knew it had happened to him, and he suspected it had happened to his grandfather. He did not regret his life, but he was indifferent to it. It seemed to him like the life of another person.\"Along with other states of mind which attended his realization of the boy Godfrey, came a conviction (he did not see it coming, it was there before he was aware of its approach) that he was nearing the end of his life....\"Ah, let us all grow old. Then, we will know if this story is true."}, {"userName": "Tom", "userReviewDate": "Jun 09, 2008", "userURL": "http://www.goodreads.com/user/show/1224910-tom", "userReview": "I actually read this before. I have a habit of re-reading books I like during the summer. Why? Who knows?I read this for a grad class on Cather and it blew me away. Strangely intense little book. At first, it doesn't seem to be about much, but it's worth a close reading.Her best known books (O Pioneers, My Antonia) aren't really her best. They are often taught at the high school level, and I think people often think of her as slight. But some of her books, like The Professor's House, pack a real intellectual punch.Highly recommended."}, {"userName": "Ali", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/804942-ali", "userReview": "A beautifully introspective little novel, in The Professor’s House Cather introduces us to Godfrey St. Peter a mid-western university professor. St Peter and his family have lived for many years in an ugly though rather loved house which they are finally moving out of – their two daughters married and off their hands, finally Mrs St Peter can have the house she has dreamed of. As the contents of the old house are moved into the new house, the Professor remains in his study in the old house – surrounded by the objects he has lived with for so long. Books, papers, his old couch, and the dress making forms left behind by Augusta with whom Professor St Peter has shared his study twice a year – and now feels oddly at home with.“The low ceiling sloped down on three sides, the slant being interrupted on the east by a single square window, swinging outward on hinges and held ajar by a hook in the sill. Walls and ceiling alike were covered with a yellow paper which had once been very ugly, but had faded into inoffensive neutrality. The matting on the floor was worn and scratchy. Against the wall stood an old walnut table, with one leaf up, holding piles of orderly papers. Before it was a cane-backed office chair that turned on a screw. This dark den had for many years been the Professor’s study.”As the summer continues the Professor is less and less inclined to make that one last move – and relocate his attic study to the new house. Instead he keeps on the old house, making his way each day to his beloved study – surrounding himself with the objects with which he is most familiar.Full review: https://heavenali.wordpress.com/2017/..."}, {"userName": "Roberta", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/7229301-roberta", "userReview": "On the face of it, Professor Godfrey St. Peter has a good life. As Cather’s novel opens, he is married, with two grown daughters, Rosamund and Kathleen, who are also married. He has for many years taught at a small college in Ohio, where he is respected and esteemed. He has produced his magnum opus – a multi-volume work on the Spanish explorers of North America – which has won him a distinguished literary prize. With the money from that prize, St. Peter has built his wife Lillian a grand new home.But there is a problem. He does not want to live there.He prefers the older house. More specifically, he prefers the room that has served, for many years, as his study. It is on the top floor: \"The low ceiling sloped down on three sides, the slant being interrupted on the east by a single square window, swinging outward on hinges and held ajar by a hook in the sill.This was the sole opening for light and air. Walls and ceiling alike were covered with a yellow paper which had once been very ugly, but had faded into inoffensive neutrality. The matting on the floor was worn and scratchy. Against the wall stood an old walnut table, with one leaf up, holding piles of orderly papers. Before it was a cane-backed office chair that turned on a screw.\"The professor is not always alone in this room: he shares it for some weeks in the spring and the fall with Augusta, the dressmaker who outfits his wife and daughters. As an aid to this work, Augusta uses two dress forms, which are stored in the attic study year round. St. Peter enjoys Augusta’s company; likewise, the two dress forms. When she offers to remove them, he objects vehemently. And so they remain there.There is a young man in this novel whose character acts as a bridge between two worlds. He is Tom Outland. Having spent his youth in New Mexico, Tom comes east to acquire an education. (It is this intention that brings him to the attention of Godfrey St. Peter.) There’s much more to this aspect of the novel, but I won’t dwell upon it now. I will only say that along with his friend Rodney Blake, Tom Outland had the great good fortune to discover and explore a deserted city atop a mesa. The details of this extraordinary adventure are contained in the second section of the novel, “Tom Outland’s Story.”Tom’s descriptions of this otherworldly place are intensely lyrical, yet even so, he feels that words fail him, or very nearly so. Here he first catches sight of the city on the mesa: \"It was such rough scrambling that I was soon in a warm sweat under my damp clothes. In stopping to take breath, I happened to glance up at the canyon wall. I wish I could tell you what I saw there, just as I saw it, on that first morning, through a veil of lightly falling snow. Far up above me, a thousand feet or so, set in a great cavern in the face of a cliff, I saw a little city of stone, asleep. It was as still as sculpture–and something like that…. There was something symmetrical and powerful about the swell of the masonry. The tower was the fine thing that held all the jumble of houses together and made them mean something. It was red in colour, even on that grey day. In sunlight in was the color of winter oak-leaves. A fringe of cedars grew along the edge of the cavern, like a garden. They were the only living things. Such silence and stillness and repose–immortal repose. That village sat looking down into the canyon with the calmness of eternity. The falling snow-flakes, sprinkling the pinons, gave it a special kind of solemnity. I can’t describe it.\"But of course he is describing it, very effectively and very vividly. He concludes with this stunning realization: \"I knew at once that I had come upon the city of some extinct civilization, hidden away in this inaccessible mesa for centuries, preserved in the dry air and almost perpetual sunlight like a fly in amber, guarded by the cliffs and the river and the desert.\"(In the novel, this place of incredibly pristine beauty is called the Blue Mesa. It was actually modeled on Mesa Verde, which was discovered in 1888 by Colorado rancher Richard Wetherill and his brother-in-law Charlie Mason. It became a national Park in 1906; Willa Cather first went there in 1915.)I remember that the first time I read The Professor’s House, I felt slightly impatient with Tom Outland’s narrative. It represents a complete break with the story of Godfrey St. Peter, his family, and his university colleagues. I had become very absorbed in the professor’s professional and personal challenges, and I resented this sudden change of focus. But I now realize that it was very artfully done. Tom Outland’s story is of a whole different order of magnitude, and Tom Outland himself is that rarest of beings, possessed as he is of a great intellectual curiosity matched with an equally great intelligence. These qualities are coupled with a natural warmth and almost unbounded enthusiasm. He seems destined for great things. Upon meeting him, St. Peter perceives all this almost at once. He perceives it, and he sees in this extraordinary young man a mirror of his own youthful aspirations.What has become of those aspirations? And what is there now in the professor’s world that can infuse his life with new meaning? How much of ourselves are we called upon to sacrifice in order to insure the well being of those close to us? These are the crucial questions that dominate the novel’s brief and powerful final section.Critic E.K. Brown sums up the problem this way: \"In the first part it was plain that the professor did not wish to live in his new house, and did not wish to enter into the sere phase of his life correlative with it. At the beginning of the third part it becomes plain that he cannot indefinitely continue to make the old attic study the theatre of his life, that he cannot go on prolonging or attempting to prolong his prime, the phase of his life correlative with that. The personality of his mature years–the personality that had expressed itself powerfully and in the main happily in his teaching, his scholarship, his love for his wife, his domesticity–is now quickly receding, and nothing new is flowing in.\"(Such a beautifully apt locution, “the sere phase of his life.” I have no idea who E.K. Brown is, but the eloquence and insight that characterize this brief piece remind the reader that literary criticism can be a noble calling. The essay can be found in Modern Critical Views: Willa Cather, a collection is edited and introduced by Harold Bloom, whose life’s work serves as a similar reminder.)I’ve been deeply moved by my third reading of The Professor’s House. I may read it yet again. For one thing, the writing is wonderful, transcendent with out being the least bit extravagant.The critic E.K. Brown encourages the reader to ponder the true significance of houses in this novel: the professor’s dwelling places, both the old and the new, the grand country house being built by Rosamund and her husband – and the community of small houses atop the Blue Mesa.And then, of course, there is that final house, that final bed, the inevitable ending that S.t Peter finds occupying his thoughts more and more. At one point, these lines of verse come to him: For thee a house was built Ere thou wast born; For thee a mould was made Ere thou of woman camest.Alone in his attic study, the professor meditates on this: \"Lying on his old couch, he could almost believe himself in that house already. The sagging springs were like the sham upholstery that is put in coffins. Just the equivocal American way of dealing with serious facts, he reflected. Why pretend that it is possible to soften that last hard bed?\"And oh, the leaden weight of those last four monosyllables!"}, {"userName": "Alex", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "Well, this was very pleasant and all, but...have you ever heard of a bridge version of a book? Don't feel bad if you haven't; I just made it up. What it is is you know how there are abridged versions of books, where they include the important and exciting parts and chop out some of the meandering and tangential stuff? Have you ever wondered what happens to that stuff they chop out? Well, that ends up in a bridge version of the book, and that must be the version I read because nothing fucking happened."}, {"userName": "Laurence", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/39841504-laurence", "userReview": "Regelmatig deed dit boek me denken aan het (veel recentere en door mij erg graag gelezen) boek 'The Sense of an Ending' van Julian Barnes, ook al is de verhaallijn helemaal anders. Blijkbaar ligt de thematiek 'man van middelbare leeftijd overschouwt zijn leven' me wel.Aanrader dus voor mensen die net als ik houden van een elegant geschreven boek over dit thema, en het melancholisch gevoel van verlies dat daarmee gepaard gaat."}, {"userName": "☯Emily ", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/4074840-emily", "userReview": "This is my first Willa Cather book and I am not sure I will read another. The first chapter was boring, but the book picked up after that. Professor St. Peter is a successful professor and author. He seems to have a successful marriage with two married daughters. But St. Peter is not content or satisfied with what he has accomplished. He starts reviewing his life and finds he has lost an essential part of himself.I found there were pieces of the story line that just disappeared without resolution. One section wasn't even about the professor, but about Tom Outland, a protegee of the professor. I am unsure why it was included in the book; it didn't seem necessary.I'm hoping that my Goodread's group will help me put the pieces together."}, {"userName": "Tracey", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/16973418-tracey", "userReview": "Another wonderful novel by this author (my second + I've read a short story by her)Her descriptions of landscapes are second to none and how she describes light shining is like an artist painting a picture ..I cannot wait for my next Willa Cather book.Thanks to Tom, who I buddy read this with via often very long messages, and who is far more articulate and scholarly than me."}, {"userName": "Connie", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "The story starts when the Professor and his wife Lillian buy a new house, and the Professor does not want to move into his new residence. He continues to maintain a study in the old house where he is writing a history of the Spanish explorers. This part of the book tells about his relationships with the people in his family who seem to be very involved in acquiring material possessions.The second part of the book is told in the voice of the brilliant Tom Outland, the Professor's favorite student. Tom discovered an abandoned settlement left by the Native Americans of New Mexico. Tom shows the excitement of discovery, and has beautiful descriptions of the mesa.The third section of the story involved the Professor transitioning into the later years of his life. Since Tom's death, he has missed the intellectual excitement that the younger man brought to his life. He felt that he had two important relationships in his life. The first was his romance with Lillian and raising their family together. The second with Tom Outland was a relationship of the intellect and the imagination which helped keep the Professor young. He is feeling like his remaining years might be pleasant, but lacking a real passion or joy.This is an unusual book in the way it is structured. I especially enjoyed Tom's account of his time in New Mexico. By the end of the book, I had an appreciation of where the Professor was in his later life and felt that he had made peace with himself about his future."}, {"userName": "Kim", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/8036318-kim", "userReview": "The Professor’s House is essentially an exploration of change and regret. Godfrey St. Peter, is a professor at a small mid-western college. He has reached a transition point where he has completed his life’s work (a multi-volume history called \"Spanish Adventurers in North America\"), achieved a considerable amount of recognition and status in his field, and finally has the funds to build a new house for his wife. But as the time comes to move to the new house, St. Peter is more and more reluctant to leave the old one, in particular the attic study where he spent so many hours writing his book. On the surface, there’s no reason for St. Peter to be other than happy, but it’s clear he has regrets and reservations about moving forward with his life as it is.The book is very minimalistic. You are given a limited amount of information about the characters and selected events in their lives. The characters are intriguing and I continually wanted more detail, more background. But there’s only just enough to tell the story, and in the end I guess it was sufficient for me to understand and draw my own conclusions, if not totally satisfying.I have read and loved many of Cather’s books, but never got around to reading this one. As always I appreciate her simple prose and characters that are complex, interesting and human."}, {"userName": "Chris", "userReviewDate": "Sep 22, 2009", "userURL": "http://www.goodreads.com/user/show/1124585-chris", "userReview": "I'm having a hard time deciding how to review The Professor's House. The plot itself is very straightforward and easy to describe. The characters are vivid and well-defined which adds to the realism of the novel. But it seems to me that the meat of this novel is in the themes and nuances.I have read some of Cather's short stories many years ago and only have vague memories of them other than a memory that she had exquisite attention to detail. As I read this book I found that memory to be true. The writing vibrantly presents minute details to the reader…from the shape and texture of a hand to the nature of a dress or necklace to the depiction of setting both in and out of doors.Her characters are likewise detailed. We are held at a close third person so we don't actually get into the characters' heads, but the detailed account of appearance and action allows the reader to feel very intimate with the characters.The layout of the book is interesting in that it consists of three \"books.\" The first book is entitled \"The Family\" and follows the Professor as he works to finish his own writing while teaching and balancing the various dramas unfolding in his life and the lives of his family members. The second book is \"Tom Outland's Story\" and is the first person narrative of Tom, an old student of the Professor and friend of the family who is now dead (from WWI) but left behind an invention and legacy that resulted in great wealth for one of the Professor's daughters. The final book is entitled \"The Professor\" and is a very short wrap up of the novel which focusses on thoughts, emotions and actions of the professor after he reads and ponders Outland's story.The overarching plot of the book is interesting if not terribly engaging. There were moments of drama and emotion that drew me in, but there were other segments that were almost boring with the mundane interactions. As I mentioned initially, the meat of the novel though isn't the plot itself, but the themes and emotions it instills. Looking to these themes, part of this book seems to be an exploration of emotional displacement and emotional paralysis or release. The Professor is very attached to his old house and his work and doesn't want to move into the new house with his family. Outland is almost a portrayal of a return to the past for the professor and in the end, Outland's story provides an almost existential release to the professor. The claustrophobia of the old house and the room in which the professor works serve as a metaphorical trap that is holding the professor hostage in his current/past life/behavior and causing emotional turmoil and angst from which he can't see a clear escape.At a higher, more sociological level, the novel portrays some interesting counterpoints on society. The Professor is doing well enough off teaching at the university and does even better once he receives an award for his writing. His two daughters are well enough off as well though one is moving into the \"upper class\" while the other is sitting fairly \"middle.\" The family interactions and conversations give interesting insight into the class reactions of the era and some of the internal and external results of class mobility. As the professor's daughter and son-in-law gain their wealth and rise to a higher social status, there are jealousies and even some resentment and anger both within and outside of the family.Looking at the writing, it is clear that there are MANY levels at work in this novel. Cather's frequent use of color helps categorize different themes or values. Her descriptions of the houses, rooms and other settings set the balance between the different classes or social situations. To further illustrate that NOTHING appears to be arbitrary in this book, it was pointed out to me that there is particular significance in the name of the ship that Outland takes to the war, the name of the ship that the Professor's family returns home on, and even the book that Outland uses to study latin.So, even though the book's plot isn't terribly engaging, I can see this work as having a lot of valuable insight into the social and mental ideas of the 1920s, many of which have relevance today especially given the almost parallel economic situation around us.While it's not likely something I'd read over and over, it is something I can recommend to those interested in human behavior, the 1920s, or life in general. Cather paints a vivid and beautiful picture of a family…not a perfectly adjusted and blissfully happy family, but a realistic, flawed and interesting family.***3 stars out of 5"}, {"userName": "Callie", "userReviewDate": "Mar 14, 2011", "userURL": "http://www.goodreads.com/user/show/1736296-callie", "userReview": "Read this in college, but this time it's for book club. I love Willa Cather! That said, I am a bit conflicted about this book. She had a plot line developing, revolving around some tensions between the two daughters of the professor, a potential lawsuit over the fortune amassed by Rosamund(or was it Rosalind?) And then she interrupts this developing plot to go into some background about Tom Outland, which I didn't mind but when she took up telling about life in Hamilton again she decided NOT to resolve or follow up with any of the plot she had already been developing. She gets deeper into the interior life of the professor, which I enjoyed, but there was a part of me that wished she had also kept on with that dern story she'd been telling. That said, I do find myself agreeing with her worldview so often and it's extremely gratifying to read an author who so highly values the landscape of the Southwest. The professor comes to believe that his essential self is who he was as a boy and that all his ties to his family and society are secondary and are a constructed self. this is not to denigrate or regret those ties, but just a realization he comes to...I have felt this too. We come to the planet very much in tune with our divine eternal nature, but gradually lose that feeling and identify ourselves more and more with the forms of this ephemeral world...okay i'm done being deep :)"}, {"userName": "El Buscalibros | elbuscalibros.com", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/49228810-el-buscalibros-elbuscalibros-com", "userReview": "En este libro Willa Cather nos habla de la frontera entre el viejo mundo y el nuevo. El profesor St Peter, un investigador del legado español en Estados Unidos de reconocido prestigio, se muda de la casa en la que ha vivido con su familia toda su vida y en la que tiene su estudio a otra más moderna y con más comodidades. La modernidad entra en la familia y también parece que va a entrar en sus costumbres. Sin embargo, él continúa alquilando su antigua casa, para no perder sus referencias y un poco también por no mandar a la familia al cuerno en un despiste.El verdadero protagonista de esta historia no es, sin embargo, el profesor St Peter ni su familia, sino Tom Outland, un antiguo alumno suyo excepcional que ha inventado un motor que revolucionará la aviación. Tom Outland ha muerto en el frente de la Primera Guerra Mundial y ha legado a la hija del profesor la patente del invento, con lo que les ha hecho ricos a todos. Pero antes de eso, Tom Outland ha fascinado y marcado a la familia con su forma de presentarse ante ellos, con el relato de su pasado y con su manera de ser.Esta interesante novela está contada en (...) SIGUE LEYENDO LA RESEÑA EN NUESTRA WEB: https://elbuscalibros.com/la-casa-del..."}, {"userName": "Jan", "userReviewDate": "Jul 22, 2015", "userURL": "http://www.goodreads.com/user/show/8507674-jan", "userReview": "I bought this book intending to put it into the Postal Book Group 7a circulation in the coming year. I chose it because a podcaster I admire called it one of his favorite books of all time!But, having read it, I think I won't be mailing it out. I finished last night with genuine admiration, but did not find it an easy book to engage with and struggled even to continue after the first few chapters.I am a Willa Cather fan and loved \"My Antonia,\" \"O Pioneer,\" \"One of our Own,\" and multiple short stories by Cather. I had problems with this one. HOWEVER, I would give it a five-star rating if every part of it was as insight-filled as the very end section which rang true true true for me. It's not a long book so maybe it's worth a read for others? My three-star rating means it's good, I liked it, but I won't read it again or be the one to recommend it to others. It's scheduled to be discussed this fall. I know some of my Goodreads friends will be reading it before or after the particular podcast is aired. I look forward to their reflections."}, {"userName": "Janet", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/2013209-janet", "userReview": "My first Willa Cather....I may have lost my taste for classics, this seems like a relic to me. It will be interesting to hear from Thomas Otto why it is his favorite book. All the while reading I could picture myself in freshman English class with an assignment to write an essay about the symbolism of St Peter's inability to move house.Anyway, I found it a bit of a slog but it was a short read and I'm glad I finally finished it.Just to show that there is value in every book, this Booktopia selection led me to read about the Willa Literary Award which is Women Writing About the West. I found several nominees that I want to add to my TBR. Read about the Willa Award here....http://www.womenwritingthewest.org"}, {"userName": "Jim", "userReviewDate": "Jul 27, 2008", "userURL": "http://www.goodreads.com/user/show/1260474-jim", "userReview": "Geoffery St. Peter (professor) moves into a new house, but keeps the old house as a study. A brilliant student, Tom Outland, invents a new engine that makes a lot of money. Tom dies in WWI, leaving his fortune to his fiance, Rosamond, one of the professor's daughters. Rosamond and her new husband become parvenus. The book is half about primoral America - the Blue Mesa in New Mexico, swimming in delicious Lake Michigan and half about the transition from middle age to old age and wanting to sleep, rest and contemplate the universe. A spare correct style that celibrates America without the boisterous cheerleading of Whitman.Cather is one of my favorites."}, {"userName": "Mind the Book", "userReviewDate": "Feb 17, 2015", "userURL": "http://www.goodreads.com/user/show/22692958-mind-the-book", "userReview": "\"He had never learned to live without delight.\" Föredrar att fokusera på ramberättelsen: campusroman-cum-medelålderskris. Originell och existentiell."}, {"userName": "Yoana", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/3632255-yoana", "userReview": "It's a really unusual book in how it's told - it constantly thwarts your expectations of what it's actually about. It starts in the present and goes backwards, suddenly switching from a story about a bourgeois family in Hamilton and their affairs to a bona fide adventure tale of exploration and stupendous discovery set in the surreally gorgeous wilderness of the South-west. That latter story, told in splendid lyrical prose that pays reverential respect to nature's beauty and humankind's capacity for greatness, is a synthesis of the philosophical underpinning of the book: the fight for authenticity, honour and being true to one's inner self, the one buried under the piles of family and social conventions, obligations and pressures. The story and spirit of Tom Outland, a prodigious wildling-turned-inventor, imbues the book and holds the key to interpreting every event, every line, every decision made by the characters. I don't think I've ever read a book quite like this one - I think it can be described as an exploration of the process of disintegration of the fabric of social convention, shared history, family, chance and everything else we call life, and returning to our earliest selves, before we were moulded by external forces."}, {"userName": "Kirsten ", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/833700-kirsten", "userReview": "I'm not sure what I think of this book. It is listed on two different \"1000 books to read before you die\" lists. But I really don't see what all the fuss is about.It is not a bad book, and it is written beautifully. In the second section of the book, you get a real sense of the Southwest (New Mexico). And the part set in DC is very evocative of the bureaucracy that runs through that town. But, the plot - what there is of it - just did not speak to me. But the writing is so well done, I will want to read another of the author's work before making a final decision on her work."}, {"userName": "Christian Engler", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/20269800-christian-engler", "userReview": "I came to the works of Willa Cather by way of my father, who was a deep admirer of her books, especially after he read The Song of the Lark. I knew that Cather wrote about the immigrant experience, but after having finished The Professor's House, I realized that her talent in capturing the nuances of the human experience was not solely limited to the immigrant life. It was just one slice of the pie that she happened to address. There is so much more to her books than I had judged, and admittedly, The Professor's House set me straight.In life there are pitch-perfect moments, and when they arise, they are sometimes just so good you don't ever want to let them go. They are that euphoric bubble of bliss where everything is just right, not blemished nor off kilter. And those moments are few and far between. Yet, when they happen, we thirst for them. However, what happens when that bubble bursts? For many, the typical pattern is to become isolated and cope the best way possible. We try to accept and conform to what has been dealt even though we may not like it. Others flat-out rebel until their heads are through the wall, unyielding and defiant to the bitter end.Now meet Godfrey St. Peter, husband, father, academic and writer; for the most part, he is an affable and compromising fellow. But in some regards he is not. He has his loyalty to his old study, what for him is his security blanket. It represents his life and how he came to be who he was. His study is simple and not overly adorned, but the things in there represent the tangible moments of his life and successes. And that is a comforting sense of fulfillment that he has rightfully earned. As the novel progresses, Professor St. Peter is forced to face an unpleasant onslaught of challenges in which he is looped into. His way of life is gradually being yanked away from him by the enemies of materialism, loneliness, new vs. old generation values, to simply being an old man. What is particularly moving is that all these battles are coming from within the family context. They are moving forward, but in so doing, they are leaving the past absolutely behind, not giving it an iota of concern or appreciation. When collected, it is all so dense and overwhelming St. Peter just wants an out, even if it goes contradictory to what his name represents: \"Rock\". He's tired of reflecting upon his family woes, the memory of Tom Outland (who gets the story off the ground), of missed opportunities... They all pile atop each other and thus causes St. Peter to be apathetic towards his own life: \"When St. Peter at last awoke, the room was pitch-black and full of gas. He was cold and numb, felt sick and rather dazed. The long anticipated coincidence had happened, he realized. The storm had blown the stove out and the window shut. The thing to do was to get up and open the window. But suppose he did not get up--? How far was a man required to exert himself against accident? How would such a case be decided under English law? He hadn't lifted his hand against himself--was he required to lift it for himself?\" Pages 251-252.Ultimately, perseverance does prevail, but there is a lot of residual that needs to be sorted out. Whether young or old, all people have conflicts that bombard and oppress them. Professor Godfrey St. Peter is a survivor. Even though (to me) he is a very heroic figure, I personally don't think he wants to be one. But he copes: \"...he could face with fortitudd...the future.\" Page 258. Overall, The Professor's House was a great read with many worthwhile lessons to be gleaned."}, {"userName": "Robin Friedman", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/22269025-robin-friedman", "userReview": "How The Imagination PersistsWilla Cather's early novels of life on the American prairie, such as \"My Antonia\" and \"O Pioneers\" are well known. Her novel \"The Professor's House\" is much less familiar, but it is Cather at her best.The book tells the story of Professor Godfrey St. Peter. When we meet St. Peter, he is a respected academic and scholar, age 52, who has written an eight volume history called \"Spanish Explorers\" dealing with the Spanish in Mexico and the American Southwest. He has persevered in his writing and received awards. As a result, St. Peter and his family are able to build a new house and move away from the ramshackle rented quarters in which the Professor and his wife have lived and raised their family.The family consists of two daughters who, when we meet them, have married and gone their own ways. The younger daughter is married to a struggling news reporter who has impressed his bosses by his ability to turn out hack prose-poems for the paper on a daily basis.The older daughter was at one time engaged to a man named Tom Outland who is, perhaps the real hero of the book. Outland invented an important scientific device and willed it to her upon his death in WW I. She then marries an engineer and entrepreneur who develops and markets Outland's invention. The couple build a large home and name in \"Outland\".The book tells a story of change, frustration and acceptance. The Professor is unhappy with the new home and refuses to leave his old study. His relationship with his wife and daughters has cooled. He is unhappy with the modernization of the university and of academic learning with its emphasis on technology and business rather than study and reflection. Most importantly, he is dissatisfied with his honors, his leisure, and his comforts. He thinks of his youth of promise and study, of his life of solitude, and yearns for adventure and meaning.The first part of the book tells the story of the Professor and his family. The second, shorter, part is a flash-back and tells the story of Tom Outland who Professor St. Peter befriended many years before and who grew up in mysterious circumstances in New Mexico. We learn in the second part of the book of Outland's life on the railroad and on the range. We see his somewhat ambiguous friendship with an older man and their discovery of an ancient Indian village on the mesas. There is a wonderfully drawn picture of Washington D.C. as Tom tries, without success, to interest officials in his discovery.In the third part of the book, the Professor reflects on Tom and on his own life. It seems to me that Tom's life mirrors the theme of the Professor's lengthy studies in \"Spanish Explorers\" It is the kind of life in its rawness, closeness to nature, and independence that the Professor thinks he would have liked to lead rather than settling for a middle-class life of conformity, comfort, and boredom. We see how the Professor tries to struggle on.There is a frustration built into life when we learn we are not the persons we dreamed of becoming. This is a poignant, beautifully-written story of American life and of how and why people fall short of themselves.Robin Friedman"}, {"userName": "Lauren", "userReviewDate": "Mar 22, 2016", "userURL": "http://www.goodreads.com/user/show/10432220-lauren", "userReview": "I really enjoyed \"The Professor's House,\" even though it's not something I would normally read. Cather has a beautiful style of writing and capturing emotions/ thoughts and moments that are difficult to put into words. I felt similarly about \"My Antonia.\" Even though not much happens plot-wise in either of these novels and \"The Professor's House\" really centers on events that happened in the past, it was a beautiful read because of the sense of emotion and nostalgia it manages to capture. My favorite passages are Cather's natural descriptions, especially of the scenery in the Southwest. The part told from Tom Outland's perspective was actually my favorite piece of the novel because there were so many lovely natural descriptions. Tom's first discovery of the silent stone cliff village, abandoned by Native Americans hundreds of years before, was beautifully written. Overall, I was less enthusiastic about Professor St. Peter as a character. I sympathize with his melancholy (yet inability to determine exactly why he's sad) and his feeling that his life has largely been without meaning, but I still found him difficult to interpret. So much of his character is based on vague and indefinable emotions and psychological states and though he doesn't physically \"do\" much in the novel, he certainly goes through a series of emotional journeys. Overall, a very beautiful book, but a strange plot (or not much plot) to center an entire novel around."}, {"userName": "Carol Douglas", "userReviewDate": "May 20, 2016", "userURL": "http://www.goodreads.com/user/show/36792905-carol-douglas", "userReview": "I've just read The Professor's House for the first time, and to my surprise it seems to be Willa Cather's best. I had assumed that her wonderful Death Comes to the Archbishop was her best, but I was delighted by The Professor's House. A friend described this book as Cather's psychological novel, and so it is. Professor St. Peter is in love with the life of the mind. As he ages, he discovers that is his main love, greater than his love for his family.  His wife and older daughter seem to be shallow, and I wondered why Cather didn't have any strong women characters in this book. But the book's juxtaposition of intellectual values and material values is unfortunately still timely.  Another major character, Tom Outland, is a well-drawn working class young man with a brilliant mind who manages to succeed despite setbacks.  One troubling note is that one of St. Peter's sons-in-law is Jewish and is seen as a big spender. However, he is also portrayed as generous. He isn't a bad character, but I was uncomfortable that Cather made him Jewish.  But this book is a must-read. If, like me, you've put it off, by all means put it on your list. Her writing is gorgeous and insightful."}, {"userName": "Mercurialgem", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/34242951-mercurialgem", "userReview": "I wish it would have been just a little longer to tell us what happens when the family returns. Does he stay at the old house? Does something develop with Augusta? I do believe his wife loves him but I would have him eventually in a relationship with Augusta and going to live at Tom's Blue Mesa on Cliff City. Also, what happened to Tom's friend.......so many other questions! I liked that the story was divided into three parts. I liked all the characters but Godfrey was my favorite. I would have liked to find out how the relationship between the two couples (the daughters and their husbands)turned out and did they give any money to Dr. Crane? Ahhh.......Oh well."}], "description": "On the eve of his move to a new, more desirable residence, Professor Godfrey St. Peter finds himself in the shabby study of his former home. Surrounded by the comforting, familiar sights of his past, he surveys his life and the people he has loved — his wife Lillian, his daughters, and Tom Outland, his most outstanding student and once, his son-in-law to be. Enigmatic and courageous—and a tragic victim of the Great War — Tom has remained a source of inspiration to the professor. But he has also left behind him a troubling legacy which has brought betrayal and fracture to the women he loves most.", "title": "The Professor's House", "url": "http://www.goodreads.com/book/show/766900.The_Professor_s_House", "average": 3.75, "cover": "https://images.gr-assets.com/books/1347619699l/766900.jpg", "reviews": 505, "authors": [{"url": "https://www.goodreads.com/author/show/881203.Willa_Cather", "name": "Willa Cather"}], "type": ["Fiction", "Classics", "Novels", "Literature", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/766900.The_Professor_s_House", "http://www.goodreads.com/book/show/48203.The_Professor_s_House", "http://www.goodreads.com/book/show/6105710-the-professor-s-house", "http://www.goodreads.com/book/show/19622950-the-professor-s-house", "http://www.goodreads.com/book/show/35478595-the-professor-s-house", "http://www.goodreads.com/book/show/1990662.The_Professor_s_House", "http://www.goodreads.com/book/show/435304.The_Professor_s_House", "http://www.goodreads.com/book/show/20206874-the-professor-s-house", "http://www.goodreads.com/book/show/18604335-the-professor-s-house", "http://www.goodreads.com/book/show/8851659-the-professor-s-house", "http://www.goodreads.com/book/show/28942919-la-casa-del-profesor", "http://www.goodreads.com/book/show/18734608-the-professor-s-house---the-original-classic-edition", "http://www.goodreads.com/book/show/17731919-the-professor-s-house", "http://www.goodreads.com/book/show/17150.My_ntonia", "http://www.goodreads.com/book/show/140963.O_Pioneers_", "http://www.goodreads.com/book/show/545951.Death_Comes_for_the_Archbishop", "http://www.goodreads.com/book/show/48214.The_Song_of_the_Lark", "http://www.goodreads.com/book/show/543137.One_of_Ours"]}