{"ratings": 173044, "userreviews": [{"userName": "Arah-Lynda", "userReviewDate": "Sep 02, 2016", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "My wound is geography.  It is also my anchorage, my port of call.So begins the story of the Wingo family of Melrose Island in Colleton County, South Carolina. As told by Tom Wingo.  To describe our growing up in the lowcountry of South Carolina, I would have to take you to the marsh on a spring day, flush the great blue heron from its silent occupation, scatter marsh hens as we sink to our knees in mud, open you an oyster with a pocketknife and feed it to you from the shell and say, “There.  That taste.  That’s the taste of my childhood.”  I would say, “Breathe deeply,” and you would breathe and remember that smell for the rest of your life, the bold, fecund aroma of tidal marsh, exquisite and sensual, the smell of the South in heat, a smell like new milk, semen, and spilled wine, all perfumed with seawater.  My soul grazes like a lamb on the beauty of indrawn tides.  Tom has a twin sister Savannah and as the story opens Savannah, a successful poet, who lives in New York City has just attempted to end her life by slashing her wrists with a razor blade.  This is not the first time.  He also has an older brother Luke who he idolizes, but Luke is not there as this story opens and to understand why, why his sister is barely clinging with frightening, frailty to life, why his big brother is not present; well, then we have to go back.  Back to when they were children, Back to when Lila and Henry, their parents, controlled the great tides of their life.  It is not a pretty picture. The Wingos of Melrose island were an intensely disturbing, dysfunctional family.  Their three children survived a brutal upbringing, one that they were not allowed ever to discuss or even acknowledge; isolated from the neighbouring community of Colleton, with only each other to turn to for strength, support and comfort.  Their bond seemed unbreakable.Still there is beauty here:It was growing dark on this long southern evening and suddenly, at the exact point her finger had indicated, the moon lifted a forehead of stunning gold above the horizon, lifted straight out of filigreed, light-intoxicated clouds that lay on the skyline in attendant veils.  Behind us, the sun was setting in a simultaneous congruent withdrawal and the river turned to flame in a quiet duel of gold…...The new gold of moon astonishing and ascendant, the depleted gold of sunset extinguishing itself in the long westward slide, it was the old dance of days in the Carolina marshes, the breathtaking death of days before the eyes of children, until the sun vanished, its final signature a ribbon of bullion strung across the tops of water oaks.  The moon then rose quickly, rose like a bird from the water, from the trees, from the islands, and climbed straight up - gold, then yellow, then pale yellow, pale silver, silver - bright, then something miraculous, immaculate, and beyond silver, a color native only to southern nights.These days Tom Wingo is a family man himself with a beautiful wife and three beautiful daughters but he can feel it all slipping away.  He used to be a teacher and a coach, work that he loved, but that was before Luke.  Now he cannot seem to bring himself to give his wife the intimacy she craves, he wants to, but it is like he is frozen, unable to get himself in motion.  He knows even before his wife confirms it, that he is losing her.  Perhaps their time apart, while he is in New York City trying to help his sister will give them both an opportunity to reflect and come to terms with what they really want.   It is in New York that Tom meets Susan Lowenstein, Savannah’s psychiatrist and at her urging turns back the hands of time as he relates the events of their childhood in a last ditch effort to help Lowenstein understand the trauma that may go a long way in explaining Savannah’s suicide attempts and her current mental state.It is the beginning of a long and uncanny season in the house of Wingo.  There will be honor and decency and the testing of the qualities of our humanity, or the lack of them.  There will be a single hour of horror that will change our lives forever.  There will be carnage and murder and ruin.  When it is over, we will all think that we have survived the worst day of our lives, endured the most grisly scenario the world could have prepared for us.  We will be wrong.Violence sends deep roots into the heart; it has no seasons; it is always ripe, evergreen.There will also be Luke, our Prince of Tides. Luke’s story however is one you would be well advised to read for yourselves.But there is also a Bengal tiger and whales and a rare white porpoise and the South Carolina low country.  There is sadness and brutality yes, but also adventure and mirth and heart swelling love; all wrapped up in Conroy’s luscious, lyrical, haunting prose.Later when we spoke of our childhood, it seemed part elegy, part nightmare.I am sure a great many of you have likely already seen the movie with Barbra Streisand and Nick Nolte, which was great.  I loved it!   You may be thinking why should I read the book when I already know the story?   Why? Because there is so much more story here and because it is so beautifully written that it brings tears to my eyes and my chest feels oddly swollen, just remembering some of Conroy’s passages.  The movie cannot even begin to compare or compete.  All The Stars in The Sky!"}, {"userName": "Jason", "userReviewDate": "Sep 02, 2007", "userURL": "http://www.goodreads.com/user/show/331534-jason", "userReview": "This is the book that is the reason I read anything at all for pleasure. I decided I was going to read it before the movie came out and COMPLETELY fell in love with Conroy's style, renewed my love-affair with the low country of South Carolina, and discovered the joy of diving into a book wholeheartedly. Mr. Conroy is the reason I read today. The stories of what this family went through are heartbreaking at one (or more) moment(s) and hysterical at others. I didn't think the movie was half-bad, but the book is phenomenal."}, {"userName": "Robin", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/36555254-robin", "userReview": "I'm wearing my softest, fuzziest slippers while writing this review - treading as lightly as I possibly can - realising that I'm on holy ground here, discussing a much beloved book among many of my very dear and respected Goodreads friends. PLEASE, DON'T HATE ME!This book was at a disadvantage from the beginning, because the spectres of Babs and Nick haunted me continuously from the horrendous movie adaptation. However, I was fully expecting to love and revel in this big, romantic, Southern family epic. I didn't.There, I said it. I didn't love it, I didn't enjoy it. I am bewildered how I received this book so off the mark from legions of other readers. If you love this book, please just laugh and disregard my review and keep on loving it.My first problem is that I found it incredibly sentimental, with prose as purple as can be. An example:He was tall and thin and had a complexion like goat cheese left on the table too long. The funeral parlour smelled like dead flowers and unanswered prayers.And another:I tasted the wine and it was so robust and appealing that I could feel my mouth singing with pleasure when I brought the glass from my lips. The aftertaste held like a chord on my tongue; my mouth felt like a field of flowers. The mousse made me happy to be alive.I also found a very weird, incestuous tone cropped up dozens of times throughout the book. This is a book in which sisters kiss their brothers on the lips, where a brother carries his sister \"like a bride\", where a mother tells a son if she was younger she'd \"have a go\" at him, where a father chases \"lewdly\" after his daughter after she shows him her budding breasts. And so on, and so forth, and I could come up with many more examples. Once I started noticing the weirdness, I just couldn't stop. It gave me \"the no feeling\".I found the dialogue to be horrid - characters constantly used each other's names in almost every line of dialogue. \"Are you enjoying this Tom?\" \"Lowenstein, I really am not.\" \"Oh, Tom, Tom, but why not?\" \"I wish I knew, Lowenstein.\" \"TOM!\" \"Lowenstein!!!!\" Once I noticed it, it was impossible not to notice it, and cringe. I felt like I was watching a terrible 1980's movie most of the time, with a showy, cinematic predictability. And, believability went out the window with the TIGER. For goodness' sakes!!! A very poor shrimping boat family has a Bengal tiger in their barn?Finally, the love story between Tom and Lowenstein did nothing for me. She wasn't particularly likeable (and so unprofessional, I might add!). So much build up leading to their relationship and then the sex scene was chaste enough to fit in a Stephenie Meyer book. BOO. And the way it ended was over the top, cheesy. Now that I've complained mercilessly (and I apologise for that), I will say one thing Pat Conroy does consistently well, and which I appreciated, is convey his love for the American South: its beauty, its vibrancy, its imperfections and uniqueness. The South, in particular Colleton, South Carolina, is the main character and anchor to the rest of the players in the story. The sense of place and its tidal pull on the Wingo family is indelible and irresistible. That is where the gold lies."}, {"userName": "Perry", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "A Riptide\nIn Southern English, \"naked\" means you ain't got no clothes on, while \"nekkid\" means you ain't got no clothes on and you're up to something. Lewis GrizzardClip of the 3 kids in film version of novel\n\n\"Man wonders but God decidesWhen to kill the Prince of Tides.\"\n\n A verse from the eponymous poem by Savannah Wingo, the suicidal sister and renowned poet in Pat Conroy's The Prince of Tides, a novel dealing on its surface with the general mentality of the Southern United States, particularly of the region's male gender.Conroy's protagonist Tom Wingo gives a first person account of the heart-stinging story of the Wingo family of the South Carolina coast, primarily to his sister's NYC therapist in an attempt to save sis's life after a second suicide attempt. The novel provides fertile ground for delving deeply into conflicts among family members, the steadfastness of the grandfather's religious beliefs, marital infidelity (wounds and healing), the bonds between siblings and the lifelong scars left by a parent's physical and mental abuse and by a barbarous rape. The story is also a serenade to our need for amore', and the irony that humans, so capable of loving friends, family and mates, can also show more savagery than any other species to our own species and to our environment. Through the contrast between New York City and a fishing village on the Carolina coast, Conroy examines these issues in a superb self-reflective way, showing that we can find love anywhere, when we least expect it and with someone we initially see as so different; and, love will follow us wherever we go, so long as we let it.Splendorous and distinctly Southern."}, {"userName": "Julie", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/5211606-julie", "userReview": "Passion swells for this epic, The Prince of Tides, and so I swim in murky waters here, careful in my criticism not to become The Princess of Against the Tides.Ah, hell. Who am I kidding? This princess often swims against the tide and her upper body is strong.So, let me not mince words. Let's get right to it.Pat Conroy has almost as many devotees as Jesus. I'm not sure about the source of the appeal, but he looks like a jolly gnome in the pictures I've seen of him, and I take him for a man who shook hands vigorously at book signings.Okay, so he was affable (I'm not entirely sure; you'd need to ask Wife #1, Wife #2 or Wife #3 how she felt about him), and I enjoy affable types, but I'm not sure why more attention hasn't been placed on some of the damnable mistakes in his writing.First off, Mr. Conroy is incredibly inconsistent. He'll write something lovely and memorable, like, “when we spoke of our childhood, it seemed part elegy, part nightmare.” Or, “I was the son of a beautiful, word-struck mother and I longed for her touch many years after she had no obligation to touch me.”And then he'll carry on for eons with some overly wordy, barely readable prose. I would struggle, page after page, reading these “rants,” which felt almost like the long-winded stories my children tell me, as I drive them home from school. You know, the stories that feel as though they have no punctuation, no beginning or ending, and require the storyteller to say them all in one breath?Also, um. . . ahem, anyone else made uncomfortable by Tom's mother wanting to make out with him and both brothers wanting to hook up with their sister? Who is this guy, John Irving? And, last but not least, the dialogue. For the love of God, come on, now! Even if you love this book, I ask you to return to it and read about 20 pages of the dialogue. Truly, do me this favor, before you deem me “harsh.” Clearly, this was not Mr. Conroy's strength as a writer, and, luckily he is more prone to descriptive narrative than passages of dialogue, but whenever it occurred, it pulled me right out of the story. Quick example:“Where ya going, Tom?”“Nowhere, Savannah. I'm going nowhere, Savannah.”“But did ya want to, Tom? Did you want to go somewheres, Tom?”“Nah, Savannah. But ya know what, Savannah? I'm hungry, Savannah.”I'm telling you, I've read better dialogue produced in short stories by high school freshmen.So. . . what made this story all the rage? Was it the occasionally beautiful prose? The imagery? I experienced some of that. Was it the focus that was placed on the need for men to pursue mental/emotional support? I liked that, too. Men need mental health outlets as much as women do, and I hate that our society has long made it taboo for them to seek it. Was this book instrumental in shifting mindsets? I don't know.I do know that the movie did nothing to help my reading experience. I thought (almost relentlessly) of Barbra Streisand's acrylic nails and Nick Nolte's hair in his famous mugshot, as I was reading it. And, worse than that, I pictured Nick Nolte's mouth, slack from overdosing, whispering to Streisand's lacquered nails. . . Lowenstein. . . Lowenstein. Hard to get past that, though it's not the book's fault.So, back to the book. Most Conroy diehards tell me that Tides isn't their favorite; it's typically The Great Santini, when I ask. I'd be happy to receive Conroy suggestions, and I'd be open minded toward another read.This was just surprisingly disappointing to me.Three stars, says the Princess Against the Tides. . . three stars for some great one-liners, a fantastic title, and the book's long-lasting, cultural impact."}, {"userName": "Matthew Klobucher", "userReviewDate": "Jun 15, 2007", "userURL": "http://www.goodreads.com/user/show/14494-matthew-klobucher", "userReview": "Pat Conroy's prose is tragically acquainted with all the misery and glory and pain and beauty of humanity. It is also deeply entrenched in the American south. I believe he immortalizes his own time and place the way Hemingway did for wartime Europe. This story, so startlingly brutal and direct in it's engagement of the reader, lays out the impressive and failed life of Tom Wingo. The plain good virtue and astonishing cruelty of small-town South Carolina take shape in an uneasy and inevitable connection, vying ferociously with the complicated sadness of modernity. This book is treacherous and difficult, wounding at the very threshold of a happy or cathartic moment, and while it is not always pleasant to read, it is provocative and cathartic. It is an angry and sensitive book, dedicated to an ideal of America and made up of terrific stories. It is all tied together in the structure of a novel, and ends up being well worth the read."}, {"userName": "Kelly", "userReviewDate": "Jul 02, 2010", "userURL": "http://www.goodreads.com/user/show/1347210-kelly", "userReview": "I can't remember the last time I felt this torn; I hated the characters for being so selfish with their affections, so cowardly in their confrontations, the cruelty shown when the moment was theirs for the taking. What I hated more was when the victim on the receiving end - and, to be fair, it always rotates - would rise up in anger, but then crumble to their knees in love and forgiveness. And that's also why I loved them. In one moment they felt so betrayed, so dishonored by blood and by love. Then would wait five minutes, and forgive them because of who they were..family. The parents who brutalized but also showed beauty, the siblings that both threw each under the bus and saved them from it, and the hometown that treated them like nothing more than low-rent scrubs. And all those in-betweens: the hits, the tragedies, the shining moments, the crimes so unspeakable it leaves the reader wondering if there really is God...they stream in and out of life, the yellow & red threads in life's tapestry. I've read other reviews on this book, and I think 75% of them got it wrong. While the location is in South Carolina, and the southern culture itself becomes a character in it, that town feeling, that family feeling - that can be anywhere. And finally, even had I not been utterly entranced by Conroy's writing style, I never would have wished for one page less."}, {"userName": "Vanessa", "userReviewDate": "Apr 11, 2009", "userURL": "http://www.goodreads.com/user/show/752176-vanessa", "userReview": "Before I wrote this, I took a cursory look at a few of the reviews and realized to my dismay that in this case I am the Grinch who took the roast beast. And yet I stand by my rating because this book was for me an exercise in maudlin pablum. The protagonist experiences all matter of tragedy in his youth, both quotidian and bizarre (an abusive wretch of a father, a venal socially climbing mother, a horrific yet nonsensical assault) and then grows up to have a mentally ill sister and a cheating wife. There's also some mystery about his brother's fate but I won't spoiler it for you (hint: it's nonsensical too.) The aforementioned sister has suffered a breakdown which takes him from South Carolina to NYC where he meets her therapist. There, he tells the story of their life to nice therapist lady with lines like, \"I haven't gotten to the worst part yet. I haven't told you about the time they picked up and MOVED my hometown, Doctor. Ahem, sniff sniff.\" Yes that scene is in the book. At some point he hooks up with the therapist. She has a snooty violinist husband. That is the highlight reel. Now you don't have to read this book. De nada.(I'm not completely heartless. The story about the pet tiger choked me up a little. Wait-a pet tiger in South Carolina? In the 1940's? See I told you this book was freaking ridiculous. By the way, I read this around the same time the movie came out and told a friend who had seen it I hated the book but the part with the tiger was sad. She said, \"Tiger??\")I have heard that The Great Santini was a better Conroy book and I did like the movie version of it. Then again, people seem to like this book too. So for now, I'll go back to stuffing the Who's Xmas tree up the chimney."}, {"userName": "Carol", "userReviewDate": "Jun 20, 2014", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "I really did not intend to read The Prince of Tides anytime soon until a couple avid reading friends told me I should not pass it by......and they were so right!If you've seen the movie, you already know this is an unforgettable and disturbing story set in both the South Carolina low country and New York City about an extremely dysfunctional family with abusive father Henry and complacent mother Lila whose children are traumatized by their treatment during childhood.......but while Henry's brutality would leave a lasting impression on all their lives, it is nothing compared to the scary as hell seven-foot giant who would forever terrorize Luke, Tom and his twin sister Savannah. (I can still see him starring in their window)Despite all the dark hidden secrets that eventually come to light, this emotional story reveals some good times and laughable moments too......like grandmother Tolitha's episode inside the casket.....and Henry's fried \"Alpo\" dog dinner, (my favorite) and combined with Tom's sarcastic wise-crack humor and close, loving relationship with his siblings, the jesting does help to lighten the severity of horrors endured and tragedy of loss. While the book is centered around Savannah's insanity and treatment by Dr. Susan Lowenstein, their very disturbing childhoods are narrated by Tom who hopes to bring his sister back from her world of demons and silence.Except for bits of animal cruelty here and there (that I abhor) this is an incredible story and extraordinary novel. I remember the movie being quite good, but the book in comparison has much more detail and is IMHO exceptional."}, {"userName": "Debbie Zapata", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/22110057-debbie-zapata", "userReview": "This book was, like all of Conroy's titles, intensely gripping, humorous at times, coarse and gruesome at others, with more than a few touches of sheer poetry scattered everywhere.Conroy excels at describing tortured family life; in this case the Wingos of South Carolina. Through narrator Tom's eyes, we learn about his parents, his older brother Luke, and his twin sister Savannah. Rarely does one family have so much happening: whether drama comes from inside the family circle or from without, it finds these children and their parents and puts them all through hell. I've read enough Conroy to know that his childhood was nearly as tortured as Tom Wingo's. I admire the courage it must have taken to face his own demons in the way he had to in order to write any of his books. Perhaps it was a necessary step to understanding his own life and the past moments that made him who he was. That is the way things turned out for Tom Wingo, so why not for Pat Conroy also?"}, {"userName": "Eileen", "userReviewDate": "Dec 17, 2008", "userURL": "http://www.goodreads.com/user/show/1811610-eileen", "userReview": "I'm waiting for the day that Pat Conroy will disappoint me. I'm waiting for the day that he fails to astound me, to take my breath away with each poetically seductive word that he has chosen, to stir emotions deep within me that I only feel and understand when I am reading his literature.I am pertinaciously confident that that day will never come."}, {"userName": "Glenn Sumi", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "Oy gevalt. I think this is a case of a book not aging well. Back in the 80s, this novel was an enormous bestseller and (if I recall) was pretty well received critically too. And, of course, it was made into a lavish movie starring Barbra Streisand and Nick Nolte. But holy sun, stars and moon... this thing is wildly, extravagantly overwritten. Perhaps it needs to be appreciated in its context. Stories of abuse weren't as common back then as they were to be later, so it must have been considered bold and brave. And Conroy's descriptions of the South Carolina lowlands are still beautifully evocative, if excessive.That said, I didn't believe any of the characters: football coach Tom, his suicidal twin sister Savannah, a Sylvia Plath-like poet, and especially not Savannah's New York Jewish psychiatrist, Susan Lowenstein. (Don't get me started on Lowenstein's concert violinist husband.)Even after the big emotional climax, which (let's be honest, here) we've seen coming for at least 250 pages, there's lots to go. The pacing is way off in the final 50 pages. And despite the length of the thing, there are many, many unanswered questions.I interviewed Conroy once, and he was the nicest, sweetest, most charming guy imaginable. RIP, sir. You entertained a lot of people with your stories. I hope your other books are a little bit subtler in their effects."}, {"userName": "Anna Ligtenberg", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/1434502-anna-ligtenberg", "userReview": "After years of reading predominantly great reviews of this book, I finally read it, only to wonder why everyone was raving. Perhaps Pat Conroy explained it himself, when he wrote \"Savannah's living proof that writing poetry and reading books causes brain damage.\" I found myself skipping entire pages of pointless description and only skimming the entire \"children's book\" written by Savannah.Most of the momentous events of the story require the reader to accept the most unbelievable things (Bengal tiger...) as facts of life for the Wingos, but the children's book crosses a line; this book within the book is only horrific in that it's a book no publisher would have published because it's a book that no parent would ever have let their child read.Throughout the real book, beginning with Tom's reference to his daughters' \"lovely, perfectly shaped behinds\" to the children's book and all the way to the end, there's a tinge of incest and inappropriate sex to everything that leaves me needing a shower. I'm giving the book 2 stars because I think the story, buried under way too many words, is an interesting one - it's just too hard to find most of the time.- AnnaLovesBooks"}, {"userName": "Chrissie", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "[to surrender but then is shot while looking one more time at their old home (hide spoiler)]"}, {"userName": "Lori", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/6593665-lori", "userReview": "I almost didn't read this one because I have seen the movie numerous times and really didn't care to read about the romance of a small town coach and a big city psychiatrist. This book is SO MUCH BETTER THAN THE MOVIE!!!! Tragic and humorous. Shocking and touching. Brutal and tender. Honest and delusional. Love, fear, unadulterated hatred and inconceivable forgiveness are all combined in an eloquently written novel."}, {"userName": "Aimee", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/2376592-aimee", "userReview": "This book came highly recommended to me by a coworker. This novel, however, is the most absurdly sentimental and overwrought book I have picked up in many moons. It's hard to describe the feeling of rolling one's eyes for 567 pages. For example, a priest does not just pray with a soldier - instead, \"The priest knelt beside my father and they prayed together, priest and warrior transfigured by moonlight, by warfare, destiny, and the urgent, mysterious, and ineffable cries and secrets of souls turned inward upon themselves.\" Another example: it feels as though the author thought up some great descriptions and wanted to use up as many as he could on each character just to tick them off his list. Here's an example of an undertaker who is in the story for all of 15 pages (at most): \"Winthrop Ogletree...was tall and thin and had a complexion like goat cheese left on the table too long. The funeral parlor smelled like dead flowers and unanswered prayers [???]. When he wished us a good day, his voice was reptilian and unctuous and you knew he was only truly comfortable in the presence of the dead. He looked as if he had died two or three times himself in order to appreciate better the subtleties of his vocation. Winthrop Ogletree had the face of an unlucky vampire who never received an adequate portion of blood.\" Okay, okay, OKAY! Got it! And these quotes don't even demonstrate the excessive sentimentality of every emotion being stretched to its utmost. Did I hate every page? No, of course not. It had compelling story lines. I just felt like I was running through molasses to get anywhere."}, {"userName": "Merritt", "userReviewDate": "Nov 02, 2007", "userURL": "http://www.goodreads.com/user/show/105514-merritt", "userReview": "I don't understand why this book gets rave reviews. I made it through the nearly 600 pages, but I can't say that I enjoyed most of it. Here is a random excerpt: \"I tasted the wine and it was so robust and appealing that I could feel my mouth singing with pleasure when I brought the glass from my lips. The aftertaste held like a chord on my tongue; my mouth felt like a field of flowers. The mousse made me happy to be alive.\" Give me a break. Am I supposed to believe all of this? I felt like the novel was really over the top and long. And the ending... bah."}, {"userName": "Bill", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/810550-bill", "userReview": "I read a lot of different genres. My only goal is to be entertained. I'll read horror in the hope that there is an author out there who can still shock me. I'll read fantasy or science fiction in the hope that some author will blow my mind with an incredible world or amazing life forms. I'll read suspense thrillers in the hope that there is still an author that will break the mould and twist a plot line so unexpectedly that it will keep me awake at night.Those are the things I look for, and the things that will make me rate a book five stars.But underlining all of this, is the most important thing of all. Keep me engaged with a great story with great characters.Well, obviously you can see the five star rating here, so you know what the deal is.The Prince of Tides is one of the best novels I've read in a long time. It's not horror or otherworldly or has an urgent hunt on for a homicidal lunatic. This is simply a family drama, about a South Carolina man whose twin sister has attempted suicide. The story follows Tom as he travels to New York City to discuss his sister's state with her psychologist and he relates theirchildhood to her in the hopes that she can better understand her patient.My kindle edition had this listed as 647 pages, but I would imagine the print edition had the words densely packed as this seemed longer than that. Not to say this was a slog, because the story was very difficult to put down. This issimply a big book!Pat Conroy is a master storyteller. His dysfunctional southern hick family has all the quirkiness you would want, and all the sensitivities you would expect from close knit siblings. The quality of writing and sheer engaging quality of the narrative is something you would expect from Stephen King if he was a straight fiction writer.The best thing I can say about any novel is that I am sorry it is finished. I loved being into it.An easy five stars and highly recommended to anyone."}, {"userName": "Rita", "userReviewDate": "Sep 27, 2015", "userURL": "http://www.goodreads.com/user/show/22264452-rita", "userReview": "Even though I have read this book twice I just purchased it on Amazon Kindle so I can read it again"}, {"userName": "Kathleen", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/39134508-kathleen", "userReview": "My husband and I listened to THE PRINCE OF TIDES on Sirius radio while driving across Eastern Canada. This was was our introduction to the well known and loved author, Pat Conroy. The beginning of my love affair with the work of Pat Conroy was this intense, dramatic, passionate, sad and humorous story. Pat Conroy introduced the audiobook THE PRINCE OF TIDES and praised Frank Muller for fantastic job he did reading this story. Mr. Muller changed his voice for the narrator and different characters and used lots of expression bringing the story alive. I can easily see why this was a best seller and highly recommend it. 5 stars"}, {"userName": "Vanessa", "userReviewDate": "May 31, 2012", "userURL": "http://www.goodreads.com/user/show/2906120-vanessa", "userReview": "I just don't even know what to say.... \"Epic\" would be the understatement of the century. This has got to be one of the most f*cked up family stories I've ever read/listened to. Right off the bat, that works in the authors favor because I tend to like books that can really shock me. What an insane imagination Pat Conroy has and his writing is  pure poetry . I had to stop my audiobook so many times and rewind it just so I could jot down some of his more beautifully crafted metaphors and descriptions. Not to mention the huge list of vocabulary words I was constantly cross-referencing with Websters! But I found it a pleasure rather than a hindrance.The story itself, admittedly for me, started it out slow. But I truly placed my faith in the people that recommended this to me and carried on with it. A third of the way though, I was fully hooked. Of course, Frank Muller narrating the whole thing with all of his fabulous southern accents and voice variations served only to further hypnotize me. When I was tuned into  The Prince of Tides  I was under a spell. So, so many memorable scenes will stay with me. Hilarious scenes, outrageous scenes, deeply disturbing scenes.... it's all there if you're willing to take a ride on the tides with the Wingos. And I highly recommend you do, with Frank Muller manning the boat. That said, through these pages, I think I've seen as much of the south as I care to. Check that off the bucket list!"}, {"userName": "Bob Mayer", "userReviewDate": "Nov 29, 2014", "userURL": "http://www.goodreads.com/user/show/4460714-bob-mayer", "userReview": "I recently re-read this after many years. First, Pat Conroy is one hell of a writer. His prose is lyrical. I always say if Jimmy Buffet can set your words to music (﻿﻿﻿The white porpoise comes to me at night, singing in the river of time . . .) then you are a heck of a writer.His books have so many plots it's always interesting to see the film adaptation.Te only thing that strikes me is how over the top every plot line is. Nothing ordinary ever happened to a Wingo. Or to any of Conroy's characters. They save the white porpoise; they're born in the storm of the century with the black midwife dying holding on to them; their grandmother travels the world; their grandfather carries a cross through town; the narrator immediately accepts the only black player on the team and runs for a touchdown, etc etc. etc to a point where it's almost numbing.Nevertheless, a highly recommended read."}, {"userName": "Theresa Alan", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/3268839-theresa-alan", "userReview": "This is the second time I’ve listened to the audiobook of this wonderful novel. The narrator does a phenomenal job. The first time I listened to it was several years ago when I was commuting to work, and there is one scene that had me bawling my guts out, which is super embarrassing when you’re in heavy traffic on the highway.In the story, poet Savanah has attempted suicide again. While she is in a mental hospital recovering, her brother Tom comes up to New York from South Carolina to check on her. Her psychiatrist, Dr. Lowenstein, wants to talk to him to find out about Savanah’s past to see if that can help her help Savanah. So Tom recounts their difficult childhood as the children of an abusive shrimper father and a beauty queen mother who was discontent with motherhood and their poverty. There are several scenes that recount the differences between the poor and the privileged. Through this narrative device of Tom meeting several times with Dr. Lowenstein, Tom tells sprawling stories of their youth. Sometimes it’s almost like you’re reading interconnected short stories, but the writing is masterful, so you don’t mind going on what can seem like tangents. Plus, there is humor, and the siblings (there is also another brother, who is dead by the time we start the novel, but we learn about him as Tom recounts their upbringing) are likeable, complex characters. All the characters are well drawn. The South and history are also characters in the book. Tom himself is in a crumbling marriage, and he screwed up his career as a high school football coach. I love this novel and highly recommend it. It’s my favorite Pat Conroy book.For more of my reviews, please visit: http://www.theresaalan.net/blog"}, {"userName": "Robert", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/5537205-robert", "userReview": "I’d like to apologize for deleting the comment thread in my overzealousness to update my edition from Hardcover to Kindle. I love comments, and I can assure you I don’t go around deleting comments just for the hell of it. In fact, my wife and I had a conversation recently about how thrilled I was to receive multiple comments before I’d even read this book and written the review, and then I go and accidentally delete said comments. If they gave out awards for accidental stupidity, I’d be on the nominations ballot. And since this is probably as good a time as any to throw a bit of commenter love out there, let me roll out the red carpet for you and say how much I enjoy all of your comments. There aren’t too many things better than talking about books (well, I can think of one). And with that, we’re on to the review.I hated Henry, Savannah, and Lila Wingo, Reese Newbury, Herbert Woodruff, and Monique. But I loved Tom Wingo and Susan Lowenstein and this novel. This novel covers the taboo subjects of rape, child abuse, and suicide attempts, and it does so unabashedly and with language and pitch-perfect storytelling ability that will literally tip over your emotional applecart.THE PRINCE OF TIDES peels back the curtains of the small-town, southern life, and it gives the reader a front row seat on shrimping and family loyalty, often taken to absurdist extremes. Almost anything is bad when taken to excess, and beating little kids followed by a flat-out denial that it ever happened takes awful to a whole new level. It’s so bad that little children are told to never mention what happen, or pretend that it didn’t happen. There’s a word for that and irrational probably doesn’t even begin to cover it. No matter how much you try to bury something, though, you eventually “come to a moment that we can’t pretend isn’t real.” And this book is filled with several of those moments.This novel also highlights why I’ll never live in New York City. I’m a southern gentleman at heart—referring to women as ma’am and ladies and opening doors—so if I were to live in The Big Apple, at some point I’d run into the feminist gestapo, during which I’d have my eyeballs poked out, my throat scratched, and I’d be pummeled to within an inch of my life all because I had the audacity to hold a door open for a lady. So I’ll stick to my southern roots and say y’all come back now, ya hear. And if you like the south and enjoy going on an emotional roller-coaster ride, you’ll certainly enjoy this novel."}, {"userName": "Maureen Brunner", "userReviewDate": "Jun 10, 2008", "userURL": "http://www.goodreads.com/user/show/1227593-maureen-brunner", "userReview": "If you are interested in reading novels with vibrant descriptions of the southeastern US, Conroy is a good bet. I gave it three stars mostly because of the wrap up of the plot and the ending. It fell flat and was depressing. Although the protagonist Tom represented a complex and thoughtful narrator in the beginning of his tale, I was unhappy with his adult self, the decisions he made, his attitude towards life, and the consequences of his decisions. At the onset of the story, the author begins by expertly winding Tom's narrative around his psychotic sister's \"final\" break down and the start of her rehabilitation. However, as the story unfolds, this angle gets lost in Tom's own mid-life crisis affair with the not very convincing character of Dr. Susan Lowenstein. This supposedly brilliant doctor, who initially bullies Tom and tries to keep him from his sister for her own good, turns out to be an idiotically subservient wife to her cheating husband and an overindulgent mother to her spoiled rotten teenage son. Tom's becomes involved in Susan’s marriage and the “taming” of her son and eventually is faced with a life altering decision that has nothing to do with the original plot and epic story. At the resolution, I was left depressed and uninspired.I think the most interesting character was Tom's mother. Their relationship was complex, but she was believable and memorable."}, {"userName": "Janet Ollman", "userReviewDate": "Jun 14, 2008", "userURL": "http://www.goodreads.com/user/show/1237476-janet-ollman", "userReview": "My favorite novels are written by Irish authors or authors from America's South. \"Mama won't read that novel...it's too uplifting!!!\" O.K., I have been accused of liking novels with a darker side. Guilty as charged. The theme of Prince of Tides is indeed dark...but oh, the beauty of the words that Pat Conroy weaves together. He is a Master of Words. On page one, his words grab you and he won't let you escape until the final page. Pat Conroy begins, \"My wound is my geography. It is also my anchorage, my port of call.\" In a nutshell, that is the book's theme. Tom's wound is his anchor, his life. His wound is his family and his southern upbringing. I have read many Pat Conroy interviews. He gives his mother and his English teachers credit for his gift with words. In an interview on The Book Report on America Online, Pat Conroy was asked the following question: \"Pat, who was your biggest influence as a beginning author?\" He responded, \"No question. Thomas Wolfe. Look Homeward Angel. An English teacher gave them to me when I was l5, and it changed my life.\" The power of a good teacher can never be measured!!! Pat Conroy's novels show us that even in the depths of unimaginable horror, there is hope, beauty and family...however dysfunctional that family might be!!!"}, {"userName": "Heather Neill", "userReviewDate": "Jun 14, 2012", "userURL": "http://www.goodreads.com/user/show/10146029-heather-neill", "userReview": "This book. Is stunning. Pat Conroy is a genius. One of the main characters is a poet, and excerpts from her work are brilliant. How many time have you cringed when otherwise talented writers of fiction attempted to include the \"poetry\" of their characters? No cringing here. if you can, listen to this book on audio, narrated by Frank Muller. Holy crap. He turns a near perfect novel into a masterpiece. I am not exaggerating."}, {"userName": "Steven Walle", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/37850168-steven-walle", "userReview": "Full review later."}, {"userName": "Leslie", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/13269612-leslie", "userReview": "When I started Pat Conroy’s Prince of Tides I expected to get a good read based on the accolades Conroy’s books have gotten. What I didn’t expect was how much I loved the book. It really took me by surprise how much I got into the story and enjoyed reading the tumultuous, horrible, quirky and loving lives of the Wingo family.Much of the credit goes to Conroy’s wonderful writing and narration. It’s was interesting how the writing was very poetic and lyrical but still had this casualness which made it easy to read and enjoy. Despite the expansive vocabulary (I’ve never had to look up so many words before), it didn’t bogged down the narrative making it difficult for you to want to continue reading. Conroy managed to eloquently convey the complicated relationships and feelings of the family at the heart of this story without having to make you work for it.It also helps that the narration was full of self-deprecating and sarcastic humor from the book’s narrator, Tom Wingo. Imagine my surprise when a couple of paragraphs into my reading when Tom busts out some one liners and having some cheeky conversations with his 3 young daughters who all seem to share the same brand of humor as their dad. While Tom’s humor certainly helped make reading the story fun, it also served to reflect how his childhood has affected him. Through his voice, you come to see that he uses his humor to hide, express and deflect his issues stemming from his childhood. It makes Tom a character that is likeable and sympathetic but never one that you pity in spite of discovering the kind of the life he had growing up in Colleton.Conroy created an interesting family that is at the heart of the story. Through Tom’s eyes you discover a family that’s full of contradictories and pain but has a great capacity for love. Each member of the Wingo family from the parents Henry and Lila to their children, Luke, Savannah and Tom, have their own distinct personalities that oftentimes cause clashes amongst themselves but enables them to understand each other in a way that no one else in their small town can. Their household is a battlefield in of itself and also their haven. As you read through the story, you find yourself often appalled at the behavior of the adults but then something will happen which you begrudgingly feel for them and get a small understanding of what drives them which you end up being like one of their children. You gain a certain love/hate relationship with both Henry and Lila which I suppose is par for the course with many families. Through the Wingo family’s trials and conflicts, Conroy encompassed the best and worst of living in a small Southern town with all the quirks that goes with it.It was a pleasant surprise to have found a book that went beyond my expectations. Conroy wrote a story full of charismatic characters with a complex family dynamic that was filled with both heartache and love. His intelligent, eloquent and witty writing really made reading the book a joy and thoroughly kept me enthralled in Tom’s narrative. This is the sort of book that gradually pulls you in and quietly goes about its job of engaging you. This was an epic family story that didn’t have the feel of one which reflected the contradictory and complex nature of the story itself."}, {"userName": "Barbara", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/798978-barbara", "userReview": "This book published in 1986 has been described as a masterpiece and a compulsive read. It is a tribute to coastal South Carolina and a way of life that has been all but lost. The Wingo families fish for shrimp. Today 97% of US shrimp are harvested in Louisiana and Texas. Tom Wingo travels to New York City when his twin sister is hospitalized after a suicide attempt. Her psychiatrist,Susan Lowenstein, spends many hours talking to him about her past and their family history in order to get to the bottom of what disturbs her so profoundly. Susan is upper middle class, Jeiwsh and a New Yorker. It is not surprising that she and Tom, a high school English teacher and football coach clash. New York doesn't appeal to Tom but he spends months there living in his sister's apartment while she is hospitalized. He feels the disdain of New Yorkers who see him as an uneducated redneck. But New York reminds Tom of all the things he loves about his home in South Carolina.This novel is an ode to the Southern way of life with all its warts and charms. The waning of the lifestyle of shrimpers is similar to what has happened to fishermen in New England and crabbers in the Chesapeake Bay. There are many global and environmental reasons for these changes. In this novel, we see up close the impact on a community and a family when these changes occur. This novel is tragic on many levels - the individual, the family and the community. It is one of those long novels that tells an epic story. The prose is lyrical and a pleasure to read."}], "description": "In his most brilliant and powerful novel, Pat Conroy tells the story of Tom Wingo, his twin sister, Savannah, and the dark and violent past of the family into which they were born. Set in New York City and the lowcountry of South Carolina, the novel opens when Tom, a high school football coach whose marriage and career are crumbling, flies from South Carolina to New York after learning of his twin sister's suicide attempt. Savannah is one of the most gifted poets of her generation, and both the cadenced beauty of her art and the jumbled cries of her illness are clues to the too-long-hidden story of her wounded family. In the paneled offices and luxurious restaurants of New York City, Tom and Susan Lowenstein, Savannah's psychiatrist, unravel a history of violence, abandonment, commitment, and love. And Tom realizes that trying to save his sister is perhaps his last chance to save himself. With passion and a rare gift of language, the author moves from present to past, tracing the amazing history of the Wingos from World War II through the final days of the war in Vietnam and into the 1980s, drawing a rich range of characters: the lovable, crazy Mr. Fruit, who for decades has wordlessly directed traffic at the same intersection in the southern town of Colleton; Reese Newbury, the ruthless, patrician land speculator who threatens the Wingos' only secure worldly possession, Melrose Island; Herbert Woodruff, Susan Lowenstein's husband, a world-famous violinist; Tolitha Wingo, Savannah's mentor and eccentric grandmother, the first real feminist in the Wingo family. Pat Conroy reveals the lives of his characters with surpassing depth and power, capturing the vanishing beauty of the South Carolina lowcountry and a lost way of life. His lyric gifts, abundant good humor, and compelling storytelling are well known to readers of The Great Santini and The Lords of Discipline. The Prince of Tides continues that tradition yet displays a new, mature voice of Pat Conroy, signaling this work as his greatest accomplishment.", "title": "The Prince Of Tides", "url": "https://www.goodreads.com/book/show/535759.The_Prince_Of_Tides", "average": 4.23, "cover": "https://images.gr-assets.com/books/1414322088l/535759.jpg", "reviews": 3687, "authors": [{"url": "https://www.goodreads.com/author/show/6942.Pat_Conroy", "name": "Pat Conroy"}], "type": ["Fiction", "American", "Classics", "Contemporary", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/535759.The_Prince_Of_Tides", "http://www.goodreads.com/book/show/9042468-the-prince-of-tides", "http://www.goodreads.com/book/show/16735.The_Prince_of_Tides", "http://www.goodreads.com/book/show/548473.The_Prince_of_Tides", "http://www.goodreads.com/book/show/15787267-the-prince-of-tides", "http://www.goodreads.com/book/show/13163179-the-prince-of-tides", "http://www.goodreads.com/book/show/35341859-the-prince-of-tides", "http://www.goodreads.com/book/show/6809279-the-prince-of-tides", "http://www.goodreads.com/book/show/16729.Beach_Music", "http://www.goodreads.com/book/show/6135237-south-of-broad", "http://www.goodreads.com/book/show/85448.The_Great_Santini", "http://www.goodreads.com/book/show/85443.The_Lords_of_Discipline", "http://www.goodreads.com/book/show/129947.The_Water_is_Wide", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}