{"ratings": 34501, "userreviews": [{"userName": "Shawna", "userReviewDate": "May 15, 2010", "userURL": "http://www.goodreads.com/user/show/1802746-shawna", "userReview": "5 stars – Contemporary/Sports Erotic RomanceThoughts Before Reading:OHHH-MYYY-GAWWWD!! I have absolutely zero saliva left after staring at this epitome of cover HOTness! Seriously, call a doctor quick 'cause I think I've swallowed my tongue.Thoughts After Reading:I think a review for this book is about the equivalent of crotchless panties or raspberry sauce on chocolate cake...totally unnecessary. I mean with a tongue swallowing, eyes bulging cover like this, who really gives a @%*$ what the story is, right? Well, the even better news is that it’s actually a great erotic romance with a too “perfect”, too sexy, to die for hero that can only be found in Romancelandia. And yes, the sex is as satisfying and as smokin’ HOT as the cover! 5 studtastic stars!"}, {"userName": "Auntee", "userReviewDate": "May 15, 2010", "userURL": "http://www.goodreads.com/user/show/886675-auntee", "userReview": "[I know it may sound silly, but that kind of bugged me, especially when the I-love-yous\" had been exchanged. At first it didn't matter to me, because Tara was still thinking that the relationship may just be all about the sex, but once you knew their feelings went beyond that...I don't know, I was just kind of waiting for it, and didn't get it. (hide spoiler)]"}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "What an overrated book. Nothing about the story was new or interesting to me. The sex scenes were hot, but if you want to read a hot sex scene, it's just as easy to pick up an erotica, which I'd rather do to be honest. The story aggravated me on so many levels. It felt like I had fallen into a manufactured after-school special on the dangers of alcohol. I have a teen son and I'm telling you now, he would never be caught dead saying this : I didn't know. I just wanted to be cool like the other guys. It doesn't matter if those are/would be his motives for drinking, he would never say those words out loud, and I'm guessing most teenagers wouldn't either. Also, since when is the \"announcement\" of someone admitting to be an alcoholic such an earth-shattering moment? I almost expected to hear the faint sounds of a Hallmark Hall of Fame movie in the background. Now, if the guy had admitted he was a raging alcoholic who couldn't stop taking out his anger on people - that might have been another story. But to see a woman get so emotionally worked up because the guy she's dating admitted he partied too much in high school and now he chooses to abstain because he realized he was drinking way too much back then? Give me a fucking break. Please let me disclaimer that I am not taking alcoholism lightly. I have experienced the downfalls of it first hand, as I'm sure many of us have through close friends and family members. This disease can wreck lives. Maybe because I know how much it can wreck lives, I was very disappointed in how ridiculous this particular version of alcoholism seemed like a silly plot device.This is the woman's reaction when she figures out why \"Mick\" has refused her offers of a drink over the past few weeks. Her throat went dry as the realization of all these weeks together finally fell into focus. But she waited, not asking, knowing it had to come from Mick.\"I'm an alcoholic, Tara.\"The gut punch hurt. She palmed her stomach, was glad she was sitting, because the room spun.\"How long?\"\"Since I was a teenager. Still think I lived a perfect life?\"She didn't know if she was angry or hurt, at him or for him.Really? A gut punch? A bit melodramatic, I'd say. Now, if she had immediately fessed up to having past issues with people drinking in her life, I would have said...oh yeah, that sucks. No one wants to have to open old woundsOh, but we have to understand because this woman did have her own normal seedy past, and she gave us her own words of \"it's okay, most of us have been there and none of us had profound reasons for doing what we did\" wisdom. Here's her gem from earlier in the book : By then, I was drinking, doing a few drugs too, anything to numb the pain, you know? Now, I know where the kid gets his lingo from. Apparently, mother and son watched one too many Lifetime movies together.Last complaint. I'm thoroughly sick of every \"single mother\" story being about a woman who is emotionally unavailable. I'm tired of so many single mom stories painting this bleak picture of someone who has sacrificed 100% for her kids and won't date because their child comes first in every single area of their life. Yet, the person is sad and hollow on the inside, just subconsciously waiting for a man to come and set them free.Usually single moms (again, been there, done that, got the t-shirt) don't date because they don't have a sitter, they're too busy with work, or they don't have the time to go somewhere to meet men. It's not because we don't want to date, or automatically assume that any guy who tries to get close to us is a dead end. I dated here and there when I was a single mom, and was wise enough to keep my dating life separate from my home life until I was seriously involved with someone. I'm guessing most moms are sensible enough to do the same thing.In closing, this book was so not my thing. Why the 2 stars instead of 1? I actually did enjoy a couple of the sex scenes. It wasn't a total fail..."}, {"userName": "Julie James", "userReviewDate": "Dec 26, 2010", "userURL": "http://www.goodreads.com/user/show/2288290-julie-james", "userReview": "This says it all: I have a ten week-old baby who wakes up every three hours, so sleep is a hot commodity right now. Yet I stayed up late to finish this book because I so wanted to see Mick and Tara get their happy ending. Loved the characters, particularly the hero, who is protective and alpha without being overbearing or angst-y. And it's quite a hot read!"}, {"userName": "Molly Harper", "userReviewDate": "Mar 27, 2011", "userURL": "http://www.goodreads.com/user/show/2185110-molly-harper", "userReview": "I will admit I bought this book because of the cover."}, {"userName": "Catarina", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/11538033-catarina", "userReview": "[Yes. (hide spoiler)]"}, {"userName": "Didi", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/6082482-didi", "userReview": "[when she was 15?! To a drugged out, idiotic crackhead? (hide spoiler)]"}, {"userName": "Mo", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "3.5. I suppose I should bump it up to four for the cover cos that is serioulsy HOT. Loved Mick and his family. Tara was a bit harder to like - why was she trying so hard NOT to have a relationship with him. OK, she was a single mother of a teenage son but she was entitled to a life and happiness too. Don't know the first thing about American Football but I wouldn't mind being down the dressing room after a game ...."}, {"userName": "Pamela", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/3007761-pamela", "userReview": "4.5/5First, let's just take a moment to savor this cover. Jed Hill is among the wonders of nature, and I will never grow tired of staring at his absolutely ripped physique. Fortunately, the book lives up to the cover. Mick is a star quarterback at the height of his career and his carefully orchestrated fame. Tara is an event planner single mom with a 14-year-old son she gave birth to as a teenager. When the two meet at an event Tara plans, neither of them have any idea where they're going to end up.Tara doesn't want a parade of men in and out of her life because of the bad example it will set for her son — and because she's never really had any reason to trust men. Her life is her work and her son. (That's something I can relate to!) Mick, on the other hand, is wealthy, famous, a star — but he's sick of the bulimic models and vain starlets his agent has arranged for him to \"date.\"Although this relationship starts in the bedroom — and it gets off to a sexy start, believe me — it quickly becomes more than just sex. Those of you who love erotic love scenes will enjoy the book, because there is a lot of super-scorching sex in this story. But the emotion isn't lacking either, and by the end you'll be delighted, as I was, when Tara opens herself to the possibility of being with Mick and Mick straightens out his priorities, making a firm decision about what matters most to him in life.My only quibble with the book is that I wanted an epilogue. I wanted to see Tara have the family and support she's never had before. Given that the next book involves Gavin, Mick's brother, a pro baseball player, I'm guessing we'll get some of that then. This is the first book I've read on Kindle, so that was an adventure, too.I recommend this to contemporary romance fans, romantica fans, and those who love sports-star heroes.A quick update: A reader friend e-mailed me privately to ask whether there was anal action in the love scenes because she doesn't like to read that. There is. I don't care for that either — just call me Little Miss Vanilla — but as I told her, I found that I was able to just skip a few lines and be fine. It's a great story, and I'd hate her to miss it for that reason."}, {"userName": "NMmomof4", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/24665574-nmmomof4", "userReview": "[- Does Not have cheating- Does Not have a descriptive sex scene with OW/OM-  Does have the h pushing the H away-  Does have a short separation between the h and H-  Does Not have abuse-  Does Not have OTT sad parts- Does Not have a HEA ending (hide spoiler)]"}, {"userName": "D.G.", "userReviewDate": "Jan 30, 2011", "userURL": "http://www.goodreads.com/user/show/210123-d-g", "userReview": "*2 stars for plot and 1 star for the cover*This book was the equivalent of a very hot guy who is dumb as a tack - great to look at but boring to listen to.The problem with the plot was that there was no conflict. It’s basically the story of two people meet, have tons of sex, fall in love, the end. There were a few very small misunderstandings but nothing that would make you bite your nails thinking that they’re not going to make it. All the problems would have been cleared up if the heroine would have asked the hero one single question but instead she wouldn’t let him get a word and would disappear in a huff. This behavior has put her in the running for \"Dumbass Heroine of the Year.\" Don’t get me wrong, both H/h had some challenge in their lives but neither was relevant to the present because they had already overcome those problems. I don’t want to give any spoilers of the ‘deep, dark, secrets’ (yeah, right!) so I’ll give an example instead. Imagine that you’re reading a book where the heroine is very shy but decides to run for office. Seeing her confront her fear about public speaking, meeting new people, etc. is very different from knowing that she used to be shy but that now she talks in front of crowds all the time. The former makes you sympathize and admire her courage, the latter makes you think “so what?” and that’s the feeling I got reading this book.I did like a few things. The fact that the heroine knew something of sports and that we heard about the hero’s grueling workouts. (Most romance make it seem as if it’s normal for a hero to a get six-pack without exercising.) But that’s about it. The rest was just predictable and boring.So if you want to imagine how it feels to be swept up your feet by a gorgeous, famous, rich man, then this book might be enough for you. If you’re looking for a bit more, then you should skip the book and just look at the cover. Like in the case of a handsome-but-not-so-smart man, it will preserve the illusion that something deep is lurking in that smoldering gaze when in reality, there’s nothing underneath."}, {"userName": "Srta Books", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/51590522-srta-books", "userReview": "4,5/5 en realidad.La historia de amor y los personajes me han gustado mucho. Seguro que pronto leo la segunda parte :)"}, {"userName": "DarienMoya", "userReviewDate": "May 15, 2010", "userURL": "http://www.goodreads.com/user/show/3069494-darienmoya", "userReview": "^^THE WAY ME AND THE GUY ON THE COVER PLAYED IN MY HEAD!^^3.5When I see this cover, I think of a few games I could play with Mick. -Like pin my body parts on his peni…. I mean body.- A little game of you touch mine and I will touch yours.-Naked touch football, naked twister, naked wrestling EtcYou get my point this is one hot cover. Those abs would have me saving money, and hand lotion. I would be doing my laundry on those suckers; it is just one freaking HAWT cover. I am not really into muscles and all that, but I am very into this cover model, and find myself hoping that he would come into…. I mean be into me.Now for the story, I was like ‘Meh’ through it all, I really did enjoy the whole sexy man fall in love with girl next-door type. It gives me hope, that one day some sexy man will come and sweep me off my feet. I can say I enjoyed the book a lot more when they were out of the bedroom.I have always said that something might be wrong with me, cus I am finding the sex between female/male of books to be tiresome. I read it without any interest, and this book was one of those. Just call me crazy, but I think Tara is like the luckiest woman in the world. This woman comes like three times in a row. I sound envious cus I am, just a little bit.Mick I really liked, he seemed like a true genuine character, and as I said really liked the book when they were out of bedroom. I found the sex too plentiful, and tooo odd. By odd I mean, it just felt like they were trying to go too far with it, and then it just sort of fizzled out, by the third sex scene I was pretty much done for. Therefore, I had a hard time with the five-hundred that followed (not that much but you get my meaning). I really like the anal scene, ‘sue me, I love that shit’.This one will be hit with most of GR friends; it was just an ok read for me. I loved learning about football because in reality I could care less. I am considering being a party planner, in reality not the best idea. I loved the whole single mother aspect of the book, as a mother myself I can easily understand the doubts with wanting to get into a relationship. The questions that go with it, will the man accept my child and be respectful. I thought Jaci Burton handled that part splendidly.Overall, liked it just could have done without all the sex."}, {"userName": "bella ϟ  [ bella farren ]", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/23223005-bella-bella-farren", "userReview": "1.5/5 starsI was a little underwhelmed with this book, I felt like everything lead to one big cliche and nothing was really very original about this book. Many of the characters were cardboard cutouts with no real personality, especially Tara. Tara was predictably annoying the entire book, the basis for her character was that she was a single mum working to support her teenage son, but for the majority of the book she was either apologising for her son being a burden or burdening him off to other people. That kid spent almost the entire book which spanned across a 'summer' sleeping at other people's houses, often so Tara could spent alone time with Mitch (such as a tropical weekend getaway for just the two of them).I hate criticising parenting because 1) I am most definitely not a parent and I know that you can't really give much of an educated opinion until you've been in that situation and 2), mum shaming has always been a pet-peeve of mine. I don't think she was a \"bad\" mum in any way, but I think she was built up to be such a selfless character and it missed the mark for me. I found her to be quite self invested and absorbed. I honestly finished this book maybe two hours ago and I've already forgot the majority of what happened. There was no real plot lines apart from the 'romance', which felt fake and annoying. It was more just a pile of sex-scenes and moping characters, rather than a real, exciting romance story that brought out the feels. I was not invested one bit in what happened to the characters, the only people who had real personality were Mick's family, everybody else was predictable. I will definitely not be moving onto the next book because Liz was a character I hated. I didn't hate her decisions but more so that the author than tried to spin her character to just have 'accidentally' been a bitch in her quest to help Mitch's career. I think her motives were never as pure as that, and for the next book to based on her never owning up to her mistakes would kill me inside. edit: I don't mind if there are characters who do bad things, admit them and try to make up for it in one way or another, but Liz was a character who was spun to have just 'lost her way' and never really admitted the selfish reason behind it. She was an underhanded and manipulative character who I do not want to read about."}, {"userName": "Kristen", "userReviewDate": "Sep 11, 2011", "userURL": "http://www.goodreads.com/user/show/5477946-kristen", "userReview": "I love The Perfect Play. It's very erotic, emotional, and captivating. The characters are richly developed and the plot, though somewhat cliché, is engaging and fun to read. I really love this book!The characters are fantastic and realistic.  Mick and Tara, the hero and heroine, are full of flaws and strengths. I easily believed in their struggles, in their triumphs, and in their relationship. There's enormous chemistry between the two, and I simply couldn't get enough them. I thoroughly enjoyed Tara's son Nathan. The author captured the essences of a teenage boy. Nathan was delightful and brought many humorous moments to the book.  I especially enjoyed the mother/son dynamic in this book. Tara relationship with Nathan was realistic and poignant. As a single mother, Tara's insecurity and concerns in raising her 14-year-old son alone, brought a vulnerability to her character that made her extremely endearing to me. Mick was fabulous. I fell head-over-heels in love with him. You can't get a more determined, hardworking, protective, refreshingly honest, and sexier than all-get-out hero. He was wonderful to Tara and Nathan, and helped Tera see herself as she truly was. A remarkable woman.   I also love Mick's family. I'm excited we'll get more of them in the next book. They were interesting, well developed, funny, and easy to love characters. Mick's mother, Kathleen, was exceptional for a secondary character. My only compliant-other than Tara sounding like a B-rated porno star during sex scenes-was the ending. It felt abrupt and left the story somewhat hanging. I needed an epilogue. Something to give the story more closure.   Other than that, I love this wonderfully written, extremely erotic, and very endearing love story. Warning: This story is extremely explicit, and at times made me uncomfortable. Read with caution."}, {"userName": "P ", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/25327841-p", "userReview": "[ทาร่าทำอาชีพนักจัดงานเลี้ยงจนกระทั่งเจอได้พบกับควอเตอร์แบ็คผู้ดึงดูดความสนใจของเธออย่าง มิค ไรลีย์ ทั้งคู่มีคืนที่แสนเร่าร้อนกันหลังจากงานเลิก แต่มิคคิดว่าทาร่าไม่เหมือนผู้หญิงหลายคนที่ผ่านเข้ามาชีวิตของเขาและเขาจะปล่อยผ่านมือไปง่ายๆ เขาตามหาทาร่าจนเจออีกครั้ง และได้ค้นพบเรื่องของเธอมากขึ้นเรื่อยๆ ทาร่าอาศัยอยู่กับลูกชายวัยสิบสี่ปีของเธอที่ชื่นชอบการเล่นฟุตบอลเหมือนกัน นั่นทำให้นาธาน ลูกชายของทาร่าเกิดความประทับใจแรกพบทันทีที่เขาได้พบกับมิค ทั้งคู่เข้าขากันได้ดี ซึ่งช่วยให้มิคได้เห็นตัวตนของทาร่าว่าเธอไม่เหมือนกับผู้หญิงคนไหนที่เขาเคยรู้จักกันมาก่อนมิคพาทาร่าไปพบกับครอบครัวของเขาและได้เล่าเรื่องราวของเขาตอนสมัยเรียนให้ทาร่าฟังว่าเขาเคยติดแอลกอฮอล์อย่างหนักจนลงมือทำร้ายพ่อของตัวเอง หลังจากนั้นมิคก็คิดจะรักษาอาการนี้ให้หายและไม่แตะต้องแอลกอฮอล์อีก ทาร่าผู้ซึ่งผ่านเรื่องราวในตอนเด็กมาพอๆกัน เธอถูกพ่อแม่ละเลยและลงเอยด้วยการปาร์ตี้และท้องในที่สุด นั่นทำให้เธอต้องตัดขาดจากครอบครัวและย้ายไปอยู่ที่อื่น ทาร่ายอมรับอดีตของมิคได้ง่ายดายและยอมให้เขาให้คำแนะนำแก่นาธานเรื่องการดื่มเหล้าเพื่อที่ว่าเขาจะได้ไม่ต้องเป็นแบบมิคเมื่อวันพักร้อนจบลง มิคต้องเข้าซีซั่นเพื่อลงสู่สนามอีกครั้ง แต่นั่นทำให้เขาสับสนมากเพราะเรื่องของทาร่าที่เขารู้ว่าความรู้สึกที่เขามีต่อเธอมันพิเศษและมากกว่าคำว่าเซ็กส์แน่นอน ซึ่งทาร่าก็คิดว่าเธอก็รู้สึกกับมิคเช่นเดียวกัน แต่เธอจะทำยังไงถ้ามิคตัดสินใจทิ้งเธอไป ยังไงเธอก็มีเรื่องลูกและอาชีพของเธอที่ต้องรับผิดชอบ เมื่อลิซ ผู้จัดการส่วนตัวทำให้ทาร่าเข้าใจผิดว่าทั้งมิคและเธอใช้นาธานเป็นเครื่องมือเพื่อการโปรโมต นั่นทำให้ทาร่าตัดสินใจได้และเดินออกไปจากชีวิตของมิคมิคไล่ลิซออก และรอให้ทาร่ากลับมาหาเขา จนกระทั่งวันที่เขาไปชมการแข่งขันของนาธาน เขาได้พบกับทาร่าอีกครั้ง มิครู้แล้วว่าเธอก็รักเขาเช่นเดียวกัน นั่นทำให้ทั้งคู่ปรับความเข้าใจกันได้ในที่สุดและยอมรับอนาคตที่รออยู่เบื้องหน้าของพวกเขา (hide spoiler)]"}, {"userName": "Ezinwanyi", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/4386752-ezinwanyi", "userReview": "Aside from this book being uninteresting, I was baffled that two grown-ups were having such simple misunderstandings when they can just text or call each other.Tara Lincoln was an event planner who was trying to make a name in San Francisco when she landed a huge contract to plan a preseason party for a professional football team. There she met a nice guy Mick Riley and they ended up in bed together. She later finds out that Mick is a quarterback for the professional football team, but they didn’t really discuss this “thing” being anything more. And that was part of the problem for me. There was very little or unclear communication about anything other than sex and career aspirations. Tara and Mick were good at having sex but discussing life and how to have adult relationships, they were quite juvenile in their actions. Well, mostly Tara was the annoying character as she was full of assumptions and didn’t give Mick a chance to explain himself. She was just one of those heroines you want to slap. I liked Mick but their relationship seemed so shallow that I wasn’t sure why he would even want to put up with her drama.The characters were not developed that well and the writing was so inconsistent for me. The narration made the story worse that I considered quitting on the audiobook several times and just reading the paperback. Honestly, this book was forgettable because there are plenty of better done sports romances with single parents finding love. I will try book 2 before I decide on this series but I will likely not listen to the audio because the narrator’s tone grated my nerves.I received this audiobook for free from in exchange for an honest review."}, {"userName": "VeroRinconin", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/35643327-verorinconin", "userReview": "*2'5*Hay ciertos detalles, esos que se descubrieron poco a poco, que me gustaron mucho, pero sinceramente no disfrute de la lectura del libro, demasiadas escenas de sexo, desde demasiado pronto, para mi a esta historia para ser una historia romántica le faltan muchos sentimientos, para mi es un libro de erótica más que de romántica. Un chasquito lector porque no seguiré leyendo ni a la autora ni la serie :/"}, {"userName": "WhiskeyintheJar/Kyraryker", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/2763722-whiskeyinthejar-kyraryker", "userReview": "1.5 stars"}, {"userName": "Annie (Under the Covers Book Blog)", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/2489554-annie-under-the-covers-book-blog", "userReview": "3.5 STARSOh yeah. Jed Hill. I have no saliva left. I can’t stop drooling over this cover. Look at those abs! Those chesticles! Dayum. *gulp*I will admit, I had pretty high expectations for this book and although the sex certainly lived up to the hawt cover, the story didn’t. I thought the beginning was engaging enough. Tara Lincoln, an events planner finds herself under the watchful eye of Mick Riley, the star football player who is just pure sex. I loved the beginning and thought they had amazing chemistry. THE SEX WAS HAWT!!!But when Tara starts making lame excuses to stay away from Mick, I started to get annoyed. I didn’t like that she was so free in the bedroom, but so reserved outside of it. Just. Be. Consistent.In the end, the story didn’t hold my attention like the cover did. I could stare at the cover forever.I ain’t lying. Forever."}, {"userName": "Andrea Lujano", "userReviewDate": "Dec 18, 2012", "userURL": "http://www.goodreads.com/user/show/4763497-andrea-lujano", "userReview": "Este libro hice que me interesara por el Fútbol Americano, aunque sus menciones no son tan significativas, llamo mi atención y este protagonista es un amor de hombre, con un pasado comun pero que le da un toque significativo e importante dentro de la historia."}, {"userName": "Susana", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/7301000-susana", "userReview": "[ Kissing, and sticking a tongue in the anus ...not sexy, not erotic....just plain, UGH!! And prone to a number of diseases (hide spoiler)]"}, {"userName": "Splage", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/4755656-splage", "userReview": "How do I rate this? I think the cover is tainting me because it is the hottest cover ever and because of it I want to say \"I really liked it\" but, the book wasn't as good. I have read every sports romance I can get my hands on and loved most of them, I would actually call myself a Sports Romance connoisseur. I love the sportsman type, basically man whores with incredible bodies that are easy going and fun loving, but eventually tamed. This book just didn't rank up in my top sport's romance reads. I definitely liked the book- did I mention the hot cover- and I will read the next in series but, the story just felt forced, predictable and too perfect. I like perfect, but not \"too perfect\". I did feel a love connection between Mick and Tara and I thought it was cute how their roles were reversed where she just wanted the one night stand unlike him. The were tons of long sex scenes, but the sex seemed awkward, maybe the dialog was just too raw and explicit for the characters. Basically you have a sweet, single mom, event planner that is totally dedicated to her son and business and hasn't been in a relationship good or bad since she was 15 yet, she talked like a hard core porn star when they were intimate. Some of this sex talk was pretty good and was a turn on, but when their love and relationship developed it didn't fit and I cringed a little bit. Also Mick was unbelievably perfect; perfect body, job, family, loved her kid immediately, they gave him one flaw, but he took care of it \"perfectly\". I wanted him to be a little more rakish and cause a little more conflict. I would call it a paint by numbers romance, it had all the right parts; hot couple, lots of adventuresome sex, bits of glamour, minor conflicts- looks good in the end, but still slightly elementary."}, {"userName": "Elise ✘ a.k.a Ryder's Pet ✘", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/13567836-elise-a-k-a-ryder-s-pet", "userReview": "[Yes.. (hide spoiler)]"}, {"userName": "Alia Ros", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/35225329-alia-ros", "userReview": "“Mmmmm, pepperoni. Perfect, indeed.”So in love ❤THIS BOOK WAS HA OMG FULL OF PASSION LUST LOVEAND I LOVED it actually despite the other reviews I read before finishing the book! So it sorta surprised me when i could read it! Ahhaha guess everyones diff huh ahhahReally loved it ❤️"}, {"userName": "valee", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/2320890-valee", "userReview": "Why have I not read any comments about this book before!? Seriously guys, I constantly get recommendations but no one recommended this amazing work of art to me and I want you all to know I'm extremely annoyed by that. So now I'll just have to recommend this book to you all, lol, so you don't wait anymore to go and read this freaking amazing book. I just have no words to express how much I adored it. I had been on a reading crises, rating many books with less than 3 stars and just being unable to find a read that really compelled me. The Perfect Play was one of the best books I have read in a while.The characters were amazing, all of them. This is one of those books which actually gives you the whole package: you have family, amazing values, a great alpha hero and a Strong heroine with more than air inside her head. Let's not forget the amazing sexual tension and chemistry between this 2. No bullshit between this two, just a great relationship developing before your eyes. I has such an amazing time with this book. I couldn't put it down and it had been ages since I felt like this with a book in this genre. So if you guys love contemporary romance, this is the book you all have been waiting for. Enjoy."}, {"userName": "Mandi Schreiner", "userReviewDate": "Jan 10, 2011", "userURL": "http://www.goodreads.com/user/show/2704703-mandi-schreiner", "userReview": "Tara Lincoln is an event planner and owner of The Right Touch. By chance, she lands the summer party of the NFL team the San Francisco Sabers. The party is a complete success and it is here she meets the Sabers' star quarterback, Mick Riley. Mick is usually seen with an actress or model draped across his arm, so Tara is shocked when he takes interest in her. He makes her dance with him, and later invites her up to his hotel room.Mick is tired of his agent Liz throwing beautiful women his way. He wants someone who is not after his money or fame – and when he sees Tara he instinctively knows she is “normal.” She interests him and he really just wants to get to know her. Being extremely physically attracted to her doesn’t hurt either. Although they are perfect in bed together, real life always throws in more complications. Tara is a single mom, raising a teenager. It has always just been Tara and Nathan and she is not used to putting herself or anyone else first. Mick is known everywhere, and that fame is hard to deal with. Convincing Tara this is not a casual fling will be tough for Mick to do.First let’s all just stare at the cover for The Perfect Play. Sexy, yes? Jaci Burton has been hit with the cover of all covers. I honestly don’t know if I could pass this book up if I saw it sitting on the shelves. *wipes drool*I had a tough start with this book. Mick and Tara meet right at the start of the book, and they had never met before. By page ten, Tara states:\"The more time she spent with him, the more she liked him. Dammit. Why couldn’t he be an arrogant son of a bitch, full of himself and talking of nothing by his career and his stats? It would be so much easier to walk away from him if he was self-absorbed. But not only was he gorgeous, he was also funny and was interested in her and her career, and she liked spending time with him.”So Tara knows all this about him by page TEN? Someone she meets on page FOUR. I just don’t think this is a realistic mind set someone would have after just meeting someone. How does she know all of this already? She wouldn’t. And then he takes her up to his hotel room and tells her he is not there to seduce her just to talk and get to know her. Which of course leads to sex. He comes off very pushy to start. Not arrogant as in – hey I’m famous and rich. But arrogant that Tara would naturally choose to be with him. He also assumes right from the beginning that Tara is not out for his money or fame. He makes this assumption without knowing her well enough.So yes, I had a really hard time connecting with Mick at the beginning. but as I continued reading, after a few chapters I felt like the characters calmed down and their relationship took a much nicer turn. I enjoyed Tara’s conflict within herself. She has lived her life always so worried about her son, that just because she meets Mick and does develop feelings for him that doesn’t change who she is. She is still the worried mother. There is one particular scene towards the end where Nathan is used as a ploy, and Tara is hurt by this. And I think this is a great scene because it shows, no matter how much she cares for Mick, Nathan is still the most important thing in her life. She learns to accept other important people, but it really stays true to her character.I really enjoyed the pages spent with Mick back home in St. Louis with his family. This is where I feel we get to meet the real Mick and where the story definitely picks up. Tara is able to see the other side of Mick, the one not playing football or posing for pictures. His brother Gavin and his agent Liz all have some nice scenes as well. One thing I find no fault with are the sex scenes. Yes, look at that cover again – Jaci Burton writes very, very hot smex and the scenes are quite plentiful in this book. The smex scenes do that cover quite proud.I ended up liking this book, it just took me a little while to get there. I believe the next book is about Mick’s brother and baseball star Gavin, and I am very much looking forward to his story.Rating: C+"}, {"userName": "Guilty Pleasures Book Reviews", "userReviewDate": "Nov 09, 2010", "userURL": "http://www.goodreads.com/user/show/4391611-guilty-pleasures-book-reviews", "userReview": "MICK...makes me think \"OH MICKEY YOUR SO FINE\" =)This book went straight to the top as one of my favorties. Mick is super sexy, super caring with a secret that made me fall even more in love with him. I fell in love with him when the cover first came out, who wouldn't ;)Tara - WOW, what a strong woman and the way she grew up and the results were amazing!!! I can relate to most of her feelings and thoughts about Nathan.I read this book on the coldest night of the year yet and it definitely kept me warm =)"}, {"userName": "Hannah", "userReviewDate": "Oct 23, 2016", "userURL": "http://www.goodreads.com/user/show/58220052-hannah", "userReview": "This book was okay overall. Not good or bad just okay. Honestly I hated Tara's character and that ruined it for me. She was just so irrating in my opinion. She made her son an excuse not to go out with Mick. Her sons a teenager who barely talks to her. I mean she's just annoying. Mick I liked him, he was the one thing in This book that made me not hate it. The overall book, story, plot was boring. Im rating this 2.75 stars."}, {"userName": "Nihann~", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/11587702-nihann", "userReview": "Kapaktaki kimmiş öğrenelim de kampanya falan başlatıp Biscolata reklamlarına katalım :)) Sırf kapak için okunabiliritesi var :D3,5.Mick candır :)"}], "description": "Football pro Mick Riley is an all-star, both on the field and in the bedroom. But a sexy, determinedly single mom just might be the one to throw him off his game...For years Mick has been taking full advantage of the life available to a pro athlete: fame, fortune, and a different girl in every city. But when he meets and beds confident, beautiful event planner Tara Lincoln, he wants much more than the typical one-night stand. Too bad Tara's not interested in getting to know football's most notorious playboy any better.As the single mother of a teenage son, the last thing Tara needs is the jet-set lifestyle of Mick Riley; even though their steamy and passionate one-night stand was unforgettable. Tara's life is complicated enough without being thrust into the spotlight as Mick's latest girl du jour. Tara played the game of love once and lost big, and she doesn't intend to put herself out there again, especially with a heartbreaker like Mick.But when Mick sets his mind to win, nothing will stop him. And he has the perfect play in mind.", "title": "The Perfect Play\n      \n          (Play-by-Play #1)", "url": "http://www.goodreads.com/book/show/8341567-the-perfect-play", "average": 3.93, "cover": "https://images.gr-assets.com/books/1301853642l/8341567.jpg", "reviews": 1835, "authors": [{"url": "https://www.goodreads.com/author/show/2613.Jaci_Burton", "name": "Jaci Burton"}], "type": ["Romance", "Sports and Games", "Romance", "Contemporary", "Contemporary Romance"], "outlinks": ["http://www.goodreads.com/book/show/8341567-the-perfect-play", "http://www.goodreads.com/book/show/9807321-the-perfect-play", "http://www.goodreads.com/book/show/20931270-la-jugada-perfecta", "http://www.goodreads.com/book/show/17152795-the-perfect-play", "http://www.goodreads.com/book/show/17187873-kusursuz-oyun", "http://www.goodreads.com/book/show/8192391-changing-the-game", "http://www.goodreads.com/book/show/11455168-taking-a-shot", "http://www.goodreads.com/book/show/12683841-playing-to-win", "http://www.goodreads.com/book/show/13551531-thrown-by-a-curve", "http://www.goodreads.com/book/show/15716993-one-sweet-ride"]}