{"ratings": 7, "userreviews": [{"userName": "Melissa In The City &#x1f942;", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/11034926-melissa-in-the-city-x1f942", "userReview": "3.5..rounding up to 4 stars.I really had a love/hate thing going on with this book. The beginning was slow and I really had a hard time getting into it. Not that it wasn't well written, but just I wasn't forming any attachment to the story.I am so glad I stuck with it though because by Part 2, the author through in a major TWIST and my god did she pack a punch with that one. Double whammy. OUT OF THE PARK. Part 3 was also crazy pyscho twisty turny.The story continued with twists and turns and all in all, it was enjoyable read. I admit I skimmed through a few pages that were somewhat slower than others.Overall, the idea of the story was pretty cool and it definitely had moments of panic. The author painted such an intense picture of Madelaine's pain and frustrations that I sometimes had to take a break because it was some pretty deep thoughts and emotions on the pages.Thank you #NetGalley, the publisher and the author for my free ARC in exchange for my honest review."}, {"userName": "Shari", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/38856247-shari", "userReview": "Super excited I won an advanced copy of this book!"}, {"userName": "Jamie Holzberg / Fluff Smut & Murder", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/6962220-jamie-holzberg-fluff-smut-murder", "userReview": "Thank you to NetGalley.com for the opportunity to read an Advanced Reader Copy of this book in exchange for my honest opinion.This book reminded me of a little roller coaster. The first section is like the very slow, very high ascent up the hill. To be honest, I thought for that section it was kind of a Sixth Sense thing going on and I had patted myself on the back for thinking I had figured it out so quickly. Part Two and Three were terrific – definitely the meat of the roller coaster ride as you rise and free fall, twist and turn. The fourth part…instead of being the true climatic end it was more like the part after ride is over and you’re going back on flat land back to the station to get off of the ride – it was pretty obvious what was going to happen at that point.What I loved: It definitely had some great plot twists and unexpected revelations in parts two and three that really defined the entire story.What I didn’t love: The whole thing with Annabel and the reasons for everything happening seemed convoluted and not completely thought through. I think I understand what the author was trying to do but its still rather creepy.What I learned: Still know so little about the human brain…Overall Grade: B-www.FluffSmutandMurder.com"}, {"userName": "Savanah Rae", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/3382033-savanah-rae", "userReview": "I received this book for free from Netgalley in return for my honest opinion.I was addicted from the start of this book but then I was confused half way through and was like what just happened?It did have good twists and turns though and the book ended up pretty good.Maddie Castle is broken. She's distraught after what happened on her twin's 10th birthday. She will never be able to forgive herself. Maddie, her husband Dom and her twins Aidan and Abagail lived such a wonderful life before. They were happy.Maddie is sad and she isn't sleeping. Is it Maddie's fault that everything in her life was fallen apart?!This book is a quick enough read and I wasn't expecting the twits and turns at the end."}, {"userName": "Sue Fernandez", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/4845615-sue-fernandez", "userReview": "Thank you to Net Galley and Kensington Books for an advance read of this title in exchange for my honest review. Thank you to NetGalley.com for the opportunity to read an Advanced Reader Copy of this book in exchange for my honest opinion.I'll admit this started a bit flow for me, and I wasn't quite understanding what was happening. It all felt unreal to me. That was resolved later in the book, and once it got going, there were great plot twists, enough suspense to keep my reading, and wondering what would happen next.There were some disjointed chapters, and I didn't love the ending; however, I think the disjointed parts might have been intentional (not to say anything that will create a spoiler.) And, once I thought about it, life isn't always a clean wrap up. I'd give this book a B- (I'm going to start rating in this way, because many times the stars have me between two different ones.)This book reminded me of a little roller coaster. The first section is like the very slow, very high ascent up the hill. To be honest, I thought for that section it was kind of a Sixth Sense thing going on and I had patted myself on the back for thinking I had figured it out so quickly. Part Two and Three were terrific – definitely the meat of the roller coaster ride as you rise and free fall, twist and turn. The fourth part…instead of being the true climatic end it was more like the part after ride is over and you’re going back on flat land back to the station to get off of the ride – it was pretty obvious what was going to happen at that point.What I loved: It definitely had some great plot twists and unexpected revelations in parts two and three that really defined the entire story.What I didn’t love: The whole thing with Annabel and the reasons for everything happening seemed convoluted and not completely thought through. I think I understand what the author was trying to do but its still rather creepy."}, {"userName": "Stephanie Nelson", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/62662262-stephanie-nelson", "userReview": "I thoroughly enjoyed this book and did not want to put it down. There were twists and turns throughout the book that made you really think about who the \"bad guy\" could really be. It kept you guessing!The book starts with the main character, Maddie, getting ready for her twins tenth birthday party. A man dressed in army gear comes to the door and ultimately someone gets shot. The book then goes through random sporadic events in Maddie's memories, and some situations that may or may not be true. You learn Maddie's \"story,\" which includes how she met her husband Dom, and things that have gone on throughout her marriage. Come to find out Maddie was shot in the head, and has been in a coma for several weeks. Eventually as her health improves all the pieces of what happened that fateful day fall into place. This is definitely a book I would recommend for anyone who likes a good thriller. An ARC was provided to me by Netgalley for my honest review."}], "description": "Relentlessly twisting, Samantha King's debut novel is a dark and brilliant slice of psychological suspense in which even the happiest family can awake to a nightmare . . .Maddie Castle is broken. Ever since the tragedy that struck on her twins' tenth birthday, she's been trying to fit the pieces together, to get back to the life she led before. Maddie, her husband, Dom, and their children, Aidan and Annabel, lived in a comfortable home on a quiet street in a London suburb. Life was busy and satisfying. They were happy. Weren't they?Now, a disoriented and grieving Maddie floats like a ghost through each day, hardly sleeping, eating, or speaking. It's easier to stay locked in her own head than to torment herself by reliving what happened. And yet, the harder Maddie tries to pin down her memories, the more they slip out of reach. Is her guilt and remorse justified? Is it Maddie's fault that everything was ripped apart?Or could it be that the real terror is still to come? \"A beautifully written, chilling psychological thriller. Taut, tense and very clever with twists I didn't see coming.\" --Claire Douglas, Sunday Times bestselling author\"A completely gripping psychological suspense that had me glued to the pages and rushing through to the end. It's an edge-of-your-seat kind of read that you can't put down until it's done.\"--Jenny Oliver", "title": "The Perfect Family", "url": "http://www.goodreads.com/book/show/37976024-the-perfect-family", "average": 3.71, "cover": "https://images.gr-assets.com/books/1517723787l/37976024.jpg", "reviews": 6, "authors": [{"url": "https://www.goodreads.com/author/show/189833.Samantha_King", "name": "Samantha King"}], "type": ["Thriller", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/37976024-the-perfect-family", "http://www.goodreads.com/book/show/38886851-the-perfect-family", "http://www.goodreads.com/book/show/330851.Pink_Ribbons_Inc_", "http://www.goodreads.com/book/show/33385040-the-choice", "http://www.goodreads.com/book/show/35470058-tu-devras-choisir", "http://www.goodreads.com/book/show/27781339-the-heir", "http://www.goodreads.com/book/show/29537876-bad-boy-romance"]}