{"ratings": 282, "userreviews": [{"userName": "Antigone", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/22009196-antigone", "userReview": "The third volume is a mixed bag. Some of the interviews stood merely as filler for me, yet they were juxtaposed against a few true fascinations.Ted Hughes, whom I've never known quite what to make of, has by far the most substantial conversation on the writing process in this collection. It was terrific to get a resilient sense of enthusiasm from Martin Amis, and Salman Rushdie's mystification over how the world views him is always, always, amusing. He's just completely oblivious on the subject of his character and how his personality holds the potential to abrade. Mailer roars, which I find anchoring, and Ralph Ellison - if you let him - will light a match and set your world on fire.There's a lot here, even in the lesser exchanges, on the psychic toll of writing. Cheever calls it \"clinical fatigue.\" Chinua Achebe likens the labor to \"a term of imprisonment.\" Jean Rhys speaks of isolation and depression. Leave it to Mailer, though, to deliver the goods by slamming a fist to the table:On hearing of Hemingway's suicide - \"I remember it very well. I was with Jeanne Campbell in Mexico and it was before we got married. I was truly aghast. A certain part of me has never really gotten over it. In a way, it was a huge warning. What he was saying is, Listen all you novelists out there. Get it straight; when you're a novelist you're entering on an extremely dangerous psychological journey, and it can blow up in your face.\"And the interviews continue..."}, {"userName": "Olivia", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/126943-olivia", "userReview": "This book was such a pleasure to read. It collects interviews from as early as 1955, and is a strong display of the quirks, charms and genius of those interviewed. Some of the most engaging interviews were with Isak Dinesen, William Carlos Williams (and his wife), and John Cheever. A few authors were almost insufferable (cough...Martin Amis...cough...Norman Mailer) but others, like Jan Morris, were really illuminating. The collection does a great job setting the scene of each conversation, and includes one scribbled out manuscript page per author, that gives us another valuable glimpse into their process."}, {"userName": "Jody", "userReviewDate": "Oct 25, 2009", "userURL": "http://www.goodreads.com/user/show/2198868-jody", "userReview": "I loved volumes one and two, so I figured I might as well buy the third volume. It does not disappoint. Like the previous volumes, this is my procrastination book that doesn't look like procrastination. I learn something with each interview, espcially Ted Hughes's interview. I harbored a hatred for that man, but after reading his editorial defense on Plath's book Ariel, his choices made sense. So, if anything, there's one less strange that I dislike."}, {"userName": "Ryan Chapman", "userReviewDate": "Oct 12, 2008", "userURL": "http://www.goodreads.com/user/show/18213-ryan-chapman", "userReview": "Every volume in this series is a must-have for every struggling writer, intelligent reader, and member of the literate society. Especially wonderful in this collection:  Ralph Ellison's bold ambition and humility ( Invisible Man was merely an \"attempt\" at a major novel),  Martin Amis' no-bullshit approach to writing and life,  Harold Pinter's off-putting self-absorption and condescension."}, {"userName": "Jim", "userReviewDate": "Feb 23, 2009", "userURL": "http://www.goodreads.com/user/show/1674976-jim", "userReview": "fascinating insights into some of my favourite authors & food for thought to scope out some writers I've not encountered previously. must attempt to read Vols I&II at some stage."}, {"userName": "John Hood", "userReviewDate": "Dec 07, 2008", "userURL": "http://www.goodreads.com/user/show/1159765-john-hood", "userReview": "http://miamisunpost.com/archives/2008...Bound - Miami SunPostNov. 20, 2008A Gentleman Among MenGeorge Plimpton Was All That and Then SomeBy John Hood George Plimpton and I first met at his Manhattan home back in ’90 or ’91 when he hosted a wedding reception for then Paris Review Senior Editor Fayette Hickox. I was just coming into my ego then and still a bit reticent around celebrity, but Plimpton made me feel immediately welcome into his world. That his world consisted of every 20th century writer of any merit, not to mention more bold-faced names than any three compendia on fame, only made his welcome all the warmer — and all the more cool.The next day Plimpton had me up to his place again, this time so I could interview him for Paper Magazine, and again he insisted that I call him “George.” It wasn’t an easy move for me to make — his stature suggested a definite “Mr. Plimpton” — but he was adamant. Besides, George was simply too damn agreeable to argue with. We collided a couple more times over the years, most notably when Brian Antoni threw a Black & White Ball to celebrate the release of Truman Capote, and on each and every occasion George remained the consummate gentleman — impeccably mannered, effortlessly elegant and genuinely kind.Of course I’m just one of the thousands upon thousands who encountered George throughout his long and robust life, and hardly one of his intimates. Had we been closer I’m sure I’d be among the many remembrances in the remarkable George, Being George (Random House, $30), an oral history that includes looks back from the likes of Gay Talese, Gore Vidal, William Styron and Peter Matthiessen.Subtitled George Plimpton’s Life as Told, Admired, Deplored, and Envied by 200 Friends, Relatives, Lovers, Acquaintances, Rivals — and a Few Unappreciative Observers, and expertly edited by his pal Nelson W. Aldrich Jr., George is not just the sort of oral history very few people deserve, it’s the sort George himself would’ve definitely approved of. Why? Because it was a form he perfected with the books Edie and Truman Capote.Yet neither Warhol’s tragic superstar nor the noted “non-fiction novelist” even came close to covering as much ground as George Plimpton, who was born with a silver spoon in his mouth, died the talk of the town, and in between lived enough lives to account for any 50 people, provided those 50 never stopped fully living throughout their entire lives.I’m talking a man of action as well as letters, and quite often both at the same time. As a participatory journalist for Sports Illustrated, George went three rounds with then light heavyweight champ Archie Moore, quarterbacked the Detroit Lions, goaled for the Boston Bruins, hit the PGA Tour alongside Arnold Palmer and Jack Nicklaus, and flew through the air with the Clyde Beatty-Cole Brothers Circus. Each of those feats and more are talked about in George, some with envy, some with pride and all with utter awe.But beyond the books and the exploits, George will perhaps be remembered for The Paris Review, which he helmed for the last 50-plus years of his life.Founded in ’53 by Peter Matthiessen and Harold “Doc” Humes and basically given to George shortly thereafter, The Paris Review remains perhaps the most influential literary journal in history, mostly on account of its interviews, which began with E.M. Forster and number virtually every writer to have picked up a pen since.Hemingway, Ellison, Faulkner, Greene, Burroughs, Miller, Bellow … name a 20th century heavyweight and The Paris Review chatted ‘em up. Some of those immortal interviews can now be found archived online, but to read them as they really were meant to be read, I wholeheartedly recommend you pick up Pantheon’s The Paris Review Interviews (Picador, $16).Of the three volumes currently available, it’s impossible for me to pick a favorite, so I’ll just mention personal highlights from each.In Volume I I’m most partial to James M. Cain, Richard Price and Dorothy Parker. Not because I don’t dig Borges and Bellow and Hemingway and Vonnegut (all of whom are also included), but because I double-dig crime and wisecracks, and if Cain’s The Postman Always Rings Twice and Price’s Clockers don’t epitomize crime writing and Parker wasn’t the embodiment of a wisecrack, then I’ll eat my hat.For Volume II I’ll stick with Graham Greene and William Faulkner, first because of The Comedians and Our Man in Havana, and second because of As I Lay Dying and The Sound and the Fury, all of which I discovered back when I was broke and a book was all the sustenance I needed to get through a New York night.In III I’ll take Raymond Carver, Norman Mailer and Martin Amis. Carver’s ultimately inimitable short stories still floor me, and on a couple occasions I got to meet Mailer, so his entry gets extra credit. Amis, I’m proud to say, I too had the privilege of interviewing.And that kinda brings me full circle. Like George I believe in both word and action, and by George I’m inspired to fully use both. And while I might not do so with such grace and good manners, I’ve at least been given a blueprint. And so now have you."}, {"userName": "Brad", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/423482-brad", "userReview": "I bleeping love these books."}, {"userName": "Kenny", "userReviewDate": "Nov 27, 2012", "userURL": "http://www.goodreads.com/user/show/1260706-kenny", "userReview": "I've reached another milestone in my reading career - discovering the joy of discovering a new author on my own, not recommended or syllabied or even really linked to any other writer - completely unknown, suddenly the next big writer I have to go out and get all their outpourings. That would be Jan Morris (born James Morris). Already intrigued? Me too! And add to all that, his extensive travel experiences, which he has a fascinating theory on. First off, he focuses on cities, which thanks to my modern poetry course centered thematically on poems created in the exigencies of city living, where the push and pull of anonymity vs. distinction and the press of bodies and consciousness seem ideally suited to the condensed form of a poem, I have come to (obviously) love. Urban life! Then, he specifically has a line, which he draws, seemingly arbitrarily, between Budapest and Bucharest, and any city that falls on the Bucharest side of the line (I believe) deserves his writerly attentions. Thence, he sets off on his wandering, flaneur-like travels through cities \"like a dog running around with his tongue hanging loose\" - including in Sydney (\"sharp\"), Beijing (a city he got too lost in where the wandering failed him), in Venice (his most frequented city, the one which has undergone so many transformations, and is currently, reduced to a museum for swarming tourists), and in Chicago (the city he most wants to preserve in his memory unsullied with subsequent trips). Finally, his travels aren't merely confined to the physical, but also to the metaphysical, though he wouldn't admit it that way. In fact, he should be referred to as a she, because she knew all along that she was female born in a male body. If that's not worth reading more about, then how about his travel experiences in Hong Kong - or a description of a city merging Italian, Russian, and Arabic. What a wonderfully bizarre human soul.The collection kicked off with Ralph Ellison, who discusses literature vis a vis activism, and how he disavows the latter term, preferring instead words like symbolism, ritual, description - a writer through and through.Then, there are the less appealing parts of the collection, the slew of what I call \"middle America white authors of suburbia and normality made strange\" - Cheever, Carver (who apparently was born in Washington State too, though, he has since tried to claim the dislocated label, having moved around a lot - his fiction doesn't at all though, all confined inside, confined being the operative word, such stifling stories!), William Carlos Williams, and Joyce Carol Oates.I am curious, at some point, to look at Jean Rhys, Chinua Achebe, and Salman Rushdie (for their global-ness). And also, Harold Pinter, if I do end up, however unlikely, digging deeper in Modern British Theater."}, {"userName": "Vilis", "userReviewDate": "Jun 23, 2011", "userURL": "http://www.goodreads.com/user/show/1617081-vilis", "userReview": "Būtu muļķīgi par interviju gramatu runāt paša vārdiem, tāpēc piedāvāju aprakstu ar runātāju teikumiem. Pa vienam no katra. “Rakstnieks piešķir dzīvei formu. Visi romāni ir par kādu minoritāti: katrs indivīds ir minoritāte. Vislabāk, ja maza deva autobiogrāfijas ir sajaukta ar krietnu daudzumu iztēles. Rakstnieki mēdz rakstīt daudz, taču reti kurš uzraksta vairāk kā tikai mazu drusku īstenības. Tēvs man teica, ka divdesmitpiecgadīgs autors rakstot saka piecdesmitgadniekiem, ka pasaule vairs nav tāda: tā ir šāda. Lielos stāstos tomēr ir ne tikai liela doma, bet arī īpašs domas izpausmes veids: vārdu savirknējums, valodas skanīgums… Rakstnieks tēlam var piešķirt dziļuma ilūziju, rādot viņu šķietami stereoskopiskā veidā, no diviem dažādiem skatupunktiem; rakstnieks var tikai kaut ko pastāstīt vai noklusēt par tēlu, viņš nevar lasītājam dot kvalitatīvi atšķirīgu informāciju. Būtu traki, ja darba skaidrojums būtu meklējams ārpus teksta.“Manuprāt, romānu rakstīt nav vērts, ja vien neesi pieķēries kam tādam, pie kā varētu aplauzties. Ja kādam nevajag būt par rakstnieku, ja kāds domā, ka varētu darīt arī ko citu, tad viņam arī vajadzētu darīt to citu. Rakstīšanas tehniskais process, rakstnieka darbs ir dabiski vientulīga nodarbe. Es katru dienu stundām ilgi sēžu viens pats istabā. Sekoju tam, ko redzu uz papīra: teikumu pēc teikuma. Ja mākslai ir, kā man šķiet, patiesi transcedentāla funkcija – ja tā mums ļauj pacelties no mūsu ierobežotības un naivuma – rakstīšanas laika garastāvoklim vai sajūtām nevajadzētu būt nozīmei. Manuprāt, labs redaktors ir vīrs, kurš man šķiet šarmants, kurš man sūta lielus čekus, slavē manu darbu, izskatu un seksualitāti, un kurš ir labi apvārdojis izdevēju un banku. Bet tā tik tāda piebilde.”"}, {"userName": "Niklas Pivic", "userReviewDate": "Sep 05, 2010", "userURL": "http://www.goodreads.com/user/show/2106358-niklas-pivic", "userReview": "Another solid volume of interviews, introducing me to Georges Simenon's wafty yet lucid way of going about writing (few rules, yet strictly governed by himself), John Cheever (even more out there, with some great points and interesting observations on writing and life), Ted Hughes getting me angry from his oh-Plath's-stuff-must've-been-displaced way of going about things...The really, really interesting interviews are in my mind those with Martin Amis and Raymond Carver. Where Amis compares himself with his famous writer father (Kingsley Amis) and talks of how they differ and are very similar, not to mention how Martin Amis separates journalism from creative writing. Raymond Carver seems brutally honest in a gentle way, being very frank about his alcoholism and generally coming across as a writer I shall very much look forward to read.Salman Rushdie comes across as a lad, really, but a well-read and quite funny lad. Not like Jan Morris, who talks about travel fiction, writing techniques, travels and his transexuality in relation to how if affects and has affected him as a writer, especially in relation to his trilogy books which he started writing as John Morris. Evelyn Waugh comes across as an Oscar Wilde-ish person, somewhat blasé.Norman Mailer concludes the book in good fashion. He's a pretty down-to-earth interviewee and very interesting. Some nice points on Truman Capote.All in all, another very interesting book."}, {"userName": "Sean Callaghan", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/16130202-sean-callaghan", "userReview": "Always well worth the read."}, {"userName": "Clark", "userReviewDate": "Jun 20, 2011", "userURL": "http://www.goodreads.com/user/show/76337-clark", "userReview": "Another outstanding collection of interviews from the Paris Review. I basically feel like these books are master classes in writing. This particular edition felt just a bit more uneven than volume 1, but there are still plenty of incredible insights into the process of writing. Special mention has to go out to Raymond Carver for a very forthcoming and incredibly intriguing interview. I also really enjoyed the interviews with Joyce Carol Oates, John Cheever, Norman Mailer, Jan Morris and Ted Hughes. Martin Amis kind of sounds like an uninteresting dick. Unclear if his personality carries through to his work, though I will likely never find out."}, {"userName": "j_ay", "userReviewDate": "Apr 06, 2009", "userURL": "http://www.goodreads.com/user/show/1330314-j-ay", "userReview": "Ralph Ellison ***** (5 stars)Georges Simenon ****oIsak Dinesen ****oEvelyn Waugh ***ooWilliam Carlos Williams ****oHarold Pinter ****oJohn Cheever ****oJoynce Carol Oates ****oJean Rhys ****oRaymond Carver ****oChinua Achebe ****oTed Hughes ****oJan Morris ****oMartin Amis ****oSalman Rushdie *ooooNorman Mailer ****o"}, {"userName": "Jim", "userReviewDate": "Nov 05, 2008", "userURL": "http://www.goodreads.com/user/show/281393-jim", "userReview": "If your a writer you will love this book of interviews with the likes of Harold Pinter, William Carlos Williams and Martin Amis. The interviewers take their time and most of the interviews take place over a number of meetings. You can read an in depth review on my website."}, {"userName": "Jennifer", "userReviewDate": "Dec 31, 2008", "userURL": "http://www.goodreads.com/user/show/544027-jennifer", "userReview": "I'm loving these interviews. I cherry-picked some in vol. II as I wanted to read Alica Munro's first (she's so thoughtful and humble), but I'm reading vol. III's pieces straight through. Some favorites so far, in the collections (though I haven't yet got my hands on vol. I): Munro, Eudora Welty, Faulker (boy does he take himself seriously!), Ralph Ellison"}, {"userName": "Charles", "userReviewDate": "Dec 09, 2008", "userURL": "http://www.goodreads.com/user/show/1653601-charles", "userReview": "I read the previous two books of interviews in this series, with writers as varied as Truman Capote, Papa Hemingway, William Faulkner, Robert Penn Warren, and James Thurber. Just read a review of this one in the Wall Street Journal. Looks good."}, {"userName": "Dr.abdullah H", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/6992033-dr-abdullah-h", "userReview": "The interview questions was exactly on the spot. the writers werent hiding anything here.It makes you feel So connected, No small talk. Too obsessive, too complicated but solving their puzzles was of pure joy.Thanksbought it from Shakespeare and Co."}, {"userName": "Boweavil", "userReviewDate": "Apr 14, 2016", "userURL": "http://www.goodreads.com/user/show/39539263-boweavil", "userReview": "Many of these interviews are fascinating, but I didn't read all of them. The words of the writers I have not read did not hold me and some of these are just too long, chatty and repetitive. It's the sort of book to pick up and put down when you have 15 minutes."}, {"userName": "Gladia", "userReviewDate": "Jan 30, 2010", "userURL": "http://www.goodreads.com/user/show/2651723-gladia", "userReview": "Some people look for answers in the Bible, I look for them in the Paris Review interviews. Some people abide to the 10 Commandments, I only need four: rob, borrow, beg, and steal (Faulkner)."}, {"userName": "Leah W", "userReviewDate": "Oct 30, 2008", "userURL": "http://www.goodreads.com/user/show/1020348-leah-w", "userReview": "I really liked this collection... stronger than 2, not quite as good as 1, and now it's time to pick up 4, which came out on 10/27."}, {"userName": "Sarah", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/1142601-sarah", "userReview": "I'm so glad I bought these."}], "description": "\"I have all the copies of The Paris Review and like the interviews very much. They will make a good book when collected and that will be very good for the Review.\"--Ernest HemingwaySince The Paris Review was founded in 1953, it has given us invaluable conversations with the greatest writers of our age, vivid self-portraits that are themselves works of finely crafted literature. From Salman Rushdie's daring rhetorical question \"why shouldn't literature provoke?\" to Joyce Carol Oates's thrilling comments about her own prolific output, The Paris Review has elicited revelatory and revealing thoughts from our most accomplished novelists, poets, and playwrights. How did Geroges Simenon manage to write about six books a year, what was it like for Jan Morris to write as both a man and a woman, what influences moved Ralph Ellison to write Invisible Man? In the pages of The Paris Review, writers give more than simple answers, they offer uncommon candor, depth, and wit in interviews that have become the gold standard of the literary Q&A. With an introduction by Margaret Atwood, this volume brings together another rich, varied crop of literary voices, including Martin Amis, Norman Mailer, Raymond Carver, John Cheever, Harold Pinter, and more. \"A colossal literary event,\" as Gary Shteyngart put it, The Paris Review Interviews, III, is an indespensible teasure of wisdom from the world's literary masters.", "title": "The Paris Review Interviews, III\n      \n          (The Paris Review Interviews)", "url": "https://www.goodreads.com/book/show/4629012-the-paris-review-interviews-iii", "average": 4.35, "cover": "https://images.gr-assets.com/books/1317793359l/4629012.jpg", "reviews": 23, "authors": [{"url": "https://www.goodreads.com/author/show/7373.The_Paris_Review", "name": "The Paris Review"}, {"url": "https://www.goodreads.com/author/show/7372.Philip_Gourevitch", "name": "Philip Gourevitch"}, {"url": "https://www.goodreads.com/author/show/3472.Margaret_Atwood", "name": "Margaret Atwood"}, {"url": "https://www.goodreads.com/author/show/3524.Joyce_Carol_Oates", "name": "Joyce Carol Oates"}, {"url": "https://www.goodreads.com/author/show/25022.Jean_Rhys", "name": "Jean Rhys"}, {"url": "https://www.goodreads.com/author/show/7363.Raymond_Carver", "name": "Raymond Carver"}, {"url": "https://www.goodreads.com/author/show/8051.Chinua_Achebe", "name": "Chinua Achebe"}, {"url": "https://www.goodreads.com/author/show/996.Ted_Hughes", "name": "Ted Hughes"}, {"url": "https://www.goodreads.com/author/show/13091.Jan_Morris", "name": "Jan Morris"}, {"url": "https://www.goodreads.com/author/show/11337.Martin_Amis", "name": "Martin Amis"}, {"url": "https://www.goodreads.com/author/show/3299.Salman_Rushdie", "name": "Salman Rushdie"}, {"url": "https://www.goodreads.com/author/show/7927.Norman_Mailer", "name": "Norman Mailer"}, {"url": "https://www.goodreads.com/author/show/7508.Ralph_Ellison", "name": "Ralph Ellison"}, {"url": "https://www.goodreads.com/author/show/9693.Georges_Simenon", "name": "Georges Simenon"}, {"url": "https://www.goodreads.com/author/show/11315.Evelyn_Waugh", "name": "Evelyn Waugh"}, {"url": "https://www.goodreads.com/author/show/15435.William_Carlos_Williams", "name": "William Carlos Williams"}, {"url": "https://www.goodreads.com/author/show/1197.Harold_Pinter", "name": "Harold Pinter"}, {"url": "https://www.goodreads.com/author/show/7464.John_Cheever", "name": "John Cheever"}], "type": ["Nonfiction", "Language", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/4629012-the-paris-review-interviews-iii", "http://www.goodreads.com/book/show/3331452-the-paris-review-interviews-3", "http://www.goodreads.com/book/show/11473.The_Paris_Review_Interviews_I", "http://www.goodreads.com/book/show/596060.The_Paris_Review_Interviews_II", "http://www.goodreads.com/book/show/13167173-object-lessons", "http://www.goodreads.com/book/show/176164.The_Paris_Review_Book", "http://www.goodreads.com/book/show/6602829-the-paris-review-interviews-iv", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}