{"ratings": 37844, "userreviews": [{"userName": "Rick Riordan", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/25375513-rick-riordan", "userReview": "I’ll admit I approach award-winning children’s books with some trepidation. All too often, children’s literature awards denote books that appeal to adult librarians and book critics rather than to children. The books are like brussel sprouts on the literary table. We are told to read them because they are supposedly good for us, not because we will enjoy them.I was happy to find that National Book Award winner The Penderwicks was an exception. Four sisters and their father take a three-week summer vacation to a rented cottage behind Arundel Hall, and become involved in the fate of the young boy who lives in the mansion. The book is funny, sweet, gentle and moving. The characters are perfectly drawn. The book is also very accessible. I read it in a single afternoon, and I’m not a fast reader. Here is a book driven by character and atmosphere rather than by plot, and yet, unlike some other books that used to drive my students crazy because “nothing happens,” this one never loses the reader’s interest. Highly recommended for girls. It will still be a tough sell for boys, but I would not cringe to see The Penderwicks taught in the classroom. That’s more than I can say for many Newbery picks."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "I'm upping to 5 stars on reread. This is a timeless, heartwarming middle grade story of the Penderwick family and their three week vacation one August in a rental cottage in the Berkshire mountains, in western Massachusetts. It may not sound too exciting, but with the Penderwicks, everything is an adventure! The family consists of: ❧ Mr. Penderwick, a widower who loves plants and randomly speaks in Latin to his daughters; ❧ Rosalind, age 12, who's taken on the caregiver role for her younger sisters; ❧ Skye, 11, an adventurous girl whose blunt, occasionally ill-considered words sometimes get her in trouble; ❧ Jane, 10, aspiring author and soccer player. Often speaks as though she's writing one of her heroine's adventures (\"For although Sabrina Starr had enough courage to face her adversaries, it was nice when she didn't have to.\");  ❧ Elizabeth (\"Batty\"), age 4, animal lover extraordinaire who wears fairy wings every day; and ❧ Hound, Batty's faithful companion.They meet Jeffrey (the \"Very Interesting Boy\" of the title); his alarmingly stern high society mother, who is renting the cottage to the Penderwick family, the handsome teenage gardener Cagney and his two pet rabbits, a belligerent bull in a pasture, and more. And they all learn and grow just a little in the course of their three-week stay in the Berkshire cottage that summer.I'm convinced that telling a middle grade tale well enough to charm both young and old is a truly difficult thing to pull off well, and takes a lot of talent. I bought this book about ten years ago for my daughter, who was about 9 years old at the time, and we both loved it. The Penderwick girls are vivid, quirky and varied personalities; I never had trouble remembering which girl was which. A recommended read, especially for young girls!Now to try to lay my hands on copies of the sequels ...Original post: I remember this as a completely delightful middle grade book about a family of young sisters and their family vacation one summer, but I haven't read it for years. For some reason it grabbed my attention today, even though I should be reading other books. We'll see how it holds up on reread!"}, {"userName": "Kathryn", "userReviewDate": "May 15, 2008", "userURL": "http://www.goodreads.com/user/show/446464-kathryn", "userReview": "Absolutely one of the best books I have ever read!!! My heart is so full, having just finished the book--it really touched me deeply and I absolutely love it! After just a few pages, I knew I the Penderwicks were destined to become my dear book-friends (like the March sisters and Anne and Emily of old!) and indeed the whole story was absolutely darling, charming, sweet, refreshing--everything I'd hoped for and more (because it is also remarkably sensitive, thoughtful and--I hate to say it, rare--in that it portrays a modern family who genuinely love one another and are genuinely nice, helpful people and good friends with one another). In my opinion, Birdsall's book deserves all the praise heaped upon it--but that does nothing to diminish the sheer joy of discovering for yourself just how wonderful it really is. I highly recommend all my friends to read it this summer!!!"}, {"userName": "Melissa", "userReviewDate": "Feb 15, 2008", "userURL": "http://www.goodreads.com/user/show/899549-melissa", "userReview": "A lovely set-up for a book, but the characters never felt real. Somehow all the ages felt off--Batty talked like someone much older than 4, I had to keep reminding myeslf that Rosalind was only 12, and Mrs. Tifton seemed like she was in her 50s, not early 30s. I just never fell in love with the characters. It was trying too hard to be sweet and charming. I did like Hound though."}, {"userName": "Brian Yahn", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/22849115-brian-yahn", "userReview": "The tale of the Penderwicks is the epitome of a middle grade masterpiece. Adults that just don't get it, a summer vacation in a strange new land, hopeless love, heartbreak, best-friends-at-first-sight friendships, a family so close you wish you were a part of it. Jeanne Birdsall takes everything you loved about your childhood and whittles it down to a couple hundred pages.The Penderwick children have enough personality to fill a series and I look forward to continuing the series and seeing where Jeanne Birdsall takes them.This might just be my favorite non-fantasy middle grade book of all time."}, {"userName": "m a r y l i z", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/56772107-m-a-r-y-l-i-z", "userReview": "Oh my stars! This book was the sweetest, most touching thing I've ever read. <3 It completely captured the essence of childhood. Honestly, the book was such a sensitive and touching portrayal of childhood. It made me tear up more than once as I really saw the characters in such a raw, honest way. They felt so real and relatable.The writing itself made me feel all cozy and comfortable. It was blissfully nostalgic, heralding back to the classic children's stories of the past. And it held a certain magic to it--the magic of summer days. Fireflies, climbing trees, cozying up with a book in the shade...all the things that make summer such a magical time.SO YES. I absolutely positively adored this book! <333 Definitely going on my favorites shelf. ^_^(Oh, and if you're not already convinced, there are brownies and gingerbread and Narnia references. THIS BOOK HAS IT ALL, PEOPLE.)// Re-Read June 2017 //This is a story that will never ever get old. It's a slice of childhood--the book equivalent of comfort food.I will never stop loving The Penderwicks. <3"}, {"userName": "Ann", "userReviewDate": "May 22, 2008", "userURL": "http://www.goodreads.com/user/show/446509-ann", "userReview": "What a wonderful treasure!I really couldn't tell you exactly what it was about this book that made me want to come back to it at every spare moment. It's not like there is some huge climax, or that I'm waiting to see if my favorite character makes it to the end of an adventure alive - it's not that sort of book. And yet, it is. The Penderwicks are an absolutely wonderful, lovable and endearing family made up of four sisters (from ages 4 to 12 1/2), their loving father, and their happy and protective dog, Hound.The book tells the story of the four girls' summer vacation at a cottage on a huge estate. And while most of the book consists of tiny stories and daily events, we see as the book progresses that author Jeanne Birdsall has managed to create adventures and climaxes fitting for the Penderwicks, that build and span the entire book - each character achieving their own arc. So, while perhaps the Penderwicks aren't out to save the world, they have adventures of their own that need to be tackled - anywhere from helping their new friend stand up to his self-centered mother, to rescuing a runaway rabbit. And all the while, Birdsall has filled these characters with wonderful heart and individuality, so that by the third chapter you won't be getting the sisters confused with each other, and you will be anxious to hear more about each of them.The story seems truly timeless - it's a modern story, but you'd really never know it aside from the mention of a car and a few mentions of a computer. It could be as relevant today as if it were written one hundred yeas ago, or one hundred years from now. I hope you'll read it! It's truly excellent!"}, {"userName": "Crystal Starr Light", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/3990525-crystal-starr-light", "userReview": "Bullet Review:This was a lot of fun, very reminiscent of quirky, family adventure books I read as a child. I would heartily recommend to this age group or anyone who is a child at heart who loves fun.That said, there were a few eye-twitching parts/moments that keep this from a higher rating.Although I rated it 3 stars, this is not me hating on the book! It is me saying it was \"Okay\". A book I would definitely recommend, but not want to pursue further books in the series.Full review:The Penderwicks - Rosalind, Skye, Jane, and Batty (what an eclectic bunch of names!) along with Dad and Hound - are vacationing in a cottage at Arundel, the home of Mrs. Tifton and her son, Jeffrey. While they are there, numerous adventures and escapades occur - the discovery of Jeffrey, bunnies, a raging bull, a Garden competition, a birthday party, a secret crush, etc. But the threat above all is this: will Mrs. Tifton send her son to Military School to be like his grandfather?Eons ago (at least, it feels that way now), I wanted a fun summery read and was recommended this (thanks, THT!). Unfortunately, as these go, by the time I bought it, I wasn't itching for a summer read - and it went unread for 3 years. Now, I was traveling and I just HIT that vein where I wanted to read short, fun books and weed through my collection of books such as this.I found this book a fun read, though at times, it sent my eyes a'twitchin'. Don't get me wrong; this was a fun, light-hearted read, and it felt like those books I would read as a child - a classic \"any time period\" feel where kids acted goofy and silly and sometimes dumb, where summer was full of adventure and possibility.That said, I'm an adult now, not 12, so there were things that I just couldn't blow past. For instance, many of the kids felt oddly aged. Rosalind felt much older than 12, especially crushing on the much older Cagney. Now yes, when I was 12, I was more than capable of crushes, but coupled with the way she acted like the Mom (even more than the Dad acted like a dad), it just felt weird. Speaking of Dad, he was barely present in the book, unless to give encouragement or to be called upon when the girls acted like, well, brats. (Because, yes, some of what they did was truly bratty and wouldn't have happened if there was even a modicum of parental attention.) He was in this so little, I almost wondered why bother writing his character at all (which was, of course, goofy, eccentric dad - yawn!).I didn't care for how Mrs. Tifton and Dexter were treated. I got the impression Mrs. Tifton would be in her 50's and 60's, so I was shocked when she was described as being near Mr. Penderwick's age (roughly 30's). Also, I felt that she was very justified in being irritated by how often the girls would run into her gardens and, well, wreck things. Honestly, when she said the girls were brats and unruly and unsupervised - she was right. The dad rented the cottage, not the entire mansion. And while Dexter's reaction to Jane's book may seem rude, the fact is, it's probably more realistic than we'd like to admit.In general, good people are good to the Penderwicks, bad people are bad, in that childish black/white characterization. It's passable for a child, but irritating for adults.But I feel I need to stop myself now. Because I'm making this book sound horrible - and it's not. It's fun. It's timeless (minus mentioning a laptop, which was quite weird to be honest, since the book felt as if it could have been written in the 1950's!). It's just a bunch of kids having quirky adventures over a summer time. You can't really bring too much thought and inspection into something like this - you ruin the beauty of a story like this.And so I rate this 3 stars; it was \"good\". I enjoyed myself, but still had qualms. Would I recommend this and/or buy this for a child of the appropriate age? You betcha! Would I read/buy another book of this series for myself? Probably not. That ship has sailed - but at least, I can recommend this to the child and the childlike at heart."}, {"userName": "Donalyn", "userReviewDate": "Feb 01, 2008", "userURL": "http://www.goodreads.com/user/show/829035-donalyn", "userReview": "The Penderwicks will go down in my memory as some of the great sister characters of all time-- right up there with the Marches and Hilary McKay's Cassons (sorry, Indigo- boys are great, too).The plot is simple, the Penderwick sisters, their dog, Hound, and their widower father, rent a cottage for a three week summer vacation. The cottage is part of a large estate owned by the snippy, snooty, superior, Mrs. Tifton, and her son, Jeffrey.The girls have many adventures, some planned, many accidental. The plot is fairly predictable-- in a book this sweet we know it will all turn out OK in the end. But it is Birdsall's characters that make this book something special.The term \"old-fashioned\" has negative connotations these days, but an old-fashioned book like The Penderwicks reminds me of Doris Day movies, front porches and fireflies-- in a good way. The Penderwicks reminds me of Heidi, Marguerite Henry, Nancy Drew, Beverly Cleary, all of the books and authors who made me into a reader when I was little. It was refreshing to read a book that I could share with my most innocent students or my nine-year old daughter.There is a new Penderwicks' book out-- I cannot wait to read the next adventures of these timeless characters."}, {"userName": "Kellyn Roth", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/52072956-kellyn-roth", "userReview": "Reread 5/10/18:Oh, wow! This book is just as good as ever. I just love it. <3 Rereading it, I think the girls are probably a little more mature than their ages would warrant - except Batty, perhaps - but I can overlook that. Perhaps it will inspire children to try to be more grownup (in an acceptable childish way, of course) and become nicer people! ;PNow that I can understand Latin, Mr. Penderwick is 100000x better. xDOriginal Read(s)?:This is simply one of the best children's books I ever read. It is so amazing! :)"}, {"userName": "Laura", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/29789832-laura", "userReview": "I read this out loud to my 4, 8, and 10 year kiddos. After reading all the glowing reviews, I was ready to dive in, head first, and read the entires series to my kids. I envisioned my kids seeing me as the coolest mom, ever, for sharing such an awesome book with them. I can testify, that it really is a fun book that caused us to giggle throughout the pages and we all earnestly looked forward to our lunch time reading sessions. It did hold a nostalgia that creates a longing to be transported into the pages. Each character is full of life. The adventures were realistic and exciting at the same time. I would honestly recommend it to others to read, but, I want to toss some mild precautions to those who might be more sensitive to certain subjects or language. Here is a list of things, that while reading, I either skipped over or changed the wording while reading to my kids.1. The Lord's name is used in vain two times. 2. A sentence was written to imply language that I personally don't use, such as, \" Your Daddy can go to____,\" spat Mrs. Tifton. 3. The mother drinks wine at a birthday party.4. There is a page or two explaining why, Jeffery, doesn't know who his father is and it goes into how his mother was divorced. I understand this happens, but it was written in a really awkward way. 5. Lastly, the oldest sibling is 12 years old and throughout the story she begins to have \"feelings\" for a teenage boy. It explores her emotions of maybe falling in love with him. Then, there is a chapter where Mrs. Tifton even goes as far as saying that if the eldest daughter doesn't be careful, someday she will \"loose her innocence\" to some boy.  I know we can't protect our children from everything, but I was just want other parents to know that these are present in this choice of writing."}, {"userName": "Brigid ✩ Cool Ninja Sharpshooter ✩", "userReviewDate": "Dec 12, 2015", "userURL": "http://www.goodreads.com/user/show/886144-brigid-cool-ninja-sharpshooter", "userReview": "*Hugs book to chest* This was so cute and I enjoyed it immensely! I've been struggling to catch up on my 50-book challenge for the year so I've been trying to read some short middle grade books to meet my goal. I remember my teenage sisters liking this book a lot when they were younger, and my 10-year-old sister recently became enamored with them, so I decided to give the first book a try. And I'm so glad I did!The Penderwicks has a very nostalgic quality to it––both the book cover and the contents of the story. Stylistically, it reminded me a lot of all the classic children's books I read as a child, like E. Nesbit and Edward Eager. The somewhat old-fashioned style sometimes seemed a little strange in a more modern setting (at least I think it was modern? ... it was a little unclear), but somehow I didn't mind it. It was pleasantly quirky. But over all, it's a really sweet story about family and sisterhood and friendship, and it filled my heart with rainbows. I'm excited to read the other books in the series. (Also––if there's ever a movie of this book, I want it to be directed by Wes Anderson please.)"}, {"userName": "Shaun", "userReviewDate": "May 02, 2014", "userURL": "http://www.goodreads.com/user/show/9779623-shaun", "userReview": "Ah...this was okay. The writing was fine, and the characters had promise. Unfortunately, a quarter way through the book everyone and everything became way too predictable and contrived.At times the characters felt believable and at others not so believable. To me the best characters are the ones who seem to act on their own accord, write themselves, and manipulate the author. And there were times when the Penderwick sisters felt like those kind of characters. But then...Then there were other times (too many times) where the puppet strings became all too obvious.National Book Award winner??? Not by my standards, but then I'm not on the voting committee. I have four kids, which means I read lots of children's literature, and though I didn't hate it, it came far from wowing me."}, {"userName": "Olivia", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/31218670-olivia", "userReview": "Awwwww. :)While I wouldn't say that this really became a favorite, I'll definitely have to try to finish the rest of the series at some point, to see if (and how) the ships sail, etc. I think my favorite character might have been Rosalind. She was so sweet and also relatable in some ways. But then, I don't know, I liked all the Penderwicks, and Cagney, and Jeffrey . . . Solid book! :)"}, {"userName": "MsAprilVincent", "userReviewDate": "Dec 25, 2008", "userURL": "http://www.goodreads.com/user/show/600502-msaprilvincent", "userReview": "As I was reading, I had to keep reminding myself that the story is contemporary, that it doesn't take place in the 1950s or the 1820s. That's because the characters don't watch television, they're polite to adults, they care about their education, and they use their imaginations to fuel their leisure activities. They're awesome.Four sisters--Rosalind, Skye, Jane, and Batty--are vacationing in the country with their father. They've taken over a cottage on a large estate, and they meet Jeffrey, the owner's son. They do have some adventures, but they're the normal kind you probably had when you were a kid, the kind that happen without magical intervention or time travel or monsters. The Penderwicks and their friends seemed very familiar to me, and I realized that it's because I've read these kinds of stories before: Ramona Quimby, Jo March, Mary Lennox, and Anne Shirley could have walked through the pages of this book and been right at home. It's nostalgic but not sappy, and it just made me feel good."}, {"userName": "Erin", "userReviewDate": "Dec 09, 2008", "userURL": "http://www.goodreads.com/user/show/99508-erin", "userReview": "Charming, charming, charming. This book, which in many ways could have taken place alongside Little Women, suited me perfectly! A summer vacation in a New England cottage, a hound named Hound, a tight-knit group of sisters who look out for each other, a kind and warm housekeeper! And it's nostalgic, to be sure, but not old-fashioned. In fact, it almost seems to take place in no time, in no place. There are computers and telephones, but they only exist quietly in the background; New York and Boston and Pennsylvania are mentioned, but I kept thinking I was reading about England. This really reads as a labor of love, the author's homage to the books she read and loved as a child. The Penderwicks are also C.S. Lewis' Pevensies, Madeleine L'Engles Austins, Alcott's Marches, and Arundel is Misselthwaite Manor, Green Gables."}, {"userName": "Tracey Dyck", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/55528073-tracey-dyck", "userReview": "This book came highly recommended by several friends of mine, and it did not disappoint!I'm not even sure how to review it. Think back to your fondest childhood summer, sprinkle it with imagination and adventure, and mix it with a dash of humor and buckets of warm fuzzies. That's pretty much The Penderwicks. Like Peter Pan did, it transported me back to childhood in a way that made me smile and want to live at Arundel with these kids just a little longer.Rosalind, the oldest sister, is sensible and secretly dramatic (reminding me a wee bit of myself). Skye is temperamental, smart, and the instigator of many problems--ahem, adventures. Jane is the dreamy writer who awkwardly introduces herself by quoting the next line of her current novel. And dear Batty is the adorable youngest who never removes her butterfly wings. Oh, and then there's Hound, who has a personality all his own. And Jeffrey! Ah, I love that kid! He's the kind of boy I wish I'd had as a friend when I was that age. (I mustn't forget Cagney, either. He was downright adorable for an older teen.)This was a quick, fun read, with each chapter strung along as a new episode in the Penderwicks' vastly entertaining summer. Seriously, if you haven't read this yet, GO DO IT."}, {"userName": "Jessika", "userReviewDate": "Jan 11, 2009", "userURL": "http://www.goodreads.com/user/show/1166992-jessika", "userReview": "What a fun and charming book! This book has been on my TBR list for a while, and I have to admit that at first, it was the cover that drew me in, and then I definitely wanted to read it after finding out it was a children's book about a family of four sisters. The Penderwicks is the perfect read for a sunny summer day. Once I began reading this, I was instantly drawn into the family's adventures, and to be honest, I was reminded of Little Women in that each of the sisters had her own distinct personality and set of characteristics. These are characters that I know I won't soon forget, and I'm anxious to read the next Penderwicks story (apparently Birdsall is in the process of writing a total of five Penderwicks books). There's Rosalind, the oldest, who reminded me quite a bit of Beth from Little Women. Skye, a feisty tomboyish girl, who never hesitates to speak her mind. Jane, a dreamy ambitious writer, who, at the age of 10 has written four of her own books starring her heroine, Sabrina Starr. Batty, the youngest at four, who likes to wear a set of wings to pretend she's a bug, who has an enormous imagination, and who likes to count her dog, Hound, as her closest ally. Even the father, Mr. Penderwick, Jeffrey, the boy who resides at Arundel, and Jeffrey's mother, Mrs. Tifton, have memorable characteristics. The antics of the Penderwicks' summer vacation were enough to keep me entertained for the day or two that it took me to read this quick read. This is perfect for young readers, especially with little glimpses of Latin and algebra here and there (just enough to get the gears turning without being overly complicated). I often had to remind myself that this book has a current-day setting, but I'm not complaining about that by any means. This is a story celebrating the simple pleasures in life, including friendship and family, and often, the children play outside and use their imaginations to entertain themselves, which was refreshing. While being a feel-good story, the characters do run into some conflicts, including Jeffrey, with a mother who seems to think she knows what her son wants better than he does, and Mr. Penderwick, who is criticized for not being a \"good enough\" parent. Everything ends happily, but not in an eye-rolling way.Another thing that I particularly enjoyed was how funny this book was at times. There were lines and situations that had me laughing out loud, such as the time when four-year-old Batty is outside playing \"vampires\" with Hound, upon whom she has tied a black towel like a cape and is screaming about the water in his bowl being blood. A lovely addition to the world of children's literature, I'd recommend this one to anyone looking for an easy, breezy, yet extremely entertaining escape and to those who cherish classics like Little Women and Anne of Green Gables."}, {"userName": "Alexis", "userReviewDate": "Apr 08, 2009", "userURL": "http://www.goodreads.com/user/show/942318-alexis", "userReview": "Anyone and EVERYONE should read this book."}, {"userName": "Alexandra", "userReviewDate": "Sep 27, 2007", "userURL": "http://www.goodreads.com/user/show/351830-alexandra", "userReview": "I enjoyed this story completely and found it charming. I think it will appeal to youngsters around the 8-10 range. But there are many good reviews of this book, so I'm going to express my displeasure regarding the marketing, the description.\"A National Book Award winner, this modern classic is perfect for fans of Noel Streatfeild and Edward Eager.\"I once was a young reader (yes, I know, shocking!) who would search and search for good fantasy stories. When I was past that awkward first-chapter book stage it wasn't as easy as one might hope. At least not at the time. I'd scour library shelves for books, checking out those with interesting titles and covers that looked like they might do, often only to be disappointed once reading the blurb to find a book was realistic fiction rather than fantasy. Books with \"magic\" or \"magical\" in the title or description ended up not being about magic at all!There were also times my young self would be taken in by a book that, as far as I was able to see, appeared to be a fantasy only to read it and be disappointed it was not.Kids who go on magical adventures were my absolute favorite type of story when I was in this age range and reading level. (I'll confess I still love them.) I was THRILLED when I discovered Edward Eager's books, and ate them up like candy.I don't know who it was who decided to claim \"...perfect for fans of ...Edward Eager.\" but it's a potentially misleading claim, especially if the person reading that is a young reader. It is only less misleading to me as an adult because I learned at an early age to be skeptical of such marketing claims.As an adult I think I understand what they mean here, in that this story has a sweet, old-fashioned feel which (IMO) is enjoyable and follows the summer (non-magical) adventures of young sisters. They are likely referring to writing style and tone. Certainly in the case of Eager they are ignoring GENRE.However, for young fans of Edward Eager or that type of magical adventure story, or adults who provide books to read to such young people, I think it's an unfortunate comparison. What my young Edward Eager fan self would have assumed that claim was claiming, and what this story really is are two very different things.I do think my young self would have enjoyed this story. However I think it's important to note this story is NOT a magical adventure story, it is NOT Fantasy, and in that very, very important way it is NOT like Edward Eager's stories at all.I really do wish publishers would remember that often the people reading these blurbs on kids books are kids. And if they're going claim a book is \"perfect for fans\" of an author who wrote beloved FANTASY stories they're going to have some disappointed kids at the end of that claim when they find out there is no magic in this story.I've seen some reviewers make similar comparisons to the books of E. Nesbit, which I think are equally unfortunate for similar reasons.I do think those that say readers who enjoy books by Eleanor Estes would likely enjoy this one are much closer to the mark. I've never read any books by Noel Streatfeild, so I cannot express an opinion regarding that claim.My young, magical adventure, fantasy reading self would like to remind all grown ups that there are kids who think publishers and librarians need to keep in mind if you're going to imply a book has MAGIC they're going to expect MAGIC."}, {"userName": "Small Review", "userReviewDate": "Nov 27, 2010", "userURL": "http://www.goodreads.com/user/show/4579690-small-review", "userReview": "I so completely love this book. If Anne of Green Gables and Little Women met, had a baby, and sent it to live in modern times the result would be this book. I adore every single thing about this book. Have you ever watched a show like Full House where you might snicker a little over how corny it is, but secretly you wish that could be your life? Maybe it's just me, but when I watched that show I wished I could live there with a dad who always knew the exact right thing to say to make me feel better, a family who loved me unconditionally, and sisters who were my very best friends. There was just so much love (cue the emotional music)!This book is like that. The warmth and loving guidance of Danny Tanner or Marmee March are perfectly captured in Mr. Penderwick. The bond of sisterhood is alive and strong with Rosalind, Skye, Jane, and Batty. And, just like the March girls, I can't decide which Penderwick sister I like the best. Each is endearing and relatable in unique ways. They all wear their hopes, fears, and feelings on their sleeves, and I found myself able to relate to each sister and remember when I too went through my first unrequited love, my first realization that boys could be more than icky, my attempts at creativity, and my imaginative play.While the Penderwick girls remind me strongly of Little Women they don't ever feel like cheap ripoffs. Instead, they feel like reincarnations, fully alive, similar, yet distinct. This doesn't feel at all like cribbing from a classic. It feels like going home.The plot is equally engaging, though certainly bolstered by the strength of the characters. Each scene reads like a perfect gem. Hilarious, touching, endearing, and heartbreakingly real, I treasured every event I read. The plot may sound simplistic, but believe me when I say I was entertained throughout. I laughed my way through and never once was I bored or felt the story lagged. On the contrary, when I turned the last page I immediately went online to see if there was a sequel. And there is! There are five books planned with two published and one on its way in the summer of 2011, though each can be read as a standalone.This is a middle grade book recommended for ages 9-12. While it is certainly appropriate for that age group (my library kids love it), it is equally enjoyable for YAs and adults. There is a timeless and ageless quality to this book. The Penderwicks won the National Book Award and it is well deserving. I wouldn't be surprised at all to see this one considered a classic in years to come."}, {"userName": "Miriam", "userReviewDate": "Aug 23, 2008", "userURL": "http://www.goodreads.com/user/show/237469-miriam", "userReview": "Birdsall's first book, The Penderwicks: A Summer Tale of Four Sisters, Two Rabbits, and a Very Interesting Boy, had a timeless and innocent charm. Reminiscent of many childrens' books from the first half of the twentieth century, it could have been set at any point in the past century. Although the summer adventures of the four sister and their friend and dog had serious elements (eg Jeffrey's miserable home life) and were sometimes dangerous (eg the bull) they were truly child-like and carefree.The second installment opens with the girls' mother dying of cancer. Not so carefree! Then it moved forward a few years to their father's half-hearted attempts to date for the first time since losing his wife, and focuses on his daughters' fears of having a stepmother. It also brings in the girls' romantic and school difficulties. Although the writing style and the sisters' personalities are consistent the feel of the story itself is markedly different from the prior volume."}, {"userName": "Melissa McShane", "userReviewDate": "Mar 24, 2016", "userURL": "http://www.goodreads.com/user/show/1329059-melissa-mcshane", "userReview": "I read the fourth book first and of course had to immediately run out and get the others. I hadn't realized what a chronological gap there is between this book and The Penderwicks in Spring, where Batty (here only four or five, I can't remember which) is almost eleven, and it was an interesting change to see the older sisters as young as Batty is there.The Penderwicks exist in a sort of alternate universe in which things aren't perfectly perfect--poor Jeffrey has a horrible mother and doesn't even know who his father is--but everything nevertheless works out for the best. Even the mistakes are ideal and funny. I loved Jane, the budding author, writing endless stories about her dashing heroine and then showing them to (she thinks) a real live editor, then being utterly crushed when he's dismissive of them. And Martin Penderwick, their father, is wonderfully quirky and completely unfazed by having to raise four sometimes wild daughters on his own. I fell in love with the family all over again and only wished I'd read the series in order."}, {"userName": "Richard Derus", "userReviewDate": "Jan 28, 2012", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: two very bored stars of fiveOld-fashioned children's title, but so boring it put me to sleep every ~10pp. I read \"The Five Little Peppers and How They Grew\" last year, for the first time, and didn't feel this deadening miasma of ennui...and it's hard to get more old-fashioned than that! Elizabeth Enright's \"The Four-Storey Mistake\" is old-fashioned, and likewise passes the well-aged test. To be fair, the latter was a re-read, so there were existing happy associations.I returned \"The Penderwicks on Gardam Street\" unread because I didn't want to risk the coma becoming permanent this time. My granddaughter will be relieved, too, since she wasn't any more impressed than I was."}, {"userName": "Elizabeth", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/54023065-elizabeth", "userReview": "The Penderwick Family is on summer vacation to somewhere they've never been before. It turns out to be a wonderful place, and although mishaps do happen the Penderwick sisters will never forget this almost magical trip.This is the most sweetest book I've ever read! How do I put the loveliness of this book into words to convince you to read it if you haven't yet? Should I say that it tugs at the heartstrings? Should I tell you that each of the four sisters are written very well with distinct personalities? Maybe I should say that this books has it all. Amazing family and friends, bittersweet parts, parts that will make your smile so big while reading that you will probably look like a dork but won't care anyway cause that's how cute, or funny, or just plain great it is. If none of that worked then i couldn't possibly say anything else other than \"you should really give this book a try\"."}, {"userName": "Beth", "userReviewDate": "May 26, 2008", "userURL": "http://www.goodreads.com/user/show/13563-beth", "userReview": "I read this to my daughter (age 7) last summer. It's a great summer book (since the characters are on their summer vacation), but not fluffy in the least. Though it's a modern novel, there's an innocence and timelessness to the sisters and their situation. There's no encroachment of pop culture references or lingo, and their actions and emotions are age-appropriate. Now, unfortunately that's a bit of a rarity on the Borders \"young reader\" bookshelves, which are crammed with books about girls in cliques, girls who babysit, girls who gossip, girls and their clothes. \"The Penderwicks\" reads almost like Jane Austen or E.M. Forster with training wheels. (Hmm, that sounds insulting, not what I meant.) By that, I mean it's a good stepping stone for young readers to these authors, not that it's \"dumbed down.\" This is high-quality literature for young readers (and their parents who appreciate being entertained as we read to our kids). We loved the people (and the dog and bunnies) in the book, and can't wait to read the next one!"}, {"userName": "steph ", "userReviewDate": "Jun 10, 2014", "userURL": "http://www.goodreads.com/user/show/5679327-steph", "userReview": "Review April 2018: I have decided to re-read this series in anticipation of the fifth (and final) volume that will be released next month. Re-visiting this book was both a comfort and a delight. I noticed on this read just how well written each of the sisters are, they are each their own person, with distinct personalities and temperaments. Considering that three of the sisters are stair steps (12, 11 and 10 years old), it would be easy for them to be interchangeable to the reader. But even at the beginning of the book they all stood out and I knew who was who (\"Blue eyes, Blue Skye\"), and who did what, etc. and I liked that. Not every author can pull that off.Now onto book #2!Review March 2015: I've been meaning to read this book for awhile, and when I finally got around to reading it I was not disappointed. I really fell in love with this family from Hound the dog to their single father who loves them a lot. I think in this book Rosalind was my favorite though little Batty with her butterfly wings? Adorable."}, {"userName": "Alyson (Kid Lit Frenzy)", "userReviewDate": "Jun 19, 2010", "userURL": "http://www.goodreads.com/user/show/1384232-alyson-kid-lit-frenzy", "userReview": "I read this recently with a group of almost 4th grade girls. It was interesting to see their reactions. Though they either liked it or seemed neutral about the story, they had really paid attention to the story and the characters and we have a lovely discussion. Most admitted to wanting more adventure or action, but still seemed to get something from the book.For me, I felt like I was reading a classic tale - along the lines of Little Women, or Anne of Green Gables - so when something like a computer was mentioned it seemed to be a bit jarring. The innocence and classic feel of this book will attract certain readers and may be off-putting to others. Overall, I personally enjoyed it."}, {"userName": "Kirsty", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "I've wanted to read Jeanne Birdsall's The Penderwicks for ages. I still really enjoy children's literature, and want to make time to include more books of the genre in my yearly reading lists. This looked just right to read whilst on holiday over Easter, and so it came to France with me. The Penderwicks, which is the first book in a series, is immersive and amusing, and I got a feel for each of the characters almost as soon as they were introduced. Birdsall is a good writer, and whilst I do not feel compelled enough by the protagonists to rush to read the rest of the series, I may well pick up the subsequent books at some point."}, {"userName": "Abduraafi Andrian", "userReviewDate": "May 07, 2016", "userURL": "http://www.goodreads.com/user/show/13884563-abduraafi-andrian", "userReview": "Terlepas dari persepsiku atas buku ini yang salah kaprah, aku berharap penilaianku tidak berlebihan. Aku mengira ini bergenre fantasi. Serius; menganggap ceritanya tipikal Spiderwick Chronicles atau sejenisnya. Memang ada bagian fantasi (lebih pada buku yang ditulis Jane Penderwick), tapi buku ini adalah novel. Dan menjurus untuk anak-anak. (Anak-anak lagi, Raaf? Yang benar saja!)Aku memberikan nilai sempurna. Aku samgat berharap akan membaca kisah Keluarga Penderwick lagi. Atau mungkin mendongengkannya kepada anak-anakku kelak. (Cari istri dulu woy!) Bisa juga aku berikan kepada para dewasa yang bebal dan bengal yang butuh didisiplinkan dengan sentilan-sentilan kecil di dalamnya. Pokoknya aku berharap banyak pada buku ini.Aura dan atmosfer buku ini mengingatkanku pada \"Flipped\", novel roman remaja yang terkenal itu. Mungkin karena ditulis dengan gaya yang menyenangkan tapi terkesan klasik. Dan ini buku ke sekian hasil alih bahasa Mba Penerjemah Favorit. Termasuk langka karena terbit pada 2008.Alasan kesempurnaan buku ini: http://bibliough.blogspot.co.id/2016/..."}], "description": "The Penderwick sisters busily discover the summertime magic of Arundel estate’s sprawling gardens, treasure-filled attic, tame rabbits, and the cook who makes the best gingerbread in Massachusetts. Best of all is Jeffrey Tifton, son of Arundel’s owner, the perfect companion for their adventures. Icy-hearted Mrs. Tifton is less pleased with the Penderwicks than Jeffrey, and warns the new friends to stay out of trouble. Is that any fun? For sure the summer will be unforgettable.", "title": "The Penderwicks: A Summer Tale of Four Sisters, Two Rabbits, and a Very Interesting Boy\n      \n          (The Penderwicks #1)", "url": "http://www.goodreads.com/book/show/266904.The_Penderwicks", "average": 4.13, "cover": "https://images.gr-assets.com/books/1320508900l/266904.jpg", "reviews": 4112, "authors": [{"url": "https://www.goodreads.com/author/show/155829.Jeanne_Birdsall", "name": "Jeanne Birdsall"}], "type": ["Fiction", "Childrens", "Childrens", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/266904.The_Penderwicks", "http://www.goodreads.com/book/show/857911.The_Penderwicks", "http://www.goodreads.com/book/show/31843403-the-penderwicks", "http://www.goodreads.com/book/show/1919725.The_Penderwicks", "http://www.goodreads.com/book/show/3155707-the-penderwicks---keluarga-penderwick", "http://www.goodreads.com/book/show/1838166.The_Penderwicks_on_Gardam_Street", "http://www.goodreads.com/book/show/9252036-the-penderwicks-at-point-mouette", "http://www.goodreads.com/book/show/22693811-the-penderwicks-in-spring", "http://www.goodreads.com/book/show/7449671-flora-s-very-windy-day", "http://www.goodreads.com/book/show/18498292-the-penderwicks-at-last", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}