{"ratings": 541, "userreviews": [{"userName": "Emily May", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "“This novel is called The Pain Eater,” said Kara. “In the hills of Faraway, there lived a tribe that had a tradition. Once in each generation, they chose a child who had to carry the pain of everyone in the tribe. They called this child ‘the pain eater.’”\nWarning: both the book and this review contain discussion about rape.Goobie's The Pain Eater is about fifteen-year-old Maddy Malone who was raped one evening by three boys from her school, held down by another, while a fifth boy stood by and did nothing. This is the first thing we are told in the prologue and it paves the way for a searing tale about rape culture, victim-blaming, and all the reasons why rape victims don't speak up - as well as all the reasons why they should. It is somewhat inspired by the Rehtaeh Parsons rape and suicide.It shares similarities with Speak - Maddy shrinks into herself, pushes her family and friends away, and refuses to talk about what happened to her. But Goobie has chosen a different and very effective technique here: Maddy's English class is given an assignment to collaborate on a novel by writing one chapter each, and, through this novel about 'The Pain Eater' and the class discussions following it, many parallels to Maddy's situation become obvious.\nUpon entering the classroom, she’d folded herself inward like a jackknife; her goal now was to be present as little as possible. From this point onward, during English class she would not exist.\n'The Pain Eater' is a fantasy character who is sentenced to literally eat the pain of her village on every full moon. Everyone else gets to live in peace by unloading their burdens onto her. Every student in Maddy's class comes to the assignment with a different style and angle. Some students sympathize with 'The Pain Eater', whilst others suggest her fate is her own fault, or even that she likes it.Some of the messages are, admittedly, a little heavy-handed, and yet that didn't really matter to me. I feel like this book is intentionally accessible for younger - perhaps middle grade - readers. The author writes in a simple, straightforward way about the issues, and she doesn't shy away from drawing clear-cut metaphors so no one can be in doubt about what is being said.The Pain Eater is extremely powerful and moving despite, or perhaps because of, it's simplicity. I was pulled so entirely inside Maddy's head and felt a very real fear and sadness for her. What is especially wonderful, though, is when some classmates stand up for 'The Pain Eater', give her a voice, and humanize her. The strength that can be gained from a single ally is astounding and beautiful. I cried a little at the end, if I'm being honest.Blog | Facebook | Twitter | Instagram | Youtube | Store"}, {"userName": "Nek0 Neha (BiblioNyan)", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/11405894-nek0-neha-biblionyan", "userReview": "“How had she gotten to this place of twisted self-hatred? She hadn’t done anything wrong. She hadn’t attacked and hurt someone else. So why was she being punished in this way—shut out of ordinary human activity, all those normal parts of life like smiling, conversation, hellos and how are yous?”\n\n \nThe Pain Eater\n by Beth Goobie was such a difficult book for me to read. As a survivor of rape, the triggers were at times quite overwhelming. I remember when there was a period in my life where I never would have been able to even think about reading this sort of title. The emotional trauma and the memories of the abuse would come back to my mind in floods rendering me incapable of being a normally functioning human being.But I am not that victim anymore. And that is why this powerful book is so important.\nThe Pain Eater\n is about a young girl named Maddy who is jumped by a group of high school boys in the spring season of her 15th year. She walked a friend home after seeing a play and was attacked. She eventually identifies most of her attackers and is terrified to learn that they all attend the same school as her. What we are faced with is her journey in the aftermath of that attack. The psychological effects of being raped by multiple boys, the emotional chaos that begins to eat away at the victim from the inside out, the unbelievable sense of shame and humiliation, not to mention the unwavering torrents of fear and anxiety—these aspects turn into an intangible monster that mutates Maddy from the art-loving young girl she once was, so full of life and joy, to someone she barely recognises anymore. As she struggles with the trauma, we see blatant signs of post-traumatic-stress-disorder (PTSD), which mostly emerges during her English class. A new assignment begins where they all stand up and recite a story. Each student gets up and adds a chapter to the story called “The Pain Eater.” It’s a story about another young girl in a small tribe who eats all the pain for everyone in her tribe once a month on the night of the full-moon. Through this assignment, Maddy begins to learn about her attack and what it means to be a victim; what it means to be guilty. She gains comprehension of how rape culture affects young ladies and where she stands in that jaded social structure of society. This is the essence of the book, \nThe Pain Eater\n.While I feel it’s a bit obvious, I will go ahead and state it off the bat: TRIGGER WARNINGS FOR RAPE AND SELF-HARM. While the rape itself isn’t described in massive details, it still conjures extremely strong feelings of discomfort and pain. What we see are the shards of Maddy’s memories as waves of what occurred plagues her when she least expects, or wants, them to.One of the most significant aspects of this book is its examination of rape culture! The victims are always blamed with the whole bullshit notion of “they were asking for it,” or that “they totally wanted it and secretly they’re all sluts.” It perpetuates the fear that keeps victims from speaking up about the horrific abuse that they’ve endured.When a woman finally does find the fortitude and courage to report what’s been done, instead of looking to the rapists and the criminals who’ve committed this abhorrible atrocity, the victim is picked apart and always put up on display for the world to see like some fucking freak that’s meant to be dissected. This is NOT OKAY. This is never fucking okay, and this book illustrates to us in an extremely intimate and raw way as to WHY! It’s both sickening to think this is how society functions, but comforting to see a book that isn’t afraid to explore this twisted societal ideology.Maddy changes so much as an individual. She was so vibrant and so close to her family. Post-attack she withdraws into herself and begins to self-harm as a means for coping with what’s happened to her. Even her passion for art has turned into something that she can’t put a name on. It’s a way for her to force her mind to just forget. She fights so hard to decipher why this has happened, and when the answers evade her comprehension, her anxiety and depression mutate further. Even with such powerfully delicate themes, the writing is beautifully simplistic. I felt that the author wasn’t just trying to send a message, but she wanted to make this message as accessible as possible to an array of readers, such as teenagers and middle-grade audiences, to make everyone understand how vital the message is. You don’t have to smack your brain to truly fathom just how terrible rape is, how terrible the after-effects are, and why current rape culture is such a problem.The metaphors are palpable and crystal-clear, eliciting the appropriate understanding for the point that’s trying to be conveyed. Some aspects of the book have a lot more pressure and attention given to them that can come off as unrefined and over-focused, yet I felt that only added to the importance of those particular details.The intensity of this novel and the subject matter that veils the whole thing never lightens up. It’s stays with you from the first page until the last page; like tar its heavy and sticky and unrelenting. As the different people in her class begin to explore the submission of the Pain Eater and why she keeps on taking her tribe’s bullshit, something inside of Maddy begins to ponder the very same questions. Why should she be the one to cower? Why should she be punished and lose the simplest most wonderful parts of her life? Why is she to blame? And most importantly, why the hell should she sit there and swallow the pain that never should have been hers to start with? The realisation that comes with finding your voice and your inner strength to stand up to being victimised and bullied (whether by the PTSD, or the rapists themselves, etc.) is freeing in such a way that I honestly never believed could be expressed via words. Yet Goobie does a phenomenal job of doing just that.\nThe Pain Eater\n is a brilliant book. It’s an uncomfortable book. It is a book that will make you feel. You will feel hurt, rage, concern, and fear. You will be distraught over what’s been done to a remarkable girl. Nonetheless, it teaches us as well. The lessons on human nature, the egregious societal practice that has created a safety bubble for rapists, the inhumane structure of bullying, and the empowering resilience that comes with saying “NO” to the demons left in the wake of abuse—are all so important and necessary, and its execution is absolutely marvellous.4.75 stars out of 5!"}, {"userName": "Karen Barber", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/38841409-karen-barber", "userReview": "The book opens with the rape of fourteen year old Maddy by three of her schoolmates. She tells nobody.One year later, Maddy's pain is too much to bear. She burns herself in an attempt to cope with how bad she feels. She is used to keeping her head down and being invisible. Over the year since the attack, Maddy has worked out the identities of her attackers and things come to a head when she finds herself in English class with two of them.The class are set an intriguing task-a collaborative story. And so begins a fascinating story.As much about the creative act of writing as it is about Maddy's brave decision to finally speak about what happened, this novel is powerful. Like a number of books on this topic, I feel this should be a must-read for teenagers.Thank you to NetGalley for the ARC in exchange for an honest review. This is one book I'll be urging my students to consider when it's published."}, {"userName": "Ellen", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/7039679-ellen", "userReview": "I was worried about reading this due to the subject matter, but I'd heard it was good, so I gave it a shot and I'm happy I did. The juxtaposition of the \"Pain Eater\" story with Maddy's life was powerful and fascinating. To me, it showed how fiction can sometimes convey truth of emotion better than nonfiction. Small spoiler, I would have liked an epilogue to find out what happened with the case, but the ending worked because you got the feeling that no matter what happened, Maddy was going to be okay. Content warning: description of rape (though not graphic, just disturbing), some strong language, and some sexual bullying2017 challenge: a book that is a story within a story"}, {"userName": "Read InAGarden", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/13631871-read-inagarden", "userReview": "Maddie was gang raped after a play last school year, she didn't tell anyone and now that the new school year has begun she's not faring well. She's internalized her pain and has begun abusing herself. She has figured out 3 of the boys who raped her and is startled to find that one is in her English class. As the semester progresses, her English teacher assigns a collectively written story with each student supplying a short chapter. What Maddie begins to realize is that some of her classmates see her as the \"pain eater\" for all the troubles they have. As long as Maddie can be blamed and forced to quietly bear their shame, they don't have to feel guilty. Throughout the course of the novel, Maddie has to look long and hard inside herself to find out if she has the courage to stand up to the bullies/rapists/passive bystanders and set herself free. This is a deep novel with plenty of room for discussion."}, {"userName": "Joana Bookneeders", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/52481988-joana-bookneeders", "userReview": "* Received this copy from the publisher via NetGalley in exchange for an honest review. Thank you very much! This doesn’t affect the review in any way. My opinions, are as always, my own.*Wow.That pretty much describes everything I have to say about this book.I never go much for this type of books because they make me a bit uncomfortable. But this book was incredibly amazing! It was emotionally a heavy read. But it was so realistic, so powerful, so sad and most of all, so cleverly told! And that's the way I didn't want to do a synopsis, other than the one we have from Goodreads. I started reading the book without knowing more than that and it just blew my mind. And that's what I want to happen with you guys too!This story talks about rape in a very unique way. The story is slightly inspired by the rape and suicide of Rehtaeh Parsons. And right in the beginning we know what happened to Maddy Malone. A fifteen years old girl that was raped by three boys from her school, while a fourth held her down, and a fifth boy stood by watching and did nothing.After that we see Maddy's life changing, we see her feelings, her battles and her fears. She refuses to talk hoping that it will go away, she pushes away everyone that cares about her, tries to go unnoticed. She is publicly shamed with the so current phrases: \"she was asking for it\", \"she even liked it\", \"she is a slut\", all the things that make the victim unable to speak up. Some of the phases people who suffered it may experience.But here's where it gets interesting. In this book, we have a story inside a story. In Maddy's english class, the class is given an assignment to collaborate on a novel by writing one chapter each - The Pain Eater - followed by a group discussion. The story will have many similarities to how Maddy feels and some of the chapters will be undoubtedly about her.The main thing about The Pain Eater, is the character created by the class. She is a girl who is sentenced to literally eat the pain of the village on every full moon. But the rest of them diverge. And every persons sees the Pain Eater differently. I really enjoyed the writing in this book, it was very accessible and simple without losing it's strength. It made me cry and it made me angry and afraid. It shows, above all, the victims side very clearly. The why they don't speak up, how far can a raper go, how they sometimes start doubting themselves, how their soul is taken away in that moment. But it also talks about why they should speak up, why they should trust their loved ones and that nothing good comes from hiding. I really likes Maddy and I really sympathized for her. I really felt her pain and I loved how in the end something so tiny as a story and some friends can contribute so much to help a person. This is definitely a must read. It's a very simple story but it's wonderfully told and I would recommend it to everybody."}, {"userName": "Nicole Hewitt", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/4728643-nicole-hewitt", "userReview": "This review and many more can be found on my blog: Feed Your Fiction AddictionThis book is an incredibly painful read because of the traumatic events that Maddy has lived through (and continues to relive). Maddy has become a shell of herself ever since she was raped—she barely speaks, never makes eye contact, and causes herself physical pain in order to block out the emotional turmoil she’s constantly experiencing. She’s tried so hard to forget—but she can’t.The book follows Maddy’s emotional journey and healing, and her story is paired with a class project: a short story that the the class is writing together (each student writes a chapter) about a girl who is forced to “eat” (basically, endure) the pain of the people of her village. The parallels are obvious, and the story soon becomes an allegory for Maddy’s situation. She is expected to suffer in silence, threatened with further reprisal if she speaks. The story is painful but powerful.I did have a couple of small issues with the book. First of all, Maddy views the idea of seeking psychological help very negatively (she doesn’t want to be viewed as “crazy”), and her opinion doesn’t evolve in any way. Instead, she finds healing through art. While I do think art can have therapeutic properties, I was saddened by the negative portrayal of counseling and I had a hard time with the idea that only art would be necessary to help her find healing. The second issue I had was with the fact that the teacher seemed to be overly permissive with her students’ story—I felt like some things were expressed in the story that were pretty inappropriate in a school setting and I didn’t understand why the teacher wouldn’t address it more.Overall, I found this to be a powerful read, full of pain but also portraying hope for healing. I give it 4/5 Stars.***Disclosure: I received this book from the publisher via NetGalley in exchange for an honest review. No other compensation was given and all opinions are my own.***"}, {"userName": "Cynthia (Bingeing On Books)", "userReviewDate": "Jul 15, 2016", "userURL": "http://www.goodreads.com/user/show/5819300-cynthia-bingeing-on-books", "userReview": "I received this ARC from NetGalley one exchange for my honest review. I am going to be the black sheep here. Everyone else seemed to love this book and I'm sorry, but I just didn't.Maddy is gang raped one night after a school play. Five boys are involved; three boys rape her, one holds her down and one watches from afar. For a book about a girl who is raped, I just didn't feel much in terms of emotion. Maybe the fact that I have read so many books on the subject has ruined me. But I just found it dry. When Maddy was talking about how she had changed, I wish the author had showed me instead of told me. The author kind of wrote a couple of paragraphs about symptoms that a lot of rape victims have and I would have rather Maddy experience those things directly, if that makes any sense. Now Maddy has amazing parents that are very loving and very worried about her because they can tell that something is wrong. I didn't like her sister though. Her sister has once conversation with Maddy about how worried she is and when Maddy doesn't tell her what's wrong, she gets mad and stops speaking to her. Really? So your sister (whom you supposedly love and are supposedly so worried about) is going through something and because she doesn't tell you right away, you decide to pull away and stop talking to her? That annoyed me so much. Here's something else that annoyed me: Maddy's view on therapists. Maybe it's my counseling background, but I saw red. Her parents suggested a therapist and Maddy acted like therapy was only for crazy people who were seeing things and hallucinating and acting like zombies. I get why she didn't want to go. She didn't want the therapist to try and get the story out of her. But for Maddy to completely rail against therapy like that made me so mad. Oh and she never changed her opinion on that and never went to therapy. Fabulous. I didn't really understand the boys who raped her. I mean, I don't generally get rapists anyway. But these guys were wearing masks the night of the rape and have no idea if she can identify them or not, but they start to bully her and basically reveal themselves SEVEN months later. Really? If they were going to do that, why didn't they do that right after? I guess that part didn't make any sense to me. I did like a few things about this book (besides the amazingly supportive parents). First, the title of this comes from a collective novel in Maddy's English class where each student took turns writing a chapter. I thought that was a pretty cool assignment and the story was interesting, especially the twists that the students put on it. Of course it became a huge metaphor for Maddy's life. What I really liked . . . no, LOVED . . . about this book was that there was NO ROMANCE!! In other books where a girl has been raped, there is usually guy involved who tries to make the girl get over her rape and all that. But not this time. Instead, there was friendship. Maddy developed a great friendship with a couple of girls and THAT was what helped her move on. I loved that.All in all, while there were a few good things about this one, I just had more issues with it than I would have liked. I wouldn't recommend this one."}, {"userName": "Bookworm LLC", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/22349587-bookworm-llc", "userReview": "WOW! Talk about intense. This book is a story within a story. Once you start reading it you will understand what I mean.The Pain Eater is a story about a young girl named Maddy who has her innocence taken away and feels she has to stay quiet and try to let it go. However, the people responsible will not let her forget. She struggles through her young life trying to come to terms with her feelings and wondering if she will EVER be the same again.Then something amazing happens........two girls in her English class befriend her and help her see she is worth so much more than she gives herself credit for and Maddy starts to really believe.And they give her one gift she will never be able to forget...........the last chapter in the story within this story."}, {"userName": "Rayna", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/55715473-rayna", "userReview": "Holy. Shit. This book... I will write my review as soon as I have processed what I just read. What I will say though is 1. Tears 2. Important.Okay, actual review:*Thanks NetGalley for an ARC of this book, however, all opinions are my own*This book opens up as Maddy Malone is getting gang raped. This is the prologue. So, obvious trigger warnings for rape but also self-harm.Maddy Malone is fifteen years old when part of her soul is stolen from her. She becomes a shell of her old self and that much is apparent to, well, everyone. She tells no one and internalizes all the shame and guilt and pain that too often accompanies these types of traumas. When the memory begins to overcome her, she pushes it down by bringing her mind to the real world via self-harm. Now, when she was raped, her perpetrators were wearing masks from the school play. Seven months later, here we are, and she has identified 3/5 of these boys and successfully avoided them. Until the new school year begins. The Pain Eater is really a book within a book - in Maddy's English class this year, they have to write a story collectively as a class. It is up to the first person on the list, Kara, to come up with an idea for said story. This is where The Pain Eater is born. This is where Maddy realizes she has to sit in a classroom with multiple of her rapists. This story explores everything from peer pressure, to PTSD, victim blaming, slut shaming, bullying, grief, family, and more. Now, this isn't usually how I would review a book, but there are things I feel the need to address as a sexual assault survivor.Maddy's view on therapists. I've seen some comments about how people don't appreciate this and trust me, I get it, I do. BUT, I get Maddy's side as well. When you go through something like this, it can be very hard to accept. You don't want to talk about it because talking about it makes it real. I don't think Maddy truly believes that only crazy people see therapists, it's just a coping mechanism to avoid talking about her trauma. Her rapists bullying her months later. This isn't out of the norm. They had power over her and were only now realizing just how much power since they were seeing her in class on a regular basis. They wanted to watch her squirm and be submissive to them because they could see just how fucked up and distraught she was. I wasn't surprised at this at all. Her mannerisms. She folded into herself. She was very skittish and paranoid and would do things like dig her thumb into her opposite hand to keep grounded. All of these things seemed genuine and not exaggerated. People deal with things differently and it was very believable. She healed on her own time. It took months but she did it on her own. She had some encouragement from a couple of friends and family but she found a way to do it. No, she didn't go to a therapist but neither did I. I found my own way to heal and that's all that matters - healing. And without a boy to sweep her off her feet and tell her it was all going to be okay. No, on her own. I've never been so happy to see myself in a character in this way but holy shit, did I feel proud. I did it, Maddy did it, we fucking did it.All in all, I think the representation in this book was spot on and I cannot recommend it enough."}, {"userName": "Anna", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/62285123-anna", "userReview": "\"You make someone else eat your pain (...). You kick the dog or pick on your little brother, and then you feel better. Why is that? How can hurting someone else take away your own hurt?\"\n14-year old Maddie is raped by 3 boys from her school. The fourth one is holding her and the fifth one just watches. That's the very beginning of the book. For months she doesn't say anything. She withdrew from life. With the beginnig of a new school year she's being harassed by the boys who raped her. At the same time Maddys English teacher comes up with an unusual assignment - a collective novel, and every student from Maddys class has to write a chapter. While reading the first half of the book the only thing I felt was overwhelming loneliness. Somehow Maddys lonelines transfered to me an so for about 3 days I was miserable. I considered dropping the book but if I did I'd always wonder if she'd stayed alone in her pain. The idea of a story within story was brilliant. The author could present everything that's not usually said out loud. How the victim of the rape is left completely alone, how the surrounding can easily jump to conclusions and blame the victim, HOW THE VICTIM CAN BLAME HERSELF! \n\"Because she'd been stupid. She'd been stupid enough to be out walking home alone in the dark when she shoud have known better. If she'd known better, none of this would have happened.\"\nThe second half of the book left me breathless especially the ending. I believe it was the stongest last chapter in all the books I've read. I only wish it was said from first person point of view - it would be even stronger then."}, {"userName": "Dynah Thirst", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/6319304-dynah-thirst", "userReview": "This book got to me. The way the story is interwoven with the story the English class is writing is very effective. The descriptions of Maddy's panic makes you feel like you're right there with her, as does the descriptions of the relief she feels when she starts to be able to talk to people about what happened. This book should become required reading in junior high schools."}, {"userName": "Lisa Mandina", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/1065635-lisa-mandina", "userReview": "I know that a vague ending is best, and it is basically what Maddy did for her story, even though there is nothing more I want to read than that group getting what they deserve. Wonderful story. Emotional. Sitting at my desk at work with tears in my eyes with the last chapters finished.You can read my full review on Lisa Loves Literature HERE."}, {"userName": "Amy's Book Reviews", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/8149327-amy-s-book-reviews", "userReview": "I received a free e-copy of THE PAIN EATER from NetGalley in exchange for my honest review.GRADE: C+One Word: empoweringAfter Maddy is gang raped by several classmates, she withdraws into herself, fearful and depressed. She said tells no one. Two of the assailants are in her English class, where students are writing a progressive novel, each writing a chapter. The story is an allegory of a fifteen-year-old girl known as the Pain Eater in her ancient, mythical village and matches Maddy's rape and its aftermath, as well as the students' individual responses.Beth Goobie's premise for THE PAIN EATER is a unique and interesting way of examine differing attitudes among classmates by gender, popularity and personal experience. Maddy's third person POV kept me from fully embracing her story and feeling her pain. Goobie spoon fed some of the emotions that might have been better shown through a first person voice. While readers knew what Maddy experienced, I never felt like I knew who she was before the rapes, and how she was changed. She seemed to grow remarkable in two months from the beginning of school, without receiving counseling or getting help for her experience. While disclosing trauma is helpful, it's not a quick panacea for PTSD. I did appreciate that Goobie didn't use a 'boyfriend as a cure for rape\".While I liked the idea of the allegorical classroom story, I didn't enjoy that story, which was a big part of this novel. I thought it detracted from Maddy's experiences and prevented me from knowing her better.THEMES: rape, sexual assault, abuse, friendship, family, peer pressureTHE PAIN EATER tells the story of gang rape outside a high school and how different classmates react through a collaborative English assignment."}, {"userName": "Sharon", "userReviewDate": "Jul 05, 2016", "userURL": "http://www.goodreads.com/user/show/28180449-sharon", "userReview": "Second Story Press and NetGalley provided me with an electronic copy of The Pain Eater, in exchange for an honest review.When 14 year old Maddy Malone was savagely attacked by some fellow high school students while on the way home, her efforts to stop her inner pain almost resulted in self destruction. After months of self inflicted pain, Maddy begins to realize how to take her life back.At the beginning, I was skeptical that The Pain Eater would be unique enough to be memorable. The story of a brutal assault was nothing new, nor was the resulting months of pain, jeers, and bullying. The uniqueness comes from the side plot within - the exercise by the teacher that resulted in each class member being able to tell a part of a larger story. The lessons that can be gleaned from The Pain Eater are so important, such as using your support system for help, standing up for yourself, and allowing yourself to be a survivor instead of a victim. Maddy's story, although fictitious, is all too common in the real world. It is my hope that The Pain Eater can help parents open a dialogue with their teens about sexual assault and can provide both comfort and assistance to those in need."}, {"userName": "Krystal", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/9455250-krystal", "userReview": "\"Spur-of-the-moment, the act sucked up the boys’ attention like a supernatural vortex, leaving no thought, no consciousness for anything but their own crazed heat until they found themselves running, still masked and hooting, down the avenue, away from the copse and the still, slender body lying among the aspen.\"This book was amazing and original. Despite the horrible undertones, I found myself reading rapidly to soak in this unique, straightforward narrative. The messages the author provided were so clear and powerful. I hope many people, especially young adults take the time to read it.The Pain Eater follows the story of Maddy Malone. Maddy is an average high school girl, with a loving family, who falls victim to rape at the end of her 9th grade year.She finds endurance and hope in the classroom of her 10th grade English class, following a writing project called the Pain Eater.The author makes the pain and despair so transparent, you can feel it in your own soul. By the end of the story, my eyes were wet with tears of relief and hope."}, {"userName": "Jasmine", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/30498259-jasmine", "userReview": "A powerful, well-written book. Maddy struggles to cope with what happened to her - keep quiet, or tell? Avoid them completely, or face them? To cope, Maddy turns to art and self-harm. I enjoyed the story of Farang, The Pain Eater and the parallels between Farang and Maddy as the story goes on.May be triggering for some readers.Thanks to NetGalley and Second Story Press for the ARC."}, {"userName": "Kate", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/4694216-kate", "userReview": "“How had she gotten to this place of twisted self-hatred? She hadn’t done anything wrong. She hadn’t attacked and hurt someone else. So why was she being punished in this way—shut out of ordinary human activity, all those normal parts of life like smiling, conversation, hellos and how are yous?”I simultaneously have nothing and everything to say about The Pain Eater. I finished it last night and I am still finding myself going back and flipping through it. Starting with the dedication which reads...For the wounded ones, when you are ready, come back from The Beautiful Land. We wait for you here, with love....I wanted to cry, and that feeling never stopped.At 15, Maddy is gang raped by three boys, held down by one, and then there's a fifth boy who watches and does nothing. She is then relentlessly tortured by her attackers as they remind her of the horrific events and to keep her mouth shut. She pulls away from her family, friends, and retreats into \"The Beautiful Land\" in her mind where she can't be hurt. She manages to cope only by avoidance and denial. Then, an English class forces her to be in close proximity with two of her perpetrators and she finds she cannot avoid the issue anymore. As a class, they begin writing a novel together, \"The Pain Eater,\" which begins to mirror Maddy's life and experience.I've recently come back from my own Beautiful Land and reading Maddy's story, while we don't have the same experiences, really resonated with me. This book doesn't shy away from the topic of rape--it's handled and spoken about very bluntly. \"The Pain Eater\" has been on my to-read list for a while now and I'm very glad I finally purchased it."}, {"userName": "Pages For Thoughts", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/44569789-pages-for-thoughts", "userReview": "It is very rare to encounter two stories in one. Both Maddy's story and Farang's story were amazing, and I would read Farang's story even if it was just a book on its own! The parallelism and juxtaposition were extraordinary, and it really showed through. It is very obvious as the story goes on and the two worlds collide. Farang's life is basically a huge metaphor for Maddy, and I have never read anything quite like it! I was disappointed that the teacher did not do much to help. Sure, Ms. Mousumi was concerned, but with the direction that the class discussions took, the correspondence and allegory was so blatantly obvious that I am surprised she did not realize. However, it is an accurate representation of how things really are in high school. Read the full review at http://pagesforthoughts.blogspot.com/..."}, {"userName": "Sarah", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/5527039-sarah", "userReview": "DNF’d at 36%I just... couldn’t care.About the main character.About her family. About the class novel this story is written around.In fact, I think that’s what really killed any motivation to continue, is the class “novel” that Maddy’s English teacher is forcing them to do, and the drama that was starting to crop up around that, involving the girl who wrote the first chapter and the popular bitch trying to “ruin” it because... I don’t even know why, actually.The classroom drama just so... pedantic. Like, I don’t even know what the point of it was, tbh. I thought this book was going to be something else when I picked it up, but I was so wrong.In the end, it just wasn’t for me."}, {"userName": "Sarah", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/5228792-sarah", "userReview": "I don't often write reviews here; I just keep track of the books I read and how much I enjoyed them, but for The Pain Eater, I need to say something. Wow. That is all I can really say. While I do get into books, it has been a long, long time since knots of anxiety of formed in my stomach while reading. This book was difficult to read, but so, so good."}, {"userName": "Stranger Unidentified", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/54506390-stranger-unidentified", "userReview": "An adventure truly"}, {"userName": "Nicole Monk", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/3709798-nicole-monk", "userReview": "It is an incredibly hard book to read, but it was well done."}, {"userName": "Rachel Prince", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/28055295-rachel-prince", "userReview": "The latter half of the novel was so powerful it brought me to tears a few times. Reminded me a lot of Speak, but some parts were even better."}, {"userName": "K", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/6901476-k", "userReview": "Wow. This book was incredible. It is intense, and gives the reader a look into the mind of a girl who has been raped, and continues to be tortured through her school year. She finds strength in friends and family, and begins to heal slowly with her art. The only critique I had with this book was the predictability, and the ease with which she finds her soul again."}, {"userName": "Danielle Webster", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/37182514-danielle-webster", "userReview": "A powerful, tightly-wound and socially relevant story, I couldn’t put it down... This is not a book you read when you want to feel happy. If you’re having a bad day, maybe choose something lighter. But it is a book you should read. It’s difficult and shocking…and beautiful. The Pain Eater affected me deeply and emotionally. Read my full review here."}, {"userName": "KD Grainger", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/37278653-kd-grainger", "userReview": "This was a very difficult read, and all the more important because of it's difficulty. A small disclaimer is required here: This read includes sexual violence, rape, and victim shaming. This a trigger warning for the above topics. The Pain Eater, follows Maddy Malone in the aftermath of a gang rape which occurs after a school production of Our Town. As the reader, we experience Maddy's pain, shame, and anger about what has happened to her. I found this a difficult book to read. There are no graphic descriptions of sexual violence, but Goobie's heartrendingly honest descriptions of Maddy's pain, often turned my stomach. A show of how strong the writing truly is. However, despite these heartbreaking depictions of pain, the novel was very accessible. Goobie uses simple language, and effective metaphors throughout; making the core issues seem that much more realistic and relateable. I suspect, even to someone who has never dealt with any of these heavy topics before. Additionally, Goobie adds realism to this tale by pulling in references to Rehtaeh Parsons and how her life continues to impact young women experiencing sexual assault, rape, or sexual violence. The only area where Goobie lacked realism - and I suspect this might have been intentional - is in the reaction Maddy Malone's family has when she finally reveals she has been raped. They immediately understand, and want to champion her recovery and her going to the police. Many families experience doubt, shame, and even anger when in this situation. Or, simply do not understand at first. However, I think it was Goobie's intention to show a reader (and perhaps victims) that disclosing to one's family is important, and will ultimately help in the end. To that effect, I loved that Goobie choose to have Maddy's family and friends immediately understand, emphasize, and champion her. It may not be perfect realism, but in the realm of The Pain Eater was crucial to the story. I think the topics covered in the Pain Eater - however difficult to discuss, stomach, or understand - are crucial for society to consider. This is why I recommend this read for anyone, but most importantly for young adults, and adults who have loved ones in middle school and high-school."}, {"userName": "Hannah (Broc's Bookcase)", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/16546041-hannah-broc-s-bookcase", "userReview": "Last week after reading Asking For It I decided that I was going to take a mini break from any books featuring sexual assault and maybe read a couple of fantasy books instead. Then the next day I got an email from Netgalley saying that I had been approved for this book and I just couldn't not read it!\"The necessary words felt enormous, like tombstones leaving her mouth. They would change everything: she knew this. Nothing would be the same ever again.\"I really liked Maddy. She was a genuinely nice person who just didn't know how to deal with what had happened to her. Having to spend her days at school in the company of the boys who raped her is torturous for her and so she has ended up internalising her pain and self harming. My only negative for Maddy would have to be that I feel like I would have connected to her and her emotions more if the story was told in first person, rather than third person.\"The other priority was to not think - it was of utmost importance, no matter what, that she did not think. Because if she did, if Maddy let a single thought into her head, then memory would take over...and memory was exactly where she did not want to go.\"I really really appreciated that AUTHOR didn't use a 'boyfriend as a cure'. Instead Maddy's healing comes from her family, friends and her own creativity through her artwork and her writing. She really grows through the 2 months of this story taking place, through the bullying and intimidation, and allows herself to become a survivor rather than the victim that she has been living as for the previous year.\"Well, that was what she was too - an average, ordinary kid now staring at some kind of knowing...a knowing that was undefined, something inside herself that wanted out.\"I really liked the addition of the class collaborative novel. Firstly, it was a pretty interesting story in itself, but also it really lets you see the personality behind each student as they write their own chapters for the novel. It was also interesting to see the parallels between Maddy and Farang (the MC in the class's story) and the way that Maddy started to see herself as the pain eater for her classmates.\"The sensation wasn't new, but it had been a long time since she'd experienced it. It was the feeling of connection - the feeling of belonging in the world of the living.\"You can find more of my reviews at Broc's Bookcase"}, {"userName": "Susan", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/10819713-susan", "userReview": "Maddy Malone is gang raped by classmates wearing masks in her school. She doesn't tell anyone. Why? Whenever she remembers the rape, she hurts herself so she won't feel the pain of it? How does she hurt herself? As school starts in the fall Maddy finds in her English class that two of the guys who raped her are there in her class! She doesn't think she can deal with it. In her English class, the teacher has assigned the class to each write a separate chapter and it will be made into a book. Each student will have to stand up front in class and read their chapter. The guys that raped her try to ensure that Maddy won't tell by various ways including cyber bullying. She is made out to be a slut, and will do it with anyone. In her English class, the chapters are about a 15 year old girl who is the pain eater of her village. That is the only thing she has to do eat their pain and suffer their pain. What will Maddy's chapter be about? Will she be able to do it? Will Maddy tell her family about being gang raped? This is a novel full of sensitive issues that rarely get discussed. The author does an excellent job of writing this story about rape. It is a book that ought to be read and discussed by everyone regardless of being a young adult or adult. At times, my heart broke for Maddy. She survived her path that took her through an awful experience.Disclaimer: I received an arc of this book free from the author/publisher from Netgalley. I was not obliged to write a favorable review, or even any review at all. The opinions expressed are strictly my own."}, {"userName": "Jean Moloney", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/36667864-jean-moloney", "userReview": "Standard teen fic plot....girl gets raped (gang raped) and doesn't tell anyone. One interesting feature was that a lot of the story took place in school - predominately featuring English class and one key assignment was a group novel where each student wrote a chapter. While this seemed interesting at first then it became an excuse for bad writing. Also how protagonist dealt with her trauma was very unbelievable (as were reactions of family)."}], "description": "She hadn’t told anyone. Not a single soul. Not one word about that night and what had been done to her had ever passed Maddy Malone’s lips. She’d thought about it at first - had been desperate, even frantic, to tell. But then had come the shame, and the intimidation from the boys who raped her - and the one who held her down. Now it’s the beginning of a new school year and Maddy is hoping that she can continue to hide, making herself as quiet and small as possible. She is consumed with keeping the memories at bay, forcing them down through small cuts and the burn from the end of a cigarette. But when her English class is given the assignment of writing a collaborative novel about a fifteen-year-old girl, The Pain Eater, fact and fiction begin to meet up. When the boys spread rumors about Maddy, she realizes that continuing to hide the truth will only give them more control, and she slowly gains the courage to confront them.", "title": "The Pain Eater", "url": "http://www.goodreads.com/book/show/30038183-the-pain-eater", "average": 3.97, "cover": "https://images.gr-assets.com/books/1463411755l/30038183.jpg", "reviews": 122, "authors": [{"url": "https://www.goodreads.com/author/show/94686.Beth_Goobie", "name": "Beth Goobie"}], "type": ["Young Adult", "Contemporary", "Realistic Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/30038183-the-pain-eater", "http://www.goodreads.com/book/show/32700253-the-pain-eater", "http://www.goodreads.com/book/show/293748.Hello_Groin", "http://www.goodreads.com/book/show/293722.Sticks_and_Stones", "http://www.goodreads.com/book/show/293724.The_Lottery", "http://www.goodreads.com/book/show/1169132.Something_Girl", "http://www.goodreads.com/book/show/163225.The_Dream_Where_the_Losers_Go", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider"]}