{"ratings": 1245, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "4.5 Living in the Jim Crow South, Florence at eleven doesn't understand fully the things she sees and hears. Her father has a secret box, she doesn't know what is in it, but knows her mother dislikes it immensely. The story is told, as Florence grown and now a teacher, takes us back to her childhood. The people she depended on, her grandfather and her grandmother, her grandmother's black maid, who often watches Florence, and a new arrival, a black young woman named Evie. A beautifully written novel, the words, phrases, sentences, descriptions, I often reread certain passages. Incredibly insightful as well, though looking through an young girls eyes, we also see the things she doesn't yet understand. An ugly subject though, the KKK, violence against the blacks, excused for the whites, racial impurity a threat. The Civil Rights fight in the sixties, will have a direct effect on the community as well as the world at large. Amidst the growing violence,in her own house, and her community Florence will realize the ugly in her world, though she won't fully realize fully what she has seen until she is grown.This book also intorduces a most despicable person, a character to hate in the person ofWin, Florence's father. Although the author tries to show us how his character, his prejudices was formed by his own upbringing, I couldn't excuse most of his actions. The ending made me almost believe in divine justice, in fiction at least. A book that brings this tumultuous time period to life, using a young girl and her innocence, to show the full range of fear, deniability, andyeseven evil. A book that one cannot read without becomng emotionally involved.ARC from Goodreads and the publisher."}, {"userName": "Libby Chester", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/3815302-libby-chester", "userReview": "‘The Queen of Palmyra’ by Minrose Gwin takes place in 1963 Mississippi. Florence Irene Forrest is almost eleven years old. Her Dad, Win Forrest, hasn’t been able to hold down a job and Florence has missed almost the entire fourth grade. Mimi and Grandpops, back home in Millwood, “smack in the dead center of the State of Mississippi,” have discovered that the house their daughter, Martha and her family used to live in, has a ‘For Rent’ sign in the yard. Martha is beyond happy to be back in her old neighborhood, and Win gets a job selling insurance policies. Zenia works as a maid for Mimi and Grandpops, cooking and cleaning. Florence, has begun spending a lot of time with Zenia, either at her grandparents house or at Zenia and Ray’s house. Zenia and Ray live in what’s known as ‘Shake Rag’ to the white folks. When their niece, Eva Greene, comes to live with them for the summer, the final ingredient to an already volatile formula is added. Eva, born in Raleigh, North Carolina, and going to college at Tougaloo in Jackson, loves to diagram sentences. She plans on being a schoolteacher. When Eva finds out that Florence is missing out on a sizable part of her education, she begins to teach her how to diagram sentences. Florence is impressed with Eva’s confidence, her beauty, and her ease of being in the world. Eva is trying to save money for her next year in college by selling health and burial insurance. Eva’s company “doesn’t take advantage of Negroes.”Gwin’s novel begins with a steady pace, as characters pop into their places. Florence is captivating from the start. Eva calls her ‘Flo.’ Caught between her cake baking mother and a dad whose life story is ‘Bomba,’ Florence’s stellar life moments consist of carrying her father’s secret box up from the basement and handing it over to him with the appropriate reverence. Writing about hot and sultry summer days cooled by box fans, a house behind a house, Mimi’s shocking hats that make her look like Honey Bunny, and men that dress in white robes while only one, the Nighthawk, wears black; Gwin conveys the setting of Mississippi with a distinctive southern voice. The South that Gwin writes about, looks much like where I grew up in the 60’s and 70’s in North Carolina.Florence thinks, “What I’d found out the hard way by that time was that people will get their own story like people get a dog and no other dog will do.” The stories these characters favor reveal deep truths about who they are. In the ‘Queen of Palmyra’ story that Zenia tells Florence, the Queen leads the men out to fight. She is brave, even when she’s afraid. We have to be careful about the stories we tell ourselves; the stories we let ourselves believe. The fact that Win's favorite story is about Bomba, a Tarzan like character abandoned in the Amazon, who touts his superior intelligence over that of the natives informs us of something twisted at his core. The prose in this novel is beautiful. I love the words she uses to describe dialogue.“Each word chipped from a block of ice.”“When my Mama and Daddy talked, it was like little hummingbirds fighting over a piece of the yard. Fast and hungry. Where’s supper and how long and are you going out tonight and who called and what kind of cake did they want.”“The way Zenie and Ray talked when they thought I was asleep made me see butterflies in my head. It wasn’t the words, it was the way they had of flitting back and forth and finally lining up just so. Touch and then touch again.”“Let’s get supper on so it’ll be ready when he gets back from his errands.” The he sounded like a stone on her tongue.”Gwin lines words up in sentences with the precision of a surgeon, splicing layers of skin, muscles, and fascia apart, and then stitching, stitching, stitching. This is a beautiful novel. Recommend highly."}, {"userName": "April", "userReviewDate": "Mar 18, 2010", "userURL": "http://www.goodreads.com/user/show/1405910-april", "userReview": "The pitch I was sent for The Queen of Palmyra by Minrose Gwin compared the book to The Help by Kathryn Stockett. Of course, I accepted. However, I would like to put this out there, I think that the comparison hinders The Queen of Palmyra. The only thing the two novels share is the same era and state. The Queen of Palmyra focuses on a little girl named Florence Irene Forrest. Florence is what those of us who are uncouth call white trash. Her family is poor, her dad is scary, and her mom finds solutions at the bottom of a bottle. Florence became eyewitness to the violence which plagued Mississippi during the 1960s.Read the rest of my review here"}, {"userName": "E", "userReviewDate": "Aug 01, 2010", "userURL": "http://www.goodreads.com/user/show/1058750-e", "userReview": "This is voice. This is place. This is style - writing at once powerful, lyrical, poignant, precise, melancholy, true to its source. Imagery flows naturally and easily - rainwater down a hill. I do not usually choose to read books with precocious, pre-teen protagonists. The older I get, the less interested I am in the device. But 11-year-old Florence is the perfect window on this summer of '63, small-town Mississippi story. The age of on-the-cusp, between child and teenager, between naivete and understanding, wanting to be protected - to be seen as someone's Precious Cargo - and wanting to break free. What's in her father's box? Where does he go and what does he do at his nightly meetings? What is the real purpose of her mother's late-night joy rides, and why does she visit the Black bootleggers rather than the White ones? Why doesn't Flo's grandmother's African American housekeeper jump with joy and open her door wide when dirty, neglected little Flo shows up on her porch? What happened to savvy and sharp Eva in the cemetery? Do we control the stories we tell, or do they control us? How do we choose what we see, and how do we accept what we see? Why do we love those who hurt us?As a Louisiana native near enough in age to Florence's character, I find the details of this book - and its heart about race - to ring very true to my memories: the fragrance of jasmine at dusk, the no-no-no of the train whistle at midnight, the saving-killing smog of the mosquito truck, the scurrying roaches that will not die, the sticky sweetness of summer nights, the racial tension as thick as Louisiana humidity in August. THe book cover harkens to To Kill a Mockingbird, and it is easy to see why. But I am feeling more affinity between Queen and the books of Marilyn Robinson, especially her more recent Gilead and Home."}, {"userName": "Yuki", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/41410850-yuki", "userReview": "A well-written book about a young girl's experience in the Good Ol' American South, but not exactly captivating. Although the author surely did extensive research on it, essentially, there is something that isn't 60s Southern in the prose - hence the 3 stars."}, {"userName": "Laura", "userReviewDate": "Jan 17, 2010", "userURL": "http://www.goodreads.com/user/show/170420-laura", "userReview": "This isn't a very likable book - it hurts in the same way that The Color Purple hurts, only Florence is white, not black. Growing up just a hair north of white trash, in Mississippi during the '60s can't have been easy; having an abusive father who hates blacks and a drunkard mother who doesn't mind them is even more difficult. Flo's story hits all the notes you expect from a story about those types of people. Unlike The Help, the voices don't always ring true in part because often you get the grown-up woman talking about the past in a way that seems too adult. The characters also felt somewhat stereotypical, but that doesn't lessen the affect the story has.ARC provided by publisher."}, {"userName": "Mandy Burkhart", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/2883821-mandy-burkhart", "userReview": "What a testament to the strength of a mother...and what lengths a woman will go to in order to save another. This is one of those books that will make you simultaneously love and despise the South all at the same time. The language is rich and creamy, and there was one scene in particular that was set up so very well from the beginning that when you get to it, it almost makes your heart stop for a moment. I appreciated the subtly more than anything, I think, in the prose."}, {"userName": "Ti", "userReviewDate": "Mar 19, 2010", "userURL": "http://www.goodreads.com/user/show/122928-ti", "userReview": "The Short of It:I loved this book. The story deals with some heavy themes but as it unfolds, it sort of falls gently upon your shoulders and really allows you to experience it and take it in.The Rest of It:To be clear, I really loved this book. I wasn’t sure what to expect when I opened its pages but what I found inside was a real treat. Sometimes you fall in love with a book because of the writing. Other times, you fall in love with the characters or while reading it, you just find yourself lingering over every piece of it because it just “fits” you. Although the writing is lovely, what I really enjoyed about this book was that it was filled with wonderful characters and it just seemed to fit me as a reader. It was a good mix of childhood adolescence and larger adult themes.The story is told from Florence’s point-of-view and at the age of eleven, she pretty much tells it like it is. She’s wiser than her years in many ways but at times her innocence comes through and reminds you that she is in fact, just a child. As tensions rise and race continues to divide the community, she struggles to find her place and is sort of swept away with the tide, bouncing from one household to another and not really fitting in anywhere. As rough as this period is for her, I found myself rooting for her, knowing that she’d come out of it okay. Maybe not perfect, but okay and if you’ve had a rough childhood, okay is pretty darn good.Although I found myself relating to Florence the most, I enjoyed many of the other characters even though I never really liked them. In other words, these people would not be my friends, but the author makes them fleshy and whole and spends a great deal of time giving us all of the wonderful details that make them who they are. The smells, the oily sheen of hair oil upon a head, the way they carry themselves, etc. These characters don’t have to say much. There are moments when all they do is sit or stare but somehow the author conveys their thoughts through their posture and mannerisms. It takes skill for an author to speak volumes while the character remains mute.When Eva Greene arrives, it’s as if the door to Florence’s world suddenly opens. Being around the same people day in and day out, you tend to get used to them but with Eva, Florence begins to notice things that she didn’t notice before and that’s when she begins to grow as a character. The presence of Eva made all things real.If I had to compare this to another book I’d have to say that it did remind me of The Help, but just a little bit. The help (Zenie and Ray) do play a key role in this story, but the relationships are not as endearing as the ones in The Help. That’s not to say that weren’t as powerful. The relationships in The Queen of Palmyra were quite powerful but a bit more subtle. As for Florence, she has the same feel as Scout in To Kill a Mockingbird but she also reminds me of Francie from A Tree Grows in Brooklyn. She definitely has her own voice though.I could go on and on about this novel. If you pick it up (and I really hope you do) let me know so we can chat about it. This is one of those books that you want to discuss but so far I’ve only come across one other person who’s read it"}, {"userName": "Mackay", "userReviewDate": "Apr 07, 2011", "userURL": "http://www.goodreads.com/user/show/1196849-mackay", "userReview": "I've seen the other reviews--compared to Harper Lee, compared to Alice Walker...I disagree. This book, for this reader, was tedious, unenlightening, without a credible narrator, and without much to redeem the dreary hours spent reading it. Everything in it has been done and done far better; there is no catharsis, no deepening of one's understanding of the time (early sixties), the place (the deep South), or the issues (racial prejudice, the growth of the civil rights movement). The narrator, alas, is an almost-fifth grader who bears little resemblance to anything but a mildly retarded and incurious seven-year-old. Florence is an unattractive, selfish character surrounded by other, worse characters...except for the family maid, Zenia and Zenia's neice Eva. But unfortunately, they are a little too \"noble Black characters in a second-rate Southern novel.\" The two characters I found most interesting, Zenia's husband Ray and Florence's grandfather, are scarcely more than walk-ons.You want a scarifying view of the Black experience in the South? The Color Purple, or Their Eyes Were Watching God. You want a white child's view of much of the same, with a voice that is true and doesn't waver between \"great writing\" and a child's POV? To Kill a Mockingbird. You want the depths of despair and redemption through the child-grown-up personal insight and resolve? Bastard Out of Carolina. Don't waste time on this. (Book club is the reason I read/finished it, if you wonder.)"}, {"userName": "Pamela Larson", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/9490935-pamela-larson", "userReview": "This is an EXCELLENT book which covers a difficult period in America's history. It has a \"To Kill a Mockingbird\" sort-of feel given that it takes place in the South, it's narrated by a girl child and it addresses the ugliness of segregation and racial hatred, and family heartbreak . It's beautifully written - the type of book one has to put down every now and then to absorb its richness."}, {"userName": "Allison", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/38593196-allison", "userReview": "I could myself physically cringing as I experienced the early 1960s South in this (almost) fifth grader's eyes. A powerful read."}, {"userName": "Audrey", "userReviewDate": "Jun 07, 2010", "userURL": "http://www.goodreads.com/user/show/2151607-audrey", "userReview": "Minrose Gwin is one of those writers that just knows what she's doing. It doesn't seem like she just woke up one day and decided to write a book. It seems more like she worked hard at it and studied and learned how to become a writer. Which is a good thing. Her prose felt so perfect and natural that it just seemed like it had to have been learned. No one with that amount of talent could have just \"decided to have a book\" and miraculously have it turn out as the Queen of Palmyra. It is just too well-written.The Queen of Palmyra is a deeply touching, deeply affecting novel. 11-year old Florence grows up in 1963 in Mississippi. Her education is lacking, and her loyalties are separated between her cake-baking mother and her racist father, who allows her to practically be raised by her grandparents' black maid. Through Florence's uncomprehending eyes, the reader comes to understand just how horrifying it must have been to grow up in small town Mississippi during this time. She loves her father, and she loves her mother, and she loves Zenie, and she is completely oblivious to the tension between them.It is Florence's innocence, really, that makes this book so amazing. Somehow, Minrose Gwin manages to reveal all to the reader through a narrator that didn't understand all. She composes an intricate, complicated story with well-developed characters and believable, torturous events. I have no doubt in my mind that some of these things probably happened. Nothing could have prepared me for my reaction to this book. I'd heard that it was painful, I'd heard that it hurt to read, but it was more than that. Florence's innocence and the way she was just pulled along by the events, by the horrors that her father committed and her mother's inability to escape him, was torturous. I felt for her, I cried for her, I wished that someone would explain things to her, but at the same time I was glad that they didn't. Because she might not have survived if she had really understood her father.Racism was such a big issue back then, and Minrose Gwin approached this issue in a valid, believable, horrifying way. It's obvious that Gwin herself must have grown up in a place where racism is still a palpable thing. There is no way that she could have described it with such precision and grace otherwise. It felt like she was in the minds of her characters, and as such, I felt able to step into their shoes for a moment. And I wanted out.I don't really know what else to say, other than read this book. The summary calls the summer turbulent, and that really is the best word I can think of to describe this book. Turbulent. Turbulence that you will enjoy. It's not an easy read, and you can't expect it to be. But it is enjoyable, and it will affect you, and you will be glad that you did decide to read it."}, {"userName": "Amanda", "userReviewDate": "May 18, 2010", "userURL": "http://www.goodreads.com/user/show/514204-amanda", "userReview": "The Queen of Palmyra takes place that fateful summer in 1963 in Mississippi when temperatures got to record breaking highs, JFK and Medgar Evers were assassinated, and the country's racial tensions were at an all time high.Florence Forrest is a young white girl and it is the summer between her fourth and fifth year in school. However, she is way behind in studies because for the past year, her father and mother have been on the \"lam\" as she calls it, traveling around while her father unsuccessfully tries to hold one job after another. They finally return home to Millwood, Mississippi and that's when things start to crumble.Florence's father, unbeknownst to her, is part of the Klan which is something her mother abhors. However, her father is a bit of a terror and as their marriage slowly crumbles, he tries to keep Florence close by telling her stories that have deeper darker meanings. Her mother manages a quite successful cake business but Florence starts being pawned off more and more on others, mainly Zenie, her grandmother's black housemaid. That summer, Zenie's college student niece, Eva, comes to stay with them. Florence is made a witness to all and must finally grow up and choose for herself which path she must follow.I found this to be such an absorbing novel. I normally don't choose to read novels with such obvious serious topics. In the past, I normally tried to read lighter books for an escapism type of enjoyment. But I'm finding that more and more I'm steering toward books with tougher topics. This is definitely one of those novels. Florence is such an interesting character because of her obvious lack of understanding but she observes everything and tries to figure out what is going on. She's such a neglected character. She is left to fend for herself often and goes long periods of time without food, a bath, or a a change of clothes. I have to say that all the other characters were so well written as well. Her father, though while a terrifying character, is flawed and realistic. Her mother refuses to stand up and chooses to escape. Zenie and Eva were my favorite characters. Zenie, named after Zenobia the Queen of Palmyra, tells Florence stories about the Queen. While a good influence on Florence, Zenie views the care-taking of Florence as just another job and often refers to the girl as \"it\". Eva...well you'll just have to read the story to find out about Eva.I keep wanting to blab about the book so I think this would make a perfect Book Club book. While I've never read The Help, I have read The Color Purple and Their Eyes Were Watching God."}, {"userName": "Elizabeth☮ ", "userReviewDate": "Jun 22, 2010", "userURL": "http://www.goodreads.com/user/show/990216-elizabeth", "userReview": "i entered to win this book on the giveaways and even though i didn't win a copy, i felt it fair to list it as a first read since that's where i first encountered it.the front cover has a snippit of a review comparing this to To Kill A Mockingbird. that's some big shoes to fill. and although Gwin does a an excellent job of slowly developing her main characters, it doesn't quite make the comparison. but i feel it's strong in its own way. the story revolves around florence forrest growing up in mississippi. the majority of the book covers the summer of 1963 - a pivotal summer for the civil rights movement and for florence.her father is a klansman and her mother has made bad choices marrying him and staying with him. neither of them completely devote themselves to parenting. florence finds herself being passed between her maternal grandparents and the african american family that keeps the house and the yard for her mimi and grandpops, ray and zenie.ray and zenie have a niece that comes to visit for the summer, eva, and that's when florence's life really begins to change. eva stirs up the conscience of this small southern town and florence's father doesn't like it one bit. when he and his club take action, florence's mother, martha, makes a dire decision. one that alienates her from florence for a good portion of the girl's young life. the story is told in the first person from florence's perspective as an adult looking back on this time in her life. it takes a good whie for her to realize who and what her daddy is and even longer to admit her mother may never take care of her the way she longs for her to take care of her. the insidiousness of the violence, the hatred, the racism is slow to release itself within the narrative of the story. i suppose much of the same way it takes florence's eleven year old mind to completely comprehend the legacy her father's family is a part of in the South. and the same way these things lie under the surface of one's beliefs only to crescendo into drastic choices."}, {"userName": "Kathy (Bermudaonion)", "userReviewDate": "Mar 15, 2010", "userURL": "http://www.goodreads.com/user/show/1454470-kathy-bermudaonion", "userReview": "After a year of wandering with her family, Florence Forrest is growing up in segregated Millwood, Mississippi in the early 1960′s. Her father sells burial insurance and her alcoholic mother is the town’s “cake lady”. Florence’s mother comes from an educated, enlightened background and her father is a member of the Klan, so their relationship is troubled.Because of her parents’ problems and the tense atmosphere at home, Florence spends most of her time with her grandmother’s maid, Zenie. Spending so much time at Zenie’s home exposes Florence to the treatment of African American people and she sees racism first hand. She doesn’t understand much of what she sees, so she really doesn’t question it, until years later when she reflects back on her childhood.The Queen of Palmyra by Minrose Gwin is exactly the kind of book I love – it’s set in the South and tackles an issue – so I was really excited to read it. I’m sad to say it didn’t live up to my expectations. I’m not sure if that’s a reflection of the book or a reflection of my expectations being set too high.I think the biggest problem I had with this book is that I found the story to be so slow – the pace wasn’t quite fast enough for me. I also wanted a little more background – why did Florence’s parents get married in the first place and why had her family been “on the lam” for a year? I know that some of my questions weren’t answered because the story was told from a child’s perspective, but not having that background took away from the story for me. I also felt a sense of disconnect from Florence – I wanted to get to know her better.I know it sounds like I didn’t enjoy The Queen of Palmyra, but that’s not the case at all, I just didn’t love it like I thought I would. The book is well written and tells a great story, but overall, I found it to be good, but not great. A lot of other readers have loved it, though."}, {"userName": "Jacqueline", "userReviewDate": "Nov 17, 2010", "userURL": "http://www.goodreads.com/user/show/1519696-jacqueline", "userReview": "The writing is beautiful. The story is told through the eyes of an 11 year old child, Florence. The conflicts going on around Florence, both internally & externally are so heavy and complicated. Even though the reader is clued in to what is happening with her family problems and the community's race war, we are shown how the STORY is told from Florence's innocent, naive eyes. She does not understand everything that is going on around her, she cannot yet piece together the whole story that will define her as an adult. Each person in Florence's life has a purpose and an impact on her and it is amazing how everything is connected and comes full circle around this little girl. I couldn't put the book down!"}, {"userName": "Jane Rose", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/26668824-jane-rose", "userReview": "I have just finished reading The Queen of Palmyra. It is hard to say I enjoyed the book because it is a difficult read because of the life of Flo. A mother who deserts here and a father who is abusive. The times it was set in were hard times. I thought they were portrayed well. Throughout the book there is a feeling of doom and bad things about to happen. You could feel the heat of a long summer through the writing and Flo's striving to understand the world in which she finds herself."}, {"userName": "Debbie Maskus", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/2486098-debbie-maskus", "userReview": "This is not what I expected, and frankly the story resembles Summer in the South too much. The story is another of those Southern stories with eccentric characters and depressing times. After chapters and pages of this drivel, I gave up."}, {"userName": "Tracie", "userReviewDate": "Sep 03, 2010", "userURL": "http://www.goodreads.com/user/show/1146445-tracie", "userReview": "What I read was good, but I am giving it 2 stars because I just can't get past page 100... there are so many details and it feels like the book isn't going anywhere. It is hard to keep picking up the book and continue reading it. I can't finish the book."}, {"userName": "Mrs. Lapacka", "userReviewDate": "Aug 16, 2010", "userURL": "http://www.goodreads.com/user/show/1956312-mrs-lapacka", "userReview": "Parts of this book contained beautiful prose, but it dragged in parts. It is well worth a read, but stay away from it if you're in the mood for something light. Beware...It will make you want cake."}, {"userName": "Alice", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/7436064-alice", "userReview": "1963 father is an enforcer for KKK, mother visits bootlegger to give warning. Grandparents pillars of community. Major other actors -- black family --Zenda who cleans house and babysits Florence Irene Foster.narrated by Florence Irene Foster -- told from her perspective as a preteen primarilysense of doom throughout the book. As a Southern child of the time period, much of the tensions around race relations and social structure felt very familiar. race wars, class wars, lack of power --desperation felt by women.passive voice -- slow pace ( I feel asleep while reading.) LOVED the portions dealing with diagramming sentences -- skill used to analysize communication and life pg 242Interesting quotes--passages/imagestitle explained on page 52 (unresolved issue -- who is Queen of Palmyra in this story-?pg 79 When words splash out, they are gone foreverpg 169 I was the bat, he was the cave. (interesting analogy to describe her relationship with father--foreshadowing the darkness of the relationship / culture)pg187 \" That's when I got it. You can make up what happens and it can be that. Smooth as eating a piece of lemon pie. What ever story you want is yours as long as you think it up the picture you want and make somebody else want to see it..."}, {"userName": "Susan Beamon", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/3271638-susan-beamon", "userReview": "This is a charming story about the summer that changed the life of an 11 year old white girl in a 1963 Mississippi small town. Parts of it spoke to me because in 1963 I was a 13 year old girl in a small town in Tennessee, just up the road. Lots of the things she saw, I saw. Fortunately for me, many of the parts of her life were not part of mine. But Florence could have been one of the children I knew then.The Queen of Palmyra has a story within a story. Flo's babysitter, her grandmother's black maid, was named Zenobia, after the queen. When Flo was younger, Zenie told her stories of the queen. Flo imagined herself a handmaiden of the queen, and many times Flo tried to create a place where she could be that helper. However, her father was a racist and a member of a vigilante group whose sole purpose was to keep the black people in town firmly in their place. It made many people avoid Flo. When she finally left the small town with her grandmother, she was able to understand the whys of that. My book club, Novel Conversations, is reading and discussing current books written about the 1960's. This book was my selection for the decade. While the Civil Rights movement had not yet come to the town of Millwood, it wasn't far away. I received my copy of the book I read for this review from a Goodreads contest."}, {"userName": "Suzanne", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/17440988-suzanne", "userReview": "The setting is the racially charged summer of 1963, in the small town of Millwood, Mississippi. The protagonist is the almost 11-year old Florence Forrest. Her parents, Martha and Win Forrest, are an unlikely couple. The family has just returned home from a year wandering around Mississippi and Texas. \". . .Daddy had gotten it in his head he needed to find just the right job for someone of his talents.\" Florence does not understand her parents. Both parents are self-absorbed and provide little or no parental nurturing to their daughter. Florence has missed an entire year of school while away, and she has no friends to return to in Millwood. It is left to her maternal grandparents and their \"Negro\" housekeeper, Zenie and her family, to nurture and care for Florence. This is a gritty novel about Florence's confusion and evolving understanding about her relationship with her parents. The story is fraught with heartbreak, disillusion, and fear. The truth about Florence's father is ultimately revealed after tragedy occurs. This book is so timely, given the current racial discrimination and hatred in our country. In many ways, our present day society has not changed much since 1963. I could not put this book down. I highly recommend it to other readers."}, {"userName": "denise kay jacobs", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/44629127-denise-kay-jacobs", "userReview": "The Queen of Palmyra, a Southern novel by a Southern writer, covers topics I love to read about: relationships between the races in the Deep South, the role of story in our lives, the value of education, and the willingness of Southern families (in general) to embrace the quirky dysfunctions of families (this from a Yankee who has lived in Louisiana and Mississippi for the past 17 years). In the beginning, I read for the pleasure of the phrasing, the voice, the nuance. As the story heated up, these very elements began to agitate me; I wanted to get to the plot. Still, I resisted the impulse to skim. At one point, the story became a nail-biter, and I stayed up until 2:00 a.m. to read as far as I could. I am glad I resisted the urge to skim because, in the end, Gwin returns to every inflection; she ties up every story thread, and, as a reader, I am complete.It is delightful to discover a \"new\" writer, and now I can look forward to reading Minrose Gwin's memoir and her most recent novel, as well."}, {"userName": "Victoria Scott", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/11758600-victoria-scott", "userReview": "This book started off being way too slow for me. I found myself bored, wondering when we were going to get up to the good stuff (if ever). I knew there was going to be racial tension, but from a girl with a black maid? Cool? Not that revolutionary, I didn't think. But then, all of a sudden, we take a complete turn and it got  great . Once she started realising more and more of what was going on around her, I found myself invested, upset, shocked, all those good things. I realise in hindsight that it had to have that slow beginning, to express how much her perspective and awareness had changed, and I guess that worked. I was so interested in the way her family worked, because both her Mama and Daddy seemed absolutely insane. And, not in a fun way, more in an abusive way. TBC"}, {"userName": "Kymberli Ward", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/48394817-kymberli-ward", "userReview": "Highly RecommendedFar more than I expected. Beautifully written, in a stream of consciousness style, I felt as if I were experiencing Flo's emotions; it was easy to become a part of her story. As both an English teacher and a writer, I so appreciated Ms. Gwin's inclusion of the focus on words, on how each of us writes our own stories, intentionally or not. This is a painful book to read, reminding the reader of the all-too-recent history in the U.S. it is especially difficult, given the terrible divides in this country. One wonders if we will ever recover our humanity."}, {"userName": "Lisa", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/171423-lisa", "userReview": "I loved the prose in this book. The descriptive writing was truly beautiful.Eleven-year-old Florence is witness to the racial turmoil of 1963 in Mississippi. Although she is too young to really understand what is going on around her, her observations are lyrical and poignant. I was utterly absorbed in the story and the characters until the end. The majority of the book took place during the summer of 1963. Then time suddenly sped up so that the ending felt pretty abrupt. But all in all, it was a satisfying read."}, {"userName": "Teresa Young", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/5077344-teresa-young", "userReview": "I received a copy of The Queen of Palmyra in a Goodreads giveaway.Some books capture the essence of a place and time, and The Queen of Palmyra is one. Summer in the South, 1963, with a father who is active in the KKK and a mother who drinks to escape her suffocating life - this is young Florence's life. The few people who really care for her, her grandparents, their maid Zenie, do their best to shield, protect, and ultimately rescue her.Minrose Gwin's writing is excellent - I will definitely be reading this book again and again."}, {"userName": "Dustin Hood", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/40959565-dustin-hood", "userReview": "While this novel had all the elements of a great story, I found myself disappointed. The plot is weak and never really has what I would call a climax. The narrative seems just intriguing enough to keep you reading, but waiting for the plot to thicken. Unfortunately that never happened for me. The end was the worst. I felt it was rushed and poorly executed. The author is a good writer, but needs to work on her ability to tell a story that engrosses and emerges the member in the tale."}, {"userName": "Ruthie", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/2138578-ruthie", "userReview": "I eagerly started this book because I was the same age as Flo in 1963 but I was growing up in Pennsylvania at the time. It started out slow to me and I had to keep remembering that it was told in the voice of a ten year old girl but once the story started to unfold I could not put the book down. The story of racial tensions and the division of whites and blacks is a sad time our history but Flo seems to rise above it and actually become stronger in the telling. Well written and gripping!"}], "description": "In the tradition of Harper Lee's classic comes this story of 11-year-old Florence Forrest, an only child growing up in the Jim Crow South, forced to accept unsavory truths about her family.Florence is, by all accounts, a happy, spirited girl. She doesn't understand why her father leaves each night with a mysterious box or why her mama drinks so much. What Florence knows are sultry days spent with her grandparents, being cared for by their maid, Zenie, on the colored side of town.Tension builds during the summer of 1963. Mama bakes cakes at all hours to scrape by. And Zenie's niece Eva is in town, selling insurance to the blacks and stepping on Mr. Forrest's toes. When Eva is brutally assaulted, all hell breaks loose: Mama crashes her car, Florence's grandfather dies, a woman is murdered, and Florence finally gets a look in Daddy's box.Florence sees things that summer that she won't understand for years to come: her mother's disappearance, her father's racism. Years later, she'll face the truth and how she was caught in the middle of it. The Queen of Palmyra is rich in both setting and characters. It's an affecting tale of a girl who is loved yet lost, trying to make sense of the world in a tumultuous time, finally forced to confront the sins of her father.", "title": "The Queen of Palmyra", "url": "https://www.goodreads.com/book/show/7248007-the-queen-of-palmyra", "average": 3.83, "cover": "https://images.gr-assets.com/books/1268454591l/7248007.jpg", "reviews": 247, "authors": [{"url": "https://www.goodreads.com/author/show/73984.Minrose_Gwin", "name": "Minrose Gwin"}], "type": ["Historical", "Fiction", "American", "Young Adult", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/7248007-the-queen-of-palmyra", "http://www.goodreads.com/book/show/8132395-the-queen-of-palmyra", "http://www.goodreads.com/book/show/37547786-the-queen-of-palmyra", "http://www.goodreads.com/book/show/35068602-promise", "http://www.goodreads.com/book/show/1708991.Wishing_for_Snow", "http://www.goodreads.com/book/show/14984926-remembering-medgar-evers", "http://www.goodreads.com/book/show/128781.The_Feminine_and_Faulkner", "http://www.goodreads.com/book/show/2336816.Black_and_White_Women_of_the_Old_South"]}