{"ratings": 55, "userreviews": [{"userName": "Duane Herdman", "userReviewDate": "Mar 18, 2013", "userURL": "http://www.goodreads.com/user/show/18066115-duane-herdman", "userReview": "Great book for the avid zombie fan, was a little slow in the middle but finished with a flurish."}, {"userName": "Michael Donner", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/5868959-michael-donner", "userReview": "I kept getting mad because I had to put the book down!So the last book left us with a cliffhanger and we to agonize till this one came out. While I was pretty sure Roberts wouldn’t actually kill off our main character I have learned that you can never be 100 percent sure. So, spoiler alert, our hero Wylie survives his suicidal bombing and resumes his quest to reunite with his family. Ragnarok Rising: The Reckoning is just as full of action, if not more so than Ragnarok Rising: The Awakening. We not only had Wyllie’s return but some other old, and even new, faces among friends and enemies alike. I like that what I thought were random bad guys in The Awakening were actually part of a much larger collective of people. I also mentioned in my review of Ragnarok Rising: The Awakening that there was at least one character that I wanted dead even though they weren’t in the book that much, well I got my wish… sort of… I mean couldn’t we have at least tortured her just a little bit? I almost feel cheated that she got off so lightly. Yes, just being killed is getting off lightly. One of the things new that I really liked was the addition of footnotes that help explain terms or acronyms. Well at least I think they are new as I don’t seem to remember them from The Awakening. That all being said, I am wondering about a couple of things… I mentioned in my review of Ragnarok Rising: The Awakening that one of the things that I liked about it is the fact that our hero, Wylie, was very human; he takes damage and feels pain and what not. Now, however, his healing ability keeps being brought up and that edges into the borders of the supernatural. The other thing that has me pondering is the one eyed old man who secretly tends to Wylie while he is being tortured. . I really don’t want to say too much but it feels like we are adding more supernatural to our zombie story. I guess we will have to wait for book three to see what develops.My biggest complaint is not really a “complaint.” I stated in my review of Ragnarok Rising: The Awakening that I wasn’t sure I was going to enjoy the book because of its subject matter and I was surprised at how much I did like it. Now, Ragnarok Rising: The Reckoning, everything was better. I kept getting mad because I had to put the book down because, dammit, I need sleep! “Just one more page” or “just to the end of the chapter” is what I would tell myself and the next thing I know it’s one or two in the morning and I have to be up in like 6 hours. So in summery this is an awesome read and now I have to sit and seethe till book 3 comes out… whenever that may be. Dammit! ~Capt. Creeper (Creepercast.com)"}, {"userName": "Colin Buckland", "userReviewDate": "Apr 07, 2013", "userURL": "http://www.goodreads.com/user/show/18528125-colin-buckland", "userReview": "Excellent follow on to The Awakening, and like the first book the action never seems to let up, with the lead character, Grant, not only having to deal with the ever increasing number of zombies, but also attacks from the not so undead.I think D.A. Roberts has the making of a very good series here, and I do know that there is a third book being planned for release later this year. I for one can't wait."}, {"userName": "Stephanie Lunsford", "userReviewDate": "Oct 05, 2013", "userURL": "http://www.goodreads.com/user/show/14783992-stephanie-lunsford", "userReview": "This book if a great continuation of book 1 Ragnarok Rising: The Awakening.You better get in, sit down, & make sure that seat belt is nice & tight as you are about to go on the Wildest Roller Coaster of your life. If an author can make you laugh, cry, & scream all in the same paragraph.. you know he's good! & DA is def that & more.You will read about Grant's trip from the lake explosion that saved his family's life to where he saved his family again at the jail. They know they need a new place but aren't sure where to go when Grant's light bulb went off & he knew he had the perfect place. He was their leader whether he wanted the position or not. You must read this amazing work of art by DA Roberts! I know I can't wait for Book 3... I hope their will be!let's see if we can't keep up the great reviews & mention we want MORE, we want MORE, we Want MORE! lol who's w/me!another great thing about these characters! Wylie knows how to rile up his troops & prepare for battle. I know that he will see Vahalla when it's his time too! After this book is up & you don't believe the same thing... let me know!"}, {"userName": "Jo-Ann", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/18168926-jo-ann", "userReview": "Absolutely loved this book... as well as book one Ragnarok Rising and can't wait for book three!"}, {"userName": "Wanda", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/13666127-wanda", "userReview": "GREAT BOOK! It picks up right where the first one left off. One of the best authors out there. A must read."}, {"userName": "Donna Barenberg", "userReviewDate": "Dec 07, 2014", "userURL": "http://www.goodreads.com/user/show/30944643-donna-barenberg", "userReview": "Non_stop action in this book of the seriesI loved this book as much as the first. A very dedicated, determined main character and keeps other characters from the first book in the action as well. Zombies aren't the only problem as structure breaks down."}], "description": "Book by Roberts, D A", "title": "The Reckoning\n      \n          (Ragnarok Rising Saga #2)", "url": "http://www.goodreads.com/book/show/17594623-the-reckoning", "average": 4.42, "cover": "https://images.gr-assets.com/books/1363560641l/17594623.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/6423276.D_A_Roberts", "name": "D.A. Roberts"}], "type": ["Horror", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/17594623-the-reckoning", "http://www.goodreads.com/book/show/20448363-the-reckoning", "http://www.goodreads.com/book/show/15747641-the-awakening", "http://www.goodreads.com/book/show/20436758-the-crossing", "http://www.goodreads.com/book/show/23312185-redemption", "http://www.goodreads.com/book/show/28958865-desolation", "http://www.goodreads.com/book/show/32941741-last-girl-standing"]}