{"ratings": 5010, "userreviews": [{"userName": "Shawn", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/11011728-shawn", "userReview": "This was a terribly sad but fascinating novel regarding a number of families, Protestant, Catholic, and Quaker on the Emerald Island. It covers nearly five centuries of tumultuous history from the Age of Elizabeth until the Irish Civil War. This is the first Edward Rutherford book I have read and because of its epic nature and focus on specific times and places, I can only compare him to James Michenar. That is high praise. I do wish that Rutherford would have included some of the main historical personalities in the story line. For example, Oliver Cromwell, Roger Emmet and Eamon DeValera are only sketched out as part of the background. Even Ben Franklin as a character is more developed in this novel! Still, it is a worthy read and truly heartbreaking in parts. It is hard to watch the seemingly endless succession of Irish Rebels and Patriots, both Catholic and Protestant, fail so miserably and create such confusion and hardship. The chapters on the Potato Famine was particularly difficult to read. It was also interesting to read about how all the rebels, Catholic, Socialist, Protestant, were devoted idealists, only differing in their causes and the degrees of ruthlessness in achieving their ends. The British are not demonized in this book and, more often than not, they appear as a moderating power as Ireland descended into the sectarian violence of The Troubles. This is an amazing and complicated story and it is an excellent book."}, {"userName": "Charlotte", "userReviewDate": "Aug 03, 2007", "userURL": "http://www.goodreads.com/user/show/251293-charlotte", "userReview": "I loved this book! In fact, I loved the two book series. As one who studies Irish culture and history, I found this series of books to be not only entertaining, but educational, as well. Though not as dearly loved as Trinity by Leon Uris (lets face it, no one can beat Conor Larkin as an Irish hero,)this book covers that same period of time with a few additional centuries thrown in. I did find that I had to review the family tree on several occasions, as the multiple family connections became complicated, but not untenable. It is this intermingling of families that makes the history of the Irish people come alive."}, {"userName": "K.M. Weiland", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/2971567-k-m-weiland", "userReview": "Much more gripping than the first book in the series. I appreciated getting a solid view of Ireland’s history and the causes behind much of their strife."}, {"userName": "Tim", "userReviewDate": "Aug 11, 2010", "userURL": "http://www.goodreads.com/user/show/796216-tim", "userReview": "Nice chronicle covering three centuries of Ireland's past right up to the Easter uprising in 1916 and the island's independence in 1921.Rutherfurd's history sweepers are engrossing and challenging (Sarum, Russka). This one is no exception. I knew about the Catholic and Protestant divide over the centuries, but had no idea just how convoluted, murky, and ultimately intertwined it was. Family landlords, Old English Gentry, the Ascendancy, name changes, families deliberately deciding to make some children catholic and others protestant so they will have one member at least in the \"good\" whatever the future holds - all playing out in Ireland as secondary effects from the same ebbs and flows on center stage in England itself.Rutherford also provides some geographic context of the island itself, and adds the international impact of Ireland's \"wild geese\" (Irish who have fled or deported to other countries where a brighter future is possible - America, France, Australia.)The most disconcerting aspect of his narratives when sweeping through 3-4 centuries, is this reader's comfort level settling in with a set of characters only to see them move quickly from young adults to grandparents, then on only in memories soon forgotten. Rutherfurd can develop characters but one must enjoy them for the fleeting time one has with them, as the lineages move on. Rather unsettling to see oneself in that process ..."}, {"userName": "Kristin", "userReviewDate": "Oct 19, 2010", "userURL": "http://www.goodreads.com/user/show/3457572-kristin", "userReview": "On one hand, I really like Rutherfurd's style of telling history. By following the same families through hundreds of years, it's possible to see how the country changed over time and how those changes affected generations of real people from different backgrounds. On the other hand, it is so frustrating to start feeling close to a character only to suddenly shift 40 years in the future, where that character is dead and his children are middle-aged. There were also many characters I wanted to know so much more about, particularly Garret, Conall, Deirdre, Brigid, Patrick... okay, just about everyone, really. I grew fond of the Smiths and Walshes especially. I also wanted more about many events, such as the Famine (though that part was really well written and depressing) and the Easter Rebellion. Strange to want more from such a huge book, but there you go.I do have to also say that I didn't like this one as much as I liked The Princes of Ireland, and I think there's an easy explanation for that. There is something magical and fascinating about the Druids, Celts, Vikings, Welshmen, and others of 430-1533 who populate the first book. Compared to 1000 years of such diversity, I guess 325 years of Catholics and Protestants, Irish and English bickering with each other is just not quite the same. (It's not that the book isn't good, because it certainly is. My personal preference just leans toward the earlier history; religious bickering has always irritated me, I suppose. So I could see myself rereading Princes but probably not Rebels.)Thank goodness for the detailed family tree at the front of the book. I probably flipped to it every 20 pages or so, at least! It really helps keep things straight. I also loved how often characters stopped at Glendalough on their way between Dublin and Rathconan because of the meditative peace of the place. Besides Dublin, that is the only place in Ireland that I've visited, and it was one of the most, if not the most, special days in my life. It is an incredible place, and it really got me that others felt the same connection to it 400 and more years ago, and it was already ancient then. Just wow.So good book. I came to love and hate many of the characters, and I felt bereft when many of them passed on, until I came to know their descendants and the cycle started again. :)"}, {"userName": "Irene", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/27716140-irene", "userReview": "This was a well-researched history book with a low-level soap-opera plot: basically the perfect recipe for a boring book. The things that annoyed me the most were the shamefully shallow characters and the physical descriptions of female characters, who all are a horrifying combination of \"peachy skin\", \"tender breasts\" and other nonsense."}, {"userName": "Frances", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/8618255-frances", "userReview": "Simply magnificent. The convoluted, tragic history of Ireland is done justice in this epic book. Impossible to summarize so just read it."}, {"userName": "Vít", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/20978734-v-t", "userReview": "Důstojné pokračování Dublinu, tentokrát s přesahem do celého Irska, byť Ulsteru se dotkneme jen okrajově. Psáno v Ruthefordově klasickém stylu, zábavně a čtivě. Je to opravdu román, ne učebnice irské historie a tak je potřeba to brát. Historické události vidíte z pohledu lidí, kteří se jich účastní, ne jako historik, který zná celé pozadí a souvislosti. O nic důležitého ale přesto nepřijdete.Jediná věc mě trošku mrzela, a to, že autor nedotáhl děj třeba až do 70. let 20. století, ke Krvavé neděli, IRA, bojům v Severním Irsku atd."}, {"userName": "Patsy", "userReviewDate": "Apr 29, 2009", "userURL": "http://www.goodreads.com/user/show/969983-patsy", "userReview": "This sweeping (and I mean sweeping) epic of Irish history is the 2nd in a series. It's very ambitious covering a period from the late 16th century to the early 20th century. Great writing and interesting history make it an enjoyable read but it's almost too ambitious! I'm in the last 50 pages and am looking forward to being done! The most interesting angle of this history - one which I never fully understood -is how and why the religious rifts occurred in Ireland. I also learned the \"old English\" families or those that settled in Ireland in the 1600's really considered themselves Irish and were champions for the Irish Catholics through the years of Cromwell, William or Orange, King George, etc. A great historical romp that gets a bit dry at times."}, {"userName": "Thomas", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/586014-thomas", "userReview": "Rutherfurd is fair and historically accurate -- even sensitive, I would say -- but the centuries-long scope of the book is too broad to support anything terribly profound. Generations come and go, and characters who are developing nicely are quickly snuffed out by time. I suppose this is simply the nature of a history-based novel that takes place over a long span of time, and I suppose I was unreasonably hoping for something with a little more depth. It's not a bad read, given the parameters Rutherford is working with, but the result is watered-down and a tad bland."}, {"userName": "Glyn Longden", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5869217-glyn-longden", "userReview": "Rating: 7/10. The second book of 'The Dublin Saga; the first was 'The Princes of Ireland' which I read in Feb./06. I also read Rutherfurd's 'London' which was excellent. In this fictional account the English take over Ireland lock, stock, and barrel. After reading the accounts of British oppression you can understand completely why the Irish hate the English so much. Rutherfurd's style is like Micheners...a story at each level or time period. Very effective. I enjoyed both books in this series although I rated the first one higher."}, {"userName": "Bridget", "userReviewDate": "Jun 18, 2011", "userURL": "http://www.goodreads.com/user/show/5642505-bridget", "userReview": "Finally finished! This was another fantastic look at over 500 years of history. The first book, The Princes of Ireland, starts in 430AD, and follows six Irish families through the reign of King Henry VIII. This was the second book in the series, following the same six families from the the 1500s through the Easter Rising of 1916. Highly recommended!"}, {"userName": "Sophie", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/5167235-sophie", "userReview": "It was an interesting read and as always Rutherfurd’s characters make history come alive. I feel I understand better now where Ireland is coming from, although the reader is left a bit hanging with the story finishing in the 20s."}, {"userName": "Mandy", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/15392105-mandy", "userReview": "At times the characters' stories and interactions seemed a bit forced to be able to fit into the timeline but other than that, great stuff. Also, not as descriptive of settings/characters as I'd like."}, {"userName": "Jo", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/3721054-jo", "userReview": "After reading hundreds of pages in a sprawling, unhurried hand, the ending seemed rushed and jerky. It almost seemed that the book could have been longer (Did I really just say that about an eight hundred page book?). I've thoroughly enjoyed my time wandering through Rutherfurd's Dublin. I learned so much about Irish history and mindset. They are to be greatly admired, and I count myself lucky that I am of Irish descent."}, {"userName": "Kat", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/5876348-kat", "userReview": "Not bad, but a bit boring in between...."}, {"userName": "Cait", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/6595239-cait", "userReview": "These books are long, but so so good."}, {"userName": "Barbara V. Vaughan", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/34658358-barbara-v-vaughan", "userReview": "Fictional account of Irish HistoryThe book leads you through time with stirring events that take place in the lives of several fictional families. The historical content is concise. The elements of relationships make Irish history come to life."}, {"userName": "Katherine Coble", "userReviewDate": "Jan 15, 2013", "userURL": "http://www.goodreads.com/user/show/295586-katherine-coble", "userReview": "I'd set this aside several times, and was determined that I'd read it this year for St. Patrick's Day. I think it's safe to say that this is my second-favourite Rutherfurd, after Sarum. The characters' stories that we follow through the river of Ireland's history are good ones; they are compelling enough to keep you coming back even through the darker historic times. Still, this is an intense book. I recommend it for anyone interested in brushing up on Ireland's history from 1500-1900, yet I caution you these are not the best and brightest years for Ireland. Turbulent wars and famine and ever-present politics take center stage, while the romances and life dramas of fictional bloodlines serve as the sugar that makes the bitter history easier to swallow. The book is better in the first two-thirds; by the time we get to the Irish Potato Famine much of the narrative consists of political lectures and diatribes against the British. Which, don't get me wrong, the racism toward the Irish led the British government to make some AWFUL decisions regarding food and aid. Still, the book dwells on them to a depressing degree."}, {"userName": "Sean Kennedy", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/2535186-sean-kennedy", "userReview": "I know the political history of Ireland is a complex one, but this second volume of the Dublin saga seems to think long plodding scenes of political discourse are more interesting than the human angle. It's absolutely bizarre that the Famine, the Diaspora and the Easter Uprising are all dealt with in the last hundred and fifty pages when you could have gotten a lengthy novel out of just one of those events alone. Indeed, the end is so rushed that one feels shortchanged after 1800-odd pages. Are we to expect Dublin 3?"}, {"userName": "Liz", "userReviewDate": "Feb 24, 2009", "userURL": "http://www.goodreads.com/user/show/1176111-liz", "userReview": "Tells the peculiar history of Ireland through 2 long books. The first, Princes of Ireland, is fabulous, old tribes, princes feuds and the obligatory pair of flashing green eyes that threads through both books and centuries! I listened to this one, very entertaining and informative. I understand more of the \"troubles\"."}, {"userName": "Judy", "userReviewDate": "Oct 06, 2011", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "I listened to the audio version of this book before joining Goodreads in 2010. Rutherfurd does a wonderful job of bringing Ireland's history to life through this fictionalized account of the Protestant and Catholic adversity. He has a gift for making history palatable and unforgettable. I would read more of his books except they are so blooming long and my TBR list is likewise."}, {"userName": "Milt", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/4574838-milt", "userReview": "It was a very good read indeed. It defines both the chartacter of the Irish and the duplicity of the English with a balanced point of view and a good story sense."}, {"userName": "Dawn Lennon", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/16829500-dawn-lennon", "userReview": "I'm a serious Edward Rutherfurd fan, having read all his books about England and Ireland. This one was my least favorite, but I would have liked to give it a 3.5 rating. The challenge with this book, more than likely, resides in my difficulty in understanding the extraordinarily complex, sometimes subtle and sometimes intense, issues between the Catholics and Protestant (Presbyterians too) over the centuries in the two countries.Following the political wranglings, injustices, arbitrary policies, shifting positions of Kings and their agents was one issue. The other was following the position of Irish rebels trying to gain control of their country by rebellion, compromise, false trust, and division. Add to that the ravages of famine, the feelings of powerlessness, the cruelty of English pro-market forces disinclined to help the starving, and you have a book that feels like a whirlpool without end.That said, once again, the characters that Rutherfurd uses to hold the book together are the salvation. In many ways, they are the ones that help the reader make sense of it all and that grip the heart. I wish that I'd had a better background for the issues covered in this book, but that said, after reading it I have added a new layer of understanding that in many ways is shedding light on some of the current issues of our time. It seems that issues of religion, the have and have nots, and zenphobia remain front and center."}, {"userName": "Jaimie", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/8659422-jaimie", "userReview": "It may have been a mistake to attempt reading two Edward Rutherfurd books in one year, but since it took me until 2018 to actually finish it I won’t quite count it as a faux pas. I briefly grew weary of the historic melodrama during the chaotic cross-provincial move, but I found my bearing again in mid-December once things had settled down a bit. This second book about the families of Dublin and the surrounding area was a lot less romantic than the Princes of Ireland, but it seems fitting since the main themes are centred around English political influence and the ensuing violence and political agitation by the native Irish in promotion of Home Rule. I still can’t say that I fully understand Irish politics, but the family infighting and fracturing of clans does make it seem a little bit more sensical - everyone is fighting everyone in what’s essentially clan warfare on a grander scale. A bit ridiculous in hindsight, but I’m looking at the situation from many years in the future and from across an entire ocean. Eventually I may attempt to study Irish history again, but for now I’ll stick with enjoying the literature and ancient celtic culture."}, {"userName": "Meredith", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/174861-meredith", "userReview": "A wonderful way to learn history. As it turns out, I knew virtually nothing about Irish history. Its really a very sad story, and shows that different race/skin color/ethnicity are not required for humans to hate or feel contempt for other human beings. Religion is one of those differentiating human traits that causes irrational enmity, and the multi-generational conflict between Protestants and Catholics makes it easier to understand the current (and not really recent) conflict between Shiite and Sunnite Muslims."}, {"userName": "Jane Benstock", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/57453879-jane-benstock", "userReview": "I listened to the audio version of this book. It took 24 discs just for volume #2! I did enjoy both parts of this extensive history of Ireland, but I must admit, that I began to glaze over at times during the last chapters. Many years ago I read Trinity by Leon Uris and I think that did a better job and was a bit more enjoyable. I tend to pay more attention to the character development rather than the details of the history."}, {"userName": "Claudia", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/34762330-claudia", "userReview": "Rutherfurd fa bella mostra delle sue grandiose capacità descrittive, facendo dell'Irlanda non solo lo sfondo sul quale avvengono i fatti, ma anche un vero personaggio che si evolve e cresce col mutare dei tempi.Un ottimo modo per leggere la storia poiché permette di vedere gli effetti che i grandi eventi hanno sulla gente comune, senza dimenticare che spesso è il \"popolino\" a fare, inconsapevolmente, quella che i grandi studiosi chiamano La Storia."}, {"userName": "Mike K", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/28848650-mike-k", "userReview": "I've read a number of Rutherford's books. This was not one of his best, perhaps because I'm more familiar with the history of Ireland. It seemed long winded - the stories were drawn out to no real purpose. His elaboration of the rebels at various times seemed weak and distant; he couldn't seem to get close enough to the people involved, only those on the periphery for the most part. I'm reading Paris next - I hope that's better."}, {"userName": "Patty Leunig", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/57568280-patty-leunig", "userReview": "Anyone interested in their Irish ancestry should read books 1 &2 of this Irish saga. I had no clue of the British oppression of the Irish people over the centuries.. A historical fiction account through the eyes of various family members. It can take a bit to keep everyone straight, but a fabulous story! Book 2 is from the period of 1597 thru WW I."}], "description": "The reigning master of grand historical fiction returns with the stirring conclusion to his bestselling Dublin Saga.  The Princes of Ireland, the first volume of Edward Rutherfurd’s magisterial epic of Irish history, ended with the disastrous Irish revolt of 1534 and the disappearance of the sacred Staff of Saint Patrick. The Rebels of Ireland opens with an Ireland transformed; plantation, the final step in the centuries-long English conquest of Ireland, is the order of the day, and the subjugation of the native Irish Catholic population has begun in earnest. Edward Rutherfurd brings history to life through the tales of families whose fates rise and fall in each generation: Brothers who must choose between fidelity to their ancient faith or the security of their families; a wife whose passion for a charismatic Irish chieftain threatens her comfortable marriage to a prosperous merchant; a young scholar whose secret rebel sympathies are put to the test; men who risk their lives and their children’s fortunes in the tragic pursuit of freedom, and those determined to root them out forever. Rutherfurd spins the saga of Ireland’s 400-year path to independence in all its drama, tragedy, and glory through the stories of people from all strata of society--Protestant and Catholic, rich and poor, conniving and heroic.  His richly detailed narrative brings to life watershed moments and events, from the time of plantation settlements to the “Flight of the Earls,” when the native aristocracy fled the island, to Cromwell’s suppression of the population and the imposition of the harsh anti-Catholic penal laws. He describes the hardships of ordinary people and the romantic, doomed attempt to overthrow the Protestant oppressors, which ended in defeat at the Battle of the Boyne in 1690, and the departure of the “Wild Geese.” In vivid tones Rutherfurd re-creates Grattan’s Parliament, Wolfe Tone's attempted French invasion of 1798, the tragic rising of Robert Emmet, the Catholic campaign of Daniel O’Connell, the catastrophic famine, the mass migration to America, and the glorious Irish Renaissance of Yeats and Joyce. And through the eyes of his characters, he captures the rise of Charles Stewart Parnell and the great Irish nationalists and the birth of an Ireland free of all ties to England.  A tale of fierce battles, hot-blooded romances, and family and political intrigues, The Rebels of Ireland brings the story begun in The Princes of Ireland to a stunning conclusion.", "title": "The Rebels of Ireland\n      \n          (The Dublin Saga #2)", "url": "https://www.goodreads.com/book/show/51433.The_Rebels_of_Ireland", "average": 4.08, "cover": "https://images.gr-assets.com/books/1388283043l/51433.jpg", "reviews": 351, "authors": [{"url": "https://www.goodreads.com/author/show/16204.Edward_Rutherfurd", "name": "Edward Rutherfurd"}], "type": ["Historical", "Fiction", "Cultural", "Historical", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/51433.The_Rebels_of_Ireland", "http://www.goodreads.com/book/show/743917.The_Rebels_of_Ireland", "http://www.goodreads.com/book/show/1139612.The_Rebels_of_Ireland", "http://www.goodreads.com/book/show/9719579-i-ribelli-d-irlanda", "http://www.goodreads.com/book/show/39895321-irsko", "http://www.goodreads.com/book/show/19387552-the-rebels-of-ireland", "http://www.goodreads.com/book/show/30348502-die-rebellen-von-irland", "http://www.goodreads.com/book/show/6589131-the-rebels-of-ireland", "http://www.goodreads.com/book/show/451215.Ireland_Awakening", "http://www.goodreads.com/book/show/1853145.Sarum", "http://www.goodreads.com/book/show/92160.London", "http://www.goodreads.com/book/show/8258519-new-york", "http://www.goodreads.com/book/show/28867.The_Princes_of_Ireland", "http://www.goodreads.com/book/show/18730321-paris"]}