{"ratings": 1153, "userreviews": [{"userName": "Paromjit", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is a superbly intricate debut novel that I absolutely adored reading. Set in Philadelphia, Lee Cuddy is the invisible girl, vulnerable to any attention that she gets to secure validation of her existence, leaving her wide open to being the fall girl, taken advantage of, and facing betrayal from almost every quarter. She's a thief, professionally expert, a readymade thief that parallels the readymade art of the avante-garde artist Marcel Duchamps. The trajectory of Lee's life feels surreal in the novel, structured like a cubist painting, a puzzle where the pieces feel discordant until they begin to connect. This is a story of love, loss, art, obsession, science and the efforts of Lee to carve her own path, free from shadowy entities with their own sinister plans for her. Lee ends up in a Juvenile Detention Centre thanks to her 'friend' Edie's treachery until she manages to escape. She gets signs that help will come from the Station Master. This brings her to the Crystal Castle where strange happenings and a disturbing photograph of a woman who looks like her has Lee leaving with a stolen object. There are missing young people and exclusive invitation only parties at the Silo where people are dressed up and Lee becomes the 'Bride'. She is the focus of attention of what appears to be a cult group known as the Societe Anonyme, and the 9 Batchelors, including the Priest, Undertaker, and the Station Master. Lee meets Tomi, and goes on creeps in the city at night with him to abandoned sites like the aquarium, and underground places in the city. Trailing Lee is an intense aura of menace, a rising pile of dead bodies, where places of safety prove to be extraordinarily elusive. Lee encounters love, a deeper knowledge of Marcel Duchamps as she realises she is the target of a murderous group obsessed with the artist, his works and driven with the belief that Duchamps had the answers to the deepest conundrums in the universe.This is a beautifully written and atmospheric novel that weaves a compulsive hold on the reader. It weaves a mystery, with art, science and the metaphysical interpretations of Duchamps art pieces. Amidst all this, is Lee, a complex and hypnotic character, forced into homelessness and precarious living as the world crumbles around her, fighting a losing battle to untangle herself from the whims of the Societe Anonyme's batchelors and a blood soaked trail of death that touches those close to her. Augustus Rose has penned an erudite and imaginative debut novel which ensnares the reader with ease. It is hard to believe this is his first book. I highly recommend this to those who like intelligent, imaginative and thrilling mysteries. Many thanks to Random House Cornerstone for an ARC."}, {"userName": "Kemper", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "I received a free advance copy of this from the author for review.This is one of those impossible reviews because I’d have to get into huge chunks of third act plot to talk about the parts I found the most intriguing so I don’t want to spoil it, but on the other hand I suspect that this is the kind of book where a lot of readers are going to think it’s one thing and be pissed off when it turns out to be another so providing some warning seems to be in order. It’s a real pickle we got here, folks.Let’s start with the basic plot which is about an introverted teenage girl named Lee who thinks of herself as being completely invisible and unremarkable except for her talent for shoplifting. Lee’s life is derailed when she’s falsely accused of a crime, and eventually she ends hiding among the homeless on the streets of Philadelphia. (That Bruce Springsteen reference was not intentional.) Eventually she finds shelter in an old building dubbed the Crystal Castle run by a strange group of people that Lee soon grows to distrust. When Lee ends up on their bad side she once again finds herself on the run and caught up in a conspiracy centered around the works of French artist Marcel Duchamp.That description makes it sound like this is just The Da Vinci Code, but that really sells the book short and would be misleading because while this definitely has elements of a conspiracy thriller it’s closer to being serious Lit-A-Chur than a genre book even though it also has some sci-fi elements to it. Plus, it’s not terrible. So it’s probably better to compare it to Night Film which is another book that blends some solid real-world thriller aspects with a general tone of uncertainty that makes you scratch your head a lot while reading because you’re pleasantly baffled.The writing is deceptively straight-forward. There’s no real lines that blew me away in and off themselves, but where Rose excels is in creating haunting imagery. Whether it’s an abandoned aquarium at night or a rave in an old missile silo with an inflatable clown head by the entrance or a guy in old-timey clothes riding an antique bicycle down the street you really see these things, and they all combine to help create the aura of mystery that hangs over everything. He also does a very good job of breaking down the visual aspects of Duchamp’s work which ties into his philosophy about the observation of art.Since it isn’t a straight line thriller that’s as concerned with atmosphere as plot there are some points where I found myself wishing that things would move along and that Lee didn’t spend quite as much time on the run and in hiding as she does. There’s one sub-plot in particular that didn’t seem to go much of anywhere other than to provide Lee with one skill that’s critical for her a couple of key points. And in fairness the sense of desperation Lee has is built by these extended periods of her in survival mode.While I enjoyed this quite a bit I also think it’s going to be a real Love-It or Hate-It book that will be impossible to predict how another person might react to. It’s general WTF tone for much of the book leaves a reader on uncertain footing and that’s not everybody’s cup of tea, and the payoff is only going to appeal to some folks, not all. Still, it checked off a lot of boxes for me, and it’s one of the more unique and original things I’ve read in a while despite it’s basic familiarity of starting out as a conspiracy thriller. It’s an intriguing debut novel, and I’ll be looking for more work from Augustus Rose."}, {"userName": "Mohammed Arabey", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "A ‘Readymade’ Novel..Creative overall.. but with a very ordinary plot..Could’ve used the Conspiracy Theories & Mind-blowing twists here in much better -faster- plot.\nThe Duchamp CodeA young girl became a ‘ready-made’ thief due to her sad, lonely childhood.Mysterious 1920s-style parties for selective teens....some mysteriously disappear after.....or back with ‘lost’ behavior..Then our young protagonist “heroine?!” finds herself amidst all that..all by chance..Discovering that she has been watched by some strange mysterious cult or organisation for a long time.And, also by chance, amidst her tragic, bizarre falling apart life, she steals something that made everything more bizarre..A ‘Readymade’ Art.. by a visionary artist from the early 20th century..Marcel Duchamp.. the inventor of this kind of art..\nThe Readymade Art ;“An ordinary object elevated to the dignity of a work of art by the mere choice of an artist.”\n\nAnd That's exactly what I felt about the plot..The Plot's very ordinary.. kinda slow -too slow for my taste- It lingered too much on the drama in a slow way.. and kept skipping wide-open-doors for a massive creepy and fast action scenes and potential wilder storylines. The drugs.. the parties.. the strange watchers.. the Darknet....even the whole theories on Duchamp’s works that preceded Einstein’s theories on physics.. which introduced brilliantly interesting.... “There’s a contradiction in physics that no one has yet been able to solve. Einstein’s theory of general relativity precisely explains the workings of the large- scale universe— from solar systems to planetary bodies to objects as small as a grain of sand. And quantum theory explains with equal precision the workings of the subatomic universe— photons and neutrons and quarks and all the rest.The problem is that these two theories are incompatible. They can’t be reconciled. What works to explain the macro- universe goes contrary to what works to explain the subatomic universe, and vice versa. Both can’t be correct, and yet somehow both are.”He paused, waiting for her excitement to catch up to his. “For both to be valid, there must be a theory that ties them together. A unified field theory. It’s only hypothetical, but it’s the Holy Grail of physics. There are those who say that solving it would be akin to reading the mind of God.”\nThe whole thing is huge… yet at the same time it ended drastically as if it was just nothing you have anticipated..  I always felt The Da Vinci Code went too far... well here it didn't went anywhere for me..May be it's just how Duchamp's love to do his work...\n“ ‘Le hasard est une pute qui butine de maquereau en maquereau.’ ”\n\n*** The Pros *** \n** The detailed analysis of Duchamp's Art and the theories of his scientific hints were perfect.As well as the parts of the mind and consciousness, the chances... it was so deep.. the dream to change chances...control minds..But where did that lead us?Who knows... may be that's what Duchamp intended from the beginning..\n“It’s French. Translated it means . . . something like ‘Chance is a whore who flits from pimp to pimp.’ ”\nAlso the Darknet use, it came here so well and detailed a bit to serve the story..that was interesting.Also naming each part with an Art by Duchamp was fun specially when adding a scene with the reference to the title.~~~~~~~~~\n*** The Cons *** \nThe Problem with the story is the plot is so slow... kinda not much happening as it could have.It's kinda full of Lee’s (the protagonist) drama... normal tragic separated parents... small stealings to shoplifting to theft to professional thief (That's why I called her a 'Readymade Thief' herself. - not just a thief who stole a 'Readymade'.. brilliant title really.)The sad thing is that it's very detailed drama as well, most of it could have removed of fastening a bit.ALSO the world of the novel building was nothing but dull ordinary 2012 normal world...It's not the bizarre sci-fi or even futuristic or original world setting.-as publishers deceived me as a 'new voice in fiction for fans of Ernest Cline.' Come on.. I didn't see a resampling but in the word 'ready' and 2 pages of her living in van at an old car dumb...And a hint of Orwellian government that never mentioned later but briefly once after the first page...-Her encounter with the creepy parts like the Silo and parties invitations and the weird eyed young girls was drown into the slow pace.Those who has been following her, the strange people ... all that almost came and gone without much explanations or answers.. ir even proper ends..Even the character of her boy-friend-father-of-unborn-child wasn't strong for me... unlike Lee. Then I should be back to the ;\n*** The Pros *** \nAs I said, Yet.. the detailed theories was a good read.. but detailed drama wasn't matching at all..The drama of Lee was too much, so sad.. BUT I won't say that didn't help me feeling more sympathy for her character .. her need of a friend most of the time, her feeling of betrayal...yet she kept caring for her friends and family..And I felt really close to her... felt the anticipations of unlocking the secret why she had been watched all that time... and kinda disappointed after.\n“It was a book about a man who was hired to investigate another man, unaware that the man he was investigating was himself. Only the man being investigated knew that the man doing the investigation was himself.”\n-Somehow I wished for a kind of twist like this description of the novel Lee was reading... By the way, does anyone know if it was a real novel? -And then, although I was totally shocked by the calm ending… I felt satisfied with Lee’s fate and her few reunions by the end.. may be that feeling what made me won't rate it 2 and rate it 3 (it's still 2.5)I felt despite my disappointment that I cared for Lee after all..\n “It means chance is a fickle bitch.”\nMay be it's not how they made publicity for... but still it's a creative idea...just in an ordinary plot...As a Readymade Art....\n\nThe Readymade Novel..Mohammed ArabeyAn ARC from the publisher Penguin.From 2nd July 2017To 8th July 2017"}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "This was a really fun read, fast-paced and not at all what I thought it would be when I started. I don't usually like author comparisons but this felt like a combination of Dan Brown and Cory Doctorow, with teen runaways, a secret society, mysteries in the art of Marchel Duchamp, urban explorers, drug culture, and hackers. As in most Dan Brown books, the culminating events feel a little far-fetched, but I liked the character of Lee and how she couldn't easily figure out who was lying, who was dangerous, and I was on her side from the second her friend sold her out. The publisher provided an eARC of this title through NetGalley in exchange for an honest review."}, {"userName": "Eve Recinella (Between The Bookends)", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/921083-eve-recinella-between-the-bookends", "userReview": "Excellent cover on this book. Great representation of the story. It's very unique and eye-catching and has great composition. OMG, this book was FAN-FUCKING-TASTIC and it's a debut novel to boot! This reads very much like a Dan Brown book for the younger crowd. Secret societies. Symbolism. Abandoned places. Riddles and codes. Murder and mystery. Art. The Darknet. Science. Twists and Turns. Phenomenal writing. Well paced. An intriguing and unique plot. A cast of interesting and well-developed characters. I am blown away that this is the author's first book.Not much more to say really. I LOVED every second of this one. I was sucked in and walked around with my nose glued to my tablet. I am hoping there will be more of this story in a second book. My heart hurts over a certain incident, but I am hoping maybe just maybe not all is as it seems. A girl can dream, right? In any case, this one gets two HUGE thumbs up from yours truly."}, {"userName": "Quirkyreader", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/5355311-quirkyreader", "userReview": "First off, I received this as an ARC from Penguin.Five stars all around for this story. It is an intricate web built upon lies and mistruth. But who is lying and who is telling the truth.For me one of the things I enjoyed most was the use of the artist Marcel Duchamp in the story. I have seen some of his works in person. Also I liked his concept of readymade art. As you can guess Duchamp's form of art has inspired the tittle of this book.Something that might help readers who are a bit confused about the art while reading the story is to look at photos of the works. Because for a time Duchamp flipped the art world on its ear.Try and get a copy of this fascinating \"Art Mystery\" when it comes out."}, {"userName": "Jason Pettus", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "[I usually try to avoid spoilers in my reviews, but in this case I feel like I need to preemptively prove that I actually did finish this novel, and therefore am aware that when the villains put their Duchamp Rube Goldberg machine into motion, it essentially outputs a snotty insult from the famed absurdist artist, and shows that Duchamp created all the Da-Vinci-Code-like smoke and mirrors purely as an elaborate joke for those who take these kinds of subjects too seriously. Fans of the book will claim that my criticism of it is invalid because of the novel ending this way, the reason I feel compelled to mention it in the first place; my response is that this kind of \"ha ha, none of this really counted\" reveal in the last ten pages doesn't make up for 200 previous pages where the ridiculous conspiracy theory is treated at face value as real. Just because Poochie dies on the way back to his home planet doesn't mean the terrible Poochie cartoon that came before it was any good. (hide spoiler)]"}, {"userName": "Imi", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/3126915-imi", "userReview": "[conveniently killed off (hide spoiler)]"}, {"userName": "Dawnie", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/36293066-dawnie", "userReview": "*Thanks to NetGalley, the publishers and the author for providing me with a free e-copy of this book in exchange for a free and honest review. *This book was good.There was nothing really wrong with it...other than that it was NOT what i expected it to be and wanted it to be. And so i was disappointed by it. And not just a little but HUGLY disappointed by it. Let me explain!The title is misleading in my option because while yes the main character is in a way a thief, its not a book ABOUT thieves!And the summary does say it is about a young woman plunging into the world of secret society with a dark agenda but it also says that she is a thief and enjoys being exactly that. And while yes she is a thief and she does steal stuff its not at all about that. Its all about -in my option!- rather stupidly done secret society things that make NO sense!I have nothing against secret societies! If you they done well those books can be fantastic! They can be the perfect mixture of thriller and conspiracy theorists and i enjoy those. BUT this book is sadly just a huge mixture of different things that all don't really work out. It also reminded me a HUGE amount of Dan Browns books -and he does it better. Sorry. All in all this book is okay. But i think it could have been WORLDS better if the author wouldn't have tried to include so much -murder, theft, conspiracy stuff, art history, \"rebirth\", a girl trying to find her place, a romance... it was just TOO much. So sadly this book did not work for me.But i do see why others might enjoy it and might not see the biggest issues i had with the book as something that is such a big deal - so three stars."}, {"userName": "Mar", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/44237394-mar", "userReview": "DNF. Just not my kind of story 😬"}, {"userName": "Manon", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/29825129-manon", "userReview": "I was provided an ARC via NetGalley in exchange for an honest review.Lee steals. It’s her thing. When she gets arrested for something she didn’t do, she is sent to juvenile detention. After escaping, she finds herself in the middle of a secret society. But what is it they want with her? And how important is that object she stole?This book wasn’t bad. It just didn’t grab me. It also wasn’t what I thought it was gonna be. The beginning was painfully slow and I couldn’t figure out where it was going or what the point even was. After a while, I got more into the story but I still couldn’t really focus and I mostly didn’t care.The intrigue was technically interesting but it lost me over and over again. The whole alchemy/Marcel Duchamp thing, I found to be really complicated and I couldn’t focus enough to try to make sense of it. I mostly skimmed those parts and it’s a huge part of the intrigue.I found the main character layered and interesting though and I mostly liked her. I felt her pain too from time to time, when I could find it in me to care.Finally, the chapters were sooooooooooooooo long… I hate long chapters, they make me sleepy as fuck….Basically, I think this book has amazing potential but it wasn’t for me..."}, {"userName": "just.one.more.paige", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/7440151-just-one-more-paige", "userReview": "This review originally appeared on the book review blog: Just One More Pa(i)ge. “What do you do when the one true thing in your life turns out to be a lie?” This quote turns up about a third of the way through the novel and, for me, really represents Lee’s story from start to finish. It is by no means a happy story, but somehow, you still come away from it feeling hopeful for her. Augustus Rose takes Lee, and us readers, on a wild ride in this genre-defying novel. And it’s a ride a recommend you take.The book follows Lee through just over a year in her life. When we meet her, she is a normal-ish 17-year-old high school student, trying to fit in and make friends and stealing/selling drugs to make money for college. But then things take some pretty crazy turns, a betrayal from a “friend” that lands her in juve, abandoned by her family and, eventually, on the run. Homeless and without friends/funds, Lee thinks she finds refuge with a group of others living “underground,” but things are definitely not what they seem. Somehow, Lee gets sucked into the world of a hidden society, founded by a group of fanatical men attempting to decode the secrets of a higher understanding, a mix of science and art and alchemy, left behind by the early 20th century French artist Marcel Duchamp. A society that, for some reason, thinks she holds the key to Duchamp’s secrets and seem willing to do anything (literally anything), or go through anyone, to get their hands on her. And she meets a young artist/computer genius, Tomi, who may or may not be involved with this secret society, that nevertheless manages to insinuate himself deeply into her life (and maybe her heart?).This was an interesting mix of page turner and slow-moving plot development. I am not actually sure how else to describe it. I was literally always on the edge of my seat, because you never knew when the next development, or devolvement, would happen – it was always fast and sudden. But at the same time, I sometimes felt like some of the details (especially regarding the descriptions on the specifics of “creeping” - the practice of exploring abandoned buildings, “thief training” – for last of a better term, and some of the art and philosophy discussions) dragged on a little. I’ve taken a whole day between finishing the book and writing this review to think about how to categorize this story, but, as I mentioned above, it truly is unclassifiable. I actually wrote to myself at the beginning, probably through the first third or so, that I got a creepy 21st century Oliver Twist sort of vibe. Then, things started to turn a little more mystery/thriller, lots of danger and looking over one’s shoulder at all times. As we start to learn more about the S.A., the secret society tracking Lee, things turn super theoretical and philosophical and treasure hunt-y (with a Dan Brown sort of vibe, but grittier, gothic-ier, crepuscular - in general, way cooler than Dan Brown). And throughout it all, there’s a heavy air of classic tragedy, with everything that Lee deals with, feeling left behind, let down, unable to trust anyone, and struggling to get by without a home or way to make money. Honestly, I have no idea how the author got all that into one book in a way that truly does fit together. Plus, the amount of research, on such a huge variety of topics – from juve to alchemy to hacking/the Darknet to Duchamp, just to name a few - is impressive, really.A couple things rubbed me the wrong way while reading – there were some times where a person, or persons, took care of or helped Lee to an extent that seemed unrealistic to me (not because I don’t have faith in people, but just based on the logistics of the situations). I felt like Lee was able to accomplish things that bordered on too fantastic/lucky a few too many times (like her return to the Silo at the very end, and what she finds there). At times, as I mentioned earlier, I got a little lost in the descriptions/explanations and things slowed down more than I wanted them too. And, though it is, in fact, totally realistic/possible, it just made me sad how alone Lee was at times.However, on a larger scale, there were a lot of things I loved about this book. I think Tomi was amazing, as a character in general and also the way his relationship with Lee was written and developed with time (even after things…changed - *no spoilers*). I loved reading (almost) every scene he was in. And though I don’t know anything about it (so this could be a completely false representation of it), the parts related to the Darknet/Subnet, the characters there, and the various roles it played in the story were some of my favorite parts to read. The way that Duchamp and his art, theories, and followers’ devotion were woven through the entire story was done with great skill. The small things, like the way the title fits in, and how each section is named after one of his works, were nice touches. But it’s the overall feel that it most impressive. It’s the way that the book is focused around his art and the theories (whether true or not), spun around them regarding science and alchemy and explanations for the world that connect everything, and was simultaneously written to match. At one point, Duchamp is quoted as saying “…the artist is ‘a mediumistic being who, from the labyrinth beyond time and space, seeks his way out to a clearing.’” And that metaphysical outlook seems exactly the inspiration for the way this story was written. The way the author creates that feel throughout the entirety of this tale was beautiful. In addition, you could really tell how much time and effort went into each of the details in this story. There are no ends left hanging or unexplained side storylines. At all. That alone is evidence of the care the author took. But it’s more than that too: everything is tied up very adroitly. A clean ending to a very messy tale.Truly this story defies labels and classifications. It seemed to morph as I read, representing many different genres, existing in a very philosophical, experimental dimension (very apt, really, considering what it’s about). Get ready for an atmospheric and immersive reading experience.  Thanks to First to Read and Viking Books for providing this ARC in return for an honest review."}, {"userName": "Megalion", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/14853675-megalion", "userReview": "This wasn't a bad book. But I think I was far too distracted by real life and put the kindle down too much.The bulk of the reviews as of today, 6/27/17, indicate a rather deep experience. Reminds me of Neal Stephenson's The Diamond Age \nIn that the first time I read it, I got to the end but wasn't sure what I'd read. My experience was superficial. But this was Neal Stephenson! My bf's favorite author back in 1997. When Amazon was just a brand new way to find and buy books you'd heard of but never was able to find.So I had to read it again. The era is important because the digital age dramatically changed EVERYTHING and increased at a dramatic exponential level every year. At that time, I re-read books all the time because I was loathe to waste money or time trying to find new authors to read.I can't tell you how many times I've re-read the Diamond Age but close to a dozen would be fair guess.These days, is a luxury to deliberately pick up a book to re-read. Especially with arcs one feels obligated to read instead.My point is, I wonder if I'd come to love this like I grew to love Diamond Age with another re-read or two.Thus, I can't say how I feel about the book. It didn't suck. But don't have time or desire right now to re-read first time. Yet. This isn't an actual review but the best I can offer: a feeling that I'll really like it when I do.I read an advanced copy provided free by publisher in exchange for honest review. Can't get more honest than this non review. Heh"}, {"userName": "Leah Rachel", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/2650868-leah-rachel", "userReview": "The Ready-Made Thief is an intellectual thriller that will haunt you in all the right ways. Are you ready to watch a pregnant kleptomaniac teenager kick the asses of a cult? You should be. I enjoyed this book despite starting it at slightly the wrong time—perhaps don’t start a thriller when you’re already struggling to fall asleep. Augustus Rose has woven a wild tale of a cult that wades into brain-changing drugs and prostitution in order to fund their exploration of a deep mystery left to them by artist Marcel Duchamp. Lee is a normal teenager who likes to steal and likes to sell, who raises enough money to send herself to college, but a friend’s betrayal will send her life careening off its path. The baseline of this tale is Lee’s story of reaching, grasping for success, of wanting to go to college and regain normalcy, and the overlay is a cult that for some reason is desperate to have her. The twists never stop coming, and Rose gives Lee a veracity that comes from both her ability to survive anything and her ongoing panic attacks. The characterization is brilliant, tough but complex. Meanwhile, the novel never gives up, despite the grisly and cruel acts of the cult, on the kindness of the human race, demonstrating itself in the people who take Lee under their wings. It’s a fascinating story about so many things, from gaslighting to feeling like you can’t trust a soul in the world, to the staunch determination of a young woman that she will escape, will survive, and will somehow make it through to the end. A really excellent novel, and I’m so glad my friend gave it to me."}, {"userName": "Jessica Howard", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/78086-jessica-howard", "userReview": "Full review coming for Shelf Awareness.I genuinely don't know if I liked this or not?? It was dense and disturbing and fascinating and unputdownable. A mix of art and urban exploration and physics and drugs and secret societies... I'm interviewing this author for Shelf Awareness next week and I am going to have to put a ton of time into thinking up my questions for him!"}, {"userName": "Jamie", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/1993961-jamie", "userReview": "Wow... Okay, first of all? Plot. Plot plot plot plot. I'm not exceedingly used to such a plot-heavy literary novel, and this one blew my brain for a while. But it's the kind of twisty, tricksy plot that blew my mind more for the intelligence and the amount of research (GOOD GOD HOW DID HE DO THE RESEARCH - Duchamp, obviously, but there were so many specifics of so many different niche specialties that I really had to marvel at the Rose's skill) that had to go into it to make all the pieces of the book fall into place believably. At turns suspenseful, delightful, creepy, heartbreaking, paranoid... This is pretty good stuff."}, {"userName": "Jackie Law", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/12763282-jackie-law", "userReview": "The Readymade Thief, by Augustus Rose, is a fast moving thriller involving a teenage protagonist and a shadowy, ruthless organisation. It takes the works of artist Marcel Duchamp and imbues them with meaning. The puzzle to be solved involves artefacts, experimental drugs, and the nefarious profits to be made from hedonism.Lee considers herself to be invisible. Her dad walked out on his wife and daughter when Lee was seven years old and she reacted by starting to shoplift. This activity developes into a lucrative sideline and gains her the attention of Edie, one of the cool kids in her class at high school. Their friendship makes Lee feel that she belongs.The girls dream of college but Lee’s stepfather points out the costs, unaware that Lee could now fund herself. Her ill-gained money comes to light when she is unfairly blamed for drug dealing. With her future in tatters she eventually ends up on the streets where she encounters The Station Master. His operations are a part of something bigger and Lee determines to help those whose well-being he sacrifices, for motives she cannot yet fathom.There is a link with a rave scene that girls like Edie regard as the epitome of cool. As Lee delves deeper she is discomfited to discover that she has been watched for many years. She has something that the organisation wants, and it is more than her latest light fingered acquisition.Contemporary resources are used to good effect with hackers, the dark web and mass surveillance enabling both sides to hide and search. It was refreshing to have a young female lead able to think and act for herself.The taut and slick writing encourages the reader to keep turning the pages but my interest in the plot waned when I began to understand what the organisation was seeking – it has been done so many times before. There were false flags that fell by the wayside, threads left to dangle. I wonder if this is to be the start of a series.Although easy to read I felt dissatisfaction with the tale. It started well, but I struggled to maintain interest in yet another secret society operating from within hidden rooms, beyond the law, for age old ends.My copy of this book was provided gratis by the publisher, William Heinemann."}, {"userName": "Cassie", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/1453376-cassie", "userReview": "4.5 stars.I'm not sure why The Readymade Thief hasn't gotten more attention. This book is so good. Full disclosure, I may be biased, because I'm fascinated by the exploration of abandoned and forgotten places, and a large portion of this novel is set in off-the-grid locations. So this was definitely right up my alley.Lee began stealing at a very young age. After taking the fall for a friend in high school, she's sent to a juvenile detention center, which she escapes from almost by accident. She takes refuge in a home for runaways known as the Crystal Castle, but something sinister lurks beneath the surface. It isn't long before she finds herself on the run, fleeing through forgotten places in Philadelphia while being pursued by members of a secret society who will stop at nothing to claim what they believe belongs to them.This is such a hard book to classify. It's an intellectual thrill ride of a novel with perfect pacing, full of secret societies and unsolvable encryptions and abandoned urban places and art history. It's an enjoyable page-turner, but it's also really smart (admittedly, a lot of the metaphysical discussions went right over my head). But my favorite thing about The Readymade Thief is that its protagonist is brilliantly-wrought; Lee is tougher than she thinks she is, and full of heart. She holds this audacious plot together, and is a heroine I won't soon forget."}, {"userName": "Suzanne (The Bookish Libra)", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/991422-suzanne-the-bookish-libra", "userReview": "I just finished reading The Readymade Thief and have very mixed feelings about it. Some parts were really great -- in many ways it reminded me of The DaVinci Code except with a younger protagonist. The plot was complex with lots of twists and turns and a huge puzzle to solve, and Lee Cuddy was definitely a protagonist that I could sympathize with and root for since she is clearly an underdog for much of the book. Where I struggled was with pacing and the fact that the book seemed to spend way too much time on things that didn't seem all that relevant to the main storyline. The seemingly unnecessary scenes left me bored several times throughout the novel and I nearly gave up on it a couple of times. I am glad I stuck it out though because the second half of the book reads a lot better than the first half and I thought the ending was very satisfying. For me the first half of the book was probably a 2, but then the second half was a solid 4 so I've split the difference and rated it a 3.Thanks to Penguin First to Read, the author, and the publisher for providing me with an advance copy of this book. It in no way impacts my review."}, {"userName": "Donna", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/1119451-donna", "userReview": "Augustus Rose has written a very addictive story. This book has mystery, secret societies and alchemy all rolled into one.Lee Cuddy, a 17 year old runaway, finds herself in the midst of a conspiracy and a secret society. Having spent some time in juvenile detention, she learned to take care of herself and escaped from that awful place and now was out on her own looking for places to stay. She learned from an older man, Mr. Valesquez, how to pick locks and how to figure which houses in town were unoccupied due to families going on vacation and were available for her to stay in until their return. He taught her, also, how to pick out different items in the homes that would be worth stealing and making some money to get her by. She moved around a lot.Lee tries so hard to figure out the many secrets that were out there especially with the artist Duchamp and why so many were interested in his art or whatever. What did she have that so many people wanted her? I would advise everyone to read this book as it is so great.I won this book through the Good Reads giveaway. It was an ARC copy and I am grateful that I was chosen to read it."}, {"userName": "Rachel Pollock", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/5277674-rachel-pollock", "userReview": "I should have adored this book. I did love the first half. I was all set to recommend it to a long list of my friends and I could not stop reading it, read it straight through nonstop for 150-200 pages. Then, it just started to fall apart. The timeline stopped making sense; once you have a character who is pregnant, you can't stretch your plot out as needed to make things happen that you need to happen. Babies come in nine months. Trimesters go by and the body changes. How can you shimmy through an air duct when you're something like 6 months pregnant? So the suspension of disbelief required surrounding Lee's pregnancy and all the other shit she was doing frustrated me. Then there was the issue of it turning into an ekphrastic half-baked dissertation on Duchamp. I mean, I love surrealism and Dada and all that, but I couldn't stay on board for how much protracted description of artworks existed in the last half of the book. I hung on till the end, hoping that something would happen to make it all redeemed, but that never came."}, {"userName": "maria helena", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/8055107-maria-helena", "userReview": "I had a very difficult time connecting with the main character and the writing style didn't quite work for me (how many times do you really need to use em dash on the same page?)"}, {"userName": "Lou", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/3699303-lou", "userReview": "She started thieving small, at a young age, her skill grew and stole to order, she learnt it to a fine art, twisting and turning through spaces. One doorway leads her into an unrelenting road of cat and mouse.  She follows a trail of breadcrumbs that ultimately will lead to deciphering the chaos around.A female Houdini who could stay in the shadows and be invisible but then she finds others that there are others within the  shadows that want something she has. After some rocky roads and crossing paths with the Station Master finds some comfort in Tomi who helps her find her way through dark places creeping but will she find stability and safety from those after her, will she find answers or just another dead end in the maze her life is?You find Lee a likeable main female protagonist, that the author has characterisation done well and there can be an empathy with the reader due to this. Her plight in the authors careful hands weaved in a clever plot.This is a cerebral mystery with uncomplicated writing in the vein of a kind of writer who could have easily been one that went to MIT (Massachusetts Institute of Technology) had enough reading Dan Brown, studying Leonardo Da Vinci, Duchamp and watching Thomas Crown Affair and decided to write something that could combine all these worlds.Augustus Rose does well in having a tapestry of the tale, the puzzle finished in the readers mind ruminating for a while.http://more2read.com/review/readymade-thief-augustus-rose/"}, {"userName": "Jessica", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/3019127-jessica", "userReview": "I loved this. It's part mystery, part thriller, part art history nerdfest, and part damn good storytelling. It reminded me in many ways of The Ghost Network, another book I loved, but I think The Readymade Thief was more solid and was more of what I wished The Ghost Network had ultimately been. It kept me turning pages, not wanting to put it down until the mystery was unraveled and understood."}, {"userName": "Charles Dee Mitchell", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/2272557-charles-dee-mitchell", "userReview": "Since so much of this overstuffed and overlong first novel depends upon knowing the biography and work of Marcel Duchamp, it seems destined to estrange the larger audience its characters, setting, and mystery elements might attract. A lot of explaining goes on here, the sort of info-dumping that grinds the action to a halt with material that may remain esoteric to many readers and tiresome to those more familiar with the artist."}, {"userName": "Jena", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/4735069-jena", "userReview": "\"What do you do when the one true thing in your life turns out to be a lie?\"Lee Cuddy is used to being invisible. She isn't seen by her father, who leaves without a goodbye or even a forwarding address. She isn't seen by her mother, who quickly succumbs to her new boyfriends whims and wishes. She isn't even really seen by her peers, until she becomes useful to them.\"It wasn't that they teased her or ostracized her or thought her weird, but none of them seemed to see her, either.\"All of this invisibility makes stealing easy and she quickly graduates to shoplifting. This readymade ability quickly gives her a reputation and she finds a place in popularity as Edie takes her under her wing.But, easy come, easy go, and betrayal follows when Edie finds her the easiest way out of her own troubles.Lee quickly sees that it isn't just Edie that is quick to dispose of her. Her own mother, guided by Steve, allows her to take the fall, refusing to even give her the money she stashed for her defense. Life in the Juvenile Detention Center is worse than anything thrown at her so far, and a nervous breakdown lands her in the psych ward. But lower security also provides the opportunity for a quiet and invisible girl to find a way out.The Readymade Thief is a novel that is both fast paced and maddeningly slow. This combination doesn't seem possible, and yet it is. Every page is written so that you know something is happening, but you aren't quite sure what. The result is you feel as on edge and unsure as Lee.Once Lee escapes from JDC we are introduced to even more subterfuge and intrigue. We are thrown into the world of secret societies and underground movements. The S.A. parties continue to pop up, inviting her to join their world, except her gut instinct screams to stay away. Fear for her friend Edie, even after her betrayal, compels her to go searching and almost leads to disaster.Tomi, a mysterious young man, saves her and takes her in. He introduces her to life underground, the world of abandoned building hunts and secrets of the Subnet. She wants to trust him but every turn in her life has led to betrayal and lies. Still, it's easy to fall into his earnestness, especially given her connection to him.Lee discovers that S.A., a secret society devoted to uncovering the hidden puzzles and meanings behind the artwork of Marcel Duchamp. She unwillingly and unknowingly finds herself at the heart of their obsession. Somehow they think she is a key to their mystery, even though she has no idea how. No matter where she turns, or what she does, she finds herself a pawn in their games, time and time again. They are always one step ahead, always surrounding her, always controlling the circumstances of her life.This secret society is obsessed with more than just art. They are also responsible for a chilling new drug that leaves its users docile and empty. Creatures willing to do anything suggested with little or no reaction. Unable to take care of themselves, many of them end up in JDC or worse; the Crystal Castle.This book has a lot of layers going on in it. It is easy to get overwhelmed, or lost in the information. You want to keep pushing ahead to find out what is happening, but I found myself going back to reread portions at a slower pace to really understand what was being said. This is a book that needs more than one read through to really appreciate all the detail and nuance written into the plot.One of the examples of the level of detail and intricacy is the title. Duchamp created artworks that he called 'readymades'. Essentially, he viewed art of the time as 'retinal art'. Easy to look at and pleasing to the eye, but there wasn't anything more in depth than that. His response was to take everyday items and make minor changes to them, thus instantly turning them into art. Readymade art. The title, Readymade Thief, refers to Lee, already a shoplifter and petty thief, who has been repurposed for the societies use.Usually, reading the line of phrase that uses the title of a book is a quick AHA moment. One that makes sense in terms of a character or event. In this case, the moment isn't written out or explained by the author so much as hinted at. You are led to it, able to uncover it's meaning as you read. I think it's very clever.There is a lot of art history, specifically to the work of Duchamp. I have no idea how much is based in truth and how much created for fiction. Some parts of this history lesson got very confusing for me. It was a lot of information given. Again, I think this is an example of why the book needs more than one reading. There is just so much to dissect at once.Rose manages to pull off quite an elaborate story. There are clues placed at the very beginning that aren't noticed until they are pointed out later. Things suddenly make sense, and the level of betrayal in Lee's life is astounding. Everything in this novel is connected somehow, even if you can't see how or why, you will in the end. The pure genius is that the end answers questions you didn't even know you had.This book will be enjoyable for anyone who loves mysteries and suspense novels. The art history is impressive and I can't imagine the amount of research that went into composing this plot. It's astounding! Weaving the art into a secret society will delight any conspiracy theory lover.Thank you First to Read, Penguin Random House and Viking books for giving me an early copy in exchange for an honest and unbiased review."}, {"userName": "Matthew", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/20910065-matthew", "userReview": "It's been documented that famed painter/sculptor/writer/visionary Marcel Duchamp \"wanted to use art to serve the mind\". One can only assume he'd be as satisfied -and perhaps as blown away - as I was with Augustus Rose's thrilling debut The Readymade Thief. And not just because he played a central figure within its twisty, exhilarating storyline. If anything, he'd champion Rose's ability to manipulate a reader's thought process, to test one's beliefs and senses.While I'd hate to pigeonhole a singularly original novel with comparisons to others, it bears mentioning a few The Readymade Thief brought to mind: The Goldfinch, Station Eleven, and Dark Matter, specifically. Elements of this trio are summoned throughout Rose's work, though it never feels like a retread or even an homage. The Readymade Thief stands alongside these aforementioned greats; like them it'll be a novel I'm sure I'll revisit, if not think about for some time.The tale begins in a future state with our heroine, Lee, a pregnant teenager on the lam. It's unclear who she's running from or whom the father of her child may be. What is clear, however, is that she's been through a tumultuous sequence of events. We soon learn of these events, starting with Lee's troubled home life and subsequent rebellion. Along with her innate ability to steal, she and her closest friend Edie procure items for their fellow schoolmates in exchange for cash; the items are at first harmless, but soon requests become less so. Lee & Edie are suddenly the source of all drug trafficking in their high school. This plot line - coupled with Edie's betrayal of her friend and Lee's incarceration because of it - would make for an interesting story, yet it's only scratching the surface. In prison Lee is even more an outsider than she was when free; she has few allies. She manages to escape but has nowhere to go. And this is the point in which The Readymade Thief begins to pick up steam. It's a locomotive until the very end. On the run from the law and her past, with seemingly no hope or future, Lee finds herself caught up within the underbelly of Philadelphia, struggling to survive. She learns of and begins squatting in an abandoned building called the Crystal Castle, overseen by a mysterious figure known only as the Station Master. Her stay starts innocently enough but quickly turns for the worse; through an invitation to a secretly thrown and bizarrely elaborate party, Lee discovers the Castle for what it truly is: an extension of a secret society obsessed with decoding the puzzles that make up the work of - yep, you guessed it - Marcel Duchamp. Fleeing the Castle, fearing for her life, and followed by members of the society who seek her for unknown reasons, Lee finds solace in a hacker named Tomi. Together they set part on a wild adventure to determine the purpose of the society and why Lee is wanted by them. What follows is nothing short of a whirlwind, a confluence of events that left me dizzied in the best possible way.For a story so complex and densely layered, I'm certain I've missed some of the pertinent details. But that's why The Readymade Thief is so special; there's so much within the details it's damn near impossible to grasp during the first read. At time I felt as though I were along for the ride, an invisible cohort to Lee and Tomi's antics, the only difference being our fears - they wanted to find a conclusion to their story, whereas I never wanted it to end. Bravo."}, {"userName": "Kate", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/195737-kate", "userReview": "*I won this as a digital ARC through Penguin Books' First To Read program.You'll find little emotional content in The Readymade Thief, and while that's usually a turnoff for me, it works well in this plot-driven conspiracy story. Comparisons to The Da Vinci Code are unavoidable, but the delinquent youth protagonist and the mystery being science- and alchemy-based rather than about Jesus made it more interesting to me. Rose puts his homeless, pregnant teenage protagonist, Lee, through a LOT - much more than we could expect to believe in the timeframe - and the narrative could have been culled into something much tighter with a better emotional punch. Still, it drew me in more than the first chapter suggested, and I stayed up too late two nights in a row to finish it before my digital ARC expired. I appreciated what must have been years of research into abandoned buildings, the deep web, and the art and conceptual theories of Marcel Duchamp. I learned a lot, and it was an inspired concept for a puzzle mystery. The imagery was fantastic throughout. I can see this hitting the big screen."}, {"userName": "Debbie", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/12691311-debbie", "userReview": "Wow!! I stayed up way into the early morning reading this book. I could not help it, I could not put it down. Well, until, unfortunately, close to the ending. I was simply too tired from lack of sleep to get into all the technical aspects that are presented. It was tedious and very, very descriptive. However, let me say this the descriptions were an amazing part of this book. I really felt myself \"creeping\" with Lee and Tomi inside those abandoned buildings. When reading the blurb about the book, I thought it was a post apocalyptic world. I was surprise to find that it was pretty much modern day. So many abandoned buildings! I loved the characters of Lee and Tomi. The author did a great job with their character development. He also did a great job with Steve and Lee's mother which led me to a \"I want to slap the crap out of both those\" feeling that lasted throughout the book.A thoroughly entertaining, unputdownable and amazing read.Thanks to Penguin Group/Viking and Net Galley for providing me with a free e-galley in exchange for an honest, unbiased review."}, {"userName": "Kate", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/9126167-kate", "userReview": "3.5 and I rounded up. This book is billed as a great puzzle, mystery within a mystery,etc,etc. More like Dan Brown and as some have said The DuChamp code. Some of his art is called \"readymades\" and our main character Lee is a thief, so there you have the clever title of the book. Some of the book is clever and you will definitely learn a lot about Marcel DuChamp's artwork as well as scientific theory. Urbexing is also featured, the Subnet (the author's creation), a secret society and on and on. It's a lot, too much I think. You feel sorry for Lee, but I never really connected to her. I never felt in on the action. I started to when she felt like she was being watched and she didn't know who to trust, but then it turns again to all this string of short term variety of drama and the original terror was lost. So while I liked the concept, I think it got bogged down by trying to do too much. I want to feel like I am there with the characters, feeling what they are feeling, not just reading about it and I didn't."}], "description": "Lee Cuddy is seventeen years old and on the run. Betrayed by her family after taking the fall for a friend, she finds refuge in a cooperative of runaways holed up in an abandoned building they call the Crystal Castle, but the façade of the Castle conceals a far more sinister agenda, one hatched by a society of fanatical men set on decoding a series of powerful secrets hidden in plain sight. They believe Lee holds the key to it all.Aided by Tomi, a young hacker and artist with whom she has struck a wary alliance, Lee escapes into the unmapped corners of the city—empty aquariums, deserted motels, patrolled museums, and even the homes of vacationing families, but the deeper she goes underground, the more tightly she finds herself bound in the strange web she’s trying to elude. Desperate and out of options, Lee steps from the shadows to face who is after her—and why.", "title": "The Readymade Thief", "url": "http://www.goodreads.com/book/show/33358209-the-readymade-thief", "average": 3.39, "cover": "https://images.gr-assets.com/books/1484156655l/33358209.jpg", "reviews": 260, "authors": [{"url": "https://www.goodreads.com/author/show/6059613.Augustus_Rose", "name": "Augustus Rose"}], "type": ["Fiction", "Mystery", "Thriller", "Young Adult", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/33358209-the-readymade-thief", "http://www.goodreads.com/book/show/33838515-the-readymade-thief", "http://www.goodreads.com/book/show/32938190-the-readymade-thief", "http://www.goodreads.com/book/show/34643333-the-readymade-thief", "http://www.goodreads.com/book/show/35996621-the-ready-made-thief", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}