{"ratings": 543731, "userreviews": [{"userName": "mark monday", "userReviewDate": "Apr 05, 2011", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "♥ ♥ ♥ ♥ ♥a rousing climax to the most ravishing love story of the modern age. tempestuous, tormented Frodo at long last learns to accept the love of his lifemate - the loyal and submissive Samwise Gamgee, bottom-extraordinaire. this is truly a tale of love's labour hard-won, and at such a cost! but love conquers all in the end, and even bitter, militantly hetero villain Sauron cannot stand in the heart's path for too long. in this third book of the torrid trilogy, Frodo's love-hate relationship with the concept of commitment - deftly symbolized by a gorgeous, one-of-a-kind, designer ring - reaches a dramatic fever pitch, as he wrestles with his awkward feelings about monogamy & gay marriage in the boiling, repressive deserts of \"Mordor\" (clearly a stand-in for maverick Texazona). fortunately, the maternal Sam is constantly by his side to offer succor - forever the wind beneath Frodo's wings.♥ ♥ ♥ ♥ ♥the incredibly racy & erotic atmosphere is filled with a circuit party's worth of soldier types, as well as many classic queer icons: butch trade turned romantic male-model Aragorn; saucy friends-with-benefits Merry & Pippin; the tough & dour yet loveable uber-dyke Arwen; little bear-daddy Gimli; cringing closet-case Oh My Precious; fey pretty-boy Legolas; the exquisite drag queen enchantress Galadriel; and of course, presiding over them all, flouncing from scene to scene, battling his nasty sourpuss of an ex-boyfriend Saruman, and just chewing up the scenery like no one else...the fabulous and effervescent Gandalf the Gay. you go, girlfriend! ♥ ♥ ♥ ♥ ♥despite the couple dozen unnecessary scenes of Sam staring dreamily into Frodo's sad sad eyes, this is truly a flawless and timeless gay classic, one that boldly states Love Is a Glorious Burden That We Must Ever Shoulder. love knows no boundaries. and even the smallest of men can have the biggest....\"heart\", i suppose. queer fave Enya even contributes to the soundtrack. Return of the King is a luscious, deliriously homoerotic fantasia.♥ ♥ ♥ ♥ ♥oops, forgot i wasn't reviewing the thrillingly fagtastic film version. well, as far as the novel goes, it is perfect. i wouldn't change a word. even the poetry is awesome."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Jan 17, 2014", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "Tolkien is the master of world building. With his writing comes generations of detailed history and lore. Middle Earth did not simply spring up overnight. Instead it is firmly established with the most thorough groundwork that is simply unmatched. And here his epic trilogy comes to an end. I’ve read it many times over the years, and reviewing it is no easy task. So, like my reviews of the first two books, I’ve picked out ten things I really love about the book. Spoilers ahead. 1.The blade that was broken has been remade.\"From the ashes a fire shall be woken, A light from the shadows shall spring; Renewed shall be blade that was broken, The crownless again shall be king.\"Aragorn never really felt kingly until he was given the sword of Elendil. His commanding presence became more than just a presence when he wielded the sword. We all knew it was coming, but it was great to see it happen nonetheless. 2.The last of the stewards With the return of the kings also ushers in the end of the stewards. For all Boromir’s weakness, and his father’s madness, Faramir maintained his honour. Had he taken the ring for himself, the realms of men would have fallen. He played a pivotal role in the action, and his actions demonstrated that men are not as weak as the elves thought. His fate and future titles show such a thing. 3.Théoden’s Sacrifice There are many heroes within this trilogy, many men who give up their lives to vanquish evil. In spite of Gondor ignoring his calls for aid, in spite of Gondor watching Saruman ravish the lands of Rohan, Théoden still rides to her aid when his own lands are safe. He honours his pledge even when the one made to him was broken. Acting on the advice of Gandalf, he squashes his own hurt pride and rides for war because he understands what is at stake if he does not. Théoden was a true king and one the bravest men of this story. He knew what he rode to, but he went anyway. “Arise, arise, Riders of Théoden!Fell deeds awake, fire and slaughter!spear shall be shaken, shield be splintered,a sword-day, a red day, ere the sun rises!Ride now, ride now! Ride to Gondor!”4.Girl Power!“What do you fear, lady?\" [Aragorn] asked.\"A cage,\" [Éowyn] said. \"To stay behind bars, until use and old age accept them, and all chance of doing great deeds is gone beyond recall or desire.”There have not been many moments for women to show their strength in this story. Arwen’s moment in the films was non-existent in the book. Frodo was saved on the river by an Elf-lord called Glorfindel. So when Eowen battled the Witch King, it is the first major moment Tolkien gave to a female hero. In a vastly male dominated genre, it was great to read this scene. If I have one criticism of Tolkien, it’s that we didn’t see more of such things. 5.Golem’s internal warGolem almost comes back into the light. He tries so very hard to conquer the ring, though ultimately it defeats him and he succumbs to its power. Had Frodo never been forced to betray Golem to Faramir in The Two Towers I do think he would have stayed loyal. Perhaps he would have survived the events of this book. What do you think? Could he ever have been on the ships bound to the grey havens after all had done? 6.The Siege of Minas Tirith This is probably one of the most exciting action sequences I’ve read in fiction. Sauron’s hoard is unleashed in all its brutal fury, and the realms of men quake in its wake. Their defences are weak; their courage faltering, but they do have one weapon to stem the tide: the white rider. Terry Brooks loved it so much he copied the entire thing, or thereabouts, in The Sword of Shannara.7.The Mouth of Sauron \"Is there any in this rout with authority to treat with me? Or indeed with wit to understand me?\"A massively unrepresented character on the screen and one who spent much of the third age waring the dwarves in the north and the elves of Mirkwood, The Mouth of Sauron is the vessel of Sauron’s voice. Second only to the Nazgul in the command structure, The Mouth of Sauron is sent in to negotiate, threaten and persuade when more tact is required. Nazgul are clearly incapable of such a task, so it falls to him. I’d love to know more about this character, and his deeds, but his end at the Black Gate in the movie is most fitting. We can only presume that he also died there in the book, though there is no mention of his demise….8.Hobbit loyalty Frodo: Frodo wouldn't have got far without Sam. Sam: Now Mr. Frodo, you shouldn't make fun; I was being serious. Frodo: So was I.Sam saves Frodo so many times in this series. Whilst Frodo has the burden of the ring, Sam has the burden of Frodo. Without him Frodo would be dead, most likely murdered by Golem in his sleep or, if he made it that far alive, eaten by Shelob. 9.The Hobbit warIn the films Saruman dies at Isengard. In the book he is imprisoned by Treebeard only to later convince him to let him escape. He and Wormtongue, in a senseless act of aggression, conquer the Shire. Such a situation allows for the Hobbits to show that they no longer need wizards or Kings to deal with their problems. They arrive back, rally their people, and crush the evil that has infected their home. Saruman, who only has the power of his voice at this point, dies in the action. All though this dragged the book out a bit, it was entirely necessary to show the growth of the characters after the story had ended. 10.The Grey HavensIt also explains Frodo’s decision to leave the Shire, something the movies fluffed up. The Shire is never the same, and any attempt to rebuild it will never make it feel like home for Frodo. He has gone through too much to go back to his old life. So he needs a new one, one where he can heal and attempt to put his past behind him. The beautiful lands to the west await him. I love this final image: \n“But I have been too deeply hurt, Sam. I tried to save the Shire, and it has been saved, but not for me. It must often be so, Sam, when things are in danger: some one has to give them up, lose them, so that others may keep them.”"}, {"userName": "Ana ", "userReviewDate": "Oct 22, 2012", "userURL": "http://www.goodreads.com/user/show/13346584-ana", "userReview": "“I am glad you are here with me. Here at the end of all things.”  \nI've just finished a re-read of the trilogy. There is only one lord of classic literature and his name is Tolkien. Sixty years later Tolkien's epic tale of men, hobbits, elves, dwarves, trolls and goblins is still relevant. In my opinion this was the best book of the trilogy. The Return of the King gave me ALL THE FEELS like nothing else, I got pretty choked up at the last chapter. The Return of the King contains a ton of appendices, and the readers can find out the conclusion for each of the Fellowship members. 'The Tale of Aragorn and Arwen' is one of the most beautiful things ever written (I really wish it hadn't been left out of the main story). People have asked me who my favorite character was, and it's impossible to answer. Aragorn, Faramir, Frodo, Arwen, Sam, Legolas, Gandalf, Gimli, Boromir, Merry, Pippin, Galadriel, Éowyn, Éomer, Glorfindel, Haldir... I love them all. I leave you with this wonderful art. Kudos to whoever made this."}, {"userName": "Alejandro", "userReviewDate": "Jul 31, 2014", "userURL": "http://www.goodreads.com/user/show/665584-alejandro", "userReview": "The last stand for the control of Middle-Earth!\n\nI WENT TO MIDDLE-EARTH AND ALL I GOT WAS THIS CRUMMY RING\nThat’s the message in a t-shirt that I got in a tourism travel (and I still have it!). I thought that it was appropiate to begin my review about the third part and final of Lord of the Rings.All that fuzz about a ring that can turn you invisible? You may think, but that was the least of its properties. Its major use was being able to control of the rest of ring-bearers with it, and if you think about that many of the most powerful beings in the Middle-Earth possessed a ring, well, it seems logical why all that fuzz. Moreover, a factor that not usually is pondered is that The One Ring also helps to extend the lifetime of a being to an absurd expanse, and since Sauron is just a “shadow” of his past self, it’s evident why he needed The One Ring so bad.I commented in my review of the first part, The Fellowship of the Ring, about my theory of the plans of The One Ring. Not Sauron’s. Not Saruman’s. But the One Ring. It was obsessed about the Hobbits, since they were the last bastion of pure goodness in the whole Middle-Earth. Without making any spoilers, I am kinda sad that while it wasn’t due actions of The One Ring, bute vil powers damaged that idyllic of a more simple life. Also, I think that the whole thing was unnecessary to the main story and even over-extending the tale kinda ruining the “final” climax of the war.Back, in The Hobbit, Bilbo’s first act having The One Ring was……piety.A small noble deed that would define the fate of the whole Middle-Earth.That makes you think about it. Each action has a consequence. Maybe you won’t be able to realize the consequence, but it’s clear that you have to think about your actions, since you never know that something that you may consider irrelevant, even correct, it may lead to consequences with epic importance.\nÉOWYN & GALADRIEL, MIDDLE-EARTH GIRL POWER\nAgain, I won’t spoil anything, I only can say that one of my favorite female characters in the saga is Éowyn, along with Galadriel. Their paths are separate, they are different kind of female characters, but definitely, they proved their own importance and vital roles in this story plenty of male characters.Galadriel’s role was centered mainly in the first part (but you'll find her here again), The Fellowship of the Ring, and you can’t doubt that she, along with Elrond (one of my favorite male characters), both are of the most powerful beings in the Middle-Earth, where their existence over there, defined the beginning and the end of the Third Age. Éowyn was introduced on the second part, The Two Towers, but it’s on the third and final part, The Return of the King, where she plays her vital role in an age where men were the ones usually in the battlefields.It’s clear that a predilect theme of J.R.R. Tolkien was to show that while wars are things to avoid if possible, if the war is inescapable, it’s short-sighted and close-minded not considering the worth and courage of the “unlikely” beings (Hobbits, women) and including them into the ranks of the defending army. Since many times the tall and strong men don’t think that people of small height or from the “weaker sex”, can be valuable during a war. But you can testify that in “The War of the Ring”, four Hobbits and a woman, changed the course of it, during epic moments of impossible odds.\nLEGACY OF THE LORD OF THE RINGS\nThe saga ends here, Return of the King, at least the main story, because certainly you can find a LOT more of tales in the other books by Tolkien set in the Middle-Earth.And it’s indisputable the legacy caused by this story.Since ALL the following novels and book series in the genre of epic fantasy are inspired and/or influenced due the publication of Lord of the Rings, but its impact isn’t limited to this literary genre, since if you know what to look or watching carefully you’ll find plots, elements, concepts, etc… of this story in other novels of different genres, in films, in TV, etc…Once you woud be aware of this story, you keep noticing here and there, the influence and impact of it. Not matter if you like Lord of the Rings or not, you have to thank anyway, since the imagination and creativity in the minds of artists in the whole world, in all kind of art fields, were never the same after the publication of this work. They got better.Thank you, Tolkien."}, {"userName": "Alex Farrand", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/37663070-alex-farrand", "userReview": "[ I almost cried when I thought Merry and Pippin had died. I gasped when Frodo claimed the ring for his own. I remember him having his finger bitten off, but could not, for the love of me, remember how the ring was on his finger. It really came as a shocker! Then their was the romance between Faramir and Éowyn. How I swoon between the two while they spoke to each other in the garden of Gondor. I felt the compassion, the love that grew between them and it was barely ten pages long. It was so short, but I felt everything that I would have felt as if I read Pride and Prejudice. I nearly cried at the end for the three Hobbits when the ring bearers left the world. I felt like I stood on that dock watching my dearest friends leave the world.  (hide spoiler)]"}, {"userName": "Red Panda", "userReviewDate": "Jul 15, 2015", "userURL": "http://www.goodreads.com/user/show/44824883-red-panda", "userReview": "Well, I've come to the end of the road once more... This was my tenth reading of Tolkien's saga of Middle Earth (the first time I visited was in 1986) and it's pointless trying to write a balanced review of my favourite books. Suffice it to say that these books are a part of me; written into my DNA, if you like, and I love them dearly.I'll be back in a year or two, Bagginses, to do it all over again...Buddy read with Sunshine Seaspray.-------------------------------------------------And I did come back! As I will again and again and again... You'll have to excuse me now, as I'm definitely not crying... You see, I'm wounded... and it will never really heal...(2nd June 2017)"}, {"userName": "Stephen", "userReviewDate": "Jun 05, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "***NEW LAWSUIT UPDATE BELOW (6-30-11)...Lone reviewer continues fight with corporate ASSCLOWNS powers in epic 1st Amendment battle royale.***4.0 stars. FULL REVIEW (hopefully) to follow after resolution of the lawsuit* filed against this reviewer in the District Court of Narnia by, among others: 20th Century Fucks Fox, Lucasfilms, the Tolkien Estate and Robert Van Winkle (aka Vanilla AsshatIce) in order to prevent the release of an allegedly offensive but in reality just knee-slappingly funny PARODY review depicting Darth Vader, Gandalf the White, The MOUTH of Sauron and several inebriated Ewoks hopped up on \"Shire Ale\" and \"Longbottom Leaf\" all playing a naked, sexually explicit game of \"ring toss\" using oversized versions of the One Ring; all while singing a re-mix club version of Ice, Ice Baby. I hope to have this matter resolved shortly or at least by the time I come up with something to actually say about the book. ***PREVIOUS UPDATE***Discovery is proceeding in the case and this reviewer has requested travel records and receipts from counsel for Darth Vader and several of the Ewoks (now sober) relating to an \"incident\" that hopefully will not \"stay in Vegas\" for long. The incident, now being discussed all in chat rooms across the Internet, concerns the Sith Lord's behavior at a recent bachelor party for one of the Imperial staff and may assist in demonstrating that the parody review was not as damaging to Lord Vader's reputation as the complaint alleges. I will keep you posted.....***LATEST UPDATE***The prosecution was dealt a serious blow today when, during cross-examination,  Grima Wormtongue admitted under oath that Ice, Ice Baby did indeed \"suck bad enough to pull a softball through a garden hose,\" seriously undermining the case for damages brought by Robert Van Winkle (aka Vanilla Ice). Following today's proceedings, Mr. Van Winkle responded by saying, \"Yo, Yo...wetting himself and then walking away looking confused.\" More on this as it develops....*\nDISCLAIMER\n: The lawsuit referenced above is itself a parody. \nThe full review is actually pending...possible in the future unlikely because the reviewer himself is inebriated on ale and some kind of pipe-weed and thus can not prepare a proper review at this time."}, {"userName": "James", "userReviewDate": "Jan 07, 2012", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Book Review\n\n4 of 5 stars to The Return of the King, the third book in the \"Lord of the Rings\" trilogy, written in 1955, by J.R.R. Tolkien. After reading the first two books in this series, how can you not finish it with this one? I knocked them back between 9th and 10th grades, loving every minute of the imagination and struggle between good and evil. When I got this this final one, I already knew I'd be sad to say goodbye to all the characters I'd fallen hardcore for over the 1500 pages between the volumes. But when the movies came out, I had a chance to re-live the intensity of this drama... as taking on such large books with everything else I had on my reading plate, did not make sense. Watching them in film form tho lived up to many expectations. Of course, I loved the books more, but I still enjoyed the films and will watch them if I am skimming the channels and find one in play.The flaws in each of the characters, as well as their journey, are immense but real. When you find out some of the changes in this book (no spoilers!) and people you thought were long-forgotten, it is brilliant. And seeing the evil forces fight the good forces... it's just a version of the reality we face every day. All over a ring that provides power. But power is at the center of it all. And it's one of the few books where I found myself happy with the ending.I could talk about these forever, but I won't bore you. I am not a big fan of fantasy, and have only read a handful of books and authors in this genre. These are a favorite across all genres for me, and it's because of the creativity in Tolkien's mind that I consider reading more in this genre. Before Harry Potter, we had a family of hobbits... who stole our hearts and taught us many lessons. Ones I still think of today whenever I need to weight the options before me. Please give them a chance! But start with #1.... you have to read them in order!\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by."}, {"userName": "Jason Koivu", "userReviewDate": "Nov 22, 2008", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "Ah, The Return of the King. The end of a sweeping epic, one which held me firmly in its grasp as a child and still holds a place in my heart as an adult.Everything is in motion and actually coming to an end almost from the first page of this last book in the trilogy. Frodo is ever so close to completing his quest. Aragon, Gandalf and the others are nearly at the end of their rope. Indeed, the end is nigh! But this is not a quick finish. Tolkien dragged things out. There is a mini-battle after the great war has concluded. Many a loose end is tied up. The tearful goodbyes are interminable. I certainly didn't want it to end. I would've been happy if this series had continued on indefinitely. When I first read this as a young teen, I was a very slow reader. It took me nearly two years to finish and by then I was fully attached to these characters. That attachment began when I was about five years old, when I saw the Rankin Bass animated version of this book on TV. I cried like a baby when Frodo and Sam were trying to escape what appeared to be their inevitable death. I held on to that memory and supplemented it over the years with the other animated versions of Tolkien's Middle Earth series. So, by the time I got around to reading The Lord of the Rings, I was as good as a card-carrying member of the fan club. Certainly this series isn't for everyone. I've heard many complain about it for various reasons: too many characters, an impenetrable backstory, etc. The recurring complaint that the books are too dense was something Tolkien was apparently aware of, because he included a very helpful appendix section at the back of Return... which answers some questions the reader may have as well as filling in more of the background details if you're confused or just interested in learning more."}, {"userName": "J.G. Keely", "userReviewDate": "May 28, 2009", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "Writers who inspire a genre are usually misunderstood. Tolkien's reasons for writing were completely unlike those of the authors he inspired. He didn't have an audience, a genre, and scores of contemporaries. There was a tradition of high adventure fairy tales, as represented by Eddison, Dunsany, Morris, MacDonald, Haggard, and Kipling, but this was only part of what inspired Tolkien.His writing was chiefly influenced by his familiarity with the mythological traditions of the Norse and Welsh cultures. While he began by writing a fairy story with The Hobbit and other early drafts, his later work became a magical epic along the lines of the Eddas. As a translator, Tolkien was intimately knowledgeable with these stories, the myths behind them, and the languages that underpinned them, and endeavored to recreate their form.Contrarily, those who have followed in his footsteps since have tended to be inspired by a desire to imitate him. Yet they failed to do what Tolkien did because they did not have a whole world of mythic tradition, culture, and language to draw on. They mimicked his style, but did not understand his purpose, and hence produced merely empty facsimiles.If they had copied merely the sense of wonder or magnificence, then they might have created perfectly serviceable stories of adventure, but they also copied those parts of Tolkien which do not fit a well-built, exciting story--like his work's sheer length. Tolkien made it 'okay' for writers of fantasy to produce books a thousand pages long, and to write many of them in succession. Yet Tolkien's length had a purpose, it was not merely an affectation.Tolkien needed this length in order to reproduce myth. The Eddas were long and convoluted because they drew from many different stories and accounts, combined over time by numerous story-tellers and eventually compiled by scribes. The many digressions, conflicts, repetitions, asides, fables, songs, and minutiae of these stories came together organically. Each had a purpose, even if they didn't serve the story, they were part of a grand and strange world. Epics often served as encyclopedias for their age, teaching history, morals, laws, myth, and geography--as may be seen in Homer or The Bible.This was the purpose of all of Tolkien's long, dull songs, the litany of troop movements, the lines of lineage, the snippets of didactic myths, and side-adventures. To create a realistically deep and complicated world, he felt he needed to include as many diverging views as the original myths had. He was being true to a literary convention--though not a modern one, and not one we would call a 'genre'.He gave characters similar names to represent other historical traditions: that of common prefixes or suffixes, of a house line adopting similar names for fathers, sons, and brothers. An author who copies this style without that linguistic and cultural meaning just makes for a confusing story, breaking the sensible rule that main characters should not have similar names.Likewise, in a well-written story, side-characters should be kept to the minimum needed to move the plot and entertain the reader with a variety of personalities. It is another rule Tolkien breaks, because he is not interested in an exciting, driving pace. He wants the wealth of characters to match the number of unimportant side characters one would expect from a historical text.The only reason he sometimes gets away with breaking such sensible rules of storytelling is that he often has a purpose for breaking them, and is capable of drawing on his wealth of knowledge to instill further depth and richness in his world. Sometimes, when he slowed his story down with such asides, they did not have enough purpose to merit inclusion, a flaw in pacing which has only increased with modern authors.But underneath all of that, Tolkien does have an appealing and exciting story to tell, of war and succession and moral struggles--the same sort of story that has been found in our myths since the very earliest writings of man. He does not create a straight monomyth, because, like Milton, he presents a hero divided. Frodo takes after the Adam, placing strength in humility and piety, not martial might or wit. Aragorn is an attempt to save the warlike, aristocratic hero whom Milton criticized in his portrayal of Satan.Yet unlike Satan, we do not get an explanation of what makes Strider superior, worthy, or--more importantly--righteous. And in this, Tolkien's attempt to recreate the form of the Eddas is completely at odds with the Christian, romantic moral content with which he fills the story. This central schism makes his work much less true to the tradition than Anderson's \nThe Broken Sword\n, which was published the same year.Not only does Tolkien put forth a vision of chaste, humble, 'everyman' heroes who persevere against temptation through piety, he also presents a world of dualistic good and evil, of eternal, personal morality, prototypical of the Christian worldview, particularly the post-Miltonic view. His characters are bloodless, chaste, and noble--and if that nobility is sometimes that of simple, hard-working folk, all the better for his Merrie England analogue.More interesting than these is his portrayal of Gollum, one of the few characters with a deep psychological contradiction. In some ways, his central, conflicted role resembles Eddison's Lord Gro, whose work inspired Tolkien. But even this internal conflict is dualistic. Unlike Gro, Gollum is not a character with an alternative view of the world, but fluctuates between the hyperbolic highs and lows of Tolkien's morality.It is unfortunate that both good and evil seem to be external forces at work upon man, because it removes much of the agency and psychological depth of the characters. There is a hint of very alien morality in the out-of-place episode of Tom Bombadil, expressing the separation between man and fairy that Dunsany's work epitomized. Bombadil is the most notorious remainder of the fantastical roots of Tolkien's story which he painstakingly removed in editing in favor of Catholic symbology.Yet despite internal conflicts, there is something respectable in what he achieved, and no fantasy author has yet been capable of comprehending what Tolkien was trying to do and innovating upon it. The best modern writers of fantasy have instead avoided Tolkien, concentrating on other sources of inspiration. The dullards of fantasy have merely rehashed and reshuffled the old tropes back and forth, imagining that they are creating something.One cannot entirely blame Tolkien because Jordan, Martin, Goodkind, Paolini, Brooks, and Salvatore have created a genre out of his work which is unoriginal, cloying, escapist, and sexually unpalatable (if often successful). At least when Tolkien is dull, ponderous, and divergent, he is still achieving something.These authors are mostly trying to fix a Tolkien they don't understand, trying to make him easy to swallow. The uncomfortable sexuality is an attempt to repair the fact that Tolkien wrote a romance where the two lovers are thousands of miles apart for most of the story. Even a libertine like me appreciates Tolkien's chaste, distant, longing romance more than the obsessively fetishistic consummation that has come to define sexuality in the most repressive and escapist genre this side of four-color comic books.I don't think Tolkien is a great writer, I don't even think he is one of the greater fantasy writers. He was a stodgy old Tory, and the Shire is his false golden age of 'Merrie Olde England'. His romance wasn't romantic, and his dualistic moralizing cheapened the story. His attempt to force Christian theology onto a heroic epic is as problematic and conflicted as monks' additions to Beowulf. Tolkien's flaws have been well-documented by notable authors, from Moorcock's 'Epic Pooh' to Mieville's adroit analysis, but for all that, he was no slouch. Even if we lament its stolid lack of imagination, The Lord of the Rings is the work of a careful and deliberate scholar of language, style, and culture. It is the result of a lifetime of collecting and applying knowledge, which is a feat to behold. Each time the moon is mentioned, it is in the proper phase as calculated from the previous instance. Calendar dates and distances are calculated. Every name mentioned has a meaning and a past. I have even heard that each description of a plant or stone was carefully researched to represent the progression of terrain, though I can find no support for this theory.Yet what good is that to a story? It may be impressive as a thought exercise, but to put that much time and work into the details instead of fixing and streamlining the frame of the story itself seems entirely backwards to me. But for all that The Lord of the Rings may be dull, affected, and moralistic, it is Tolkien's, through and through.My Fantasy Book Suggestions"}, {"userName": "Kane", "userReviewDate": "Feb 09, 2011", "userURL": "http://www.goodreads.com/user/show/4715802-kane", "userReview": "A Review of Lord of the Rings: Return of the King, by Sauron[Oprah Winfrey voice-over]: We all remember him. Sauron, the displaced Lord of the Rings. Once feared by millions, Sauron has been living in relative squalor in what he prefers to remain an undisclosed location. [Video shows unidentified heap of garbage behind a Wal-mart. In front stands a mailbox with the word \"Nameless Enemy\" printed on the front. The flag is down.][applause]Oprah: Today, we'll be joined by someone that many of you know but haven't seen or perhaps thought of in decades. Because of his status as a wanted quasi-deity, Sauron has agreed to participate via the internet, thanks to our good friends at Skype. Welcome Dark Lord of Mordor.Sauron [via Skype, single eye only] Thank you Oprah, it's good to be here, among friends.Audience: BoooooooooooooooooooOprah: Sauron, I wanted to do this show so you would have the opportunity to tell the story of the final volume of Lord of Rings, The Return of the King, from your perspective.[Sauron flinches] Oprah: I'm sorry, I understand you even have trouble with the title. Why do you want to talk to us today?Sauron: After my review of the second volume, my agent told me that some asswhipe named Ashton Kutcher tweeted that he was going to \"punk me\". I had no freaking clue what he was talking about but he told me this was trouble. Then one day I was coming back from Costco…[audience laughs]Sauron: Frack you. I use a lot of kleenex. Anyways, I was trying to load all of my items from my cart into my Corolla. They don't even give you bags those bloody cheapskates! Before I know it, a young lady offers to give me a hand. It's the first time in years anyone's ever helped me. I was so grateful. Then as she puts my last box into the trunk she drops something under the car. It makes a metallic sound as it hits the pavement. She looks distressed so, being the gentleman I am, I go on my hands and knees, reach under the car and feel a small trinket. I pull it out. It's a ring. A plastic pink ring. My pants are ruined, I have oil streaks on my arm and my nose is running. She asks me to look to the right and say \"You cannot hide. I see you. There is no life in the void. Only death.\", while holding up the ring. I do it. I don't know why but I did. Then that a-hole Kutcher bursts out of the bushes laughing. The cameras were next. It was all over YouTube within like 20 minutes. It was the lowest point for me since I tore my cornea when Barad-dûr came crashing down [a single tear drops from The Eye].Oprah: I thought you might have trouble today so I've brought you some help.[Dr. Phil enters to applause]Sauron: Aww hell no. Who invited this windbag?Dr. Phil: I feel some negative energy. Sauron: Thanks Kreskin. I went from the cusp of the total domination of the free peoples of Middle-earth to living next door to Marjory the Trash Heap from Fraggle Rock. I think she's dead but I'm not sure. So yes, there's a tad bit of negative energy. A-hole.Dr. Phil: If you're willin ta change, I can make some resources available to you. Are ya willin to do that?Sauron: Your accent is melting my brain. Please stop talking.Dr. Phil: I sense some resistance. This ain’t my first rodeo son!Sauron: You'll sense some fist in your face in a second, you hack. Dr. Phil: One of the things I believe is that we're in the biggest teen crisis in the history of this country.Sauron: [stares] I don't…Dr. Phil: I heard you've started to abuse narcotics? Your eye does look a little red.Sauron: I am Sauron the Deceiver, the Dread Abomination. I can do whatever the hell I want you country bumpkin. I'll snort the rest of the hair off your head right now if I feel like it.Dr. Phil: It's ok to admit it.Sauron: Fine. I'm hooked on Ent-draught, are you happy? That Treebeard is one expensive pusher. Maybe I do a little lembas bread too, but only in the morning. I can stop any time.Dr. Phil: How was your relationship with your parents Sauron?Sauron: Why do we always have to go there!? Fine, fine whatever makes you and Harpo Inc. happy. Freaking vultures. I originated as an immortal angelic spirit, an offspring of the thoughts of Eru, the Creator. I was there before anything else was created. It's all in The Silmarillion you illiterate blowhard.Dr. Phil: Boy, you're saying a lot of words there but you're not tellin me much! I'll tellyouwhat, if someone out there doesn’t agree with me, then somewhere a village is missing their idiot. Oprah: That's an Ah-ha moment. [to audience] Isn't that right?[applause]Dr. Phil: Let's talk about the Return of the King.Sauron: That's why I'm here you idiot. Let's just say, if Aragorn would have accepted the offer I made through the Mouth, we'd all be living happy lives now, with the lands to the East under my rule and those to the West paying me tribute. I felt that was a reasonable offer. I didn't know he cared so much about a halfling. I just want to apologize to everyone. Oprah: What do you say audience, should we give Sauron another chance?Audience: Noooooooo!!! Oprah: Sorry.Sauron: Blow me! I'll forge a new One Ring and come back and stuff it up your asses while it's still hot! Read this in the Black Speech of Mordor detective Gandalf: \"May cause a-hole burns\". I'm not sorry! I'd do it again!Dr. Phil: [to Oprah] I think my work is done here. [smiles and look at Mrs. Dr. Phil, who smiles][applause]Oprah: Sauron…I have a confession to make. I had a dual purpose to bringing you here. I wanted you to face your issues but I always wanted to discuss…OPRAH'S FAVOURITE THINGS FROM MIDDLE-EAAAAAARRRTTTTHHHHH!!!![Drab stage background parts to reveal glorious backdrop of Middle-earth. Audience goes ape shit, women make out with the closest person, grown men don't even bother to hide the growing urine stains on the front of their pants, Oprah guffaws triumphantly]Sauron: WTF!Oprah: That's right! That's right! You're all going to get all of my favourite things from the world that Sauron failed to conquer! Anddddddddd THEN WE'RE ALL FLYING TO RIVENDELL!!! From there, Tom Bombadil will take us on a guided tour of the ruins of Barad-dûr. You may even find a petrified eyelash from the Lidless Eye!![audience member]: Tom who? Sauron: I'm out of here. I'll ship you back the gift basket. [Oprah voiceover] Thus ends the story of Sauron's Review of Lord of the Rings and our glimpse into the Eye of evil. What new terrors is the Dark Lord of Mordor planning? What new plots will he unleash on Middle-earth in order to recapture what was lost. Thank you. That's our show today. Make sure to sign up for Oprah's No Phone Zone Pledge on Oprah.com[applause]Sauron: I'm still here. I'm having trouble logging off. Bollocks! I'm not too good with bloody comput [click][applause]"}, {"userName": "K.D. Absolutely", "userReviewDate": "Aug 23, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "What else can I say? I enjoyed all these three books included in \n\nThe Lord of the Rings\n\n\n (5 STARS), \n (5 STARS) and now\n(5 STARS). It has the most tight interesting plot, memorable characters and universal unending theme: the triumph of good over evil. In fact, in the closing scene of the book, Frodo gives the book he wrote to Sam, the world's greatest gardener. The title of the book is The Downfall of the Lord of the Rings and the Return of the King. The \"lord\" refers to the evil king Sauron whose disappears in the wind when the ring falls to the Mount of Doom together with Gollum and the \"king\" refers to Aragorn who comes back as the rightful heir of the king's throne in Minas Tirith, the city capital of Gondor.No matter in which race, nationality and religion you belong, it is always nice to know that the good persists in the end. The hobbits belong to the powerless race. The elves, dwarves and men in Tolkien's Middle-Earth have all the special powers, skills or natural physique and they helped the hobbits in defeating the evil Sauron and the traitor Saruman. However, if you really think about it, maybe more than half of the effort was contributed by Frodo Baggins (whose sacrifice was both internal and external as he fights the demon that tempts him to use the ring for selfish end), Samwise \"Sam\" Gamgee (for taking care of Frodo and for being an interim ring-bearer when Frodo was bitten by Shelob), Peregrine \"Pippin\" Took (for his presence of mind in throwing the elven brooch so Aragorn would find him and his cousin and also for killing the troll officer during the final battle at the Mouth of Sauron) and lastly Pippin's bestfriend and cousin, Meriadoc \"Merry\" Brandybuck (said to be the most intelligent Hobbit who figured out the password to the cave of Moria and for killing Nazgul fulfilling the prophecy that the latter would be killed not by a man. Merry was knighted by King Eomer as the Knight of the Mark).I mean, they are all small creatures, between 2 and 4 feet in height, they don't have special skills and yet they persisted. They are the main heroes of this book. How about us who are more than 4, 5, 6 feet? They are really inspiring, right? It took me 3 days to finish this book but I spent 5 days reading the very interesting although densely printed appendices. The Numeroneans (Appendix A) are very interesting because it traces the history of Middle-Earth from the first king to the start of the LOTR including the love story of Aragorn and Arwen who marry each other when Aragorn is made king of Gondor at the end of Book 3. Appendix B is useful if you want to know the chronology of Middle-Earth events and you don't have the time to read the long narrative texts. Appendix C has the multi-layered family trees. Appendix D has the Shire Calendar, Appendix E, their language and spelling and Appendix F has the language of the people of the Third Age. I mean, for a low-profile Oxford professor to come out with all details regarding Middle-Earth, it's just unthinkable and something that has been not been duplicated since then, right? I am still in awe while writing this review. I cannot stop admiring this book. I can go on and on but I don't want to bore you. Just take my word for it: if you don't like fantasy genre because you perceive it as shallow and juvenile, try this. This is the fantasy book that does not insult your intelligence. It is entertaining and bewildering. Unforgettable read."}, {"userName": "Anish Kohli", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/20963257-anish-kohli", "userReview": "“So we come to it in the end, the great battle of our time, in which many things shall pass away. But at least there is no longer need for hiding. The board is set, and the pieces are moving. And now all realms shall be put to the test, to stand, or fall – under the Shadow.”\n People:  *looking at the 3 star rating causes wincing and face spasms* What fuckery is this? You rated Tolkien 3 damn stars? Anish:   Guys, take it easy! This book was...People:  You rated the last one 4 stars bcz of that stupid shit about Sam calling Frodo his Master. Still sticking to that dumb point?Anish:  Well, it’s not a dumb point bcz it doesn’t ring righ…People:  Are you like batshit crazy? You'll deduct 2 stars for that? For THAT??? *shaking with anger*Anish:   Not exactly! There is some other stuff that’s wrong with this boo…People:  WHAT??? *eyes go red* More stuff that is wrong? Are you a loony? You gushed praise in your last 2 reviews!!!!Anish:  Yes, exactly! Allow me to use both those reviews as a reference point and explain, yeah?Series rating:The Fellowship of the Ring: \t5  ‘I-am-falling-madly-in-love’ stars!The Two Towers: \t\t 4  ‘I-love-you-but-not-blindly’ stars!The Return of the King: \t3 ‘I love-you-but-let's-get-real’ stars!Sooo, that happened! Well tbh with you guys, for the first time ever, I wanted to go with a fractional rating. I thought of giving 3.5 stars but since this book left me so high and dry, I decided to round it down to a lower rating. I am going to be hated by so many people for this review, aren’t I? *avoids eye contact with Avinash* :DFirst off, Acknowledgements!A very huge and heartfelt ‘you guys SUCK!’ to Ms. MIA and Mr. MIA for completely and utterly ditching me!! This WAS NOT a buddy read!! I am super pissed with you both! :/Annnddd to top it off, I am so, so disappointed with this book. It was a huge let down after the first two books. If you read my reviews for the first two books, you’d know how much praise I had heaped on the author and how much I enjoyed those books. While they too had their flaws and I did mention them, but this book was like something that checked all the wrong boxes and it fell from my graces. I’ll give you a run-down of the good but mostly the bad. >>The writingRich! Very rich writing. Fluent and smooth and poetic (a little too much at times). I said in my last review too that it feels like you’re inside of a song while reading this. Even though it gets weird at times but on the whole, it is fabulous and is a treat to read. The flow of writing is very smooth and you can read this complete series back to back without tiring of it. And yes, even though it annoyed me in places (a lot more in this book), it gave me no reason to even think about putting it down. The songs and poems in the book are pretty great too!>>The world buildingLet’s just say that it is EXHAUSTIVE! It is so detailed that if you’re reading it for the first time, there is no way you can take in and retain all that detail. Tolkien has created a world with such a depth that honestly, it is hard to not acknowledge just how amazing a work it is. This is the part where he excels! The places, the names, the landscape, the creatures, basically everything is so well done and well sketched! I mean, the guy has even bothered to name the damn Orcs who have no role to play! There is such a history in this world that if feels ancient for real. It doesn’t feel like a setting, but a real place. He does a fantastic job and creates this GRAND and EPIC world and takes you on a memorable journey. That no one can take from him. The world is so vast that it feels like there can be an endless number of stories and adventures of past waiting to be told or new ones just waiting to happen!>>The CharactersThere is a HOST of characters in this series that are central and only select few of them are endearing or amazing. Funnily, Aragorn is not one of them! My favs areEOWYN:\n‘What do you fear, lady?’ he asked. ‘A cage,’ she said. ‘To stay behind bars, until use and old age accept them, and all chance of doing great deeds is gone beyond recall or desire.’\n I think she is one of the best damn character of the lot! She is strong, willful and brave! I liked how her character was shaped up. FARAMIR:  \n“‘Do you wish then, that our places had been exchanged?’ said Faramir‘Yes, I wish that indeed,’ said Denethor.‘Since you are robbed of Boromir, I will go and do what I can in his stead – if you command it.’ ‘I do so,’ said Denethor. ‘Then farewell!’ ‘But if I should return, think better of me!’ said Faramir. ‘That depends on the manner of your return,’ said Denethor.”\n I said this in my last review as well, Faramir’s character is great! A strong and valiant man, marred by the tall and glorious shadow of his brother, still trying to prove his worth to the only man who denies to see it, his father! He has by far the best character, especially when it comes to dialogues!SAMWISE:  \n“I want to hear more about Sam. Why didn’t they put in more of his talk? And Frodo wouldn’t have got far without Sam, would he?”\n Ah! How could Sam not make the cut? After all he is the major driving force of this series. I love his dialogues and his dedication to his friend, Frodo!And that is probably the end of good stuff. Sorry fellas!Moving on to the bad stuff in the ascending order of annoyance caused!! >>The ‘Grey’ MatterFrom the first book till the last, I have been confused about Gandalf the Grey, who then transcends to Gandalf the white. Sure he has a lot of wisdom and he has a good character arc and some great quotes but as a wizard, I don’t see how he is a big deal! I mean I didn’t see any of his fabled wizardry. We are never shown his strengths and limitations nor is he ever tested. Well, to be fair a lot of characters aren’t tested but Gandalf bothers me the most. At no point does he do anything that shows that he can use magic!>>Lame dialogueLike I mentioned in both my previous reviews, the dialogue between characters is not spot on. Most of the dialogues are fine but some are not. Many places it sounds weird or too casual and in some places down right funny and that’s something I didn’t like. This has been a problem I faced right from book #1.>>Master master shit!Sam calls Frodo his ‘Master’! This was the ONLY reason I deducted one star from the rating of book 2 and it only happned like 3-4 times in that one. In this installment, Tolkien has legit implied that Sam was Frodo’s servant! In one scene, it feels that Sam doesn’t have equal standing with even Merry and Pippin. If Sam truly is supposed to be an employee or a servant to Frodo then why harp on about friendship and promises and stuff? I hate this point bcz it implies that Sam was duty bound to Frodo, meaning they were never truly friends and then there is no point going all ‘aww’ about those two!Also, ahem, not that I am complaining or that I mind but a few scenes are pretty close to depicting Sam and Frodo as lovers! (Yes, I did put that image in your head! Sam and Frodo going all kissy and shit in Mordor! :D)>>NarrativeYou know, I think that Tolkien is not all that amazing at maintaining different POVs? I still am left questioning why he didn’t alternate between the storylines of what’s going on with the Ring Bearer and the rest of the fellowship! Why did he have to divide it into two parts and make us wait? It sort of works counter to the point and acts as a mood killer.Also, I ABSOLUTELY WAS LOTH to read all the ‘so it was’ and ‘thus it came to pass’ and stuff! So repetitive and it constantly felt like Tolkien didn’t know if he should treat this story as something ongoing or as something that is in the past. And he does both and it really was off putting!>>SidekicksWell, this is something again that bothered me quite a good deal. Some major characters, or supposedly major characters, were treated as sidekicks and they weren’t given enough ink and time. Legolas and Gimli were completely sidetracked and they’re essentially not in the book. How and why their friendship blooms, is also not well detailed. Their roles are basically limited to saying a few dialogues to show that Aragorn has support. That’s all.Weirdest of all was Arwen. And I want to emphasize on this for all the Paolini and Tolkien comparers! Arwen is NOT IN THE BOOKS! She is just supposed to be the love interest of Aragorn but Tolkien has not bothered to sketch a love story between them. They don’t even have any scenes together and they just end up marrying at the end bcz well, fuck the details!! Paolini on the other hand, excelled at this part, just like the battle sequences. He bothered to give Eragon and Arya enough time and detail together unlike Aragorn, the Elfstone and Arwen, the Evenstar!>>Battle sequencesIn my review of book 2, I specifically mentioned that the battle of Helm’s Deep was not well done. It wasn’t well detailed or intense enough. Now, if I am not wrong, there are literally 2 major battles in this series, the sieges of Helm’s Deep and Minas Tirith. And while the sequence with Helm’s Deep is still okay-ish, the major one, the one on which depends everything, the one where the army of the dead was to come, the one where the ‘hammer stroke would be the hardest’, the battle of Minas Tirith, was very strangely not given enough attention! I mean there is A LOT of buildup to it but the actual battle does not happen. No duels, no sword fights, no valor, no nothing! This point actually broke the book for me! I mean the narrative can’t be all sufficient! Yes, it was poetic but I need the war to feel like a god damn war!!I also felt that the ending was too dragged out after the ring was destroyed. It could have been shorter to some extent, especially the part about The Shire towards the end. It felt forced and easily avoidable. So was the insta-love of Eowyn towards Aragorn. Most of the problems I mentioned, irked me personally and may not be the same for others but it definitely is there and it ruined the book for me, making it the least impressive in the series for me.All in all, it’s a fine and engaging read, despite all the problems. It is very immersive and the pacing is fabulous of the books except for a couple chapters in the whole series. There is a lot happening in the book even if not all of it is required. Definitely one of the best series I have read. I will probably re-read this series at some point of time as it has been a fantastic journey and an amazing experience but it’s not unblemished. Everyone gets their happy ending, mostly, me included. I am glad to have read this series and to have seen it through. \n“It must often be so, Sam, when things are in danger: someone has to give them up, lose them, so that others may keep them. I will not say: do not weep; for not all tears are an evil. But I am glad you are here with me. Here at the end of all things, Sam”"}, {"userName": "Liz", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/14811808-liz", "userReview": "Is it even possible to review a legend? To write a review about a completely different and unique world?\n\nIt is not. It is just not possible. Just imagine writing a review about our world, about all the countries and cities and cultures and all the wars. It would simply be too long and too difficult. What I can say about this book is that the epic journey finally came to an end. The Fellowship had to fight bloody, hopeless fights, it had to survive epic battles and it found friends where friends were not expected and enemies in those who seemed to be friends at first. Every single member of the fellowship had an own journey. Every single member suffered from losses and yet found something new and unexpected. Every single one discovered truths and lies. The members of the Fellowship fought, they hoped and believed. Until the very end. \n\nIt is impossible for me to describe just how much I loved each and every character of this world. I loved how the crownless became king, I loved the dwarf and the elf who showed that friendship is stronger than prejudices, I loved the wizard who even faught Death and came back to finish his task and help his friends. But those I loved most were the hobbits. So weak and simple at the first gaze, but so strong and determined and hopefull in the end. Merry and Pippin who showed that they are just as strong as the humans, Frodo who continued his journey although he had no strenght left. Who carried the ring because he knew that only he could safe his beloved ones and the world he loved. And finally Sam. Sam, who was everything for Frodo. Without him Frodo would have died. He wouldn't have come that far without Sam. Every single character that appeared in this \nepic\n trilogy was a hero, was special and able to teach lessons that are useful and necessary for everyone. I felt home in Middle-Earth I still do. I belong to Middle-Earth much more than I belong to this world, but not many people of our time do..."}, {"userName": "Lyndz", "userReviewDate": "Jun 08, 2011", "userURL": "http://www.goodreads.com/user/show/5594816-lyndz", "userReview": "Well, there really IS no greater compliment..."}, {"userName": "Foad", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "«درست مثل داستان های معروف ، آقای فرودو. اون هایی که واقعاً مهم بودند، اون هایی که پر از خطر و تاریکی بودن. و گاهی آدم دلش نمی خواست پایان قصه رو بدونه، چون چطور می تونست پایان خوبی داشته باشه؟ چطور دنیا می تونه پر از خوبی بشه وقتی که این قدر اتفاقات بد میفته؟ ولی در نهایت این سایه می گذره. حتی تاریک ترین شب هم می گذره و جای خودش رو به روز میده.این ها داستان هایی بودند که توی ذهنت باقی می موندن و برات اهمیت داشتن، حتی اگر کوچیک تر از اون بودی که دلیلش رو بفهمی. ولی حالا می فهمم، آقای فرودو، حالا دلیلش رو می فهمم: آدم های توی اون قصه ها می تونستن تسلیم بشن، ولی نشدن. ادامه دادن چون به چیزی ایمان داشتن. ایمان داشتن که توی این دنیا خوبی هم هست و ارزش جنگیدن رو داره...»"}, {"userName": "Johann (jobis89)", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/50893023-johann-jobis89", "userReview": "\"I will not say: do not weep; for not all tears are an evil.\"You know the drill - Sam and Frodo are on their way to Mordor to try and destroy the ring, but not without a companion lurking in the shadows... The armies of the Dark Lord are massing in an epic battle for Middle Earth... it's all come down to this!And so my journey through Middle Earth has ended *cue hysterical crying*. Revisiting both The Hobbit and Lord of the Rings this year was a great decision - I'll be revisiting Hogwarts in a similar way in 2018. There is always time to reread your favourite books because you will honestly pick up or learn something different each time. This time around my overriding experience has just been an appreciation of the friendship found within these pages. It has also solidified Samwise Gamgee's position as one of my fave characters of all time. Aragorn may get all the heart eyes, but Samwise is truly special.I thought at the end of my reread I would have a definitive conclusion on which of the three parts is my favourite. And to be blunt, I don't! I love them all for different reasons. The Fellowship is exciting because it's the beginning of the journey, the fellowship are all together... The Two Towers has some awesome parts and huge battles.... and The Return of the King just pulls at my heartstrings and breaks my heart because it's all ending!!The Return of the King has some crucial scenes with regards to Frodo and Sam's friendship; in particular, the lengths Sam will go to in order to ensure Frodo achieves what he set out to do - to destroy the ring. Gollum's appearances and interactions with the two of them are on point, as well! I also just love the entire sequence of Aragorn becoming King *heart eyes* This book also has one of the most epic parts of the series...\"But no living man am I! You look upon a woman.\"YASSSS! This moment! During the book and when I rewatch the movies I always feel like I'm waiting for this moment. Some shade is thrown Tolkien's way for the lack of real female power in this story, but this scene SLAYS for me. There's much to learn within this story and a lot is still relevant today. The friendship that forms between elf and dwarf, regardless of prejudice. The hobbits who were at first deemed to be weak and useless, who then turn out to be some of the bravest characters in literature. The need to fight for the greater good, to combat the evil in the world - and to have a friend by your side as you do it. Because things aren't always easy, but if you have a good friend to support you, you can overcome anything.I do have a couple of issues with ROTK though - I just felt like the entire scouring of the Shire was completely unnecessary. It felt a bit tacked on at the end. As others have said before me, you do feel like Tolkien found it hard to say goodbye to this epic story he had written, and so you keep getting ending after ending after ending. On the same note though, I never want this story to end sooooo it doesn't entirely bother me!!!I am in awe of this world that Tolkien created - it truly is the benchmark by which all other fantasy is measured. These movies and the books are enshrouded in nostalgia for me and revisiting Middle Earth is always like coming home. As I was reading through the last 5 or so pages I could just feel tears running down my face! I don't think any other piece of literature has this effect on me every time I revisit. It's a journey I will take many times in my life and it holds a very special place in my bookish heart. I can't give it any less than 5 stars."}, {"userName": "James", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/41609617-james", "userReview": "‘The Lord of the Rings’: John Ronald Reuel Tolkien’s three volume masterpiece comprising ‘The Fellowship of the Ring, The Two Towers and The Return of the King’ – is quite simply a literary, artistic and intellectual creation and achievement of epic and monumental proportions.The stories that J. R. R. Tolkien has crafted to produce ‘The Lord of the Rings’ feel as though they have been carved out of stone. Tolkien’s creation of another world – Middle Earth, its history, its legends and the stories, adventures and lives of all those who dwell there is truly and masterfully wonderful. Whilst I am by no means an avid fan or reader of fantasy literature, nor stories about dragons, giants, goblins, wizards and magic – ‘The Lord of the Rings’ (as with all great literature) completely and utterly transcends the boundaries of the fantasy novel and obliterates the narrow confines and limitations of the genre. Despite the fantastical nature of ‘The Lord of the Rings’ – it is at its heart a very human book and a very human story.The literary themes explored throughout by Tolkien are certainly not new ones and neither were they at the time of publication in 1954. These are the very ancient themes, of good versus evil, of the epic quest, of an insurmountable and seemingly unending odyssey – all of which are as old as literature and the dramatic art; as old as mythology itself; as old as the eternal quest; as old as the elemental; as old as the epic voyage; as old as Odysseus himself; as old almost as life and time itself. But what Tolkien does here is to recreate, re-write, re-invent and re-imagine these ancient themes in his three volume masterpiece of truly epic and monumental proportions in a wonderful way that is unparalleled in 20th century literature.Considering the extent of the background and development work that Tolkien had to undertake to create and develop the highly detailed and fully formed world, history and mythology of ‘The Lord of the Rings’ – this was in one respect a truly academic as well as an artistic endeavour. Everything created, everything considered, everything incarnated…. Yet despite all that, it never feels like an academically written tome – it feels very much like what it is: an exciting adventure, a quest into an unknown world, a story quite simply of the very highest order."}, {"userName": "Roly Chuter", "userReviewDate": "May 16, 2007", "userURL": "http://www.goodreads.com/user/show/85229-roly-chuter", "userReview": "I’m sure glad Stevie didn’t bother to read this one:Sam and Frodo wake up in some swamp/heath/mountain passFrodo: We’re lost, oh its awful, I’m hungry, we only have 3 pieces of elfin bread leftSam: Don’t worry Frodo I’m here for you, you have the breadSam and Frodo walk around a bit looking dirty and lost and miserableFrodo: oh the ring, it’s so heavy, how will I cope?Golem: Myyy presssciousss [and all that nonsense]Sam: Don’t worry you have a nice sleep, things’ll look better in the morning you’ll seeSam and Frodo wake up in some swamp/heath/mountain passFrodo: We’re lost, oh its awful, I’m hungry, we only have 3 pieces of elfin bread leftSam: Don’t worry Frodo I’m here for you, you have the breadSam and Frodo walk around a bit looking dirty and lost and miserable...FOR 200 HUNDRED GOD AWFUL PAGESAnyone who wasn’t desperately hoping that Golem cracked open Frodo’s skull like a pumpkin after Halloween and drained the grey goo inside has more patience than me."}, {"userName": "R.K. Gold", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/40737518-r-k-gold", "userReview": "So I loved this book but it really just dragged on. I mean of the Lord of the Rings series, this was probably my least favorite. The climax felt incredibly short, as did the battle and the ring was destroyed less than three-quarters of the way through. There was an incredibly long journey after the destruction of the ring following the hobbits' recoveries and their return home. below are spoilersI also felt like the fight when they returned to the Shire was rushed, and I'm not entirely sure about its purpose. I mean was it just to show that Saruman was in fact dangerous and should've never been allowed to walk free? It was such a short exchange full of death threats, then out of nowhere he gets killed by his abused servant. I don't know. It was just so rushed.That was the pace of the whole book though, and the series for that matter. One of its allures was all one of its problems. Though I loved the fast pace of it, and am unsure if I could've read a slow paced high fantasy, I felt like I missed so much.Again, seeing the movie before reading the series helped me visualize everything that was going on, in particular when Aragorn, Legalos, and Gimli traveled into the mountain to recruit the army of the dead. All in all, I think my favorite of the series was the Two Towers, followed by the Fellowship of the Ring, and The Return of the King was my least favorite (though still a four-star read). Final note: This complaint is not specific to The Return of the King. I wish Tolkien took more time to explain the role and powers of the wizards. I have no clue what Gandalf's limitations or actual abilities are. I may sound silly for worrying about that, but sometimes he came across as a god and other times he just seemed like an old man. I mean he single-handedly fought the Balrog in Moria, but then the narrator on multiple occasions referred to Aragorn, and Denethor as equals when staring eye to eye with the wizard. If anyone has more information on wizard lore of middle earth please point me in the right direction."}, {"userName": "Pinkerton", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/64701643-pinkerton", "userReview": "Ultimo capitolo di questa trilogia. Confesso che è con una nota di dispiacere che ho visto all’opera personaggi che abbiamo conosciuto così bene ormai maturi, era stato tanto bello vederli crescere lungo il percorso, ma ne sono stati introdotti anche di altri in questa fase conclusiva che non hanno nulla da invidiargli. E poi, oltre al gran finale, c’è pure un epilogo di tutto rispetto che non si limita a saluti ed abbracci (tanto per gradire ci sono pure le appendici). Un lavoro che a tutti gli effetti ha fatto la storia della letteratura fantasy e che a mio avviso ogni appassionato di libri in generale dovrebbe leggere almeno una volta nella vita. 110 e lode per il professore."}, {"userName": "Liam Degnan", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/8180038-liam-degnan", "userReview": "“Well, here at last, dear friends, on the shores of the Sea comes the end of our fellowship in Middle-earth. Go in peace! I will not say: do not weep; for not all tears are an evil.”\n\n\nFour Stars:✰✰✰✰\n (I should say that this is less of a review and more of my own musings about the ending and the overall quality of the story. I didn't feel like I needed to reiterate all of my critiques, because all of the things I have to say in my first and second reviews still apply for the most part. Check those out if you're interested. For my overall impressions about the conclusion of this story, read below =].) Welp. After roughly ten years of starting and stopping and starting this series again, I have finally made it to the end, and read all three books through and through. I'll admit, I don't enjoy these books as much as I might enjoy others, and I can't say that I loved them, but it was a journey worth going on. It's strange. As I've been trying to decipher my own thoughts and feelings about this book, all I keep coming to is a feeling of disappointment. But not disappointment in the book - I literally feel disappointed in myself, because I wish I liked these more. I can objectively see the beauty of the writing, and the story, and the world. And Tolkien has a really unique way of creating magic with his words that has made me fall in love with stories from other books in the genre. But I feel like I spoiled it for myself not having the patience to read all of these books before I saw the films (granted.... I was MUCH younger, but still, I wish haha). That, I think, more than anything has hindered me in my ability to experience these books with a full imagination. In spite of that though, I can still comment on the excellency of this entire trilogy, and this conclusion in particular. \n\n\"It must often be so, Sam, when things are in danger: some one has to give them up, lose them, so that others may keep them.”\n\nIn my last two reviews, I've done a lot of critiquing, because I felt like I needed to justify my low ratings, so I thought I'd reserve this one for some praise that I can give to Tolkien, because there really is so much good stuff here (and in this book in particular). Tolkien knows how to write a good ending. I know how the book ends because I watched the movies, and still this book greatly impressed me with the way that everything got wrapped up, leading all the way to the last page. It's not something that can be experienced on a screen. This is not your typical \"good guys win\" and live happily ever after kind of book. Everything doesn't just go back to normal after you hit the climax. Something I love about this ending is that you really get to experience what it's really like when tragedy is overcome. It's not usually happily ever after. A lot of the time, it is after the greatest victories that we experience the most brokenness. The heroes of the stories we love to tell are often the ones most haunted by their own actions and experiences. The shadow of the past rests on them while it passes over everybody else. \n\n“I have been too deeply hurt, Sam. I tried to save the Shire, and it has been saved, but not for me.” \n\nAnd yet in this story there is still so much light. There is a hope that supersedes these characters' experiences, and a truth that goes beyond what they can see. And I like to think that this is true in real life as well. Tolkien writes an ending that is all at once realistic, satisfying, heart wrenching, and filled with joy. One of the best endings that I've ever read I think - and each of the characters received their own individual conclusions, which was a really cool thing to see unfold.\n\n“For like a shaft, clear and cold, the thought pierced him that in the end the Shadow was only a small and passing thing: there was light and high beauty for ever beyond its reach.” \n\nFrom world building, to the story as a whole, to the excellent writing, and an ending that truly impressed me, I think that everybody should experience these books. They really do make the foundation for modern fantasy as we know it, and Tolkien is a master at many of these elements, in spite of the fact that it can be easy to get bogged down occasionally.  I'm happy to say, these were worth the patience required to get through them, in the end. If you're a fantasy fan, definitely get to these at some point =].\n\n“I am glad you are here with me. Here at the end of all things.”"}, {"userName": "Todd", "userReviewDate": "Aug 22, 2007", "userURL": "http://www.goodreads.com/user/show/300992-todd", "userReview": "To me, the whole point of reading the first two books of LOTR is to get to this one, because this is the truly masterful part of the story.One thing I will say is that I really admire how the main heroes of the story, Frodo and Sam, are quite inconsequential in the classic tradition of heroes. They can't fight, they can't cast spells, they can't really do anything except persevere through extreme trial, all so that they can do what they promised to do, to do the right thing. Sam, in particular, is a True Hero in my eyes, a character with a pure heart.Do I need to warn of spoilers when everyone already knows the story? Oh well, SPOILER ALERT!It's very interesting to me that Frodo is unable, at the edge of the Pit of Doom, to part with the ring. It takes a struggle with Gollum, and an accident, really, in order for the ring to be destroyed. I wonder if any mortal, even Sam, would have been able to throw the ring away? I suspect not, and to me it signifies our mortal failings in this life. We cannot, try as we might, fully separate ourselves from the natural man of our own accord. But still, like Frodo and Sam, we can give it our best go.In the end, however, we will need to be rescued. Like Frodo and Sam, we will not be able to survive or escape in and of ourselves, but we will need (so to speak) Gandalf and the eagles to come swooping down and rescue us, in the end.(I am, of course, speaking metaphorically in a religious sense.)"}, {"userName": "Laz", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/22313662-laz", "userReview": "“What do you fear, lady?\", Aragorn asked. \"A cage,\", Éowyn said. \"To stay behind bars, until use and old age accept them, and all chance of doing great deeds is gone beyond recall or desire.”\nWriting this review I have a wild hunger to re-read this series again just to get to feel that excitement and the rush of emotions that these books instill in me.The epic conclussion to it all. The war. The great fight. The way it all ends. The sacrifice. The obsession. The act of overcoming the inredible. This series has it all. I couldn't be more satisfied by reading a book, a final book at that. I love what J.R.R. Tolkien does with his characters. He knows how to handle his characters that he so passionately created. I am so in love witht his, I don't want to let go. Middle-Earth never ceased to surprise and inspire me. Making me imagine things. It's truly a must-read, a one-of-a-kind book that sets your imagination to motion and creates images. \n“Oft hope is born when all is forlorn.”"}, {"userName": "Mary", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/17156965-mary", "userReview": "Still 5 stars. Still amazing."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jun 19, 2010", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "494.\tThe Lord of The Rings: The Return of the King, J.R.R. TolkienThe Return of the King: Sauron sends a great army against Gondor. Gandalf arrives at Minas Tirith to warn Denethor of the attack, while Théoden musters the Rohirrim to ride to Gondor's aid. Minas Tirith is besieged. Denethor is deceived by Sauron and falls into despair. He burns himself alive on a pyre, nearly taking his son Faramir with him. Aragorn, accompanied by Legolas, Gimli and the Rangers of the North, takes the Paths of the Dead to recruit the Dead Men of Dunharrow, who are bound by a curse which denies them rest until they fulfil their long-ago forsworn oath to fight for the King of Gondor. Following Aragorn, the Army of the Dead strikes terror into the Corsairs of Umbar invading southern Gondor. Aragorn defeats the Corsairs and uses their ships to transport the men of southern Gondor up the Anduin, reaching Minas Tirith just in time to turn the tide of battle. Éowyn, Théoden's niece, slays the Lord of the Nazgûl with help from Merry. Together, Gondor and Rohan defeat Sauron's army in the Battle of the Pelennor Fields, though at great cost. Théoden is slain, and Éowyn and Merry are injured....ارباب حلقه‌ها - جی.آر.آر. تالکین (نگاه، روزنه، ...) جلد سوم بازگشت شاه؛ تاریخ نخستین خوانش: ماه جولای سال 2004 میلادیعنوان: ارباب حلقه‌ ها (فرمانروای حلقه ها) - مجلد سوم بازگشت شاه؛ نویسنده: جی.آر.آر. تالکین؛ مترجم: رضا علیزاده؛ تهران، روزنه، 1381؛ چاپ ششم 1391؛ فرودو و سام به حرکت خود در سرزمین موردور به سمت کوه هلاکت ادامه می‌دهند. در آن سوی کوههای موردور بزرگترین جنگ دوران سوم، نبرد حلقه آغاز میشود. نبردی که هر چند تنها متوجه شهر «میناس تیریث» است، اما نتیجه اش تمام خطّه ی میانه را تحت تأثیر قرار میدهد. پیروزی یا شکست نیروهای تاریکی، به موفقیت یا عدم موفقیت فرودو و سام وابسته است. ا. شربیانی"}, {"userName": "Brian ", "userReviewDate": "Dec 29, 2014", "userURL": "http://www.goodreads.com/user/show/30718608-brian", "userReview": "2018 Update, Sixth Read:-Imagine your worst experiences in life, the most horrible feelings you've felt, or the most excruciating suffering you've gone through. Multiply that by ten, and you will feel the demonic power of the winged Nazgul bringing \"the Black Breath.\"-Loved the battle with Eowyn and the Witch King of Angmar. She laughed! Imagine that. Such intense, ferocious, adrenaline. You face a winged creature of Mordor with the power of evil and demonic oppression, and the rider leads a group of Wraiths with dark magic power. And she laughs! Because she says \"I am no man.\" Confidence. Mocking the darkness. Love this character!-I didn't want this to be over. I wanted it to go on forever.-The description of the Battle of Pelennor Fields, the pandemonium, the deaths, the loss, the Black Breath, the sacrifices, the minute gain that won: all that prepares for the hopelessness of the Last Battle, and the plan to divert Sauron's eyes from Frodo, on which all hope now rests. All the power of the world, Elves, Men, Dwarves, and now it's in Hobbit hands.-FORTY YEARS of an authors work, in the hands of one little hobbit, a final climax. =)-What if Tolkien had let Frodo and Sam die in the lake fires of Mount Doom? Think about it.-Irony: \"One Ring to bring them all and in the darkness bind them.\" Sauron accomplished this, but not his way. He bound those in the fellowship against him, in the darkness, for a final victory, and his own loss.-Wonder if Tolkien relates the passing and sadness of the third age of wonder and magic to the passing of suspended belief in childhood.Best read yet, of all three, of all six times, of all I've read, ever. Wow. 2017 Review:Again, the book stands apart from the movies since I haven't seen them. Peter Jackson directed superb movies, and gave them a relevant appeal to our culture and time, including the Celtic music and significant accents. The book felt to me, this time around, as the Dungeons and Dragons and Final Fantasy NES games felt to me as a teen, and as I did back when my friends gathered with books, papers and dice and let one of us be a Dungeon Master, and walk us through an all-night quest. I saw the magic of Gandalf displayed in classic splendor. The energy carried me with intensity throughout, especially the battle scenes and the struggles of Frodo with the Ring, and his hallucinations of the Wheel of Fire turning before his opened eyes.Every year I read it gets better. The books hold my heart, and reveal how antagonists bind people in love who fight for the good of the world.2016 Review:My heart feels hollow. This hurts. I'm not kidding. I love this world and these characters and especially my little buddies, the Hobbits. I kind of wonder if I'm normal. I feel I could cry.Original Review:This one has become my favorite in the series. It is the climax as well as the departing of those you have allowed a place in the heart. It is both riveting and saddening. It is riveting because the excitement comes to a head, emotions overpower the mind and heart, tears threaten to flow as the little ones struggle with all that is in them to destroy the Ring. King’s die, new Kings are established, a Lady shows her hidden power and bravery, hobbits become princes of legend. It was constant excitement, constant emotion, a brewing of inner feelings and struggles the reader feels as they experience all that the characters go through. Gondor is introduced. Rohan comes to the aid of their neighbor. The battle comes to a head, but the battle itself is not the means to the end. That lies in the hands of two small fellows who wield as primary strength inner fortitude, courage, love, bravery, and positive, happy attitudes that still burn slightly in the midst of tangible darkness.  When I came to the end I was so sad. I love the Elves. They are so beautiful and hold the strongest connection to Illuvitar. I love Gandalf. I love the hobbits. I love Gimli and Legolas and all that they are a part of. I love Aragorn and Faramir, Eowyn and Eomer. In the end you have to say goodbye as they go off and live their own new lives, but no longer again, ever, as part of the Fellowship of the Ring. It seems sometimes that the darkness serves to bind the strongest in love those who strive against it."}, {"userName": "Denisse", "userReviewDate": "Jul 25, 2014", "userURL": "http://www.goodreads.com/user/show/8759700-denisse", "userReview": "[ porque siempre se ha dicho como algo negativo de esta historia, la poca participación femenina, o mejor dicho que no se toma a la mujer tan en cuenta…DIOS! NO PUEDE HABER UN COMENTARIO QUE HAGAN EN CONTRA DE ESTOS LIBROS QUE ME CHOQUE MAS! Se los juro. Cuando LOTR salio por primera vez publicado, la mujer NI SIQUIERA VOTABA AUN! Apenas se estaban haciendo esos cambios…apenas!!!! Crear personajes femeninos en esas epocas si era revolucionario, no como ahora cada autorucha escribe pendejada y media. Eowyn es mucho más personaje femenino que todas esas inútiles de esas novelitas pinchurrientas que están TAN de moda en pleno puto siglo 21, así que cállense. Fin de mi escupidera de amargura XD  (hide spoiler)]"}, {"userName": "Will Byrnes", "userReviewDate": "Nov 05, 2008", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "The conclusion to my favorite series of all time. Will Frodo be able to complete his mission? Will such completion cost him his life? Can Middle Earth be saved? Ok. I know. You've seen the wonderful Peter Jackson films. But there is nothing like reading it for yourself. It is the difference in feeling between seeing it on TV and being there. Read the trilogy. Be there. You won't regret it."}, {"userName": "Apatt", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "“Go back to the abyss prepared for you! Go back! Fall into the nothingness that awaits you and your Master. Go!”Gandalf really knows how to tell people (or non-humans) to eff off.I am happy to finally finish the LOTR trilogy, not that it was any real hardship, and it is not even the first time I have read it (it’s the second). When I read it the first time I did not appreciate the richness of  Tolkien's legendarium, I don’t fully appreciate it even now, I totally skipped the 100+ pages appendix at the end. Nobody likes to have their appendix removed, but it’s TMI or CBA, as my friend C.C. Lee likes to say.As mentioned in my review of  The Two Towers the LOTR trilogy is one book trisected, so there is no real narrative gap between each volume. The story kicks off with Gandalf and Pippin traveling to Minas Tirith, with Gandalf riding Shadowfax while holding Pippin who is wrapped up in a cloak. It sounds very uncomfortable, but I like the Gandalf and Pippin combo, their contrasting personalities make them an interesting pair (I name this ship Ganpin!). Gandalf is going there in his capacity of Middle-earth’s troubleshooter; as for Pippin, he took a peek at Palantíri the seeing stone and now he is known by Sauron (not to be confused with Saruman, which I often do). So he cannot be left unsupervised.Soon the narrative shifts to the continuing adventure of Aragon, Legolas, Merry, Gimli and a few Rohan dudes. For some reason, they all like to mention their Dad’s name when introducing themselves. They are also heading for Minas Tirith, but their horses are not super speedsters like Shadowfax (so named because he moves at the speed of a fax – probably). Aragorn decides to travel via a scenic route called “Paths of the Dead” to which all his companions say “you must be effing kidding” or words to that effect. At the Paths of the Dead Aragorn recruits a zombie ghost army to help them fight Sauron’s orcs. The war of Gondor vs Mordor takes up about half the narrative, Gondor’s army is far outnumbered by Mordor’s seemingly infinite supply of disposable orcs. However, the war is a mere distraction to keep Sauron’s attention away from Frodo, so he can do his job of destroying the One Ring. Around the half way point the narrative switches to Frodo and Sam on their Toxic Ring disposal project, but first Sam has to rescue Frodo from the clutches of the orc, and he does it like a champ.On their way to the elegantly named Crack of Doom they meet up with their old pal Gollum again, and things are never dull when Sméagol is in town. This little meeting leads to a fabulous climax which Which surprised me by its place in the book (including the narrative and the lengthy appendix). The climax arrives just a little after the middle of the book, how is Tolkien going to top the excitement of this scene? Ok, I'm going to venture into spoiler territory now and I CBA with the spoiler tags. So after the warning by Boromir below there will be some spoilers; nothing too extreme but I don’t know what your threshold of tolerance is for spoilers.Interestingly, Tolkien does not even try to top that aforementioned climax. The narrative continues for another 100 pages or so after this climax, the remaining chapter combined read like the longest epilogue ever. After that tremendously exciting scene, the narrative begins to wind down and our heroes from the Fellowship (sans poor Boromir) get to relax a bit, shoot the breeze, do some sight seeing, binge Netflix etc; even Bill the heroic pony makes a welcome return. Aragon is crowned King Elessar because “King Aragon” just does not cut it and takes the throne at Minas Tirith. Legolas, Gimli, and Gandalf go their separate ways and our four heroic hobbits go back to the Shire to find it has become a dystopia, with a certain Sauron-wannabe behind it. No problem! Since their triumphant return from Mordor, they have become very badasses, well, except Frodo who is still a bit of a hippy. Soon order is restored with some losses of life but, of course, not one of our premium hobbits, even Bill the pony is entirely unscathed and literally gets to do a bit of ass kicking. Once things settle down at the Shire Frodo becomes moping and withdrawn, because of his various war wounds and the traumatic experience of his time in Mordor. What follows is bittersweet and rather poignant.I love how Tolkien defies expectations by continuing the narrative long after the epic climax and still manages to hold on to the readers’ interest because we have come to love the characters by this point and want to see how they get on post Ring disposal. Another thing that surprises me is how little we see of Sauron, I don’t think he makes a physical appearance. He seems to be a very standoffish villain. We just see one of his eyes (presumably he has the complete set), which it is not pretty.Half the book is about warfare, against impossible odds, I don’t personally like to read about military forces going at it, but I did enjoy Eowyn facing down the Witch-King and his Nazgul, with a bit of help from Merry.Art by  moonxels.I much prefer the more intimate adventure of Frodo and Sam, and I do think Sam is the real hero of the trilogy. I suspect that if Sam continued as the Ring Bearer who would have been more steadfast and chucked the Ring into the volcano without hesitation. Anyway, all’s well that ends well. The entire trilogy is much shorter than I anticipated. If I had read the three volumes back to back it would have taken just under three weeks. Tolkien’s artistry, attention to details and world building is still astonishing, and his characters will never be forgotten. If you have only seen the Peter Jackson movie adaptation I highly recommend immersing yourself into the original text. So ends the Third Age.  The Silmarillion next!Notes:• The narrative is always told from the point of view of one of the four main hobbits; just to show you what the little People / the underdog can do, it only takes courage and moral fortitude. • Medical treatment in Middle-earth is called “leechcraft” for some reason, does not exactly inspire confidence.Quotes:“In that hour of trial it was the love of his master that helped most to hold him firm; but also deep down in him lived still unconquered his plain hobbit-sense: he knew in the core of his heart that he was not large enough to bear such a burden, even if such visions were not a mere cheat to betray him.”Samwise for President!“The Shadow that bred them can only mock, it cannot make: not real new things of its own. I don't think it gave life to the ores, it only ruined them and twisted them; and if they are to live at all, they have to live like other living creatures. Foul waters and foul meats they'll take, if they can get no better, but not poison.”A bit of orc lore from Frodo.“Here is Aragorn son of Arathorn, chieftain of the Dúnedain of Arnor, Captain of the Host of the West, bearer of the Star of the North, wielder of the Sword Reforged, victorious in battle, whose hands bring healing, the Elfstone, Elessar of the line of Valandil, Isildur's son, Elendil's son of Númenor.”“All save one. There waiting, silent and still in the space before the Gate, sat Gandalf upon Shadowfax: Shadowfax who alone among the free horses of the earth endured the terror, unmoving, steadfast as a graven image in Rath Dínen.”Gandalf is basically Clint Eastwood“Gandalf! He always turns up when things are darkest. Go on! Go on, White Rider! Gandalf, Gandalf!”He is also Batman“For thus is it spoken: Oft hope is born, when all is forlorn.”"}], "description": "As the Shadow of Mordor grows across the land, the Companions of the Ring have become involved in separate adventures. Aragorn, revealed as the hidden heir of the ancient Kings of the West, has joined with the Riders of Rohan against the forces of Isengard, and takes part in the desperate victory of the Hornburg. Merry and Pippin, captured by Orcs, escape into Fangorn Forest and there encounter the Ents. Gandalf has miraculously returned and defeated the evil wizard, Saruman. Sam has left his master for dead after a battle with the giant spider, Shelob; but Frodo is still alive — now in the foul hands of the Orcs. And all the while the armies of the Dark Lord are massing as the One Ring draws ever nearer to the Cracks of Doom.--back cover", "title": "The Return of the King\n      \n          (The Lord of the Rings #3)", "url": "http://www.goodreads.com/book/show/49891.The_Return_of_the_King", "average": 4.51, "cover": "https://images.gr-assets.com/books/1295996565l/49891.jpg", "reviews": 7279, "authors": [{"url": "https://www.goodreads.com/author/show/656983.J_R_R_Tolkien", "name": "J.R.R. Tolkien"}], "type": ["Fantasy", "Fiction", "Classics", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/49891.The_Return_of_the_King", "http://www.goodreads.com/book/show/1079424.The_Return_of_the_King", "http://www.goodreads.com/book/show/892555.The_Return_of_the_King", "http://www.goodreads.com/book/show/18512.The_Return_of_the_King", "http://www.goodreads.com/book/show/15923742-the-return-of-the-king", "http://www.goodreads.com/book/show/623517.The_Return_of_the_King", "http://www.goodreads.com/book/show/222912.The_Return_of_the_King", "http://www.goodreads.com/book/show/2151424.The_Return_of_the_King", "http://www.goodreads.com/book/show/727810.The_Return_of_the_King", "http://www.goodreads.com/book/show/28850.The_Return_of_the_King", "http://www.goodreads.com/book/show/4526766", "http://www.goodreads.com/book/show/19007288-il-ritorno-del-re", "http://www.goodreads.com/book/show/17206477-el-retorno-del-rey", "http://www.goodreads.com/book/show/5907.The_Hobbit", "http://www.goodreads.com/book/show/34.The_Fellowship_of_the_Ring", "http://www.goodreads.com/book/show/15241.The_Two_Towers", "http://www.goodreads.com/book/show/33.The_Lord_of_the_Rings", "http://www.goodreads.com/book/show/7332.The_Silmarillion", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}