{"ratings": 31541, "userreviews": [{"userName": "karen", "userReviewDate": "Apr 08, 2007", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": ""}, {"userName": "Sammy", "userReviewDate": "May 29, 2007", "userURL": "http://www.goodreads.com/user/show/103544-sammy", "userReview": "First off, let me start by saying that this is not a religious book, it can be viewed that way if you want to, but in case you're one of those people that are scared off by religious books, this isn't one. Now, on to the more important matters...Almost from the first word I had become sucked into this book and Ninah's character, a flawed, naive girl who truly doesn't know better. She's sweet, tries hard, but just doesn't know what she needs to know. The way Reynolds has written her, doesn't make her naivity annoying, but just adds to her character.Part of what makes this book so interesting is that it's written in a way that completely immerses you in their obscure and different world, but allows you to keep your own knowledge and ideals about you, so that you look back and can still think, \"That's so wrong!\"Ninah goes through a trying journey and we are along for the ride. I was enthralled with every character that graced the pages of this book. Even though they may only show up in one sentence, Reynolds writes in such a way that you know if you asked her she could give a complete history about that character. This book holds so much depth to it, but it's presented in such a way that the reader doesn't feel like their drowning.The one small problem I did have was that the ending seemed a little too abrupt. Perhaps it's just me, but I felt there wasn't enough closure and I wanted to know a little more. But what I dislike, someone else may love.There's a lot more I want to say about the book, but I would end up giving too much away. This is definitely a book I say you should read. Beautiful, touching and moving every word pulls you even more into this world that the feeling of disgust you felt at the beginning has turned to pity, and in some weird way, a small glimmer of joy."}, {"userName": "Annet", "userReviewDate": "May 20, 2008", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "Intriguing story.Note June 2017: I remember this really is an intriguing story, have to reread."}, {"userName": "Annie", "userReviewDate": "Jul 06, 2007", "userURL": "http://www.goodreads.com/user/show/113160-annie", "userReview": "I just finished reading this book for the second time. I think I loved it more than the first. The only books I tend to give 5 stars to are books that make me want to reinvent my life when they are over, live a better life, and be a better person. This really isn't that kind of book but it is greatness through and through.There were times while reading this book that I just needed to put it down. I knew if I kept reading I would get too sad. I was right there with Ninah, going through her struggles. I wanted to so badly to reach in and tell her that everything would be okay, that she was doing just fine. I couldn't though. I had to sit back and watch her suffer and wait for James to tell her that she was \"doing good\". I don't want to be Ninah or have her life. I do aspire to have her strength to see through the twisted community that there is no escaping from. Like all of us, her life is what it is. She will forever be influenced by it but she has discovered that she can form her own opinions, make her own choices, and she is her own person. It is a lesson that we all need to learn."}, {"userName": "Robert Pajer", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/2961278-robert-pajer", "userReview": "Sheri Reynolds paints a vivid picture of \"Bible Belt Cultism,\" as seen through the eyes of a teen-age girl named, Ninah. The Church of Fire and Brimstone and God's Almighty Baptizing Wind is pastored by Ninah's Grandfather, Herman Langston, who, as Ninah says, \"Used the Bible, of course, but only the parts he liked. He had the habit of altering verses just a little to make them match his own beliefs.\" The church of about eighty members is composed mostly of Ninah's family and Reynolds, through Ninah, lets us view the constricted lives of the church members under the tyrannical rule of Grandpa Herman. Their loyalty to the dictatorial Grandfather is a sober reminder of the danger involved when charismatic individuals, manipulating the Scriptures, suppress the weak and shape their lives with false doctrines. The price is excessive for such manipulation and at the Church of Fire and Brimstone it is paid out in emotionally devastated lives. The characters are addictive, the narrative exquisite, and the plot captivating. Sheri Reynolds has written a powerful novel."}, {"userName": "Karen", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/9916919-karen", "userReview": "SPOILERS:This wasn't a book I wanted to savor, but along with some weaknesses, it definitely had its moments. There's a matter-of-fact line I found chilling, about women often dying in childbirth due to their boycott of doctors. The dunking and the rapture were also favorites, though I wondered if the latter was unintentionally funny. This book felt like a fairly convincing look at the inside of a religious cult, even if the language often wobbled."}, {"userName": "Brian Stump", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/46840460-brian-stump", "userReview": "the book had a really interesting story but ended with a bland ending. I was hoping the end would have been as surprising as the rest of the book."}, {"userName": "Tracy Sherman", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/7917746-tracy-sherman", "userReview": "I started this book with just one expectation, that I wasn't going to like it. I just finished a coming of age story set in the south that started off so promising and ended cliché and disappointing. In the beginning of this book it seemed like I'd be in for the same experience. Then about 20 to 30% into the book I found myself very engaged. The young protagonist has a very real voice, her grandmother and grandfather, the other leading characters of the book are also very interesting and well written. The grandfather runs a fire and brimstone Christian sect called, appropriately enough, \"The Church of Fire and Brimstone and God’s Almighty Baptizing Wind.\" There's no particular mention made of last two words of the church's name so I guess nobody got the joke but me.There's a pretty large congregation and everybody's related so at times it's difficult to realize who's being talked about and what their relationship is to everyone else, so it seems the auxiliary characters are all pretty much interchangeable. But when they move to a front position they are finely drawn, even if only for a paragraph or two. The language, although sometimes adjective heavy never feels forced, and the situations although many times outrageous seem believable in the context of this religious sect. And with what's going on in America about religious fundamentalism it makes this a very engrossing read. I was going to give The Rapture of Canaan three stars but as the narrative progressed and engaged me I realized how good this book is. Would I be remiss in saying it enraptured me?"}, {"userName": "Lowed", "userReviewDate": "May 27, 2010", "userURL": "http://www.goodreads.com/user/show/3100453-lowed", "userReview": "A book of fanatical religious zealousness with abuses, torture, and mind control. Well, this can be viewed as that, or this is a story of how an innocent girl tried to emotionally survive in this kind of control.Rich with symbolism, this story reads quickly and yet has depth and humor. The characters stayed with me long after the book ended. Well Nanna did, while I was deeply rooting for Grandpa Herman’s painful and brutal death."}, {"userName": "John Berney", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/46849334-john-berney", "userReview": "Seems like it will either deeply offend me, or be too full of irony to take seriouslyThis is too weird to willingly continue, and Oprah has bad taste.had to finish it, but did not want to. ode to the necessary evils in life"}, {"userName": "Payton Polakowski", "userReviewDate": "Feb 29, 2016", "userURL": "http://www.goodreads.com/user/show/46804496-payton-polakowski", "userReview": "Even though this book had its weird moments, it has been my favorite book yet and it was so hard to put down. All of the weird and awkward events just made me wanna read more!"}, {"userName": "Carrie Poppy", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/23693960-carrie-poppy", "userReview": "Good."}, {"userName": "Emma McKeon", "userReviewDate": "Feb 29, 2016", "userURL": "http://www.goodreads.com/user/show/46840323-emma-mckeon", "userReview": "This book was my favorite book so far, very interesting"}, {"userName": "Stephanie", "userReviewDate": "Feb 18, 2008", "userURL": "http://www.goodreads.com/user/show/918446-stephanie", "userReview": "Good. Mixes fundamentalist elements of The Chrysalids with sacred/bloody imagery of Toni Morrison’s Beloved. A little strange because of certain images of Jesus that are morphed into sexually charged adolescent dreams.SummaryNinah grows up in a community of extended family that centers around a fundamentalist church led by her Grandpa Herman. After her “prayer partner” James learns that she is carrying his baby he drowns himself rather than face Herman’s cruel punishments. Ninah is nearly cast out when the community learns she is pregnant out of wedlock. She claims the child is holy, born of God, and is “dunked” for her blasphemy in the same pond James drowned in. During her pregnancy she is placed in isolation where her only consolation is her “Nanna” who speaks frankly about both her distaste for Herman’s law and her uncompromising love for her husband. When Canaan is born, the community is shocked to see the “sign” of his hands, which are permanently joined in prayer. As the new “mother of God”, Ninah enjoys new freedoms, like cutting her hair and wearing James’s clothes. However, Canaan is given over to another couple who could not have children and who restrict Ninah’s corrupting visits.Herman has a stroke. Nanna cares for him, though he rarely recognizes her as his wife. He wanders away one day and the community thinks he has been raptured; they’ve been left behind. Then he returns. Ninah steals away with Canaan as the community erupts in confusion. Story ends with Ninah cutting Canaan’s palms apart, praising his normality."}, {"userName": "Ibis3", "userReviewDate": "Oct 27, 2011", "userURL": "http://www.goodreads.com/user/show/4093912-ibis3", "userReview": "My original review (24-3-05):'I had some major difficulties with the book though, for example: the narrator is supposed to be Ninah, but her voice as narrator (poetical, adult & educated) is completely different from her voice as a speaking character (dialectical: e.g. \"ain't\", \"don't reckon\", double negatives); in a related way, Ninah's almost uncanny insights seem too externally derived. I just can't see a 12-15 year old girl who lives in such an insular community having such an ability to be so objective about what she's been taught (even if what Leila says and what she experiences in school give her extra knowledge or ideas). Also, James' motivation was never really made clear. I'm sure that what he did would have been considered an ultimate sin, even worse than fornication. Wouldn't he have been more afraid of the consequences for that? I guess one could put it down to teenage confusion, not helped by having to sleep on a bed of thorns, or the knowledge of what they did to Ben.The strange mixture of sincere belief and hypocrisy of all the characters made the story intriguing, but at the same time made me a little sceptical. I found the writing to be a bit self-consciously pretentious at times (especially the opening & closing paragraphs which could have been edited out).However, all that said, it was fairly well written, the characters (especially Ninah and James) were well developed, and the plot & setting fascinating. There were parts of it I really enjoyed & it left me wondering what would happen next.'"}, {"userName": "Tiffany", "userReviewDate": "Sep 16, 2007", "userURL": "http://www.goodreads.com/user/show/337296-tiffany", "userReview": "I actually liked this book a lot I would have liked it more but I wasn't so big on the ending. There was quite a few very interesting chapters in a vague disjointed kind of way. It's the story of a young girl who finds herself in a bit of a position after she gets pregnant. She lives within a cultish community that is so far overboard they are fanatics lead by Ninah's grandfather who wasn't the same when he came back from war. It's got both interesting little sides stories in it, as well as the main story, and her future. The author did everything she could to shock you while trying to make Ninah feel like it was completely normal... but she almost did it to well. The story is past the unbelievable line into ridicules by the end. Which is a shame. There was one thing from the book though I've taken with me and deeply thought about upon completion of it. Being a girl who loves to read stories about revenge... I liked this part of the book best. \"Grudges are bad things, Ninah,\" she said at last. \"There's only so much room in one heart. You can fill it up with love or you can fill it with resentment. But every bit of resentment you hold takes space away from the love. And the resentment don't do no good noway, but look what love can do.\""}, {"userName": "Emily", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/981388-emily", "userReview": "I think I give everything three stars. I think the star rating system is messed up. But, that's a soapbox discussion for another day. I enjoyed The Rapture of Canaan. Reynolds writing is top notch. It is however, very Oprah book club-- well written, well drawn characters, who go through a whole lot of crud. The good thing is the crud moves along quickly in this one. I didn't feel like I was bogged down forever, and looked forward to opportunities to read. On the flip side, I wish Reynolds would have fleshed things out a bit. I understand the main character is meant to be seen as brainwashed and naive, and that's ok, but she seems to remain naive, despite her transformation. Also, the surrounding characters seem thin. So, overall I enjoyed it, but found it lacking somehow."}, {"userName": "Daniel Simmons", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/5904365-daniel-simmons", "userReview": "After a middling beginning (wait, is that an etymological contradiction?), this book picked up steam, then lost some steam, then became downright steamy, then doused itself with cold lake water, then I give up on this metaphor. It was an easy read but seldom a very compelling one, partly because I found the antagonist (Grandpa Herman) unconvincing and that made the whole frame of his religious fringe community unconvincing as well. Overall: Not bad, but nothing special. Probably best suited for YA female readers."}, {"userName": "Laura Lee", "userReviewDate": "Sep 23, 2012", "userURL": "http://www.goodreads.com/user/show/8630626-laura-lee", "userReview": "One of the best books I have ever read! It was loving and heartbreaking and inspirational. Ninah was born into a community of holy rollers, with strict rules and regulations. As she falls in love, she begins to question the way things are done. I fell in love with Ninah and wanted her to come out whole. She's a wonderful, three dimensional character. I cried at the end, when she is finally released in her love. Beautifully written. I would highly recommend this book to anyone."}, {"userName": "Lizzy Warfield", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/46849332-lizzy-warfield", "userReview": "This was a really interesting book to read, and I loved that it was through the eyes of a young person, who was being forced to be something she wasn't while all the while defying it all, and becoming her own person anyway. Truly a very good book, I would recommend it to anyone looking for a good, simple, but also very deep read."}, {"userName": "Amy", "userReviewDate": "May 22, 2015", "userURL": "http://www.goodreads.com/user/show/782103-amy", "userReview": "A fast read and (mostly) an engrossing one, although there are some melodramatic parts (weaving a cross? barbed wire? whut?). I was a bit sorry when Ninah fell in love, though; I could tell the rest of the story would be centred around that, and I found the beginning and its portrayal of the cult more interesting."}, {"userName": "William", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/6102247-william", "userReview": "This was pretty good. Again, I wasn't sure if it was supposed to be \"YA fiction\" or not, so I gave it the benefit of the doubt. It's probably not a great grown-up book. Too heavily symbolic and ultimately unsatisfying for that, but it should be OK young adult."}, {"userName": "Sara", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/1555901-sara", "userReview": "More of a 3.5. Enjoyed its subtle and not-so-subtle creepiness, and that it never tiptoes around religious misogyny, but it does take an awfully long time to get where it's going. It reminded me of a favorite YA outing, The Miseducation of Cameron Post."}, {"userName": "Beeper Baswell", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/46804545-beeper-baswell", "userReview": "This is the weirdest book I have ever read, but it was ok."}, {"userName": "Allie Brayton", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/46849289-allie-brayton", "userReview": "Let's just say this book is very interesting. I couldn't put it down since I just kept wanting to know what twisted thing would happen next!!"}, {"userName": "Syri Ammon", "userReviewDate": "Mar 11, 2016", "userURL": "http://www.goodreads.com/user/show/46826929-syri-ammon", "userReview": "Oddly enough, I loved this book. It might have been really messed up and crazy, but I think that's what made it so great for me."}, {"userName": "Annie Hoang-Pham", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/55183345-annie-hoang-pham", "userReview": "(3.75) I LOVED the first half of the book. Then it started becoming too much. I felt like new elements kept getting added and added to the book to the point where I didn't want to pick up the book anymore. I thought the book could have been better if there were less crazy things going on and more of a focus on the bigger events."}, {"userName": "Nicole", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/1944553-nicole", "userReview": "The Rapture of Canaan revolves around the cult-like community of the “Church of Fire and Brimstone and God’s Almighty Baptizing Wind”. Ninah, the granddaughter of the leader and founder of the church, becomes involved with James, the step-son of her sister. She becomes pregnant and the community begins to unravel. While it was somewhat interesting (as well as revolting) reading about such a brain-washed and extremist community, the story itself was unconvincing. Ninah seems to understand the absurdity of the religious fanaticism her grandfather has created, yet the author still wants her to have some kind of spiritual experience/transformation. This would be fine if I knew what it was or what purpose it achieved. Instead it was vague and weird."}, {"userName": "Tiara", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/2426502-tiara", "userReview": "This is the story of Ninah Huff, the granddaughter of the founder of the Church of Fire and Brimstone and God's Almighty Baptizing Wind. Say that three times fast. I dare ya! Basically, the people of the congregation spend their time striving to do the \"Lord's good\" while denying themselves earthly pleasures (No TV, very little free time, you get the picture) because they don't want to be stuck on earth when the good Lord comes back. To avoid earthly sins, the members of the church are known to inflict pain upon themselves such as sleeping on nettles or walking on pecan shells. The story is also told from Ninah's POV. She's a young girl struggling with religion and life in general. She questions what she is being taught in her community, but at the same time, she feels ashamed and guilty of the changes going through her -- particularly her attraction to a boy named James. Despite, Ninah and James's efforts to avoid temptation and sin, the two come together in the biblical sense, and the outcome tears their little community apart.I thought this was a very beautiful story following the trials and tribulations of not only a teenager growing up under such strict beliefs but the desires of the heart and flesh, the questioning of religious beliefs. Ninah makes such a transition in this story. She goes from a timid teenage girl to a young woman who knows her heart and believes that God's love comes from more than just pain. She finds strength when so many obstacles stood in her way. She forces a community to change, to face it's hypocrisy, and above all, Ninah finds a sense of self.I also loved the characters in this book. They were so beautifully drawn out. You could imagine them vividly. Everyone from Ninah to Corinthian, the woman who the community considers a backsliding whore. You feel for these people. You can probably think of people who share some similar attributes. Maybe not as religious, but we all know drama-queens and people who strive to please others. Ninah's story is so heart-wrenching, but beautifully written. I could not put this book down, and I already want to read it again. All I have to say to that is, \"Whee, Jesus.\""}, {"userName": "Kelley  C", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/5230709-kelley-c", "userReview": "Synopsis: Ninah is a member of a cult-like \"church,\" the awesomely-named Church of Fire and Brimstone and God's Almighty Baptizing Wind. Basically the church members are all related and the women can't cut their hair, have to wear dresses, condemn the sinners who aren't part of their church, use pain as punishment, etc. Common punishments are beatings, sleeping on nettles, and sleeping in an open grave. There are characters named Mustard and Barley.MAN, I love this book. This is an old favorite, but I hadn't read it in a few years. Ninah slowly realizes that these people are insane, and when something happens that she gets in trouble for, she's got to figure out how to avoid punishment - not in a wimpy way, she actually thinks that the church leaders will kill her.I really liked the look into an INSANE culture, and I looooved Ninah's grandmother and her relationship with Ninah.This is not a book about religion, really. She's TRYING to be good (according to the crazy Church), but when she becomes closer to James, technically her nephew by marriage, she realizes that while both of them try to follow the strict rules of their community, neither of them really believes some of the craziness they're taught. So together they try to deal with it. Then some STUFF happens. And it is awesome.*I read this in audiobook form."}], "description": "Oprah Book Club® Selection, April 1997: Members of the Church of Fire and Brimstone and God's Almighty Baptizing Wind spend their days and nights serving the Lord and waiting for the Rapture--that moment just before the Second Coming of Christ when the saved will be lifted bodily to heaven and the damned will be left behind to face the thousand years of tribulation on earth. The tribulation, according to Grandpa Herman, founder of Fire and Brimstone, will be an ugly time: \"He said that we'd run out of food. That big bugs would chase us around and sting us with their tails . . . He said we'd turn on the faucet in the bathroom and find only blood running out . . . He said evil multitudes would come unto us and cut off our limbs, and that we wouldn't die . . . And then he'd say, 'But you don't have to be left behind. You can go straight to Heaven with all of God's special children if you'll only open your hearts to Jesus . . .'\"  Such talk of damnation weighs heavy on the mind of Ninah Huff, the 15-year-old narrator of Sheri Reynolds's second novel, The Rapture of Canaan. To distract her from sinful thoughts about her prayer partner James, Ninah puts pecan shells in her shoes and nettles in her bed. But concentrating on the Passion of Jesus cannot, in the end, deter Ninah and James from their passion for each other, and the consequences prove both tragic and transforming for the entire community.  The Rapture of Canaan is a book about miracles, and in writing it, Reynolds has performed something of a miracle herself. Although the church's beliefs and practices may seem extreme (sleeping in an open grave, mortifying the flesh with barbed wire), its members are complex and profoundly sympathetic as they wrestle with the contradictions of Fire and Brimstone's theology, the temptations of the outside world, and the frailties of the human heart.", "title": "The Rapture of Canaan", "url": "https://www.goodreads.com/book/show/5180.The_Rapture_of_Canaan", "average": 3.81, "cover": "https://images.gr-assets.com/books/1442420479l/5180.jpg", "reviews": 796, "authors": [{"url": "https://www.goodreads.com/author/show/3520.Sheri_Reynolds", "name": "Sheri Reynolds"}], "type": ["Fiction", "Religion"], "outlinks": ["http://www.goodreads.com/book/show/5180.The_Rapture_of_Canaan", "http://www.goodreads.com/book/show/1001966.Rapture_of_Canaan", "http://www.goodreads.com/book/show/94564.A_Gracious_Plenty", "http://www.goodreads.com/book/show/70115.Firefly_Cloak", "http://www.goodreads.com/book/show/318494.Bitterroot_Landing", "http://www.goodreads.com/book/show/5043829-the-sweet-in-between", "http://www.goodreads.com/book/show/14596142-the-homespun-wisdom-of-myrtle-t-cribb"]}