{"ratings": 1195, "userreviews": [{"userName": "Ahmad Sharabiani", "userReviewDate": "Aug 15, 2016", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Das lachein am fusse der leiter = The Smile at the Foot of the Ladder, Henry MillerFirst published in 1959, this touching fable tells of Auguste, a famous clown who could make people laugh but who sought to impart to his audiences a lasting joy. Originally inspired by a series of circus and clown drawings by the cubist painter Femand L ger, Miller eventually used his own decorations to accompany the text in their stead. \"Undoubtedly,\" he says in his explanatory epilogue, 'it is the strangest story I have yet written. ... No, more even than all the stories which I based on fact and experience is this one the truth. My whole aim in writing has been to tell the truth, as I know it. Heretofore all my characters have been real, taken from life, my own life. Auguste is unique in that he came from the blue. But what is this blue which surrounds and envelopes us if not reality itself? ... We have only to open our eyes and hearts, to become one with that which is.\"تاریخ نخستین خوانش: پانزدهم ماه آگوست سال 2002 میلادیعنوان: لبخند در پای نردبام؛ نویسنده: هنری میلر؛ مترجم: شیرین بنی احمد؛ تهران، نشر گفتار، 1380؛ در 72 ص؛ مصور؛ شابک: 9645570662؛ چاپ دیگر: تهران، ماهی، 1387؛ در 73 ص؛ شابک: 9789642090174؛ موضوع: داستانهای نویسندگان امریکایی قرن 20 ملبخند پای نردبان، داستان کوتاه جذاب و عجیبی است. هنری میلر خود در پی نوشت کتاب آورده است که داستان را به سفارش فرنان لژه نوشته تا به همراه چهل تصویر از دلقکها و سیرکها چاپ شود؛ یعنی درست عکس کاری که در تولید کتابهای مصور انجام میشود. هنری میلر چنان که خود میگوید: هر یک از عناصر اصلی داستان را از یکی از نقاشان معاصر وام گرفته است.؛ دلقک را از: ژرژ روئو، فرشته را از: مارک شاگال، نردبان و ماه را از: خوان میرو، و به کمک آنها دلقک سرشناسی به نام آگوست را خلق کرده است که در برنامه پرطرفدار خود در سیرک، پایین نردبانی که به یک ماه وصل شده به سقف چادر منتهی میشود، غرق در خیالات دور و دراز به انتظار مینشیند تا اسبی سفید با یال بلندی که تا کف نهرهای طلا میرسد از راه برسد و پوزه گرمش را به پشت گردن او بمالد و او را به خود بیاورد. ا. شربیانی"}, {"userName": "إلِـيْ", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/28120753", "userReview": "نعيش، نقضي عمرنا بأكمله في البحث عن السعادة. نتوهّم أنها في إسعاد غيرنا، وأحيانًا في اعتزال غيرنا.والحقيقة أننا لن نجد السعادة ما دامت لا تنبع من داخلنا.نحن لا نحتاج سوى أن نبحث بداخلنا، أن نحيا لأجل أن نعرف أنفسنا حق المعرفة، أن نعرف من نحن، ماذا نريد، ماذا يجب أن نفعل!أول تجربة مع هنري ميلر، تبيّن لي منها مدى ما يتحلّى به من الفلسفة، فلسفة النفس الانسانية، وفلسفة الحياة عامةً.الرواية رغم بساطتها تمدّ إليك بأغلى نصيحة يمكن أن تهبك السعادة.. \"أن تكون نفسك .. نفسك وحسب، لهو شيء عظيم \"  فقط قل دائمًا ..  \"لا أريد سوى أن أكون نفسي، أن أكون سعيدًا لا تختبئ في قناع آخرين، ولا تجعل جهدك كاملًا فقط لمتعة الناس وسعادتهم.لا تعِش سوى لأجلك أولًا وقبل كل شيء."}, {"userName": "Lynne King", "userReviewDate": "Sep 13, 2014", "userURL": "http://www.goodreads.com/user/show/15736557-lynne-king", "userReview": "Henry Miller has for me always been a veritable, serendipitous surprise. Some of his books have rather shocked me despite their literary excellence, nevertheless I grew to love his travel books and letters and so when I was recommended this very short fable, I knew in my heart that I would love it and I was indeed proved right in my thoughts and expectations.Miller always admitted that his books were based on “fact and experience”. But when he came to this book about the life of a clown, Auguste, he openly stated:“My whole aim in writing has been to tell the truth, as I know it. Heretofore all my characters have been real, taken from my life, my own life. Auguste is unique in that he came from the blue. But what is the blue which surrounds and envelopes us if not reality itself. We invent nothing, truly. We borrow and recreate. We uncover and discover. All has been given as the mystics say. We have only to open our eyes and hearts, to become one with that which is.”What a gem of a book this has turned out to be. It’s very short, only forty–nine pages but it’s poetic; full of love and sheer artistry and I was enamoured with it. Miller always associated himself with the life of the clown and I applaud him. Bravo for the pleasure that he gives to mere individuals such as myself."}, {"userName": "Mohammed Orabi", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/22981697-mohammed-orabi", "userReview": "هل سبق وان سألت نفسك من قبل إذا كنت فعلا إنسان سعيد ام لا ؟ من المؤكد انك فعلت هذا مراراً فلا يوجد أسهل من طرح التساؤلات لكن يبقي الجانب الاصعب وهو الاجابة .. هل استطعت ان ترد على هذا الخاطر وتقول نعم انا انسان سعيد بيقين تام ؟ اذا كانت الاجابة نعم فاتمني ان يديم الله عليك هذا الشعور .. اما لو كانت الاجابة لا .. فافعل مثلي واستمع لتلك النصحية ربما تكون نقطة تحول وبداية طريق البحث عن نفسك اولا والتى بمجرد التعرف عليها ستجد السعادة بجوارها وحاضرة معها \" وانت حاول ألا تكون شيئاً واحداً أو آخر ، لا تكن عظيماً أو صغيراً ، ذكياً أو أخرق ... هل تفهمني ؟ افعل كل ما يأتي إليك .. افعله بنية حسنة .. ذلك لأنه ليس هناك أي شئ غير مهم .. لا شئ ، وبدل الضحك والتصفيق ستتلقى الابتسامات ، ابتسامة صغيرة دالة على الرضا .. هذا كل شيء ولكنه يعني كل شئ .. تجول وقم بالأعمال القذرة ، أرح الناس من أعبائهم .. هذا يسعدهم ، لكنه يجعلك أكثر سعادة .. \" برجوع الى العمل استطاع الكاتب ومن خلال عدد صغير من الصفحات ان يقدم حياة اوغوست المهرج الذي ظل يبحث عن السعادة ولم يجدها من خلال شهرته فقرر ان يعود الى حياته العادية وان يقوم باعمال صغيرة لا تميزه عن غيره .. لا يهدف سوى الى تقديم يد العون الى من حوله الا ان يشاء القدر ويمرض انطوان مهرج الفرقة فيضطر اوغوست ان يقوم بتعويض غيابه ليجد نفسه مرة اخري عائدا الى اضواء الشهرة حتى ولو كانت من خلال شخصية اخري غير شخصيته .. وحين ادرك انه سعادته في مكان اخر وقرر ان يذهب اليها لم يعطيه الوقت الفرصة الكافية بان يلقها .. ولكن يكفيه انه مات مبتسما راضيا .. نهاية قد تراها حزينة الا انى اراها انها مجرد بداية واتفق مع الكاتب فى تلك النقطة التى ذكرها فى نهاية خاتمة الكتاب .. موت اوغوست قد يكون بداية طريق اى قاري لتلك القصة من اجل السعي وراء سعادته التى يفتقدها.."}, {"userName": "Luís C.", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "Book composed of two medium-quality novels. One much more than the other.The Smile at the Foot of the LadderHenry Miller, a self-taught American author whose avant-garde writings, satirical or autobiographical works, have marked their seals in the twentieth century, committed, in a completely different genre, A Smile at the Foot of the Ladder, a fairy tale with some Philosophical approach that addresses images and appearances, authenticity, the search for the true self and thus happiness through the theme of the clown. A simple story, that of the August clown whose talent and the development of a number at the bottom of a \"scale stretched towards the moon\" make him famous until the intolerable demands of the public make him give up pleasing. The replacement of Antoine, an ordinary clown, will put him face to face with a cruel choice and his own reality.\"The clown is the poet in action,\" says Henry Miller, \"he is the story he plays\", \"between the world and him laughs\", \"a laugh, silent, without gaiety\" self-deprecating laughter \"born of tears\".MolochMoloch lives in America in the 1930s, marked by the arrival of thousands of Jews, who seemed to guess the Second World War. And it is without false moralism that Moloch (behind him, Miller?) assumes that in America the Jews were not welcome. He calls them \"pigs\" and says that this is the main reason to dislike them. But who really likes Moloch? And who does like him? Moloch will find out if he wants to save. As the clown Augustus will also discover the smile that will bring his life back. Or, perhaps, immortality.3 1/2 Stars"}, {"userName": "Henry Martin", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/14734360-henry-martin", "userReview": "Amidst the millions of words of autobiographical writing, stands this lonely book, or rather a novella, The Smile at the Foot of the Ladder, Miller's one and only composition that drew inspiration \"from the blue\", as Miller himself put it. However, do not be mistaken...this novella shines with brilliance. Apart from the exceptional writing Miller's readers are accustomed to, this story is far more complicated than any other novella I had read, ever. Auguste, the centerpiece in this intricate work, is the embodiment of human suffering, a man who carries out his duty until the last breath. His duty being to bring a lasting joy to his audiences. For Auguste, there is nothing easier than to make his audience smile, for he is a clown, but the brief moment when he is on stage is not what he is after. His aim is far superior - Auguste's desire is to unite people with endless joy, the kind that comes only through God himself. But this task, this task bigger than any one human, was a difficult one.When Auguste takes his \"trick\" to a new level, the audience, as humans tend to do when faced with something they do not comprehend, went up against him. Auguste abandoned the circus and took to wandering. Nevertheless, a man can escape his surroundings, but a man cannot escape himself. For Auguste, his shadow was always with him, in him, unsatisfied, longing. And so, after a nightmare where Auguste was faced with end of his life, he stumbles upon a circus at the edge of town. His past, his shadow, catches up with him, and Auguste is given a new chance to fulfill his task when one of the clowns falls ill and the circus needs a replacement. Auguste agrees, partly because he wants to relive his old life, partly because he wants to kill his old life off by making his \"persona\" more famous than he ever was as himself. With great success, Auguste is back in his element, until the clown whom he replaced suddenly dies. It is then, that August discovers reality. The reality of himself, the world, the humankind. The reality that joy is much more than the limited experience he allows his audiences within the boundaries of the circus. Auguste dives deep into himself, into the darkness of the world, and he finds the light he was searching for all his life, becoming one with it.The intricacy of this story, the world in which we live, filled with suffering and joy, the two primary contradicting emotions, is so wonderfully portrayed here. Auguste, complicated like life itself...a man, strong and weak, but above all, vulnerable for he is too human. One of the most fascinating books ever written. Do not be fooled by its size...it will sneak up on you from nowhere, without warning. One of the best works by Miller."}, {"userName": "Nahed.E", "userReviewDate": "Jan 04, 2015", "userURL": "http://www.goodreads.com/user/show/37363150-nahed-e", "userReview": "\" ولكن لماذا عليك أن تبدأ من جديد ؟ مادمت قد حققت شهرة كبيرة ؟- لن تفهم ولكني سأقول لك الكلام نفسه .. لأنني اريد أن أكون سعيداً هذه المرة- سعيد ؟؟ لا افهم ! لماذا سعيد ؟- لأن المهرج لا يكون سعيداً عادة إلا إذا كان شخصاً آخر . لا أريد أن أكون سوي نفسي \"يقول هنري ميللر :\"السيرك هو ساحة صغيرة من النسيان . مغلقة . يساعدنا لفترة علي أن نفقد أنفسنا ، ونتلاشي في الدهشة والربكة . أن يقتلنا اللغز . أن نخرج منه بدوار .. حزاني ومرعوبين من وجه العالم اليومي .. ذلك اليوم الذي نعرفه جيداً .. وهو العالم الوحيد الذي لدينا ! فنحن دائماً نموت ونحن نصارع لكي نولد ، لم نكن ابداً ، ولن نكون ، نحن دوماً صيرورة ، دوماً مفصولون ومبعدون إلي الأبد في الخارج \"هنري ميللرابتسامة عند قدم السلملم أتوقع إطلاقاً أن تكون هذه الرواية بهذه الجودة وهذه البراعة وهذه الفلسفة ..رغم أن عدد صفحاتها لا يتجاوز 60 صفحة تقريباًولكنها ببراعة المؤلف الذي أعترف إنني لم تعجبني كثيراً نوعية كتاباته التي اُشتهر بها ..هنري ميللر .. العدمي .. المُتعب دائماً .. هنا من وجهة نظري قدم رواية من أجمل الروايات الفلسفية ..فهنا .. رواية عن مهرج يُضحك الناس وهو يبكي .. مهرج سئم وتعب ومل من أن يكون واحداً غيره كل مساء ..فتخيل .. إنك مرغم علي أن تكون غيرك كل مساء ..أن ترتدي قناعاً باسماً وترسم بيديك ملامح ضاحكة وقلبك يبكي وعقلك مُرهق من الأسئلة المُتعبةفيقرر مهرجنا أن يكون نفسه ..فيترك العمل .. وتجبره الظروف بعد ذلك أن يعود للسيرك مرة أخري ليعمل بدلاً من صديقه المريض أنطوان ..فيخرج للناس علي أنه أنطوان وينجح ويشتهر بصفته أنطوان .. !ولكنه إلي الأن ليس نفسه ..لا يشعر بأنه هو هو .. إنه اثنينمهرج يحيا بقناع زائف من ناحية ..و يحيا كأنطوان من ناحية أخري !!فمتي يكون نفسه ؟؟ثم فجأة يموت أنطوان فما الحل .. ؟هل يُكمل بصفته أنطوان المشهور الناجح ؟؟أم يعود لشخصيته الأولي ؟؟؟اسأل نفسك عزيزي القارئ ..إذا كان الناجح يستلزم أن تكون غيرك .. هل كنت لتختار أن تصبح غيرك ؟؟؟!!"}, {"userName": "mai ahmd", "userReviewDate": "Dec 29, 2011", "userURL": "http://www.goodreads.com/user/show/7154074-mai-ahmd", "userReview": "صنفها الكاتب على أساس إنها قصة وهي قصة مفعمة بالرمز الفلسفي في الوجود وقيمة الحياة كتبها ميلر على إثر طلب من فرناند ليجر لترافق السلسلة المكونة من أربعين صورة عن المهرجين وعالم السيرك والتي كان يعدّها في تلك الفترة ويقول هنري أنه على الرغم من الوقت الطويل الذي استغرقه كتابة هذه القصة إلا إنها لم ترق لليجر .. لا يهم المهم إنها راقت لي ! ميلر : السيرك هو ساحة صغيرة من النسيان , مغلقة , يساعدنا لفترة على أن نفقد أنفسنا , ونتلاشى في الدهشة والبركة , على أن يخطفنا اللغز , نخرج منه بدوار , حزاني ومرعوبين من وجه العالم اليومي , ولكن العالم اليومي , القديم , العالم الذي نتصور أننا نعرفه جيدا فحسب , هو العالم الوحيد , وهو عالم سحر , سحر لا ينتهي , مثل المهرج نمر عبر حركات , نحاكي إلى الأبد , وإلى الأبد نؤجل الحدث المهيب , ذلك إننا نموت ونحن نصارع , ونحن نصارع كي نولد ,لم نكن أبدا , ولن نكون نحن دوما في صيرورة , دوما منفصلون ومبعدون إلى الأبد في الخارج !القصة تحكي عن أحد المهرجين الذي وصل أعلى حد في سقف الشهرة لكنه تخلى عنها فجأة لأنه شعر أنه كان خارج جلْده وإن هذه الحياة ليست حياته فودّع كل هذه الأضواء وأصبح مجرد عاملا في السيرك ينظف روث الخيول , يقوم بأعمال توفر له فقط لقمة العيش , غيرأن المهرج البديل والذي كان لا يتسم بأي عامل من عوامل النجاح يقع أسير المرض ويتولى أوغست بطل القصة عمل التهريج من جديد لكنه في هذه المرة يلبس قناع زميله المريض أنطوان ويلعب نفس الدور السابق الذي أبعده عن الأضواء , لكن المفاجأة أن المريض حين علم أن أوغست يلعب دوره بنجاح ساحق حتى أنه أصبح حديث الناس والجرائد أصيب بسكتة قلبية , وهنا توقف أوغست من جديد ليعيد التفكير في ماهية حياته ,ويترك السيرك مودعا حياة التهريج في رحيل مؤثر وابتسامة عريضة ملائكية وقمر أصبح مرئيا في السماء ..يقول ميلر أنه لم يخترع تلك القصة من مخيلته بل إنه أراد أن يقول الحقيقة فقط : لقد رويتها كما شعرتُ بها , لقد كشفت لي نفسها قطعة قطعة , إنها لي وليست لي وهي أغرب قصة كتبتها إنها ليست وثيقة سوريالية البتة !كنتُ ابحث عن كتاب يسليني كتابا يزيل منى هذه الرغبة التي تطل علي بين وقت وآخر لتمد لي لسانها الرغبة في عدم القراءة , ووقتها أبحث عن كتاب خفيف أجزي به الوقت لكن ما وجدته في قصة ميلر اختلف تماما و شدّ عزيمتي إلى القراءة أسلوب ميلر شيق جدا والمعاني الفلسفية التي زخرت بها الرواية شفافة ورقيقة حتى إنني شعرت في المشهد الذي يحوي تلك الابتسامة أنني خفيفة كريشة !"}, {"userName": "طَيْف", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/7810481", "userReview": "تركت \"اسمي أحمر\"...فمزاجي لم يكن مناسبا لمتابعة تلك الأحداث وتواترها على أكثر من لسان...وبحثت عن كتاب خفيف طمعا في استعادة الرغبة بإكمال الكتاب...وانتقيته من مكتبتي الإلكترونية بسبب عدد صفحاته تحديدا لأكمل حصتي اليومية المعتادة من القراءة...وإذا باب واسع للخيال والتأمل يفتح أماميصفحات قليلة...تبعث على التفكّر...سطّرها ميلر -الذي ألج عالمه للمرة الأولىالعالم يبدو مختلفا منذ السطر الأول في الرواية...تلك الكلمات التي تقول لك بكل قوّتها...هذه رواية تستحق أن توغل فيها ولا تتركها حتى النهاية...فالحدث يبدأ منها بلغة شفافة حالمة...بين سماوات يقف أوغوست عند قدم سلمها...بابتسامة بيضاء...مراوغة...منفصلة عن الداخل...مكبّرة...ثابتة...وكل ما حوله يتحرك في دائرة من السحرأوغوست المهرج...الذي يجبره عمله على رسم ابتسامة على شفتيه تنتقل لجموع مشاهديه...يريد أن يصبح شيئا أكثر...بل شيئا مختلفا...ربما يتوحد فيه الداخل والخارج...وبحزنٍ عميقٍ...يترك السيرك ويلجأ للتجوال بحثا عن سعادة افتقدها منذ زمن...فقد اكتشف فجأة بأنه قد فرغ من الداخل...ليعود للسيرك عاملا عاديا مع إحساس مضاعف بالحريّة وابتسامات امتنان جددت دفق قلبه...ويُمنح فرصة أخرى ليعود بموهبته في إضحاك الناس على إثر مرض المهرج أنطوان...يأخذ مكان هذا المهرج الذي لا يملك اسما ولا شهرة ولا موهبة بحجم موهبته ويلعب دوره...فيموت أنطوان بسكتة قلبية لما يدرك حجم قدرة أوغوست...فيقف أوغوست مع نفسه متأملا للمرة الثانية فإنك: \"لا تحتاج إلا إلى قليل من الوقت لجعل نفسك نكرة! هذا ما هو نحن-نكرة. والجميع في الوقت نفسه. إنهم لا يصفقون لنا وإنما لأنفسهم\"\"أن تكون نفسك، نفسك فحسب، لهو شيء عظيم\"فيترك السيرك ويبدأ من جديد...لأنه لا يريد أن يكون سوى نفسه...وينتهي نهاية مفاجئة...أترك تفاصيلها تشويقا لمن يرغب بقراءة الرواية...وهي الجزء الأكثر صعوبة في كتابته لميلر والذي أعاد كتابتها مرات ومرات...فقد أراد لنهاية أوغوست أن تكون بداية...وأن تضئ نهايته الطريق لآخرينمن أكثر فقرات الرواية التي استوقفتني...وهي شاهدٌ على تأملات ميلر:حكيت كثير؟؟!!كيف لو كانت الرواية أكثر من 62 صفحة؟؟!!0إنه كتاب يفتح شهيتك للقراءة والتأمل والتخيّل...والحديث أيضاولمنحه نجمة إضافية...استحقها حديث ميلر عن قصته في الصفحات الأخيرة"}, {"userName": "Siham", "userReviewDate": "Dec 09, 2012", "userURL": "http://www.goodreads.com/user/show/10450636-siham", "userReview": "قصة عبقرية .. نجحت في تجميع تركيزي الذي كان قد ضاع مني منذ بدايةا الشهر ( دجنبر ) .. تفاعلت معها لحد بعيد .. يعجبني هذا النوع من الكتابات التي تحرك خيالي , و تنشط خلايا دماغي .. تجعلني احس ان كل جزء في كياني يتفاعل معها بطريقة ما ... توفقت في الحفاظ على الحياد وفي التوحد مع الرواية بكياني في ان واحد .. قمت بالاسقاط , وجدت نفسي هناك بين سطور عديدة .. نعم جزء مني في اوغست .. والاخر في انطوان .. جزء في كل شخصية حتى الثانوية منها .. كنت انا ثم اختفت تلك الانا لأحل في ذلك المسرح .. تلك الحشود .. ذلك الفرس .. اولئك المهرجين .. تلك العربة .. كنت الصمت .. وكنت مجموعة الصيحات والهتافات.القصة تحكي صراعا ذاتيا حادا يحاول فيه البطل ان يتوصل الى دوافعه الحقيقية التي تختفي وراء اختياراته و أفعاله .. فتجده يتفاجأ كل مرة بأنه كان يصنع لنفسه اوهاما , وجد نفسه يتطلع الى رضى الاخرين عنه ... ه ,  فلكي تحقق هذا المبغى يجب ان تكون شخصا غير ما انت عليه , هذا ما تعتقده دائما .. ثم تدرك انك كنت واهما .. ان ذلك القناع كان يجعل منك شيئا نمطا , نكرة , مكررا , مستهلكا , نسخة .. تصبح مجرد شيء بالنسبة للاخرين ولا شيء بالنسبة لذاتك .. فحتى اولئك الذين يصفقون عندما تتوهم انك أثرت اعجابهم وكسبت رضاهم انهم لا يفعلون ذلك لاجلك , انهم يصفقون لانفسهم .. لا أحد يفعل شيئا من أجل أحد ..ثم يستيقظ البطل من اوهامه ويصرخ في أعماقه : ه ان تكون نفسك نفسك فحسب لهو شيء عظيم , اه هذه هي الخدعة الاكثر صعوبة , وهي صعبة فقط لانها لا تنطوي على جهد ا و أكثر ما يحبطنا , ما يهبط بنا الى القاع سعينا الدائم الى الكمال , الى فعل شيء عظيم , قول شيء عظيم , ترك انطباع عظيم ... سعي تافه ويائس الى المستحيل , يجعلك ترتد مسافات الى الوراء حتى لا يكاد يفصل شيء بينك وبين العدم . د ..فنفر البطل من تلك الدوافع التافهة ورحل بعيدا عن محيطها المحفز عندما احس بكذبها و لا جدواها .. عاد الى ذاته .. ا .. ل فلا ملجأ يعود اليه الانسان ويجد فيه الامان الذي ينشده غير ذاته , يجد في داخله عالما لا متناهي من المعاني والحقائق .. تكشف عنه الحجاب الذي سميناه \" الواقع \" , فيرى الوضوح والبساطة متجسدان ... الحقيقة خالصة .. حقيقة الإنسان ..  وقمة الادراك .. ان تعي في الاخير ( وليس في البدئ , لانه لو كان كذلك لربما انتهجنا طرقا اقصر وغير ملتوية ) بدوافعك الحقيقية .. انه الجحيم نفسه ! ! ثم عاد مجددا , هذه المرة حاول ان يتغلب على انانيته , ان يتوقف عن سعيه العبثي وراء تلك النشوة الوهمية , نشوة المجد , تقدير الذات من خلال الانطباع الذي يتركه الاخرون , اولئك الذين لا نتوقف عن تأليههم . فحاول ان يقوم بأفعال غيرية خالصة يتجاوز فيها ذاته , او هذا ما اعتقده , \" \" انني اقدم له دفعة قليلة فحسب , الحياة مليئة بالخدع الصغيرة التي يجب ان ننتفع منها , لا احد يذهب هناك وحيدا دون مساعدة \"ه ولكن هيهات .. هل نستطيع بحق انكار ذواتنا من اجل الاخر ؟ اليس الامر فيه انانية , ذاتية مخفية .. ؟ ماذا تنتظر من مساعدتك للاخر ؟ هل تستطيع بحق ان تقف دون ان تأمل شيئا ؟ ان كنت حقا بهذه اللامبالاة بنفسك ؟ ما الذي دفعك لمساعدته ؟ ان أحسست فقط بالسعادة من اجله فانك هنا تحقق خدعة جلية .. انت تتوقع سعادتك من خلال سعادة الاخرين .. انت شديد الحرص على ذاتك في الوقت الذي تتوهم فيه انك تدوس عليها وتمضي الى الاخر ... الاخر ليس الا مراة لذواتنا ا .. نرى فيها نقائصنا , حاجاتنا ... ثم تتحول إلى امتداد لها . نحن لا نقترب من شيء او احد لا نرى فيه شيئا منا .. شيئا نتطلع اليه من اجلنا .. نعم مجرد الشعور بالرضى .. هي انانية ما بعدها انانية .. اذا كنت حقا تدعي انك تتجاوز ذاتك من اجل الاخر .. لا تنفعل .. لن تقدر .. لان ذاك الانفعال ذاته .. تلك المشاعر التي نتغذى عليها هي دوافعنا .. نندفع بشعور الى شيء من اجل تحقيق شعور اخر .. فتصبح الاشياء والافعال والاخرون مجرد قنوات نستجلب من خلالها المشاعر التي تغذي انانيتنا .. انانيتنا التي تحركنا مختفية أحيانا في اكثر الاغطية سمكا \" الغيرية الكاذبة المخادعة \" نعم الانسان كائن من لحم ومشاعر مختلطة تتفاعل وتولد مشاعر اخرى أما الإختيارات والأفعال فهي فقط ترجمة سيئة لهذه الأحاسيس الأنانية التي تتفاعل داخلنا... ا ..ص قصة قصيرة رائعة .. قراءة كانت ممتعة وعميقةوكانت بداية موفقة في تجربتي مع أعمال هنري ميلر"}, {"userName": "Khaoula ", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/24078981-khaoula", "userReview": "جميلة جدًا ، و في ذهني كلامٌ كثير لأقوله .. لكن ليس الآن ."}, {"userName": "منن نصار", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/21672525", "userReview": "تشابكت خيوط القصة معي ولم أنفذ إلى مغزى محدد؛ أهي تلك الحكاية التقليدية عن المهرج وضحكاته متقنة الرسم والألوان وما تحمل تحتها من مآسي وآلام؟ فنتسائل عن مفهوم السعادة وإمكانية حدوثها، أنا شخصيا لا أميل لهذا .. اعترافنا بوجود السعادة الدائمة هو عائق عن مواصلة الحياة نحن نشعر بحدوثها لأنه لحظي .. نعيشها ثم ننساها طويلا فنبحث عنها لكي نقتنصها في لحظة آخرى ولا نهاية لهذا الطريق فلا سعادة هنا .. أما محاولة العيش مطولا في تلك اللحظة يوقف الزمن الذي يليها وتظل محاولتنا لإبقائها أو إعادتها مرهقة فتضيع أيضا السعادةربما هي عن هويتنا المفقودة في عبث الروتين وتداخل يومياتنا التقليدية بلا متنفس للإبداع أو التغيير .. تلك الذات التي ربما تغفل طيلة عمر من المشاغل والأعمال التافهة المعتادة أو ربما -لحسن الحظ- يفتقدها صاحبها عندما يشعر بذاك الغياب ويبدأ رحلة البحث المضنية والتي نادرا ما تصل لنتيجة مرضية دائمة!يقتلني في تلك الكتابات سواء أدبيا أو فكريا عدم وضوح الطريق فيسهل جدا توضيح ما يضيع معه عالمنا الحقيقي وتوضيح ما يسرقنا من ذواتنا ويلهينا عن النظر إليها وسماعها .. يسهل جدا لعن حيواتنا وصب سيل الشتائم على فراغها وعدم جدوى معناها وغياب المعرفة والسلام والهدف و و و .. .لكن لم يرشدنا أين منهم على طريق البحث هذا .. لم أفهم أبدا كيف أبدأ كيف استعد وكيف أخطو أول خطوة .. دائما ما يتركوني فريسة هذا السؤال وهذا العنوان الرنان .."}, {"userName": "zahra haji", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/34844269-zahra-haji", "userReview": "\"لأن المهرج لا يكون سعيداً عادة إلا إذا كان شخصاً آخر .. لا أريد أن أكون سوى نفسي\"أوغست \"المهرج\" الباحث عن نفسه وعن السعادة بعيدا عن شخصية المهرج الذياعتاد إسعاد الجماهير دون ان يسعد أوغست نفسه في صفحات قليلة يقودنا هنري في رحلة البحث عن الذات وعن المعنى الحقيقي للسعادة أوغست بوجهيه يمثل الوجه اليومي للعالم فجميعنا نختبئ خلف وجوه لا تشبهنا ندعي ما ليس فينا نلبس شخصيات لا ترضينا نحاول بشتى الطرق إرضاء وإبهار من حولنا وفي خضم كل ذلك الزيف نفقد أنفسنا وهويتنا أوغست في نهاية بحثه يكتشف ان السعادة هي ان تكون نفسك من دون إضافات او اقنعة"}, {"userName": "Alborz Baghipour", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/1609380-alborz-baghipour", "userReview": "این داستان کوتاه را «هنری میلر» به سفارش «فرنان لژه» نوشت تا نقاش فرانسوی آن را به همراه تصاویری که از دلقک‌ها و سیرک‌ها کشیده بود در کتابی چاپ کند. کتاب پُر است از ارجاعاتی به نقاشی‌های محبوب میلر که اگر پی‌نوشتِ او در پایانِ آن نبود شاید کشفِ آنها به همین راحتی میسر نمی‌شد: ارجاعاتی به تابلوهای از «میرو»، «شاگال» و «سورا» که به گفته‌ی میلر بدون آنکه قصد اشاره به آنها را داشته باشد این تصاویر ناخواسته در متن داستان آمده‌اند. اگرچه «لبخند پای نردبان» یک داستان سوررئال نیست، اما روند آفرینشِ ان کاملا مانند آثار سوررئالیستی بوده و به قولِ خود میلر نامتعارف‌ترین داستانی است که تابه حال نوشتهحجمِ اندک کتاب، وجود نقاشیهایی از نویسنده در آن و در نهایت فرامتنِ جذاب داستان، کتاب را به اثری تبدیل می‌کند که ارزش خواند داشته باشد"}, {"userName": "سلطان", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/7260680", "userReview": "هذه قصة طويلة وليست رواية، وهي في رأيي لا تمثل المستوى الحقيقي لهنري ميلر، وفي آخر صفحات العمل، نجد توضيحاً من الكاتب يشير فيه إلى أن عمله هذا هو العمل الوحيد الذي كتبه بناء على طلب من غيره، وتحديداً من الفنان فيرناند ليجر لكتابة شيء عن عالم المهرجين.وهذا قد يكون سبباً في أن يكون العمل بعيداً عن روح ميلر."}, {"userName": "فهد الفهد", "userReviewDate": "Oct 31, 2012", "userURL": "http://www.goodreads.com/user/show/5008212", "userReview": "ابتسامة عند قدم السلم يرتبط المهرج عادة بالطفولة، فلذا يبدو وكأنه جزء من بهجتها، وكأنه كائن خارج الزمن، خارج الهموم، ولكن ميلر في هذه القصة القصيرة يفلح كعادة الروائيين، في النظر إلى ما يجول في الزاوية المعتمة، فيفتح لنا عالم المهرجين، لنرى الطموح، ونعايش الضياع والشقاء، ونتأمل في حياة الرجل الذي يريد أن يكون كائناً فريداً، ولكنه لا يجد من يفهم فنه، وخاصة عندما يقف في حالة نشوة، عند قدم السلم المرتفع إلى قمر مثبت في سقف السيرك، حيث يمارس بعض ألعابه، من هذا الموقع الفريد، سيخرج أوغوست، سينسلخ من عالمه، وسيترك موقعه ليعمل مساعداً في السيرك، بعيداً عن الأضواء، ولكنه سيشتاق إلى التهريج من جديد، وعندما تسنح الفرصة سيلتقطها، وسيحل محل زميله أنطوان المريض، لا بأس، سيكون إنطوان مؤقت، يشبع نهمته، ومن ثم يعود إلى عمله الممل، ولكنه يبهر الجمهور، يتألق، وهنا يقع في المأزق، فالجمهور يريد إنطوان الجديد المبهر، بينما يموت إنطوان الحقيقي كمداً، وكما فعل أول مرة يقرر أوغوست الفرار، ويبدأ في التفكير في المكان الذي يقصده، وهو في أفكاره يصل إلى حالة من النشوة، ولكنه يموت بشكل مفاجئ وغريب، بضربة هراوة من ضابط شرطة !!! وعلى وجهه ابتسامة بينما القمر يسطع في السماء."}, {"userName": "Raul", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/59299104-raul", "userReview": "Uma história simpática e que entretém!\"A vida é feita de pequenos fingimentos de que não podemos desperdiçar.\"Eu não quero ser ninguém senão eu mesmo.\"\"A alegria é como um rio: corre continuamente.\"\"Sermos nós próprios, unicamente nós próprios, é algo extraordinário.\"\"Nada há no mundo que não tenha a sua importância.\""}, {"userName": "Mohammad Ali", "userReviewDate": "Sep 12, 2015", "userURL": "http://www.goodreads.com/user/show/30094118-mohammad-ali", "userReview": "نمره ی واقعی: یک و نیم - اونم به خاطر نوشته ی نه چندان جذاب میلر در آخر کتابداستانی بود که من اصلا باهاش ارتباط برقرار نکردم. تحولات شخصیت اصلی بیشتر راز بودن تا چیزی که بشه فهمید و تحلیل کرد"}, {"userName": "djamb - blog Folhas de Papel", "userReviewDate": "Aug 26, 2012", "userURL": "http://www.goodreads.com/user/show/7076026-djamb---blog-folhas-de-papel", "userReview": "Podem ler o post completo no meu blog. You may read the complete post on my blogwww.folhasdepapel.wordpress.comEste livro foi uma autêntica surpresa. É pequeno mas contém uma enorme magia, uma envolvência suprema, uma simplicidade imensa que nos absorve na procura de sentido e identidade por parte de Augusto, um palhaço que perdeu o seu rumo. De uma assentada, li-o avidamente para descobrir o percurso de Augusto durante um período marcado pela crise existencial, no qual recusa a sua profissão e deambula perdido nos seus pensamentos e nas suas emoções contraditórias.Na verdade, Henry Miller foi desafiado a elaborar um texto acerca de palhaços e circos e, afastando-se do seu registo mais cru, intenso e de carácter sexual, acabou por pegar na caneta e a registar a história de Augusto sem saber para onde caminhava, escrevendo ao sabor do vento e à medida que as ideias surgiam e, curiosamente, sustentadas pela inspiração que alguns grandes pintores lhe provocavam. O resultado foi um conto aparentemente surrealista, de cenários inimagináveis e oníricos, com aproximadamente 60 páginas: Miller reflecte sobre o sofrimento de um homem que procura o sentido da sua vida, ponderando o seu caminho e interrogando as suas escolhas, roçando algumas das questões filosóficas mais profundas no ramo do existencialismo.Dotado de uma enorme sensibilidade e sinceridade, este conto é apaixonante pela forma como retrata algumas das questões mais frágeis da condição humana na procura da felicidade com uma simplicidade arrepiante. Se tiverem oportunidade, não deixem de o ler.OpinionThis book was an amazing surprise. It’s quite small but it’s so magical, so involving and so simple that absorbs us while we accompany the search of August, a lost clown, that is looking for some kind of sense and identity. I read it in less than an hour to discover August’s path in a hard and sad period of his life, when he’s going through an existential crisis in which he rejects his profession and wanders in his thoughts and mixed feelings.Actually, Henry Miller was challenged to write a text about clowns and circuses, which took him to move away from this regular literary genre (more raw, intense and sexual) and write a tale without planning it: he took his pen and just started writing, based on some great worldwide artists. It resulted in a look-alike surrealist tale with unimaginable and oneiric sets, with approximately 60 pages: Miller reflects about a man’s suffering who wants to find himself, wandering about his path and questioning his choices, reaching some of the most profound questions of existentialism.With a great amount of sensibility and sincerity, this tale captivates us by the way it portrays some of the most fragile issues in the demand for happiness with an amazing simplicity. Read it if you have the chance!"}, {"userName": "Coincidence F", "userReviewDate": "Jul 18, 2010", "userURL": "http://www.goodreads.com/user/show/2946626-coincidence-f", "userReview": "بعد انتهائي من الرواية تذكرت مقولة سوزان عليوان : الآن احسست بمأساة المهرج حين يفرغ نفسه في عروق النكتة ولايضحك أحد.الرواية قصيرة مترفة بالرمزية ، تحكي قصة رجل يدعى أوغوست أحبّ عمله كمهرج . كل ليلة كان الستار يُسدل على تصفيق ضاحك وصاخب من الجمهور الذي تعوّد روتينياً على الضحك على أدنى حركة سخيفة يؤديها المهرج .بغض النظر عن إفراغ المهرج الحزن على وجهه ليضحك الجمهور .كان اوغوست يجادل نفسه كل مساء ، حين يضع مستحضرات التجميل : ان الفقمات بغض النظر عن ماتجبر على القيام به تبقى فقماتٍ دائماً. ظل دائماً يبحث عن قواه وموهبته التي تمثل سعادته المطلقة وعن انسلاخه عن نفسه كل ليلة حتى يضحك الجمهور.وبعد ان افرغ كل عاطفته في المشهد كي يجعله خالداً نسي من شدة النشوة ان يكمل المشهد وكأنه لمس شيئاً لدى الجمهور ليصفق له كعادته لاجل التصفيق ولأن المشهد انتهى.لم تكن تلك الحياة الا اجترار للحزن وتشتت الهوية لاوغوست فاستقال عن عمله باحثاً عن ذاته ليجرب حياة اخرى . انعزل لايامٍ يحدث ذاته ويبقى كانسان ، كأوغوست بلا مساحيق ولا استجداء ضحكات الجمهور ، بدء بتقديم المساعدة الخجولة للناس. احس بالسعادة بقيمة معنى ان تسدي معروفاً لأحد حتى تصنع ابتسامة صادقة يبقى اثرها وبالتأمل الذي يمنحُ نفسه السكينة ، اصبح متلهفاً لفعل اكثر مماهو مطلوب منه كان يمنح من دون حساب.انضم مع سركٍ متنقل لا كمهرج بن كمقدم خدمات ، يكلل بها روحه الجديدة التي تبحث عن الصدق . وفي يوم مرض المهرج المغمور انطوان ، فااضطر اوغوست ليُغطي الدور ، فكانت النقلة بأن حصل على مشهده الخالد الذي جعل الصحف كلها والأيادي تصفق له بإجلال ،لانطوان الذي تحول الى عظيم بين ليلة وضحاها. \" كم كان فهم الجمهور قليلاً وكم يكون فهم اي شخص قليلاً حين يتعلق الامر بالقدر. ان تكون مهرجاً هو ان تكون بيدق القدر. الحياة في الساحة عرضٌ أخرس يتألف من lسقطات ، وصفعات ، ورفسات . وبواسطة هذا العرض المخزي يجد المرئ شعبية لدى الجمهور. المهرج المحبوب كان امتيازه الخاص ان يمثل ثانية الأخطاءر، الحماقات ، الغباء ، جميع حالات سوء الفهم التي تمرض النوع البشري. ان لاتفهم حين يكون كل شئ واضحاً كضوء النهار. ان لاتعي رغم ان الخدعة تكرر امامك الف مره ان تتلمس طريقك كأعمى حين تشير جميع اللافتات الى الجهة الصحيحة. البشر لايتعبون بتاتاً من هذه السخافات لأن بحثهم قادهم طول آلآف الأعوام الى طريق مسدود \"لم يكن اوغست يريد سوى ان يمنح المساعدة والتصفيق الحار لزميله المغمور انطوان ، ولكن المجد والموت خطف ماكان يتمناه اوغوست ، غيب الموت انطوان ، وحصل على خلوده بإسمٍ اخر ليضيع اوغوست من جديد. الترجمة رائعة وسلسة والرواية عميقة ، كلٌ منا يحمل في ذاته اوغوست الذي يبحث عن سعادته ويجدها في مكانٍ اخر."}, {"userName": "Ibrahim Jabarin إبراهيم جبارين", "userReviewDate": "Dec 27, 2012", "userURL": "http://www.goodreads.com/user/show/5727264-ibrahim-jabarin", "userReview": "قصة قصيرَة جذّابة وممتعة بعض الشيءفيها شيء لنا، وأشياءٌ عن حقيقة الحياةبعض الإقتباسات:من الجيّد أن يتخلّص المرء من دوره، أن ينغمس في رتابة الحياة، ومن الجيد أن يعرف المرء أن لا يزال جزءً منه وأنه لا يزالُ مفيدًا----لا تحتاج إلا لقليل من الوقت لجعل نفسك نكرة----الحياة مليئة بالخدع الصغيرة التي يجب ان ننتفع منها----كل ما تحتاجه أحياناً هو حادث صغير، خدعة حظ، دفعة من الخلف، وها أنت هناك، في ضوء المسرح"}, {"userName": "Mohamed Al-Moslemany", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/33661129-mohamed-al-moslemany", "userReview": "أن تقضي حياتك باحثًا عن السعادة، ذلك شيء سخيف!"}, {"userName": "Doaa", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/3703209-doaa", "userReview": "_ ولكن دعنى أخبرك شيئاً بسيطاً تعلمته مؤخراً \\ أن تكون نفسك نفسك فحسب لهو شئٌ عظيم ؟! ..وكيف يفعل المرء ذلك كيف يخرجه للضوء ؟!!_ اه هذه هى الخُدعة الأكثر صعوبة وهى صعبة فقط لأنها لاتنطوى على جهد ...____ ____قصة صغيرة الحجم \\ كبيرة وعميقة المعنى أعجبتنى بشده"}, {"userName": "محمد الحمراوي", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/17246809", "userReview": "أن تكون نفسك، نفسك فحسب، لهو شيء عظيم ."}, {"userName": "Mostafa", "userReviewDate": "Mar 29, 2016", "userURL": "http://www.goodreads.com/user/show/1146277-mostafa", "userReview": "داستان فراز و فرود دلقکی که به خودشناسی(!) میرسهو میفهمه که شادی واقعی را آنجایی حس میکند که خودش باشد و بتواند باعث خنده بقیه بشود"}, {"userName": "Sheikha  . D", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/7401380-sheikha-d", "userReview": "نَحْنُ بائِسون جداً بحيث لا نستطيع أن نزعم أنه عالما !!بهذا انتهت الرّواية ولعلّ هذه الكلمة اختصرت جميع صفحاتها"}, {"userName": "فاطمة الشيشينى", "userReviewDate": "Jun 19, 2014", "userURL": "http://www.goodreads.com/user/show/7981173", "userReview": "أولا نبدأ بازاى أنا وصلت للكتاب دا -------------فاطمة تجلس تقرأ كتاب فلسفى بحت منذ 7 ساعات تقريبا ، تشعر فاطمة بفراغغ فى رأسها تطوى صفحات الكتاب من أجل أن تستريح قليلا ، عقلها مازال يشتهى القراءة فلم يكتفى بعد ، تتذكرفاطمة بوست على جروب يهتم بالكتب لرواية صغيرة لا تتذكر فاطمة اسم الرواية ولا حتى المؤلف ولكن تتذكر صاحب البوست فتجده صديق لها تذهب اليه لكى تطلب الكتاب قائلة فيه كتاب ورقه صغير حضرتك كنت منزله على الفيس من فضلك انا عاوزه لينك له ، يجيب الصديق قائلا طب اسم الكتاب ايه ، فاطمة قائلة لا مش فاكرة ، انا بس عوزاه عشان عقلى مش قادر يكمل الكتاب الفلسفى اللى بقرأ قالى طب هيا الرواية اللى بتسألى عليها ابتسامة عند قدم السلم ، فاطمة فى عبثية والله معرف طب هاتها كدا اشوفها ، ، الصديق يجيب بس دى فلسفية برده على فكرا ، فاطمة فى يأس ماشى هاتها برده مش مشكلة مدام رواية اكيد هتفرق عن كتاب اكاديمى بحت فى الفلسفة ، الصديق يرسل لينك للتحميل ، فاطمة فى أمل ايوا هوا دا بالضبط ، تنظر فاطمة بضع دقائق لتحميل الرواية ثم تبدأ القراءة -----------------------------------------------------------------------ثانيا أربع نجمات ليه --------- 1- نجمة للأسلوب الأدبى الراقة والترجمة الجيدة  2- الرمز الفلسفى غالبا يغرينى جدا فاعطيه نجمة ثانية  3- موضوع الرواية نفسه أحيه ويستحق نجمة ثالثة  4- نجمة رابعة لانها رواية من النوع الذى يجعلك لا تتركها حتى الانتهاء منها دون ملل ---------------------------------------------------------------------------ثالثا مقتبسات من الرواية ----------- _ ولكن دعنى أخبرك شيئاً بسيطاً تعلمته مؤخراً \\ أن تكون نفسك نفسك فحسب لهو شئٌ عظيم ؟! ..وكيف يفعل المرء ذلك كيف يخرجه للضوء ؟!!_ اه هذه هى الخُدعة الأكثر صعوبة وهى صعبة فقط لأنها لاتنطوى على جهد ...--------------------------------------------------------------------------------رابعا رموز من الرواية أو كلمات تعبر عن محتوى الرواية ---------------------------السلام الداخلى - السعادة - النفس - الشهرة - الموت - القمر - التنفس -الفرح - الخواء الداخلى --------------------------------------------------------------------------أخيرا نصيحة --------------أنصح بقراءة الرواية فهى تستحق"}, {"userName": "Ahmed Bk", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/58692360-ahmed-bk", "userReview": "Well... the book is deep, therefore, you won't let it down before you get done with it! The writing style is so unique and it had this poetic tone which was definitely a plus. Also, The storyline was solid and progressive in which the main character developed through the events. Heretofore, Everything is perfect you'd say, right? well.. I didn't like one particular thing that I really consider as critical: DESCRIPTION; The book didn't well illustrate the characters, places, events, etc. However, I don't believe that one issue had an impact on it. (Isn't that exceptional?) And for that, I find this book \"The smile at the foot of the Ladder\" is very worth reading, especially it has no more than 123 pages so it's a matter of sparing a few hours of your life. haha. Finally, I hope my mini-review was helpful and informative, and I'd love to receive any suggestions on how to improve it, (THANK YOU!) :')Bien à vous. Oh before I leave you, here's a quote from the book;\"....so to say, You must never let them know what pleasure it gives you. Once they catch on to you, once they learn your secret, you are lost to them. They will call you selfish, no matter how much you do for them. You can do everything for them -literally kill yourself in harness- so long as they do not suspect that they are enriching you, giving you a joy you could never give yourself...\""}, {"userName": "Ayah", "userReviewDate": "Oct 10, 2014", "userURL": "http://www.goodreads.com/user/show/22776738-ayah", "userReview": "أولا إن النص بالنسبة إلي يحتاج إلى إعادة قراءة مرتين على الأقل، و هنا تكمن وعورة النصوص القصيرة في تكثيفها .. ربما كان جليا أن إبكاء الآخرين شيء متاح بوفرة لكن إضحكاهم سيكون الشيء الأصعب لأن الإنسان مخلوق تراجيدي -بالدرجة الأولى- لذا فإن إضحاكه يتطلب عملية التفاف و احتيال ربما على دماغه .. الآن أقول إن المهرج و الممثل كلاهما يتجشمان صعوبات كثيرة .. و ربما كانت مهنتهما الأصعب في العالم .. طبعا أجد أن التعليق الموازي للنص الذي كتبه الكاتب هو جميل و متقن و مؤلم في الآن نفسه .. علينا أن نعترف بكل أسف و مرارة بالحقيقة .. نحن نعيش في هذا العالم و ذلك مأزق لا يمكن الخروج منه إلا بعملية استسلام واضح و تام .. كأن أترك نفسي للموج يغمرني و يعليني و يأخذني إلى مكان بعيد ... بنفس جمال الحالة و عذوبتها تتمكن من مواجهة العالم ."}, {"userName": "Pedro", "userReviewDate": "Sep 02, 2013", "userURL": "http://www.goodreads.com/user/show/8940488-pedro", "userReview": "É uma história sobre palhaços. Mais concretamente, sobre um palhaço: Augusto. O que é que os palhaços têm de interessante, podem perguntar vocês. Os palhaços fingem, encarnam o ridículo. Foi isso que Augusto sempre fez e foi isso que o levou a pensar sobre o problema de ser ele mesmo.É um livrinho pequeno, que se lê todo de uma vez, mas que providencia tema de reflexão para várias semanas. Não recebeu as cinco estrelas devido ao estilo da escrita, porque se fosse só devido à mensagem, não teria havido dúvidas.Recomenda-se para quem se interesse por levar este tipo de questões mais a fundo e que se sinta pronto a ser embalado numa alegoria poderosa."}], "description": "First published in 1959, this touching fable tells of Auguste, a famous clown who could make people laugh but who sought to impart to his audiences a lasting joy. Originally inspired by a series of circus and clown drawings by the cubist painter Femand Léger, Miller eventually used his own decorations to accompany the text in their stead. “Undoubtedly,\" he says in his explanatory epilogue, °‘it is the strangest story I have yet written. . . . No, more even than all the stories which I based on fact and experience is this one the truth. My whole aim in writing has been to tell the truth, as I know it. Heretofore all my characters have been real, taken from life, my own life. Auguste is unique in that he came from the blue. But what is this blue which surrounds and envelopes us if not reality itself? . . . We have only to open our eyes and hearts, to become one with that which is.\"", "title": "The Smile at the Foot of the Ladder", "url": "https://www.goodreads.com/book/show/304372.The_Smile_at_the_Foot_of_the_Ladder", "average": 3.62, "cover": "https://images.gr-assets.com/books/1408931245l/304372.jpg", "reviews": 139, "authors": [{"url": "https://www.goodreads.com/author/show/147.Henry_Miller", "name": "Henry Miller"}], "type": ["Fiction", "Short Stories", "Novels", "Literature", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/304372.The_Smile_at_the_Foot_of_the_Ladder", "http://www.goodreads.com/book/show/4806769", "http://www.goodreads.com/book/show/13183777", "http://www.goodreads.com/book/show/7516948-o-sorriso-aos-p-s-da-escada-moloch", "http://www.goodreads.com/book/show/8597200", "http://www.goodreads.com/book/show/7377566-o-sorriso-aos-p-s-da-escada", "http://www.goodreads.com/book/show/26385019", "http://www.goodreads.com/book/show/1202781.Le_sourire_au_pied_de_l_chelle_The_Smile_At_The_Foot_Of_The_Ladder", "http://www.goodreads.com/book/show/17972717-o-sorriso-aos-p-s-da-escada", "http://www.goodreads.com/book/show/249.Tropic_of_Cancer", "http://www.goodreads.com/book/show/250.Tropic_of_Capricorn", "http://www.goodreads.com/book/show/252.Sexus", "http://www.goodreads.com/book/show/51089.Black_Spring", "http://www.goodreads.com/book/show/617148.Plexus", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}