{"ratings": 94428, "userreviews": [{"userName": "karen", "userReviewDate": "Jan 13, 2012", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "when i was about one hundred pages from the end of this book, i tugged on greg's sleeve at work, and said, \"is this gonna end sad??\"and he refused to answer.i think that was a good impulse.because i almost don't wanna review this. this book was such a beautiful journey, and taking place as it does over a number of years, there are naturally high and low points, emotionally. but i'm not going to tell you how it ends up.i will tell you that i VERY NEARLY CRIED early on. like page 42-early.i misted, but nothing tumbled out.that is a big deal for me, and from that point on, i was hooked.i suppose i can give you some brief descriptions, for those of you who strangely don't see the cover and instantly think \"must. read.\"jack and mabel are a couple who married late(r) in life than typical for the 1920's, suffered a miscarriage, and move to alaska to try their hand at homesteading, as a way of isolating themselves from the constant reminder of their loss, their friends and families with their healthy children, and the sorrow hanging over them. now in their fifties, the idea was that the solitude would heal them, and together, they would build a new life and cleave together with a love stronger than ever.this didn't exactly pan out, and each of them descends into their own private griefs and the hardships the brutal carelessness of nature presents, and their own inability to communicate further isolates them from any potential for healing.until one night, when an unexpected levity descends upon them, and they build a snow child together, dressing her in a hat and mittens that they have, and carving the face of a beautiful girl upon her.the next morning, the snow child, and the clothing, are gone, and there are faint footprints leading away from where the snow child was built.soon, they start seeing glimpses of a little girl in the woods in the company of a red fox. fleeting, shy, wild.is this the snow child come to life? is it all a coincidence?? is there magic afoot? is it simply grief-fueled madness? cabin fever? any other explanation?with the help of their neighbors; including the amazingly plainspoken and badass character of esther, and their elusive snow child, their solitude will lessen, and these questions will be answered, while a beautiful story unfolds. this book may be based on a fairy tale, but there is no easy magical deus ex machina at work here.the bulk of the book is about survival - whether it be survival from poverty and lack, or from loneliness and loss. it is about the bonds of family, however \"family\" is necessarily redefined through circumstances,and the painful sacrifices we make for love.it is a beautiful and mature debut novel, and although i read the ARC, i am definitely going to buy the book when it comes out, because this one is a keeper.anything else i could say would ruin it. trust me."}, {"userName": "Emily May", "userReviewDate": "Jan 16, 2012", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I put off reading The Snow Child because it wasn't something I would have chosen for myself without the extremely positive reviews of other goodreads members. If it is not obvious to you from the description alone, then this book is not mostly plot-driven. It's charm is upheld by the characters, the relationships, and the sad, cold mood that seems to permeate the entire novel from open to close. It is the kind of novel that I sometimes have trouble with, the kind not concerned with action or drama, but more subdued and subtle. However, I was fortunate in that the characters held my attention throughout and the relationship between Mabel and Jack carried something simultaneously heart-warming and bittersweet that really spoke to me.Mabel and Jack are an aging couple that have escaped from their previous reality into the Alaskan wilderness. They struggle to get by with Jack trying desperately to turn the old farm where they live into something that can support them through the harsh winters. But they are also struggling with something that runs much deeper: their childlessness and the memory of the stillborn baby that continues to drive them apart. I loved the relationship between the pair, the way they often felt distanced from one another but still relied on each other for support. It was heart-breaking to picture them sat at their table feeling the absence of a child and unable to discuss it.There's something about this novel that is just plain sad. Even when nothing particularly sad seems to be happening. It's a tone that the story never shakes and perhaps it is something to do with the description of the freezing and isolated environment that made me feel like I should prepare to burst into tears at any second. I can't say for sure whether this book was supposed to be a lesson in how you cannot run away from your problems, or how bottling things up and shutting people out never works, but I can say that I took a little bit of all of this from the story.Onto the snow child herself. It could have been an intentional move on the author's part, but I felt constantly distanced from her character; I felt perhaps she was a tool by which the main players' (Mabel and Jack) could be analysed and allowed to grow and develop. This is not so much a criticism as an observation. If you aren't aware of the basic plot outline, Mabel and Jack create a child out of the snow on a winter's night and discover the creation gone the next morning with a single trail of footsteps leading away from where it had stood. Then suddenly they start to spot a young girl roaming the woods, one who is identical to their snow sculpture and they see it as an opportunity to maybe finally have the child they always wanted.I had been all set to give this book five stars, I really had. The writing is beautiful, the characters interesting, and the relationships touching... but the ending was disappointing. For me, it seemed like an unsatisfactory \"is that it, then?\" kind of ending that left me expecting some kind of twist from the epilogue that wasn't forthcoming. It wasn't enough to make me change my mind about the rest of the story and I would still highly recommend this book, but it was quite a large fault in an otherwise near-perfect novel."}, {"userName": "Elyse", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Thank you to the Goodreads community and my friends -- for the comments of inspiration while I was reading this book. When \"The Snow Child\" was first released in 2012, other that adoring the books cover, I was sure this book wasn't for me. I'm not sure why or what I thought it was -I just 'passed-it-over'. Well, for what's it's worth...I am more than pleasantly surprised to discover how MUCH I LIKE THIS BOOK. I don't seem to remember 'anyone' telling me it was a page turner.The blend of myth and naturalism are alluring and fascinating. In all fairness, I was ready for this book. I'm not sure I was 4 years ago. Besides the story itself...It's been a long time since I even thought about the homesteading hardships in Alaska. I took a class on the history and geography of Alaska when I was an under-grad at Cal over 40 years ago. A 'few' memories come back. My emotions were invested right from the start. Having a 'story' mixed with history often makes me authentically more interested in the history. The descriptions of the Alaskan wilderness were so stunning, that I ended up looking at pictures on the Internet....( brought back memories of when I was in that college class studying Alaska- 'before' computers). I loved the beginning of this novel--it's what kicked in my momentum of desire to keep reading. I knew nothing about the Russian fairy tale-- \"Snegurochka\"...the story of 'The Snow Maiden'.... a girl half-human and half-snow. I think it was a great way to tell 'this' story-- it gave me the magical/reality context I needed to enjoy this story more. Before Faina comes into the story--I felt so much sadness for Mabel and Jack, I could imagine being 50 years old back in 1920, was a 'older-in-a-sense', than it is today in 2016. Mabel and Jack never left my thoughts the entire book--even when the story shifted more to Faina and young Garrett. Mabel had already been living with so much despair...how was her relationship with Jack going to 'thrive' ( ha), survive, their already emotional traumas-- let alone the challenging elements? ---Faina, the 'orphaned wild child', brings hope - and and zesty-energy to everyone in the community. She and her red fox disappear in the summer, return in the winter. Am I the only one who wondered where they went during the summer months? lolI didn't feel that the epilogue was necessary at the end, really. It's not that I didn't 'want' to read it --- I DID---at the same time, without it, my imagination would have had a chance to take my own path. I wonder what others think?I could chat about this book now for hours...but I'll stop-- YOU GUYS HAVE READ THIS BOOK ALREADY... ( you need my thoughts like a hole in the head)...But it's all true: This is a wonderful book: sad, chilling, mysterious, magical and realistic! \"Where you off to? Jack asked as he scraped the last fork full of egg and potato from his plate \"I thought I go out for a walk, just to see the snow\". On that note ....it's still summer here in California...\"I'm walking outside for sunshine - to ride my spin-bike under the tree and continue reading. Love to my friends!!!"}, {"userName": "Amalia Gavea", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/56789747-amalia-gavea", "userReview": "''There once was an old man and woman who loved each other very much and were content with their lot in life except for one great sadness- they had no children of their own.''\nI've often read that it is difficult to write a review about books that left you indifferent, distant. I agree, but for me, writing a review about a novel that left me speechless with its beauty is equally hard. Where do words stop? Where should we stop analyzing and dissecting a work of literature and let the power of the story speak for itself?Jack and Mabel is a couple that love each other unconditionally and yet, their life together is tarnished by the absence of a child. Their decision to move to Alaska, in a remote area of the Last Frontier, is their final attempt to start anew, on virgin ground, away from their relatives' gossips and silent pity. A tough place to begin again, one may say, but I believe that we are often in need of a shock, in need of a drastic change of environment, to look upon our lives under a new light, to attempt to correct our wrongs or chase our fears away. It is not easy. Far from it. And it is not easy for our protagonists either.\n''November was here, and it frightened her because she knew what it brought- cold upon the valley like a coming death, glacial wind through the cracks between the cabin logs. But most of all, darkness. Darkness so complete even the pale-lit hours would be chocked.''\nWhile Jack retains his contact with the ''outside'' world, Mabel stays home waiting, reading, baking pies, slowly letting herself become a vulnerable prey to her sadness. Then, one cold, beautiful, snowy evening, she and Jack decide to let themselves become children again, and a miracle happens. A beautiful child starts visiting them.No more about the plot, we are treading on thin ice here. Let us turn our focus to the characters. The way Ivey has created the relationship between Jack and Mabel is astonishing. It is a love that is realistic. earthy, devoted and full of equal trust. Jack is like a rock that supports Mabel in her every step, Mabel is tenderness, determination and the sole reason he keeps on going. Actually, they are each other's reason to persevere and tame the wild, formidable nature and make it their home. Mabel adds to the ambiguity of the narration. There is an intense feeling of uncertainty, especially in the first half of the story. Is she a reliable narrator? What is this young girl that seems to appear out of nowhere? Is she a forest child spirit? A creature of winter? Or is she a human child of flesh and blood with an unquenched, primeval instict of survival? The characters that move in the periphery of the action are quite interesting in their own merit. Aside from Faina, Esther and Garrett occupy much of the plot. Esther is a solid character, a strong woman, as strong as the harsh landscape. I'm sure that most of us would like to have her as our close friend. Garrett takes on quite a distinctive role during the second half of the novel.Ivey writes her tale in a language of impeccable beauty, creating immediate images in the mind of a reader, with a vividness that takes you away, carrying you into the heart of the story. The characters jump out of the page, you are able to smell and feel the wintry air on your face, the aroma of the cold and the fur trees. You can feel the softness of the snow, the crispiness of a newly - formed snowball, the heat from the woodstove and its cozy light around the wooden cabin. There is a nightly ice - skating sequence that is, possibly, one of the finest, most beautiful, heartwarming passages I've ever read.\n''We never know what is going to happen, do we? Life is always throwing us this way and that. That's where the adventure is.''\nBased on a Russian fairy-tale, this story resembles every bit of the beauty of the Russian folk tales. It is sad, hopeful and sensitive, its characters are people like us. It is an example of how exciting can the mixture of realism and magic realism become when done right. It is a creation of love, nature, darkness and light. A creation of persistance and strength, of all those elements we encounter in our daily lives, those we adopt and the dark ones that we try to scare away. The way I see it, these are the ingredients of a beautiful, classic story. The Snow Child by Eowyn Ivey is certain to become one. So forget all pretentious ''philosophies'' about the ''deeper meaning the author wanted to convey'', and allow yourselves to become children, playing with the snow on a starry night. Escape to a snowy plain in Alaska and let magic in. You will not be disappointed..."}, {"userName": "Nataliya", "userReviewDate": "Apr 20, 2012", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "Once upon a time there lived a childless old couple... This is not an uncommon beginning to folk tales, a simple introductory line which can (and in Eowyn Ivey's The Snow Child does) condense into a few simple words the years of pain, sadness, and intense longing for something that nature refused to give despite desperate desire.\n\"Where else in life, Mabel wondered, could a woman love so openly and with such abandon?\"\nThis is where I saw the strengths of The Snow Child - not in the imagery of Alaskan wilderness through the prism of magical realism, not in the enigmatic nature of the titular snow child, but in the depiction of quiet, desperate sadness and alienation that plagues a deeply unhappy couple, torn apart by the weight of grief, struggling under the burden of their perceived failures.\n\"Was that why they had come north— to build a life? Or did fear drive her? Fear of the gray, not just in the strands of her hair and her wilting cheeks, but the gray that ran deeper, to the bone, so that she thought she might turn into a fine dust and simply sift away in the wind.\"\nJack and Mabel are an aging couple who left their old life and moved to Alaska seemingly to start a homestead but really to escape the weight of their loss that, turns out, they were not able to leave behind with their old lives. More than anything, Mabel desired to have a child, defining herself through the view of motherhood - but all she and Jack have is the memory of a tiny deformed stillborn, the one that Mabel hasn't even had a chance to say goodbye to as Jack (with the best intentions, sadly) quickly took it away for a silent nighttime burial.Years later, neither Mabel nor Jack have overcome their grief and loneliness. Instead of reaching out to each other, instead of finding ways to cope they seem to have retreated deep into each own self, allowing tiny cracks to appear in their marriage, withdrawing behind invisible doors, isolating themselves from the world filled with life and children and constant reminders of their loss and (at least in their perception) failure. In this state of mind, leaving everything behind and trying to start a brand-new life in Alaska seemed like a promise of a new better life - or so Mabel had hoped.\n\"Mabel had known there would be silence. That was the point, after all. No infants cooing or wailing. No neighbor children playfully hollering down the lane. No pad of small feet on wooden stairs worn smooth by generations, or clackety-clack of toys along the kitchen floor. All those sounds of her failure and regret would be left behind, and in their place there would be silence.\"\nBut little has changed in the new place - the sadness that rules their lives, enveloped in silence and things-not-quite-said refused to be left behind. And here they are, in Alaska, still grieving, still drifting apart, Mabel suicidal in her depression, Jack preoccupied with simply trying to provide sustenance to his family, and things have never looked bleaker for the two of them.\n\"Was that why they had come north — to build a life? Or did fear drive her? Fear of the gray, not just in the strands of her hair and her wilting cheeks, but the gray that ran deeper, to the bone, so that she thought she might turn into a fine dust and simply sift away in the wind.\"\nThese parts of quiet desperation in which Jack and Mabel existed - because at this point it was mere existence and not quite life - were the parts that emotionally connected with me. There is that elusive *something* in the pervasive melancholy superimposed onto the landscape beautiful but cold and severe that touches the soul and pulls on the heartstrings, and even though you know that it's calculated to precisely do just that to your poor vulnerable heartstrings you cannot help but feeling for this miserable couple deeply and sincerely.My heart ached for Mabel even though I cannot quite relate to her plight. But, unlike her, I can imagine a world where not having children can be a choice instead of a curse, where being a mother is not the sole expectation for a woman, where it is okay to admit to the lack of allure of maternity. For me, such a world is part of our reality. For Mabel, on the other hand, not having children has been out of question - and her not having them was merely unnatural in the America of the 1920s.\n\"If you said you didn’t have children, it sounded like a choice, and what kind of craziness would that be? If you said you couldn’t, the conversation turned awkward while they contemplated your manliness or your wife’s health.\"\nAnd then, just as everything seems to be hopeless, the Snow Child appears - a strange and ethereal Faina, a little girl who appears on the night Jack and Mabel in a giddy trance make a snow sculpture in their yard, a child who only is seen in winter and seems one with the snow-covered stern world of Alaska. To Mabel, something about her reminds of a Russian children's story about a snow maiden that graced the lives of an old childless couple; and as far as Mabel remembers, the story does not have a happy ending. Mabel's Snow Maiden is very familiar to any Russian child. Snegurochka, a tragic young maiden made of snow, doomed to demise by the fire/spring/love in the many versions of the fairytale (beautifully depicted by the famous painter Vasnetsov below), who through the last couple of centuries came to fill the role of the granddaughter of Father Frost, the ubiquitous presence at any kindergarten New Year's Day party, the inspiration for the many children's New Year's outfits (see baby Nataliya below as a very special snowflake/Snegurochka):Faina, unfortunately, is the weak link in the melancholic fragile magic that is the sadness of this book. Is she real or fantastical? A snow child or an abandoned little girl? seems to be the question that plagues her adoptive parents; her vulnerable fragility masked by the exterior of strength and stubbornness is touching, indeed. But it's precisely this mysteriousness, further underscored by the quotation-mark-less dialogue every time Faina makes her appearance was what for me prevented the formation of any meaningful connection with her. Faina's appearances, right down to the 'what just happened here?' last one I found instead frustrating, jarring and interrupting the tone of the book.Mabel's friend Esther, basically the embodiment of life energy that Mabel appears to lack, a breath of vitality in the slow melancholic existence. Unfortunately, this stark contrast again breaks the mood of this book that hinges on quiet sadness.Overall, I found this book to be a lovely story, even if far from perfect. It's captivating in its own quiet way when it focuses on its strength - the fragile yet tender relationship between two aging lonely people in the cold and cruel but beautiful world. 3.5 stars and a respectful nod to Eowyn Ivey for a rather strong debut work.\n\"But he knelt at her feet, put his head in her lap, and they held each other and shared the sorrow of an old man and an old woman who have lost their only child.\""}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "A magical & classic fairytale story for adults!  (bringing back memories of our childhood)Sister Read Review by Norma & BrendaTHE SNOW CHILD by EOWYN IVEY is a wonderful, heartwarming, sad, and beautifully told bewitching tale based on a Russian fairytale titled \"Snegurochka\", The Snow Maiden a girl who is believed to be half-human and half made of snow.  This enchanting story had us both asking ourselves was there something magical happening here or not?  Oh, but for us, there definitely was something magical about IVEY’S writing style here. THE SNOW CHILD captured our imagination as the characters captured our hearts.  Leaving us questioning the mysteries surrounding this so real story that had us hovering between reality and fantasy. Asking ourselves if Faina was actually a real girl or a fantasy?  Was she a product of their imagination because of their desire for a child of their own?  Or was she something magical?  This added some suspense to the story as we tried to figure out who this little girl was.  EOWYN IVEY delivers a very vivid story here that gives you an extremely good feel of sense of time and place of these characters homesteading in Alaska. The wonderful feel of the land, their battle against nature, the harsh cold (that actually had Brenda feeling chilled as she was reading) and their isolation.  IVEY’S description of life on the farm was very real and we could imagine the battles they endured along with all their hard work to survive.We both loved the fantasy and magical aspect of this story which made it a thoroughly pleasurable reading experience!To sum it all up it was an enjoyable, fun, fascinating, and a fast-paced read with a bittersweet ending. Most definitely would recommend.All of Brenda and my reviews can be found on our sister blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Reading Corner", "userReviewDate": "Dec 12, 2015", "userURL": "http://www.goodreads.com/user/show/46088881-reading-corner", "userReview": "So this story was beautiful with so many cute and heartbreaking moments. One of the best things in the book is the character development and the developing relationships throughout the story. From the start of the book, I nearly started crying because there was just scenes that were so heart wrenching especially at the end which completely broke my heart.All the characters are perfect in this novel, they all have their faults but just as many strengths and the unexpected romance towards the end just killed me. Faina, the snow child is one of the coolest characters I have ever met as she's a quiet badass. Her interactions with Mabel and Jack are so cute and the relationship that develops between the three of them is adorable. The neighbours, George, Esther and their children are hilarious especially Esther. She's a woman who gets stuck in and says what she's thinking.The looming tale of the Russian fairytale is beautifully woven in along the story and sometimes makes you question yourself. The way the story progresses is brilliant and everything happening in the story is engrossing. I completely fell in love with this book and I have to buy my own copy. This has definitely weaved it's way into my favourites because of the strong emotions it made my feel while reading it.A woeful tale full of both tragedies and joy but a fantastic read."}, {"userName": "Karen", "userReviewDate": "Sep 16, 2012", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "I loved this sweet story! So much heart and a little magic!"}, {"userName": "Tabetha", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/42488126-tabetha", "userReview": "\"'There,' he said. He stepped back. Sculpted in the white snow were perfect, lovely eyes, a nose, and small, white lips. She even thought she could see cheekbones and a little chin...How could she speak her surprise? Such delicate features. formed by his calloused hands, a glimpse at his longing. Surely, he too, had wanted children...they believed that someday their Christmas mornings would reel with running children and squeals of delight. She sewed a small stocking of their firstborn and he sketched plans for a rocking horse he would build. Maybe the first would be a girl, or would be a boy? How could they have known that twenty years later they would still be childless, just an old man and an old woman alone in the wildnerness?\"\nA fairytale retelling of the Russian fairytale, \"Snegurochka\" (\"The Snow Maiden\"), this quietly intense book captured my heart from the very beginning, and would not let go. Jack and Mabel live in 1920 in the harsh reality that is the wilderness of Alpine, Alaska, with its unbearable summer heat, then all too quickly, with its freezing bitter winter cold, snow and ice, the lack of visibility, the isolation and loneliness. Most of all, they face the fear of not being able to survive the brutal winter, they watch and wait each year for the first signs of spring. They are childless, and not by choice. Jack and Mabel hold their grief close, weighted down, buried deep within their hearts. But one night, they let go of their grief and create a beautiful child out of snow...and in that moment, their lives will change forever, hope and light will replace despair and depression. Eowyn Ivey writes so vividly that I felt I was in the middle of the snow and then a full blown snow storm, and during the summer scenes, I felt the heat of the hot sun, the mosquitoes swarming. This story is such a beautiful example of magical realism, the fantastical, the imagined, combined and layered into the every day real life. And such a life that this couple experienced in the Alaskan wilderness where nothing is taken for granted, where preparing for the upcoming winter is paramount all spring and all summer. I recommend this story to anyone that values the beauty and selflessness of true friendship, who has ever dealt with love and loss in their life, or to those who are parents, as this book speaks to the nature of giving, caring, nurturing, but eventually, having to let go...And then, the wonder of the miraculous snow child appears out of nowhere...\n\"The girl appeared and disappeared without warning and it unnerved Jack. There was something otherworldly in her manners and appearance, her frosty lashes and cool blue stare, the way she materialized out of the forest. In ways she was clearly just a little girl, with her small frame and rare, stifled giggles, but in others she seemed composed and wise, as if she moved through the world with knowledge beyond anything Jack had encountered.\""}, {"userName": "Nathan", "userReviewDate": "Jul 13, 2011", "userURL": "http://www.goodreads.com/user/show/4787524-nathan", "userReview": "It's truly gratifying to come across a book that evokes the senses to such a degree that its flavor is brought to the palate. Such is the case with Eowyn Ivey's debut novel, The Snow Child. Infused with aspects of pine boughs, mountain herbs, woolen mittens and inspired by happenstance, it breathes new life into an old Russian children's tale Ivey stumbled upon in her bookstore.We come to know of aging Jack and Mabel through their childless sorrows, playful intense love and survivalist fortitude all cruxing on a belief in dreams and a touch of magic. Through imagery spun with such crispness as to leave a skiff of snow on your heart and the bite of cold wilderness air in your lungs, it's nearly impossible not to fall deeply into the story of Faina and her enchanted sudden appearance. And I must say, the skill with which Ivey works your emotions--ebbing and flowing like tides with each of Faina's heartbreaking disappearances--belies the fact this is her first book. Devastation and light, fear and hope, all there. At the end, I found myself believing Jack, Mabel, Faina and the cast of supportive neighbors--pragmatic George, boisterous Esther and their helpful wide-eyed son Garrett--really existed somewhere, somehow. (surely these must be real Alaskan folk...)I can only leave you with this: when you bring this book into your world, carve out time to give it your full attention. Then make a space for it on your shelf of favorites, it belongs there."}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "A beautiful, magic-tinged tale of an aging couple, the bleak Alaskan wilderness and a child who appears one day in the wood.Mabel and Jack always wanted a child, but after suffering a miscarriage, they begin to lose hope of ever conceiving. Mabel suffers in female society without a child of her own.She begs Jack to take her to Alaska for a fresh start. He agrees. But it doesn't work.The weather is dark and freezing. The ground is hard and takes more effort than Jack can give. They aren't thriving.\"All her life she had believed in something more, in the mystery that shape-shifted at the edge of her senses. It was the flutter of moth wings on glass and the promise of river nymphs in the dappled creek beds. ... Mabel could not remember the last time she caught such a flicker.\" pg 6, ebook.Then, out of the blue, a child magically appears during a snow storm.She is so light on her feet and silent, Jack and Mabel don't at first believe their eyes. The child travels with a fox and barely leaves prints to follow on the snow.\"What did he expect to find? A fairy-tale beast that holds young girls captive in a mountain cave? ... Or nothing at all, no child, no tracks, no door, only insanity bared in the untouched snow? That is perhaps what he feared the most, that he would discover he had followed nothing more than an illusion.\" pg 72, ebook.Mabel remembers a Russian fairy tale from her childhood, of a couple who builds a girl out of snow. In the story within the story, the girl becomes real.Could Jack and Mabel have created the child they have always dreamed of?\"I am sorry to say no matter which version, the story ends badly. The little snow girl comes and goes with winter, but in the end she always melts.\" pg 96, ebook.How will Jack and Mabel's story end?Recommended for fans of historical fiction and tales that contain magical realism.\"In my old age, I see that life itself is often more fantastic and terrible than the stories we believed as children, and that perhaps there is no harm in finding magic among the trees.\" pg 189, ebook.I thought The Snow Child was beautiful and well-told. Highly recommended."}, {"userName": "Kris", "userReviewDate": "Mar 25, 2012", "userURL": "http://www.goodreads.com/user/show/5974610-kris", "userReview": "This is a beautifully written book. The Snow Child is inspired by the Russian folktale in which a childless elderly couple make a snowchild that comes to life as a young girl. Ivey's use of the folktale is multilayered and inventive, and works very well in the book's setting of Alaska in the 1920s.I cared about the characters, but I especially loved the depictions of the Alaskan wilderness throughout the seasons. The novel also pays homage to freedom and individuality, while at the same time celebrating the bonds of friendship, love and trust that tie together friends and family. One theme that resonates with me is the importance of being a part of something larger than oneself - a family, a farm, a close friendship, nature."}, {"userName": "Lindsay - Traveling Sister", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/54886546-lindsay---traveling-sister", "userReview": "4 stars! I truly enjoyed the experience of reading this beautifully written book! The author, Eowyn Ivey, has an unbelievably unique and astounding way with words. She paints such a clear picture that draws the reader right into the snow filled fields of the Alaskan homestead. I was completely engrossed in Jack and Mabel's love story. The struggles they endured as a couple only made their bond stronger as husband and wife. I had endless sympathy for them as I witnessed their vulnerabilities as struggling farmers, their hopelessness at accepting that they could not bear children, their struggles to figure out where Faina fit into their world. I loved each and every character in this story - my most favourite being Esther, Mabel and Jack's \"neighbour\". She was outspoken and overbearing, yet she had such a warm, endearing way about her - it was like she commanded your love and respect without you realizing it. She welcomed Mabel and Jack into her life with open arms and loved them like family from the moment she met them. Mabel, being a shy, reserved woman, didn't know how to handle Esther at first with her outgoing, take-charge personality. I giggled to myself a few times while reading their initial interactions. I was hesitant in picking up this book due to the \"fantasy\" aspect, however, the \"magic\" of this story is so well done that I was able to accept it and \"run with it\". While I didn't love this book quite as much as Ivey's most recent novel, To The Bright Edge Of The World, I thoroughly enjoyed the experience of reading such a unique and beautifully written story."}, {"userName": "Debra", "userReviewDate": "Oct 30, 2012", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "What happens when a childless couple, Jack and Mable, build a child out of snow during the season's first snowfall? Magic! That is what happens. The Snow child is based on a Russian fairy tale called Snegurochka (The Snow Maiden). Set in rural Alaska, this book is atmospheric, eerie, hopeful, with an underlying sadness. The writing is beautiful, moving and takes the reader deep into Alaska and into the home of Jack and Mabel, into their lives, the lives of their friends, through the snow and into their hearts.Jack and Mabel have left Pennsylvania behind in search of a better quieter life. They really don't know just how harsh winter can be in Alaska. How hard it will be to grow crops and keep livestock alive. The darkness and cold weigh them down. They feel they are drifting apart. Mabel, at one point, tries to drown herself but the ice has other plans and she returns home to spend the evening with her husband. Both feel distant from each other. Both alone but living under the same roof. How lonely a life they have filled with sadness and longing for a child. They had a stillborn once but have no hopes that they will ever have a child again. I could literally feel the sadness seeping through the pages - drip drip drip. The longing, the loneliness, the sadness, the pain.Then one night they decide to tuck their loneliness away and venture outside and play as if they were children themselves. For one night they are able to forget their past loss, and be free. They play in the snow and fashion a child out of snow. They dress their \"snow child\" with a scarf and dress.The next day they see a little girl running through the woods with a fox as her companion. Could this young girl be their \"snow child\" They name her Faina. She brings change for both of them. The sadness that has been weighing them down melts away. Could this child, born of \"ice and snow\" be the answer they have been looking for. They begin to care for her and she them. They become a family. Faina comes and goes as she pleases, often disappearing to who knows where. She brings them gifts of berries and meat. Never really theirs but always a member of their family, Faina becomes their pride and joy. As the climate becomes warmer they begin to see her less and less until one day......Ivey has a gift for making the snow and weather another character in this book. I could feel the coldness, the silence of the snow and ice seeping through the pages. This book is very atmospheric. It is also heavy on emotion. Sadness is an underlying emotion in this book. Often while reading this book, I wondered \"what is real\", \"what is fantasy\" and \"does it really matter?\"Beautiful and eloquent, The Snow Child is heavy on atmosphere and emotion. Not all fairy tales have a happy ending. Will this one?See more of my reviews at www.openbookpost.com"}, {"userName": "Arah-Lynda", "userReviewDate": "Jan 16, 2012", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "This incredibly beautiful story was inspired by and tenderly envelopes an Old Russian folktale. One evening an elderly, childless couple build a girl out of snow. Come morning it is missing, leaving faint footprints, from where the snow child once stood. Set deep in the Alaskan wilderness, the environment is like a mirror on our couple, one that Ivey breathes life into, through the many seasons of this tale. I loved the stark, majestic beauty of the always there and always demanding landscape.Our couple, Jack and Mabel, have left Pennsylvania behind, with their still born child, and invested all they have in a homestead in Wolverine River, Alaska. Each of them pack up their own baggage, their own heartache, their own hopes, and they keep them close, insulating them from the memories of what might have been and from each other. But love has many rooms and Jack and Mabel have built a home. With the dream like quality of a good fairy tale I was quite simply enchanted.  A simple story, a wonderful rendition, an enchanting cover….come on!"}, {"userName": "Nandakishore Varma", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "There is a special kind of emptiness in a marriage, when both the partners long for a child without success. Their private moments change from solitude to loneliness: intimate chatter degenerates into monosyllables before ultimately descending into dark silence. The carefree laughter of a child, the picture of a smiling cherubic face, or the pitter-patter of small feet on the road all become exquisite torture - reminders of some esoteric happiness forever out of reach.I know... I have been there.It must be (at least in part) to tackle this anxiety creatively that fairy-tales use the trope of the childless couple quite frequently. The story is quite formulaic: there will be an old couple (mostly on the edge of a wood) who would have been longing for a child without success for ages. Finally out of desperation, the woman (or in some cases, both the partners together) would fashion a child's likeness out of some unlikely object such as wood or mud, treat it like a human child for one night, and - hey presto! - it would become human overnight. The overjoyed couple would raise it as their own, but the story would usually end badly, with the breaking of some taboo resulting in the child going away.\"Snegurochka\" (Snow Maiden) is a Russian fairy tale where the child is fashioned out of snow by a childless woodcutter and his wife, and subsequently brought to life by Father Frost, the spirit of the winter, who takes pity on them. The snow maiden lives with her foster parents quite happily until she falls for a human boy against the express admonitions of Father Frost - the warmth inside melts her, and she fades away bringing spring to the countryside in the process.From myths.e2bn.org:As the snow maiden faded away, spring spread over the land: the frost retreated and the small flowers of the fields began to bloom. Everyone was cheered by the return of spring. Everyone that is except, the young shepherd who felt desolate and cold, despite the warmth of the sun.As for the old couple, they felt their loss deeply but, in their hearts, they had always known the magic could not last. They were just thankful for the beautiful snow maiden who had brought such warmth and joy to their lives and given them hope in the depths of winter.But what of the snow maiden? Well, it is said that, as she melted away, her spirit was caught by Father Frost who retreated to far lands with the advance of Mother Spring. He took the spirit of his daughter across the stars to the frozen lands of the north, where she again took the form of a beautiful young woman. Here she plays all through the summer - on the frozen seas.But, each year in winter, on the first day of the New Year, Father Frost and the Snow Maiden return to Russia in their troika (sleigh). And they continue to work their magic, as they did long ago for the woodcutter and his wife, for those who are good and kind, particularly the children, bringing them small gifts and helping to make their dreams come true. -----------------------------------------Eowyn Ivey has taken this bittersweet story, transplanted it to the rural Alaska of 1920's, and woven a tale which is every bit as magical as the original. Her protagonists are Mabel and Jack, who are trying to make a living on their farm, fighting against the unforgiving climate as well as life, which has given them only the memory of a stillborn child to live on. The couple are slowly moving apart, and Mabel is on the verge of suicide when, in one blustery night of mad gaiety they a fashion a girl out of snow in front of their cabin. Next day, the child is gone - and a wild girl starts visiting them, clandestinely at first, then more and more openly. The girl, Faina, is more or less adopted by the couple soon. Their close friends George and Esther initially consider the unseen girl as a hallucination conjured up by Mabel, but after the initial shock of meeting her in person, comes to accept her as she is. Their youngest son, Garrett, a boy of the forest himself is initially antagonistic. Well, as so often happens, antagonism changes to fascination, mutual attraction and love... and the story moves towards its expected climax (and no, this is not a spoiler!).The beauty of this novel is that it does not follow the trope of the fairy tale blindly. Faina (the child) has a mysterious past as the daughter of an eccentric trapper who died in the forest. She lives off the wild, hunting and eating animals in a strangely feral manner. It is left to us to decide whether Faina is real or a phantasm. While such a style could easily become contrived, Ivey walks the tightrope expertly. There are times when we feel that the novelist is slipping into the realms of fantasy, but every time she pulls back just in time.Contrasted with Faina are Mabel and Jack, who are very real. Mabel, with her cultured upbringing and artistic tendencies, is the bridge that links the gritty and unromantic world of rural America to the poesy of the snowy slopes of the far north. In fact, the story is almost self-referential in the sense that Mabel owns a book telling the story of the snow maiden, which her father (a literature professor) used to read to her: however, she learns as an adult that he only pretended to read, because the tale is in Russian! Only the pictures make sense, including the terrifying last one of the melted maiden.We follow the characters with bated breath as they move along their pre-ordained paths - but the end, when it comes, is refreshingly different from yet absolutely faithful to the original. I will leave it at that.-----------------------------------------From myths.e2bn.org:In countries that had long harsh winters, the coming of spring was also an immensely important event, particularly to the poor for whom the winters could be extremely harsh. The Russian story of the Snow Maiden sees the battle between the eternal forces of nature (Father Frost and Mother Spring) for warmth to return to the land. And for spring to return, winter has to die. The theme and the interaction of these mythical characters with mortal people like Kupava and Mizgir through the character of the Snow Maiden, would have been very meaningful to people, who longed for and celebrated the return of spring. Birth, death, rebirth - these are the themes of ageless tales. There are no full stops in life, but an endless cycle of seasons through which we eke out our existence - brief candles, whose flames are ephemeral yet eternal at some level.Four well-deserved stars."}, {"userName": "Matt", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "With her sensational debut novel, Eowyn Ivey offers readers a healthy dose of rural Alaskan life balanced with a story that pulls on the heartstrings. Mabel and Jack have come to settle on the Alaskan home-front in the 1920s, having left behind the busy Pennsylvania lifestyle to which they had become accustomed. Childless and in their 50s, Jack and Mabel are forced to forge their own way and subsist on whatever they can accumulate. While Jack toils away on their land, Mabel’s idle time is spent remembering the child they lost and how devastating it was for her, having always yearned to be a mother. On the evening of the first snowfall of the season, Jack and Mabel venture out to build a little snow girl, adding all the accoutrements they can create, before turning in for the night. Mabel wakes the next morning to find the snow girl gone, likely destroyed by an animal. However, she is sure she’s seen something in the woods, when she leaves the safety of her home. Unable to convince anyone, Mabel wonders if a story from her childhood has influenced her. When Jack finally meets the girls in the woods, sure that this is no longer an apparition that Mabel has concocted. Jack soon makes a discovery about which he tells to no one and invites the young girl to come live with them. The as-to-now nameless girl soon admits to being called Faina, a unique name that both Mabel and Jack adopt with ease. While Faina is happy to live with her new parental figures, she also enjoys her independence and disappears on occasion, off into the woods, where she once made her home. Mabel soon receives a package from her sister, one that includes the story read to her as a child. The piece explores the life of an older couple and their connection to a snow girl, though, like most fairy tales, the story takes a turn for the worse and has an ending that is anything but happy. Guarded with the knowledge of what might cause Faina to leave forever (or disintegrate before their eyes), Mabel and Jack become protective of the child they always wanted but never could have. As the years progress, Faina develops into a young woman with new issues that must be addressed, adding new layers of concern on the Alaskan home-front. Ivey’s story is both captivating and chilling to the core as the reader sees just how precarious life can be and the fragility of familial bonds. Recommended for anyone with a penchant for slow evolving stories that find their action and suspense in the smallest developments.I had heard much about this book before I got my hands on it, with mixed reviews. I liked the premise and could not help but enjoy how the story evolved in the rural Alaskan communities. I felt a connection to the story and characters, not distracted with busy city life or blazing gunfights. The characters are well-crafted, mixing backstory with development throughout this piece. Ivey does well the flesh-out the Jack and Mabel characters from the outset, balancing their current lifestyle against the reasons they fled Pennsylvania and everything they knew. The rough lifestyle contrasts nicely with the love they show one another and, eventually, Faina, who is equally interesting a character. Developed from the Russian fairytale that Mabel knows so well, the reader develops an somewhat deep seeded expectation of how Faina will act and what will become of her, though being touch by love in human form (as opposed to animal) changes her perspective on things. The story, though not as fast paced as some would like, flows nicely and offers numerous symbols throughout. I cannot express how pleased I was to see the slow development never falter and how Ivey kept the reader enthralled, even if things did not happen at breakneck speed. As a very brief aside, it is addressed throughout parts of the novel that fairytales, while geared for children, tend to have strong negative outcomes (at least until Disney morphs them) and horrid happenings. Many of the tales Neo and I have read together are gore-filled and nothing I would want to present to a child, as is The Snow Girl in reference to the story Mabel read as a child. Brilliantly developed for a debut novel and I am pleased I did not listen to those who panned this book quite heavily. Kudos, Madam Ivey, for this debut success. I will be reading your second novel and hope it packs as much punch as this one did for me.This novel fulfils Topic #6 (A Book About the Current Equinox) in the Equinox #2 Reading ChallengeLove/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"userName": "Sara", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "The Snow Child is based on an ancient Russian fairy tale, and like any good fairy tale, it touches the edges between what is real and what is imagined. Eowyn Ivey commands the language in such a beautiful, moving way, that it would almost not matter if the story was not spectacular. But, never fear, she couples all that almost poetic language with a story that is moving and captivating and mysterious. This is the kind of magical realism I can buy into. It is like good slight of hand, you cannot stop yourself from believing what you see, or in this case what you read.All her life she had believed in something more, in the mystery that shape-shifted at the edge of her senses. It was the flutter of moth wings on glass and the promise of river nymphs in the dappled creek beds. It was the smell of oak trees on the summer evening she fell in love, and the way dawn threw itself across the cow pond and turned the water to light.I found myself whispering, “I believe in those things as well.”I certainly cared about these people, each of them. I wanted so much for Jack and Mabel to find happiness and reward for their hard lives. I loved Fiana, who seemed to be so at one with nature and so self-sufficient, and yet so lonely. I did not read, so much as devour, this book. It is sweet and poignant and infinitely realistic. I can file this one under F for “favorite”."}, {"userName": "Angela M", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "Is she real or is this just a fairy tale ? It didn't matter - the writing is just so amazing ! I felt the brutal cold , saw the landscape , felt the deep pain of Mabel & Jack and loved Faina . This will stay with me for a long time ."}, {"userName": "Scarlet", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/3839903-scarlet", "userReview": "“No warm blood in me doth glow,Water in my veins doth flow;Yet I’ll laugh and sing and playBy frosty night and frosty day–Little daughter of the Snow.“But whenever I do knowThat you love me little, thenI shall melt away again.Back into the sky I’ll go–Little daughter of the Snow.” - An extract from Little Daughter of the Snow by Arthur Ransome.You can read the short story here.This book... it's a dream. An unhurried, ethereal, captivating dream - so captivating, that I cleared out my currently-reading shelf after the first two pages so that I could bask unhindered in the spell this book cast on me.The Snow Child is a retelling of the Russian fairy-tale Snegurochka or The Snow Maiden. Eowyn Ivey's debut tells the story of an old childless couple in the Alaskan wilderness, who shape a little girl from snow during the winter's first snowfall. What happens thereafter is pretty obvious.The first half of this book is absolute perfection. The Alaskan setting, the characters, the magic in the winter air - everything comes alive through Ivey's gorgeous prose. Somewhere past the halfway mark however, the story takes a detour from the original fairy-tale and things get impossibly more real with every page, finally ending on a note that's too bizarre to fully comprehend. The Snow Child constantly hovers on the border between illusion and reality, which may either be the book's strongest point or it's undoing, because if you think about the plot too long, many threads come untethered and threaten to unravel.Jack and Mabel are some of the realest characters I've ever encountered. I cannot claim to exactly understand their anguish; I'm too young for that. But I could feel it - in the silence, in the breath of the narration, in the things that were deliberately left unsaid. I understand how the absence of something (or someone) can haunt a person like a presence. I understand why seeking an explanation may not be so important when the thing you most desire ends up at your doorstep. On the contrary, the Snow Child herself, or Faina as she's called, never felt real to me. I'm guessing this was the author's intention. It works well in the beginning when Faina is more of an illusion, coming and going like a shadow. The second half adds (or tries to add) more substance to Faina - something I had trouble digesting - which is probably why it felt weaker in comparison.The entire story has an undercurrent of sorrow to it. In the beginning, Jack and Mabel grieve for what they never had. Once Faina enters their lives, this grief takes the form of a quiet desperation; the dread of losing what they now have, even though Faina is more of a phantom-child than a real daughter.Another thing that struck me was the occasional streak of violence. There are many animal killings in the book. Surviving in a landscape like Alaska would entail hunting for meat but in retrospect, I feel these scenes were strategically placed at intervals. Like the visual of blood on snow was meant to combat the fascinating idea of a child born of snow.Not much happens in the book plot-wise. Some of the most enchanting parts are also the quietest. It's like peering into a snow-globe - the scenery does not change; yet, there's something so captivating in simply watching the glitter settle, and also this feeling of fragility, like how the world inside the globe could shatter in a single fall.Fairy-tale or not, The Snow Child requires you to follow the rules of one: It doesn't matter why or how things happen; just that they happen. If you can do that, this book will take you on an enchanting journey.A stunning, stunning debut. Highly recommended."}, {"userName": "Linda Robinson", "userReviewDate": "Jul 22, 2012", "userURL": "http://www.goodreads.com/user/show/2613351-linda-robinson", "userReview": "Amazing talent, beautifully delivered. This is a five sense book, and maybe a sixth and seventh as well. I could hear a bull moose snorting, swan screaming, snow crunching, river ice cracking. I could taste moose meat for the thirtieth and 100th time; smell wet wool and blood, birch fire and moonshine. I could touch the two-man saw, feel the weight of an ax, and the tiny threads of intricate embroidery. And always, always the snow and the earth beneath. I could see rows and rows of crops growing in the heat of the short Alaska season - in fact I dreamed about it last night. Sense of place is superbly developed, as expertly crafted as a prize winning pie, or a winter coat made reverently by hand. Ivey grew up in Alaska and clearly loves where she still lives. The characters in this debut novel are cradled, grown, tried and triumphed in the rugged, unforgiving wilderness. And out of the night in an Alaska blizzard, when grief and solitude are crusted around homesteader hearts, a little girl with pale eyelashes and a fur hat appears in the frost on the window."}, {"userName": "knig", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/6163905-knig", "userReview": "Poor Eowyn Ivey. Well, not literally. This novel probably secures her pension annuity better than anyone else’s. Its Big (both novel, hence, pension). But if she is the woman I suspect she is, she’s likely twisting and turning at night over how she botched a masterpiece and brought a spectacular turn to heel.Of course any reference to ‘masterpiece’ is biased. One man’s meat and another’s poison applies. But. There is something, something, about screwing around with childhood folklore, which guarantees instant and unconditional empathy. Inasmuch as we are all weaned on the magic of folktale generality, our first foray into making sense of the world, so that any return to it is so sacred an author needs only to wrestle failure out of guaranteed success.Ivey falls captive to the tale of Snegurochka, and tries her hand. Already she is ahead of the game. Running a bookshop in Alaska, she is no stranger to snow, remoteness, isolation, and the magical synechdoche of man and nature. The woman has a toolkit you and I don’t: so bring it.And she’s off to a stunning start. An elderly couple in Alaska. A snow maiden. Is she real? Is she a fayrie? A slow tease in exquisite narrative continuo layers realism with phantasia in a blancmange of unfettered expectation: I’m swept along in ephemeral tidings of crenulated reality: a splintering of dimension which rivets and furrows into logica long forgotten and discounted: a resurrection of belief and hope and wondering: a sense of wonder, a surreal wisp. And then: Ivey reaches a stumbling block: I can picture her frantic tepishorean agony as she searches for a way forward, and....flounders. A half baked incoherent denouement where maiden thrives in heat but melts in cold: huh, huh? A cold mother, a listless entity? Come on, Ivey: what did you do to Snegurochka? Child abandonment? Really?No. Snegurochka abandons. But only those who are worthy. Don’t muck with my childhood bread and butter. I really, really, don’t need a 21c Grimm. I’m grim enough as it is."}, {"userName": "Brenda - Traveling Sister ", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/10841164-brenda---traveling-sister", "userReview": "This was a sister read with Norma. We did the review together and posted it on her reviews.If you are interested it can also be found on our blog as well http://www.twogirlslostinacouleereadi..."}, {"userName": "Dem", "userReviewDate": "Feb 12, 2012", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "The Snow Child by Eowyn Ivey is a wonderful fairytale for adults(and whoever fancies it) set against the harsh backdrop of 1920s Alaska. Sometimes a little of what you fancy does you good ! And so I fancied a fairytale and it did me the world of good!!!This is the story of Jack and Mabel a childless couple who move to Alaska to farm and to etch a living from the harsh and frozen land. A man and woman set in their ways, Jack the stubborn sort who is too proud to ask for help and Mabel who fears friendship and both mourning the loss of their only child in their own lonely way. One night after a heavy snowfall they make a snow child and adorning the figure with mittens and scarf. The following morning the snow child has been trampled and the mittens and scarf are missing and the couple spot a small figure running through the trees. Mabel recalls an old Russian Fairy tale about a snow child coming to life and hopes she has made her longed for child that she can love. Is she real or a just imagined by Mabel and Jack?There is so much to love about this story, I was so excited to read an adult fairytale, The details of Pioneer life in Alaska are beautifully written along with the description of the harsh winter environment and the animals naive to this country. This is a novel rich in characters and prose and for a debut novel it is extremely well written. A tale of love and loss of friendships and hardships. A book that will stay with you long after you finish."}, {"userName": "Karlyflower *The Vampire Ninja, Luminescent Monster & Wendigo Nerd Goddess of Canada (according to The Hulk)*", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/17243568-karlyflower-the-vampire-ninja-luminescent-monster-wendigo-nerd-godde", "userReview": "I, is for Ivey\n5 StarsI'll let you in on a little secret *shhhhh* I love fairy tales, and the darker they are the better I like them. There is something so intriguing to me about the extremity of these stories, they appeal my twisted little brain. Oftentimes in darker, Grimm-style tales the punishment is so unsuitable for the indiscretion. It reminds me of \"Hannibal\" and his penchant for serving up people who are rude to him for dinner. So EXTREME, so deliciously *snicker* finite. I mention the above as backstory to me, not to this story. This isn’t that type of story. This is a dark, rather bleak retelling of The Snow Maiden(A fairytale I have NOT read but have heard several variations of in my life). The Snow Child is set in the 1920’s in the brutal and uncompromising land of Alaska. A land where the beauty is truly sublime!! Mother Nature can, and will, kill you if you don’t bow to her whims. There we meet Mabel and Jack, an older couple who has moved to Alaska after the traumatic loss of a child, and encounter the ferocity that is nature. This is a story with much texture and anguish to it. It’s backbreaking work eeking out a living on a homestead in Alaska and Ivey holds no punches in showing the reader just what a toll those conditions will take on a person. There is A LOT of humanity to this tale; a bevy of miscommunications and secret keepings take place between these two along the line. And while there is a fantastical side to this tale, Ivey does an incredible job of making that fantastical believable. The Snow Child is a beautiful and raw tale. The hunting scenes are AMAZING which, as the daughter of a hunter, I thoroughly applaud Ivey for. This isn’t a cookie-cutter retelling here. I would recommend this story to anyone who loves darker fairy tales and/or stories of human resourcefulness and survival."}, {"userName": "Charlotte May", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/14002983-charlotte-may", "userReview": "\"It was beautiful, Mabel knew, but it was a beauty that ripped you open and scouted you clean so that you were left helpless and exposed, if you lived at all.\"What a beautiful, harsh and wintry tale! An odd pick for me to read in June/July but I felt like I was right there in deepest Alaska, with the powerful landscapes and dark winters. Mabel and Jack have never been able to have children, since they had a still born baby. Escaping their grief and the stares of those around them, they move to rural Alaska where they can begin anew. One day they build a girl out of snow and so begins a magical tale of a girl born to the snow and ice, who visits during the wintertime but flees as soon as the snow starts melting. It is a powerful story of love and loss, made all the more poignant with the harsh landscape depicted and the struggles the people go through in order to survive such extreme climates. An incredible tale with real, honest and believable characters. They are all flawed, they are all human, and they all become entranced by The Snow Child."}, {"userName": "Jennifer", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "“In my old age, I see that life itself is often more fantastic and terrible than the stories we believed as children, and that perhaps there is no harm in finding magic among the trees.”\n\n Many Russian folk tales feature a common character known as Snegurochka (the Snow Maiden). She is the daughter of the immortal Gods: Father Frost and Mother Spring, and she usually goes to live with humans to care for an elderly couple who have no children. Some folk tales feature her as a girl unable to know love until Mother Spring takes pity and gives her this ability, but as soon as she falls in love, her heart warms her and she melts. Other tales show her melting when coming in contact with fire or warmth. In Eowyn Ivey's debut novel: The Snow Child, all three of these themes are incorporated and the result is otherworldly. This novel is harsh and feral but also shows the beauty of resilience, it is both sad and hopeful, it is filled with magical realism but manages to remain palpably real. I found The Snow Child to be absolutely stunning and I can't believe I waited this long to read it. There were times it felt a bit too long which served as a sporadic distraction, but overall it was a near perfect read for the winter season. Seriously, check it out.My favorite quote:“She could not fathom the hexagonal miracle of snowflakes formed from clouds, crystallized fern and feather that tumble down to light on a coat sleeve, white stars melting even as they strike. How did such force and beauty come to be in something so small and fleeting and unknowable? You did not have to understand miracles to believe in them, and in fact Mabel had come to suspect the opposite. To believe, perhaps you had to cease looking for explanations and instead hold the little thing in your hands as long as you were able before it slipped like water between your fingers.”12/20/2017: Such a lovely story with stunning writing. A little long but I absolutely loved it overall. Full review to come ❤️"}, {"userName": "Wendy Darling", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "4.5 shining stars Utterly, utterly gorgeous. Review to come."}, {"userName": "Aubrey", "userReviewDate": "Dec 02, 2011", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "I'm puzzled as to why this isn't considered Young Adult. Well, more of an eyebrow raise of sardonic 'Really? You're going to go that way?', for I have a pretty good idea of why this was pushed up into the adult realm. I simply don't agree with the argument for such.Now, I adore new renditions of old tales as a matter of principle, for a host of reasons ranging from the past being a foreign and sometimes hateful country, to a childhood lust for urban fantasy that I never quite outgrew. Any story may be retold, but even my current appetite for more sedate literature has not dampened the intrigue that sparks up whenever I see mention of a fairy tale told anew. It is that otherworldly aura in the hard-bitten setting of modern times that I crave, the best being the exquisite balance between the baleful spikes of reality and the Old Testament viciousness of Grimm. Needless to say, I went into this story with definite expectations. Said expectations were not carried through. The characters were solid yet utterly predictable, the plot meandered along the original story line with little effort to circumvent the old with the delightful heartbeat of the new, and that visual imagery I had heard so much about failed to inspire the slightest bit of enraptured imagination. Instead, I was left with the feeling that while the author should get credit for creating realistic letters for her non-writerly characters to send to each other, I would have preferred it had this subpar decency not carried through the entirety of the book. When choosing between characters at a realistic level of scripting and a masterful author more concerned with writing than with believable differentiation, I will always choose the latter.I must mention that during the reading of this I was also being simultaneously bowled over by Wide Sargasso Sea, whose sharply lined prose of dripping luridness would likely have paled the majority of most novels' imagery to a fraction of their power when in solitude. This dual reading may have also contributed to the feeling of reading drag. WSS is half the length of TSC with much briefer sentences, but every word of every line of every page is steeped in meaningful craftsmanship. Compared to this, TSC comes off as both clumsy in structure and bloated in the packing peanuts rather than the dense sense of the word; the page paid per inch of insight was high with this one.In the end, it is this overarching simplicity that both failed to appeal to me as well as made me wonder at the lack of Young Adult label on this book. Granted, there are a number of references to sex and other more erotic undertakings, but never were they explicated beyond a few vague hints at the less 'obscene' body parts. 'Twas this reason that likely shoved the rating up, a false inflation in my mind that is no way accompanied by the usual increase in brutality or complexity of literature for maturer audiences. Ah well. At least it didn't win the Pulitzer. That would have sunk my evaluation of the Prize itself even lower."}, {"userName": "Amanda", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "Poignant, melancholy and slow-moving, The Snow Child probably isn't for everyone and I'll admit that it probably would have been a 3 1/2 star if I hadn't read it at such a seasonally appropriate time. With temperatures in the single digits, the wind whipping outside, and my part of the world brought to a halt by the \"wintry mix\" falling from the sky, this was the perfect book to curl up with and therefore I'm tacking on that extra half star anyway.Well past middle-age, Jack and Mabel strike out on their own when they move to Alaska in the 1920's. Such an adventure would typically be a young couple's game, but Jack and Mabel are lured to the recently acquired U.S. territory in the hope that it will allow them to leave behind the one great disappointment in their lives: the stillborn child they buried in an orchard back home. Proximity to friends and family who have children of their own means that Jack and Mabel's emotional wound has never fully healed, so they purposefully break away in the hope that they will be drawn closer together and move past their grief.It's not long, however, before the long, dark Alaskan winters take their toll on the couple. Isolated in their own spheres--Jack in the fields, Mabel in the home--depression and blame begin to settle into an otherwise happy marriage. In a moment of youthful spontaneity, the couple builds a snow child one night and it's not long before they begin to see a young girl, a wild thing at home in the cold and the forest, moving through the woods and causing them to tentatively believe that maybe they've at last been granted a child of their own making.Based upon a Russian fairy tale, The Snow Child could easily be maddening to those who like definitive answers and clear resolutions. Is the young girl (whose name, we learn, is Faina) an orphaned child, a daughter born of snow and winter come to life, or a figment created from depression and longing? There are no clear answers to these questions, but I don't think they are questions that really matter because, in the end, The Snow Child is about grief and forgiveness. In her portrayal of Jack and Mabel, Ivey gives us the basic template for any marriage: no matter how strong the bond, individual grievances, both real and imagined, can build and fester. Whether or not a couple confronts these grievances determines if the marriage will fall apart or hold together. There's also complexity to the characters. At first, Mabel seems too refined and erudite for survival in the rugged wilderness, while Jack faces both the past and the future with unflinching stoicism. As we're allowed into their interior lives, however, we learn that Mabel has hidden strengths that hold her in good stead and Jack hurts far more than he's willing to admit, lest it render him unable to protect Mabel. Through their relationship with Faina, Jack and Mabel confront the painful past together and are ultimately blessed with the life they believed was well beyond their grasp. Cross posted at This Insignificant Cinder"}], "description": "A bewitching tale of heartbreak and hope set in 1920s Alaska.Jack and Mabel have staked everything on making a fresh start for themselves in a homestead 'at the world's edge' in the raw Alaskan wilderness. But as the days grow shorter, Jack is losing his battle to clear the land, and Mabel can no longer contain her grief for the baby she lost many years before.The evening the first snow falls, their mood unaccountably changes. In a moment of tenderness, the pair are surprised to find themselves building a snowman - or rather a snow girl - together. The next morning, all trace of her has disappeared, and Jack can't quite shake the notion that he glimpsed a small figure - a child? - running through the spruce trees in the dawn light. And how to explain the little but very human tracks Mabel finds at the edge of their property?Written with the clarity and vividness of the Russian fairytale from which it takes its inspiration, The Snow Child is an instant classic - the story of a couple who take a child into their hearts, all the while knowing they can never truly call her their own.", "title": "The Snow Child", "url": "http://www.goodreads.com/book/show/12749843-the-snow-child", "average": 3.96, "cover": "https://images.gr-assets.com/books/1404140605l/12749843.jpg", "reviews": 12558, "authors": [{"url": "https://www.goodreads.com/author/show/4823432.Eowyn_Ivey", "name": "Eowyn Ivey"}], "type": ["Fiction", "Fantasy", "Historical", "Magical Realism", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/12749843-the-snow-child", "http://www.goodreads.com/book/show/11250053-the-snow-child", "http://www.goodreads.com/book/show/15932273-the-snow-child", "http://www.goodreads.com/book/show/12490153-the-snow-child", "http://www.goodreads.com/book/show/11804125-the-snow-child", "http://www.goodreads.com/book/show/13528343-the-snow-child", "http://www.goodreads.com/book/show/27917957-to-the-bright-edge-of-the-world", "http://www.goodreads.com/book/show/23353117-last-days-in-hunting-camp", "http://www.goodreads.com/book/show/30799849-to-the-bright-edge-of-the-world", "http://www.goodreads.com/book/show/40385423-the-snow-child-chinese-edition"]}