{"ratings": 32124, "userreviews": [{"userName": "Tracey", "userReviewDate": "Nov 12, 2008", "userURL": "http://www.goodreads.com/user/show/901630-tracey", "userReview": "I love this book. It has been 14 years since I have read it and I still remember clearly what it means to me: Life is long....and in this long life you lead a series of mini-lives. In each \"life\" you become a different version of you. We are blessed with the chance and sometimes forced against our will to reinvent ourselves again and again until one day we are very old and find that we are living in Florida wearing polyester pantsuits. Did you ever imagine that would be you? That person you marry at a ripe young age may become someone from your past that now seems as insignificant as an old high school boyfriend. That job we have today that's so important may be a mere blip on the radar when we are 85. Will you even remember the name of the company? It's something I like to think about. And it works both ways. Sometimes I hope that the \"life\" I'm in never ends and my fear is that one day its time will be up. In other periods of my life, I remember that nothing is forever and this some day may not be remembered by me at all. Very few books have given me such a lasting message. I plan carry it with me throughout my long lifetime."}, {"userName": "Carol", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "[I AM NOT AT PEACE (sure wish Cuyler would have told Daisy how much he loved her mother, given her more affection and Mercy's engraved 18k wedding ring as he once planned instead of burying it in the time capsule under the pyramid) (hide spoiler)]"}, {"userName": "Sarah", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/1309716-sarah", "userReview": "A breathtaking and thoroughly original novel. I'm completely in awe of the choices Shields made in the shaping of this narrative. The whole is flawlessly cohesive. The parts are poetry unto themselves.Essentially, it's a book about loneliness, every kind of loneliness: starved, suffocating, denied, cherished, physical, existential, or simply the result of petty misunderstanding. --And it's not always clear cut. She allows for ambiguity. She allows for the reader's subjective response, whatever that might be. And then she gently guides you to a different vantage point, one you hadn't considered.The body, through birth, sex, illness, and death is discussed...graphically...but with such grace, such reverence, such heartbreaking candor, it's actually beautiful.This novel struck me to the core.I love it so much, I don't even want to know what others have said about it!"}, {"userName": "Suzanna", "userReviewDate": "Jul 24, 2008", "userURL": "http://www.goodreads.com/user/show/1122133-suzanna", "userReview": "I didn't like this book, but it was mostly because I didn't like the main character and her lack of personal substance. She never, ever, even once, feels any joy, passion, or grief. There is one period in her life where she appears to experience depression, but again, there is a lack of strong emotion, which really is typical of depression. A person who has three children, marries twice, and is widowed twice, usually experiences some sort of deep emotion. This flaw in her personality had me lacking empathy with her. It seems the author's basic premise is that the main character, Daisy, lacks strong emotion because she was not raised by her biological mother, who was herself an orphan, and that these things have some how caused both her and her mother to be inherently flawed. (Either that or Daisy has physically inherited this dysfunction from her mother, but I lean toward the former because of some passages in the story.) They lack passion and passionate expression. Daisy never hears she is loved, nor do you find love expressed by her; her mother, Mercy, never said she loved nor otherwise expressed love, although she was loved greatly and with deep passion by Daisy's father. What I did like most was the author's use of symbolism. Stones and flowers are heavily used, perhaps overly so at times. There is the building of monuments by Daisy's father (of course made of stone), his life as a quarryman, Daisy's gardens, her second husband's love and knowlege of plants, names of characters, and much more. If that sort of thing excites you, you might love this book for that alone.I would also like to say I'm surprised so many reviewers found this book \"funny\". I thought it was terribly depressing. There are a few amusing passages, but I couldn't see calling the book as a whole funny. And lastly, it is strange to me that this is considered a fictional autobiography. Most of the time it is third person narrative; granted, there are points when Daisy is apparently refering to herself in the third person (as Mrs. Flett or some such, which I found a bit disturbing). I suppose it helps contribute to that feeling of her lack of sense of self, the void within her life that she herself doesn't really fill - is not capable of filling. There are other times it does not feel like her voice, just narrative, and there is just a small portion of the book that is in first person. It does not feel at all like a diary, which again may be for the effect of distancing the main character from herself. Someone with this personality disorder might write a memoir in this manner and call it a diary, I suppose. And it does cover Daisy's life from beginning to end.The novel's well written, and I think the author achieved what she set out to do. Overall, just not my cup of tea."}, {"userName": "Fabian", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "The type of book others rigorously want to imitate. That is, the elusive \"turn of the century all American novel\", with myriad glimpses at gorgeous post millennial metafiction. \"The Stone Diaries\" no doubt inspired other works of immeasurable brilliance like T. C. Boyle's \"World's End\" and Coetzee's \"Elizabeth Costello\"--it is heartbreaking, endearing, and, best of all, accessible. (Although the Puig-like tricks, that is, Latin American lit. concessions, are quite distinguishable.) The symbols of marble and hard rock as counter-contrasts to flimsy flowers and biology are made... eternal, in this must-read novel. It's a true reminder of the pesky but overpowering relationship between life and death, or the ethereal and the tangible. This one deeply & truly astonishes."}, {"userName": "Grace", "userReviewDate": "Dec 06, 2007", "userURL": "http://www.goodreads.com/user/show/661691-grace", "userReview": "This book won a Pulitizer Prize in 1995, and it was an honor well deserved. I'd never even heard of it, I just picked up up at the Goodwill because the description on the back cover intrigued me, but once I picked it up, I couldn't put it down.The story is a fictionalized autobiography of one Daisy Goodwill Flett. Born around the turn of the 20th century and living until the 1980s, Shield's Flett reflects simultaneously on her own tragic life and the life of a North American century. The mix and overlap between these two subjects is fascinating, and Shields' writing is first rate, making this a pleasure to read.Though it is written as if it's an autiobiography, The Stone Diaries does not limit itself to subject matter that its protagonist could have known. Starting on the day of Daisy's birth, with her mother, Mercy, and moving both backward and forward through time, the book gives perspectives and experiences of many of the supporting characters as well, including Daisy's father, the woman who raises her, her husband, and her children. Though the speaker is sometimes not clearly identified, the moves between perspectives are far less confusing than would be expected (don't worry, it doesn't read like As I Lay Dying or anything like that). The story is actually told in a way I don't think I've ever seen before, with a mix of omniscent and present narration, and constantly moving time and perspective. Shields deserves her award just for being able to pull that off successfully, nevermind the story!But the story is compelling. Daisy's life is hard and full of tragedy (the childbearing death of her mother, twice widowhood, etc.), but the tragedy takes backseat the both Daisy's and the other characters' knack for reinvention of themselves when circumstances change. Both as a human story and as a parable for the countries in which the novel takes place (the U.S. and Canada), these reinventions work very well.I was impressed enough by this book that I passed it on to my mother, and I will be on the lookout for more of Carol Shields' work. I'd definitely recommend it."}, {"userName": "Bam", "userReviewDate": "Apr 02, 2016", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "#2016-usa-geography-challenge: INDIANA#2016-aty-reading-challenge--week-15: a book set in the past (100 years ago)I seem to have an affinity for novels about women's lives set in the past century. Perhaps it is because they give me glimpses about what my grandmother's and mother's lives might have been like. Some of my favorites include So Big and A Tree Grows in Brooklyn. The Stone Diaries now takes its place among these favorites. It is written as part autobiography/part biography by an omniscient narrator, about the life and times of Daisy Goodwill Flett, who was born in 1905 and died in 199_. \"Biography, even autobiography, is full of systemic error, of holes that connect like a tangle of underground streams.\" And this telling of Daisy's life as daughter, wife, mother, is full of holes, gaps in the narrative, letters that present only one side, etc. And these holes perhaps represent the huge, gaping hole in Daisy's life that should have been filled with her mother's love. For Daisy's mother, Mercy Stone Goodwill, died giving birth to Daisy. She was such an obese woman that she didn't even realize she was pregnant. And poor baby Daisy was laid on a cold stone table, alone in the world for her first breaths. \"Remember this poor child is motherless, and there's not one thing worse in this world than being motherless.\" Her father is too distraught over the loss of his beloved wife to care for the infant so Daisy is raised by the neighbor lady, Clarentine, who abruptly deserts her husband and moves to Winnipeg to live with her son, Barker, a professor. Daisy stays with them until Clarentine's death when Daisy is eleven. Her father, a virtual stranger, finally takes charge of her then and they move to Indiana to start a new life together.\"And the question arises: what is the story of a life? A chronicle of fact or a skillfully wrought impression? The bringing together of what she fears? Or the adding up of what has been off-handedly revealed, those tiny allotted increments of knowledge?\" This novel does a masterly job of revealing all through bits and pieces, through impressions.Shields' writing can be blunt, sometimes funny, often poignant: \"Nor, though she knew she had been loved in her life, did she ever hear the words 'I love you, Daisy' uttered aloud (such a simple phrase), and only during the long, thin, uneventful sleep that preceded her death did she have the wit (and leisure) to ponder the injustice of this.\" My kind of book!"}, {"userName": "Elizabeth", "userReviewDate": "Dec 18, 2008", "userURL": "http://www.goodreads.com/user/show/5-elizabeth", "userReview": "It's ironic that I read this book while I was reading Sex and the City. The two novels are as disparate as different planets. One book is a about an ordinary housewife struggling with life's little trials, the other, a place peppered with big names and obscene money, fur coats and Lear jets. Guess which one was better. This book is phenomenal. It's probably the best book I've read in the last year. And it's funny to think about because there is no person, or plot twist, or moment that makes it memorable. Each and every page is special because the perspective of this woman is so true, so sensitive, so illuminating. Somehow even a minuscule event in this woman's life becomes important--great even. This book is truly about the journey."}, {"userName": "Sara", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/10665178-sara", "userReview": "“My mother’s name was Mercy Stone Goodwill.” And so begins what appears at first to be an autobiography of a woman named Daisy but yet as the pages unfold, it becomes something unique, an outsider’s observation of someone’s actions or inner thoughts (though at times even the narrator, be it Daisy or another does not seem to know exactly what is going on). It seems at times to be a pseudo-biography, or perhaps (more apt), to be a philosophical treatise on human nature and a woman’s psyche, or maybe it is a somewhat humorous yet sad look at the place of a woman in the twentieth century. The novel explores what one thinks as one is dying or ill or going through the loss of a loved one but then explains that although it has the appearance of truth it might just be all made up. However, as the author makes clear, if we are told it is the truth we can accept it.The ins and outs and ups and downs in the life of an ordinary woman could have been told in an even, flat tone with perhaps exclamations when a milestone is reached (age 31! Marriage! 3rd child!), but instead the narrative meanders, always going forward but yet constantly looking back over its shoulder at certain places so we can peek into the minds of others and be a part of their going forth into the world apart from Daisy. One chapter is told entirely in letters (only letters TO, never FROM) and another chapter is a series of interviews with people who “knew Daisy when”. Although it is doubtful these interviews happened, they ring of truth, and because Daisy is never very forthright herself about what’s going on, the opinions and insights of others are important to the narrative.In the end we are left with a shopping list, a bridal trousseau, school awards, a collection of books, fingernail clippings, and a memorial write-up of a life lived. Daisy’s thoughts about life and what others perceived about her life (sometimes wrongly, but that would only be natural) are also left with us.As I read this book, I would often think – this is a strange novel. Sometimes it made me wince, sometimes it made me laugh. This book touched on subjects not often analyzed or seen in the fiction that I normally read. “Mom! Tell me where babies come from!” Then, “Ooo, yuk!” come to mind as one great scene. The inclusion of pictures (!) was definitely a pleasant surprise. The different writing styles was interesting and although I sometimes wondered if I actually liked this book, I did find I had to read to the end. The observations made by the author were sometimes painful but very perceptive. If at times it seemed to get wordy and bogged down in too much analysis, the author changed the style and started a new chapter in Daisy's life.From “The tide of fertility and the consolation of fruit salts” to “her faltering pendulum heart, her stiffened coral lungs” the descriptions and comparisons in this book are beautiful and poetic and some I had to read several times so I could fully appreciate them. It's 4 stars instead of 5 for me as at times I was impatient for the story to move forward but the book is incredible for the observations the author makes about our lives."}, {"userName": "Gill", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/18845147-gill", "userReview": "I've just finished reading this for the second time, the first time being several years ago. The more I read by Carol Shields, the more impressed I am by her writing skills. I think the structure of this book is excellent, and very, very skilled."}, {"userName": "Nranger7", "userReviewDate": "Feb 27, 2013", "userURL": "http://www.goodreads.com/user/show/17865681-nranger7", "userReview": "I guess I cannot stand Pulitzer Prize winning books. I have yet to read one that I've enjoyed. I actually was disappointed that the author passed away simply because I couldn't tell her how much I disliked this book. I'm guessing the changes from first person to third person were delibrate and artsy-fartsy, but I found it annoying. I barely got through the first chapter because I was sick and tired of the constant explanations of how the character of Mercy was a large woman. (I get it! She's fat! Move on!!) Same thing with Barker. (He's boring! I get it! Move on!) Way too much description when it came to flowers as well. Too much filler and a waste of my time to read. And what is up with the fake family pictures??? After having to put up with a chapter detailing how morbidly obese Mercy Stone was, I was pretty mad that the picture provided of Mercy was not nearly as huge as I imagined. The woman in the picture was overweight, but not to the extent that I was led to believe by the text. Sorry...I'm not one of those shallow people who thinks being 20 pounds overweight makes one \"obese\"."}, {"userName": "Dianne", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/3222213-dianne", "userReview": "I know this won't win me any friends among Canadian readers, but I don't like Carol Shields writing. Granted I've only read this one through to the end. A few years ago I started another one and didn't like it either so I quit about a quarter of the way in. I suspected at the time I was not a \"good\" reader and that her books were over my head. I've gained some \"reader confidence\" since then and learned that it's ok to not like certain styles of writing just on the basis of personal taste. Hence the freedom I feel to hate Ulysses by James Joyce without guilt, but that's a whole other story.This novel follows the life of Daisy Goodwill from her birth in her mother's kitchen in 1905 to her death in the 1990s. It wasn't an ordinary life, if there even is such a thing. She never knew the mother who died bringing her into the world. She was raised by a neighbour until circumstances changed, requiring Daisy to go home and live with her father. At that point she is eleven years old and she and her father are complete strangers to one another. Each chapter is titled for a specific stage of her life: Birth, Childhood, Marriage, Love, Motherhood, Work, Sorrow, Ease, Illness and Decline, and Death.I found the gaps too long between some of the chapters. For example, the \"Childhood\" chapter ends in 1916, just as she reconnects with her father, then that chapter comes to an end and the next one \"Marriage\" begins with her as a bride-to-be at 22 years of age. I think gaps like that are what prevented me from arriving at a place where I would care about the characters and how things would turn out for them. The story itself is good and the writing as well, I just couldn't get invested in any of the people in the story.I found some rather odd figures of speech in this book. They're in the right places and at the right times; my problem is that I don't understand them. There must have been fifty times throughout the book that I came to a metaphor and stopped, wondering what the heck did that mean. I love creativity, but I think this authour and I are on different wave lengths. I'll give you a few examples:1. In talking about a professor she said \"He rides straight up the walls of his sentences.\"2. \"For Abram Skutari......religion is an open window as well as the curtain with which he darkens the window\"3. \"...the word 'woe' made them fall over laughing, such a blind little bug of a word\"4. \"...if she says 'So you two gals are out on the town, huh?' then aunt Daisy will say, shaping her mouth into soft ovals of confederacy....\" 5. \"Vanity refuses to die, pushing the blandness of everyday life into little pleats, pockets, knobs of electric candy.\"I could think through some of these and figure out what she might have meant, (the word \"woe\" is bug-like though I don't know how it's blind, and maybe I have some idea what \"a soft oval of confederacy\" looks like) but I can't come up with any connection between \"the blandness of every day life\" and \"electric candy\" (electric candy?). As something that should paint a clearer picture for the reader or help us understand a situation more easily, these metaphors and others in this book didn't work for me.I don't know if I'll read anymore of Carol Shields' books or not. I think I'd like to try one more, but it's way down on my priority list now. I know that a lot of people love her writing so definitely give it a try. I didn't \"get\" her at all, but you might not have that problem. Would love to hear what you think."}, {"userName": "Madeline", "userReviewDate": "Mar 30, 2009", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "\"My mother's name was Mercy Stone Goodwill. She was only thirty years old when she took sick, a boiling hot day, standing there in her back kitchen, making a Malvern pudding for her husband's supper. A cookery book lay open on the table: 'Take some slices of stale bread,' the recipe said, 'and one pint of currants; half a pint of raspberries; four ounces of sugar; some sweet cream if available.' Of course she's didvided the recipe in half, there being just the two of them, and what with the scarcity of currants, and Cuyler (my father) being a dainty eater. A pick-and-nibble fellow, she calls him, able to take his food or leave it.\"A fat-free vanilla frozen yogurt version of The House of the Spirits's dark chocolate Haagen Daz ice cream. That's pretty much all I can say about this book.Okay, I understand that this won the Pulitzer prize, and is therefore amazing. I recognize and appreciate that the writing is wonderfully done, and I had no trouble finishing this story and was glad I read it. But for some reason, it just never grabbed me in any meaningful way. It's a story about an ordinary woman, living an ordinary life, and dying an ordinary death. Nothing earth-shattering."}, {"userName": "Sally", "userReviewDate": "Mar 17, 2009", "userURL": "http://www.goodreads.com/user/show/1577947-sally", "userReview": "This Pulitzer Prize-winning book was suggested for the Mostly Literary Fiction book group that I lead at the Hayward Public Library, and we read it for our May 2009 discussion. A poignant and extremely creative approach to the imagining of one fairly ordinary (and extraordinary, in its rendering) individual. My reading of this novel coincided with my 85-year-old mother's illness and hospitalization. I read parts of it while waiting with her in the emergency room, and the following day sitting by her bedside while she rested. Quite a fitting book to read while contemplating the life, and inevitable death, of your mother.The ending of the novel brought me to tears -- but it is not a sentimental book. This novel is ripe for discussion - there is some ambiguity in regards to who the narrator is, as the perspective changes. The book begins with a first-person account of the narrator's birth in 1905 (as if she were a witness to her own birth) and the death of her mother in childbirth. But then it shifts to the third person. And at times shifts back.I look forward to reading more books by Carol Shields, and I'm glad that this novel was suggested for our book group! (Several years ago I read and really enjoyed Carol Shields's slim biography of Jane Austen. It was a great introduction to Carol Shields' talent as a writer.)"}, {"userName": "Jeanette", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Oh, how utterly substantial this ordinary life tale runs. Having read this in my middle years, I now reread it within a completely different life period and enjoyed it even more. How rich the language, without having to use foul chorus calls of trite ranting or other slurs. It's absolutely delightful to read words such as \"larky\" again.The life far less molded by electronic, media cultural standards. A life begun in great sorrow and also having patches of unsought fulfillment scattered along the way. The aspects of the quarries and limestone use were also precious to me. I pass those sites at least 16 or 18 times a year and every single time that sight just mesmerizes me. Loaders and trucks on the shelves look like they are Tonka truck sized. Excellent, excellent feel of the Canadian and American Midwest during the first half of the twentieth century- from language to jobs to sensibilities to expressions of emotion. There were very, very few drama kings or queens. The photographs were awesome- they were never included in the first copy I read so many years ago. Real women's choices- you could feel them here. So many great under characters, both women and men. Just loved Clementine and Carol's rending of her feelings within her 20 year marriage."}, {"userName": "Alena", "userReviewDate": "Apr 13, 2012", "userURL": "http://www.goodreads.com/user/show/4456042-alena", "userReview": "A true case of better late than never, I am so glad I finally read this book. It's both epic and humble, quiet and bold, a true masterpiece in both content and style.We meet Daisy the moment she is born in 1905 and follow her life until it ends sometime in the 1990's. The book reads almost like an in-depth memoir, except that other perspectives (or versions of Daisy's story) keep breaking into the narrative. Shields also chooses the third person, even when we are reading Daisy's thoughts, which keeps just the right amount of distance between the reader and the characters.Without being any sort of feminist track, the book is very much a woman's story of the 20th century. For the most part Daisy takes the \"traditional\" path, but that doesn't mean her life is without drama. \"Orphaned\" at birth, shuffled from Canada to the United States, widowed early and long-lived, Daisy faces each phase of her life searching to fill the void of her inner loneliness.\"We accept, as a cosmic joke, the separate ways of men and women, their different levels of foolishness...Men, it seemed to me in those days, were uniquely honored by their stories that erupted in their lives, whereas women were more likely to be smothered by theirs.\"Shields has such a light writing hand, I felt more like I was peeking in on Daisy's life even though I was fully immersed in every thought and action. That's a tricky balance and Shields handles it beautifully.\"In the middle of writing a check she forgets the month, then the year. She's gaga, a loon, she's sprung a leak, her brain matter is falling out like the gray fluff from mailing envelopes, it's getting all over her furniture.\" This is my second Shields novel, and again I am reminded how sad it is that her life was cut far too short by cancer.Read alikesOlive KitteridgeUnless"}, {"userName": "Thomas Strömquist", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/32669562-thomas-str-mquist", "userReview": "I've very ambivalent feelings about of this book. At places I think it's marvelously written and captivating as well as containing a number of nice and unusual narrative grips, such as telling an entire decade of the main characters life by only random correspondence (and only incoming letters, saved and read by the character herself). At the same time, this and similar narrative techniques does not allow the reader to get to know the main character (and those around her) very well. A lot of actions and choices stay unexplained. This, together with the fact that it is a short book (especially considering it tells of an entire life, close to 90 years) does make big parts of the book less interesting and at times it is hard caring very much what happens to and around the main character."}, {"userName": "Elizabeth (Alaska)", "userReviewDate": "Apr 19, 2009", "userURL": "http://www.goodreads.com/user/show/2026178-elizabeth-alaska", "userReview": "This was my first Carol Shields and it won't be my last, in spite of the fact that I would place this at the bottom of my 4-star reads (or even top of 3-star if I were feeling stingy). I thought the story/characters not especially enjoyable. The presentation was very interesting, however. Shields used a variety of ways to tell the story - different first person narratives, third person narratives, letters, and a mixture of newspaper articles. Some of what she wrote I read several times. His voice is beautiful. Its texture is fine-woven wool. If it had a color it would be a warm chestnut. In tone, in fluidity, in resonance, it is all that a man's voice should be, with just that hint of Scottish burr, thinner than the skin of varnish on his oak lectern, giving necessary hardness. He rides straight up the walls of his sentences. His little pauses are sensuous gateways, without which his listeners would fall into a trance.If I were still young, I'd be searching for that fellow. And searching, and searching, and searching ...And then this paragraph caught me as I continue to spend several hours a month researching family history.When we think of the past we tend to assume that people were simpler in their functions, and shaped by forces that were primary and irreducible. We take for granted that our forebears were imbued with a deeper purity of purpose than we possess nowadays, and a more singular set of mind, believing, for example, that early scientists pursued their ends with unbroken \"dedication\" and that artists worked in the flame of some perpetual \"inspiration.\" But none of this is true.Those who went before us were every bit as wayward and unaccountable and unsteady in their longings as people are today.I'm not sure what the Pulitzer Committee was seeing that I don't, but I'm happy to have read this."}, {"userName": "Irene", "userReviewDate": "Jun 12, 2015", "userURL": "http://www.goodreads.com/user/show/1887310-irene", "userReview": "Daisy Goodwill Flett is a 20th century Canadian-American woman. From birth to a poor quarry worker in 1905 to young small-town debutant in the 1920s, to June Cleaver knock-off in the 1950s to bridge-playing retiree in the 1980s to death in 1999, Daisy’s life parallels the popular image of women in those decades. This novel is rich with details, and it is the peripheral details that carry the story. Daisy’s story is told through pudding recipes and gardening column for a local paper, through her father’s stone carving and her future husband’s orchid collection. The narration is largely third person, but inexplicably slips into first person for brief moments. And, what is the meaning of this book, or Daisy’s story? In her 60s, Daisy suffers a paralyzing period of depression; various characters guess at its cause, each explanation reflects the concerns and inclination of that figure imposed on the life of Daisy. And, I suspect that is the point of this novel. Each reader will understand Daisy and the construction of the book through their vantage point. Twentieth century women were largely powerless over their fate, carried along by the expectations of a patriarchal society. We can only be honestly known by the relationships we forge, the lives we touch. Women are incredibly adaptable, able to find contentment in a myriad of situations. For me, Daisy served as a myth in the best sense of the word. Always slightly off center stage, she functioned as a period piece that held each decade together ; in her shifting form, that decade was revealed in ways that wars and elections can not."}, {"userName": "Stuart", "userReviewDate": "Jan 15, 2009", "userURL": "http://www.goodreads.com/user/show/915388-stuart", "userReview": "this is a terriffic novel. it is beautifully written and addresses some interesting ideas: the offhand catastrophes of everyday life; the way one person can casually devestate another without feeling a thing; the crime - and inevitability - of wasted time; the ability of women to suffer in silence to their dying breath; the impossibility of accurate autobiography; the sad ridiculousness of the idea that there is any justice to be had in this world. the author treats her characters in this book as stones whose characters are revealed as time and events chip away at them to reveal their inner being. the story is told without sentiment but with humor and wit. it is a book that is well worth reading."}, {"userName": "Heather", "userReviewDate": "Jul 05, 2007", "userURL": "http://www.goodreads.com/user/show/82601-heather", "userReview": "What I enjoyed about this book is the perspective of the writing, or lack of. The chapters chronicles Daisy' life, but always from an external perspective. She is never the voice and rarely do we ever \"hear\" her speak. All the dialogue is provided by those around her and facts are her life are circumstantial. Hearing about her life from multiple voices make me question what are the real facts of her life, what parts are how she is perceived by others, and how she thinks she is perceived communicated through others. It's also intriguing the way the author provides photos of fictional characters, some of whom don't really resemble their description, like Daisy's mother."}, {"userName": "Moonlike", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/53710210-moonlike", "userReview": "یک زن میتواند تصویری از آرامش و درونی از اندوه باشدمیتوان همسر، مادر بزرگ و عزیز بسیاری از افراد بود و همچنان جسم سنگین تنهایی مثل سایه ای پشت هر ثانیه از زندگی خودش را پنهان کند.داستانی گره خورده بر بستر سنگ ها ، چه قصه ی زیبا و عجیبیدفترچه خاطرات سنگی به قلم کارول شیلدز، نویسنده محبوب من در زمینه ادبیات زنان روایتی از زندگی زنی است که( به نظر من ) زندگیش از تاروپود وقاعی بیشتر غریب تا دردناک بافته شده استزنی که احساس میکنم دستش هرگز به خودش نرسید و دیسی گودویل در منتها الیه وجود خانم فلت غرق و فراموش شده بود.دلم میخواست کسی در داستان دست دیسی را بگیرد و او را از درون کسی که هست بیرون بکشد...قسمت هایی از کتاب:\"دیسی فلت (گودویل سابق) به خاطر اتفاق ، بی دقتی ، بی توجهی یا به دلیل نداشتن شجاعت و موقعیت هرگز در طول سالیان دراز عمرش یک بار هیجان و چالش برخی چیزها را تجربه نکرد، چیزهایی مثل نقاشی رنگ روغن، سکی ، قایق سواری، عریان شناکردن، استفاده از جواهر یاقوت.......گروه درمانی، ماساژ،گرسنگی ، احترام ویژه تحکم خشماگین،هرگز اتومبیلی نراند، ،هرگز بلیط بخت آزمایی نخرید.از طرف دیگر هرگز ،هرگز کسی به صورت یا بدنش ضربه نزد، هرگز آه نکشید و هرگز عینک مطالعه اش را روی فرق سرش نزد........و با وجودی که در زندگی کسانی دوستش داشتند، ولی هرگز جمله ی \"دوستت دارم دیسی\" (همین عبارت ساده را) نشنید که به زبان آورده شود\"\"چیزی برای او روشن شده است-چیزی که بسیار ساده است، چیزی که گویا خودش همیشه میدانسته ولی هرگز به زبان نیاورده است.و آن اینکه مرگ در لحظه ای حادث میشود که ما هنوز زنده ایم.زندگی تا دیوار آن تاریکی نهایی ادامه می یابد و یک سر بودن به سر دیگر آن برخورد می کند.حتی یک نفس هم آنها را از هم جدا نمی کند\"\"ناگهان بدن او تبدیل به تنها چیزی شده است که اهمیت دارد و این چقدر ناامیدش کرده است.و چقدر سالهای متمادی زندگی کردن در میان جسمی که مدام به پیش می رانیش بیانگر تنهایی است و هرگ حتی به هنگام خواب و حتی در لحظاتی که با جسم دیگری پیوند میخوری از وزن این بدن رهایی ات نیست...\"+داستان غمناک نیست ، بیشتر زیبا هست. نوشتارکارول شیلدز با توجه به تجربه قبلی من از کتاب \"مگر آنکه\" همیشه چیزی بیشتر ازیک قصه برای بازگو کردن داره"}, {"userName": "Amy", "userReviewDate": "Feb 17, 2011", "userURL": "http://www.goodreads.com/user/show/4007721-amy", "userReview": "\"The Stone Diaries\" is not action-packed. It is painfully and heartfully realistic. It is not just women's lit, as emotions and relationships are not the driving forces; it is also beautiful historic prose, set against the span of the 20th century. And it is not hopeful and mushy with happy-soul feelings at the end; but it is exquisite attempt to capture the complexities of one's life; one's family and friends; and one's place and purpose in this crazy, non-linear world. Carol Shield's epic novel won the Pulitzer Prize for Fiction in 1994 - \"epic\" for its years of coverage and depth of detail. It chronicles the life of a \"cursed\" young women, Daisy Goodwill, whose simple mother died in childbirth; and who later experiences another of life's tragedies. We travel from the plains of rural Canada, to the bustling new town of Bloomington, Indiana; back to Canada; and finally to a nursing home in Florida. We learn about Daisy from everyone else's point of view, rather than her own. We seem to know this pitiful character, at once strong and stoic yet also detached. We love her for her dutiful approach to life; yet we also ache for her to feel; to love; to act out; to react to life's relentless toll on her soul. We know of her life; but we want her to truly live.The brilliance of \"Stone Diaries\" can be summed up by Shields' final chapter - the \"Death\" of Daisy. We do not hear Daisy's voice; just her children's; as well as her personal notes and memoirs. Through a list of Daisy's past addresses; a trivial thing, something to be archived or else forgotten, we as readers travel nostalgically back through Daisy's long life, envisioning her homes, friends, loved ones, triumphs and tolls, as revealed through \"Stone Diaries.\" It is a beautiful book; literature to be treasured. The life of a woman is hardly a new topic; but to meet, understand historically, empathize with, and cheer for a rather normal woman, maneuvering through everyday life - that is literary writing at its best."}, {"userName": "S.", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/612774-s", "userReview": "I expected this to be dull, and embraced it with the gratitude the reader feels when the book turns out not to be dull at all. There were many elements I liked, beginning with the rare first-person omniscient point of view, making this a ‘fictitious autobiography.’ Usually you have to be dead (as in The Lovely Bones) or death itself (as in The Book Thief) to pull that pov off. There are parts of the book with input and letters from other characters, and there are parts which really seem to be in the third person, and may be, but then and again an ‘I’ is slipped in and the deal is revealed. Just look at the first page. Basically this is the life story of Daisy Goodwill, orphaned at birth, and a story about the lonesomeness at the core of life. Despite the cast of characters, the encounters and reference points, and the collective experience of history and culture as it goes by (the Lindbergh flight, the Kennedy assassination, WWII, Johnny Carson, etc, not necessarily in that order), you get the feeling life has happened to the protagonist, as it happens to everyone, with little or scant navigation. What I found touching near the end was how seeing her name on the hospital bracelet, minus the married name, gave Daisy a sense of purity. The loneliness for me is embodied best by Daisy’s mother’s wedding ring, which should have some day landed in her hands, but is buried in her father’s backyard project, a muddled pyramid. As you can guess from the title, stone is a major motif in the book, hard and intact.I loved the structure, too, the letters, the ‘versions,’ the family tree, and the photographs, which help you pretend this is a fiction that happened. Of course it could have happened. Of course it happens all the time."}, {"userName": "Trish", "userReviewDate": "Dec 01, 2007", "userURL": "http://www.goodreads.com/user/show/653338-trish", "userReview": "I read this quite some time ago, and could never think of an adequate review. It's simply a wonderful book. It follows in exquisite detail the life of Daisy Stone in ten chapters: Birth 1905, Childhood 1916, Marriage 1927, Love 1936, Motherhood 1947, Work 1955-1964, Sorrow 1965, Ease 1977, Illness and Decline 1985, Death. Daisy's life is ordinary but utterly absorbing; through the years, the reader almost slips inside her skin, sharing her experiences. QuotableA thought comes into her head: that lately she doesn't ask herself what is possible, but rather what possibilities remain. How does a poet know when a poem is ended? Because it lies flat, taut; nothing can be added or subtracted. How does a woman know when a marriage is over? Because of the way her life suddenly shears off in just two directions: past and future. The larger loneliness of our lives evolves from our unwillingness to spend ourselves, stir ourselves. We are always damping down our inner weather, permitting ourselves the comforts of postponement, of rehearsals."}, {"userName": "John", "userReviewDate": "May 16, 2008", "userURL": "http://www.goodreads.com/user/show/1125340-john", "userReview": "Like finding a shoebox in the attic.Here is the life of Daisy presented mostly through narration, but buttressed by letters, tombstones, photographs (which occasionally contradict the narrative), words etched into a Victorian plate, a luncheon menu, Aunt Daisy's Lemon Pudding recipe, to-do lists, a list of books read and a sheet with every address Daisy lived. People are introduced and explained, summed up, classified. I envy anyone able to boil down other people to an understandable core. Still, such simplification carries its own pitfalls, as the text itself admits. We really can't even keep our own stories straight.How amazing it would be if a family tree brought even one person into focus as well as Daisy. There aren't too many people who can hope to be long remembered after they pass. Having your lemon pudding recipe live on for awhile would be more than most people are remembered for.Everything in this book feels true, solid. I really, really like it."}, {"userName": "Andy Carrington", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/54847536-andy-carrington", "userReview": "I'm not one who takes to prize-winning books easily. But then again, I try not to pre-judge if I can help it.I read this at Uni. Not spectacular by any means; but an interesting journey through the drudgery of work/everyday life.The main theme here is identity, I think; and the narration often switches between 1st and 3rd person, making it come across as part autobiography/part biography.There's a strong sense of realism (this might be categorised as \"fiction\", but the story very much real in its essence). You need to settle into it. But when you do, you'll get drawn in (I did anyway)."}, {"userName": "Julie", "userReviewDate": "Sep 03, 2013", "userURL": "http://www.goodreads.com/user/show/5211606-julie", "userReview": "Wow, this novel is the perfect example of what happens when you least expect it. I knew nothing about this book, I'd never heard of it or its author, and I found the cover unappealing. And, yet, it's one of the best, most meaningful stories I've ever read.It won the Pulitzer Prize for 1995, which is the only reason I picked it up. Then, I couldn't put it down. This is one of those life-altering novels, a big picture story, upsetting and wonderful at the same time. I can't quite recommend it enough."}, {"userName": "Seonad", "userReviewDate": "Nov 11, 2014", "userURL": "http://www.goodreads.com/user/show/33450158-seonad", "userReview": "This has totally devastated me. Amazingly beautiful writing. I think I am not strong enough for something so heart breaking right now and I feel a little bit empty now it is over."}, {"userName": "Krista", "userReviewDate": "May 28, 2013", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "She understood that if she was going to hold on to her life at all, she would have to rescue it by a primary act of imagination, supplementing, modifying, summoning up the necessary connections, conjuring the pastoral or heroic or whatever, even dreaming a limestone tower into existence, getting the details wrong occasionally, exaggerating or lying outright, inventing letters or conversations of impossible gentility, or casting conjecture in a pretty light.I joined facebook a few years ago, and as a person might, I looked to see if I could find anyone I used to know. I did stumble over a few without making any effort to contact them because, in the end, it felt like there was a reason why we didn't know each other anymore. There was one friend, however, that I regretted losing touch with, and after much searching and eventually finding her daughter, I got in touch with Delight. We talked on the phone and chatted through facebook and eventually got together, face to face. What was strange was that, in answer to the questions, \"So what's new? What have you been doing with yourself for the past 15 years?\", it was a struggle for me to come up with much more than, \"Well, we have one more daughter than when we last spoke and now we live in Cambridge\". It's not that I haven't done anything in those years, I don't consider myself bored or boring in my everyday life, but my story does lack grand events (and insofar as that means my story lacks tragedy, I am not ungrateful for it). Sure, I was able to sketch a big picture of a life of happiness and routine, throwing in a few brags about how great my girls are, sharing some frustrations and minor setbacks, but since I was talking to someone who already knows me, I felt like she still knew me, as the \"me\" hadn't really changed. In the end, my dull story felt like not so much a failure of memory as a failure of memoir.The recounting of a life is a cheat, of course; I admit the truth of this; even our own stories are obscenely distorted; it is a wonder really that we keep faith with the simple container of our existence.In The Stone Diaries, Carol Shields presents Daisy Goodwill Flett as an ordinary person who, as a classic unreliable narrator, tells her life story, flipping from first person to third person omniscient perspectives, witnessing and describing even her own birth, and carefully choosing which stories to include and which long stretches of years to omit. The storytelling is clever: I would be sucked into the narrative, \"believing\" what I was being told, but Shields repeatedly tells the reader that Daisy can't be trusted:Well, a childhood is what anyone wants to remember of it. It leaves behind no fossils, except perhaps in fiction. Which is why you want to take Daisy's representation of events with a grain of salt, a bushel of salt.And:You might like to guess that Daisy has no gaiety left in her, but this is not true, since she lives outside her story as well as inside.Imagine living outside your own story! Of course our lives contain more than the story we're willing to share, more than the truth that we're willing to admit to ourselves, but in the end, what is truth? My husband has a dozen biographies of Elvis Presley, has read dozens more, and I wonder if anyone has been written about more extensively-- there are books on Elvis' career and love life and drug use and family, written by friends and lovers and dispassionate \"truth-seekers\", his every public word and action, along with many private, have been catalogued and parsed and psychoanalysed, and even if he had written an autobiography, would any of us know the \"truth\" of his existence? Would Elvis himself? The omissions and reactions and fallacies in The Stone Diaries demonstrate that even Daisy herself can't get at the truth of her own existence. I read an edition of this book that includes the \"family photos\" and I thought that the picture included of Daisy's parents is genius. After describing her mother, Mercy, as a doughy mountain of flesh, the picture of her looks like a fairly average sized person, maybe a size twelve. Does Daisy imagine that her father adores his wife's generous rolls of flesh because it is she, not necessarily he, who needs to create a soft and matronly presence to disappear into? It's these sorts of details that make The Stone Diaries a technical marvel.On genealogy: Victoria doesn't believe these earnest amateurs are looking for links to royalty or to creative genius; all they want is for their ancestors to be revealed as simple, honest, law-abiding folks, quiet in their accomplishments, faithful in their vows, cheerful, solvent, and well intentioned, and that their robustly rounded (but severely occluded) lives will push up against, and perhaps pardon, the contemporary plagues of displacement and disaffection.And so we are left with the paradox of not being able to adequately know our own truths, let alone share them with others, and we leave behind generations of descendants who will never glimpse beyond the bare facts of us that they might one day discover. The Stone Diaries is like a scrapbook: it contains letters and recipes, reminiscences from different perspectives, conjectures and made up stories. Taken together, they make up a life, but in the end, we are instructed to take it all with a grain of salt. I think it's the technical feat of this book that earned it a Pulitzer Prize. The book I read came from the local library, and annoyingly, someone had started underlining every word that refers to stone and every word that refers to plants and gardening. Happily the underlining vandal gave up halfway through the book, but it left me with an eye for the language that I was supposed to be watching out for (and I hope the happy underliner read through to the end where the dying Daisy feels herself turning to stone). So while I can appreciate the mastery that Carol Shields displayed in writing this book, I lacked a connection with Daisy. She compares unfavourably, as a reading experience, to Hagar in The Stone Angel, and yet I have to give it five stars, acknowledging as I do that all of my ratings are filtered through my own history and sentiments.; through me."}], "description": "The Stone Diaries is one ordinary woman's story of her journey through life. Born in 1905, Daisy Stone Goodwill drifts through the roles of child, wife, widow, and mother, and finally into her old age. Bewildered by her inability to understand her place in her own life, Daisy attempts to find a way to tell her story within a novel that is itself about the limitations of autobiography. Her life is vivid with incident, and yet she feels a sense of powerlessness. She listens, she observes, and through sheer force of imagination she becomes a witness of her own life: her birth, her death, and the troubling missed connections she discovers between. Daisy's struggle to find a place for herself in her own life is a paradigm of the unsettled decades of our era. A witty and compassionate anatomist of the human heart, Carol Shields has made distinctively her own that place where the domestic collides with the elemental. With irony and humor she weaves the strands of The Stone Diaries together in this, her richest and most poignant novel to date.", "title": "The Stone Diaries", "url": "http://www.goodreads.com/book/show/77554.The_Stone_Diaries", "average": 3.85, "cover": "https://images.gr-assets.com/books/1285159303l/77554.jpg", "reviews": 1551, "authors": [{"url": "https://www.goodreads.com/author/show/12034.Carol_Shields", "name": "Carol Shields"}], "type": ["Fiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/77554.The_Stone_Diaries", "http://www.goodreads.com/book/show/4582565-the-stone-diaries", "http://www.goodreads.com/book/show/1065258.The_Stone_Diaries", "http://www.goodreads.com/book/show/23757449-the-stone-diaries", "http://www.goodreads.com/book/show/11422118-the-stone-diaries", "http://www.goodreads.com/book/show/1770721.The_Stone_Diaries", "http://www.goodreads.com/book/show/10128118-the-stone-diaries", "http://www.goodreads.com/book/show/74462.Unless", "http://www.goodreads.com/book/show/356768.Larry_s_Party", "http://www.goodreads.com/book/show/31678.Jane_Austen", "http://www.goodreads.com/book/show/368503.The_Republic_of_Love", "http://www.goodreads.com/book/show/368499.Swann", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}