{"ratings": 1939, "userreviews": [{"userName": "Mike", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/7022024-mike", "userReview": "We truly live in an amazing age when someone can go from releasing a podcast about history before people really knew what podcasts were (2007) to getting a book publishing deal on the subject. If you have not been clued into Mike Duncan's amazing Roman History podcast series The History of Rome or his current one on various Revolutions you are truly missing out on some of the best audio experiences out there (and for the low, low price of free). Ever since he announced he was getting a Roman History book published I have been extremely excited to get my hands on the book, and it does not disappoint in the least.The Storm before the Storm (TSbtS) tells the history of everything that went wrong with the Roman Republic before it came crashing down in Julius Caesar's generation (or as I call it the Hollywood generation since it is much more famous and has much wider public awareness). But the downfall of the Republic in that generation was preceded by a great corroding of the Republic the previous generations. This book examines that corrosion of the Republic in these lesser know but vitally important generations, the people behind it, the decisions they made in the moment that opened the door for more bad decisions, and how the course of history changed for these decisions.I have never understood why so few people enjoy reading history books. The sort of personalities, epic span of events, and intricate social narratives are just as (if not more) compelling and interesting as the best fantasy and sci-fi out there. TSbtS delivers all of these in spades, conveying both historical insights to personalities of the time, how the circumstances of the times drove key decisions, and how the cumulative effect of these changes brought about several significant crisis to the Republic. Duncan does all this in a way that is both accessible but still conveys the complexity of the Republican period.Duncan's main thrust of this book is that breakdown of mos maiorum (literally \"way of the ancestors\") resulted in the collapse of the Republican system. Mos maiorum was the unspoken rules of the Republic governing such things as when people could stand for certain public offices, how often they could hold a position, the protections granted to those office holders, and the general way political business was handled. These rules regulated how Republican politics behaved and generally provided for a stable political environmentAfter the defeat of the Carthiginians at the end of the Second Punic War Rome and the conquest of Greece shortly thereafter Rome was riding high. It was the preeminent power in the Western Mediterranean and the immense wealth of those conquests flowed like rivers of gold, silver and slaves back to Rome. Sounds pretty great to be Roman, right? Wrong.\n\"As early as 195, Cato the Elder warned his colleagues, “We have crossed into Greece and Asia, places filled with all the allurements of vice, and we are handling the treasures of kings... I fear that these things will capture us rather than we them.”\nThe austere days of the early Republic were gone and prominent displays of riches became more accepted. On top of that the great wealth that accrued to Rome was concentrated at the top of society (sound familiar?) with the common Roman citizen probably worse of for all the glory that Rome gained.You see up until this point most of Rome's wars were local affairs where citizen soldiers would be called up after the spring planting and return to their fields for the harvest. But the Second Punic War (and the subsequent efforts to pacify Spain) say Roman soldiers away form home for years on end. The result was fallow and ruined fields. Many of the soldiers who brought wealth and glory to Rome returned to financial ruin, forced to sell of their land to the wealthy landowners and either move to cities to serve as free labor (labor which was in serious competition with slave labor, slaves that they had help seize for the Republic) or work as sharecroppers on their old lots for the new landowners. This was just one of the many economical challenges the Republic faced in this period.Reforms to fix this problem were proposed but through a combination of political brinksmanship, narrow economic self-interest, and downright stubbornness they were defeated. Populist reforms and reactionary Senator began chipping away at mos maiorum, circumventing traditional legislative procedures, using the threat of violence to pass legislation, using actual violence to suppress the reformers. It was a big mess and a harbinger of things to come. Ambitious people saw the power of taping into underclass resentment and problems as a way to give themselves power (fixing the problems they railed against to gain that power often fell to the wayside). More and more unspoken norms were broken for the goal of political gain:\n\"It is this spirit which has commonly ruined great nations, when one party desires to triumph over another by any and every means and to avenge itself on the vanquished with excessive cruelty.\" -Sulla\nThere were also a ton of other problems the Romans handled spectacularly terribly: citizenship for Italian tribes (took a war to figure that one out), raising of armies when the citizen landowner pool shrank drastically (now armies were loyal to the generals who brought them spoils of war instead of to the Republic), bribery of public officials, and land redistribution to name but a few. Narrow political self interest and downright pettiness were significant barriers to fixing these problems, all contributing the weakening of the Republic. Some leaders would block legislation that previous years they supported simply because a political opponent proposed it and might gain more political influence if it was successful. The goal of governance was accruing and retaining power instead of providing for the common good.This was not a sudden transformation of the Republic, but occurred over the span of decades with each decision to break mos maiorum seeming to make sense at the time to the people breaking the code (be it to end fighting on the peninsula, overcome enemies abroad, bring about social order, to effectively raise an army, etc). But the cumulative effect was the complete destruction of these norms and violence becoming the political currency of Rome. It eventually got to the point where the ruling power convened tribunals to punish and kill political opponents. When it was pointed out to these tribunals that they were operating outside the rule of law a very young Pompey retorted ”Cease quoting laws to us that have swords.” Yeah, it got that bad. Like Civil War bad. Even after the formal structures of the Republic were reinstated by the end of the book with further positive reforms enacted the degradation of respect for the Republic made these changes a doomed rearguard action that failed to persist.At the end of the day it may seem like the fall of the Republic was inevitable but that is simply not the case. It takes effort to sustain representative governments. Citizens and politicians must be willing and able to rein in the baser impulses of themselves. The unspoken rules of behavior are often more important than the formal structures of government even today. Without them we risk devolving to a system where political power secured by any means (up to and including violence) becomes the status quo. And that isn't good for anybody.People have long compared Rome to America and Duncan addresses this idea in the Author's Note at the beginning of the book. While he doesn't come out and say that America right now is Rome during this post-Second Punic War period, there are numerous echoes of that period today. Every generation within a democracy must reaffirm and strengthen the unspoken norms that keep our democracy form devolving into a contest between armed gangs. We must work to incorporate all peoples into society, not leave them on the outside looking in and detached from the political decisions that impact them. We must work towards a most equitable economic system lest demagogues exploit this to give themselves power (shit, this already happened didn't it). Personally I think American should read this book and reflect upon what we can do to maintain our own Republic's mos maiorum and strengthen it.So if you like history (or just a really engrossing, epic story chocked full of hubris, tragedy, and schemeing) you will find this book extremely interesting and enjoyable. I know I did.The first chapter of the audio book is available here."}, {"userName": "Margaret Sankey", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/5861086-margaret-sankey", "userReview": "This is a solid popular history of the generation and a half before the First Triumvirate--the period from the Gracchi brothers to the death of Sulla, which is usually simplified in popular forms or skipped in order to get to Julius Caesar or Augustus. Instead, this is an easily digestible account of the Lex Agraria, the changes to the Roman military, the Roman involvement in the breaking down of the Hellenistic kingdoms in Asia Minor, ramifications of limiting or increasing voting, the triggers that spark slave revolts and the debates over rolling out full citizenship to Italian friends and allies. Duncan knows his sources, and will explain how something is a charitable reading of someone's motives, or likely propaganda (as when the only detailed account of an event comes from Sulla's memoirs)."}, {"userName": "Hilary Scroggie", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/10577813-hilary-scroggie", "userReview": "\"These echoes could be mere coincidence, of course, but the great Greek biographer Plutarch certainly believed it possible that 'if, on the other hand, there is a limited number of elements from which events are interwoven, the same things must happen many times, being brought to pass by the same agencies.\"\"But this was an age when a lie was not a lie if a man had the audacity to keep asserting the lie was true.\"I'm not nervous you're nervous."}, {"userName": "Andrew", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/8525332-andrew", "userReview": "*4.5 stars*At the time, everyone thought that just one more push for their personal agenda would win the day. Collectively, they ended up pushing the republic over the edge.Oh, I'm sorry. This is Ancient Rome, not modern America. But here is the story of the fall of a republic as it gallops towards oblivion. The threads of the constitution fray and fray and fray and snap as simple reform bills turn into battles for personal glory which turn into riots in the forum which turn into civil war.This book is best paired with \nOn Tyranny\n. And followed up by its academic elder brother, \nThe Roman Revolution\n."}, {"userName": "Karla", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/2846441-karla", "userReview": "Aside: In prepping for this review to liken it (negatively) to Dan Carlin's Hardcore History podcast on The Roman Republic, I noticed that all the HH podcasts that I had rated and reviewed were NO LONGER IN MY BOOKS. The book pages seem to have all been recreated on Dec 27th.WTF, Goodreads!??!?! NOT COOL. This doesn't exactly encourage review-writing or even rating, you know. And if non-book items are going to be deleted, then let's get rid of the book pages for ONLINE FANFICTION. Arrgh.Anyway.Before my concentration was trashed unexpectedly, I was going to say that I enjoyed Carlin's multi-hour podcast series on the Rise and Fall of the Roman Republic much more. Even though he goes on wicked tangents and expounds on certain themes, at least he has a voice and thoughts and adds it to material at hand. To be honest, I don't see much of a point with Duncan's book, since the information has been recounted in multiple other books with far more analysis and interpretation.I haven't listened to Duncan's podcast, but it's been waiting in my iTunes for awhile. I'll still get to it eventually, mainly because I want to see if he builds on the material in a way that the book sorely lacked. This book here is plain ol' straightforward historical narrative, a long long long expanded Wikipedia entry, with a few bouts of commentary. There was so little that was fresh and added to the body of work on Roman Republic 101.Serviceable, but not exciting in the least - especially for someone who has read a few \"primers\" on Republican Rome already and been exposed to the dynamic narrative that Dan Carlin has offered on the subject.2.5 stars."}, {"userName": "Michael Perkins", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/13298726-michael-perkins", "userReview": "The shocking story of the Oligarchy ruthlessly cracking down on populists Tribunes (considered traitors), who advocated for the poor and disenfranchised masses (via the Lex Agraria).The next era would bring the rise of Caesar and the virtual elimination of the middle class, with the reduction of most of the Roman population to plebeian status.I should note how the massive inequality came about in Rome. As Rome became more involved in foreign wars and defeated the likes of Carthage and other enemies, huge spoils were reaped and appropriated by the Roman oligarchy back home. Meanwhile, the farmers who were sent off to fight these wars were gone much longer than before. Their farms lay fallow. The oligarchy used its new found wealth the snatch up that land, leaving the returning soldiers homeless and penurious. Lex Agraria was an attempt by the populist tribunes to restore land to the bankrupt farmers. But the oligarchy was too greedy and blind to see the justice of this, as well as its importance in saving the Republic. Instead the populist Tribunes were assassinated. Analogies to ancient Rome are popular. But we have experienced two eras like this in U.S. history, the late 19th century era, known as the Gilded Age, and our era, a new Gilded Age in which the income gap is as high as it was in the original one. Meanwhile, the labor participation rate continues to plummet, especially in states where manufacturing and retailing jobs have disappeared or are disappearing quickly. People in their prime working age have given up. They are becoming a modern plebeian class, even as the leadership of both parties revel in their own riches and power."}, {"userName": "Shawn", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/11011728-shawn", "userReview": "This was an exceptionally well written and concise outline of the history of the Roman Republic from the period of the Gracchi brothers to the death of Lucius Sulla. The author did a masterful job of describing to the reader in an organized fashion the myriad of events, personalities and issues. The Roman Republic was an extremely bloody, dynamic and complicated place where political questions were often settled through assassination and war. It would be very easy for a reader to get lost especially with many similar names reappearing over multiple generations. The author brings us along with sufficient detail so I never felt that I did not have a grasp what was going on.I did not quite follow how one of his opening themes fit into his theories. In the beginning, Duncan stated that rising income inequality contributed to the political upheavals. I was interested in this assertion but I failed to see much support throughout the book. It seemed to me the question of Italian citizenship was far more consistent and divisive within the warring factions. I also did not understand the alternative type set in certain words such as \"technically\" and \"ethnic\". I was not sure why that was done but it appeared often enough that I know it was intentional.In sum, I would recommend this book."}, {"userName": "Darcia Helle", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/2439410-darcia-helle", "userReview": "I am endlessly amazed at the amount of detail uncovered from events that took place more than 2,000 years ago. Mike Duncan managed to piece together an entire narrative, introducing us to the main players in a society whose climb to greatness seemed to be its undoing. I've read a lot about this period of history, but Duncan's unique approach gave me a different perspective on the unraveling of the empire. While academic, in the sense that this is not light reading, Duncan's writing style is enjoyable and engaging. This is absolutely not a dry, textbook kind of read.We here in the U.S. often draw parallels between our nation and the Roman Empire. Those parallels are certainly here in this story. Duncan does not point them out to us, but you don't have to look hard to find them. The most disheartening and disturbing aspect, to me, is how little politics - and people - have changed. We like to think we've evolved, grown, become more enlightened in our thoughts. To some degree, yes, we have. But, in reading this, it's all too easy to see that the more things change, the more they stay the same.*I received an ebook copy from the publisher, via NetGalley, in exchange for my honest review.*"}, {"userName": "Dominic", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/14971907-dominic", "userReview": "The late Roman Republic is one of the most studied and most familiar periods of history. Even the average American - famously ignorant of history - could probably tell you what happened to Julius Caesar or the name of Cleopatra's lover (thanks in no small part to Shakespeare's plays). But there's surprisingly little attention paid to the period before Caesar, the events that set the stage for the fall of the Republic. Mike Duncan, host of the excellent History of Rome Podcast, takes a stab, writing the first book focused exclusively on the period 130-80 BC I have seen. It's a smart move, not just for a first-time author trying to make a name for himself, but also because it will introduce readers to an important part of Rome's history.As Duncan argues in the introduction, the 50 years between 130-80 BC helped set the stage for the collapse of the Republic. Domestically, the polarization between conservatives (optimates) and populists (populares) prevented the Republic from undertaking necessary reforms. The Gracchi brothers, two senators who attempted to push redistributive land reform, were ultimately murdered for their efforts. Duncan then chronicles the rising tensions on the Italian peninsula as Italians became increasingly forceful in their demands for citizenship. The Senate eventually caved and granted Italians citizenship (but tried to dilute their voting rights through gerrymandering). Meanwhile, Rome faced a variety of threats on its periphery from tribes and former client states, including in Numidia and Gaul. Roman diplomacy and military force finally quelled these threats after years of fighting. However, Rome was then wracked by civil war as two of its top generals, Gaius Marius and Lucius Cornelius Sulla, fought for the right to lead Rome's armies east against King Mithridates of Pontus. The Senate had appointed Sulla, but the popularly elected Tribune maneuvered to get Marius - darling of the populares - appointed instead. Sulla marched his army on Rome, declared himself dictator, and, after years of civil war, attempted to reform Roman law to enshrine the position of the optimates.Just as in his podcast, Duncan's writing is clear, accessible, and even sometimes funny. This is a complicated period of Roman history, but Duncan provides enough background for readers to follow along. It might have been helpful to have included a dramatis personae listing all of the major players, but Duncan does enough to distinguish the various Latin names from each other. The issues Rome dealt with during this period - class conflict, populism, gerrymandering, inequality, polarization, breaking political norms - should be familiar to Americans in the 2010s. Duncan himself notes the commonalities in the introduction to this book, but I actually thought that comparison would have been more effective in an epilogue, after the reader had gained a better understanding of the Roman history. This type of historical comparison could have been really interesting, but as is it just seems more like a way to catch the reader's attention than a sustained analysis. Likewise, Duncan does provide an effective summary of how the problems of 130-80 BC ultimately led to the collapse of the Republic, but he never quite provides a definitive analysis of why Rome took such a turn for the worse during this period. He mentions a few possible reasons, such as the failure of land reform, but I would have liked a more succinct explanation.Definitely recommended for readers interested in Roman history. [Note: I received a copy of this book from the publisher in exchange for an honest review]"}, {"userName": "Michael Burnam-Fink", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/4828849-michael-burnam-fink", "userReview": "Everybody know the story of the Fall of the Roman Republic. Julius Caesar, Mark Antony, Cicero, Cato, Octavian, Brutus, civil war, assassination, the last grasp of liberty, and the foundation of both tyranny and centuries of peace and prosperity. Roman politics are a common metaphor for our own times. In The Storm Before the Storm, veteran history podcaster Mike Duncan (Revolutions, The History of Rome), writes about one of his favorite periods, the Roman Republic between the Second Punic War and Caesar's Civil War.As expected, Duncan ably brings weaves together the lives of his protagonists and their events, to describe a gradual degradation of Roman political norms to mob violence and military force, as the sclerotic Senate proved unable to decisively deal with concerns like corruption in the provinces, the lack of civil rights for Italian allies, transformation of the countryside from yeoman farmers to slave estates, and the ambitions of 'new men' without noble pedigrees. The abortive Gracchian agricultural reforms, Gauis Marius's remaking of the army, and Sulla's dictatorship are the centerpieces of this book.Duncan ably uses primary sources (the Romans wrote a lot of history) to provide detail and spice to his world. He'll admit he's biased in favor of the Populares and against the Optimates. This is a well-sourced popular history, which is both its strength and weakness. Duncan doesn't have much theory about the collapse of political norms, and the lives of the figures eclipses some questions I had about how Roman politics normally operated, and the balance between formal bureaucracy, networks of patronage, and the ability of oratory to shift the mob at the right moment."}, {"userName": "Omar Ali", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/19157406-omar-ali", "userReview": "A relatively short (265 pages), fast paced and lively account of the Roman Republic from 146 BC (the fall of Carthage and Corinth) to 78 BC (the death of Sulla), covering the period in which the Republic saw major social upheaval, conflict and civil war and in which many of the constitutional checks and balances of the Republic fell by the wayside, setting the stage for the final overthrow of the Republic by Julius Ceasar and his grand nephew, Augustus Ceasar. Duncan makes the case that the decline of the mos maiorum (the \"mores\") of the Roman Republic in this period of crisis was the crucial factor that led to the final fall a few decades later. WHY the mos maiorum fell apart is a big question, and it is not really answered in this book (a book that really tries to answer that question would probably be much denser and longer than this book) , but is beautifully described, and that is enough to earn 4 stars. This period of Roman history and its main characters are not as prominent in popular memory as the final crisis of the Republic. Almost every educated person has heard of Julius Ceasar, the ides of March, Antony and Cleopatra, and Augustus, but relatively few people are familiar with characters such as the Gracchus brothers, Gaius Marius and Sulla, which is a tragedy, because their stories are as fascinating (if not more fascinating) than anything that happened in the final crisis of the Republic. if you are not a Roman history nerd and are not already familiar with these compelling characters, then this is a great introduction to the era and its most famous personalities. Colleen McCollough's historical fiction (the \"Masters of Rome\" series) is far more detailed and richer in texture because in historical fiction she can fill in details where the historical record is silent (she is very careful to stay faithful to the historical record as far as it is known), but if you just want the story that is in the history books, this is a great place to start. Its all in here, the increasing immiseration of the peasant proprietors who were the base of the ancient Republic; the corruption that came with increasing wealth; the fight to extend citizenship to all Italians; the rise (and violent fall) of the Gracchi, aristocrats who championed the cause of the downtrodden; the incredible (and incredibly long) career of Gaius Marius, the \"new man\" (novus homo) who rose from outsider to outstanding general, savior of Rome and 7 time consul but just could not bear to retire; and last but not the least, the life of Lucius Cornelius Sulla, impoverished aristocrat, brilliant general, harsh conqueror and even harsher dictator, who tried to reform and re-animate the ancient Republic and actually managed to retire at the height of his power, but whose reforms failed to prevent (and whose personal example probably aggravated) the final crisis of the Republic. As you read, you cannot help wondering why 20 famous movies and TV serials have not been made about these people. Marius's escape from Rome alone is worth at least one great movie, with more hair-raising chases, captures, escapes, betrayals and last minute twists of fortune than any fictitious adventure movie could possibly squeeze into one character's life. Overall, a great read, well worth a look."}, {"userName": "Katie Lumsden", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/8190907-katie-lumsden", "userReview": "An interesting look at certain parts of Roman history, but a little too narrative-driven for me. I found the audiobook hard to follow and concentrate on at times, but I still feel a learn a few new things."}, {"userName": "Amanda Leon", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/3270660-amanda-leon", "userReview": "Great, simple to understand and engaging"}, {"userName": "Nic Morgan", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/60079395-nic-morgan", "userReview": "I absolutely loved this book. While it's a great story about the civil war between Marius and Sulla, and the events that lead up to it, it's also presented masterfully as a case study in how the erosion of norms can create irreparable cracks in a political system. As norms and customs that form the bedrock of a system give way to crises and the expediency of the moment, norms are subsequently weakened, or worse, new a precedent is set and the unintended consequences ripple from there. There is a telling aside when Mike Duncan says (paraphrasing from memory), \"In History, the person who unlocks the door is rarely the one who comes bursting through.\"The storytelling and narrative voice is great, and I devoured this in a few days of binging. If you're even a little interested in Roman History, you'll really like this book. If you're at all interested in the lessons Roman History teaches us, you'll love this book."}, {"userName": "Andrew Glos", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/11108582-andrew-glos", "userReview": "This is largely a reworking and polishing up of Mike Duncan's podcast, \"The History of Rome\". If you haven't heard this podcast, put your device down now and go subscribe to it and start listening to it. It's one of the best ever done. If you don't have a devise for podcasts or an app to listen to them, then go get one just so you can listen to his podcast. Yeah, it's just that good. Just do it. Seriously. Stop reading my review. If you are still here, then I'll get back to m review. This book is done with the same straight forward and narrative style that Duncan uses in his podcast. It also covers the generations of Marius and Sulla, which is very often ignored for the period of Julius Caesar and his successors. However, as Duncan points out at numerous points, none of that history makes much sense unless you know the stories of the Marian and Sullan age. It's all set up in advance. Duncan does such a great job of making history interesting, connecting the dots from one place to another, and making people who are usually nothing more than marble heads turn into flesh and blood people. He also gives us the gift of just coming out and admitting when he is speculating, something far too few popular history writers do. The only critique I have of this book is that it looses a certain conversational charm that his podcast was able to convey. This is a fault of the medium, however, and not this book. For classical history junkies like me, Duncan and his work are a gift to be received with joy and adulation. This book is worth every hour you pour into it."}, {"userName": "Zack Clemmons", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/30282520-zack-clemmons", "userReview": "Exceptional, engaging history writing. Given my present occupation, I'm woefully inadequate when it comes to Roman history. Yet thus far, any attempts I've made to remedy my relative ignorance dead end in the tedium and obscurantism toward which so much classics writing tends. But Duncan, so far as I can tell, is a diligent classicist and a gifted writer. His podcast slowly but surely honed his storytelling skills, and this book successfully threads between the Scylla of historical treatment so surface-level it enervates the past of gravitas and meaning and the Charybdis of sybaritic rabbit-trailing after the author's every idiosyncratic fancy. Like the Fates, Duncan knows how to spin the yarn, how long to trace it, and when to cut it. He mines down into political, economic, and personal explanations for the machinations and motivations of Roman power, and treats his source material with respect and just the right amount of realistic skepticism. Highly recommended."}, {"userName": "Peter Mcloughlin", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/16212136-peter-mcloughlin", "userReview": "The Roman Republic wasn't destroyed in a day. It was a process. Starting around the time of the destruction of Carthage up to the prosciptions of Sulla or 133bcce. to about 80bce. Romes conquests with all the riches degraded the fabric of the Republic as ambitious men bit ripped apart the seams of their institutions in pursuit of glittery prizes of power. As money flowed into Rome the rich got richer and the poor got poorer which made a more desperate populace with less and less respect for institutions giving openings to ambitious demagogues. The book covers the deterioration of the Ur-republic that all republics which came after worry about certainly The American Founders did and with good reason."}, {"userName": "Charles", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/295313-charles", "userReview": "Been a big Mike Duncan fan for a long time, and this book does not disappoint. Very readable, about a period that generally gets the \"Gracchi, Marius, Sulla, yada yada yada\" treatment.There's a little too much tick-tock of \"and then X happened and then Y happened and then Z happened\" and not quite enough analysis of WHY, or of the larger implications of the events. But that's a minor complaint, especially since the book is generally successfully largely because it doesn't try to do too much. The parallels between this period and our present day are obvious, but they're not perfect, and Duncan doesn't belabor the point. He just provides a fine-grained analysis of what happened in Rome, and leaves it to the reader to assess just what conclusions should be drawn from it all."}, {"userName": "Vincent Li", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/6427542-vincent-li", "userReview": "I was a little suspicious at first. I don't tend to trust people who wear vests in their bio photographs or are described as \"one of the foremost history podcasters in the world.\" On the whole a well written book, though I'll parrot what some of the other reviewers have said, that by the end the center does not hold, and things fall apart. The book is essentially a synthesis of the ancient sources (Polybius, Livy, Cicero, Plutarch, Sallust) on the period between the third Punic war and right before the rise of Caesar. In that sense, it's a rather uncritical account of that period (the one piece of modern scholarship mentioned explicitly is the modern belief that the accounts of the first and second servile war were so similar that sources probably just transposed the events of the second war on the first), so readers very well versed with the original sources might not feel like this book adds much to their knowledge. However, for a reader like myself, who has not gotten around to reading all the ancient sources, this is a well written and easy-to-read brush up on the major events near the end of the republic. The narrative is very similar to a fun novel, and the author does a good job of transitioning in-between people and events. Two minor gripes. The first is that there seems to be some weird typo for the words \"technically\" and \"ethnic\" which replaces certain letters with capitalized U's with two dots above them, not a big deal but was confusing on the first few encounters. Second, the footnotes in the book \"YES THAT CAESER\" were both jarring and somewhat juvenile. The history that book relates is indeed very interesting, and the author has done it a service by bringing it to public attention. The book starts with Scipio Aemilianus weeping at the sacking of Carthage, dreading the day that Rome would face the same, and ends at the retirement of Sulla, who gives up his position as perpetual dictator after thinking he saved the Republic. The book describes the slow collapse of the governing norms of the elite, and how individuals grabbing at power increasingly sidelined the mos maiorum (creative uses of the assemblies to break term limits by Marius and others for example), which eventually devolves into mob violence. I found the chapters on the Gracchi very helpful, it was hard to keep track of various reforms and how each brother met his end. The book does a good job at trying to explain the raising pressures created by Rome's success, the concentration of land in the hands of the wealthy, the raise of massive plantations, a vast inflow of slave labor and the displacement of small farmers from their land into the cities as the urban plebs. In addition, the various Roman allies and tiers of rights to Latins and Allies created tensions, especially when the nearby cities were repeatedly offered full citizenship and denied it. The reforms pushed by the Gracchi, including land redistribution (from public lands with wealthy squatters), a grain subsidy to urban plebs, veteran colonies, and citizenship for foreigners were attempts to relieve these pressures but met with stubborn resistance. Eventually both sides escalated the conflict with norms splintering (a tribune opposing Tiberius refused to withdraw his veto against custom and Tiberius attempted to run for tribune again), ending with the violent deaths of both brothers which both left those pressures unrelieved and created the precedent of the ultimate decree which would be used by the ambitious later. These pressures along with the rise of the popular general who would go abroad for years at a time and accumulate specular wealth and the personal loyalty of their soldiers lead to the raise of novus homo such as Marius. Eventually the rivalries between the striving nobles would turn from occasional mob violence to oppose or enforce legislation into open civil war between Marius and Sulla, with cyclical slaughterings and sacking of Rome itself. Ultimately, Marius would die of old age and Sulla would declare himself perpetual dictator of Rome in order to reform the governance and laws of Rome (mostly enhancing the senatorial class at the expense of the equites and the tribunes). Sulla gave up his absolute power afterwards, hoping that he restored the republic and set a precedent for those who came after. Sulla did set a precedent, but it wasn't the one he hoped for. The book tells the conventional story of the collapse of the republic, but this story itself is interesting and important to know. The story of Rome is both important in the history of civilization, and a morality play with infinite lessons that we are still trying to grasp today."}, {"userName": "Rob Conner", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/19950192-rob-conner", "userReview": "So to start, I read this book for a very interesting reason. Normally I would have no need to read this book. I know enough about the beginning of the fall of the Republic from Roman History. I don't know if I would need to read about in a book that gives a cursory telling like this book does. However, I would say the REASON I know about this time period of History is because I am an avid fan of the History of Rome Podcast by Mike Duncan. This reading was done as a fan of the Podcast and a supporter of Mike Duncan's work. I love the History of Rome Podcast; it got me into Podcasts, It got me into Roman History. Pretty much everything that The History of Rome Podcast claims to be about, it inspired me to delve deeper into. So, when I heard Mike was writing a book on Rome, I jumped into it like a madman. That is the one and only fault I can levy at this book. It really is not any sort of hardcore scholarly text. It takes a cursory look at the time period of Roman History leading up to the Fall of the Republic (Basically think the Gracchi Brothers to Sulla's Death). Admittedly, as Mr. Duncan points out, this time period is often overlooked by Historians who prefer to study the generation after Sulla's, the generation of Julius Caesar, Pompey the Great, Cicero, Cato, and Crassus. Duncan's work serves an important role to those who are learning Roman History or interested in learning more and those who are not fans of his Podcasts or are unfamiliar with him. However, if you are looking for a work that not only covers Roman History, but adds historical research and new opinions to the historiography behind it, then I think this book may leave you wanting. Again, a scholarly text this is not. I think this book doesn't really add much to the narrative, other than to shine a spotlight for casual readers to this period in History often overlooked. All that said, Duncan is as masterful in text as he is in audio. The book is wonderfully written and if you are a fan of his, or of Roman History in general, I suggest you read this book ASAP! Fan's of his podcast may already be well versed in the Roman History Duncan covers here. But what fan of the History of Rome can honestly pass up another opportunity to delve into Rome again?"}, {"userName": "Edward", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/4700832-edward", "userReview": "This is a history book that covers a period of Roman Republic from around 146 BC to 78 BC. This is the period after the Third Punic War when Rome finally defeated Carthage until close to the end of the Republic, with the rise of Julius Caesar, Pompey the Great and Crassus, before turning into The Roman Empire. One would learn about the times when the Gracchi brothers were making reforms, the feud between the Marius and Sulla and the great Civil War. According to the author's note at the beginning of the book, he wrote this book to focus on an epoch of the Roman Republic that is not much covered in other books and popular media. There is much less written about how the Roman Republic came to the brink of disaster in the first place. The author did attempt to make some comparison of the Roman Republic with the current state of affairs in the US in this author's note but he allows the readers to make their own judgment while reading the rest of the book, which does not contain commentary to draw parallels between the Roman Republic and the modern world we live in today.The book is definitely focusing on the politics and the military affairs during this period, and not much on the daily lives, nor the arts and culture. In particular, the readers will observe the transformation from a consensus style politics into confrontational style politics, as the system eroded from a civilized way of conducting politics into downright violence with mobs and gangsters. Throughout the book, there is a consistent theme of the gradual breakdown of mos maiorum, the unwritten code from which the Romans derived their social norms and literally meant “the way of the elders.\" This led to a slow breakdown until it spiraled out of control. Overall, the book was written in an engaging story telling style, with the right amount of details describing the different events. However, I felt the ending was a bit rushed as I would like to read more details about the transition from the Roman Republic to Roman Empire.I haven't heard about the author's award winning podcasts until reading this book and looking up the author. This would make a modern success story of how a popular podcast series (The History of Rome and Revolutions) would turn into a New York Times Bestseller."}, {"userName": "James Banzer", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/7910615-james-banzer", "userReview": "It's a bit embarrassing to admit that in 75 years of lifetime, I've given scant effort to comprehending the period of the Roman Republic. I know I'm not alone in turning my back on much of this ancient history. The Storm Before the Storm provided me with an excellent outline of a sliver of the very last part of the b.c. time frame. It's a wonderful introduction to fascinating rulers and numerous wars..Mike Duncan presents a wide array of very clever and interesting rulers of the time. As indicated by the subtitle, those who were part of this slice of history forged The Beginning of the End of the Roman Republic. Duncan details an era of horrific brutality, slavery and poverty. Mobs got their ways through savagery. To be poor on the streets of Rome meant certain death. If you have even a modicum of curiosity, accounts of the leaders could well inspire you to go Google in search of names such as Carbo, Sulla, Sulpicius and Jugurtha. While you are online you may wish to check out author's podcasts. Look at what he's done on the history of Rome. But don't stop there. He proves himself to be a historian extraordinaire with his work on revolutions."}, {"userName": "Richard", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/1662632-richard", "userReview": "The Lawfare podcast interviewed the author, and asked him to compare and contrast the subject of his book with the current United States situation, as well as a sampling of other \"storms before\" that did or did not lead to critical \"storms\".The podcast blurb:Political polarization, inequality, and corruption during the period 146 to 78 BC gravely weakened the Roman Republic in the years before its collapse. In his new book The Storm Before the Storm: The Beginning of the End of the Late Republic, podcaster Mike Duncan explores this period and how Rome’s politics, which emerged from Rome’s success, subsequently led to the republic’s downfall. Benjamin Wittes interviewed Duncan on his new book to discuss ancient and modern populisms, the parallels between the late Roman Republic and current American politics, and the impact of demagoguery on government.­"}, {"userName": "Conor Wilson", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/41977198-conor-wilson", "userReview": "When we think about the fall of the Roman republic and the subsequent rise of the Roman empire, we typically think of one man, Julius Caesar. But, as so often is the case, this move from a republic to an autocracy was not precipitated by a single event, but rather decades of infighting, norm breaking, and ambitious individuals grasping for power.I'm reminded of another book I recently read, How Democracies Die: What History Reveals About Our Future, which covers this topic more generally and with more modern examples. It is striking to me that the same patterns described in that book were present two millennia ago.The story of the fall of the Roman republic is a fascinating one full of conquest, ambition, inequality and war. Not only is it a interesting read, but also, I believe, an important reminder that history has an unfortunate habit of repeating itself."}, {"userName": "Aaron Berkowitz", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/10010696-aaron-berkowitz", "userReview": "Wonderful Popular History of an Often Ignored EraThis is a very readable and well done popular history of the first half of the Late Roman Republic, covering the period from the Gracchi to the death of Sulla, roughly 133-78 BC. The fall of the Roman Republic is a well known subject, but this volume focuses on the events that generally form the introductions to other popular accounts which tend to focus primarily on figures like Marcus Cicero and Julius Caesar. Instead, we get a comprehensive overview of the generation that preceded Caesar and crew.The book draws heavily on the ancient authors who wrote about the events of this period, and it includes numerous quotations from Roman historians like Polybius, Sallust and Appian. The author doesn't engage much with contemporary scholarship, so his views on things like the \"optimate\" and \"populare\" politics of the Late Republic seem a bit old fashioned. Nevertheless, for a lay reader or an undergrad seeking an entertaining account of the First Roman Civil War and the events leading up to it, this book comes highly recommended."}, {"userName": "David", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/1506188-david", "userReview": "It occurs to me that I’ve spent a lot of years waiting for Mike Duncan’s next episode. He was only at 10 or 11 episodes of The History Of Rome when someone, maybe Mefi or reddit, let me know what he was doing. I caught up that night and since then it’s been the first thing I listen to as I leave work every release day.Lot of hours spent listening to him. A large chunk of the appeal his Duncan’s editorial voice. I’ve listened to other history podcasts and none has really stuck. But his approach to the topics, taking a broad overview and dipping into detail, leavened with an arid wit, appealed to me.This book is not the podcast. Whether it’s Public Affairs Press, his editor, or even just Duncan himself, the book occupies a midpoint between the podcast and something I might have expected from any other popular history. That aside, this is a really excellent book. Roman history for me before Mike Duncan has the founding of Rome and then Julius Caesar. That’s a big gap, 600 odd years. I could spend a lot more time in that 600 years. All of it.Duncan picked a good 50 years to focus on. It’s right before The Period where most Roman history focuses on, Caesar and those first five Emperors, and it has a lot of same big dramatic, pivotal moments. He lucked out (for lack of a better term) that it’s so very topical. Yeah, the parallels aren’t perfectly aligned, but there is a lot of Saturninus to be seen in current politics.Anyway, I’m not saying my head is filled with visions of toga clad populists screaming out in the Forum “I’m as mad as Tartarus and I’m not going to take it any more!”.But I’m also not saying it’s not."}, {"userName": "Christina", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/4153950-christina", "userReview": "This is a delightfully casual read about the period \"before\" the end of the Roman Republic. There are plenty of books on the end of the Republic, but this book does a great job of explaining events leading up to the period of Cicero, Pompey, Crassus, Caesar, Antony, Augustus and all those other household names. The book is was a great refresher on the period and highlights the Gracchi, Marius, Sulla--- and even brings in how the Punic Wars started the \"Beginning of the End\". Of course, we have so many books on the end of the end, because of the high volume of surviving written records. But I enjoyed the discussion that Pompey and Caesar didnt come out of nowhere and that the Roman traditions were well on their way to ruin long before those man took the stage. The author has clearly brought his podcasting skills to the story telling. The tone is chatty and informal and is very accessible for people who aren't die hard history fans."}, {"userName": "Daniel", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/4714284-daniel", "userReview": "A history of the Roman republic from the Graciian brothers to Sullist. This time in Romes history gets far less attention than its sexier parts like founding,the Triumvirates, etc. but is crucial to understanding the rise of Ceasear as well as the fall of the republic.This book was engaging and interesting throughout and it doesn't take a genius to be able to see the parallels or more accurately the shadows of the parallels between this period in Roman history and modern happening in the US and the world. Its rise of populism and the failures and corruptions of the elite is a story that resonates now as strong as ever."}, {"userName": "Josh Derrick", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/63766642-josh-derrick", "userReview": "My internal monolouge of reading this book was in Mike Duncan's voice. And that enough made this book extremely enjoyable for me.In terms of content: what an eye opening read. The world of Rome is very different, but also so very similar to our own.It really is a shame that Marius, Sulla and the Gracchi brothers are overshadowed by the events that occurred half a century later. Duncan made these characters come to life, and although this book is not really long enough to delve into great detail on anyone's life (it covers like 100 years), it has certainly raised my interest in the period. I'll be looking for fiction about this time period"}, {"userName": "Malcolm", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/57974819-malcolm", "userReview": "Duncan's conversational tone and injection of humor make this an incredibly accessible book. Most interesting is the focus on political machinations over military engagements. While the battles are still covered (And it would be hard not to, Rome could not get enough of war in the first and second century BCE), he always comes back to the workings of the senate.Duncan also matches the Great Man history that usually follows Rome with the greater social forces at work. And while Great Man history is, rightly, often derided, it does seem appropriate here. Most of the historical sources for the period certainly write in that way.It's also pretty scary. The rise of income inequality setting the stage for populist candidates to overwhelm political systems should be remarkably familiar. As should the increasing rise of political violence to gain power. In his introduction Duncan even posits that somewhere in the events of this book is where he would posit America to be in its road to the fall of an empire.My only real complaints are the extremely fast pace. Nearly a century of Roman history is condensed into just a few hundred pages. Though, given the podcast origins of this book, I'm sure Duncan intended this to be more of an introduction than a complete text on the subject."}], "description": "The Roman Republic was one of the most remarkable achievements in the history of civilization. After its founding in 509 BCE, Rome grew from an unremarkable Italian city-state to the dominant superpower of the Mediterranean world. Through it all, the Romans never allowed a single man to seize control of the state. Every year for four hundred years the annually elected consuls voluntarily handed power to their successors. Not once did a consul give in to the temptation to grab absolute power and refuse to let it go. It was a run of political self-denial unmatched in the history of the world. The disciplined Roman republicans then proceeded to explode out of Italy and conquer a world filled with petty tyrants, barbarian chieftains, and despotic kings.But the very success of the Republic proved to be its undoing. The republican system was unable to cope with the vast empire Rome ruled. Bankrolled by mountains of imperial wealth and without a foreign enemy to keep them united, ambitious Roman leaders began to stray from the republican austerity of their ancestors. Almost as soon as they had conquered the Mediterranean, Rome would become engulfed in violent political conflicts and civil wars that would destroy the Republic less than a century later.The Storm Before the Storm tells the story of the beginning of the end of the Roman Republic--the story of the first generation that had to cope with the dangerous new political environment made possible by Rome's unrivaled domination over the known world. The tumultuous years from 133-80 BCE set the stage for the fall of the Republic.The Republic faced issues like rising economic inequality, increasing political polarization, the privatization of the military, endemic social and ethnic prejudice, rampant corruption, ongoing military quagmires, and the ruthless ambition and unwillingness of elites to do anything to reform the system in time to save it--a situation that draws many parallels to present-day America. These issues are among the reasons why the Roman Republic would fall. And as we all know, those who do not learn from history are doomed to repeat it.", "title": "The Storm Before the Storm: The Beginning of the End of the Roman Republic", "url": "http://www.goodreads.com/book/show/34184069-the-storm-before-the-storm?from_choice=true", "average": 4.26, "cover": "https://images.gr-assets.com/books/1492585818l/34184069.jpg", "reviews": 270, "authors": [{"url": "https://www.goodreads.com/author/show/3415858.Mike_Duncan", "name": "Mike Duncan"}], "type": ["History", "Nonfiction", "History"], "outlinks": ["http://www.goodreads.com/book/show/34184069-the-storm-before-the-storm", "http://www.goodreads.com/book/show/34905023-the-storm-before-the-storm", "http://www.goodreads.com/book/show/30370669-the-history-of-rome"]}