{"ratings": 60, "userreviews": [{"userName": "Patrick", "userReviewDate": "Jan 21, 2014", "userURL": "http://www.goodreads.com/user/show/1743033-patrick", "userReview": "One of the more fascinating spy thrillers I've ever read, even more so because it is non-fiction. Extremely well reported and written. The author acknowledges that there are necessarily gaps in the story he was able to tell, and that he knew he was being lied to during certain interviews, and that he probably was being lied to in others and didn't know. That's about all you can ask for from a difficult-to-report book-length treatment of one of the most odd and controversial security breaches in U.S. history. I haven't read any of Wise's other books yet, but now I plan to see if they're all as strong as this one."}, {"userName": "Phoenix", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/14099056-phoenix", "userReview": "An outstanding account of the life and travails of Edward Lee Howard the first American CIA agent to defect to the Soviet Union in 1986. Well researched, documented and written. It is both a sad and fascinating tale. The story covers his life from a rapid and successful rise to a cataclysmic descent into tragedy.Quite sadly it appears that Ed might have been a victim of his own eventual lack of utility. He was reported to have fallen down the flight of stairs in his Dacha outside Moscow in 2002, an unlikely story. However the truth like so much in espionage will never be known or made public. An excellent tale well worth reading."}, {"userName": "Boris", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/4370407-boris", "userReview": "An easy read on an interesting Subject.Unfortunately due to the very nature of counterintelligence agencies the information gathered in the book can be confirmed by one sourced and almost discredited immediately by another.The excessive use of footnotes seemed more of a distraction and could have been easily incorporated into the story.The author does tend to repeat his points over and over again made me wonder if he was fleshing out the word count.The Story of Ed Howard is an interesting one but I think a more updated indepth version of the story would be a better read.two stars."}, {"userName": "Kathy", "userReviewDate": "Dec 20, 2008", "userURL": "http://www.goodreads.com/user/show/863977-kathy", "userReview": "It's an interesting book. But there were parts where I thought it was innaccurate given the information that's been declassified and clarified over time."}], "description": "In spring 1983, Edward Howard was preparing for his first overseas posting as a CIA case officera tour in the agency's most sensitive station, Moscow. In June 1986, he became the first CIA officer to defect to the Soviet Union. Wise, a frequent writer on intelligence issues and co-author (with Thomas B. Ross) of The Invisible Government , interviewed Howard (in Budapest), his family, co-workers, and American counterintelligence officers to prepare this compelling analysis of events and mostly CIA bungles that led to a major U.S. intelligence disaster. The remarkable, clearly told story reveals intriguing snippets of the workings of American intelligence.", "title": "The Spy Who Got Away: The Inside Story of Edward Lee Howard, the Man who Betrayed His Country's Secrets and Escaped to Moscow", "url": "http://www.goodreads.com/book/show/610308.The_Spy_Who_Got_Away", "average": 3.6, "cover": "https://images.gr-assets.com/books/1387732982l/610308.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/60135.David_Wise", "name": "David Wise"}], "type": ["History", "Spy Thriller", "Nonfiction", "Biography", "War"], "outlinks": ["http://www.goodreads.com/book/show/610308.The_Spy_Who_Got_Away", "http://www.goodreads.com/book/show/180984.Spy", "http://www.goodreads.com/book/show/10615536-tiger-trap", "http://www.goodreads.com/book/show/980822.Nightmover", "http://www.goodreads.com/book/show/436601.Cassidy_s_Run", "http://www.goodreads.com/book/show/555238.Molehunt"]}