{"ratings": 2568, "userreviews": [{"userName": "Kristalia ", "userReviewDate": "Feb 08, 2016", "userURL": "http://www.goodreads.com/user/show/5705623-kristalia", "userReview": "[ HEA  (hide spoiler)]"}, {"userName": "N.K. Jemisin", "userReviewDate": "Nov 03, 2011", "userURL": "http://www.goodreads.com/user/show/2366515-n-k-jemisin", "userReview": "[I especially liked those chapters wherein Moon and Jade visit the Emerald Twilight court, and Moon must find a way to master consort etiquette -- when a just few months before he didn't even know the name of his own species. I also loved that we get to know more about characters who intrigued me in the first book: Flower the acerbic and grandmotherly mentor, Stone -- snarkier than ever in this outing -- and Moon himself. I love that we get to see a \"real\" solitary, and gain more understanding of why the Raksura are so suspicious of them. And holy crap, Jade. I love watching her play diplomat and maneuver her way through various politically-delicate scenarios, but there's a chapter near the end of the book in which she basically cried havoc and let slip the claws of war, and it was beautifully bloody. I've always loved the treatment of gender in this series: women who are stronger than men and the men who love them for it; gender roles that are neither stereotypical nor simple reversals. All Raksura are formidable, but it's made very clear in this book that the role of a queen is to be the baddest mf on the planet. I see now why Moon loves her. (hide spoiler)]"}, {"userName": "Mimi", "userReviewDate": "May 14, 2013", "userURL": "http://www.goodreads.com/user/show/2490110-mimi", "userReview": "The Serpent Sea takes place after the fight with the Fell. Moon is now a member of the Indigo Cloud court and takes his place beside Jade as her Consort. He’s settling into his new role and has even made a few friends, but before he could get comfortable, new trouble finds its way to the court.The survivors of Indigo Cloud decide to pack up and leave their pyramid mound. Too many bad memories there for them to stay, and like Stone said, the colony is too hard to defend from Fell attacks. So they head to the court’s original territory in the Reaches, the forest of their ancestors where Raksura originated. The journey is uneventful and they reach the colony tree in a matter of days. Once there, though, they discover the tree’s seed pod is missing and that the tree itself will die gradually if the seed isn’t recovered. Moon, Jade, Stone, and a number of beloved characters from the previous book head out to find the seed, and the journey takes them across the Reaches and into the Serpent Sea.Reading this book is like going on the journey. There are so many awe-inspiring things to mention: an ancient leviathan with a city on its back magically enchanted to stay afloat, the city on its back, the museum in the city on its back, flying boats, the vastness of the Reaches, and last but not least the colony tree itself. It’s like a multi-level city-sized tree house complete with running water, pools, and platforms for farming. The world building and details in this series is mind-blowing and gets better and better with each book.Complete review of the first three books at https://covers2covers.wordpress.com/2..."}, {"userName": "Mitticus", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/4765800-mitticus", "userReview": "4.5 flying stars You are your own worst enemy, he told himself. Not that that was a new revelation; it was just that he was starting to notice it more. -RTC-"}, {"userName": "Choko", "userReviewDate": "Sep 22, 2015", "userURL": "http://www.goodreads.com/user/show/27962805-choko", "userReview": "What a wonderful story!!! It broke my heart several times, but in a good way, if that makes sense... I love Moon, Stone and Jade! I feel for Chime and my heart hurts for Flower!!! I am totally emotionally invested in this beautiful magical world! Now on to the final one..."}, {"userName": "Tiara", "userReviewDate": "Feb 06, 2016", "userURL": "http://www.goodreads.com/user/show/2426502-tiara", "userReview": "Read more reviews @ The Bibliosanctum.Last year, the first book in this series, The Cloud Roads, was easily one of my top reads for 2015. Wells presented a wonderfully creative world with races who fall outside of human norms. This year, I said that I was going to continue this series. I want to finish up the main trilogy as well as the short stories in preparation for the upcoming fourth book in the series, The Edge of Worlds.Readers are introduced to the Raksura in The Cloud Roads, a shapeshifting race that possess both a draconic form and a groundling form. They are a matriarchal race of people with complex court laws. In this story, we meet Moon, a Raksura who’s spent most of his years living among groundlings after the destruction of his court when he was a young child. Because of Moon’s ignorance of much of the Raksuran mores, following him through this book is perfect. The readers experience the world as Moon experiences it, learning as he learns, which means that nothing feels like filler.Book 2 picks up almost immediately after The Cloud Roads. After an attack on the colony, the Cloud Indigo court moves back to the place where their lineage started, a mountain-tree nestled in the forest. Upon arriving there, they soon find out that the tree is dying because its heartseed has been stolen. This leads them to seek out the assistance of another Raksuran court. The neighboring court is unable to provide them with another seed. However, they are able to help the colony scry for their missing seed which leads Moon on a dash to retrieve it.I am still charmed by this story of the Raksura and the world they live in. Wells introduces new and fascinating races such as the waterlings in this installment, continuing this flair that feels fresh and original. Raksuran politics continue to be a complex weave of laws. While in-fighting was common in the last book, in this book, they have to contend with another court, which sheds even more light on how Raksura are expected to behave with one another. Readers learn how tenuous the ties between various courts can be and how the smallest things can be perceived as insults and power plays to force a rival’s hand.I appreciate that Moon is still learning and still wary, even though he is now the consort to the sister-queen of Cloud Indigo. Readers are allowed to continue this journey with Moon as he shares his uncertainties, triumphs, and losses. There are always new things for him to learn. He doesn’t automatically want to know everything about Raksuran politics. In fact, much of the culture makes him uncomfortable. He concedes that he should be learning things about the court, but he continues to live outside their societal norms for a consort. It doesn’t help that the mentor-like person who brought him to the court is allowed the freedom to do as he pleases due to his age, which Moon is emulating in his own way. Moon becomes very aware of how he differs from other consorts when visiting the neighboring court. Where Moon is quick to protect what is his, he finds that other consorts are little more than arm decoration. Moon has never lived a pampered, spoiled life, and he doesn’t intend to start living one (but he does give a little when it really counts).Wells also introduced more magic into this world. There are tastes of it in the first book via the mentor-caste in the Raksuran court who can heal, have visions, and perform augury (more like divination/scrying than reading omens due to birds’ flight patterns). In this book, groundling magic is introduced, especially as one character struggles with the fact that he’s no longer a mentor but is starting to exhibit strange powers more like groundling magic. However, the magic in this world is subtle and downplayed, and it never detracts from the Raksura who are the heart of this story.Chris Kipiniak continues to narrate this series, and I don’t think there’s anything that I can say about his narration that I haven’t said in my review of The Cloud Roads. His characterization of Stone and Moon continues to be two of my favorite voices in the series. I may not be overly impressed with his female voices, but I’ve gotten used to how he voices women.I enjoyed this book maybe only slightly less than the first. There’s a bigger spot in my heart for the first one. Maybe because of the way it completely enthralled me with this new setting and characters, but this book is a fitting continuation of the story that balances politics, action, and story in the world the Raksura inhabit. A part of me wishes I’d read these books sooner, but another part of me is glad that I started later, as there is plenty more for me to read and I don’t have to anxiously await a next book."}, {"userName": "Allison", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/9371994-allison", "userReview": "In the Books of the Raksura, Martha Wells has created a lush world with imaginative cultures and fascinating species. The culture of the shape-shifting Raksura is so foreign and detailed, but she makes it extremely accessible to the reader. It's such a pleasure to read.It becomes more clear in the Serpent Sea that this is not epic fantasy. The focus is not on a grand scale, but on the fate of a single, struggling clan in a large, indifferent world. We get glimpses of that world, but mainly we learn about the Indigo Cloud clan and their fight to survive. The Fell are not present in this book, as the clan has escaped to a colony location that their ancestors abandoned years earlier. The descriptions of their new home at the top of a giant tree are beautiful. I feel like I've been there. I feel like I want to live there!Now it is time to rebuild the clan and to connect with other Raksura - and to do what is needed to make the colony tree a viable home again. This has its share of danger and intense moments while Moon and his companions are on a mission away from the Court, and I felt the danger almost personally because I've come to care about these characters and their individual fates. It took me a little while to figure out what this was going to be about, and it moved a bit slowly in the beginning, so I didn't feel it was as amazing as the first book. Still a favorite though."}, {"userName": "Joel Neff", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/251662-joel-neff", "userReview": "In the second volume of The Raksura, Martha Wells does exactly what she's supposed to do: She expands the world created in the first book (The Cloud Roads), fleshes out the characters even more, including how they overcome a new obstacle, all in the guise of an entertaining story.What's harder to quantify is just how well she does all of the above. Ms. Wells' books could be (and ought to be) taught in writing seminars on how to build out a world without giving way to undue data dumps or pointless dialogue.Having said that, the flaw in this second volume of the raksura was in taking it away from the characters we know for the middle third. While the over-arching story is, at least on the surface, Moon's story, it is also the story of how he belongs to Indigo Cloud clutch and when the action takes us too far away from the conflicts built into that it can get a little stilted.In the end though, for me personally, there are two things that stand out as testaments to how good the book is: The first is that I bought it within seconds of having finished the first novel in the series. The second is that it was compelling enough to make me forego any other available distractions and devote an entire day to reading it. I suppose a third testament might be how much I'm hoping that there is a third volume to come."}, {"userName": "MrsJoseph", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/4702933-mrsjoseph", "userReview": "Time on Mt. TBR (as of 5/23/18): 1 year, 3 monthsI love Moon. And I love the interesting gender role reversals that happen in this series. Then I think about Murderbot and realize that - if I were interested in having children - I'd want to have some of Martha Well's children."}, {"userName": "Contrarius", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/5393057-contrarius", "userReview": "The prose in these books is very simple and basic -- occasionally annoyingly so -- and if I'd been reading in ebook format I would've counted how many times a character \"snapped his wings\". OTOH, you don't often get to see fantasy this aggressively nonhuman -- even elf/shifter/vamp/etc. stories are pretty much \"humans with cool abilities\" stories or \"human among the aliens\" stories. In Wells's books, though, we have a carefully constructed, complex, and detailed look at an \"alien\" species that looks, acts, and frequently thinks differently than ours, often in casual ways (not \"oh, look how different he is!\" but more \"yeah, of course that's the way he'd act. So what?\"), as well as their surrounding environment and the other species around them. So that's fun and satisfying.This book didn't feel as desperate or... I can't think of the word... life-and-death as the first in the series (The Cloud Roads), which makes sense in context. In the first book Our Hero didn't know who he was or where he came from, and after he found His People he became engaged in an edge-of-your-seat battle for the survival of his colony and perhaps his species. In this one he has started to settle in, and although he's still often confused by colony life, he has become an accepted and productive colony member -- and this adventure is about saving their new home, not about preserving their very exitence. Nonetheless, it drew me along throughout, and aside from some Mary Sue-ness I have no major complaints.As for the audio version, the narrator is fine -- I wouldn't call him exceptional, but I didn't find anything annoying except that he repeatedly pronounced \"baring\" as \"barring\" for some odd reason. And he did deadpan delivery extremely well (\"Yeah, this is going to be bad\" types of lines).Overall I'm rating this about 3.5, which is about the same rating I gave to the first book in the series when I read it last year. It would probably be higher if it had better prose. And yes, I've gone straight to the third book in the trilogy, The Siren Depths, which promises to have an interesting storyline. These are fun reads if you like action, politics, and a lot of immersion in nonhuman life without having to wade through a lot of gore or grimdark depressing world views."}, {"userName": "Melissa McShane", "userReviewDate": "Jan 04, 2012", "userURL": "http://www.goodreads.com/user/show/1329059-melissa-mcshane", "userReview": "The Serpent Sea is a worthy companion to the first Raksura book, The Cloud Roads. Everything that was good about the first is present in the second, but there's more of it: more detail about the Raksura culture, more interaction between the \"solitary\" consort Moon and his adopted court, more detail about the elaborate world Wells has created. In fleeing the Fell, the Indigo Cloud court has moved to a different home long-abandoned by their people, only to find it's dying because its source of life has been stolen. Most of the book is taken up by the quest to replace it, and while this storyline isn't as action-packed as the battle against the Fell, it's sufficiently tense to keep the reader's interest going.It's a lot more obvious at this point that the Aeriat's social structure is gender-reversed from ours. It's not just that they're ruled by a queen and that their female warriors are larger and stronger than the males (as was established in the first book), but the behavior patterns, particularly as shown between Jade and Moon, are totally reversed. If this story had Jade as a male and Moon as a female, it would be a recognizable and somewhat cliche'd story about female empowerment against a masculinist society. I like this reversal because it provides just enough cognitive dissonance without becoming some kind of social polemic. (Not that I expect that from Wells.) Having a male character who acts the way we expect a strong man to act, who is part of a society that expects (male) consorts to be lazy and somewhat submissive, made for an interesting read.The four stars are because, despite how much I enjoyed the book, I still have no idea where this series is going. I've been operating on the assumption that this is a trilogy, but there hasn't been any overlying arc tying the first volumes together and no thread to tug on that would show where the story is headed. The Fell are an interesting complication, but don't show up in this book. Searching for a home got wrapped up by the end of the novel. I'm happy to keep on reading, but unless this is a series of self-contained novels, I feel like there's something missing."}, {"userName": "Estara", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/3590834-estara", "userReview": "[(I still don't understand why he didn't have Rift killed - who knows what that sociopath had to do with the abandoning of the Indigo Cloud colony tree in the first place - otherwise how could he have shown those robbers the way to the tree seed?) (hide spoiler)]"}, {"userName": "Laura (Kyahgirl)", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/2906277-laura-kyahgirl", "userReview": "3.5/5; 4 stars; B+The second book in the Raksura series was a pretty tense adventure. I enjoyed the fantasy element and the characters. The only drawback for me was the over the top challenges that kept coming at the main characters."}, {"userName": "Roxane", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/5493653-roxane", "userReview": "Wonderful wonderful wonderful.Full of interesting creatures, magic, characters and relationships. I love that series, can't wait to start the third one!"}, {"userName": "Seregil of Rhiminee", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/10139520-seregil-of-rhiminee", "userReview": "The Serpent Sea is a wonderful and spellbinding sequel to The Cloud Roads, which was one of the best fantasy books of 2011. It gloriously continues the saga of the shapeshifting Raksura. (Note! The Clouds Roads and The Serpent Sea form a duology, so it's important to read The Cloud Roads before The Serpent Sea.)In the first book (The Cloud Roads) Moon was banished from his home for being different, because his companions feared him and his ability to shapeshift. He found out that there are other beings like him and he found himself a new home among the Raksura of the Indigo Cloud Court. This was the fascinating start of an excellent fantasy series, which continues to gather more depth in this sequel.Here's a bit of information about the plot of The Serpent Sea:- In The Serpent Sea Martha Wells reveals more things about the Three Worlds and its inhabitants. The events take place shortly after the events in The Cloud Roads.- The Serpent Sea tells how the Raksura arrive at the old colony tree of the Indigo Cloud Court. They notice that somebody has stolen the seed of their colony tree. The seed is important for the Raksura, because it turns a normal tree into a colony tree (without the seed the tree will rot from the inside), so they decide to find the stolen seed.- There's much at stake in The Serpent Sea, because the future of the ancestral home of the Indigo Cloud Court depends on how well the quest to find the stolen seed succeeds. The quest takes Moon across the Serpent Sea.That's all I'll write about the plot, because I don't want to write spoilers. I'd like to write more, but I think it's wise not to spoil anybody's reading pleasure by too many revelations.I like the Raksura characters very much. Martha Wells has created complex and intriguing characters, which keep on evolving in this book. It's actually amazing how easily and enchantingly Martha Wells writes about her characters. The character development is exquisite, because Martha Wells brings lots of depth to her characters with carefully chosen words and phrases, which reveal how the characters feel and what's happening to them (she brings her characters to life and deepens them fluently). Martha Wells' characters aren't stereotypical fantasy characters, because they're totally realistic and believable characters. Because the characters are realistic, it's easy to care about them and their fate.In the first book, Moon was a lonely hero, but now he has gradually begun to accept his new place within the court as a consort to Jade, who is a sister queen of the Indigo Cloud Court, but he still has some problems with certain things (he thinks about what being a consort means to him etc). It's wonderful to follow Moon's character development in this book, because he's an interesting character and it's easy to identify with him. His place as an outsider in the court adds nice tension and depth to this book and his relationship with Jade is interesting.The Raksura are an interesting and exotic species, because an individual's place in the society is determined by his/her biological abilities (readers, who aren't familiar with the first book, don't probably know much about the Raksura, so I think it's good to mention that they're able to change their appearance and have two different forms). This biological approach to social things reminds me a bit of insect world, because certain insects act in a similar way (for example, bees have various types of communities and colonies). I think it's great that the author has been able to create these charming shapeshifting creatures, because they're unique inventions.Although the Raksura are nothing like humans, they're amazingly humane and complex beings. They can be fully compared to human beings, because they have their own feelings, traditions and laws (I think that all the readers will be able to care about the Raksura and want to know what happens to them, because they're fascinating beings). Their exotic culture differs greatly from human cultures and that's one of the reasons why I love this book so much: it's interesting to read more about their social behaviour and how things are handled within the Raksura court.In my opinion there's an amazing amount of richness, style and depth in this sequel. The first book was a rich fantasy book, but this book is even richer, because more things are revealed to the reader. The richness of this book comes from wonderfully and vividly created characters and fine world-building. This book is full of small details, which are revealed bit by bit as the story goes on. I loved this kind of storytelling in The Cloud Roads, but I love it even more in this book, because I'm familiar with the characters and the strange world. I'm sure that other readers will also notice that the storytelling feels more powerful now than before.The world-building works perfectly in this book. Three Worlds is a vast place and there are several different intelligent species. Now the readers will get to know more about this world and its different locations. It was interesting to read the ancestral home of the Raksura and the quest across the sea, because the descriptions of the different landscapes and vistas were beautiful. The ancestral home was quite a sight to behold, because the author described it beautifully.The story is exciting and the plot moves fast forward, which is nice, because there aren't any dull moments. The Serpent Sea differs nicely from The Cloud Roads in terms of plot and world-building, because there's more action, character development and world-building. That's why I think it's fair to say that The Serpent Sea is a perfect sequel in every possible way. It's also good to mention the writing is as good and nuanced as in the first book, so readers who have read the first book will feel instantly familiar with the writing style.The Serpent Sea can be read as an entertaining fantasy adventure, but if you analyze its content closely, you'll notice that it's actually much more than simple entertainment. To be short, it's a story about survival. It's also a story about saving a home from a bad disaster.Here's a few words about the cover art and the appendixes:- I have to mention that I love Steve Argyle's astonishing cover art. His painting looks amazing, because the vivid colour tones are perfect and the flying Raksura look stunningly beautiful.- It's nice that there are three short appendixes at the end of the book. These appendixes may be useful to the reader, because they contain information about the Raksura and their enemies (the Fell) etc.Some readers may probably wonder if this book is truly as good as I say it is, because I've praised it a lot (I think I've probably praised it a bit too much, but in my opinion it deserves to be praised). I can say to these readers that there's nothing artificial about The Serpent Sea, because everything is totally believable and several things are explained in an interesting and entertaining way. I can also add that this book truly is an amazing achievement and worth praising, because it isn't often that you get to read this kind of highly imaginative and original adult fantasy.I think that Martha Wells should be applauded for writing the Books of the Raksura series, because it's one of the most imaginative and gorgeuosly written fantasy series available at this moment. She is a rare fantasy author, because she always writes fresh and unconventional fantasy. No matter what she writes about, she writes quality fantasy and avoids clichés. If you've never read anything by Martha Wells, you should start reading her books as soon as possible, because she is one of the best fantasy authors (when you've read a couple of her books, you'll wonder why you haven't read them before). This series is a good starting point, because it features an exotic world and fascinating characters, so do yourself a favour and buy both books.The Serpent Sea is a beautifully written fantasy book for adults. It's without a doubt one of the best and most satisfying fantasy novels of the year. It's perfect entertainment for fantasy readers, because Martha Wells uses all her writing skills to create a memorable story. She has created a fascinating story and captivating characters, which will keep the reader glued to the book. She combines almost seductively different elements from sublime character development to excellent world-building and makes sure that the reader is hopelessly hooked and can only keep on reading until he/she has reached the final page. (I have to admit that I can hardly wait to read the third Raksura book, because this series is simply amazing. I'm sure that Martha Wells has plenty of surprises and revelations in store for her readers.)Highly recommended!"}, {"userName": "TheBookSmugglers", "userReviewDate": "Jan 05, 2012", "userURL": "http://www.goodreads.com/user/show/1223249-thebooksmugglers", "userReview": "This sequel to the excellent The Cloud Roads (one of my top 10 books 2010) starts where the first book left of, as Moon, the now-consort to Jade, the sister queen to the Indigo Cloud and their court are on their way to their ancestral home in the hope of finding a new settlement for their people. The court is battle-weary after their fight against the Fell and worried about their diminishing numbers but still hopeful for a bright future at the new settlement. And at first, it seems all of their expectations have been fulfilled: within the trunk of a mountain-sized tree, filled with amazing carvings, beautiful surroundings, waterfalls and more rooms they can ever hope to fill, their ancestral home is a dream come true. But soon after their arrival, they find evidence of pillaging and discover that the seed that keeps the mountain alive has been stolen. Without it, they have no hope to survive there. Jade, Moon and Stone alongside some of the court’s most experienced warriors and mentors set out across the sea to find the missing seed.The Serpent Sea is a worthy sequel to The Cloud Roads and it features all of the strengths (fantastic world-building, great story, awesome characters) of that first novel. It is so easy to fall in love with this series and the reasons are manifold.It presents one of the most beautifully rendered Fantasy worlds I have ever encountered. The descriptions of the locales, the peoples and the different cultures of the Three Worlds have depth and originality. For example, I am amazed with the description of the mountain-sized tree that is the court’s new home: it’s grandiose, creative and literally awe-inspiring. From the moment the court stepped through its “doors”, I wished and hoped for them to make a home there. There is also an element of magic in the series but this is not really a central aspect of the series and it never overwhelms the story. Instead, the social and political dynamics of the Indigo Cloud court and their fight for survival are its central focus. There are internal conflicts (between the queen Pearl and sister queen Jade; between some of each queen’s favourites within the court; between those who support Moon and those who distrust him because of his past) as well as external ones (their diminishing numbers as well as a lack of Royal consort make them vulnerable; there are diplomatic issues with a neighbouring court) and all of it are compounded with the urgent need to find the missing seed. The actual plot of The Serpent Sea is a smooth continuation of the long-term tribulations of Indigo Cloud. The well-paced story evolves from their fight for survival and spirals from there in an adventure across the sea: there is time for fighting; there is time for diplomacy; there is also time for love-making, for laughter (I love the humorous bits interspersed throughout and the banter between Moon and Stone is so much fun) and for sorrow.As much as I loved the aforementioned aspects of the book, the characters are my favourite thing about the series. The Raksura, as a race, is fascinating and I loved reading about their culture and their internal dynamics. It is all the more interesting that even though they are clearly the heroes of the series, there is also scope for a critical look at some of their more troubling aspects. For example, how the standing within the court is biologically determined. This is expertly explored through Chime, a character who was born a member of the mentor’s cast and has unwillingly shifted into a warrior – this shift is not to his liking, he misses being a mentor but he seems to have no choice in the matter. It seems unfair because well, it is unfair but I feel his story is far from being done. Perhaps there is room for change there? I would love to see that.Finally, there is Moon. The series is from his point of view and this is perfect from a narrative perspective: he is as new to the Raksura world as we are and as such what he doesn’t know, we don’t know. This makes the small bits of info-dumping present in the narrative less awkward than they should have been. More to the point, his struggle to fit in and to be accepted by the court is a very real one. His budding relationship with Jade is really cool. But more than that, the most important aspect about his arc is the conflict between how he should behave as a consort and how he does behave. A consort is basically someone with high social standing but no real power, someone expected to be lazy and pampered. Moon is someone who has lived most of his life fending for himself and who loves to hunt (although he prefers not to fight). He stumbles all the time in this new position and wavers between assertiveness and acceptance of a submissive role. Although he respects the tradition that comes with being a consort, he strives to find a more energetic position and I LOVED that empowering Moon doesn’t automatically mean under-powering Jade. I also LOVED that his need to have a bigger voice does not come from being a male. He wants to be able to do more because that’s who he is, not for some gender-specific reasoning and certainly not because he wants to be more powerful than Jade (like that could ever happen. Seriously, Jade is simply the coolest BAMF ever and this one scene toward the end when she unleashes her fury? SO badass.I do have one major concern: at the end of The Serpent Sea it seems that the story started in Cloud Roads comes to an end and although there is certainly scope for more stories in this world, these two books read as a self-sufficient duology. Please tell me it isn’t so, I want many more Raksura books.Is it too early to declare The Serpent Sea a favourite read of 2012?"}, {"userName": "Metaphorosis", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/7706283-metaphorosis", "userReview": "reviews.metaphorosis.com 2.5 starsMoon and the Indigo Cloud court of Raksura shapeshifters have lost their home, and are returning to the court's original location. When they reach it, they find looters have stolen the heart seed, without which the home tree is dying. Moon and other Raksura set out to track down the seed and recover it.If there weren't plenty of evidence against it, I'd think that the Martha Wells who wrote this book and the one who wrote City of Bones are completely different people. City of Bones and Wells' other early books are interesting and well written. The Raksura books, on the other hand, are distinctly average.Wells has come up with an interesting world for the Raksura, so it's not a failure of invention that plagues the series (though there are weak points, like cost-free magic). Most writers get better as they age (unless they get distracted by particular obsessions), but Wells' Raksura books simply don't seem very well constructed. There's a pervasive feeling of action for the sake of plot, rather than as a result of natural character choices. For example, late in the book, some of the characters have escaped danger, and should be free to go. For no reason at all, they presume antagonism in a new set of encounters. It's clearly meant to heighten the tension, but fails because there's simply no reason for it to happen. It's confounding and frustrating rather than exciting. There are similar moments throughout, as if Wells has mysteriously lost her ability to construct credible characters and story. Because so many character actions don't make sense, the story is not very interesting to follow.The story is unfortunately also an entry in the 'might makes right' subgenre. Most of the character relations in the book are based heavily and often explicitly on 'do as I say or I'll beat you up'. Happily for us, our hero is bigger, stronger, and meaner than the bad guys. It's a lazy and distinctly unappealing approach to character building; even Conan had a little more depth. There's a distinct racial/speci-al element to the story as well, with the Raksura treating groundlings (humans) as a distinctly lower class. There's never much introspection about this. The Raksura are simply high-handed in how they treat other species, and they get away with it without a second thought. For example, one 'waterling' who answers their questions (a bit grudgingly) is dumped far out of his way because ... why not, if that's what the Raksura feel like? Equally unappealing is the double standard the Raksura use. When they do something, well, they're good guys. When others do the same, it's shocking! There's not much character recognition of this, even when the parallels are painfully obvious.There are other inconsistencies in the story and setting. They'd be minor issues if it weren't for the above, though there are a few key points that simply make no sense, including one related to the core of the story - the special seed they spend so much time searching for.I used the word 'lazy’ to describe the writing. Perhaps that’s harsh, but I'm not sure what else to think. There's a lot good in this series, but so many flaws that it just doesn't work. Yet Wells' early books were quite good. Perhaps she's under time or other pressure. Whatever the cause, the result is far from the skilled presentation I expected. Some people clearly like the series, but my feeling is that if you loved City of Bones, you'll be pretty disappointed by the Books of the Raksura. The title, by the way, is misleading. There’s a sea, certainly, but little in the way of serpents."}, {"userName": "Bibliotropic", "userReviewDate": "Aug 11, 2012", "userURL": "http://www.goodreads.com/user/show/3299269-bibliotropic", "userReview": "(Reread in 2016 to catch up with all the books in the series.)Martha Wells gives us a strong follow-up to her earlier novel, The Cloud Roads, one that is just as engrossing and richly-detailed as I'd come to expect after reading the previous book of the series.Whereas before we see the protagonist, Moon, really coming to know himself and being the perfect blank-slate character to introduce us to a world unlike the vast majority of fantasy on the shelves today, here we see Moon as someone who has accepted his place and his role, embraces it, and moves forward. No longer are we as readers simply learning about the world and theRaksura through him, but we're alongside him as he goes through this book's adventure, which is world-spanning without being world-changing. Wells has expected that her readers understand the backstory and doesn't hold your hand as she continues telling the tale.Moon's court has left their previous home to forge a new one, or rather returning to an old one that hadn't been used in generations. After a difficult journey, they finally arrive, only to discover that the seed that keeps the gigantic tree that is their new home alive has been stolen, and the tree will soon die unless it is recovered. A small group of them set off on a new journey to relocate the seed and save their new home.Put that way, The Serpent Sea sounds rather boring, like a fetch-quest from a video game, and one that is better suited to a short story than a full-length novel. Thankfully, the story itself reads as the exact opposite. What seems like a simple premise gets wonderfully complex, and we get to see more glimpses into the vast and varied world and sets of cultures that Wells has done no small amount of work to properly develop here.It's been said by many that these books are notable for the fact that humanity as we know it simply doesn't exist. There are humanoid races, certainly, but they are not the dominant race. They are just one part of many, much like the Raksura themselves. It's very refreshing to take a break from humanity now and again and throw yourself into a world that has touches of the strange and the familiar all rolled into one, and this is precisely what Wells delivers.The writing style continues to be smooth and fluid, with a bright feel to it that one mostly finds in YA fantasy. it made the book easy to fall into and get lost in, though the style occasionally felt a bit at odds with characters discussing sex and being horny. This doesn't happen often, but when it does, it makes me do a bit of a double-take. But aside from those brief scenes, the writing is even, well-paced, and a delight to read. Wells conveys a good story with plenty of action and intrigue without getting bogged down in darkness and grit.Ultimately, this is a wonderful follow-up to an already strong previous novel, and it's one that I recommend to any fans of classic fantasy. It's a fun read with a great story in a fantastic world. Wells has really got something good going here, and I eagerly await any continuation that she writes in this series."}, {"userName": "Sonia Lal", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/6121547-sonia-lal", "userReview": "The Serpent Sea is a fantastic fantasy. It’s world-building is original, the most original I’ve seen in a long time. The characters are good. The Serpent Sea is a sequel to the Cloud Roads and it’s not the kind of sequel that’s easy to read without reading the previous book. In the last book, Moon, our hero, an orphaned young man, has spent his life going from one groundling community to the next, always hiding, always trying to fit, never revealing that he shift forms. Then he discovers he is Raksura and born into a high caste. Moon is born a consort. (Consorts are fertile males with black scales.) Sheningans follow, including the sister queen claiming Moon as her consort. The matriarchal nature of Raksura society is clear in the last book. It is even more obvious in The Serpent Sea. In fact, consorts are like trophy wives. I didn’t realize this in the last book. But Moon’s consort status was less prominent in it. That is Moon’s personal conflict. He is who he is. He’s taken care of himself for long as he can remember. He doesn’t like fights, but he’s doesn’t back away from them, either. He’s likes hunting and apparently consorts don’t usually hunt. Fight, either.He doesn’t know how to behave like a consort. He hasn’t been trained to it; he didn’t grow up in a colony and he’s never really known other Raksura. He knows nothing about their society, about the hierarchy and the roles of different castes. Consorts don’t challenge queens, which he does while visiting another court. She insulted him; he insulted her right back.In fact, that was my favorite scene. Jade, his queen, had to fight the other queen. The other queen said something like, I will take you after I defeat her. He was all: You try, I’ll rip out your guts. The other queen was stunned, because consorts just don’t say things like that. I loved it.And it’s not even because he spent a lot of time among the more patriarchal groundling races. That’s just who he is. One of the other characters is also a solitary male and he’s an example of why everyone is wary of Moon. Most solitaries are apparently are odd and not to be trusted. Truthfully, I felt the other solitary male could have been better explained. But this isn’t a huge weakness. Him and his actions are a plot point and sometimes it felt like the plot was the only reason he was there. Still. It’s not huge.There are external, quite exciting conflicts, too. The part where they are eaten by a leviathan is really nice.The end feels complete. There is supposed to be a third book next year, The Siren Depths, but it might star a different character. Maybe even a different race. This world is complex enough to write dozens of books, each featuring different characters, different races, a different element of the world."}, {"userName": "Kagama-the Literaturevixen", "userReviewDate": "Oct 31, 2011", "userURL": "http://www.goodreads.com/user/show/889924-kagama-the-literaturevixen", "userReview": "Im still fascinated by the world setting and the raksura.I just felt the plot meandered a bit at times.Henche the two star rating.And then the relationship between Jade and Moon...well Jade scolded Moon...and they had some sex.And that was it.Sure they had scenes when they were loving and caring too,but I detected a pattern. Moon would do something \"non-raksuran\",Jade would dissapprove.Moon would feel unsure about her feelings and they would make up again. I think this happened at least three times in the book. It got old really fast.And what happened with the fell? I mean they were defeated in the last book. But it was as they vanished from face of the earth.Also I really want to know what court Moon came from...Like right now :0"}, {"userName": "Coffcat", "userReviewDate": "May 19, 2012", "userURL": "http://www.goodreads.com/user/show/350874-coffcat", "userReview": "I really enjoyed this book, Martha Wells is such a wonderful author, the second you open one of her Raksura books you fall headfirst into wondrous lands filled with strange creatures. Once you start reading one you cannot put her book down until you are done.This book is a continuation of Moon's journey. I was worried to get my hopes up too high since I liked the first book so much. I worried for nothing though. I rather enjoyed watching him spend more time with the Raksura on their journey to find a new home. I could see the stretch in him as he adapted from being solitary to living with others as a group. I can't wait for the story to continue and look forward to the next in this series."}, {"userName": "Gemini", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/66433452-gemini", "userReview": "Huge improvement in character development. Moon is showing that he has layers which I enjoy. The relationship between him and Jade is very sweet. She loves him the way he is and he appreciates that. I look forward to the rest of the series."}, {"userName": "Rilee Moulton", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/7564384-rilee-moulton", "userReview": "Wells continues with beautiful world building and a brilliant cast of characters. I can’t wait to continue this series!"}, {"userName": "Athena", "userReviewDate": "Apr 19, 2016", "userURL": "http://www.goodreads.com/user/show/16891485-athena", "userReview": "Volume Two in Wells' Books of The Raksura series, \nThe Serpent Sea\n breaks the mold for most SF/Fantasy multi-book series: it's a second novel that is every bit as good, if not better, than the first in the series. So often a second volume spends itself explaining & expanding background rather than furthering the story, absolutely not the case with \nSerpent Sea.\n If you enjoy a well-crafted and interesting story with believable, intriguing characters do yourself a favor and buy, beg, or borrow copies of these books: they do not disappoint in any aspect.Moon, focus of the series and an isolated member of the Raksura race abruptly reunited with his native culture in adulthood (\nThe Cloud Roads\n, first volume) is working to integrate himself into his adopted 'tribe,' the Indigo Cloud Court. He is consort to Jade, a sister-queen to the court's ruling Queen, and having to fast-track learn the subtle and complex infrastructure, politics and etiquette of the Raksura. The Raksura are shape-shifters, born into one of two physical types (winged and non-winged) similar to certain ants, and similarly ruled absolutely by a Queen who nevertheless must cooperate her with sister queens to a certain degree: political machination between Queen factions is the reality amongst Raksura Courts. The Raksura physical types are further divided from birth into different castes, all necessary to the survival of the Court: teachers, hunters, warriors, queens, consorts, etc. The only fertile winged Raksura are Queens and Consorts, and all the non-winged are fertile.Wells conveys the complexity of this fully realized society, and other societies encountered over the course of the book, while never deviating from telling this ripping good tale. There is tension aplenty: within the Court itself, outside the Court as they are forced to find a new home, fleeing an ancient and terrifying enemy; between Indigo Cloud and an established Court they encounter complete with the complicated diplomatic niceties one would expect well-integrated into the storytelling.The world Wells created is vast and populated by an incredible variety of sentient life forms, each giving indications of their own complex societies. Some of these are faintly reminiscent of classic science-fiction life forms and a few are Lovecraftianly creepy. The times when major characters encounter the creepy bad guys & situations are beautifully well-written, giving just enough description and explanation to build tension to the point where I almost couldn't breathe but never at the expense of forwarding the plot. There is nothing extraneous in this book, everything serves the story and the growth of Moon as a person.Perhaps that's what I enjoy most about Wells' writing: she writes like a poet, not with flowery or obscure language but with a minimal, close-to-the-bone writing style that gives the reader just enough to tell the story and not a word more. Like the first book, I absolutely gobbled this down much as I tried to slow myself to extend the enjoyment.Martha Wells is a brilliant writer with amazing vision, a strong narrative voice, and the ability to handle complex plot lines without losing touch with the humanity, if you will, of her characters."}, {"userName": "Michelle", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/84077-michelle", "userReview": "You know how there's sometimes that one little fly in the ointment that just keeps you from head-over-heels loving something that you know is really good? Maybe you meet someone with your ex's name, or you just hate it when there's a slo-mo montage scene, or the taste of cinnamon makes you blech. Well, Martha Wells is over here writing some really fun fantasy where all the main characters have simple one-word nature names - Moon, Flower, Stone, Heart - and I just can't shake the idea that this is therefore obviously a YA novel. It's not, this is a complex without being clunky society, populated with a genetic caste system that we see through the eyes of a strugglingly imperfect protagonist that goes off on an adventure to save the ancestral home. Everything promised by the beautiful cover is blazingly real on the page: you do in fact get flying dragon-esque shapeshifting warriors soaring over a city built on the back of a leviathan. People screw up and need to redeem themselves, mistakes are made, stakes are real, and there's no simplistic chosen one to fight the baddie story going on here. But that guy is named Moon and it kinda drives me bonkers."}, {"userName": "Katharine Kimbriel", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/1222948-katharine-kimbriel", "userReview": "Welcome to a panorama of world building that you may not have seen for a while. Martha Wells always takes us places we haven’t been before, and in her Books of the Raksura, her new series from Night Shade Books, she’s brought us a story that is wonder, exploration and adventure all rolled into one. Most people would call this fantasy, because there is indeed magic here, but the peoples of this world are so well thought-out anthropologically that sometimes this feels like SF.Moon was a young orphaned adult adrift in a world not his own, hiding a dangerous secret – he had another form, and he could fly. In The Cloud Roads, Wells’ first Raksura novel, Moon finally found out what he was, if not who he is. His journey took him from loss to hope and finally, in the end, found him belonging and love. But no adventure covering so much ground is without risk, or continued conflict. In The Serpent Sea, Moon, a rare fertile male of his people, has found a clan and a queen. But he is discovering that the intricacies of Raksura culture still leave him the odd Raksura out. Moon has kept himself alive for over forty of his planet’s turns, and his strengths and chameleon-like gifts are far from the norm among Raksura consorts.In this novel, the Indigo Cloud court has chosen to return to the forests their people sprang from, to the mountain tree that was their greater clan’s home. But this journey has unexpected twists. They find the tree abandoned, and worse, desecrated, its heartstone missing, the tree blighted. Moon and his queen Jade have no choice but to pursue the faint traces of a trail that leads to the Serpent Sea and beyond. Without the heartstone, they are homeless, and may cease to exist as a court.As before, this volume has many different sub-themes. We see among many patterns conflict and friendship between different peoples (who in these books are literally different peoples!) belonging, alliances with Others for mutual benefit and protection, and fighting for life and freedom, just to name a few. The strongest thread in the weaving is still Moon’s ongoing battle to truly belong to a court, and help his people solidify their home.Highly recommended!"}, {"userName": "Sandi", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/29091690-sandi", "userReview": "This story relies on the previous book to establish the characters and the fanciful world, which is good because it frees the author to dig in and tell the story. Moon has accepted his position within the colony, to a certain extent. But to say he is sanguine about it would be wrong. Action opens with the colony relocating back to its home settlement within its ancestral home mountain tree. Unfortunately, with the Raksura gone, it left the tree undefended and the tree is damaged and dying. The colony has to send a group including Jade and Moon to attempt to reestablish a connection with a nearby colony and recover an item that could save their home. Moon is, as usual, somewhat clueless and aggressively antagonistic to actually figuring out what he is supposed to know. On the other hand, he is not actively trying to sabotage his relationships within the group anymore. Some parts of this book were way too well-telegraphed beforehand; I knew the island city would be aboard a floating sea creature that is enslaved to a magical power’s will. Otherwise, why would they have needed a magical item recovered from the Raksuran colony? Moon’s flakiness is more restricted in this story in contrast to the last, but he still flails about with silly, angst-y self-doubts at inopportune times. A conceptual quibble - a pace = 30inches so if the Raksura are ~20 paces across, that would translate to the creatures being about 50 feet across. That’s pretty darned big, especially when picturing them entering buildings. I am not actually able to visualize that with what is actually described within the text. Otherwise, the story was reasonably straightforward, the introspection was restricted, the society was advancing and adapting to the changes thrust upon them – this is all good. Even with these quibbles I am really beginning to warm up to this story and series and am eagerly looking forward to its next installment."}, {"userName": "Saphirablue", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/6752061-saphirablue", "userReview": "♥ *flails* ♥I don't know what to say except that this book is as awesome as the first part. ♥The story is engaging and plotty and thrilling and so on but the characters? OMG! The characters!!!!!!I've lost my heart to Moon the very first page of the first book and now all over again. ♥Jade - I want to be her!Chime - can I just hug and cuddle you and never let you go again?Root - loud mouth but not stupid, no no, certainly not stupid!Stone, Balm, River, Vine and everyone else - I love you! Seriously, I love you all!The worldbuilding? A swimming leviathan so big that a city is built on it? The Ket - a people living in the roots of the giant trees and I don't know how to describe? Waterlings with big hands that could pluck a Raksura out of the sky if they fly too close to the water surface? ♥I had so much fun reading this book, so many scenes I had to laugh out loud, so many great, wonderful character scenes, action scenes, thoughtful scenes and sad ones. ♥I discovered that I have a new button (that's been getting pushed in the first book too but I didn't realize that it is a button) - Moon being used as a pillow by just everybody and he has to put up with it and is just a bit grumpy about it. *g* So much *awwwwwwwwwwwwww* for that.Also, the little ones (Frost, Bitter, Thorn) all being so very attached to Moon and once again he has to put up with it and does it while being not that grumpy? :DAnd now I have to wait until December for the next part. :( *wahhhh*"}, {"userName": "Connor", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/22027176-connor", "userReview": "Okay, I kept going debating what to give this book in terms of a rating, I've settle'd on 3.5 stars, I think. The world-building is phenomenal. It is a very interesting, capturing world to read about with many different facets that can be explored. The writing is fantastic although during some battle scenes, I was a bit confused on what exactly was happening. I loved seeing all the characters again and learning more about the Raksuran culture especially when meeting a thriving colony. What sent this book down to 3.5 stars for me was the plot. It didn't have a very good direction and just took the reader all over the freaking place. I began to not care about what was happening because each small adventure didn't really matter that much. The ending couple of chapters were also just absurd with the amount of random problems thrown in. There was also zero character growth in this novel, from my perspective. None. Not one of the characters changed their views or understanding of the world a degree in any direction. It was a bit frustrating.I will be continuing to book three because I like Moon, Chime, and the world, but Jade was really annoying in this one so I hope she chills out for goodness sake."}, {"userName": "Just A. Bean", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/8332956-just-a-bean", "userReview": "I like this series. A lot. This is the sequel to Cloud Roads, which you need to read first, but that's not a problem as you should be reading Cloud Roads. I liked this one even better than the first one. I'm trying not to spoil either of them, but the protagonist, Moon, spent the first book trying to figure out what the hell was going on and doing total culture shock. In this one, he's a bit more settled in, but there's still so much stuff that he doesn't get. Most of the book is a really fascinating look at how being that much of a cultural outsider works when you're suddenly part of a really tight-knit group. It's all relationship dynamics, and most of it is gorgeously subtle while still hitting all of my emotional kinks. Plus he's the only narrator, so some of it's figuring out what's going on no matter what he thinks is, which I enjoy. Also, hey, it's about shape shifting dragons fighting undead sea monsters. Really, there's not a lot to dislike in this book! I'm very much looking forward to the next in the series. I want to see more of what happens to these characters, and I want to see more of the world they live in. Would rec to anyone who likes secondary world fantasy with amazing world building and well thought out characterisation."}], "description": "Moon, once a solitary wanderer, has become consort to Jade, sister queen of the Indigo Cloud court. Together, they travel with their people on a pair of flying ships in hopes of finding a new home for their colony. Moon finally feels like he's found a tribe where he belongs. But when the travelers reach the ancestral home of Indigo Cloud, shrouded within the trunk of a mountain-sized tree, they discover a blight infecting its core. Nearby they find the remains of the invaders who may be responsible, as well as evidence of a devastating theft. This discovery sends Moon and the hunters of Indigo Cloud on a quest for the heartstone of the tree — a quest that will lead them far away, across the Serpent Sea.", "title": "The Serpent Sea\n      \n          (The Books of the Raksura #2)", "url": "http://www.goodreads.com/book/show/13350815-the-serpent-sea", "average": 4.08, "cover": "https://images.gr-assets.com/books/1328126697l/13350815.jpg", "reviews": 228, "authors": [{"url": "https://www.goodreads.com/author/show/87305.Martha_Wells", "name": "Martha Wells"}], "type": ["Fantasy", "Fiction", "Adventure", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/13350815-the-serpent-sea", "http://www.goodreads.com/book/show/11834447-the-serpent-sea", "http://www.goodreads.com/book/show/13343819-the-serpent-sea", "http://www.goodreads.com/book/show/32758901-all-systems-red", "http://www.goodreads.com/book/show/9461562-the-cloud-roads", "http://www.goodreads.com/book/show/13649197-the-siren-depths", "http://www.goodreads.com/book/show/321357.The_Death_of_the_Necromancer", "http://www.goodreads.com/book/show/17345202-razor-s-edge"]}