{"ratings": 18082, "userreviews": [{"userName": "Huda Yahya", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/7878381-huda-yahya", "userReview": "أستيقظ كل يوم وأنا في حالة صدمةكما لو كنتُ محقونًا في الداخل بالوعي بأن أكون في العالمبأن أكون دمية حيّة في قصة مذهلةإذ من نحن ؟هل تستطيع أن تجيبني على هذه النقطة؟نحن موجوداتٌ مصنوعون بكلِّ أجزائها من غبار النجومولكن من أين جاء العالم ؟؟ــــــــــــــــــلغز لعبة السوليتير أو سر الصبر كما تُرجمتْ إلى العربية هي واحدة من أمتع الروايات التي قرأتهافي عالمٍ من الفانتازيا المجنونة نسبح مع هانز توماس في رحلته لإستكشاف الكون وإستكشاف أصله ومنبته كذلكولأنّ الفلسفة محور روايتنا الحلوة ، فتكون الرحلة إلى أثينا في اليونان منبت الفلسفة وأصلها;;;;;;;;تحكي الرواية عن هانز توماس الطفل الجميل الذي يسافر في رحلة مع والده للبحث عن أمه ،التي هجرت كليهما مذ كان هانز يناهز الأربعة سنواتوذلك كي تعرف \"من هي\" على حدّ قولهافتركت زوجاً أصيب ببعض الإضطراب النفسي ، يعاقر الخمر معظم الوقت ولكنه أباً حنوناً مايزالعندما رآها الإثنان على غلاف أحد المجلات ، قرر الأب أنه قد حان الأوان لإسترجاعهايقابل هانز جده في بداية الرواية ( بدون أن يعلم من هو )ليحصل منه على كتابٍ شديد الضغر ،حيث أن حجمه لا يتعدى عقلة إصبع ،!وكان الكتاب مخبّئاً في فطيرة حلوىنعم! ما قرأته صحيح .. فطيرة بداخلها كتاب صغير يحوي سر الرواية بأكملهاوعن طريق عدسة مكبّرة يقرأ الفتى مذكرات جده الشديدة الغرابة;;;;;;;;ومثلما كانت رواية عالم صوفي، فسر الصبر أيضا قصة بداخل قصة ويالها من قصة تلك التي بالداخلفي جزيرة عجيبة ، كالمتاهات طرقها ،يهبط صاحب المذكراتيلتقي بعدها بأقزامٍ يرتدون أزياء أوراق اللعب هؤلاء الأشخاص المخلوقين من الورق والأفكار لا يستطيعون تكوين جملة بشكل صحيح ويقومون بإحتفالٍ سنويّ ليتلو كلٌ منهم جملته التي قضى السنة بأكملها محاولاً تركيبهاالجمل تبدو لك غير مفهومة ، وتتركك في حالة من التشوّق لمعرفة كيف يمكن ترتيبها لتصنع حكاية ، والتي ستتنبأ بمصير عائلة بأكملهاشخصيات أوراق اللعب القزمة تراوغك طوال الرواية وتداعبكتهذي بأدمغةٍ من عالمٍ أخر ، وببراءتها وسذاجتها تحيل رأسك دوامة من الأفكار ;;;;;;;;والجوكر قد أصبح عنصرا أساسيا في روايات جوستين جاردر وهو دوماً القزم الغريب الذي يجوب العالم ويسافر عبر الزمن ، يرتدي جلاجله المشخللة ولا يكبر أبداً يظهر لك في أي وقت على غير توقع ، ودوماً تشعر بمراقبته لك;;;;;;;;هذه الرواية من أكثر ما قرأت تشويقاً ومتعةكنت ألهث وراء الجديد مع كل صفحة وأتشوق لأعرف ماهية السر العجيب الذي صنعه جاردر بحرفية لا مثيل لهاكم مرة قد قرأت رواية تتحول فيها أوراق الكوتشينة إلى أشخاص حقيقيين؟كم مرة وجدتَّ شخصاً يحلم بأشخاص ليجدهم في اليوم التالي جواره يتنفسون ؟;;;;;;;;والصبر هنا في الرواية أو لعبة السوليتير يحاكي صبر الأبطال ، وانتظارهم الطويل وانتظارك أيضاً لكي تعرف ويعرفوا الحقيقة ويصلوا إلى نهاية ويفهموا قليلاً عن الكون من حولهميقول جاردركيف يستطيع الناس أن يركضوا يمينا ويسارا بدون أن يسألوا أنفسهم أبدا منْ هم ، ومن أين جاؤوا؟لقد كان هذا بالنسبة لي هو السر الأكبركيف نستطيع أن نعيش على هذه الأرض ونحن نغمض عيوننا، أو أن نجد الحياة أمرا بديهيا؟;;;;;;;;ويبدو أن الأدب الاسكندافي لا يُضاهى في خياله فهذه الأرض عريقةٌ في إمتاع الكرة الأرضية بالفانتازيافمنها أدهشنا هانز كريستيان أندرسن بحكاياته الخرافية التي عطّرت العالم بأريجٍ عبق من الجمالالرواية مليئة بالألغاز والمفاجئات ، ولا أستطيع أن أذكر كل ما أدهشني بهافستجد كلَّ قصّةٍ أعجب من الأخرى ،من الأسماك الحمراء إلى عصير الليمونادة السحريكل شيءٍ هنا عجيب ،، ومذهل ،، ولا مثيل لهوفي خضم كل هذه الألغاز و مع كلِّ هذا التشويق ، يبهرك جاردر ببناء رواية فلسفية تمتع عقلك وتبهجك وتثير فيك ما تثير من الأفكار"}, {"userName": "ratna", "userReviewDate": "Jul 28, 2008", "userURL": "http://www.goodreads.com/user/show/348670-ratna", "userReview": "\"I don't belong anywhere. I am neither a heart, a diamond, a club, nor a spade. I am neither a King, a Jack, an Eight, nor an Ace. As I am here - I am merely the Joker, and who that is I have had to find out for myself.Every time I toss my head, the jingling bells remind me that I have no family. I have no number - and no trade either. I have gone around observing your activities from the outside.Because of this I have also been able to see things to which you have been blind.Every morning you have gone to work, but you have never been fully awake. It is different for the Joker, because he was put into this world with a flaw: he sees too deeply and too much.\"Truth is a lonely thing"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 01, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Kabalmysteriet, Jostein Gaarderتاریخ نخستین خوانش: یکی از روزهای ماه فوریه سال 2002 میلادیعنوان: راز فال ورق؛ یوستین گوردر؛ مترجم: عباس مخبر؛ تهران، نشر مرکز، 1376، در ده، 386 ص، مصور، 9643053369؛ موضوع: داستانهای نویسندگان نروژی قرن 20 ماز متن کتاب: هر کس از نوشابه­ ی رنگین‌کمان بنوشد، همه­ ی مزه‌ هایی را که پیشتر تجربه کرده، با اعضای بدنش نیز می‌تواند احساس کند. مثلا‌ً شوری و شیرینی را با نوک انگشت­ها احساس می­کند. پایان نقل از کتابداستان راز فال ورق، درباره پسری به نام: هانس توماس است؛ که مادرش سالها پیش، او و همسر خویش را ترک کرده است. برهانی که نویسنده برای کار مادر هانس می‌آورد، این است که او در جست و جوی هویت گمشده ی خویش به سفر رفته است. هانس شخصیت ویژه ای دارد. آنگاه که در مجله ی مانکنها، تصویر مادر خویش را می‌بینند، متوجه می‌شود که او در یونان زندگی می‌کند، پدر خانواده تصمیم می‌گیرد، به جست ‌و جوی همسرش برود. برنده ی بلیط بخت ‌آزمایی می‌شوند، و پول لازم را برای سفر به دست می‌آورند. در مسیر حرکت به سوی یونان یک سلسله حوادث اسرارآمیز برای آنها پیش می‌آید، که تعلیق مناسبی را در داستان به ‌وجود می‌آورد. در طی سفر، با نانوایی آشنا می‌شوند و او یک کتاب کوچک، که با حروف بسیار ریز نوشته شده به هانس می‌دهد. هانس با کمک ذره ‌بینی که کوتوله ‌ای به او داده، شروع به خواندن کتاب می‌کند. از این لحظه به بعد، داستان به دو بخش تقسیم می‌شود. یکی حوادثی که برای هانس و پدرش روی می‌ادهد، و دیگری حوادث و داستانهایی که در کتاب کوچک آورده شده. با رویدادهایی که روی می‌دهد، رفته ‌رفته داستان به قله ی هرم نزدیک می‌شود تا خوانشگر به رمز و رازها، پی ببرد. بسیاری از رمزها در کتاب کوچک گنجانده شده است. مثل نوشابه رنگین‌ کمان که هر کس از آن بنوشد، همه مزه ‌هایی را که پیشتر آزموده، با تمام اعضای بدن خویش میتواند احساس کند. شوری و شیرینی را می‌تواند با نوک انگشتهایش هم احساس کند. ا. شربیانی"}, {"userName": "Raha", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/5932778-raha", "userReview": "این کتاب ، داستان پسری دوازده ساله به نام \"هانس\" را روایت می کند که به همراهی پدرش ، سفری دور و دراز را در جستجوی مادر خود آغاز می کند.در طول این سفر \"هانس\" ذره بین و کتابچه ی کوچک و اسرارآمیزی بدست می آورد که با حروفی بسیار ریز نوشته شده.این کتابچه ی کوچک روایتگر داستانی از ماجراجویی های ملوانی کشتی شکسته ست که پا به جزیره ای جادویی می گذاردتصورم اینه که عمده ی بار فلسفی این کتاب رو داستان کتابچه ی اسرار آمیز به دوش میکشه.این بخش از کتاب در حقیقت روایتی است از راز آفرینش انسان ها توسط خداوند ، با این تفاوت که در این داستان ، انسان ها ، کوتوله هایی هستند که از یک دسته ورق بیرون جسته اند و خداوند ، همان ملوانی است که پس از تحمل سالها تنهایی و بی کسی در باغ عدن ، دست به آفرینش مخلوقاتی می زند که اگرچه قادر به درک درستی از محیط اطراف خود نیستند ، همدمی می شوند برای این خدای تنها و دور افتادهسالها به خوبی و خوشی سپری می شود تا روزی که ژوکر سر و کله اش پیدا می شود و شروع می کند به مطرح کردن سوالاتی که هیچ کدام از کوتوله ها قادر به پاسخگویی به آنها نیستند...سوالاتی از این قبیل که \"ما از کجا آمده ایم؟ به کجا می رویم ؟ و خالق ما چه کسی است؟\" طرح این پرسش ها و دخالت های ژوکر آغازگر دوره ای می شود که به کشته شدن خداوند به دست مخلوقاتش(کوتوله ها) می انجامدژوکر در این داستان نقش فیلسوفی سقراط گونه را بازی می کند که ضمن بی خِرَدی ، خِرَد را جستجو میکند ....او نمادی ست از روشنفکری که تاثیر گذاری فوق العاده ش در تمام طول داستان به خوبی احساس میشه"}, {"userName": "Azadeh sharifi", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/395037-azadeh-sharifi", "userReview": "یک ستاره در وقت اضافه...وسوسه دوباره خواندن بعضی کتاب ها چیزی نیست که از سر من یکی دست بردارد، دنیای سوفی را در عنفوان نوجوانی و موقعی که چندان هم فلسفه دوست نداشتم خواندم و راستش به نظرم آمد خیلی سطحی است و هرکار کرده تا به مخاطبان احتمالا عامش ثابت کند فلسفه چیز خوبی است و اصلا هم سخت نیست این کتاب عجالتا از تصورم از دنیای سوفی یک سر و گردن بالاتر بود اول این که داستان داشت و یک رمان واقعی بود بی کارکرد آموزشی دیگر این که در یک قلمرو حرکت می کرد ... تنها به عطش فلسفیدن و سفر می پرداخت ... و چه قدر موتیوهایش شرقی بودند ، زنی که در جستجوی خودش خانواده را ترک می کند و به یونان می رود ... سفر دور اروپا با ماشین و کشتی ... و فال ورق ... یک دسته ورق و نوشابه رنگین کمان که عجیب به جام الست می ماند...آن که می فهمد همواره بیگانه خواهد ماند و ژوکر بودن چیزی نیست که گوردر خودش بدان رسیده باشد ، مسئله اصلی بقیه ورق ها هستند ، بقیه ورق ها جوری بر خورده اند که هر بازی را خراب می کنند و هر ورقی خودش را ژوکر می داند...کتاب کلوچه ای و سرنوشت ، روح کتاب جبری است هرچند پدر قصه گاه و بیگاه بگوید به سرنوشت اعتقادی ندارد ، و نویسنده سعی کند با سفسطه میان همایندی و سرنوشت فرق بگذاردداستان تو در تو بود و سرنوشت هایی که با 52 سال فاصله به هم می پیوندند و تکرار می شوند ... از دید فلسفی این باید عقب گردی باشد برای نویسنده که آمده به اول قصه ... به شخصیت سقراط و درد فلسفی ... آنچه تمام نظریه پردازان بعدی به نحوی خرابش کرده یا ندیده اش گرفته اند ... هنوز در ذهنم یک فضای خالی بزرگ هست که اسطوره را به فلسفه پیوند نمی زند و راستش علاقه ای هم به پرشدنش ندارم...پ . ن : وقتی لیلی یک کتابی که رویش نوشته رمان فلسفی به آدم هدیه می کند یعنی آدم باید آب دستش است بگذارد زمین و بنشیند بخواندش وگرنه بعید می دانم حالا حالاها سراغش می رفتم و یکی از فواید این بشر همین است که کتاب توصیه شده اش را می آورد می دهد دست آدم ...پ. ن توضیحی: هرگونه ارتباط مفهومی میان گزاره های بالا و 20 شدن مستمر نامبرده پیشاپیش تکذیب می شود..."}, {"userName": "M.rmt", "userReviewDate": "Jul 24, 2016", "userURL": "http://www.goodreads.com/user/show/52692605-m-rmt", "userReview": "کتاب ساده اما در عین حال دلنشین و آموزنده...فقط ای کاش سال ها پیش میخوندمش. با وجود اینکه همه چیز فانی است ژوکر همیشه زنده است و به چشمان ما زل میزند و می پرسد شما کی هستید؟ما از کجا آمده ایم؟'و آنکه می فهمد همواره بیگانه خواهد ماند.'"}, {"userName": "Jean", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "[Why did the baker give it to him? (hide spoiler)]"}, {"userName": "Manju", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/11166121-manju", "userReview": "I suggested a \"translation theme\" to my small group of GR friends for this weekend (which later turned into mystery translation), and this was the book that came to my mind. It was short to read over the weekend, a translation, and has been out under mystery category by GR members. To be honest, I thought it to be a murder mystery with a 12 year old protagonist. But once I started reading I found that I was very wrong. Once I finished reading this book, I told myself not every mystery is about murder, theft or abduction.This is a road trip that Hans with his father from Norway to Greece in search of his mother who left them when he was 4 year old to find herself. During this trip Hans not only discovered about his family curse but also come to know about his grandfather and a secret island of Dwarves. This book is a beautiful tale of story within story and concentrate on father-son relationship. This was surprisingly good. Will definitely going to reread it sometime."}, {"userName": "Casey", "userReviewDate": "Aug 07, 2007", "userURL": "http://www.goodreads.com/user/show/261537-casey", "userReview": "This is my all-time favorite book, and Gaarder is one of my all-time favorite authors. His sophomore effort is the strongest, I feel, for many reasons - complex enough to keep you interested, interesting and whimsical enough to keep it light, and new enough (in his works) that the story within a story (within a story) had yet become cliche.I generally don't believe in destiny, but this book makes me want to believe."}, {"userName": "Amin", "userReviewDate": "Aug 08, 2015", "userURL": "http://www.goodreads.com/user/show/9042258-amin", "userReview": "\" کسی که متوجه شود چیزی را نمی فهمد، روی هم رفته در مسیر درست فهمیدن همه چیزها قرار گرفته است \"به نظرم فیلسوف بودن سخته اما نویسنده بودن از اون هم سخت تره. وقتی این کتاب رو میخوندم داشتم به این فکر می کردم چطور یک فیلسوف میتونه انقدر داستان نویس خوبی باشه. چطور میتونه از ابزاری مثل ادبیات به بهترین شکل برای بیان حرف ها و نظراتش استفاده بکنه و چقدر دنیای ادبیات قدرتمنده.پیش از این دو تا کتاب از گاردر خونده بودم و جفتش رو دوست داشتم. یکی رو بیشتر و یکی رو کمتر. همیشه فکر میکردم سومین اثری که از یک نویسنده میخونم میتونه تثبیت کننده اون به عنوان یک نویسنده خوب یا بد توی ذهنم باشه. گاردر از این آزمایش موفق بیرون اومد. داستان رو من به جرئت یک داستان فانتزی میدونم تا فلسفی. تخیلات نویسنده اونقدر قوی بود که منی که ورق بازی نمیکنم و باهاش آشنایی چندانی ندارم برای هر کدوم از ورق های بازی یک شخصیت قائل شدم. میتونستم جلوی چشمم ببینمشون و مطمئن از این به بعد هر دسته ورق که ببینم یه جور دیگه بهشون نگاه میکنم . مخصوصا به ژوکرش.به نظرم نویسنده خوب تونسته مفاهیم فلسفی مد نظرش رو توی داستان قرار بده. فلسفه برای خیلی ها جذاب نیست و شاید به همین خاطر خیلی ها سراغش نرن اما یک داستان با تم فانتزی و معماگونه برای خیلی ها جذابه و چه خوب که از این ویترین برای عرضه محصولاتمون استفاده کنیم! گاردر به خوبی این کار رو کرده. و به نظرم اگه تونسته باشه یک دقیقه خواننده رو برای پاسخ دادن به پرسش هایی که مطرح میکنه به فکر فرو برده باشه، به هدفش رسیده.داستان بخش های دوست داشتنی زیاد داشت. گاهی داستان جزیره جادو برام جذاب بود و گاهی مکالمه هانس توماس و پدرش. شاید شاید کتاب میتونست اندکی خلاصه تر نوشته میشد؛ هرچند که نمیتونم روی این موضوع با قطعیت مانور بدم. بهترین و قوی ترین عنصر داستان ژوکر بود. بعد از اون تعریف اولیه از ژوکر به نظرم من هم یه نیمچه ژوکر هستم. به نظرم ژوکر ها هم مراتبی دارن. و اگر قرار باشه سقراط رو هم ژوکر بدونیم و منم خودم رو ژوکر بدونم به نظرم به این مراتب بیشتر احساس نیاز میکنیم.در پایان میخوام مثل خود گاردر کمی خیال بازی کنم. \" اما اطمینان دارم که هنوز ژوکری هست که در اطراف و اکناف جهان پرسه می زند. حضور او این اطمینان را ایجاد میکند که جهان هرگز به سکون نخواهد رسید. هر زمان و هر کجا که ممکن باشد، یک لوده کوچک که گوش های بلند خر و زنگوله به خود آویزان کرده است بیرون می پرد. او به چشمان شما زل می زند و می پرسد: شما کی هستید؟ ما از کجا آمده ایم؟\" به نظر من این ژوکر داستان خود گاردر است. همین+داستان اودیپ رو خیلی خوب تعریف کرد+ ترجمه کتاب خیلی خوب بود"}, {"userName": "Maeve", "userReviewDate": "Aug 13, 2007", "userURL": "http://www.goodreads.com/user/show/261259-maeve", "userReview": "You can really read this book at any age and appreciate it on different levels every time. On one level this is a mystical tale about a Norwegian boy and his father driving across Europe to find the boy's mother who left his father several years/months (time isn't exactly linear in this novel).Along the way, the boy is given a tiny little book hidden in a sticky bun and then a magnifying glass with which to read the book. In the book unfolds a fantastical tale about life of an island.Much more entertaining than Sophie's World or Maya, this is essentially a clever children's book which is thought provoking, intelligently written and imaginative"}, {"userName": "Rana Heshmati", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/12427631-rana-heshmati", "userReview": "اول از همه اینکه، حقش حقیقتا بیشتر از 5 ستاره است.دوم اینکه نمیدانید از کی دلم میخواست که این را بخوانم! اما دست و دلم نمیرفت! فکر می کردم خواندنش خیلی طول می کشد! نمیدانستم که از صبح توی سرویس تا شب توی رختخواب می خوانمش و نمی توانم زمین بگذارمش که!دوم راهنمایی بودم فکر کنم...، که آرمینا بهم می گفت رعنا.... بخونش! بخونش که عالیه! اما حالا خوانده امش، بعد از 3 سال! ولی بنظرم حتما دلیلی داشته...همانطور که توی خود کتاب گفته بود. همانطور که اینها تصادف نیست....در طول کتاب به این فکر می کردم که اوه.... یعنی فقط من نیستم که به این چیزها فکر می کنم؟ چقدر خنگ بودم! و واقعا بعدش به احمقی خودم خیلی خندیدم! چونکه بنظرم این موضوع شاید بزرگترین چیز جهان هستی باشد. اینکه بفهمیم ما برای یک چیزی اینجاییم. و خب...مسلما این موضوع ذهن خیلی های دیگر را هم درگیر کرده بوده و خواهد کرد! و خب احمق بوده ام دیگر! نگذارید هی بگویم :))فکر کنم که چیز دیگری هم می خواستم بهش اضافه کنم...، اما الان یادم نمی آید... :(پ.ن : وسط کتاب همش یاد این بودم :روزها فکر من است و همه شب، سخنم/که چرا غافل از احوال دلی خویشتنم (مولوی)این شعر، تیتراژ یک سریال بود خیلی وقت پیش که یادم نمی آید چیست. اما از همان موقع، و با صدای خواننده اش بدجوری جایش را در دلم باز کرده است!پ.ن 2 : ممنونم آرمینک م :}پ.ن 3 : شخصیت ها که گفتن ندارد چقدر عالی بودند :دی :)) و اینکه آقای گوردر چقدر خوب بلد است فلسفه را (این ها اسمشان فلسفه است؟!) وارد داستانش کند :) در هر چهار کتابی (دنیای سوفی، دختر پرتغالی، راز فال ورق و زندگی کوتاه است) که ازش خوانده ام :دی :)"}, {"userName": "Farnoosh Farahbakht", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/35868914-farnoosh-farahbakht", "userReview": "یوستین گوردر در \"راز فال ورق\" ترکیبی جادویی از فلسفه و فانتزی ساخته. این کتاب داستان سفر پدر و پسری به نام \"هانس توماس\" است به زادگاه فلسفه، \"یونان\" برای یافتن مادر خانواده که سال ها پیش آنها را برای یافتن هویت گمشده خود ترک کرده. در طول سفر کتاب عجیبی در مورد سرزمینی که ساکنانش ورق های بازی هستند و ژوکر نقش فیلسوف را در این جامعه بازی می کند به \"هانس توماس\" داده می شود و در طول داستان ماجرای جادویی این کتاب با سرنوشت این خانواده گره می خوردفلسفه بیان شده در \"راز فال ورق\" را شاید بتوان در این شعر از \"خیام\" خلاصه کرددر دایره ای کآمدن و رفتن ماستآن را نه بدایت نه نهایت پیداستکس می نزند دمی در این معنی راستکاین آمدن از کجا و رفتن به کجاستاما در دنیای ورق های ما همیشه \"ژوکرهایی\" مانند سقراط، افلاطون و خیام ...بوده و هستند که در چشمان ما زل می زنند و می پرسند : \"شما کی هستید؟ ما از کجا آمده ایم؟"}, {"userName": "Huda", "userReviewDate": "Mar 02, 2009", "userURL": "http://www.goodreads.com/user/show/731369-huda", "userReview": "هذا الكتاب لايشبه شيئا قرأته. ربما لأنه أول قرائتي عن الفلسفة؟\"رائع أيما روعة، مثير أيما إثارة، وجذاب أيما جذابية\"يأخذك قسرا إلى عالم يتراقص بين الحقيقة والخيالتقرؤه في ساعات صفائكمستخدما عدستك المكبرةأو حتى مصباحك الذي لايزيد طولا عن سبابتكبعد تركك له، ترافقك أحداثه إلى أن تعود -من أجله- إلى ساعة صفاء أخرىأوصي به لكل مفكر حالـم"}, {"userName": "Ahmed Eid", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/36877625-ahmed-eid", "userReview": "الناس على هذا الكوكب يجدون حياتهم عادية جدا ..فلا تستهويهم أسرارها.في عالم جاردر لا تمتلك سوى أن تُغلق الصفحات و تسأل نفسك لماذا و كيف و لما ؟؟؟عمل أدبي فريد جدا فمن بداية الرواية حتي نهايتها لا تتملك نفسك من الفضول و الشغف للمتابعة و الغوص بين السطور ، فتجد نفسك أسيرا بداخل تلك القلعة الكبيرة التساؤلات و الأفكار دائمًا ما تحيط بعوالم جاردر الغريبة أقف مرة أخري أمام تسائلات كبيرة عن فكرة الله و وجود الله و رؤية جيددة للكون  القصة هنا تحكي عن رحلة أب و إبنه للبحث عن الزوجة التي هربت لتجد نفسها و عملت في مجال عرض الأزياء و عندي أول تسائل هنا هل خلاص الكرأة يكمن في قوة جسدها و جمالها ؟؟لكن في النهاية الأم ضحت بكل هذا و عادت لحياتها الأسرية في الرحلة يقابل الإبن قزمًا ليعطيه عدسة و خباز يعطي له فطيرة فيجد بها مفاجأة تحمله إلي قصة غريبة و فريدة جداأبطالها مجموعة من أوراق اللعب القصة في المجمل بسيطة و رائعة لكنها مليئة بالتساؤلات و الظواهر التي يجب أن نتوقف أمامها ......كيف يستطيع الناس أن يركضوا يميناً ويساراً بدون أن يسألوا أنفسهم أبداً منْ هم ، ومن أين جاؤوا؟لقد كان هذا بالنسبة لي هو السر الأكبركيف نستطيع أن نعيش على هذه الأرض ونحن نغمض عيوننا، أو أن نجد الحياة أمراً بديهياً؟في النهاية النجوم لا تهتم بحياتنا علي الأرض حقا نحن كائنات حية جئنا إلي كوكب في مجرة درب التبانة نخلق حياتنا كل يوم نحن الكبار توقفنا عن الإندهاش بينما لو أردت أن تعرف معني الحياة فانظر إلي نظرات طفل يستكشف شيئا للمرة الأولي"}, {"userName": "Skorofido Skorofido", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/50712289-skorofido-skorofido", "userReview": "Ήμουν νιο και γέρασα όταν είχα διαβάσει τον «Κόσμο της Σοφίας» του ιδίου και το είχα λατρέψει γιατί κατάλαβε το μυαλό μου σε μέγεθος μπάμιας και πέντε – δέκα φιλοσοφικά ρεύματα. Μετά από χρόνια, έπεσε στα χέρια μου το έτερον βιβλίο του Νορβηγού συγγραφέα, βιβλίο που κυκλοφόρησε πριν από το παγκόσμιο best seller της Σοφίας αλλά που ωστόσο είχε κερδίσει το βραβείο number one των κριτικών της Νορβηγίας. Έκτοτε το βιβλίο, σκονιζόταν (εντάξει καμιά φορά ξεσκονιζόταν κιόλας) στη βιβλιοθήκη, μέχρι που με ξανάπιασαν οι φιλοσοφικές αναζητήσεις μου και το έπιασα στα χέρια μου.Πρόκειται για ένα road-trip-book με τρία ταξίδια. Το ρεαλιστικόν, το ταξίδι του μικρού Χανς – Τόμας με τον πατέρα του από την παγωμένη Νορβηγία στην Ελλάδα των φιλοσόφων για να βρούνε τη μαμά που τους εγκατέλειψε αμφότερους και δύο φανταστικά ή μήπως όχι ταξίδια άλλων δύο ηρώων σ’ένα νησί με μια πορφυρή γκαζόζα. Τραπουλόχαρτα που την κάνουν με ελαφρά πηδηματάκια από τη φαντασία των ανθρώπων και ζωντανεύουν, απίστευτοι μαθηματικοί υπολογισμοί με πασιέντσες και τον χρόνο που φεύγει ή μένει και κάποιες φιλοσοφικές πινελιές. Ιστορίες – μπάμπουσκες, που η μία ξεπηδάει από την άλλη, η μία κρύβεται στην άλλη, η μία γεννάει την άλλη… με μία λέξη εγκιβωτισμός.Στο προσωπικόν του πράγματος τώρα, η ιδέα σαφώς ήταν πρωτότυπη, το παραμύθι καλοδουλεμένο (δεν το συζητώ καν για όλους αυτούς τους μαθηματικούς υπολογισμόύς!) αλλά εγώ τώρα κάτι έχασα… κάτι δεν κατάλαβα… ή μάλλον πολλά δεν κατάλαβα… η όλη ιστορία μου φάνηκε άκρως απλοϊκή και οι ταξιδιωτικές πινελιές ολίγον από Ιταλία ολίγον από Ελλάδα, έμοιαζαν σαν φτηνά άρθρα ταξιδιωτικού ερασιτεχνικού blog. Λίγο κρασί, λίγο θάλασσα και τ’αγόρι μου… και πολύ τζατζίκι και φέτα… και βάλε και μια χωριάτικη και μια ρετσίνα… (ωχ! Sorry αυτό είναι από άλλο blog). Εάν ήμουν Σκανδιναυή νεαρά που έψαχνα greek lover ή αμερικάνα συνταξιούχα ίσως όλες αυτές οι περιγραφές να μου φαίνονταν μαγικές αλλά ως σκορόφιδον made in Greece παίρναγαν και δεν ακουμπούσαν…Κατά τα άλλα, πολλά απλά φιλοσοφικά τσιτάτα (σαν τον Κοέλιο ένα πράγμα) που ίσως εάν ήμουν εκεί γύρω στα 18 να τα έβρισκα άκρως ενδιαφέροντα, έλα όμως τώρα που το μόνο κοινό που έχω με την νεαρή αυτή ηλικία είναι στο τέλος το 8…Ιδιαίτερη εντύπωση μου έκανε στο goodreads πόσοι Άραβες βαθμολόγησαν με άριστα το βιβλίο…Βαθμολογία: 6/10 (τώρα εγώ κάπου το ‘χασα, ο συγγραφέας το είχε ήδη χαμένο από πριν, τι να σας πω;;;)Υ.Γ. Μόλις είδα πως το βιβλίο είχε πάρει το βραβείο The Norwegian Critics Prize for Best Children's or Youth's Literature [1990]… Τώρα εξηγούνται όλα… Το βιβλίο μια χαρά είναι για εφηβικές ηλικίες… Τι μας το πλασάρανε εμάς ως βιβλίο ενηλίκων;;; Readathon 2017: Ένα βιβλίο που βρίσκεται καιρό στο ράφι σας [29/80]http://skorofido.blogspot.gr/2017/07/..."}, {"userName": "Hussein Dehghani", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/48026950-hussein-dehghani", "userReview": "داستان در مورد سفر پدر و پسری به نام هانس توماس است که از شمال اروپا به یونان می‌روند تا به دنبال همسر (و مادر) خود که چندین سال پیش برای تبدیل شدن به یک مدل هنری زادگاه خود را به شکلی عجیب ترک کرده‌است، بگردند و او را بیابند. هزینه این سفر را پدر طی یک بخت آزمایی برنده شده‌است و مسافرت با اتومبیل فیات شخصی صورت می‌گیرد. در طول سفر هانس توماس با ماجراهای عجیبی رو به رو می‌شود و پی به رازهای عمیقی می‌برد که نه تنها به وی بلکه به سرنوشت همه انسانها مربوط می‌شود. ابتدا مردی ریز جثه و بسیار عجیب به او یک عینک ذره‌بینی می‌دهد و می‌گوید که به آن نیاز خواهد داشت. سپس در یک مهمان‌خانه در روستایی در کوه‌پایه‌های آلپ، پیرمردی نانوا به او کلوچه‌ای می‌دهد که در آن کتابی بسیار کوچک وجود دارد و کتاب یک داستان موازی دیگر در داستان اصلی ایجاد می‌کند. کتاب دوم که کتاب نان شیرمالی نام دارد خاطراتِ شخصی است که کشتی‌اش در دریا شکسته و بعد به ساحل یک جزیره بسیار عجیب با موجوداتی به شکل کارتهای ورق بازی و یک نفر انسان به نام فرود می‌رسد. هانس توماس اندک اندک متوجه می‌شود، در این دنیا چیزهایی شگفت وجود دارد و برایش سوال‌هایی فلسفی دربارهٔ ماهیتِ وجودیِ انسان، هدفِ ما روی این کرهٔ خاک و «از کجا آمده‌ام، آمدنم بهر چه بود» مطرح می‌شود. او سعی می‌کند با ذهنِ کودکانهٔ خود پاسخ این معماها را پیدا کند و هم‌زمان از پدرش هم کمک بگیرد. آنها مراحل مختلفی را در جاده و کشتی پشت سر می‌گذارند و تا در نهایت مادر هانس توماس را که به مدلی برای عکاسی حرفه‌ای تبدیل شده‌است می‌یابند و با هم به محل زندگیشان بر می‌گردند. البته در کنار داستان اصلی، داستان موازی دوم نیز جریان خود را دارد و پسر آنرا از روی همان کتاب نان شیرمالی مطالعه می‌کند. و در پایان این دو داستان موازی به وحدتی ارگانیک می رسند"}, {"userName": "Leila", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/16266948-leila", "userReview": "خیلی داستان زندگی سقراط و فلسفه ش رو شنیده بودم و جملاتی که می گفت:\"من کیستم و از کجا آمده ام و به کجا میروم\" یا \"یک چیز میدانم و آن این است که هیچ نمی دانم\" یا همون عالم مُثُل که سقراط تو فلسفه ش زیاد در موردش صحبت می کنه، ولی واقعا نتونستم به این قشنگی که این کتاب همه این ها رو در قالب یک داستان تخیلی یا شاید از دید بقیه کودکانه گفته شده درک کنم.داستان درمورد پدر و پسری به اسم هانس است که برای پیدا کردن مادرش به یونان (سرزمین فیلسوف ها) سفر میکنند.در راه کتابی به دست هانس میرسه که در مورد شهری هست که کوتوله هایی تو اونجا نقش 52 تا فال ورق رو بازی می کنند و شباهت زیادی به آدم ها دارن از این نظر که نمیدونن کی هستن و به کجا میرن و از کجا اومدن و فقط زندگی میکنند بدون اینکه حیرت و کنجکاوی نسبت به خودشون و دنیا داشته باشن.مثلا اونجا نوشابه هایی است که با خوردنش لحظه ای به هوشیاری و لذت میرسن ولی با زیاد خوردنش مغز و فکرشون از بین میره این همون مثالی هست برای \"دانایی یعنی ندانی که میدانی\"وقتی فکر میکنی یا میدونی که میدونی این باعث میشه دیگه نذاره بیشتر فکر کنی و ذهنت برای همیشه بسته می مونه و مطالب جالب دیگه که با این شهر و داستان هانس بهم ربط دارن... وخلاصه شخصیت جوکر در نقش فیلسوف تو این شهر میاد و بقیه داستان....اینم بگم که داستان اولش خیلی خسته کنندس ولی کم کم نمیشه زمین بزاریش."}, {"userName": "Hamidreza", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/35791861-hamidreza", "userReview": "فکر نکنم کتابی باشه که به همین زودیا از ذهنم بیرون بره .موندم از کجا شروع کنم ؛ از چی بگم ؛ این همه عمق مطلب رو چجوری بگم .اولین کتابی بود که از یاستین گاردر خوندم ؛ و به عنوان اولین اثر فوق العاده خوب بود – باید بازم از این نویسنده بخونم ...فلسفی و فانتزی بود ؛ همیشه دنبال همچین کتابی بودم ؛ فانتزی که هست همینش خیلی خوبه ، ولی مهم تر از اون یه چیز دیگه اس : فلسفی هست ولی در قالب داستان . فلسفه خالص نیست . فلسفه خیلی زیبا و دلنشینه . ولی این چون با فانتزی ترکیب شده بود به یه شاهکار تبدیل شد .نمیتونم بیشتر چیزی بگم چون واقعا وقت نیاز دارم که درکش کنم و مطمئنا وقتی درکش کنم هم به خاطر خطر لوث شدن و لو رفتن داستان نباید چیزی بگم . فقط میتونم بگم که اینو بخونید . حیفه به ولله.+اینهمه تا حالا ورق بازی کردم ؛ مطمئنا از این به بعد جور دیگه ای به ورق ها نگاه میکنم ... مخصوصا به ژوکر"}, {"userName": "Nadi Ghaffari", "userReviewDate": "Jul 13, 2015", "userURL": "http://www.goodreads.com/user/show/27677207-nadi-ghaffari", "userReview": "بد نبود.به نظرم یه جاهایی منطق داستانی نداشت.یه کمی هم به سنم نمیخورد.اما به مفاهیم فلسفی علاقه مندم کرد..."}, {"userName": "PurplyCookie", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/2214498-purplycookie", "userReview": "This novel, which was published in Norway before \"Sophie's World\", is another offbeat, delightful ontology masquerading as an ingeniously constructed fairy tale. It tells the story of the 12-year-old Hans Thomas, who is driving with his father from Norway to Greece in a quest to retrieve his errant mother.I was captivated by the twin storyline of Hans Thomas who left Norway with his philosophical father in search of his mother who had \"went out into the world to find herself\"; and that of Baker Hans, Albert Klages whose mother died when he was a child, Ludwig the German soldier and Frode who found himself stranded on an island with nothing but a pack of cards for company. This is a story-within-a-story in which fantasy and reality, the past and present, are brilliant mixed. Encapsulated is the advice that we should all try to be \"jokers\" in order to appreciate what is in front of us. \"A joker is a little fool who is different from everyone else. He's not a club, diamond, heart, or spade. He's not an eight or a nine, a king or a jack. He is an outsider. He is placed in the same pack as the other cards, but he doesn't belong there. Therefore, he can be removed without anybody missing him.\"Very few books make one want to sit down and re-read them all through again after the first reading, but this is one of them. It is deceptively simple, yet the ideas are so striking that you can't work out why nobody ever pointed them out before. As the story progresses, the themes of the essence of being, of God's role in the world, destiny and the joy of being alive or of the beauty of the world resonate in both stories. \"Our lives are part of a unique adventure. Nevertheless, most of us think that the world is 'normal' and are constantly hunting for something abnormal. But that is just because we don't realise the world is a mystery. As for myself, I felt completely different. I saw the world as an amazing dream. I was hunting for some kind of explanation of how everything fitted together.\"Gaarder, a former philosophy teacher in Norway, concentrates on these aspects of philosophy, using both stories to illustrate his themes and intrigue his reader. At one point -- during their visit to Athens -- I was reminded of a theme utilized by a lot of authors (e.g. Gaiman) to explain the intertwining of religion and the passing of time: \"But in a way they were in the world, as long as people believed in them. People see what they believe - the world didn't grow old or frayed at the edges until people started to doubt.\"Once you've read it you'll wonder why you never read it before. A classic plot, yet such a very new one. Simple yet incredibly complex, yet an intelligent child could understand it. \"It's because the world has become a habit. Nobody would believe in the world if they hadn't spent years getting used to it. We have seen everything so many times before that we take reality for granted.\" A novel of ideas that is coherent and striking and memorable.Book Details: Title The Solitaire MysteryAuthor Jostein GaarderReviewed By Purplycookie"}, {"userName": "Farzane", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/18475818-farzane", "userReview": "داستانی فلسفی با مضمون اصلی اینکه از کجاییم ، که هستیم و به کجا میرویم.داستان اتصال دهنده چند نسل است با یک تاریخچه نوشته شده در کتابی کوچکک که در یک نانوایی به پسربچه داستان ک شخصیتی اصلی ست داده میشود . داستان از دهکده ی ورق ها میگوید و سرنوشت را در قالب فال ورق برای بچه پیش بینی میکند . دنیا را عجایب میداند و ب زمین مثل یک سیاره خاص در کهکشان شیری نگاه میکند ک موجوداتی زنده دارد.گوردر افرادی ک دغدغه های فلسفی دارند را جوکر دنیا م،یداند ک خودشان را با شراب دنیا مست نمیکنند تا همواره از خود بپرسند ما که هستیم و از کجا امده ایم. وظیفه اندیشه او نیز تا ابد بیدار کردن انسان هاست ."}, {"userName": "ليلي", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/22926746", "userReview": "او به چشمان شما زل ميزند و ميپرسد شما كي هستيد؟ ما از كجا آمده ايم؟"}, {"userName": "Narges", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/24104-narges", "userReview": "هیچ کس جهان را باور نمی کرد، اگر سال ها به آن عادت نکرده بودکادوی تولدی بود که واقعا به من چسبید"}, {"userName": "NaaZaaNiN", "userReviewDate": "Aug 03, 2015", "userURL": "http://www.goodreads.com/user/show/45585615-naazaanin", "userReview": "راز فال ورقداستان پدر و پسری بنام هانس توماس است که تصمیم میگیرند برای یافتن گمشده ی خود یعنی مادر خانواده به یونان مهد پرورش فلسفه سفر کنند.در طول سفر کتاب عجیبی ( کتاب کلوچه ای ) بطور تصادفی به دست شخصیت اصلی (هانس توماس) می رسد و شروع به خواندن آن می کند و در واقع داستان کتاب کلوچه ای در دل داستان اصلی شرح داده می شود و این دو داستان به موازات هم پیش می روند . داستان کتاب در مورد سرزمینی است که ساکنانش ورق های بازی هستند و ژوکر نقش فیلسوف را در این جامعه بازی می کند و در طول داستان ماجرای جادویی این کتاب با سرنوشت خانواده هانس توماس گره می خورد .یک کتاب فلسفی که از ورق به عنوان ابزاری برای درک بهتر این موضوع استفاده میکند که تخیل افراد میتواند به واقعیت تبدیل شود و دغدغه های فلسفی انسان ها را در دیالوگهای پدر و پسر و در داستان کتاب کلوچه ای می توان تعقیب کرد. چیزی که من و متحیر کرد نماد ها و المان های داستان است که نویسنده هنرمندانه اونهارو انتخاب کرده و مهم ترین مسئله اینکه خیلی خواننده را در مورد وجود خود انسان و زندگی وهستی به فکر مینداخت و انتقال این پیام که هر چه باشد هستیم و باید از این هستی بهترین استفاده ها را برد... در کل من و حسابی به کتاب های فلسفی علاقمند کرد.جملات زیبا از کتاب ....چگونه مردم می توانند در جهان پرسه بزنند بدون آنکه مدام درباره اینکه کی هستند و از کجا آمده اند از خود سوالاتی بکنند؟-\tخداوند در عرش اعلا نشسته و به مردمی که به او توجه ندارند می‌خندد.-\tاگر خدایی مارا آفریده باشد،پس باید ما را چیزی مصنوعی بداند.ما حرف میزنیم،بحث میکنیم،می جنگیم،یکدیگر را ترک میکنیم و میمیریم.میبینی؟ ما چنان هوشمندیم که بمب های اتمی می‌سازیم و موشک به ماه میفرستیم اما هیچ یک نمیپرسیم از کجا می آییم. به همین دلیل است که خداوند به ما می‌خندد.-\tآنچه مرا مجذوب مي كند، اين است كه همه چيز از يك سلول ساده به وجود مي آيد. چندين ميليون سال قبليك دانه ي كوچك پديدار شد كه به دو قسمت تقسيم شد، و با گذشت زمان، اين دانه ي كوچك به فيل ها، درختان سيب ها،تمشك ها، و اوران اوتان ها تبديل شد.-\tدر اینجا پرسیدم، درباره بدشانس ها چه میگویید؟ تقریبا با فریاد گفت: آنها وجود ندارند! آنها هرگز به دنیا نیامده‌اند.زندگی بخت آزمایی بزرگی است که در آن فقط بلیط های برنده را میتوان دید.-\tبه نظر من كل جهان قصد شده است. خواهي ديد كه پشت هزاران ستاره و كهكشاني كه مشاهده مي كنيم هدفي وجود دارد\". -\tميداني چرا اغلب مردم در اطراف و اكناف جهان پرسه مي زنند، بدون آنكه از بابت چيزهايي كه مي بينند شگفت زده شوند؟\" سرم را به علامت نفي تكان دادم. گفت:\" چون جهان به يك عادت تبديل شده است. هيچ كس جهان را باور نميكرد، اگر سال ها به آن عادت نكرده بود. اين را مي توان در كودكان ديد. آنها چنان تحت تاثير همه ي چيزهايي كه در اطراف خود مي بينند قرار مي گيرند كه نمي توانند چشمان خود را باور كنند. به اين دليل كه به اينجا و آنجا اشاره مي كنند، و درباره ي هرچيزي كه مي بينند سوال مي كنند. -\tكسي كه متوجه شود چيزي را نمي فهمد، روي هم رفته در مسير درست فهميدن همه ي چيزها قرار گرفته است\".-يونانيان قديم بر كتيبه اي در اين معبد نوشته بودند:\" خودت را بشناس\". و كمابيش خطاب به خودش، اضافه كرد:\" اما گفتن اين حرف آسان تر از انجام دادن آن است\".-\"پس شما به خدا اعتقاد داريد؟ \" پدر گفت:\" هر چند شماره تلفني از خودش بر جاي نگذاشته، جهان را باقي گذاشته است. فكر مي كنم كاملا منصفانه است\". -\tاين جهان آن قدر شگفت انگيز است كه آدم نمي داند بخندد يا گريه كند #راز_فال-\tچقدر غم انگيز است كه مردم طوري بار مي آيند كه به چيزي شگفت انگيز چون زندگي عادت مي كنند. -\tيك روز ناگهان، اين واقعيت را كه وجود داريم بديهي فرض مي كنيم - و از آن به بعد، بله، از آن به بعد ديگر تا نزديكي هاي وقتي مي خواهيم دوباره دنيا را ترك كنيم، در اين باره فكر نمي كنيم-\tعشق از همه ي چيزها بزرگتر است. زمان نمي تواند به همان آساني كه خاطرات قديم را بي رنگ مي كند، عشق را بي رنگ كند."}, {"userName": "NaaZaaNiN", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/45585615-naazaanin", "userReview": "راز فال ورقداستان پدر و پسری بنام هانس توماس است که تصمیم میگیرند برای یافتن گمشده ی خود یعنی مادر خانواده به یونان زادگاه فلسفه سفر کنند.در طول سفر کتاب عجیبی ( کتاب کلوچه ای ) بطور تصادفی به دست شخصیت اصلی (هانس توماس) می رسد و شروع به خواندن آن می کند و در واقع داستان کتاب کلوچه ای در دل داستان اصلی شرح داده می شود و این دو داستان به موازات هم پیش می روند . داستان کتاب در مورد سرزمینی است که ساکنانش ورق های بازی هستند و ژوکر نقش فیلسوف را در این جامعه بازی می کند و در طول داستان ماجرای جادویی این کتاب با سرنوشت خانواده هانس توماس گره می خورد .یک کتاب فلسفی که از ورق به عنوان ابزاری برای درک بهتر این موضوع استفاده میکند که تخیل افراد میتواند به واقعیت تبدیل شود و دغدغه های فلسفی انسان ها را در دیالوگهای پدر و پسر و در داستان کتاب کلوچه ای می توان تعقیب کرد. چیزی که من و متحیر کرد نماد ها و المان های داستان است که نویسنده هنرمندانه اونهارو انتخاب کرده و مهم ترین مسئله اینکه خیلی خواننده را در مورد وجود خود انسان و زندگی وهستی به فکر مینداخت و انتقال این پیام که هر چه باشد هستیم و باید از این هستی بهترین استفاده ها را برد... در کل من و حسابی به کتاب های فلسفی علاقمند کرد.جملات زیبا از کتاب ....چگونه مردم می توانند در جهان پرسه بزنند بدون آنکه مدام درباره اینکه کی هستند و از کجا آمده اند از خود سوالاتی بکنند؟- خداوند در عرش اعلا نشسته و به مردمی که به او توجه ندارند می‌خندد.- اگر خدایی مارا آفریده باشد،پس باید ما را چیزی مصنوعی بداند.ما حرف میزنیم،بحث میکنیم،می جنگیم،یکدیگر را ترک میکنیم و میمیریم.میبینی؟ ما چنان هوشمندیم که بمب های اتمی می‌سازیم و موشک به ماه میفرستیم اما هیچ یک نمیپرسیم از کجا می آییم. به همین دلیل است که خداوند به ما می‌خندد.- آنچه مرا مجذوب مي كند، اين است كه همه چيز از يك سلول ساده به وجود مي آيد. چندين ميليون سال قبليك دانه ي كوچك پديدار شد كه به دو قسمت تقسيم شد، و با گذشت زمان، اين دانه ي كوچك به فيل ها، درختان سيب ها،تمشك ها، و اوران اوتان ها تبديل شد.- در اینجا پرسیدم، درباره بدشانس ها چه میگویید؟ تقریبا با فریاد گفت: آنها وجود ندارند! آنها هرگز به دنیا نیامده‌اند.زندگی بخت آزمایی بزرگی است که در آن فقط بلیط های برنده را میتوان دید.- به نظر من كل جهان قصد شده است. خواهي ديد كه پشت هزاران ستاره و كهكشاني كه مشاهده مي كنيم هدفي وجود دارد\".- ميداني چرا اغلب مردم در اطراف و اكناف جهان پرسه مي زنند، بدون آنكه از بابت چيزهايي كه مي بينند شگفت زده شوند؟\" سرم را به علامت نفي تكان دادم. گفت:\" چون جهان به يك عادت تبديل شده است. هيچ كس جهان را باور نميكرد، اگر سال ها به آن عادت نكرده بود. اين را مي توان در كودكان ديد. آنها چنان تحت تاثير همه ي چيزهايي كه در اطراف خود مي بينند قرار مي گيرند كه نمي توانند چشمان خود را باور كنند. به اين دليل كه به اينجا و آنجا اشاره مي كنند، و درباره ي هرچيزي كه مي بينند سوال مي كنند.- كسي كه متوجه شود چيزي را نمي فهمد، روي هم رفته در مسير درست فهميدن همه ي چيزها قرار گرفته است\".-يونانيان قديم بر كتيبه اي در اين معبد نوشته بودند:\" خودت را بشناس\". و كمابيش خطاب به خودش، اضافه كرد:\" اما گفتن اين حرف آسان تر از انجام دادن آن است\".-\"پس شما به خدا اعتقاد داريد؟ \" پدر گفت:\" هر چند شماره تلفني از خودش بر جاي نگذاشته، جهان را باقي گذاشته است. فكر مي كنم كاملا منصفانه است\".- اين جهان آن قدر شگفت انگيز است كه آدم نمي داند بخندد يا گريه كند #راز_فال- چقدر غم انگيز است كه مردم طوري بار مي آيند كه به چيزي شگفت انگيز چون زندگي عادت مي كنند.- يك روز ناگهان، اين واقعيت را كه وجود داريم بديهي فرض مي كنيم - و از آن به بعد، بله، از آن به بعد ديگر تا نزديكي هاي وقتي مي خواهيم دوباره دنيا را ترك كنيم، در اين باره فكر نمي كنيم- عشق از همه ي چيزها بزرگتر است. زمان نمي تواند به همان آساني كه خاطرات قديم را بي رنگ مي كند، عشق را بي رنگ كند"}, {"userName": "Parastoo Ashtian", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/22635681-parastoo-ashtian", "userReview": "آیا هرگز این اتفاق برایت نیفتاده که چیزی نقاشی کنی یا بسازی که درست همانی نباشد که در ذهنت بود؟ بارها سعی می‌کنی به افکارت تجلی ببخشی، هرگز تسلیم نخواهی شد. دلیلش این است که آنچه در ذهن داری بسیار کاملتر از تصاویر و تقلیدهایی است که سعی در پدید آوردنش داری. این موضوع درباره‌ی هر چیزی که در اطرافت می‌بینی صدق می‌کند. ما تصورات فراوانی داریم که به تجربه دقیقتر می‌شود. و هانس توماس حتماً می‌دانی چرا ما چنین تصورانی داریم، دلیلش این است که تمامی تصاویری که ما با خود همراه داریم از جهان مُثُل گرفته شده‌اند. ما در حقیقت به آن جهان تعلق داریم نه این دنیایی که در آن، زمان هر چیز مورد علاقه‌مان را از ما می‌گیرد. روح ما پیش از اینکه در بدنمان جا بگیرد آنجا زندگی می‌کرده و وقتی جسممان زیر بار فشار زمان از میان برود به آنجا باز می‌گردد.از متن کتاب"}, {"userName": "محمدجواد مهدیزاده", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/68379681", "userReview": "اثر هر نویسنده ای تو جهان مولفه هایی داره که بخاطر همون مولفه ها، جالب توجه میشه بین افراد اهل مطالعهقطعا باید قدرت بالای تلفیق خیال و حقیقت و معرفی فلسفه از کنش بین این دو مولفه رو از نکات بارز قلم «یوستاین گاردر» به حساب آورد استاد فلسفه نروژی برای نشون دادن اهمیت تفکر انسان، 52 ورق سالیتر و ژوکر رو از ذهن فرود ملوان وارد دنیای حقیقت می کنه تا به مخاطب القا کنه خیلی از چیزهایی که الان دور و بر خودت داری، نتیجه همون اندیشه هایی هست که توی ذهن خودت به وجود آورده اگرچه برای بیان این موضوع، فانتزی ترین شیوه ممکن رو به کار می بره مفهوم خارق العاده بودن و شگفت انگیز بودن، چیزی هست که گاردر سعی می کنه توی کتاب به صورت یه تناوب بهش بپردازه که مهم ترین نمونه ش ژوکر هست و بعد پدرش و خود هانس توماس، راوی کتاب تکیه مجدد گاردر به یونان باستان بعنوان مهد فلسفه غرب و بخش زیادی از فلسفه جهان و گردش پدر هانس توماس توی معبد، که یه جور مناسک میشه به حساب آوردش، اینجا هم مثل «دنیای سوفی» قابل توجه هست با این تفاوت که این بار راوی خودش پا توی معبد گذاشته و داره از زبون پدرش، تو آخرین ساعات و روزهای باقی مونده به پیدا کردن مادرش، شرحی از تاریخ فلسفه رو متناسب با فهم یه نوجوون می شنوهگریز کوتاهی که یوستاین گاردر به حوادث پایان جنگ جهانی دوم و موضوع سر تراشیدن زن ها و دخترهای همراه یا دوست با نظامی های آلمانی یا خارجی های عضو وافن اس اس زده، جالب توجه بود قصه پایان خوبی داشت اگرچه گم شدن کتاب کلوچه ای تو مسیر برگشت به سمت نروژ رو میشه یه جور تراژدی برای راوی داستان به حساب آورد****پ.ن1: مشغله دانشگاه باعث شد دیرتر کتاب رو تموم کنمپ.ن2: پولی که بابت کتابی از یوستاین گاردر صرف بشه، ارزشش رو داره البته به شرطی که مترجم هم خوب عمل کرده باشه پ.ن3: این کتاب من رو علاقه مند کرد حتما اگه شرایط مالی خوبی داشتم تو آینده، برم هم آتن هم دورف هم آرندال رو از نزدیک ببینمپ.ن4: تا حالا کمتر دیدم کسی که دریانوردی میکنه اهل فلسفه باشه؛ نمونه خوبی رو گاردر تو کتابش مطرح کرد؛ حقا که ژوکر لقب خوبی براش بود!پ.ن5: کتاب بعدی از یوستاین گاردر رو به محض فراهم شدن مجدد شرایط، شروع می کنم"}, {"userName": "Mashael Alamri", "userReviewDate": "May 28, 2008", "userURL": "http://www.goodreads.com/user/show/1071650-mashael-alamri", "userReview": "تسافر ماما انيتا من(النرويج)باحثتاً عن ذاتها بإتجاه بلد الفلاسفة (اليونان) فيقرر زوجها وإبنها الوحيد أن يبدأو رحلة البحث عنها ,تحدث خلال الرحلة كثير من المصادفات العجيبة العدسة المكبرة التي أهدها القزم لهانس توماس والكتاب الصغير الذي وجده هانس في الفطيرة التي أهداها خباز دورف له من هنا تبدأ القصة قصة لُعبة الصبر الكبرى والصغرى , يتعرف هانس توماس على سر الجزيرة العجيبة والإثنان والخمسون قزماً ,رواية تهتم بالفلسفة وسر الوجود كعادته جوستاين غاردر ذو خيال خصب و مهتم بالفلسفة حيث يدمج هذان العنصران ليخرج علينا بمؤلف أقل ما يقال عنه أنه ( خطير )في هذا الكتاب شعرت بأن جوستاين يريد أن يقول لنا بأننا محض خيال أحدهم إذ تجسدنا بشراً خارجين من عقل خارق مبدع ,إستمتعت بالأيام التي قضيتها بصحبتها , كان خيالي فيها محلقاً دوماً"}, {"userName": "Sharyl", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/2475858-sharyl", "userReview": "I may never look at a deck of cards the same way again. The Solitaire Mystery is another imaginative, clever, and thought-provoking philosophical tale by Jostein Gaarder. This time, the protagonist is a 12-year-old boy named Hans Thomas, a bright boy who is quickly exiting childhood and trying to make sense of the world around him. This story does not have too much in common with Sophie's World--it's much more like a fairy tale. I did not expect this, and yet--I enjoyed it very much, and thought it worked very well, in its own way. Eventually, I'd like to read more of Gaarder's novels.Excuse me, may I have your Joker?Good read!"}], "description": "Twelve-year-old Hans Thomas lives alone with his father, a man who likes to give his son lessons about life and has a penchant for philosophy. Hans Thomas' mother left when he was four (to find' herself) and the story begins when father and son set off on a trip to Greece, where she now lives, to try to persuade her to come home. En route, in Switzerland, Hans Thomas is given a magnifying glass by a dwarf at a petrol station, and the next day he finds a tiny book in his bread roll which can only be read with a magnifying glass. How did the book come to be there? Why does the dwarf keep showing up? It is all very perplexing and Hans Thomas has enough to cope with, with the daunting prospect of seeing his mother. Now his journey has turned into an encounter with the unfathomable...or does it all have a logical explanation?", "title": "The Solitaire Mystery", "url": "http://www.goodreads.com/book/show/533052.The_Solitaire_Mystery", "average": 4.16, "cover": "https://images.gr-assets.com/books/1355122857l/533052.jpg", "reviews": 1109, "authors": [{"url": "https://www.goodreads.com/author/show/1388082.Jostein_Gaarder", "name": "Jostein Gaarder"}], "type": ["Fiction", "Philosophy", "Fantasy", "Young Adult", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/533052.The_Solitaire_Mystery", "http://www.goodreads.com/book/show/103700.The_Solitaire_Mystery", "http://www.goodreads.com/book/show/1521944._", "http://www.goodreads.com/book/show/48318.The_Solitaire_Mystery", "http://www.goodreads.com/book/show/926783.The_Solitaire_Mystery", "http://www.goodreads.com/book/show/17840696", "http://www.goodreads.com/book/show/6262421", "http://www.goodreads.com/book/show/3360159", "http://www.goodreads.com/book/show/8502124", "http://www.goodreads.com/book/show/3076390", "http://www.goodreads.com/book/show/10959.Sophie_s_World", "http://www.goodreads.com/book/show/25403.The_Orange_Girl", "http://www.goodreads.com/book/show/25405.Through_a_Glass_Darkly", "http://www.goodreads.com/book/show/58301.The_Christmas_Mystery", "http://www.goodreads.com/book/show/25401.Maya", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}