{"ratings": 9732, "userreviews": [{"userName": "Julie", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/5211606-julie", "userReview": "When I was nine-years-old my only uncle lost control of his car on an icy road, and, after flipping several times, was thrown violently from his vehicle.His mother (my grandmother) received a call that night that no parent ever wants to receive. Her son was in the hospital, was in very serious condition, and could she come soon, please?My grandmother arrived at the hospital to find that her handsome, vibrant, newly-engaged youngest son was paralyzed from the neck down.And through the years I have wondered. . . did she collapse immediately? Did she scream? How long did it take before she fell completely apart, and what was the glue that put her parts back together?I never learned the answers to any of these questions (how could I ever have brought myself to ask?), I only know that, for the next year of her life, she drove over an hour to the hospital each day, to oversee the installation of ventilators, feeding and drainage tubes, and to offer encouragement to her 29-year-old son. Of course, honey, of course it's going to be okay.She met the fiancée out for coffee, where the young woman nervously asked if she could go ahead and break off their engagement for her?She insisted he have the dignity of fresh, proper clothes every day instead of hospital gowns and she often laundered them well into the night, after driving the long commute home.She stayed every day, helped dress her grown son's broken body and held bent straws filled with water to his lips.And, at the year's end. . . she had a son dead from pneumonia and a diagnosis of cervical cancer.This is a true story, and my grandmother (who died 7 years ago) would have been mad as hell at me for telling it to you. She'd have said it was none of your business.And maybe it isn't. But, I could not believe it, I just could not believe it. When I met the protagonist of The Stone Angel, Hagar Currie Shipley, I found myself staring my grandmother right in the face. Hagar IS my grandmother. She's a woman who was broken by tragedy and disappointment. A woman who watched loved ones die tragically and who woke up one day to find herself a prisoner of her own bitterness.Because, you see, when we grandkids started flying in to spend summers with Grandmother, two years after the tragedy. . . we were the recipients of a great hostess, a good cook, and a devoted concierge, but we were also the recipients of an anger and a bitterness that could never be resolved and could never go away.To be completely frank, I thought my grandmother was a real bitch.Just as Marvin and Doris (Hagar's son and daughter-in-law) feel about Hagar. And they are conflicted by familial obligation, but also so very tired of the verbal barbs and the never-ending responsibility of caring for a person who can't ever seem to be kind or thankful.And this author, Margaret Laurence, is a genius, because she takes a real bitch like Hagar. . . and she cleverly juxtaposes her present with her past and the aging mother/mother-in-law with her aging, adult kids, and writes, “How you see a thing—it depends which side of the fence you're on.”And I don't particularly like Hagar or my grandmother any more than I did at the start of this book, but I came to feel that I understood both women better by the end of it. Hagar's unspoken but felt regrets cut me deeply to my core. And it made me realize. . . some people just carry the weight of their broken bones better than others."}, {"userName": "Carol", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/3845138-carol", "userReview": "“Old age ain't no place for sissies.” ― Bette DavisMy mother died 27 years ago. She was in her mid-eighties. Unlike Hagar Currie Shipley, her mind was still sharp but her body was failing her in every possible way. She had diabetes and congestive heart failure; but, she ultimately died of liver disease from a tainted blood transfusion.I thought of my mom so much while reading this wonderful novel. Mother bore her many physical afflictions with grace and also a deep gratitude for her family’s support until the end. Still, like Hagar Shipley, she was petrified of being placed in a nursing home…which never happened. This novel moves back and forth in time, tracing the life of Hagar Shipley, born Hagar Currie in the Canadian prairie town of Manawaka. Hagar is a crotchety 90-year old currently living with her son, Marvin, and daughter-in-law, Doris. As she faces the end of her life, she reflects with some regret upon her relationships with her father, brothers, husband and sons. Although she could be judgmental, stubborn and prideful, her hardscrabble life on the prairie was a gut-wrenching tale at times. I never for once pitied Hagar. But, I came to understand the source of her bitterness by the story's end.When her son and daughter-in-law suggest a move to a nursing home for her well-being (and their convenience) Hagar rebels. I couldn’t help but feel sympathy for her and admiration for her moxie in old age. As ornery as she was, her private thoughts about her daughter-in-law made me laugh out loud.This is a beautifully written and poignant story about the emotional complexities of ageing and losing one’s independence. Highly recommended!"}, {"userName": "Erin", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "And someday I would like to write a novel about an old woman. Old age is something which interests me more and more- the myriad ways people meet it, some pretending it doesn't exist, some terrified by every physical deterioration because that final appointment is something they cannot face.... Margaret Laurence 17 March 1957(letter written by ML to Adele Wiseman) First published in 1964, Canadian author, Margaret Laurence (often confused with Canada's other book writing \"Margaret\") tells the tale of 90 year old Hagar Shipley who in the last days of her life reflects back on a lifetime of memories. Unlike a lot of Canadians, my grade 11 English teacher decided not to read The Stone Angel with us and instead gave old Richler a spin. Since I have never read him after that and it took me years to attempt an Atwood (the other Margaret) novel after reeling from a horrible essay we were forced to read in that class. It's probably a saving grace that I waited until I had witnessed the aging and death of three of my grandparents before experiencing this story. Because yes, as a teen I don't think I would have appreciated the curmudgeonly Hagar. Having witnessed my paternal grandmother's descent into dementia, the determination of my father and his siblings to keep their mother in her own home as long as possible, the long term stay in the hospital and then the nursing home. Well, that experience certainly helps me empathise with Hagar's son, Marvin and daughter in law, Doris. But as a teen,when I still had active paternal grandparents who hadn't yet lost a child( a tragic death which aged them overnight), I don't think I would have quite enjoyed this bleak story very much. All in all, I would certainly recommend to readers, but think I wouldn't really choose it as classroom novel."}, {"userName": "Barbara", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/16367986-barbara", "userReview": "This is one of the best books I have ever read. I don't give 5 stars unless I truly believe that is what it is worth, and Stone Angel is worth the five and more, in my opinion.Hagar Shipley is a character you will never forget; stubborn, ornery, proud, locked in her own version of her world and unwilling to see it any other way until her dying breath.The novel opens with a quote from one of the best poems ever written;Do not go gentle into that good night.Rage, rage against the dying of the light. Hagar has raged through her whole life and does not intend on going out of it softly or quietly.This book can affect you on so many levels that it is hard to categorize. It's about being a women in a very non-feminist world that is still relatable today. It is about being a parent and a child. It is about the mistakes both make. It is about old age and the rage against personal introspection. It is about love and forgiveness. It is about letting go both literally and figuratively.Laurence has created a character who insists on being unforgettable."}, {"userName": "BrokenTune", "userReviewDate": "Nov 06, 2014", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "3.5*The question I have is: Would I have read and enjoyed The Stone Angel if it had not been considered a Canadian classic and if a RL friend of mine did not highly recommend it?Well, I have read it, and I can see why it is considered a classic. There is so much symbolism in this book, you can draw classroom material for years from it. And of course, it is always nice to read a story with a strong female lead - and you hardly get any stronger female leads than Hagar. Tho, of course, one could argue that \"strong\" and \"obnoxious\" are not the same, and that Hagar's pride and stubbornness are more of a weakness than a strength.But was the book enjoyable?I can't say I loved it. For all it's metaphorical word play and stoicism and irony - Hagar was pretty unlikeable, the characters around her were not that likable either, but I did admire the sass and gumption that the characters brought up in dealing with each other.I'll probably give Laurence's other books in this cycle a miss, tho."}, {"userName": "Nicole Yovanoff", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/16542960-nicole-yovanoff", "userReview": "I hated this book. I called it the 'Stoned Angel' because I think it would have been better if I were stoned on drugs at the time. as I told my teacher at the time of reading this book. \"There have been women who have gone through far worse who aren't such b*tches.\" I could not relate to the character. yes, she had a hard life, but its hard to sympathize with her when she is making everyone around her's life just as miserable. Horrible boring read. Yes, its 'a Canadian classic,' but what does that say about Canadian literature?"}, {"userName": "Krista", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "[ marrying Bram and then leaving him or running away to Shadow Point (hide spoiler)]"}, {"userName": "Mmars", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/2243098-mmars", "userReview": "Like fine wine, there is literature that needs an acquired taste to be fully appreciated. This is one of those books. The story is as simple as a red table wine, but the intricacies of the writing set it in a class of its own. This is a story that has been done time and again – an aged and unreliable narrator recalling their life. 90-year-old Hagar claims to never have been happy and dislikes most everyone she’s known in her life. She will not accede to leaving her own home, in which she is lives with her docile son Marvin and his wife Doris who bears the brunt of caring for Hagar, for a care facility and does not recognize how much less independent she has become. She has dementia and struggles with her short term memory but is able to recall and tell her past. She is far from likeable, yet after a short struggle acclimating myself to Laurence’s writing, I became fully engaged in the book.So much is done well here. Laurence has a marvelous sense of word choice that makes all the scenes visual and all the characters knowable. Sentence structure is generally short and her language is usually common. I think in today’s world, Hagar would be what is known as goth. “It was spring that day, a different spring from this one. The poplar bluffs were budded with sticky leaves, and the frogs had come back to the sloughs and sang like choruses of angels with sore throats, and the marsh marigolds were opening like shavings of sun and the brown river where the tadpoles danced and the bloodsuckers lay slimy and low, waiting for the boys’ feet. And I rode in the black-topped buggy beside the man who was now my mare.” “Lottie was podgy as a puffball. She looked as though she’d either burst or bounce if you tapped her. The Dreisers always ran to fat. I didn’t remember her mother very well, who’d died so conveniently young with a bare left hand, but the dressmaker aunt who reared Lottie used to waddle like a goose force-fed for Christmas.”Oh, she is cutting. And even when she feels gratitude or pleasure she is unable to express it to others. One must note that her mother died young and she had little in the way of affectionate role-modeling from her father. She marries one man to escape another, but accepts that as her choice. She bears two sons. She does go off in search of a life of her own, but returns during his final days at a loss to explain why she is really there. In that house of her marriage, she lives on to this final chapter in her life. This chapter in which dementia takes hold. This is a marvelous study of character, one of which may or may not be who she once was, but one who stubbornly hangs on to herself to the very, very end."}, {"userName": "Shane", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/1798222-shane", "userReview": "When you live to be 90, you will end up seeing a lot of life and losing a lot during it. I came to this novel, a former school text in Canada, rather late in life, but I am glad I did, for it paints a picture of this country’s evolution from the late 19th to the mid 20th century from a woman’s perspective, and reveals the frightening aspects of growing old and insignificant.Hagar Shipley is an unforgettable character; feisty, cruel, unrelenting and deathly honest. She loves her wastrel younger son but not her dull older one who looks after her well into his sixties. She deserts her husband, Bram, a not-too-successful farmer 14 years her senior, and only comes back to visit when he is dying. She in turn has had fate deal wicked blows to her: losing her mother at birth, her siblings during childhood; her storekeeper father leaves his estate to the town and not to his only surviving daughter, Hagar. Her biggest loss is that of her younger son, John, a tragedy that “transformed her into stone.” The stone angel is found in the Shipley family graveyard, and is a metaphor for Hagar’s transformation through grief and loss into this unbreakable, unreachable person.The novel alternates between Hagar in her ninetieth year, seeking to escape from being consigned to a nursing home by her older son Marvin and his wife Doris who are running out of energy to care for her, and her random memories of her past. The story lines converge briefly when she is contemplating escape, in the present story, from the house she shares with Marvin and Doris, and in the former story, from Bram. The deterioration of her health and her mind is brilliantly drawn for her narrative starts to have gaps and becomes increasingly unreliable as the novel progresses, until she is finally consigned to a hospital after contracting pneumonia from running away unprotected. Her hospital stay is also well drawn and one gets a vivid picture of hospital wards in the 1950’s— thank God there has been more technological progress today! And it is in hospital that Hagar, the stone angel, makes her way back, by accepting some truths about herself, making amends for her recalcitrance, giving people credit for what they have done, and reaching beyond herself to help others.I can understand why this was a seminal novel in the 1960’s in Canada. The writing is frank and does not pull any punches, even though the prose is poetic where warranted. The book throws the spotlight on a woman’s world, when much of the literature of the day was of the masculine perspective. The subject of aging and the challenges that it presents is thrust into our faces, and with our aging population, this book retains its currency today. What is sad however, is that although we have progressed technologically in the last half century since this novel was written, a woman in Hagar’s position may not be further ahead today as she was then—we still haven’t cracked the code on preserving the dignity of older people as they lose physical and mental capacity, although we have a host of pharmaceutical drugs to keep their hearts beating."}, {"userName": "Rebecca Foster", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "Hagar Shipley has earned the right to be curmudgeonly. Now 90 years old, she has already lived with her son Marvin and his wife Doris for 17 years when they spring a surprise on her: they want to sell the house and move somewhere smaller, and they mean to send her to Silver Threads nursing home. What with a recent fall, gallbladder issues and pesky constipation, the old woman’s health is getting to be more than Doris can handle at home. But don’t expect Hagar to give in without a fight.This is one of those novels where the first-person voice draws you in immediately. “I am rampant with memory,” Hagar says, and as the book proceeds she keeps lapsing back, seemingly involuntarily, into her past. While in a doctor’s waiting room or in the derelict house by the coast where she runs away to escape the threat of the nursing home, she loses the drift of the present and in her growing confusion relives episodes from earlier life.Many of these are melancholy: her mother’s early death and her difficult relationship with her father, an arrogant, self-made shopkeeper (“Both of us were blunt as bludgeons. We hadn’t a scrap of subtlety between us”); her volatile marriage to Bram, a common fellow considered unworthy of her (“Twenty-four years, in all, were scoured away like sand-banks under the spate of our wrangle and bicker”); and the untimely deaths of both a brother and a son.The stone angel of the title is the monument on Hagar’s mother’s grave, but it is also an almost oxymoronic description for our protagonist herself. “The night my son died I was transformed to stone and never wept at all,” she remembers. Hagar is harsh-tongued and bitter, always looking for someone or something to blame. Yet she recognizes these tendencies in herself and sometimes overcomes her stubbornness enough to backtrack and apologize. What wisdom she has is hard won through suffering, but she’s still standing. “She’s a holy terror,” son Marvin describes her later in the novel: another paradox.Originally from 1964, The Stone Angel was reprinted in the UK in September as part of the Apollo Classics series. It’s the first in Laurence’s Manawaka sequence of five novels, set in a fictional town based on her hometown in Manitoba, Canada. It could be argued that this novel paved the way for any number of recent books narrated by or about the elderly and telling of their surprise late-life adventures: everything from Jonas Jonasson’s The Hundred-Year-Old Man Who Climbed Out of the Window and Disappeared to Emma Hooper’s Etta and Otto and Russell and James. I was also reminded of Jane Smiley’s Midwest novels, and wondered if Carol Shields’s The Stone Diaries was possibly intended as an homage.I loved spending time in Hagar’s company, whether she’s marveling at how age has crept up on her—I feel that if I were to walk carefully up to my room, approach the mirror softly, take it by surprise, I would see there again that Hagar with the shining hair, the dark-maned colt off to the training ringtrying to picture life going on without her—Hard to imagine a world and I not in it. Will everything stop when I do? Stupid old baggage, who do you think you are? Hagar. There’s no one like me in this world.or simply describing a spring day—The poplar bluffs had budded with sticky leaves, and the frogs had come back to the sloughs and sang like choruses of angels with sore throats, and the marsh marigolds were opening like shavings of sun on the brown river where the tadpoles danced and the blood-suckers lay slimy and low, waiting for the boys’ feet.It was a delight to experience this classic of Canadian literature.(The Apollo imprint will be publishing the second Manawaka book, A Jest of God, in March.)With thanks to Blake Brooks at Head of Zeus/Apollo for the free copy for review.Originally published with images on my blog, Bookish Beck."}, {"userName": "C.", "userReviewDate": "Mar 01, 2014", "userURL": "http://www.goodreads.com/user/show/10501026-c", "userReview": "Many of us bristle over ‘school textbook’ and ‘award-winner’. If you imagined “The Stone Angel” would make a good show of refinement but isn’t a five-star page-turner: it is! I’m a gothic mystery, paranormal fan; seldom enthusiastic without a ghost. My marvel at this impressively-crafted book is absolute. It became a 2007 film. I didn’t care for it as a pupil. At 14, we find no adventure in hardship nor corporal punishment; though minor. This time, my eye caught stunningly astute, absorbing emotions.The course I followed is that of a well-bred lady marrying a crass widower; angering her Dad. She is no shrinking violet, trapped or bossed around. We enjoy ‘Hagar Currie Shipley’s’ gumption; keeping a situation calm, or snapping back. In the early 1900s, here is a woman not steered by wagging tongues. For several chapters a compelling heroine, exquisite literary mettle, and Manitoba nature drive interest. ‘Manawaka’ is code for ‘Neepawa’, my fiancé’s hometown and we laughed together at ‘Galloping Mountain’. It obviously doubled for ‘Riding Mountain’! A shift occurred by the time Hagar takes her youngest son to a city. Not only do the memoirs reach their peak. The page time of the elderly storyteller outweighs it. The 95 year-old version of our narrator is undeniably riveting.As present day Hagar dominates, sympathy skyrockets. We are outraged her daughter-in-law ‘Doris’, misreads Hagar’s competency so flimsily. We become champions against underestimating the elderly. Then an astonishing, fast-paced adventure takes place, that rises to a fever pitch! This local classic, of which I’ve been proud at arm’s length, became a novel I lapped up in two days. I’m awe-stricken by an author capable of weaving two vividly memorable threads, that culminate in the sharpest understanding. It’s a loss that Margaret killed herself upon a diagnosis of terminal cancer."}, {"userName": "Jubi", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/18933632-jubi", "userReview": "\"Pride was my wilderness and the demon that led me there was fear. I was alone, never anything else, and never free, for I carried my chains within me, and they spread out from me and shackled all I touched.\" ♡"}, {"userName": "Jeanette", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Incredible writing skill! She says more in a colloquial and sometimes brutal (within both its intent and its semantics meaning) phrasing than most authors crowd into an entire chapter. Hagar not going quietly into that good night! What rage against a dying of the light is merely from years, physical condition and experience of a tired and frustrated 90 year old? And what was always there at 5 or 6 or 8 years of age? Margaret Laurence lets you know.What I thought absolutely the most superlative in this whole novel? It was that this author had Hagar always complaining of some mettle in or by \"the other\". And regardless of who \"the other\" was or became, she did exactly that same brand of mettle or worse herself in the very next paragraph. Oftentimes in the very next sentence. She loves exactly what she hates too. But never calls that first by any name, word, condition that would be connected to it either. It was not 5 star in enjoyment after the first 200 pages. I found the last 1/3rd difficult and as I recognize that souring and disaffection and plies to escape among the very closest to me in the over 90 year old range - I held much more Marv & Doris feelings to heart. Tough. A survivor. How she survived and in her era when it was not all that easy- also quite stubbornly independent. Even when that independence harbored immense deficits, selfish and self-serving judgments- it always occurred as planned. It did. No one owned Hagar. She didn't even know herself how much she was always and continually cutting those binds that tie. It's also a fairly perfect window into the context/ worldview of that era and economics too. And how women served a road to their own powers that had any results. Or found, like Hagar, some road blocks signs of barricade which always screamed \"I'm here, I'm here\". There are quotes in this book which have to do with description and sensibility that are 6 star. Most of them are brutally, brutally hurtful, sharp as knives to others. (The one about the yeast smelling in-law comes to mind.) And others that are physical, natural world embedding like few I have ever come across. More toward the poetic levels too than most fiction writers of modern verbosity ever approach, those word choices and predicate pattern! One of them in that last category here for just a taste:\"It was spring that day, a different spring from this one. The poplar bluffs had budded with sticky leaves, and the frogs had come back to the sloughs and sang like choruses of angels with sore throats, and the marsh marigolds were opening like shavings of sun on the brown river where the tadpoles danced and the bloodsuckers lay slimy and low, waiting for the boys' feet. And I rode in the block-topped buggy beside the man who was now my mate.\"Hagar stayed strong (as did many women in this era) by cutting off all of her own mental and emotive sensibilities at the knees. It gave her a feeling of control. And it did- control! And letting her intelligence only go \"so far\" to really learning factual anything for depth. Hagar was mean. Her soul and cognition quite like the \"Stone Angel\" she insisted be righted to its rigid vertical after a abusive topple. All of the disconnects of her own childhood repeated but the stone edifice raised high and visible.It does not at all surprise me that Margaret Laurence committed suicide, choosing her own method of death, when she herself was gravely ill."}, {"userName": "Kathleen", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/48502194-kathleen", "userReview": "Hagar Shipley is a mean, unappreciative, critical old woman, and I loved her.“'It angers me, and will until I die. Not at anyone, just that it happened that way.’”This is the story of Hagar’s current struggles, laced with her past recollections. As they unfold, we discover what has hardened her, and we grieve for the mistakes she makes. It’s a meditative story, one that makes you think about what makes people the way they are, and how hard it is for them to change once they’re made. We’re given haunting insight into the pains and fears of growing old.Laurence writes beautifully. The description of physical and mental decline is so sharp and real, but there’s a strength and dry humor that keeps it from being maudlin. It’s definitely not a happy story, yet I enjoyed every moment in this world.Margaret Laurence was unknown to me until now. I’m so pleased to have found her (thank you Carol!), and will be reading more of her work soon.“I’ve often wondered why one discovers so many things too late. The jokes of God.”"}, {"userName": "Sarah", "userReviewDate": "Jan 28, 2012", "userURL": "http://www.goodreads.com/user/show/6650077-sarah", "userReview": "Hagar Shipley doesn't have much to be proud of in her life. But as she muses, narrates and slips through time, I felt so drawn to her character. I identified with her in some ways that make me want to re-examine some deeply held assumptions in my own life. Margaret Laurence so clearly \"gets\" human nature, what makes people tick and how easily we see faults in others, but not in ourselves. I thought this book was brilliant. I can't believe it was written 4 decades ago... it could have come out this year. I would strongly recommend this book to anyone!"}, {"userName": "Sheila Rocha", "userReviewDate": "Dec 28, 2007", "userURL": "http://www.goodreads.com/user/show/690324-sheila-rocha", "userReview": "A stalwart reflection of the men who shaped her is the resistant spirit of Hagar Shipley. The Stone Angel successfully provides a realistic portrayal of one woman’s life in the prairie towns of western Canada. However, the stone angel of this story was born, I believe, prior to even her own self-recognition. Hagar says, “The night my son died I was transformed to stone…” (243). Throughout her journey, even as she faces imminent death and resists the mortality of her own body, Hagar’s mind conflates the present with the past with obstinacy and cynicism. She is crotchety and spiteful with her son Marvin and her daughter in law, Doris. This is her nature, the same predisposition that has inclined her to flee from her father and marry the brash sometimes vulgar, Bram Shipley. The result of this marriage leads to Hagar’s father disowning her. She appears to care little, and as soon as she discovers that she actually feels superior to Bram, she must also come to terms with her erotic draw to him. The relationship for Hagar is fulfilled only in her pleasure of his “hairy stomach” and thighs. Hagar’s unfulfilled ambitions and her predilections to condescension of others makes her a proud, stubborn and often emotionless human being. On a personal note, having been reared, in part, by a great grandmother who lived in this same period of time, forever hiding her half-breed past and the murder of a wayward son, the character of Hagar hits close to home. For Hagar, as for my great grandmother, and so many of the women of this era, a veil of cool arrogance draped over an eye of constant judgment served as the tools of parental disapproval dished out to their innocent offspring. Hagar denies her children the parental approval she so desired from her father, Mr. Currie. As Currie raised his daughter with a heavy hand, devoid of a father’s tender touch, Hagar challenged, chided and rebelled in her own disparaging approach to the world and the people she must share it with.Over the course of her life’s journey, we realize that Hagar's loneliness and melancholy are, in fact, the result of these same elements of arrogance, detached emotions, obstinacy and ignorance which she uses, intentionally or not, to minimize others in favor of her self-centeredness. Hagar was essentially incapable of loving others, much like the stone angel, but this is a result of her inherited personality and the selected human traits she chose to manage the world she was born into."}, {"userName": "Larry", "userReviewDate": "Jun 17, 2013", "userURL": "http://www.goodreads.com/user/show/2332179-larry", "userReview": "I love discovering an author whose writing I so thoroughly enjoyed. Such is the case after reading The Stone Angel, a beautifully written story about a 90-year old woman looking back on her life as she grudgingly adjusts to her final years.Hagar Shipley is a delightful curmudgeon – witty, cutting, insightful, with a very human blend of both love and resentment for those closest to her. Describing a sister who looked after her ailing mother: “I always felt she had only herself to blame, for she was a flimsy, gutless creature, bland as egg custard, caring with martyred devotion for an ungrateful fox-voiced mother year in and year out.“Living with her son Marvin and daughter-in-law Doris, her love-hate was constantly in play, over time and in any given conversation. Ruing her lack of privacy in their house: “The door to my room has no lock. They say it is because I might get taken ill in the night…So they may enter my room any time they choose. Privacy is a privilege not granted to the aged or the young. Sometimes very young children can look at the old, and a look passes between them, conspiratorial, sly and knowing.”Her observation about the easily befuddled Marvin, who is often caught in the crossfire between his mother and wife: “If there is one thing Marvin hates it is to be alarmed, upset. Calmness is necessary to him…If the world fell down, instead of only me, he would shake his head and blink and say, “let’s see now – this doesn’t look so good.” \"Underneath the cynicism and spitefulness, Hagar knows her negative orientation to life had a price. “This knowing comes upon me so forcefully, so shatteringly, and with such a bitterness as I have never felt before. I must always, always, have wanted that – simply to rejoice. How is it I never could? …Every good joy I might have held, in my man or any child of mine or even the plain light of morning, of walking the earth, all were forced to a standstill by some brake of proper appearances - oh, proper to whom? When did I ever speak the heart’s truth? Pride was my wilderness, and the demon that led me there was fear. I was alone, never anything else and never free…”.While it may sound like a depressing read, it’s actually quite charming, because it is such a well-done character portrayal…of a real character!"}, {"userName": "Kirsty", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "Part of me wishes I had saved The Stone Angel, a classic of Canadian literature, to read when I travel to Toronto in January. On reflection, however, I would have become so immersed within it that I would be loath to put it down. The narrator is Hagar Shipley, an elderly woman who is looking back on her 'quiet life filled with rage'. Laurence's writing is incredibly clever; despite the first person narrative voice of Hagar herself, we become aware very early on that she is having problems with her memory. Everything here has been so well captured, and I was immediately enraptured by this beautifully written and ultimately moving novel."}, {"userName": "Christine Boyer", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/2538232-christine-boyer", "userReview": "Apparently, Margaret Laurence is a long-time, well known author in Canada and this book (written in 1964) is a known literary favorite among Canadians (Robin, correct me if I'm wrong here! Just what I've heard). I can see why!I've read several stories like this - older woman, reflecting on her life - regrets, highlights, etc. In fact, I almost gave it a 4 because it seemed so quick and easy to read and contained nothing necessarily exciting or new. But then I realized that was the beauty of Laurence's prose. Her ability to make Hagar Shipley so REAL and so interesting and so memorable is the true test of great writing.My sister made many comparisons between Hagar and our grandmother - I could certainly see that. But I'd almost say it was a whole generational comparison. They were both of the older generation where men and women didn't \"complain\" and often struggled with expressing themselves and their emotions. The book was a detailed examination of end-of-life experiences, as well. I love that Hagar knew she was old and dying, but stayed so true to her feisty character until the very end. Hagar's loved ones tried to thrust last-minute religion onto her, as many people think that's what someone who is dying wants. Even if they've never been religious! The scenes with her adult grandchildren were so real - and the ultimate question was posed for all of us - who is really going to remember you? Who really knows you? Sounds depressing, but it wasn't. Strong message and my take-away: make the most of the short time you've got here!"}, {"userName": "Jane Air", "userReviewDate": "Dec 05, 2012", "userURL": "http://www.goodreads.com/user/show/15218973-jane-air", "userReview": "I literally dropped my final year of English class because of this book. It was the most dismal, self-congratulatory, spiteful, misandristic, boring piece of crap I've ever tried to read. And no, I never finished it.So guess what book we had to read a couple years later when I wanted to get my last English credit? That's right, The Stone f'n Angel. Strike two.Thank you Margaret Laurence for this piece of Canadiana nobody really wanted."}, {"userName": "Becca", "userReviewDate": "Feb 11, 2011", "userURL": "http://www.goodreads.com/user/show/4418618-becca", "userReview": "This book creates a great conflict within me.On one hand, it is exceptionally well written. At no point does the characterization waver, the premise is good, and writing itself is fantastic. On the other hand, I honestly do not like the main Hagar. I can not stand her. I feel as though she is one of the characters that you either come to love or hate with no in between, and I am not one of her fans. I find her bitter, twisted, mean, and hypocritical. I had a difficult time reading the novel because of this. I could not relate to her, and I could not sympathize with her at all. I constantly felt as though many of her problems were of her own making. I understand how many people love this book. It is very well thought out and written, but my personal enjoyment of the book forces me to rate it low."}, {"userName": "Jennifer (aka EM)", "userReviewDate": "Aug 18, 2008", "userURL": "http://www.goodreads.com/user/show/1393336-jennifer-aka-em", "userReview": "Hagar Shipley is one of the finest characters ever created in all literature, and The Stone Angel one of the best depictions of raging against the dying of the light. King Lear, Hagar Shipley. That's all one needs."}, {"userName": "Wendy &", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/15365459-wendy", "userReview": "This is my favourite book of all time…Not only was she an amazing writer…but imagine writing a book about an old woman!! and it became a Canadian classic!! Apparently she held on to this book for some time after writing it because she didn't think anyone would care to read it…There is so much truth in this novel. Her descriptions of small seemingly insignificant things are so masterfully written that her words paint pictures that enable us to see the beauty in the ordinary..It is so much more than a book about old Hagar Shipley. It's not a sugar- coated story of an lovely old women..Rather, we hear her voice as she grows up in small town Canada and follow it through her lifetime making choices that shape her life and her families.. her life-long habit of pride and the consequences. Written in the 60's..it's truth still reveals the complexities of family and our interdependence."}, {"userName": "Cassy", "userReviewDate": "Jun 13, 2015", "userURL": "http://www.goodreads.com/user/show/9793573-cassy", "userReview": "Maybe I would enjoy this book in 20 years, because it certainly wasn't written for spry 18 year olds. It reminded me of A Complicated Kindness, and not in a good way. Summary: Prairie girl is raised to be proud and have manners and she keeps her stuck up attitude for the rest of her life, spiteful and causing pain to all around her, even herself. At the end of her life, she feels kind of sorry that she wasn't more joyful, then keeps on being cranky until the end. Stupid.This wasn't the kind of miserable that made you wonder at the human nature and perserverance. This was the kind of miserable that made you miserable."}, {"userName": "Terri Jacobson", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/8370501-terri-jacobson", "userReview": "I really enjoyed this book, published in 1964. It's the story of Hagar Shipley, a 90 year-old Canadian woman who survived the Great Depression. She looks back over her life and realizes that her pride and her sense of propriety have deeply influenced her relationships, and in many ways limited them. The book is written with sympathy and humor. I liked the repeated image of the stone angel. The book is well-written and memorable."}, {"userName": "TheDenizen", "userReviewDate": "Sep 23, 2011", "userURL": "http://www.goodreads.com/user/show/6222811-thedenizen", "userReview": "As a Canadian high school student, I was forced to read this unpleasant piece of trash. A crusty old woman bitches about her life and how miserable she is. The end. Fuck you Hagar Shipley...and you too, Margaret Laurence."}, {"userName": "Catherine", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/4708718-catherine", "userReview": "Absolutely wonderful! Will be adding a review later."}, {"userName": "Rachel", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/12857-rachel", "userReview": "If novels were colors Laurence's would be a spectrum of browns, earthy greens and maybe a few touches of lavender."}, {"userName": "Ali", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/804942-ali", "userReview": "The Stone Angel is the first books in Margaret Laurence’s Manawaka novels – though my understanding is that place is the only real link, and that each novel stands alone. I also have A Jest of God the second Manawaka novel sitting on my tbr – and I am now really looking forward to it. Oh I do love discovering a new author.In this beautifully written novel, Margaret Laurence explores the life of one woman, Hagar Shipley, moving back and forth through different periods of her life. As the novel opens we get a snapshot of Hagar’s childhood, as aged ninety Hagar begins to reflect on her past.“Privacy is a privilege not granted to the aged or the young.”Living with her son Marvin and his wife Doris, Hagar is sick, irascible and worried she is about to be shipped off to a care home. Hargar’s voice is wonderfully strong, she has lived a long life, there is a sense that her life has not been happy. She is sharp tongued, a difficult woman, devoid of warmth – she doesn’t give her son or daughter-in-law any credit.“I can’t change what’s happened to me in my life, or make what’s not occurred take place. But I can’t say I like it, or accept it, or believe it’s for the best. I don’t and never shall, not even if I’m damned for it.”Born in the small rural community of Manawaka, during another century, Hagar was the daughter of a successful Scottish store-owner. The apple they say, doesn’t fall far from the tree – and her father Jason Currie was a difficult man, an unforgiving, harsh disciplinarian. There are two brothers, and Aunt Doll – the widow hired to help look after Jason’s motherless children. The surrounding community – like communities everywhere I suppose had its snobberies and pretensions, one of Hagar’s school fellows despised because of the sins of her mother. Hagar marries a man her father least wants her too – Bram Shipley is older, a widower with grown up daughters. Hagar’s father is furious, incapable of forgiving, he never sees Hagar again, never meeting her sons Marvin and John.Initially Hagar had felt very attracted to Bram, yet she barely knew him, and very soon that attraction gives way to a very unhappy marriage. Hagar is embarrassed by her husband; his country ways shame her.Full review: https://heavenali.wordpress.com/2017/..."}, {"userName": "Dianne", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/3222213-dianne", "userReview": "This is my first Margaret Laurence book, a bit of an awkward confession for someone who likes to push Canadian authours on fellow readers. I’m not sure what I was expecting, but it wasn’t this. This is a great story, painful and beautiful and real. I think I have sometimes lumped all Canadian authours into a group called “Too Intellectual for Me” and as a result I have missed out on some great writing that I am only now beginning to enjoy.Hagar Shipley is the main character, an elderly widow living with her son and his wife. Things have come to the point where she needs more care than her Daughter-in-law, Doris, can provide. Hagar is suspicious that they want to put her in a “home” and she is adamant she won’t go. She won’t discuss it with them and becomes defensive and hostile when they try to talk to her.So she hatches a plan. She takes her uncashed old age security cheque, hides it in her purse and when Doris goes out to run errands, Hagar makes her escape. She manages to get the cheque cashed and buy some crackers, cheese and a bus ticket and is on her way to some vague beach destination she recalls from her past, though she sometimes forgets on the way where she is and what she is doing there.She finds a run-down abandoned house where she can hide out – it even has a musty old bed – and she sleeps. When she awakes cold and damp, aching and hungry, she gets angry at Doris for letting her room get so cold and with her son, Marvin, for not paying enough attention to his mother's comfort. Then she remembers where she is and how she came to be there. Soon, she is surprised to find she is not alone in her shelter. While she is taking this one last fling at independence her mind travels back to her days as a young wife and mother and the story of her life, not a happy one, is revealed. And now I’ve said enough; to know the rest of the story, you’ll have to read the book. Margaret Laurence is a good story teller. She had me feeling sorry for Hagar, who was piteous in her fear and weakness, and exasperating in her rudeness and short temper, all at the same time. Hagar is a very human woman, one in whom I think most of us would find something of ourselves, though we may not like to admit it. I look forward to reading more of Laurence’s stories and hope to find their characters just as real and interesting as this one."}], "description": "THE STONE ANGEL is the portrait of a proud, energetic and impulsive woman - Hagar Shipley - as seen through her own eyes at the age of ninety. Her reflections on her past form a vividly-etched chronicle of a girlhood shaped and dominated by her father; of a breakaway marriage to a virile but negligent farmer; of her complex ties to two sons - the conventional Marvin, and the flamboyant, adored John, whom she eventually destroys. Hagar in widowhood is still fiercely responsible, still armored by her steely humor, still isolated by her life-long habits of pride and self-reliance. But she does not remain untouched. In Hagar's ultimate self-confrontation, her final reckoning of the wages of love, Margaret Laurence has created one of contemporary literature's most stunning images of a woman's fate.THE STONE ANGEL is the first part of the acclaimed Manawaka series which also includes A Jest of God, The Fire-Dwellers, A Bird in the House, and The Diviners.", "title": "The Stone Angel\n      \n          (Manawaka Sequence)", "url": "http://www.goodreads.com/book/show/12325907-the-stone-angel", "average": 3.7, "cover": "https://images.gr-assets.com/books/1312782672l/12325907.jpg", "reviews": 394, "authors": [{"url": "https://www.goodreads.com/author/show/42354.Margaret_Laurence", "name": "Margaret Laurence"}], "type": ["Fiction", "Cultural", "Classics", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/12325907-the-stone-angel", "http://www.goodreads.com/book/show/1102322.The_Stone_Angel", "http://www.goodreads.com/book/show/317748.The_Stone_Angel", "http://www.goodreads.com/book/show/74695.The_Stone_Angel", "http://www.goodreads.com/book/show/33187231-the-stone-angel", "http://www.goodreads.com/book/show/9883780-the-stone-angel", "http://www.goodreads.com/book/show/17562041-the-stone-angel", "http://www.goodreads.com/book/show/2777281-the-stone-angel", "http://www.goodreads.com/book/show/102661.The_Diviners", "http://www.goodreads.com/book/show/499533.A_Jest_of_God", "http://www.goodreads.com/book/show/1302582.A_Bird_in_the_House", "http://www.goodreads.com/book/show/1302584.The_Fire_Dwellers", "http://www.goodreads.com/book/show/1440596.This_Side_Jordan", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}