{"ratings": 331, "userreviews": [{"userName": "Quil Carter", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/28956951-quil-carter", "userReview": "Book 3 is done and it's time to move onto my next project. I'd be lying if I said I wasn't jealous of you guys, here I am leaving the Fallocaust world and you're coming back! I won't be long though, in a few months I'll be starting Book 3's companion book! Elish's Garden of Spiders.Enjoy The Suicide King Volume 2, it was a labour of love and I'm so proud of how it came out. I hope I did you guys proud and sorry in advance for the tears."}, {"userName": "Angela", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/13845743-angela", "userReview": "Such a different feel than volume one. I literally just finished so I don't have the words yet. Mostly I'm horrified and completely shocked. And maybe a little dead inside. Ok so it's the next day and I can talk about it now. I don't usually summarize books in reviews or give out many details. I like to just state if I liked it. I think if you are this far in the Fallocaust world, you should expect anything. I think a lot of people forgot that after volume 1. The second half reminds us just exactly what we're dealing with. This was probably done on purpose to fuck us up. When you're done reading the story, remember who these guys are. Remember what they were created for. If you let your guard down and start looking for hearts and flowers to take over then I'm truly sorry for you. I want to continue to be shocked in any direction the story takes me. The best part of these books is never being confident that I can predict where it's going. I'm constantly disappointed in the characters and then pleasantly surprised. This is the craziest series of books I've ever read."}, {"userName": "Bridie-No excuses. No apologies. No Regrets Jones", "userReviewDate": "Dec 31, 2015", "userURL": "http://www.goodreads.com/user/show/7822877-bridie-no-excuses-no-apologies-no-regrets-jones", "userReview": "MAJOR SPOILER WARNING!I have so many emotions going on inside me right now. I feel....ugh.....STUFF! I feel so many things!I think I changed my mind about a billion times whilst reading this. I couldn't decide who to root for. Of course my number one will always be Killian, because frak, I love that boy. He's so sweet and yet so secretly evil at the same time. For me he's the perfect mixture of psycho and kindness. I love that he's Silas's clone. I still need for them to have some kind of altercation, I think it would be epic. They'd basically be showing each other mirror images of what they were and what they could be. Does that make sense? Well, it does to me.Another character I will always love is Reno. I love that fuckhead with all my heart, truly I do. But he spiralled in this story. The deeper he got involved with Silas the more worried I became for him. At many points during this book I thought he was finally turning a corner, but then Silas would ruin it and I'd be disappointed again. I'm still not sure how I feel about Reno/Silas. A twisted part of me really liked it, but the rest of me kept screaming for Reno to get as far away as possible from that mind fuck. It hurt me to read about Reno being hurt, because he's the character I identify with the most I think. I kinda knew that Garrett wasn't gonna be enough for him, although I kept hoping Garrett would surprise me and prove himself.But then, there's always book four.I was sort of annoyed at how quickly Reaver and Killian made up. Although I know they still have major issues. I think Killian deserves better than the way Reaver keeps treating him. I REALLY don't want them to turn into Silas and Sky.Fuck Sky by the way. I've known him for, like, one chapter and I already hate him. He ruined everything. And I'm mad at Silas for letting him ruin everything.One thing I will say is that by now I'm pretty used to all the horrible stuff that happens in these books. BUT, that gang rape scene with Elish.....that disturbed the shit out of me. I didn't like it. At all. It bothered me to my core. I don't think I've ever hated Silas more than in that moment. Not that Elish is completely innocent, or innocent at all. He screwed up big time, and I can't say he's better than Silas, because he isn't. But then the man was raised by Silas, so.......I'm beginning to dislike Nero, although I would like a chance to get to know Ceph better. He seems pretty cool.Gage. That man is mentaltastic, and that's all I'll say. Also, I hate bossy mind controlling worms, don't you?So, in conclusion--Sky, I despise your existence.-Reaver, just burn them all, baby, burn them all and laugh at their ashes.-Reno, run. Just run. Find someone who can truly love. Find someone who you can truly love in return. I ache to see you happy, Reno, I really do.-Killian, you are badass killer bee. Like for real.-Elish, I salute you and your plans for revenge. Even if I think it'll only end badly.-Jade, you lucky bitch, show me your fangs!-Nero, you're on thin ice, my friend.-Jack, get a grip you big baby.-Garrett, FIGHT FOR HIM YOU DUMMY! DO SOMETHING! Or at least kick Silas's ass for accidentally stealing your man!-Silas......you confuse the fuck out of me. But I still want you to find love. Just not with that asshole, Sky. So there.-Luca and Big shot, seriously you two have, like, the most functional relationship in this entire series right now.-Gage.....lose the worms, dude, just lose the worms.BRING ON BOOK FOUR BEFORE I LOSE MY EFFING MIND!"}, {"userName": "Jen", "userReviewDate": "Dec 29, 2015", "userURL": "http://www.goodreads.com/user/show/25529160-jen", "userReview": "During the last four days, I have been horrified, traumatised, heartbroken. There have been parts of this book that I had to walk away from and get myself together. Parts that I really thought I couldn't go on. I have loved every minute. The best installment of this crazy series, so far.My beloved Elish's book is next. This has the potential to break me like no book ever has before. Bring it on. \"The cold chimera is back\""}, {"userName": "Mare SLiTsReaD Reviews", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/7854185-mare-slitsread-reviews", "userReview": "Again. This ride. Is one that is so fucking awesome. Quil's mind is a land field. I wanna go swimming in there. Enjoy people. Enjoy"}, {"userName": "Teresa", "userReviewDate": "Jan 11, 2016", "userURL": "http://www.goodreads.com/user/show/22305503-teresa", "userReview": "Okay. Seriously I hated the ending... only because I have to wait for the next book. So many things going on. The chimeras were being taken down. In this fight they're not the top dogs. The worms are just yucky and creepy. I didn't like Reno in this one. At times he got on my nerves. Really don't like Silas/Reno. Reaver is crazier than ever and Killian is going down with him. So cute that Reaver misses Elish and Elish misses Reaver.Glad to see Jade and Elish have some time together. They are my favorite couple. I find Elish hilarious. He loves Jade but isn't happy.. :D“Don’t thank me. I’m not pleased with it. Loving you has been the single worst mistake of my life. It’s just as enraging as I remember, and I’m making just as many mistakes.”“If you ever put me through what I had to experience when I lost you,” Elish began. “I will kill you myself. Do you understand me, Jade?”“I have killed boyfriends for having the audacity to make me feel those same emotions, for putting me through such turmoil, and I spent over thirty years planning on killing a king who had done the same. And, Cicaro, I swear on my unhealthy devotion to you–” He leaned in, and our eyes locked. “– I will kill you if you dare put me through that again. Do you understand me?”“You ruined my life and yet… I have never loved you more than I do right now.”Jealous Jade is adorable. He can't help himself. Elish is his and no one else can have him. \"Someone else? The thought of Elish having a boyfriend, even if it was decades before I was born, suddenly filled me with jealousy. “I hope he’s dead,” I blurted, before I realized that was an extremely horrible thing to say.I got to say, I knew everything Elish was doing would come back to bite him in the ass but... Just no! My poor Elish and Jade. I HATE Jack. He deserves to suffer more than anyone else. They are so going down. Although all this plotting and manipulating is what got Elish in trouble to begin with. Still they need to pay for touching Elish and Jade.“They’re all fucked aren’t they?” I asked him. The smile widened… and I fucking saw teeth. Elish was grinning. “Yes, Reaver,” Elish said. The creepy grin on his face even giving me the chills. That was one man who should never smile like that. “Every man who touched me and my husband, will see their world burn to cinders.”Woohoo. Get them Elish. I adore Elish and Reaver together. And Killer Bee is awesome. Please don't let Elish and Jade die at end.. or Reaver and Killian. Eveyone else can die but Elish/Jade and Reaver/Killian should be the last four standing. A new family started with just them. Luca/Big Shot too.When's the next one? Can't wait."}, {"userName": "Helle", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/10920780-helle", "userReview": "never trust Elish, he will always play mind games with you and blame others for his failure. Elish see himself as the right King og Skyfall, he want everyone else to suffer/hurt to make them obey his orders and care only for himself.Jade have follow for a long time now and now he really see the true Elish, he have to decide if he want to stay and help Elish or protect the Dekker family. He do not want to be traitor to Reaver and Killian when Mantis decide to use force to make Elish do what he want.Even Killian tell who the one is that make Silas and the other Chimeras suffer for many years, damn stupid to tell how to kill immortals when Elish is there. The fucking worms is everywhere and Gage is under control of them, he almost control all the Chimeras that got infected with them. He still is free and can do a lot of harm for the family. Jack the only one to know that Elish will try to kill every Chimera and control them every way he see fit. Even killing the husbands, lovers, Cicaro and Sengils. He want to destroy Silas and the family, not ever try to be family and a real brother to them. Everytime he want something he destroy the family more. Think about the punishment Ceph got, because Nero did not do what Elish want, or all the lovers Garrett lost because Elish want to see him suffer/hurt only to manipulate him to do his bidding.Elish does not care if Sanguine suffer, because he think Nero and Ceph deserved to be in concrete in many year. He is only friends with them, so he can see his masterplan be a succes, nothing else. Do never trust Elish and do never tell him anything about your feelings and dreams, he will use it against you and kill you if he thinks you will tell to the person he want to kill.One tyrant for another one, Elish is as cruel/evil as the King, no Chimera would be happy with him. I really hope Jack/Sanguine, Killian/Reaver, Nero/Ceph will kill Elish and not King Silas.This is a war against the worms/Gage and Elish, the Chimeras will only be safe when they have killed those two persons and then they can begin heal the damage Elish have done to the family.Please King Silas see the true face of Elish and not the one he want you to see. I really hate Elish and love the other Chimeras.Damn Quil always kill the people I love *sigh*"}, {"userName": "Ellie", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/18461038-ellie", "userReview": "God, what to say?I'll just bullet my thoughts as they come. Ugh, so millennial, I know.. *rolls eyes*.1. The first novel, Fallocaust, was my favorite. I truthfully don't know whether, for me, any of the novels will be able to top the first. The experience was just unique; I hadn't stumbled across anything like it. As such, I may be becoming numb to Fallocaust which has led to a slightly underwhelming experience. 2. Relationship dynamic's (the character's) have changed, which is natural yet, it seemed to come about inorganically. The underlying string to each of the characters which drew me to them and caused me to love them seems to have been misplaced. 3. I am going to continue reading the series and I look forward to the rest.4. I respect Carter tremendously. 5. There is a lot of unnecessary violence; which ultimately serves no purpose. Or perhaps, I am missing something fundamental and that is the point that there isn't one. 6. It was glossed over but the way that immortals are killed makes sense to me. I was waiting for that to be revealed and I feel as though that is entirely plausible. YET, I can't help but wonder whether there would be any repercussions of such a method. 7. Was is just me or did Elish get really sappy? 8. I read a lot of reviews from previous novels in which readers suddenly were endeared towards characters such as Silas or Nero and honestly, no. I would be happy to see that whole family die out. Elish, Jade, Reaver and Killian can all stay. 9. Really wish there was more Reaver and Killian. Can't get enough. 10. This new (yet not) character, boy oh boy. I wish I could enter the book and kill him myself. He's just going to stir the pot. And that's all, off to write a Thought Catalog article.(I jest. I jest.)"}, {"userName": "Rosa Orias", "userReviewDate": "Dec 29, 2015", "userURL": "http://www.goodreads.com/user/show/22322460-rosa-orias", "userReview": "[image error]"}, {"userName": "Mel Sparks", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/16931787-mel-sparks", "userReview": "And here I was thinking this was the last book of this series...........\nAfter several days of reading these excessively long volumes I've come to the realization that the drama is wearing me out. Actually that isn't true, this part in particular was utterly disappointing and my mental subconscious was silently sneering at the nonsense. \nI was already unhappy with Reaver in Part 1 but I didn't expect the dislike to intensify in Part 2. So he was raped. (Ok) So he decided to deal with the issues stemming from that by sleeping with his tormentor - don't....even.....try to figure out the logic there folks. So he overcame his psychosis and in so doing felt like himself again....(Ok). So this newly reborn, stronger, wiser Reaver becomes friends with the enemy and......and.....decides to participate in the raping of his sheltered brother Adler and expects Killian to understand and accept that he did all that because of his love for him.\nIn part 2 the couple is more broken than ever and Reaver insists that Killian should be grateful that he - Reaver- was able to overcome his obstacles. Killian should fall to the floor at his feet and beg forgiveness because Reaver is always right and any concerns Killi Cat might have is just an over dramatization of a jealous, insecure boyfriend. No, Killi has no right to feel betrayed and hurt because, that's being petty. Reaver is a top dog and what he says goes.........and you know what's most upsetting about all this fuckery? THAT'S EXACTLY WHAT HAPPENS. Anytime Killian attempts to assert his opinions they're disregarded and he's treated like a villain for feeling any other way than accepting, which in my opinion is UTTER SHIT.\nWhat little progress Killian's character made in part 1 totally crumbles in the face of Reaver's disdain and frankly I am tired with this shit. It took me thousands of fucking pages to be tired and I......I.......wanna just hit something. Nothing changes for these two. Reaver was a bigger asshole than ever throughout this book and Killian, was his ever tearful, whimpering, blubbering shadow. The relationship has no substance or strengths and I don't empathize with either character.I've realized that in this series there are no good or bad sides. Everyone has their own agenda and will do anything to see it fulfilled. There was a point at which I thought Elish had finally learned from his mistakes, but...nope, I guess his taste of humility was a filler to extend the pages of an entertaining story. In this part we witness Elish's underhanded plans backfire when King Silas (the stupidest King in the history of mankind) is made aware of his deceit. You would think torture of not only him but his beloved maritus (or however it's spelt) would curb his cold, manipulative ways but alas that's asking too much. The sadistic acts targeted against him fuels Elish's desire for revenge and I'm thinking Quil Carter will find a way to extend these manipulations in multiple books with multiple volumes in the future because.......fuck if I know.\nAnother eye roll worthy moment for me was Reno's ability to catch feelings at the slightest provocation. Silas was a bitch to him for most of the series however the two bonded over their grief for Reaver, Sky and Killian. As a result Reno, who's already engaged to Garret Dekker, (a man I thought he'd already loved) convinces himself he's Silas' savior and his one true love.\nThen there were parasitic mind controlling worms for the Dekker family to contend with, and Gage (a born immortal who can kill immortals), and unnecessary POV's and long.......fucking loooooonnggggg stretches of unnecessary chapters and I am tired. I am TIRED people. Maybe one day I'll return to this series because truly it isn't horrible but right now.....I can't deal. Too much is going on and I can't keep up. Sorry.\nThe End.P.S Is Silas evil or not? What is his purpose? With the return of Sky will this fool finally settle down and be happy?.......Hmm, guess we'll see soon enough."}, {"userName": "Paul", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/30278783-paul", "userReview": "5 STARSTotally and utterly AWESOME!!!!! The plot rocks and all the nasty little games and moves on the board are finally laid bare and it's just like the mother of all holy shit's as each plot or insane grasp for pure gluttony of gaining power is so greedy it just keeps getting more shocking. It's like everything is happening at such an exponential rate the book SCREAMS over the finish line. It was so great to see the years worth of manoeuvre's, backstabbing and insane scenario's unfurl within the book because some had been well over 50 years in the planning as some people are immortal, so the pure amount of time Quil must have poured into just constructing the plot and many sub-plots alone is extraordinary. There is just so much demented mind games I ended up reading it in one sitting. All the main players are well established and are all excellent in their own right too so there's no need to discuss them but what happens to them is ARGH!! MY GOD (agnostically SPEAKING) what a cliffhanger."}, {"userName": "Lewis Rees", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/12951993-lewis-rees", "userReview": "Once again, I was lucky enough to be able to beta read this book.Fallocaust has quickly become more than just a book series I love; it's now one of my favorite book series, full stop; one of the first books I suggest when anyone is looking for something new to read.The Suicide King: Volume Two is, perhaps, the most epic book in the series so far, as well as the book which pushes the moral ambiguity of the series into focus.The book picks up directly where volume one left off: The unlikely group of Reaver, Killian, Nero and Ceph are living together in Turris, recuperating from the tragic events of the finale of volume one- events which could have catastrophic repercussions for Reaver and Killian's relationship, as well as the uneasy friendship Reaver has built with Nero, much to Killian's chagrin. The newly reunited Elish and Jade are enjoying a honeymoon period in Shadowtown- a honeymoon which is cut short by a meeting with an old friend that sends them to Melchai and brings them into contact with the proxy worms.And in Skyfall, things are going to hell. Gage has thrown his lot in with the Crimstones, making them more dangerous than ever, and quickly embarks on a campaign of terrorism with nightmarish repercussions not just for the chimera, but quite possibly for humanity itself.One thing that's been constant throughout the series so far, gaining more prominence as it moves forward, is the moral ambiguity. In a lot of ways the heroes are no better than the villains; Elish might be the big good in the sense that he wants to take down a tyrant, but the question of whether he'd be any better has been raised again and again, but this book not only raises more questions as to his leadership, but goes out of its way to show that Silas has the potential, at least, to be a good ruler. It's worth noting that while he was introduced as the big bad we quickly learned that the agenda that brings him into direct conflict with Reaver is relatively small-scale. It's fitting, then, that after being given a chance to move on, and as his relationship with Reno develops, we see hints of a good leader- albeit one who has to deal with a near-apocalyptic crisis without his most trusted adviser on his side.The characters, as a whole, are all beautifully realized, showing more and more depth in light of the horrific events each has gone through over the course of the books, but they each build themselves up from the ashes stronger than ever, even if they have to fight like hell to get there. Gage quickly proves himself to be not just a formidable enemy, but one of the most powerful character's in the entire series, and the threat that both he and the proxies represent brings out the best- and worst- in the character's. Jade, as always, is my favorite character, and he's grown from an impetuous Aladdin figure into not just one of, if not the single most powerful chimeras in the series, but a young man who's learning to stand up for himself, take charge, and do what he thinks is right even when it's not easy, but several character's I originally either didn't like or didn't care about to the same extent as some of the leads have quickly become some of my favorites. Newer character's, like Adler, quickly fit themselves into the constantly expanding roster as naturally as if they'd always been there, with their own hopes and dreams an agendas. Overall, The Suicide King is overall the strongest book in the series so far, partly by virtue of throwing the character's into situations so far outside of anything they've experienced so far. The more submissive of each of the two main pairings, Killian and Jade, have more responsibility than they've ever had thrust on their shoulders, and it falls to them to be the strong ones while their respective partners are learning to be weak- the result is that the couples evolve into more equal couples. The character's continue to grow and grow as the series moves forward. While few of them- if any- can be said to be truly heroic, they're growing to the point where they're increasingly self-sacrificing while- at least not yet- reaching the point of true altruism.This book will make you cry, cringe, and laugh out loud. There's stuff in the book which is right up there with some of the most horrific things that Quil has ever written, as well as being not just the greatest book (Volume one and two) of the series thus far, but one of the best things I've ever read so far.I've said it before that in a just universe, this series would be on the fast track to a HBO show, and I hope that the day comes when that happens."}, {"userName": "Dark_Shadow", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/23637160-dark-shadow", "userReview": "BE AWARE :Full of SPOILERSI was afraid to finish it and I was right. I was stupid enough to hope for hearts and flowers at the ending. Sky being back and changed, to make Silas happy at last, jade immortal, Sanguine happy blah blah. How stupid are you? apparently I'm a huge idiot. Everything is fucked up. Of course Elish is still the deluded, greedy, mean, stupid, upturned nosed freak who is never pleased with anything. He doesn't deserve Jade. He doesn't want to understand that he's at fault too here. it's all his fault. Nooooo, every one else have to suffer and die at his feet. *slow clap*And here lookie we also have meanie Sky now. And mourning Jack that gives no fucks about Sanguine. Sanguine... pffftt no break for him of course. Silas is still naive and blind and now in love too. bad combination buddy. Something is wrong with Killian and I could care less about Reno's crap. I felt sorry for Garrett though. So why have I rated this 5 stars? well it's brilliant that's why. Maybe I shouldn't continue with the series. let's face it. I read the series because of the romance. if it's going to be fucked up from now on maybe I shouldn't suffer. Who am I kidding. of course I'll continue.  I really don't want everything to go to hell. I don't want anyone to die. I hope the series don't get over dramatic. Elish and Sky are getting on my nerves enough already.Edit : Did I really say I'm thinking to stop reading? hahahhahahah good one. This happens once in a lifetime, of course I'll continue with it!!"}, {"userName": "Saywhale", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/70845764-saywhale", "userReview": "SO MANY CONFLICTING FEELINGS.---SPOILERS AHEAD---Most conflicting is Silas. I kinda love him and thinks he deserves it at the same time. But given all he's been through maybe it's enough? I wasn't sure how I felt about Reno/Silas in the beginning but now I feel that regardless of everything they went through, Silas is still waaaay out of the league for Reno. Even if Adler or Sky was out of the picture, I have a feeling that Silas will still reject Reno just like he did Elish in the past, because no one, no one holds the candle to Sky in his eyes and no one will ever be good enough, not even Reno. And let's be realistic here, Reno CANNOT handle Silas. They are not soulmates in the slightest. Rebound maybe. I'm really grateful to Reno for helping Silas heal to the point that he can finally ask for forgiveness from his family, and has made him able to put others above himself. But Reno was deep in the friend zone with this one, and whatever feelings Silas has for him is not enough to be a partner.Okay, now another conflicting feeling is Adler. Man, I love Adler and I completely understand Mantis's protectiveness over him, and his underhanded way of doing it. Anything for his family. Just like how Leo was going to give over Perish so that they will leave his son alone. And if there was a choice, I agree that he shouldn't be given to Silas because that will destroy him, especially since he was sheltered and all. He would be so culture shocked since he already hates chimeras and their bloodthirst, and his beloved Asher is the leader of that will crush him. So, in a way sending him as Sky is more a mercy for him. The options of whether to give Silas Adler as Adler or sky is also questionable. Adler is who Silas needs. Someone kind and pure and already head over heels over him. But if Silas could choose between Adler or Sky, it will always be Sky in a heartbeat. The one he is in love with is the one with the memories of them being together from the beginning. He even mentioned that none of his chimeras could even live up to who Sky was, evilness and all. Quite frankly, I really believe that Sky IS the only one worthy enough to be by his side as equals. And seeing Silas so happy in the end somehow makes it all worthwhile even though this was part of a revenge plot. Silas finally achieved his century old dream.Regardless of what Elish did and his motivations that made a lot of readers hate him, he's completely right. Silas should have moved on years ago and bringing back Sky will not make him happy. His siblings WERE wrong and they were blinded by Elish's betrayal to see that. Don't get me wrong, I also hate his smugness and hated him for being a jerk to Sanguine even after everything he went through. But even if Elish never did anything to sabotage Sky's cloning, Silas was already going in a downward spiral in madness and destroying his children's lives on his own. And the only difference was that they were going to see Sky a lot earlier, and Sky is NOT a good person. Sky will be worse than Silas is with the games and the torture, minus the love for his children. Silas had every intention of turning Adler to Sky, that was the original plan. And Sky was definitely to stay.That being said, Sky being here means all the more danger to the Dekker family. I feel that it's not Elish they should be scared of, and Elish is already a big threat to their wellbeing. Sky was there for five minutes and was already up to no good. He has loyalty to no one and his motivation is seeing others crumble. He has no empathy whatsoever and that was shown completely during his time with Killian. Like Silas said, he is evil itself and ten times worse than who Silas was at his worst. Reaver and Killian will always be my number one fav couple in the series, disfunctional relationship and all. Reaver can be a complete jerk a times and Killian still a manic depressive, and the scenes after their breakup completely broke my heart. But Reaver was usually remorseful after a while, I mean, we have to give him a break because being nice is not easy for him. He's still learning and so is Killian, they're still working on the dynamics of their relationship but it is going in the right direction. As long as their feelings for each other remain strong, they will get through to the other side. And Nero, god damn Nero! I love his protectiveness over his little brothers and their interactions are cute, especially that he is the one to convince Reaver to console Killian. HOWEVER I'm with Killian on this one. Nero is not to be forgiven fully and not to be trusted. He had no rights to be angry at them for killing Kiki after everything he had done to Reaver. And let's face it, if Killian was caught with Reaver at that point, he would've done the same to Killian as he did Reaver and kill the love of Reaver's life in a heartbeat with no remorse whatsoever. So I have no pity for you, Nero. And Kiki's just a cicaro! Not even his husband! The scene with Elish wanting to betray Reaver and Killian hurts me too, especially after Killian personally just saved both of them not long before that. But he gets a pass because of what he just went through. And Luca, oh Luca! Tea on the plane, Cat ears Luca. I just love that he's Killian's brother, that's just perfect. I hope that they can also make Big Shot immortal too so that his brains will heal fully and we can see him entirely as a person. But having a half raver is still pretty cool. But having Luca as an immortal also meant that Luca might turn into Silas too so they have to look out for that. Please can Quil explain the cat ears already? Love Luca to bits though. Sanguine, oh baby Sanguine. I really hope he's okay. He didn't deserve any of it and has been through more than enough. I really hated Elish at that moment but well, no matter what, Silas WAS going to find out eventually and will still overreact in the exact same way regardless if Elish was there or not. Sanguine was being Crow at the time and he outed himself for releasing Gage. The only difference was that Elish was able to witness it. When even Crow was scared, it really broke my heart. And the state Sanguine was when they found him was absolutely horrible. I feel that Jack should blame Silas for that though, not Elish. The scenes where Sanguine goes on as a murdering psychopath with the mask and a chainsaw was pretty damn amazing though! Scary and horrifying, but amazing! Finally, Gage. I don't hate him in the slightest because he's an interesting character. That might change in the future though. But his presence is necessary since we don't have Silas as the main villain anymore. Giving him an accent is great! Since no one after the fallocaust is from anywhere else, Gage is the only living being with a genuine accent, that we know of. The small window where Elish met him personally was a testament of what to come. And the possible unknown born immortal empath in the plaugelands will make for an interesting plot in the future. My bets are that he is Sasha, Silas's old friend since Silas never mentioned him dying. Since Silas has mentioned that there are a number of other born immortals still not accounted for, there is a possibility that they had absorbed some radiation themselves and made a settlement somewhere else. The world is large and that is entirely possible. They probably have got together sometime in the past since it was mentioned that they have a pull to other born immortals. They might even have made a community of inbreds somewhere, also a possible plotline in the future.This series is not for the faint of heart, and was not an easy read. But man oh man do I love it! It's extremely complex and the length allows it to expand the characters and mix intricate plots interwoven with one another. None of it are being resolved easily and each problem only connects to the next. You have wavering thoughts with who to blame, and in the end, everybody is at fault for something or another. I'm only upset because now I have to wait. I have no doubt that the rest of the journey will be mind blowing."}, {"userName": "Marcus Dean", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/10561637-marcus-dean", "userReview": "If I could, I would give this 3.5 stars. I love the world, the story, the mysteries. Sadly I just can't get over my growing dislike of all of the characters. I think what it boils down to is that I can't reconcile all the terrible (and terribly hypocritical) things ever character does. Any moral code a character has gets thrown out of the window one chapter later when they do the exact opposite. Someone will get raped to death and have it be the worst experience of their existence and then they will go and rape everyone they come across. I cant bring myself to care about any of the characters."}, {"userName": "Crude", "userReviewDate": "Feb 14, 2016", "userURL": "http://www.goodreads.com/user/show/23540923-crude", "userReview": "let it be known that Silas has taken the crown from Reaver....he is now the biggest idiot of all time.GOSH I HATE ELISH!!!!!! KILL HIM QUIL! kill him terribly! I wanted him dead from Breaking Jade but nope, he's still here! y??p.s I'm shipping Reno and Silas like crazy. I would have loved to have more Reno POVs that was the only down fall of this book... that and the fact that the cockroach that is elish still breathes and now thanks to idiot Killian he knows how to kill immortals...smh But such are the maddening ways of a Quil Carter tale. Until next time Fallocaust. <3"}, {"userName": "K.S. Morgan", "userReviewDate": "Dec 29, 2015", "userURL": "http://www.goodreads.com/user/show/24702497-k-s-morgan", "userReview": "Spoilers ahead, some minor, some not.I read this book in one gulp, and while it was as emotional, as brilliant and as intense as ever, I must admit I do have some issues with it. I’ll start with them and then move on to those parts that I loved (the majority of them).My issue number one is Reaver. I don’t feel any emotional bond or love between him and Killian any more. I haven’t been feeling it in volume 1 of Suicide King either, but I thought then that it was because of what happened with Nero, that it was affecting Reaver’s mind so severely. But now I can see nothing really changed. I feel like he sank lower that he was in the very first book of Fallocaust – he’s just a chimera without remorse, without much feelings other than blood thirst and endless cruelty. He started to show empathy in TGATD, I felt like he was growing, like Killian was steadily making him better, but all of that is gone now. Yes, Reaver says some beautiful things about Killian several times, and there was a scene that touched me (when he was finally apologizing), but overall, I don’t *feel* his love for that boy any longer. He abuses Killian and treats him horribly, and now he doesn’t even feel remorse because of it. It devastates me, because I love them so much and I always admired their relationship, the unwavering devotion Reaver had for Killian. I sincerely hope he will get it back, because I think he changed for the worse, much worse. I don’t want them together any longer. I just want Killian to leave and find someone who will appreciate him.My second issue is the growing darkness of the series. Sure, it’s Fallocaust, but I find myself getting more and more disturbed. I simply couldn’t read the scenes with Caligula being tortured, and then Elish and Jade… it was horrible, it was despicable. Yes, those moments were *very* strong, very emotional and powerful, crushing in their force, but for me, they were too much. I still feel sick and depressed.I love all of those characters, but mostly I love Elish and Jade, Killian and Reaver, Silas, and I just want them to be happy. They’ve been through so much, they experienced everything, they’ve fallen and now they’ve risen, but it seems their problems still don’t end, because new plots are emerging. I crazily want more of Fallocaust, of course, but I’m just really afraid of what’s going to come next. What was done to Elish and Jade is beyond horrible, but what Elish did is also horrible, so maybe they are even? I don’t like seeing his renewed thirst for revenge, it can ruin everything. The family finally has a chance to be happy! On the other hand, they do deserve punishment. Some chimeras make me mad as hell. Like Jack with his insanity. And Garrett with his weakness. And Nero! He’s angry for Kincade’s death? Well, he should keep in mind what he’s done with Reaver! I don’t think he has any rights to turn on him now, when they’ve become friends.Now, as to the other things. I loved Elish and Jade’s interactions, I’ve never felt so many emotions from reading! That despair, that pain, fear, and overwhelming tenderness, love and adoration Elish was showering Jade with… Yes, that was amazing. I reveled in their love – now that is an emotional connection! But while Elish’s love for Jade is now absolutely visible, he still remains strict and cold at times. He’s a true chimera, a true master. And his book! It was a brilliant idea to make it like Elish is writing it. I feel obsessed with my desire to read it now, even more so than before. Every time Elish fears for Jade is my favorite, because it’s the moments when the real Elish comes out.Reno is so sad, it’s killing me. I hoped he could be happy with Garett, but now I feel like Garett is not the man for him. Reno’s heart is not in it. He loves gentle and soft men, but it seems he’s irrevocably attracted to those who abuse/abused him. I love Reno even more now, though – he’s a very tragic character, and I still hope he will be happy. I love his new love interest... I really, really love him.Gage is terrifying! I really, really don’t want him to keep it up, because he is clearly more dangerous than all in Dekker’s family. And those worms! It’s scary when you realize how the end could come from the smallest things. I’m still shivering.Adler! I don't want to give too much spoilers, but oh God. I never imagined that something like this could happen! It's both amazing and terrifying.This books has many details that I loved, so many unexpected, frightening moments. My heart was racing like crazy, I still can’t get over it.I can’t wait for Elish’s book – I have no doubts it will be incredible."}, {"userName": "Jaimee Ghost", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/11414850-jaimee-ghost", "userReview": "Okay so for this one I couldn't even write a review right away...This book left me in a very interesting place. I'm not sure how I feel right now. And that's not just to say that I read the book and was disturbed for a few moments...I read the book and haven't been in a decent mood since I finished it yesterday. This book is gonna stick with me for the whole week, let me tell you.Okay.This one just really hit me hard. Like really. Some things happen in this book that I never would have expected to happen....and the ending is most INFURIATING because after all that and they finally, FINALLY get a break....Okay. So the worms are fucking creepy as hell but they did add an interesting twist...my question remains of how they got into Gage in the first place if he was locked in concrete all those years?? Also, who the hell else is locked in concrete???????????? I NEED TO KNOW.The babies are super cute. Gus is my favorite. Caligula....I still love him even though he was a bit lost. Like, really lost. Nero.....depending on the future, is no longer in my semi-good graces. I just need the next book basically. There is SOOOOOOOOOOOOOOO MUCHHHHHHHHHHHHHHHHH.But I do know that The Suicide King, both volumes, are my favorite installments of the series. These just keep you on your toes and the plot is so well put together that it's not like the first two where we just go on one crazy adventure after the next. These have JUICE. And all the PLANNING. UGH!Jade......Baby. My baby chimera. I love him so much. Elish....you son of a bitch. Just read it. My chimera ranking:ReaverJadeSanguine (because he is loco coco honey)LucaCaligula (hesitantly...)And then everyone else is equally dead last. Except Elish, who is more than dead last."}, {"userName": "Rebecca Franklin", "userReviewDate": "Dec 31, 2015", "userURL": "http://www.goodreads.com/user/show/31734104-rebecca-franklin", "userReview": "This volume took me back to when I was a kid. When you had a bag of candy and it was so good that you ate fast; but as you got closer to the bottom, you began to eat slower. Knowing that there was no more coming for awhile. This was that bag of candy for me. I was emotional during this book. I laughed. I cried. I shuttered in horror. I was full of anticipation and anxiety. THIS WAS THAT BOOK! All of our boys were back. I felt sorrow for Silas even though I had once hated him. I had a stong dislike for Elish but came to love his strength to endure. I was mad at Killian and then sad for him, but by the end; I had experienced that roller coaster of emotion multiple times IN JUST THIS BOOK! Quil set up my anticipation for his next work and planted the seeds in his garden for me to be lead down whatever path he takes next. I say again that this story is That Book! 5 stars easily and a strong recommendation to start at the beginning. Because sometimes it's a slow easy ride, sometimes it's a hard ride, but in this journey....he won't make it fast and unsatisfied. READ THE BOOKS!!!LOL"}, {"userName": "Cright", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/29042156-cright", "userReview": "Well, it's really fucking hard to collect my thoughts regarding this book/series.The plot continues to be surprising and interesting. The characters are just fucking batshit crazy. At this point there's literally no-one I don't hate anymore. For real. I mean, maybe Killian and Jade. But they have their moments too for sure, and with everything that looks to be happening with Killian, I just don't know what to think anymore. The whole thing is kind of mind-blowing. Everyone is good, and everyone is bad, and... that's real life for ya. This book is about contrast and complexity. And it's a lot of fun to read and follow. I am really hoping that the future books will be able to live up to these and not get way too complicated and drawn-out.I feel like these books are often really emotionally heavy and I wonder how much you can squeeze out of this. Can't wait to find out.Gotta say though, I still hate Elish. Didn't like him for one minute."}, {"userName": "Tracy", "userReviewDate": "Jun 11, 2016", "userURL": "http://www.goodreads.com/user/show/5646740-tracy", "userReview": "i honestly can't think of anything clever or witty to say...this series has literally consumed me for the past two weeksi've read nothing else but these books back to back and i know i feel lost...i've immersed myself in Skyfall and the greywastes and i feel so damn goodtotal book hangover but oh my god these characters are simply amazingjust when you think maybe Elish will turn over a new leaf...bam...he's back to being that cold hearted purple-eyed chimera....just when you think Killian and Reaver couldn't possibly suffer any more...bam...more heartachethe story keeps on going and the only thing we can do is hold on for the rideserious kudos to you Mr Carter for letting us tag along!!"}, {"userName": "Silvia", "userReviewDate": "Feb 06, 2016", "userURL": "http://www.goodreads.com/user/show/25855126-silvia", "userReview": "Wow...just wow!The Suicide King, volumes 1 & 2, was more cerebral than his other books. While I did have the usual strong reactions (lust, anger, amusement, disgust, revenge) they were not constant like in the other books. I found myself thinking of each character's motives and questioning decisions made which is probably the reason why it took me longer than usual to read book 2. I had no idea where this author was leading me and I didn't really care. I just wanted Quil Carter to make \"it\" happen and boy did he ever. I didn't know who to trust as the story progressed but ended up loving my fave Fab Four. I'll let you guess who they are. I am so ready for more, bring me more! 5 stars!"}, {"userName": "Tionne", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/14464678-tionne", "userReview": "*possible spoilers*Jesus fucking Christ Quil!!!! Killian and Reaver can't catch a break huh??? I don't even wanna think about what's gonna happen to them now......I'll probably break down if I do. WHEN WILL NERO FUCKING DIE???!!!!!!!! WHENNNNNNNN????????? Killian should've fucking killed him when he had the chance!!!!! I can't take it anymore! I hate him so much! I hate these fucking chimeras(minus Elish, Jade & Reaver of course) so fucking much!!!! Why are u so evil to us? :'( I honestly have no idea how to rate this. I don't know if I liked it, hated it or loved it. Maybe when I collect my thoughts I'll give it a rating. If not, see you next time Quil!!!"}, {"userName": "Kimmi", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/33036791-kimmi", "userReview": "Now i wait.. Absolute roller coaster but i'm happy for my Elish and Jade and scared out of my mind for my Reaver and Killian.. And a little scared for Silas as well."}, {"userName": "Ellen", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/60421286-ellen", "userReview": "4.5 starsWow. I honestly didn't know where this book was going. I would think one thing, then something completely different would happen. All I know for sure is that this is definitely a world that I would never want to live in - I have a hard enough time looking in from the outside as I'm reading about it.Elish is probably my favorite character (I think he is for a lot of people), but after reading this I'm now thinking that he's more of an evil, arrogant dick. Agh. I'm waffling back and forth on that one. He's always been arrogant, but after what happened in this book it's like he's leveled up his in rage and revenge and almost morphing into a Silas-like character.I'm stuck, now. I have to read all of the books. They are difficult to get through because of the violence, psychological savagery and barbarism... but, wow.... they are all definitely good reads."}, {"userName": "Peche Esse", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/53391995-peche-esse", "userReview": "There is a bit of revisionist history and of people acting out of character and there was too much suspension of disbelief - so this one was just a 3 for me.Spoilers follow:54321Vol 2 folows half the gang @ Melchai dealing with proxy worms, and half the gang at Skyland dealing or not with Gage fallout."}, {"userName": "Cathy", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/71409251-cathy", "userReview": "Dark, gritty, gruesome, psychotic.... I absolutely loved it! Fallocaust is one of the best series I've read and can't wait for next book."}, {"userName": "rizu", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/66370235-rizu", "userReview": "i was livid after finishing this book to meet a cliffhanger bcs i initially thought this is the last of fallocaust series. so when is the next book?"}, {"userName": "Draco", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/13910929-draco", "userReview": "D: that end"}, {"userName": "Vanessa", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/8650252-vanessa", "userReview": "---mostly to remind future me about general feelings from this book---This series is so different from many i've read but its so good! the books that captivate me most are the ones that have characters that for some reason i just cant seem to forget. In this series there are so many characters and they all have their chance to say their own story. You hate one character in one story, but love them in the next. before you know it you're confused as to who's the enemy and who you're rooting for. Jade and Elish are by far my favorite characters. They compliment each other so well, while Jade is an emotional 'empath', Elish is the exact personification of what they call him, the cold chimera (sometimes not with jade though). At the moment im leaning more towards liking Jade more only because Elish broke my heart a bit when he wanted to betray Reaver and Killian (although he had been through a lot and was a bit out of it) thankfully Jade prevented that from happening but nevertheless he can really be an evil character, and he's probably one of the most dangerous ones out there. So its hard, hes really been the one stirring a lot of shit and causing hurt to come upon other characters, but for some reason I still love him. I love how Jade has been through so much, and he's persevered and i think he was the only mortal left, without counting Reno, until this book. so yea after all he's been through no one can hate jade <3 his wildness, his Revers, his powers which i really want to see him use and become even more of a badass. Reaver and Killian have to go next, they both have their times when im like wtf are you doing, Reaver going super mean/ not thinking things through, and Killian as well not thinking things through and being too emotional at times, but i dont see that as a flaw because thats 'their' characters its like what Reaver said to Killian he loves him because he's so different and cares so much. I love how Reaver can be one of the most dangerous chimeras out there yet still show his silly side with his Killi Cat/ Killer Bee <3.With Silas I think everyone starts seeing him as the bad guy but it doesnt take long until you see him as the product of whats happened to him and actually feel really bad for him. He is a bit unhinged at times, but you cant ignore that he has had shit done to him thats caused him to act that way, and Elish wasn't really helping at all (i havent read GOS yet so i still dont understand what Silas did to make him hate him so much, apart from rejecting his marriage proposal). but honestly Silas is just lost and has been lost for a really long time, he's been manipulated by people close to him so much that at this point i just want him to end up happy somehow. And now that Sky is back (who i dont trust at all and im sure will cause many problems in the future) Silas will be hurt even more. Jack is another character i feel bad about, he lost Sanguine when Silas went crazy, and even though he hasnt done anything bad and he's always been loyal to Silas at this point he's the only one that knows, and has always known, what Elish is capable and no one si really paying attention.Sanguine has probably had the suckiest life out of anyone starting when he was really young. And it still affects him in the shape of Crow, so its like he might be a really good stealth chimera but he'll always have this vulnerability to him due to all the things thats happened in his life. For Nero i started liking him so much in Sanguines story, because he really is the big brother to all of them, and even though he messed Reaver up they eventually got to be friends.Reno is now the only mortal there is and still going strong. This greywaster survived a lot and probably will survive much more. Im so sad his relationship with Garret is in a downfall but i hope they fix it somehow. Reno does need and deserve someone to make him their priority.Soooo many characters that one could write about, and they all get to express themselves and be different. There is no character thats similar to another one and thats what i like. Theres such a different variety of personalities from the most innocent, like Luca and Killian (although thats changing) to the most sinister ones like Reaver, and probably Elish too. And the best thing is that, they all keep changing and therefore your opinion of them changes from book to book. You hate Nero in one book, but love him in the next. You can respect Elish in one but then see what an asshole he can be. Silas can be evil king, but then shows the most vulnerability and obliviousness. They are all complex and thats probably my favorite thing of this series."}], "description": "After being broken in almost every way imaginable, it is now time for the phoenixes to emerge from the flames and take flight. The men who had become shadows of their former selves have resolved the issues that had plagued them, and now it is time to take back what they had lost.And it couldn’t have happened soon enough, the mysterious and deadly proxies are only getting smarter… and are prepared to exploit every opportunity that is presented to them.And not even Skyfall will be spared from threats both new and old. Secrets that had been buried deep in King Silas’s past have been exhumed, and soon everyone will find out that the man with the odd-coloured eyes isn’t who he appears to be, unbeknownst to the chimeras… and the man himself. The fractured family must put their differences aside and band together. But how can they fight an enemy they know nothing about? And with almost every power figure in Skyfall either missing or hiding to protect the ones they love. There is no denying it, now is the time for the Dekker family to unite and become the unstoppable unit they were engineered to be.But even if they do learn how to work together… it might already be too late.", "title": "The Suicide King Volume 2\n      \n          (Fallocaust #3.5)", "url": "https://www.goodreads.com/book/show/28388846-the-suicide-king-volume-2", "average": 4.6, "cover": "https://images.gr-assets.com/books/1451453799l/28388846.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/7855857.Quil_Carter", "name": "Quil Carter"}], "type": ["Romance", "Dark", "Horror", "Science Fiction", "Sociology"], "outlinks": ["http://www.goodreads.com/book/show/28388846-the-suicide-king-volume-2", "http://www.goodreads.com/book/show/20823031-fallocaust", "http://www.goodreads.com/book/show/21792839-breaking-jade", "http://www.goodreads.com/book/show/23110713-the-ghost-and-the-darkness-volume-1", "http://www.goodreads.com/book/show/23263664-the-ghost-and-the-darkness-volume-2", "http://www.goodreads.com/book/show/27814326-the-suicide-king-volume-1", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}