{"ratings": 319534, "userreviews": [{"userName": "Grace Tjan", "userReviewDate": "May 22, 2011", "userURL": "http://www.goodreads.com/user/show/1889855-grace-tjan", "userReview": "What I learned from this book (in no particular order): 1.\tJews are stubborn.2.\tBeing a Jew in Princeton sucks.3.\tBeing impotent sucks, especially if you are in love with a beautiful woman.4.\tA beautiful woman is built with curves like the hull of a racing boat. Women make swell friends.5.\tIf you suffer from domestic abuse, the best way to work it out is by going through as many men as possible in the shortest time, and then discard them like wet tissues once you’re done --- if you happen to be pretty enough to attract scores of them, that is.6.\tThe best way to work out existential angst is to drink your way through France and Spain.7.\tThe Left Bank sucks. Being an expat sucks.8.\tSpain sucks, except for the bullfighting. Bullfights are swell.9.\tNobody ever lives their life all the way up except bullfighters. Bulls have no balls.10.\tPeople who run with the bulls are suckers.Other Random ObservationsNo. of times the word “swell” is used: 13No. of alcohol units consumed by the protagonist: Dunno. Too tight to count. Hic.Hemingway might have perfectly captured the Lost Generation’s times, but he also succeeded in inducing a profound ennui in me, especially during the long stretches in which the characters (none who is terribly interesting to begin with) do nothing except drink (“I’m a little tight you know. Amazing, isn’t it? Did you see my nose?”) and flirt with each other. These passages are tediously repetitive, and the effect is like being trapped in a Left Bank café with a bunch of casual acquaintances who insist on regaling you with boring anecdotes from their boozy Spain road trip. After a while, your eyes start to glaze and your attention wanders: you begin to take in the Belle Epogue interior, the cute waiter, the way the afternoon sun casts interesting patterns on the white tablecloth --- anything that is more interesting than the dull main narrative. I just didn’t care for any of them, and that Brett woman is a biatch. Why is everyone so desperately in love with her? They told me that her former husband slept with a gun under his pillow, but who is she really? And I wish that everyone would stop whining and being glib for a while so that they can tell me more about that wonderful Basque country. But no, they always return to these tedious, unaffecting love triangles.You guys are the Lost Generation indeed."}, {"userName": "Stephanie *Very Stable Genius*", "userReviewDate": "Apr 19, 2011", "userURL": "http://www.goodreads.com/user/show/1085121-stephanie-very-stable-genius", "userReview": "I was sitting on the patio of a bar in Key West Florida. It was August, it was hot. The bar was on the beach where there was lots of sand and water. In the water I saw dolphins and waves. The dolphins jumped and the waves waved.My glass was empty. The waiter walked up to my table. “More absinthe miss?” He asked. “No, I better not. *burp*” I put my hand over my glass “I read somewhere that it can cause hallucinations and nightmares. Just some ice water please.” I said. He put and empty glass in front of me, tipped his picture of water over my glass until it was full, at that time he stopped pouring. A man I did not know walked up to my table and said to the waiter “No one in Key West is to stop drinking alcohol while they are conscious, you know the rules Manuel! Don’t make me repeat myself; did you hear me? Don’t make me repeat myself, it’s annoying.” Manuel rolled his eyes.“I’ll drink to that”. I said and held up my glass of ice water to the stranger, then put it to my lips and drank. It was cold. I set it back down on the table. “I just finished a book where everyone repeated themselves……drove me to drink!”“Sorry Mr. Hemingway” said Manuel “she said she wanted ice water, so that’s what I gave her”. A cat ran by, it was fast. “Meow” it said. It was orange. “But you know the rules Manuel, you know the rules.” Repeated Mr. Hemingway “I know the rules Mr. Hemingway, how could I not? You tend to repeat yourself constantly, it must be all the absinthe…..” muttered Manuel. “What did you say Manuel?” Asked Mr. Hemingway “Nothing” said Manuel. “Bring the lady some Champagne right away!” said Mr. Hemingway. Manuel walked away towards the kitchen.“Who are you?” I asked the man I did not know. “Hemingway, you wouldn't happen to be related to the writer would you? His book The Sun Also Rises was the book I was just referring to; I don’t remember ever being quite so bored. On the bright side, I think it did wonders for my blood pressure.” I said.Dressed in worn khaki shorts and a Hawaiian shirt with one too many colors, he stood there at my table and squinted at me, sweat rolling down the sides of his face and into his gray beard. It was hot. He set his drink down on the table, hard, and pulled out a chair and sat down. “May I sit?” he asked as he put his dirty bare feet up on the table and tipped the chair back. “Sure, you’re already in the chair. Besides I don’t think it will be long before you fall on your ass.” I said, I drank some water, it was cold. “Language! I’m Ernest Hemingway the guy who wrote that boring book” he put his feet on the ground and the chair dropped down with a bang. He put his right hand out to shake mine. I stared at it for a while then took it. “Stephanie. Hey, I don’t want to come across as insensitive but aren't you dead?” I asked “Really? I don’t feel dead….at least I don’t think I am.” Said not dead Ernest “Damn! Absinthe lives up to it's reputation.\" I said and smacked the left side of my head with my left hand. My head was hard. “Manuel!! Where’s that champagne?\" I shouted in panic. “So” Ernest picked up his drink and drank the whole thing in one gulp. “I am one the greatest American writers, if not the greatest, everybody says so. And you…..” he paused and pointed his finger at me using the same hand that still held the glass, the melting ice clinked “you didn't like the Sun Also Rises?” he asked and set his glass down. “I know, I heard the same thing, that you were one of the greatest American writers, so imagine my surprise when I didn't love it like the rest of the human race. In fact, I really didn't like it AT ALL! Please don’t hurt me.”Manuel walked back to the table caring the bottle of Champagne and two glasses. He sat the glasses in front of us and went about the task of opening the bottle. “Thank god your back Manuel, I think I’m hallucinating. I hope champagne helps things normalize.” I said, the bottle said “pop”. “It won’t help because you are not hallucinating.” He said and poured the Champagne, he turned and walked off. I picked up the glass and drank. It was bubbly and cold.“What else didn't you like about my book?” Asked Ernest “I’m really not comfortable telling you to your face, but, alright” I said “I found all the characters to be aimless, unlikable, drunkards that didn't have any idea what to with their lives but travel about the world constantly drunk….which doesn't sound all that bad on the surface, but it was so not interesting.” I said “They were so excruciatingly boring that I couldn't even care enough about them to remember who was who.” I said “It felt like it would never end, but when it did end the only thing that I liked about it was the fact that it was finally over. No big payoff to make the boring book worth my time.” I sighed and finished off my Champagne, I poured myself and Ernest another glass.“Wow. Sorry you hated it. I suppose you can’t please everyone.” He said. “I’ll buy you dinner to repay you for putting you through that”. “That’s not necessary, but I could eat. I must bathe first.” I said. “Well sure, it is hot after all.” He said “Yes, I must bathe you understand? One cannot dine without bathing first, so you will have to wait until I bathe.”“I must bathe. I must bathe. I. must. Bathe.” I said.“Now you’re just making fun of me.” he said.“Yup……I will make you suffer the way you made me suffer.” I smiled. “Great. I look forward to it.” Said not dead Ernest. We rose to our feet, Ernest took my arm, we steadied ourselves and stumbled off into the sunset.Also reviewed on shelfinflicted"}, {"userName": "Matt", "userReviewDate": "Aug 22, 2008", "userURL": "http://www.goodreads.com/user/show/1232712-matt", "userReview": "Oh, to have been Ernest Hemingway. Except for the whole shotgun thing. He was a man, back when that meant something. Whatever that means. He had it all: a haunted past; functional alcoholism; a way with words; a way with women; and one hell of a beard. I mean, this was the guy who could measure F. Scott Fitzgerald's penis without anyone batting an eye. He was just that cool. I love Hemingway. You might have guessed that, but let's make it clear off the bat. For Whom the Bell Tolls is in my top five all-time fave books (there's nothing better than a literary novel about blowing up a bridge). The Old Man and the Sea is a fever dream. A Farewell Arms is one of the most exquisitively depressing things I've ever read. Despite my high expectations, The Sun Also Rises does not \"rise\" (get it?) to the level of those books. Or maybe I'm an idiot. It's possible. This book is supposedly one of his masterpieces - if not his magnum opus. I thought it was - gulp - kinda boring. Generally, I attempt to avoid using the word \"boring\" in a review. It's a broad, vague, and diluted descriptor; a subjective one-off that doesn't tell you anything. Its use is better suited for a bitter 10th grader's five-paragraph theme, turned in on the last day of school after that tenth grader skimmed twenty pages, read the Cliffs Notes version, and stayed up all night typing with two fingers. I try to hold my Goodreads reviews to a slightly higher standard (the standard of an 11th grader who is taking summer school classes to get a jump on senior year). Really, though, that was my impression: boring. Of course, I didn't read this while lapping sangria in Madrid, which I've heard will heighten this novel's overall effect. The Sun Also Rises tells the story of Jake Barnes, an ex-patriate living in Paris. He was wounded in World War I and is now impotent. He is in love with Ashley, who is a... What did they call sluts in the early 20th Century? Because that's sort of what she is, though she has a tender place in her heart for Jake, to whom she keeps returning. Jake is a journalist, apparently haunted by the war, and he spends his time drinking in Paris. There's also a guy named Robert Cohn, a former boxer, who's also in love with Ashley. Bill and Mike also hang around; Mike was originally in a relationship with Ashley, before he lost her to Cohn, who in turn loses her to a Spanish bullfighter. The plot, as it is, involves a bunch of drinking in Paris. Jake drinks a lot, stumbles home, then drinks some more before falling asleep. (The drinking and stumbling home reminds me of my own life, which is worth at least one star). Jake eventually takes the train to Spain to do some fishing. Hemingway describes the scene in excruciating detail and you really get a feel for the place:Then the road came over the crest, flattened out, and went into a forest. It was a forest of cork oaks, and the sun came through the trees in patches, and there were cattle grazing back in the trees. We went through the forest and the road came out and turned along a rise of land, and out ahead of us was a rolling green plain, with dark mountains beyond it. These were not like the brown, heat-baked mountains we had left behind. These were wooded and there were clouds coming down from them. The green plain stretched off. It was cut by fences and the white of the road showed through the trunks of a double line of trees that crossed the plain towards the north.The book goes on in this manner, for some time. It's as though Hemingway has turned into an eloquent Garmin device. Step by step. The walk to the creek. The heat of the sun. The taste of the wine. It is all very vivid, and beautifully written, but really, it didn't go anywhere. It seemed like filler. Something to break up the constant drinking (while the drinking breaks up the Spanish travelogue). The lack of a plot normally wouldn't bother me much, but the book as a whole just wasn't working for me. I didn't care for the characters, who are mostly drunken, indolent, well-off whiners. Also, I was intensely jealous of the characters, who are mostly drunken, indolent, well-off whiners. In other words, aspirational figures. Really, though, I just wanted more out of this book. Hemingway's other works have burrowed deep into my consciousness, so that I find myself referring back to them time and again. The Sun Also Rises did not achieve this feat. Eventually, Jake's merry band of drunkards go to Pamplona to watch the bullfights. There is drinking. Fighting. Drinking. Bullfighting. Drinking. Drinking. Passing out. Drinking. I actually got a contact drunk from reading this book. I imagine that sex also occurred, somewhere in the midst of the drinking and the bulls and the overflowing testosterone, but Hemingway is discrete. There are some good things, here. As I mentioned earlier, Hemingway is a master of description. His prose is deceptively simple; his declarations actually do a great deal to put you there, into the scene, with immediacy. The book also features one of Hemingway's most famous quotes: \"Nobody lives life all the way up, except bullfighters.\" For some reason, that line has taken on a kind of profundity, though I have to admit, I almost missed it in context. The best part of the book is the last lines, uttered by Jake Barnes: \"Isn't it pretty to think so.\" I'll leave it to you to determine its meaning. As for me, I am anxiously awaiting the moment when, after a night of hard drinking, I can use this line on someone who has just uttered an inane comment.Alas, I'm still waiting for that moment. And that gives me all the excuse I need to keep sidling up to the bar, ordering a whiskey straight with a whiskey back, and chatting up the people around me in the hopes that one of the drunks I meet will also be a Hemingway fan."}, {"userName": "Tra-Kay", "userReviewDate": "Aug 22, 2007", "userURL": "http://www.goodreads.com/user/show/264037-tra-kay", "userReview": "If I were Hemingway's English teacher (or anyone's any kind of teacher) I'd say, \"This reads more like a screenplay than a novel. Where are your descriptions, where is the emotion??\"And he would say something like, \"The lack of complex descriptions helps focus on the complexities and emptiness of the characters' lives, and the emotion is there, it's only just beneath the surface, struggling to be free!\"And I'd say, \"OK, I'll move ya from a C to C+.\"Basically The Sun Also Rises shows that Hemingway liked bullfights a lot more than most of the people reading his books, and that he was vain but also hated himself. While the characters are wittily funny from time to time, the whole thing doesn't hold a candle to, I don't know, Seinfeld. Without being told, \"Ah yes, this is about the true character of America!\" you'd think it was just a drab romance novel with more subtleties than most.Speaking of, how was this about America? It was more about America's elite. Most Americans in 1926 weren't hanging out in France and Spain, moaning about their lives. They were hanging out in America, trying to make it. You know, without dying. Pretentious, with poor descriptions and transparent characters (I can give a character a subtle injury too and have it pain him, does that make me amazing?), The Sun Also Rises is one of the most overrated books I've ever read. I'd rather read a 1926 newspaper."}, {"userName": "Amanda", "userReviewDate": "Jun 06, 2008", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "This may be my favorite book of all time. At any rate, it's definitely on the top ten list and by far my favorite Hemingway (and I do love some Hemingway). The first time I read this, I loved Lady Brett Ashley. Is she a bitch? Sure, but I don't think she ever intentionally sets out to hurt anyone. And it might be argued that she has reason to be one: her first true love dies in the war from dysentery (not exactly the most noble of deaths) and she's physically threatened by Lord Ashley, forced to sleep on the floor beside him and his loaded gun (and let's clarify that,no, that's not a euphemism, just in case you're a perv). Then we have the one man who might make her happy, Jake Barnes. Poor, poor Jake, who doesn't have a gun, let alone a loaded one (yup, that's a euphemism--snicker away). I think Brett is one of the most tragic figures in American literature. Disillusioned by the war and how it irrevocably changed her life, she tries to fill the void with alcohol and sex--and destroys herself in the process. However, upon rereading the novel, I realized how eclipsed Jake had been by Brett during my first reading. I also realized how I had misinterpreted him during my first reading. I thought Jake was as lost as the rest of the \"Lost Generation,\" but I now believe that he is the only one who is not lost (with the exception of Bill Gorton, whose line \"The road to hell paved with unbought stuffed dogs\" may be my favorite in the book). If there's anyone with reason to give up on life, it's Jake. Does he pine for Brett? Yes. Does he come to hate Cohn for his affair with Brett? Affirmative. Does he get over Brett and realize that, even if properly equipped for a sexual relationship, a relationship with her would end as tragically as all of her other conquests? Abso-damn-lutely. After all, Brett is Circe, according to Cohn, and anyone lured into her bed will lose their manhood. The success of the relationship between Brett and Jake hinges on the fact that Jake literally has nothing to lose in this respect. Cross posted at This Insignificant Cinder"}, {"userName": "J.L.   Sutton", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/3675162-j-l-sutton", "userReview": "My feelings haven't changed since my last re-read of The Sun Also Rises (my earlier review is below). I'm still amazed at how fully the characters come alive on the page! I don't think The Sun Also Rises is for everyone; however, nearly from beginning to end, I'm engaged in the story. Just finished a re-read of The Sun Also Rises (my favorite Hemingway book-last read in 2014). I didn’t provide a review at the time so I thought I would (try to) explain why this book speaks to me. First, it is deceptively easy to fall into with its short sentences and simple language. Nothing is forced. However, it is the mood Hemingway creates in this novel which really engages me. Perhaps that says as much about me as it does about the novel. The appeal is not so much about the story; it is how the characters move through the scenes with a sense that nothing can touch them (while conversely, they can’t really touch or be important to anyone else). This exemplifies that lack of hope in the so-called ‘lost generation,’ that feeling that nothing you do will make a difference. The Sun Also Rises is not a feel-good book, but it allows you to re-evaluate people as social animals who constantly struggle and fail (and maybe once in a while succeed) in forging meaningful relationships. In some ways, the carefree expat life of the characters seems idyllic; however, Hemingway also makes you feel that slipping into this existence (even with its charms) might make you want to spit at the world. The Sun Also Rises captures a historical moment, perhaps not just of the lost generation, but also of future generations uncertain of their place in the world."}, {"userName": "Brad", "userReviewDate": "Mar 25, 2008", "userURL": "http://www.goodreads.com/user/show/1022982-brad", "userReview": "I've read this book every year since 1991, and it is never the same book. Like so many things in this world, The Sun Also Rises improves with age and attention.Some readings I find myself in love with Lady Brett Ashley. Then I am firmly in Jake Barnes' camp, feeling his pain and wondering how he stays sane with all that happens around him. Another time I can't help but feel that Robert Cohn is getting a shitty deal and find his behavior not only understandable but restrained. Or I am with Mike and Bill and Romero on the periphery where the hurricane made by Brett and Jake and Robert destroys spirits or fun or nothing (which is decidedly something).And then I am against them all as though they were my sworn enemies or my family. No matter what I feel while reading The Sun Also Rises, it is Hemingway's richest novel for me. I feel it was written for me. And sometimes feel it was written by me (I surely wish it was).Hemingway's language, his characterizations, his love for all the people he writes about (no matter how unsavory they may be), his love of women and men, his empathy with the pain people feel in life and love, his touch with locale, his integration of sport as metaphor and setting, his getting everything just right with nothing out of place and nothing superfluous, all of this makes The Sun Also Rises his most important novel.It is the Hemingway short story writ large. It is the book he should be remembered for but isn't. I often wonder why that is, and the conclusion I come to is this: The Sun Also Rises is too real, too true, too painful for the average reader to stomach. And many who can are predisposed to hate Hemingway.A terrible shame that so many miss something so achingly beautiful."}, {"userName": "colbyhewitt", "userReviewDate": "Jun 12, 2007", "userURL": "http://www.goodreads.com/user/show/124936-colbyhewitt", "userReview": "I think there is something cheesey about reviewing an old book, but I felt I had to write something, as I constructed my senior thesis in college with this book as the cornerstone, I have read it at least six times, and I consider The Sun Also Rises to be the Great American Novel. Why?1) Hemingway was, if nothing else, a great American. A renaissance man, a soldier, a fisherman, and a sportswriter, a romantic and an argumentatively direct chauvinist, a conflicted religious agnostic who never abandoned religion (and, it could be argued, never wrote about anything but his conflicts with religion), Hemingway was a stereotype red-blooded American like no other great writer. An argument could be made for Fitzgerald, but the crux of that argument lies in his relationship to Hemingway (and his psychotic wife. By the way, I love Fitzgerald. He is just a touch wordy).2) The Sun Also Rises describes (among other things) disillusionment with the \"American Way\" and what that had come to mean (especially emphasized through the walking wounded, contrasted always with previous generations' \"Dulce et decorum est pro patria more\" mentality). Unlike other similarly-themed novels, however, the book does not take place in America. I postulate the Great American Novel must take place somewhere other than America, to reveal the way in which Americans can be defined as such anywhere, and to ephasize said disillusionment. I have other reasons to think thus, but suffice to say for the moment.3) The Sun Also Rises does not end so drastically as other great works of Hemingway's, such as A Farewell to Arms (not afraid to say I shed tears at the end of that one) or For Whom the Bell Tolls. His best ending was in Old Man and the Sea, but that work (at the risk of sounding blasphemous here) was slightly too poppy to be his best. 4) The book does not begin with the narrator (the opening describing Robert Cohen). Americans exist in relationship to one another. The country has been built through a competitive spirit- fostered by democracy and that ideal we call \"The American Dream\". The backlash of all that is a natural inclination to \"Keep up with the Jones',\" as it were. Jake Barnes is an observer, separated from the Americans and from the Europeans yet constantly comparing himself, directly or by insinuation, to others.In short, read the damn book. If you don't get it, read it again. It is arguable (perhaps, though I doubt it) that this book may not be the best ever written, but I do believe no greater has ever been penned. You want a great trifecta? Read The Sun Also Rises, then The Great Gatsby, then Eliot's The Wasteland. Follow those up by reading Ecclesiastes 1 and the Revelations of John. Now go to a cocktail party and start a conversation. You're welcome."}, {"userName": "Kemper", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "There’s a very nice restaurant that my wife and I frequent that has become our go-to spot for special occasions like birthdays or anniversaries. When we first started going here, I saw that they were serving absinthe. I’d been curious about the drink since first reading Hemingway’s descriptions of it in The Sun Also Rises back in high school. Banned for most of the twentieth century in the U.S. for wildly exaggerated claims of it’s hallucinogenic qualities, it was made available to be imported here again in 2007. When I saw it on the menu, my mind immediately conjured images of Hemingway and his fellow expatriates sipping it in Paris with ironic detachment. (The restaurant even features a Hemingway inspired version mixed with champagne that’s called Death in the Afternoon.) I wanted to try some, but it’s $12 a glass, which seemed a bit pricey for the sake of literary cocktail experimentation. And I gotta admit that I was slightly nervous about having some kind of absinthe-based freak-out.However, I’ve been on a Jazz Age book kick lately, and a few weeks back when we were having dinner at this place, I finally said to hell with it and ordered a glass. The waiter asked if I’d tried it before and must have had some bad experiences with newbies drinking it. I promised him I was indulging for purely experimental purposes and would not hold him responsible.So he brought the absinthe out and did the whole bit with the special spoon and the sugar cube. I would have been lost there except I’d seen Johnny Depp do this routine in From Hell. Finally, I tried my first sip.It tasted like a combination of black licorice and what I can only assume is the flavor of rotting corpses. And I hate black licorice so much that I almost would have preferred just the rotting corpse taste.However, when you pay $12 for a drink, you choke that mother down. So I drank it, cursing Hemingway the entire time and wishing I could dig his body up and reanimate him so I could give him another shotgun blast to the face for ever putting the idea of drinking that vile stuff into my head in the first place.Oh, and that night, I had some of the most fucked up nightmares I’ve had in years so maybe the hallucinogenic qualities weren’t exaggerated all that much.So when I was re-reading The Sun Also Rises and Jake gets completely hammered on absinthe, I almost tossed my cookies as the memory of that black licorice flavored corpse came back to me. Repeated exposure to that drink would also explain why Jake would put up with Brett’s routine. Your junk doesn’t work but you keep hanging out with the woman who claims to love you but demands your help in hooking up with other men? I would have been on a boat to Antarctica to get away from her man-eating ass, but he was deranged from drinking that shit. This book is still pretty damn good, but I’m deducting a star just because it tricked me into trying absinthe. Take that, Hemingway!"}, {"userName": "Alex", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "THIS BOOK IS ABOUT A MAN IN SPAIN HE GETS FRIENDZONED."}, {"userName": "William1", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/4684009-william1", "userReview": "“Funny,” Brett said. “How one doesn’t mind the blood.”4th reading. IMHO, this is one of the essential books of life. It never fails. It possesses—for the right reader—an enormity of narrative pleasure and it grips from the very first line. Some notes.The passage at the Paris nightclub with the gay boys doesn’t bother me as it used to. Our narrator, Jake, knows he’s being unreasonable. The queers, with whom Brett arrives at the club, have working penises and choose not to use them on her. To a man made impotent by war, a young man in love with her, their preference must seem like a kind of madness. Moreover, there may be a fear on his part that he’s becoming like them. That is, indifferent to female sexuality. He’s not, of course, not emotionally. Now we’ve left Paris, taking the train to Bayonne. Then in an open car up the dusty roads to the plateau on which Pamplona sets. From here Jake and Bill go to Burguete to do some fly fishing while Robert Cohn returns to San Sebastián to await Brett and fiancé, Mike. The trip on the bus to Burguete—through the stark countryside while Jake and Bill drink wine with the Basques—dazzles, lifts one’s spirits. The fishing sequences on the Irati River are beautifully Spartan. Then after five days the fishermen are back in Pamplona. Mike and Brett are about to complete the five-some. So now we’ve got three men together in Pamplona who’ve slept with Brett. Jake, the narrator, Robert Cohn, who walks around in stunned rapture at the sight of her, and her fiancé, Mike. Jake is through with her and he knows it. But Cohn is like a child, always staring at her, and the newly bankrupt Mike doesn’t like it. They all go to watch the bulls arrive at the ring. Steers are brought in to “calm” the bulls. This usually ends with most of the steers being gored. After returning to the café Mike refers to Cohn as a steer for the mute worshiping manner in which he follows Brett around. He rounds on Cohn. I’d like to include the dialogue on pp. 141-144 here, it’s so beautifully compressed, but too long to copy out. Though it seems to me a key part of the novel in this sense: Jake, after a painful meeting with Brett back in Paris, after which he wept, seems for the moment to have let her go. But then it occurs to the reader how much pain this appearance of non-interest in Brett is causing Jake, even though the subject is never openly alluded to. This is an example of Hemingway’s use of omission. He was a master of cutting things out—of not talking about the elephant in the room. I’ve read and reread this passage and every time it surprises me anew. Then the fiesta “explodes” with two rockets over the main square and the peasants, who until then have been drinking copiously but quietly in the outer town, come rushing into the main square like it’s Time Square on New Years Eve in the old days; that is, packed, without neat fire lanes. Instantly the peasants worship Brett like some kind of Madonna. They usher her and the others into a wine shop. These are among the most heartwarming moments in the book for our five adventurers are treated like nobility and the author really captures the wonderful manners of the local people. The description is spare yet rich in atmospherics. The end is a knockout. Jake is held in odium because he has allowed the bullfight to be compromised. Whereas before, Jake and the hotel owner, Montoya, saw each other as fellow aficionados, now Jake is seen as a disappointment, to say the least, if not a corrupter of the fight. There are dozens of plot points I’m not touching on here. Please read it. Note: Hemingway was troubled. He was loaded with silly machismo and he could be egomaniacal. If you’re going to read him you must let go of his reputation. Otherwise you’ll just sit in judgement and won’t be able to enjoy his prose, which is light as air and satisfies on so many levels."}, {"userName": "Meredith Holley", "userReviewDate": "Jul 07, 2008", "userURL": "http://www.goodreads.com/user/show/1302775-meredith-holley", "userReview": "Everything is still tonight, like a friend was talking and I didn’t hear her until she stopped. Like absence. Coming back from vacation has that feeling of loss because all of the friendships resolve into something real, whatever that may be. Whenever I am away from home, I crave The Sun Also Rises. I think it got into my blood from reading it again and again at impressionable ages. Since I returned home this time, a couple of weeks ago, I can’t stop thinking about my friends in this book and their fiesta. And I’ve been thinking about the last line of the book and how pretty we all are when we are away.It seems vulgar to talk about substantive things in this book, compliments or criticisms, because I think it’s one of my best friends, and one of my oldest friends. I probably don’t know any of you as well as I know The Sun Also Rises, so I don’t really want to go behind its back and tell you whether it’s an angry drunk or has informed opinions about war and taxidermy. I will tell you that it’s a comfort when I’m sad or lonely. Not a gentle comfort, but a comfort nonetheless.I love getting away for a fiesta and the bonds and prejudices that come from being with people on vacation. I hate returning. Returning from vacation makes me really angry. We were waiting for the plane in Tanzania on the way back from Zanzibar, and I had just gotten to the end of The Sun Also Rises. I was so pleased to end the book and see the fiesta disintegrate, just as my own vacation did. During my last week on the island, I was reading another book, and I couldn’t even pay attention to it because I so badly wanted to read about Jake and Bill going fishing. I had to stop and change books on my wonderful Kindle (don’t hate). But, as I was sitting in the café at the Dar es Salaam airport, eating my grilled cheese and anticipating what Jake has to tell me at the very end of this book, suddenly it ended – TWO FULL PAGES BEFORE THE ACTUAL END OF THE BOOK. That is the type of evil I’m talking about of returning from vacation. I’m still mad about it, even though, of course, I finished the book when I got home to my printed copy.I should probably tell you about how much I love the men in this book. Aren’t men sometimes lovely? And I love the women here, too, even though I cannot imagine a woman ever seeing herself or seeing another woman the way Hemingway writes her. She is always sort of framed and hanging in the entryway of the story so that as people are coming and going they see her and comment on her beauty and tragedy. But, there is always something that reminds me of Romeo and Juliet in Hemingway’s men. I know that A Farewell to Arms is really his Romeo and Juliet (and I love that book as much, even though it is more pristine and not as good a friend). But there is something of the way the men are here that is just the way the men are in R&J. They are all in love and all fighting. And Hemingway’s love stories are made so much more beautiful by being totally incompatible with life. The love is idealized, like maybe all love is, but like the story is not. He tells you about those pockets of comfort in life, but he also tells about what is on either side of them.I guess I am talking around what I love about the men. I had forgotten in rereading this that there is the hovering analogy of the bulls and steers throughout the book. It is so beautifully done, without being vulgar and literal. I love that all of the emotion among the men – the respect and pity and friendship and jealousy and silent understanding – is there and tangible, but no one talks down to me about it or ruins it by bragging and explaining. Anyway, I have always been partial to Benvolio, and I think Bill is a sort of Benvolio character here, even though you will maybe say he is a Mercutio because of all of his chatter and utilizing. Maybe Jake is my Benvolio. Of course, Cohn must be Romeo. I love being told about all of them.Mostly what I’m thinking about is the men being in love, even though the story isn’t only about that. The love stories here are so much the opposite of love stories that I am thinking about calling this book an anti-romance. Maybe I am wrong, though. They are about wanting and never having, and isn’t that the flash-bang of romance? Not, obviously, in the literary sense of “romance,” but in the Hollywood sense of romance. The Valentines Day sense. In the sense that vacations are romantic – living a life outside of your own that doesn’t even really exist. For a while now, I have been looking for what I find to be truly romantic in stories. By that I mean, what I find to actually sell me on the idea of love. There are those stories in which people dig deeper than romance to the place that Hemingway’s characters get to, the alienation of actually knowing each other, and then they dig past that to something that I think is love. Maybe that exists. I don’t think Hemingway believed in it, though, and I don’t know that it would have been very interesting to read about if he did. What he writes about, though, is beautiful and interesting, and it exists to me.I have read this book more times than any other, and even though it is different to me each time, and I see something new, it is always a friend. I don’t really want you to read it. I am happy keeping it to myself. I mostly wanted to tell you about how I love vacations and hate coming back from them, and how it is always just like in the book. I also wanted to tell you about how Chapter 12 is probably my favorite writing that exists, and how I love the rain and I love it when Hemingway writes about the rain. I think Hemingway understood a lot of things differently than I do, but he talks about them so perfectly."}, {"userName": "Stephen M", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/3712181-stephen-m", "userReview": "[but there is still something that bothered me; why wasn’t the heroic and idealized Pedro Romero killed? Wouldn’t that have been so much more interesting/tragic/thematically significant in light of Hemingway’s oft used “failed masculinity”, if Pedro Romero had been killed? He is the ultimate symbol of macho libido; wouldn’t that have played so well into a book about an impotent man? But instead we’re told that a Vicente Girones died; who the fuck is that? Why do I even care? It’s all this meaningless minutia of names and places, that fall completely flat and hardly engage me as a reader. (hide spoiler)]"}, {"userName": "Matthias", "userReviewDate": "May 30, 2012", "userURL": "http://www.goodreads.com/user/show/9889835-matthias", "userReview": "Fiesta: The Sun Also Rises could be read like it's some kind of evil social experiment. You take a room and you put in three elephants. (You may also choose to build the room around the elephants for practical reasons.) You give the elephants names, and paint these names on their flanks in letters big, bright and red. You call them Impotence, Jealousy and Loneliness. Then you have a group of people enter that same room, a couple of guys and a gorgeous girl. They can do anything they like, they get the freedom to do anything they want. The only rule: They are not allowed to address the elephants in the room. To make things more interesting there's an open bar and all the liquor in the world. Sounds like a party alright. Except, it didn't read like a social experiment to me. It didn't on my first reading, and it didn't on my second. So yeah, time for some creative writing and dramatisation! __________First Reading - ViennaThe academy hallways were full of sound. The sun blasted through my window, the room was hot. I got off the bed, splashed some water on my face and headed out the door. The hallway was white and cool. Familiar faces were smiling at me and at each other. Bags and suitcases were strewn all over and I made my way to the big stairway. I hugged some people. Students were returning from the summer holiday, they were in good spirits. I had stayed over summer. An internship had kept me in Vienna and in the academy for the hot season full of tourists. I saw David. He was talking to some people and I headed over to his group. He had come from Canada and looked pretty tired. His checkered shirt was wet under his arms. \"Hey man! You had a good flight?\"\"Yeah, pretty beat. Going for a quick nap.\"\"You're up for drinks later?\"\"Sure.\"He went up two flights of stairs. The other students had started up their own excited conversation about their summer holidays so I decided to head down, into the garden. It was surrounded by the white architecture of the academy. Some trees stood huddled up in one corner, a bench overlooking a green lawn sat in their shade. Lucian was reading a book.\"Hey.\"\"Hey, old sport. Had a good summer?\"\"Yeah, Vienna is swell in summer. A lot happened.\"\"Nice. Weren't feeling too lonely then?\"\"No, not too much. She's been really nice, you know.\"\"Who?\"\"Are you up for drinks later?\"\"Of course.\"\"You see Andrew yet?\"\"No and I haven't heard him all summer.\" \"Me neither. Doesn't surprise me.\"\"Yeah.\"\"Will be good seeing him again.\"\"Yes.\"He continued to read and I went back up my room. It started to cool off a bit outside so I opened my window to let in the fresh air. I tried to read a bit but my stomach hurt. I hadn't eaten well in the morning, just a biscuit and some yogurt. I lay face down on my pillow and sighed. The breeze coming from outside stroked the back of my neck and my hair. Voices and laughter came from outside. My stomach ached. I woke up a couple of hours later. The Gymnasium next to the academy had blocked off the rays of the low-hanging sun from our garden. It was thrown in grey shades and a fresh silence. I took a sip of water and got changed. As I headed out I saw David on the stairs. \"Let's go?\"\"Yes sir, I was just on my way.\"\"Not too tired?\"\"A bit, I got me a bit of the old desynchronosis.\"\"I see you're still sleeping with your thesaurus.\"\"What? It's a normal word.\"We went through the big wooden door of the academy, out in the street in the evening sun. We turned away from it walking eastward towards Karlsplatz. A small, white church lay at the end of the street. It was closed. It had been all summer, as far as I could tell. We passed by it, crossed a busy street with a tramcar and saw a red bus parked in the street ahead. The owner of the bar had bought a British double-decker. Signs were put on its windows advertising book readings for children. The \"Lesebus\", Johnny chose to call it. The pub's terrace sitting in the double-decker's shade was full of people. We went in and saw Lucian sitting at one of the tables. He was writing something down in a notebook before he looked up and saw us coming. \"Good evening, old chaps!\"\"Good to see you again, Luke. What are you having?\"\"Kilkenny.\"My stomach ached.\"What about you, Matt?\"\"Yeah, same thing.\"David went to the bar to order. A line of people had formed, their places were being reserved outside on the terrace. Nobody seemed to anxious, it was still early. Most of the noise came from outside, some of it drowned out by the rock music coming from within. \"Did you see her yet?\"\"Didn't see anyone I know since I got here, just Jake behind the bar. Asshole.\"\"Yeah, he's an asshole.\"\"So, how are you?\"\"Alright, you know, a bit rusty on the drinking. I don't drink as well as you guys.\"\"You're a poor drinker.\"\"Give me tequila or vodka and I'll handle it. Did you see Andrew yet?\"\"You're a poor drinker.\"\"I don't drink beer very well, that's all. Must be the fermentation stuff or whatever. Did you see Andrew around?\"\"No. Probably didn't get back from England yet or he'd be here. Man loves a drink more than a momma loves her babies.\"\"What are you writing?\"\"The usual. I've been reading a great book. Hemingway. Fiesta. You know it?\"\"I can't say that I do. Just started reading you know. I'm now in the middle of \"A Confederacy of Dunces\".\"\"Now there's a funny book. You should try Fiesta.\"David came back with three glasses. \"Cheers, guys.\"\"Hey David, did you read Fiesta?\"\"Hemingway? Sure! Great book.\"\"She's such a bitch, right?\"\"Yeah.\"\"What a bitch.\"\"Yeah. And such poor sods too.\"\"Hey, don't spoil the book guys, I haven't read it yet.\"\"Don't worry, it's not a spoiler. It's pretty obvious from the get-go. She's a bitch.\"\"Yeah. Poor devils. I've never been to Spain. Maybe next summer.\"\"It's nice. I'm not too crazy about their bullfights, but their food is excellent. They got these big, dried hams everywhere.\"\"Bull ham?\"\"Ham doesn't come from bovine creatures Matt.\"\"I know. I was in Barcelona a couple of times, good place. The sea, the city, it's got it all. Good place.\"\"We should go to Barcelona together, have a party. We'll have a blast.\"\"Isn't it pretty to think so?\"\"Yeah. You guys want another beer?\"\"You didn't finish yours yet.\"\"You know I can't keep up.\"\"Keep up.\"\"I can't.\"\"Keep up, you bastard.\"\"I'll finish it on the way.\"I stood up, picked up my jug. Lucian gave me a dirty look. David rubbed his face and looked at the wall. I went to the bar and stood in line. People were pushing against me as I was finishing my beer. It was hot. Sweat was running from my forehead, irritating my eyes. Things were getting blurry. \"What will it be?\"\"Hey Jake. Three Kilkenny please.\"\"Big ones?\"\"Big ones.\"He handed over the beers. I handed over the money and told him to keep the change. It was a big tip.\"Have you seen her?\"Jake didn't hear me. He was already looking over my head towards the next customer.I returned to the table. David had pulled out a game of cards. \"Why aren't they here?\"\"Who?\"\"Andrew.\"\"I told you, he's probably still in England.\"\"Everyone returned today. I'm pretty sure he's in Vienna. Why isn't he here?\"\"Maybe he's tired? I know I am. Wanna play?\"\"And why isn't she here? She's normally always here on Tuesday nights.\" \"Wanna play?\"\"No.\"\"Play.\"\"I don't feel like it.\"\"What's up, Matt? You can't handle beer, you don't want to play. Had a rough summer?\"\"I had an excellent summer.\"\"Great to hear it! Cheers!\"\"Cheers guys.\"\"Cheers!\"\"Now let's fucking play.\"She hadn't come. I had heard a noise from Andrew's room before going back to mine. I didn't turn on the lights but walked to my bed and fell face down on my pillow. I punched my mattress. My knuckles were burning. My stomach ached. __________Second Reading - BrusselsWe're lying in bed. It's getting dark outside but the street is still alive with sounds of children playing. It's a hot summer night, holidays are almost over. She's playing with her phone. I'm reading the last pages of Fiesta.\"Isn't it pretty to think so?\"I close the book and put it on my night table. I turn off my lamp and get ready to sleep.\"Going to sleep already?\"\"Yeah, pretty tired.\"\"Did you finish your book?\"\"Yeah.\"\"Was it any good?\"\"It was excellent.\"\"Nice. Good night, my love.\"\"I love you.\"\"Me too.\"I closed my eyes. I felt myself slipping into a deep sleep. I felt strange dreams lying in wait for me behind a cold veil of darkness. She stirred, turned her back to me. I turned on my side and opened my eyes. She glanced sideways, looking up. I took her by the shoulder and gave her a kiss. I lay back down and drifted off."}, {"userName": "Lyn", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "The Sun Also Rises, Ernest Hemingway’s brilliant 1926 novel about the Lost Generation is a must read for Twentieth Century literature.I was assigned this as a junior in college, our English professor told us to read it and to be prepared to talk next week. The next class was spent on students describing their thoughts about the novel and what we thought it meant. With a smug smile and somewhat of a condescending air, the instructor stepped form his podium and said something to the effect that readers had been missing the point for decades.This was my first experience with an unreliable narrator. Literature would never be the same again.Complex and told on many levels, this also contains some of the most archetypal characters in all of modern literature, highlighted by the inimitable Lady Brett. Dangerous and contrary to Hemingway’s ideals of masculine superiority, Lady Brett Ashley would be recreated somewhat in his later story “The Short Happy Life of Frances Macomber.\""}, {"userName": "Fabian", "userReviewDate": "Jul 18, 2014", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "Yes, impeccable and precise prose. Yes, a superstar writer. Yes, I hadn't read it before, but that's totally okay. Somehow, I couple this quaint piece--most of the characters are blah because they belong to that blah generation, I mean, what to do if not fight in war?--with the monstrously intolerable novel by Malcolm Lowry, \"Under the Volcano.\" But thank god this one has the European charm that is all but ridiculed in Lowry's take on some similarly lost days in Mexico. Here are some lost days in Paris, then some in Spain in Pamplona; I rather favor travelogues and valentine-to-(insert place other than home here) books, but the aimlessness, while pretty and underscored symbolically to feelings of hopelessness and totally melancholic disconnects, is rather-- um...uneventful? It is interesting, yes. It's Hemingway for fuckssakes! But I can't help but grin at modern writers who have bested him time and again. \"Old Man and the Sea\" is, for me, his masterpiece. This, well... just like a Picasso is a Picasso (even the sketches that go for thousands of dollars along the Florida East Coast), a Hemingway is no doubt always a Hemingway."}, {"userName": "Melki", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "This is essentially a 200+ page drinking game which features a group of people who don't need to work for a living getting tipsy and talkative. It's not awful, but compared to the other two Hemingway novels I've listened to - (The Old Man and the Sea, and A Farewell to Arms) - this one seems rather dull and pointless. Indeed, the only real pleasure I got out of this audio version was the fact that it was read by William Hurt. He does a fantastic drunken Irishman, PLUS, it was a joy picturing him as Jake Barnes."}, {"userName": "Sarah", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/49360584-sarah", "userReview": "“Don't you ever get the feeling that all your life is going by and you're not taking advantage of it? Do you realize you've lived nearly half the time you have to live already?\" \"Yes, every once in a while.\" \"Do you know that in abou thirty- five more years we'll be dead?\" \"What the hell, Robert,\" I said. \"What the hell.\" \"I'm serious.\" \"It's one thig I don't worry about,\" I said. \"You ought to.\" \"I've had plenty to worry about one time or other. I'm through worrying.\" \"Well, I want to go to South America.\" \"Listen, Robert, going to another country doesn't make any difference. I've tried all that. You can't get away from yourself by moving from one place to another. There's nothing to that.\" \"But you've never been to South America.\" \"South America hell! If you went there the way you feel now it would be exactly the same. This is a good town. Why don't you start living your life in Paris?”"}, {"userName": "Arah-Lynda", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "While I was reading this I thought time and again about a quote from another book.This one: Mrs. Poe“That’s it!” I dropped the magazine.“What Mamma?” asked Vinnie“This silly alliteration – it’s clinkering, clattering claptrap.”Ellen’s face was as straight as a judge’s on court day. “You mean it’s terrible, trifling trash?”I nodded. “Jumbling, jarring junk.”Vinnie jumped up, trailing shawls like a mummy trails bandages. “No it’s piggly, wiggly poop!”“Don’t be rude, Vinnie,” I said.The girls glanced at each other. I frowned. “It’s exasperating, excruciating excrement.”As I am sure you’ve guessed they are not discussing Hemingway.I had just come off reading The Paris Wife If ever there was a time for Hemingway to shine for me. this was it, the pump being well primed and all.Still only two words come to mind, while I am thinking about this book, the first is vapid and the other, drivel.I can say that there are some scenes, during the running and fighting of the bulls, where the bare bonesness of his words, paints a very clear picture.But seriously, how does one write a review about nothing?"}, {"userName": "Luke Narlee", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/7387842-luke-narlee", "userReview": "There will always be a special place in my heart for this book. It's easily one of my favorite books of all time. Definitely my favorite Hemingway book (it's quite different from the rest). No, it's not perfect. Yes, it gets a bit boring in the middle when its main focus is on bull fighting. But for the most part, the story is funny and wonderful and quite touching. The dialogue is so alive, it practically has a pulse. Nobody writes dialogue like that anymore. It's snappy, fast, witty, honest... and there's a lot of it. I could read chapters 3 and 4 of this book every day for the rest of my life and not get tired of them because of how much I love the dialogue and the character interactions. The characters are fantastic and entertaining to boot. Even the less likeable ones are quite amusing. And I just love the chemistry between Jake and Brett. So well written. When you watch a movie, it's easy to detect if the characters/actors have good chemistry or not because it tends to be more of a physical thing. But in a book, it's not so easy. And they aren't an obvious match either. Jake is kind of that typical, cool guy from back in the day with a sarcastic attitude who dishes out sarcastic one-liners like a pro. Brett is a beautiful, sophisticated woman who, on the surface is the outgoing sort who eats up her wild party life and loves the attention it brings her. She loves to be doted on and seems to live her life like she must be out and about at all times, doing fun things. But there's more depth to her than that, and for the most part, you only see it when she's with Jake. Especially when she's alone with Jake. Which only happens a few brief times in the story. Then you realize, hmm...maybe her outgoing ways are really more of purposeful distraction. I love tragic love stories. When two people feel a deep, heartbreaking love for one another, yet can never truly be together. At least not in the way they want. Not in this lifetime, due to their particular circumstances. In this case, she's married. He's handicapped. Yet, their madly in love (which is obvious, without either of them ever actually saying so to one another or anyone else for that matter), even if they aren't brave enough to do anything about it, so they settle for friendship and do their best to distract themselves with reality, so they don't have to think about it. That's real life. It happens all the time. I could easily feel the sexual tension between Brett and Jake whenever they were together on the page. And that's because of how it was written. Their connection wasn't shoved down my throat. It was in their body language, and most of all, what they didn't say. But sometimes it was what they did say. And that was always perfect too. It was always, just enough to convey their emotions. Lots of subtlety and talking their way around the emotional elephant in the room, which is always a good thing in my opinion. Also, I love love love the ending. Love the last two or three pages. Love the last paragraph. Love the last line. It may not be a storybook happy ending, but if I wrote this book, it's exactly how I would have ended it too. So much left unsaid. So much beautiful sadness lingering in the air between them. And even right before that, when they are sitting down to have wine/lunch together, nervously fumbling over their words in the last couple pages... don't even get me started. There's so much heartache on display in that one scene (despite them both acting very upbeat), without the characters uttering a single word about how they actually feel. Again, so true to life! I completely understand why people might not agree with me on any or even most of what I've said in this review. I've read plenty of bad reviews for this book. But for those who do... For those who have been there and experienced a taste of this in your own life... Then you know where I'm coming from. There's real love in this story. And love can be sad. And it can be beautiful. And sometimes it's both. And that is what this book captures perfectly. Hemingway's debut novel (written in 1926!), and for me, he never wrote a better one. It feels very fresh, exciting and independent like when Quentin Tarantino released \"Reservoir dogs\" and \"Pulp Fiction\" in the 90's. Or a french new wave movie from the 60's such as Godard's \"Pierrott Le fou.\"So for anyone who has tried to read Hemingway in the past and just couldn't get into his stories, I don't blame you at all. He's one of my favorite authors, but his books are not the easiest to read. Particularly his heavier books like, \"For whom the bell tolls.\" He has a few that I just can't get through because I lose interest. But don't let that stop you from giving this one a shot. It's unlike anything else that he ever wrote. And if it's not for you, then no big deal. There's a million other books to read. But if it is, I promise you won't ever forget it."}, {"userName": "Duane", "userReviewDate": "Oct 30, 2013", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "This is my favorite Hemingway novel, maybe because it was my first. The Sun Also Rises was to Hemingway what The Great Gatsby was to Fitzgerald."}, {"userName": "Warwick", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "I finished The Sun Also Rises in a hotel room in Vienna, and reading it while in transit in Europe perhaps affected how much I liked it – I liked it very much, far more than I expected to after my ambivalent reaction to A Farewell to Arms. The open, wide-ranging view of Europe from Paris to Pamplona is something I feel very in need of right now, and Hemingway's hungover cynicism masquerading as wisdom seems here much more beautiful to me. This is particularly so because instead of the grand tragedy of A Farewell to Arms, the tone is built around a more quotidian resignation which I thought was much more believable and familiar. I have never loved Hemingway's prose style but I do admire the way he writes dialogue in this book, very allusively, with all kinds of ironies and inside jokes and drunken repetitions flying around that make for very rich and dynamic scenes, despite the anonymity of a lot of the cast. The prevalence of dialogue also makes this a surprisingly fast read.I was wooed early on by the opening descriptions of Montparnasse, where I used to live, and the expat stomping-grounds of the Rotonde, the Sélect, the Dôme, the Closerie des Lilas, all still going strong. (Well, most of them are a bit overpriced and unatmospheric now, although the terrasse of the Lilas is still one of my favourite places in Paris to get melancholically hammered.) Hemingway writes many paragraphs whose meticulous geographic detail is a sure sign of someone trying, by means of concrete landmarks, to understand where the beauty of a particular night inhered:We came on to the Rue du Pot de Fer and followed it along until it brought us to the rigid north and south of the Rue St Jacques and then walked south, past Val de Grâce, set back behind the courtyard and the iron fence, to the Boulevard du Port Royal. […] We walked along Port Royal until it became Montparnasse, and then on past the Lilas, Lavigne's, and all the little cafés, Damoy's, crossed the street to the Rotonde, past its lights and tables to the Select.You could read this book with Google Maps open in front of you; in fact you often feel that's what Hemingway wants. His descriptions of walking and fishing in the Spanish countryside are similarly exact, and – like the drum-beat of American placenames in Jack Kerouac's prose – they betray a deep intensity of emotion.The most lavish setpieces are those around the running of the bulls, and the bullfights themselves, in Pamplona. After several pages about the behaviour of the ‘bulls’ and the ‘steers’, in which both words are used repeatedly, one is compelled to recall that a steer is a castrated bull and so to realise that this is some kind of guiding metaphor for Hemingway, not just in the context of the novel (whose narrator has been effectively castrated by a war injury), but in a wider investigation into masculinity.It's more subtle than perhaps I was expecting from Hemingway, because when you look at the cast – a series of men getting ruthlessly friendzoned by one pretty, flighty Englishwoman – you see no sign of his ideal alpha male. Instead there are only men who sometimes try to act like bulls, and are damaged or otherwise made into steers in the process. So there is a deep ambivalence in the writing, because Hemingway is clearly seduced by what he sees as the raw manliness of bullfighting, but apparently sees no way of carrying it over into real life.Brett Ashley, the ‘damned good-looking’ siren around whom the other characters orbit, is a fabulous and fascinating portrait of the modern, liberated, short-haired divorcée of the 1920s and '30s. She does not behave very well and you feel you should dislike her, but, then again, one sees the appeal. Not unlike Hemingway himself, in my case."}, {"userName": "Perry", "userReviewDate": "Mar 30, 2012", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "\"'The Sun Also Rises' is about bullfighting, bullslinging and bullshit.\"\n Zelda Fitzgerald[[3.4 stars]]2d from left is British socialite Duff Twysden (on whom \"Lady Brett Ashley\" was based), and next to her is Hadley Richardson, Hemingway's 1st wifeOn my mission over the past 8 years to read all \"classics,\" this one strikes me the least.The novel is apparently held in high esteem now for Hemingway's style than for the story's substance, which is a bit dated by its reliance on the people, places and things of the mid-1920s. As to the style, it's his short sentences with little punctuation that create a collage of visuals, and his mastery in the quasi-cinematic techniques of cutting quickly from one scene to the next in a seamless blend. The story is known for drawing the most vivid picture of American and British expatriates living in Paris during the 20s, and played a huge part in Americans' romanticization of the place and era. As a side note, its portrayal of Lady Brett Ashley (a twice-divorced, liberated lady) created a fad for short hairdos for 1920s American females. And, Hemingway was applauded for creating such a feminist leading lady.The novel, a roman à clef based on the lives of Hemingway and a few of his friends, follows protagonist Jake, a vet rendered impotent by a war injury, and his writer/artiste/riche set of pals, one of whom is female, Lady Brett Ashley. They hang out in open Parisian nightclubs, Jake and a buddy go fishing, and then all head to Pamplona, attend the bullfights, drink and generally make merry. Jake is in love with Brett Ashley; yet, he cannot fulfill her needs due to his impotence. Robert Cohn, a former boxer turned writer, is also in love with Lady Brett, yet all in their group detest Cohn, who is Jewish (the novel could be considered anti-Semitic).* Lady Brett (a new feminist of the 1920s) is attracted to and seduces the young stud bullfighter, who is half her age.I was unaffected by this novel, except to feel empathy for Jake for his impotence and inability to consummate his love and a bit of anger for the general mistreatment of Cohn.Streets of Pamplona prior to Annual Running of the BullsHemingway, a real man's man, expressed angst about writing Jake's character as \"less than a man,\" that is, because of his impotence he was unable to have consummate his love for Lady Brett. Some have speculated that one reason Hemingway killed himself was because he was severely depressed due to his age-related impotence. Obviously, this speculation discounts any other sources, such as alcohol, of Hemingway's depression which he had apparently suffered for years. I like Hemingway's clear, concise writing style. Twenty years ago, I would have argued with you that Hemingway was the best writer of all time. That was the me who romanticized the life of a writer living in Paris, covering the Spanish Civil War, going to Africa and settling in his later years in Key West, the writer who wrote so the common man could understand what he was saying without constantly stopping to go to the dictionary (compare, e.g., Wm. Faulkner and Absalom, Absalom!; Cormac McCarthy and Suttree). This, the revered writer who, in response to Faulkner's criticism that he's \"never been known to use a word that might send a reader to the dictionary,\" cooly declared: Poor Faulkner. Does he really think big emotions come from big words? He thinks I don't know the ten-dollar words. I know them all right. But there are older and simpler and better words, and those are the ones I use. *Hemingway was criticized as anti-Semitic for portraying the only Jewish character in such a negative light."}, {"userName": "Jason Koivu", "userReviewDate": "Nov 29, 2008", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "The bored, the disenchanted, the wandering wondering and/or nearly thoughtless (except for where their next drink will come from) ex-pat characters, these borderline socialites fighting off ennui, of Hemingway's The Sun Also Rises do very little worth reading about and yet read you do. Blame it on the author's clean writing style or his choice of scenes, choosing to paint with poignant words almost documentary style clips of cultural happenings that still excites even in this television/internet era. Hemingway's spartan style and story, which could just as easily have been called And Things Happen should be a recipe for disaster, but instead, you have a classic."}, {"userName": "Thomas", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "Such a boring book. I get that Hemingway captures the decadence and dissolution of the Lost Generation. I get that his writing style brings to mind adjectives like \"sparse\" and \"blunt\" and \"elegiac.\" But I do not get how to find enjoyment from such a repetitive book that glamorizes violence, excessive drinking, outdated forms of masculinity, homophobia, and antisemitism. One could argue that Hemingway reports these toxic ideas as ideals of the time, but even then, he does nothing special with his story to rise above the trials of the 1920s. I also cannot forgive his monotonous and mind-numbing prose. As I said in another review, if an author without Hemingway's name tried to get by with this style of writing, I doubt they would succeed."}, {"userName": "Madeline", "userReviewDate": "Dec 06, 2008", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "Meh. I think I would have liked this book a lot more if something had actually happened. The plot doesn't really flow; it's just a bunch of events strung together that go like this: work a bit at a newspaper agency, waffle around Paris for ages, travel around France, argue, pine for some woman who I thought was a man for several pages because her name is \"Brett\", go to Spain, go trout fishing, take a nap, go to some bullfights, pine and complain some more, go back to Paris. In between every single one of those actions, add \"go to a cafe and get drunk\" and then you have the entire plot of The Sun Also Rises. I'm not even exaggerating. Don't get me wrong, I like Ernest Hemingway (see The Old Man and the Sea and A Moveable Feast), but he's definitely an acquired taste, and I can only read his books once in a while. Otherwise his style really starts to bug me. He writes very, very simply. Not a single word gets wasted, but this also means that his books have a pace that can best be described as \"plodding.\" For example: \"In the morning it was bright, and they were sprinkling the streets of the town, and we all had breakfast in a cafe. Bayonne is a nice town. It is like a very clean Spanish town and it is on a big river. Already, so early in the morning, it was very hot on the bridge across the river. We walked out on the bridge and then took a walk through the town.\" Show this excerpt to an unsuspecting reader, and they would probably think it was the opening of one of those What I Did On My Summer Vacation essays written by a third grader. The fact that it was not is probably what makes Hemingway a great writer, but come on. Would it kill the man to be a little more descriptive every now and then?"}, {"userName": "Luís C.", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "A poignant novel that evokes (among others) a problem of the thorniest: male impotence and painful consequences, here, drowned in alcohol.Drama in three acts, the sun also rises is its first branch in the night Paris Latin Quarter where cross Jacob Barnes says Jake (the narrator), American war wounded, unhappy hero constantly drunk, Lady Brett Ashley dubbed Brett \"damn good\", \"made that curves\"; Robert Cohn \"in the money in their pockets\", writer and ex-boxing champ and others who cheerfully toast of \"Neapolitan\" at Café Select \"and the Hotel Crillon\" to their little home.The nodes of anxiety weave inexorable.Alcohol, sometimes nasty, cruel fate its claws, while this \"bitch\" Brett, a divorce, to marry \"good old\" Mike, like this \"pimp\" and \"old boozer\" Jake (who wants it all be except \"aunt\") platonic, loving the then pushes, Cohn cheating on him with \"the dirty Jew\" and then takes to \"crush\" for a young bullfighter Pedro Romero whose \"absolute purity of line\" moves the excited.Love sometimes saves from violence red bull's blood but as Jake says the depths of despair: \"It's true, but it always ends there.\"An excellent novel that descends into the depths of human consciousness. Two little wrong notes homophobic and anti-Semitic, but they would not creepy place to be. And depressions is not clear, clear!Ernest Hemingway, American writer that marked the twentieth century of his writing, gained fame with the sun also rises.Marked himself by the trauma of the First World War on the Italian Front, alcoholic and insomniac, he in his early novels, cynical to the lost illusions, transposed his experience. In the last part of his life, this is an imprint of wisdom philosophy that permeates the beautiful: the old man and the sea and demonstrates that overcoming violence, the man can love."}, {"userName": "Lena Webb", "userReviewDate": "Jul 12, 2007", "userURL": "http://www.goodreads.com/user/show/184751-lena-webb", "userReview": "I gave this one star because I wasn't old enough to drink or really enjoy much of anything when I first read it, and I haven't read it again since.I'm almost certain I'd still hate it though."}, {"userName": "Ana Tijanić", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/62161919-ana-tijani", "userReview": "I pored toga što mi je u nekim trenucima bila dosadna, knjiga mi se poprilično dopala. Radnja romana prvih stotinak i više stranica izgleda otprilike ovako (dok ne pročitate nastavak pa shvatite o čemu je zapravo reč): Izadjemo iz hotela, odemo na zabavu, popijemo piće, odemo na večeru pa i tu popijemo još poneko. Vratimo se u hotel, popijemo piće. Onda odemo u Španiju, budemo u hotelu, večeramo i popijemo ... pa u krug. Sa druge strane, razumljivo zbog čega je to tako.Roman je o grupi ljudi koji su deo tzv. Izgubljene generacije, onih koje je Prvi svetski rat fizički i emotivno uništio i sada imaju problema da se vrate u normalu i da žive život kakav bi trebali da žive.Bret, Džejk i ostali likovi u ovom romanu putuju Evropom pokušavajući da se povežu sa ljudima, provode puno vremena na zabavama, ispijajući alkohol i uveravajući sebe da se dobro zabavljaju, ali na kraju uvek završavaju sami i razočarani. Početak osrednji, ali su zato poslednje stranice u mom srcu ostavile dubok trag."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Sep 23, 2012", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Sun Also Rises, Ernest HemingwayThe Sun Also Rises is a 1926 novel written by American author Ernest Hemingway about a group of American and British expatriates who travel from Paris to the Festival of San Fermín in Pamplona to watch the running of the bulls and the bullfights. An early and enduring modernist novel, it received mixed reviews upon publication. تاریخ نخستین خوانش: بیستم ماه اکتبر سال 2012 میلادیعنوان: خورشید هم‌چنان می‌دمد؛ نویسنده: ارنست همینگوی؛ مترجم: همایون مقدم؛ 1333، در 242 ص؛ چاپ دیگر: تهران، سازمان کتابهای جیبی، 1340؛ در 263 ص؛ مترجم: عرفان قانعی فرد؛ تهران، نگاه سبز، 1379؛ در 243 ص؛ مترجم: احسان لامع؛ تهران، نگاه، 1389؛ در 308 ص؛ شابک: 9789643515683؛خورشید هم‌چنان می‌دمد نخستین رمان درخشان ارنست همینگوی بود که ایشان را در مقام نویسنده‌ ای بزرگ و صاحب‌ سبک و یکی از برجسته‌ ترین رمان‌ نویسان روزگار خود تثبیت کرد؛ سرگذشت جذاب و در عین حال اندوه‌بار چند آمریکایی و انگیسی جوان و جلای‌ وطن‌ کرده، که در پاریس زندگی می‌کنند و برای گشت‌ و گذار به پامپلونای اسپانیا می‌روند، این رمان نقطه‌ ی عطف سرنوشت‌ سازی در شکل‌ گیری نهایی سبک منحصر به‌ فرد همینگوی بود. رمان بازگو کننده‌ ی رابطه‌ ی تلخ و عمیق و پیچیده‌ ی لیدی برت اشلی ثروتمند و پر زرق‌ و برق و جیک بارنز زخم‌ خورده از جنگ است و در کشاکش ورشکستگی اخلاقی، فروپاشی معنوی، عشق‌های ناکام و توهمات رو به‌ زوال، که مشخصه‌ ی آن سال‌‌های پر تب‌ و تاب بود، سرگذشت «نسل گمشده» را با قوت و زیبایی خیره‌ کننده‌ ای روایت می‌کند؛ در بیشتر نظرسنجی‌های معتبری که در سال‌های اخیر در جهان انگلیسی‌ زبان صورت گرفته است «خورشید هم‌چنان می‌دمد» به عنوان یکی از پنجاه یا صد رمان برجسته‌ ی قرن بیستم برگزیده شده است؛ . ا. شربیانی"}], "description": "Paris in the twenties: Pernod, parties and expatriate Americans, loose-living on money from home. Paris in the twenties: Pernod, parties and expatriate Americans, loose-living on money from home. Jake is wildly in love with Brett Ashley, aristocratic and irresistibly beautiful, with an abandoned, sensuous nature that she cannot change. When the couple drift to Spain to the dazzle of the fiesta and the heady atmosphere of the Bullfight, their affair is strained by new passions, new jealousies, and Jake must finally learn that he will never possess the woman that he loves.", "title": "The Sun Also Rises", "url": "https://www.goodreads.com/book/show/91878.The_Sun_Also_Rises__A_Scribner_Classic_", "average": 3.83, "cover": "https://images.gr-assets.com/books/1388799614l/91878.jpg", "reviews": 10546, "authors": [{"url": "https://www.goodreads.com/author/show/1455.Ernest_Hemingway", "name": "Ernest Hemingway"}], "type": ["Classics", "Fiction", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/91878.The_Sun_Also_Rises", "http://www.goodreads.com/book/show/5976496-the-sun-also-rises", "http://www.goodreads.com/book/show/3876.The_Sun_Also_Rises", "http://www.goodreads.com/book/show/46168.The_Sun_Also_Rises", "http://www.goodreads.com/book/show/3874.The_Sun_Also_Rises", "http://www.goodreads.com/book/show/1056767.The_Sun_Also_Rises", "http://www.goodreads.com/book/show/266466.Fiesta", "http://www.goodreads.com/book/show/3875.The_Sun_Also_Rises", "http://www.goodreads.com/book/show/18775315-the-sun-also-rises", "http://www.goodreads.com/book/show/4872205-the-sun-also-rises", "http://www.goodreads.com/book/show/10627024-o-sol-nasce-sempre", "http://www.goodreads.com/book/show/7201506-sunce-se-ponovo-ra-a", "http://www.goodreads.com/book/show/17876671", "http://www.goodreads.com/book/show/2165.The_Old_Man_and_the_Sea", "http://www.goodreads.com/book/show/46170.For_Whom_the_Bell_Tolls", "http://www.goodreads.com/book/show/10799.A_Farewell_to_Arms", "http://www.goodreads.com/book/show/4631.A_Moveable_Feast", "http://www.goodreads.com/book/show/4625.The_Complete_Short_Stories", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}