{"ratings": 1190, "userreviews": [{"userName": "Thomas", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "3.5 starsA cerebral and abstract homage to the art of personal narrative. Vivian Gornick skips over the fundamental techniques of creative nonfiction to address the craft's deeper issues: the importance of empathy, the construction of the self, and how this style differs from fiction and poetry. She spends a large portion of the book analyzing other writers' work and dissects how they use their \"selves\" to separate the situation and the story. As a creative nonfiction fanboy, quite a few passages made me sigh in pleasure. One quote I enjoyed about the fashioning of a persona through nonfiction narrative:\"To fashion a persona out of one's own undisguised self is no easy thing. A novel or a poem provides invented characters or speaking voices that act as surrogates for the writer. Into those surrogates will be poured all that the writer cannot address directly - inappropriate longings, defensive embarrassments, anti-social desires - but must address to achieve felt reality. The persona in a nonfiction narrative is an unsurrogated one... The unsurrogated narrator has the monumental task of transforming low-level self-interest into the kind of detached empathy required of a piece of writing that is to be of value to the disinterested reader.\"Overall, a thoughtful and thorough examination of the essay and the memoir. Those who want more direct instruction may feel disappointed with this one, because Gornick shares a few gems about writing and then applies them to a gamut of work. Still, her years of experience and deep appreciation of the craft shine in The Situation and the Story. Would recommend for those who want to get serious with writing personal narrative. A couple more quotes I loved from the book to end this review:\"In all imaginative writing sympathy for the subject is necessary not because it is the politically correct or morally decent posture to adopt but because an absence of sympathy shuts down the mind: engagement fails, the flow of association dries up, and the work narrows. What I mean by sympathy is simply that level of empathic understanding that endows the subject with dimension... For the drama to deepen, we must see the loneliness of the monster and the cunning of the innocent. Above all, it is the narrator who must complicate in order that the subject be given life.\"\"The idea of the self - the one that controls the memoir - is almost always served through a single piece of awareness that clarifies only slowly in the writer, gaining strength and definition as the narrative progresses. In a bad memoir, the line of clarification remains muddy, uncertain indistinct. In a good one, it becomes the organizing principle - the thing that lends shape and texture to the writing, drives the narrative forward, provides direction and unity of purpose. The question clearly being asked in an exemplary memoir is 'Who am I'? Who exactly is this 'I' upon whom turns the significance of this story-taken-directly-from-life? On that question the writer of memoir must deliver. Not with an answer but with depth of inquiry.\""}, {"userName": "julieta", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/896646-julieta", "userReview": "I absolutely loved it. I love Vivian Gornick because of her wonderful Fierce Attachments, and this is like taking a class with her. I recommend this to anyone who would like to write some form of essay or memoir, the way she helps you to read is just wonderful. I will look for some of the essays discussed here, but mostly I really appreciate her view on them, and she leaves me wanting to read more memoir, or more like read it differently, thinking of the possibility of writing.She speaks of how in a novel, the author finds many different voices who can create dynamic, and in a memoir it must come from your own self investigating. Wonderful book."}, {"userName": "Sherard H", "userReviewDate": "Jan 16, 2011", "userURL": "http://www.goodreads.com/user/show/4170626-sherard-h", "userReview": "Wait, Let Me Tell YOUThe Situation and the Story by Vivian GornickFarrar, Straus and Giroux, NYC2001\"Here's the situation, and the story, and you can like it, or get out.\"~Vivian Gornick.Just kidding. But she might as well have gone that far. The Situation and the Story by Vivian Gornick is a short novel about nonfiction writing, with a notable section on writing memoir. Gornick, who has taught M.F.A. classes concentrated in nonfiction and also in memoir, holds unique gems and insights into the world of writing nonfiction, most notably the eponymous difference between the situation in a piece, and its story. The situation is what the piece is about at face level (i.e., visiting one’s sister in Barbados), whereas the story pertains to the inner plots of the story (i.e., coming to terms with past wrongs). She produces a good sound byte or two, such as “it’s the absence of dynamism that keeps the essay static, stifles its growth from within.” The piece primarily focuses on, however, quoting and analyzing essays and novels that Gornick enjoys or finds impertinent to nonfiction. It is therefore, a fusion of many different author’s writings, and Gornick’s opinion on what works or doesn’t work in the passages that she chooses to highlight.I found this style to be as double-edged as the writing itself. At times, I thoroughly enjoyed the quoted pieces and therefore read Gornick’s notes with fervor. At other intervals, I found the pieces dull or impenetrable, and Gornick’s notes on them merely magnified in literary desiccation. Outside of her significantly separating the situation and the story, as well as suggesting a necessity for the narrator to be both what they are, and what they are not (“When someone writes a Mommie Dearest memoir—where the narrator is presented as an innocent and the subject as a monster—the work fails because the situation remains static. For the drama to deepen, we must see the loneliness of the monster and the cunning of the innocent. Above all, it is the narrator who must complicate in order that the subject be given life.”), Gornick offers little in advice or insight—she only blindly praises or scathingly disapproves. Perhaps the only way around this is to read the works in which she’s describing first hand, and then reread what she has to say, but as a stand-alone, I really don’t find her The Situation and the Story to be all that insightful."}, {"userName": "Ying Ying", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/38342050-ying-ying", "userReview": "The title contains the main message of the book. Vivian, who teaches memoir writing, tells us that there are two components to the personal narrative: the situation and the story. This differentiation is enlightening because we often focus on the situation: the facts and the dates, while ignoring what makes an essay truly remarkable: the human story, e.g. of love or loneliness. The book explores this narrative duo by interpreting brilliant pieces of memoir. Like the author, we should learn to better read such essays in order to become better writers."}, {"userName": "Stephanie", "userReviewDate": "Aug 25, 2011", "userURL": "http://www.goodreads.com/user/show/2784267-stephanie", "userReview": "If Aristotle tells us that a writer must evoke ethos, pathos, and logos in order to craft a successful persuasive essay, Gornick fails at the first two miserably. Based on the introduction, she does not establish ethos - proving to the reader that she is knowledgeable about what she is writing on. There are no prizes for cramming as many words into a sentence as you can and phrasing things in the most oblique way possible. After the introduction, I couldn't trust anything she said (thus pathos was out the window.)The rest of the book is a masterbatory exercise where she attmepts to explain her premise of \"the situation and the story\" (something I still do not understand and I read whole book.)Rather than providing information and then including an example essay for the reader to analyze themselves, Gornick opts to include excerpts of famous works (accompanied by synposis where necessary) and her own \"in depth reading\" of them. This feels self-serving and preening - particularly since she appears to be so proud of herself."}, {"userName": "Anton", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/2641050-anton", "userReview": "\"You cannot teach people how to write.\" Any book that says that, I'm going to have a lot of problems with. The sentiment is more a reflection of bankrupt ideas about teaching than a judicious assessment of what can happen when a group of people get together to talk about writing and are provided structure and guidance in getting their own writing done. But, yes, you can't make people good writers by lecturing at them, nor under any circumstances are they likely to morph into \"writers,\" whatever that means, over the course of a single semester.So, the fact that I'm STILL giving this book five stars (because, yes, Gornick, a writing teacher writing a book on how to write, does say you can't teach writing), speaks volumes to the persuasive power of this book. I'm not entirely sure how useful it's been in terms of my own writing, or how useful it would be to fledgling personal narrative writers (though I suspect I will assign it should I ever teach personal narrative again). It does raise questions of self-representation--through readings of a number of superior essays and memoirs, both widely acknowledged classics and lesser known gems--that I will be thinking about for a very long time. We are shown examples of what a working personal narrative looks like, and how it succeeds, but sometimes I wanted to hear more about HOW to do this in my own writing. But this book is not going to spoon feed you craft tips--that's just not what it is, and I don't fault it for that. What I was tempted to fault it for was a tone that sometimes felt authoritarian, though I'm not sure that word quite captures it. Her writing exhibits a control and focus that sometimes feels off-putting, but at its best is exhilaratingly clear and provocative.When I realized this, I realized also that Gornick's book might be better read as a personal narrative in its own right, and as such it rivals any of the masters of the form she cites throughout its pages. We see her in every sentence, in every observation; it doesn't matter if we agree with her commentary--it's enough to see it realized. The book has its own situation and its own story. The situation is writing truth in the wake of postmodernism. And the story is how a single-minded, self-insistent art can most powerfully betray the very subjects it seems to deny: loneliness, vulnerability, the fear of losing oneself."}, {"userName": "Katherine", "userReviewDate": "Jan 02, 2009", "userURL": "http://www.goodreads.com/user/show/1913975-katherine", "userReview": "Vivian Gornick’s tremendous book on the craft of nonfiction writing, The Situation and the Story, is an exemplary resource for writers. In this book, Gornick discusses in great detail the art of writing personal essays and memoir. However, the driving force behind this book is how no one can be taught how to write; rather, outstanding nonfiction writers look at themselves with reflective introspection in order to connect with their subject matter. It is this introspection that draws the reader in to the writing.\tGornick draws upon the writings of other writers whom she believes to be emblematic of both strong and weak personal nonfiction writing. Substantial portions of the book are devoted to directly citing the writing of other authors. Gornick then interweaves her own lucid and enlightening analysis through the text in order to provide a larger context of understanding for the reader."}, {"userName": "David E", "userReviewDate": "Aug 16, 2015", "userURL": "http://www.goodreads.com/user/show/43760790-david-e", "userReview": "Well worth the read - especially if you're writing a memoir. In The Situation and the Story, Vivian walks her audience through a number of successful memoirs, drawing connections between tone of voice and meaning. It goes a lot deeper but that's the main vein of thought. enjoyed her writing and learned a great deal about voice."}, {"userName": "Tim Baldwin", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/7721999-tim-baldwin", "userReview": "I think Gornick's final statements captures the way in which this book should be read. She writes, \"How does the writer of personal narrative pull from his or her own boring, agitated self the truth speaker who will tell the story that needs to be told? That is the question I asked, and in the course of answering, I trained my eyes on writing: how it got done, how it functioned, took its place in the world, helped alter literary history.\" With this in mind, we should approach the reading of this book as almost a primer it nonfiction writing. Within it, Gornick provides a great deal of examples of writing and how the writing got done, how it functioned, and how it took its place in the world. In doing this, she expects that we will go and train ourselves in the same manner that we too might be able to pull from ourselves the truth speaker who will tell the story that needs to be told.I only wish I understood this as her intent when I first started reading the book. Knowing this now, I'll go back and reread."}, {"userName": "Rena Graham", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/3861100-rena-graham", "userReview": "This has become one of my favorite books on writing personal narrative. It's a small book that goes deeply into exactly what the title suggests. I love Gornick's super-smart voice and the way she teases apart what happened to the writer vs what the writer was able to make of what happened. Her inclusion of V. S. Pritchett's quote, \"It's all in the art. You get no credit for living\" feels like the heart of this book. I also appreciated some of her more obscure literary references, like The Rings of Saturn by W. G. Sebald. 165 pages tagged many times, ready for a second read soon."}, {"userName": "Candice", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/20051223-candice", "userReview": "Excellent resource on memoir writing using many examples of other memoirs and essays to bolster her explanations, and gave me a new reading list fo further research. Type of book where you write down quotes. I will look forward to her other works as well, as she is a very insightful and intelligent writer."}, {"userName": "Sorayya Khan", "userReviewDate": "Nov 29, 2012", "userURL": "http://www.goodreads.com/user/show/2683005-sorayya-khan", "userReview": "So many ways to read, so many ways to think about writing, so many ways to teach reading and writing. Gornick's book explores personal narrative, what makes it work and why, and how to differentiate between essay and memoir, but she doesn't believe in craft--or rather, that craft can be taught. She takes her time with examples, inviting us to read with her before telling us why the piece works. One of her examples is Duras' The Lover which I've read and loved, but plenty of others, like Loren Eisley's All the Strange Hours -- about the Depression -- which I must now read. I'll have to discover on my own whether Eisley's book is that good or whether it's just Gornick's description of it: \"The book he actually wrote is remarkable because the writing welled up out of a place beyond the reach of conscious intent and it rescued him repeatedly from his own defensiveness.\" Some passages I'd like to remember:On reading writing: \"Writing enters into us when it gives us information about ourselves we are in need of at the time we are reading.\" \"How does the writer of personal narrative pull from his or her own boring, agitated self the truth speaker who will tell the story that needs to be told? That is the question I asked, and in the course of answering, I trained my eyes on the writing: how it got done, how it functioned, took its place in the world, helped alter literary history. To read out of one's own narrow but clarified need, I concluded, was to teach oneself better how to write--and how to teach writing.\"\"These writers might not \"know\" themselves--that is, have no more self-knowledge than the rest of us--but in each case--and this is crucial--they know who they are at the moment of writing. They know they are there to clarify in relation to the subject in hand--and on this obligation they deliver.\" \"Above all, it is the narrator who must complicate in order that the subject be given life.\"\"In nonfiction, the writer has only the singular self to work with. So it is the other in oneself that the writer must seek and find to create movement, achieve a dynamic.\"On Natalia Ginzburg's essay, He and I: \"He and I is an essay rather than a memoir because the writer is using her persona to explore a subject other than herself: in this case, marriage. If it had been a memoir, the focus would have been reversed. Ginzburg would have been using marriage precisely to explore--illuminate, define--herself. That would have been her intention. Her simple intention, I might add.\"\"Modern memoir posits that the shaped presentation of one's own life is of value to the disinterested reader only if it dramatizes and reflects sufficiently on the experience of \"becoming\": undertakes to trace the internal movement away from the murk of being told who you are by the accident of circumstance toward the clarity that identifies accurately the impulses of the self that Cather calls inviolable.\" On Geoffrey Wolff's The Duke of Deception: \"He is, rather, a man who sets out to document what the narrator of every work of twentieth-century literature has been at pains to demonstrate--that the task is to become acquainted with the stranger who lives inside your own skin, the one who answers when your name is called.\"\"Agnus Smedley also knows what the century knows: that we become what is done to us.\"\"In Edmund Gosse, Agnes Smedley, Geoffrey Wolff, we have a set of memoirists whose work records a steadily changing idea of the emergent self. But for each of them a flash of insight illuminating that idea grew out of the struggle to clarify one's own formative experience; and in each case the strength and beauty of the writing lie in the power of concentration with which this insight is pursued, and made to become the writer's organizing principle. That principle at work is what makes a memoir literature rather than testament.\"On W.G. Sebald's The Rings of Saturn: \"It is, I think, a measure of the bankruptcy of fiction that The Rings of Saturn is repeatedly called a novel.On teaching writing: \"To approach the work in hand as any ordinary reader might was the learn not how to write but--more important by far--why one was writing.\"\". . . But for me \"Get the narrator, and you've got the piece\" proved an irresistible guide to how essays and memoirs organize a mass of raw material. This was the perspective that, in my hands, yielded breadth of interpretation. The experience taught me something crucial about how we read.\""}, {"userName": "Leah", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/5355382-leah", "userReview": "I rarely write book reviews, but this book was so far from what it is presented to be that I felt I needed to let others know my observations about it. I enjoyed the first 26 pages (the introduction), but reading the rest of the book was an exercise in frustration. The introduction explains the difference between a situation and a story in a piece of writing - very helpful. I thought the remainder of the book would continue to explain these differences and how to know which one is which in one's own writing. I was wrong.The sections on essays and memoirs were mainly lengthy passages from the writings of others followed by Gornick's opinion on what was beautiful, effective, affecting, and worthwhile about the piece. My frustration with this format is that Gornick continued to use the word 'we' instead of 'I' to describe her own reactions, observations, and connections, thereby presuming that the reader felt the same way and interacted with the work in question in precisely the same way as she did. Presumptions of how the reader feels, thinks, and observes are rampant throughout this book. One should never write as if one knows how the reader understands and responds to a piece. This is a very basic rule of composition. If she had just had the courage to say 'I felt this...This is when I realized what the purpose of the story was...This is how I responded, etc' instead of trying to get me to believe that we shared identical thoughts and experiences, I wouldn't have disliked the book as much as I did. I still would have thought that everything beyond the introduction was unnecessary and not what the book purports to be about, but I wouldn't have hated it like I did.If it hadn't been for her frequent and lengthy copying of works by other authors, the book would have been nothing more than a pamphlet, which is what it should have been. All Gornick needed to show the importance of the situation and the story and the power of knowing the difference as a writer was the first 26 pages. The remaining pages were filled with the writings of others, grammatical errors, and presumptions."}, {"userName": "Bif", "userReviewDate": "Jan 30, 2012", "userURL": "http://www.goodreads.com/user/show/7279226-bif", "userReview": "Many reviewers here seem disappointed in this book, but I'm inclined to give Gornick the benefit of the doubt, because she describes something really abstract and hard to get at. I have read most of it; I should finish today or tomorrow.I'll try to summarize what I've read so far. Gornick claims that successful personal narrative requires that the writer form a useful persona from which to narrate, one that best serves to illuminate the subject at hand. The writer's ordinary everyday personality will not do and must be refined in relation to the point of the story. She describes several elements comprising this useful persona and provides examples from respected works to illustrate.It's like back in English 101 when you had to free write based on some prompt. Whatever you ended up writing down, taken as a whole, probably sucked to read; however, it may have resulted in parts that were useful or insightful, and if you dug them out and organized them well you might have had something worth offering to others. Gornick claims that the best personal essayists and memoirists perform the same process on themselves in order to craft a narrative voice worth listening to. In the best cases, she explains, that voice itself can serve as a metaphor for the point of the story being written.Unfortunately, the title is The Situation and the Story, and not The Considered Persona and the Story or something similar. She does explain her distinction between situation and story, because it is important to understand her point about persona, but she doesn't dwell on it long. If you're expecting a whole book about it, you'll be disappointed.The book explores something useful to consider. I'm not aware that anyone else had even attempted to write on the subject at the time it was published. It was not a waste of time."}, {"userName": "Laryssa Wirstiuk", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/1270512-laryssa-wirstiuk", "userReview": "Always happy to read books about the craft of writing, I was excited to absorb any wisdom that Vivian Gornick could impart. Overall, I think the concept of this book is wonderful - understanding the difference between what she calls \"situation\" (the setting or circumstances) and the \"story\" (the narrative voice that rises up from the situation) is important for any writer. However, she only devotes a few pages to directly addressing the concept. Where is the practical advice? How am I to benefit from this? She spends the next 75% of the book citing examples of both essays and memoirs that she has enjoyed. I THINK that she's trying to show how the authors navigate both situation and story, but I really would have liked for her to make these distinctions more explicit and then eventually show me how to apply these same techniques in my own writing. Reading excerpts out of context doesn't really help me. To be fair, in the concluding section, Gornick does admit that she doesn't think it's possible to teach writing. She believes she can only teach someone how to read. Why write a book on the art of personal narrative then? I think the book \"Tell It Slant\" is a better use of time."}, {"userName": "Literary Mama", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/7425886-literary-mama", "userReview": "The most influential book I have read on the craft of writing is The Situation and the Story by Vivian Gornick. This book, which is aimed at personal essay and memoir writers, completely redefined how I understand writing, how I read, and how I write. Gornick says that every piece of writing has a situation and a story—the thing that happened and the why, the passion, and the emotional insight that brought the writer to the page. Knowing the difference between situation and story, and being able to incorporate that knowledge into your work, is the key to great writing. Gornick guides the reader through examples from well-known and respected writers, and explains things along the way. Some of her examples get a bit long-winded, but her analysis of persona and narrator, the differences between essay and memoir, and the need for dynamism in your work are quite profound. I highly recommend this book for writers who want to take their work to a more authentic and thoughtful place.For more recommendations on books about craft, visit Literary Mama's September Essential Reading:http://www.literarymama.com/litreflec..."}, {"userName": "sarah gilbert", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/237974-sarah-gilbert", "userReview": "This book is rather like a very terrifying and elegant book report, with some artful pieces on either end that could serve as lectures, or essays in creative nonfiction literary journals. Subject: whether or not one can teach memoir writing. Situation: the death of the novel and rise of the memoir. Story: how one writer learned to explore the role of the narrator by workshopping memoir when they kept telling her, 'teach craft!'She looks so keenly into other writers' innermost selves; she judges, analyzes, shows her hand. Her story is finding the story in everyone else so she can see her own. It's going to be dark, isn't it?"}, {"userName": "Happyreader", "userReviewDate": "Mar 11, 2008", "userURL": "http://www.goodreads.com/user/show/901783-happyreader", "userReview": "The situation is context, circumstances, or plot; the story is the emotional experience that occupies the author; this book concerns recognizing whether or not authors are even aware of what truth they're trying to convey. Reading this felt like being present at someone's therapy session. She has an excellent point that good non-fiction writing relies more heavily on clarity of objective than on superior technical skills. Much better to read something with a clear point of view and OK writing skills than visa versa."}, {"userName": "Jessica", "userReviewDate": "Oct 24, 2009", "userURL": "http://www.goodreads.com/user/show/129974-jessica", "userReview": "What I love about this book is that in her capacity as guide to writing personal essay and memoir, Gornick does not leave her own writing shoes at the door (as seems to be the case with many guides). Instead, this often reads like a detective novel: How exactly does one craft a provocative essay? What do all compelling memoirs have in common? The only beef I have with this guide is that it would have been better to include entire essays/chapters of memoirs, instead of tiny bits interspersed with Gornick's commentary. Maybe in the next edition?"}, {"userName": "Cortney Cassidy", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/58930099-cortney-cassidy", "userReview": "hell yewrite with \"detached empathy\" about \"inappropriate longings, defensive embarrassments, anti-social desires\" as \"part personal essay, part social criticism...as a means of making some larger sense of things...a fusion of experience, perspective, and personality...use [yourself] only to clarify the argument, develop the analysis, push the story forward.\"\"a narrator who was me and at the same time not me.\""}, {"userName": "Sigrun Hodne", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/2650866-sigrun-hodne", "userReview": "Gornick has a strong voice, not one to always agree with, but a voice which makes you think. I especially liked the part on personal essays, maybe, if I ever am to write a memoir, I will find part two just as interesting."}, {"userName": "Tori-Lynn", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/14674385-tori-lynn", "userReview": "This was an exemplary guide to the narrative voice. Please read my full review!"}, {"userName": "david", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/67794375-david", "userReview": "Now I can right good."}, {"userName": "Fran", "userReviewDate": "Apr 21, 2009", "userURL": "http://www.goodreads.com/user/show/1198530-fran", "userReview": "Too much example from other books/writing and not enough original advice or insights."}, {"userName": "Steve Turtell", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/2829828-steve-turtell", "userReview": "Should be read by everyone writing, or even thinking about, or just reading a memoir."}, {"userName": "Eric Fitzsimmons", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/29452201-eric-fitzsimmons", "userReview": "\"The Situation and the Story,\" by Vivian Gornick Vivian Gornick's book on the art of essay writing was bound to get good marks from me, if only for its extensive drawing of examples from famous books and essays. Criticism — as compared to reviews — is a singularly rewarding experience, especially in the hands of a good writer such as Gornick. It can open your eyes to a new way of seeing a piece you have already read or turn you on to writers you have never experienced. In the course of this book I was turned on to Seymour Krim, I reopened an essay by Joan Didion, and I've hunted down a PDF of Edward Hoagland's \"The Courage of Turtles.\"  The point is theoretically to help in the writing of essays, but I was delighted to discover that what drew me in was perhaps the point all along. Gornick does not reveal until the conclusion her suspicion of studying \"craft\" (as it were) and the idea that one can teach writing at all. It's not how to write but how to read, critically and with an eye toward story, that drives The Situation and the Story. Gornick is asking the reader to dig deeper, discover what it is about Orwell's \"Shooting an Elephant\" that makes it compelling. \"Who is speaking, what is being said and what is the relation between the two,\" is a repeated admonition as you read into a story. Orwell going out and shooting an elephant could be an act of bravado, it could be an act of cruelty, but  in the way he writes it is an exploration of colonialism. What it means to represent a ruling nation among a people who aren't keen to have you there, and especially when you're not too keen on the idea either. What does that position do to someone? This comes through in his voice, in the way he describes \"the situation\" as much as in the actions he takes. Asking these questions will make such readings more enjoyable and meaningful, but should also inform your own work. The crux of this lies in a story about one of who students writing an essay about her grandfather — a man she has never met. The story isn't quite working until someone realizes that her learning about her grandfather is the situation, it provides a structure for the story, the actions on which the writer can hang meaning. The story, the meaning itself, is actually about the girl connecting with the grandmother. From there the essay starts to come together in a more satisfying way.  I am not convinced with all of Gornick's stances, her belief in the inborn gift of writing skill is maybe just said wrong or maybe it is magical thinking. And the way her distaste for post-modernism is slipped in does not serve any end except to let you know she is not a fan. But if you are interested in personal writing, either to write or read, this is a good place to start."}, {"userName": "Howard Cincotta", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/274906-howard-cincotta", "userReview": "Vivian Gornick’s book is a small masterpiece in a field awash in writings about how to write, become inspired to write, or both. For me, it belongs on a shelf alongside Francine Prose’s wonderful Reading Like a Writer.Gornick’s essay has two sections, one on the personal essay, the other on the memoir. She connects both with a thesis that is simple to state but fiendishly complex to execute: to tell a story truthfully, we must have a firm grasp of the self who is narrating the story. In other words, a true story needs a truth seeker. We may cherish unreliable narrators in fiction, but not in creative nonfiction.This process is remarkably difficult, Gornick argues, because we are fallible human beings who rarely know ourselves or our motives clearly, or else struggle to confront the dark corners of our character that we wish to avoid. Yet this is precisely the process that must take place to write a memoir or essay that is true to its subject and its teller. The task of the nonfiction writer, Gornick argues, is to organize a piece of experience that is pulled “out of his or her own agitated and boring self.” That self may correspond to the self of daily life or not, but whether “whole or fragmented, real or alien, intimate, or strange,” this nonfiction persona is the key to unlocking life and experience in ways that can be reached through no other means.One of the pleasures of Situation and Story is the selection of excerpts that Gornick offers, along with commentary that is both generous and shrewd. Using such essays as George Orwell’s “Shooting an Elephant,” Joan Didion’s “In Bed” (about migraines), and Edward Hoagland’s “The Courage of Turtles,” Gornick demonstrates how such writers penetrate their shell of easy rationalizations to arrive at greater truths about themselves, and therefore their subjects.In the second part, Gornick offers lucid analyses of a number of classic memoirs, some better known than others. She includes several examples of memoirists so divided and conflicted — Oscar Wilde’s anguished De Profundis or Loren Eiseley’s elegiac All the Strange Hours— that their works serve as dramatic evidence of their struggle, and failure, to reach deeply and find a core “truth teller.”As a workshop student, I especially enjoyed Gornick’s concluding anecdote, taken from her career as a writing teacher. The class puzzles over a reminiscence about a grandfather who deserted his rural family, feeling that something is off. Finally, they hit on the problem: the story isn’t really about the grandfather at all; it’s about the grandmother who was left behind to raise her family. The story immediately snaps into satisfying focus. Every piece of writing is an exploration, and sometimes writers know neither the direction nor the destination until they have begun the journey."}, {"userName": "Krisz", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/29756603-krisz", "userReview": "Oh well. This book was recommended to me but it was a waste of time. I mean, I didn't get to the end, really. All I got is some opinion which is hard to understand because VG doesn't intend to get her point across - she wants to write beautiful prose regardless of its understandability. Yuck.I hated the long (full) quotes - although some of them were quite good - but I think in such a book the writer should be able to show examples instead of pages long shorts.I got her opinion but I didn't get advice or anything that could help me write better.Don't waste your time and money with this book!"}, {"userName": "Brandi Amara Skyy", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/47979897-brandi-amara-skyy", "userReview": "2.5Meh. Opening chapter is definitely worth the read. i skipped over the personal essay chapter and went straight into the memoir section. i liked it, but not as much as the opening chapter. i copied this chapter so i could print it out and keep it on my writing desk. It's that good. And there's good stuff in the rest of the book, but not enough to keep me engaged or transform me in a way that i expect a writer to. That may have to do more with the fact that i just can't connect with Vivian as a writer or a person. Definitely worth a read through if your writing personal stories if only for the opening chapter alone."}, {"userName": "Lee Kofman", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/37486301-lee-kofman", "userReview": "This book was not as enjoyable as I expected it to be. I think it had much to do with the choices of creative nonfiction works Gornick made as her in-depth case studies of writing; most of them didn’t interest me that much. But so much sage writing advice! The central premise of the book – how to find what your story is really about – is clear and addressed in depth. So it was mostly a spinach-book for me – somewhat bland yet definitely nourishing. Here and there, though, were pages that tasted rather like herring. Or eclair."}], "description": "A guide to the art of personal writing, by the author of Fierce Attachments and The End of the Novel of LoveAll narrative writing must pull from the raw material of life a tale that will shape experience, transform event, deliver a bit of wisdom. In a story or a novel the \"I\" who tells this tale can be, and often is, an unreliable narrator but in nonfiction the reader must always be persuaded that the narrator is speaking truth.How does one pull from one's own boring, agitated self the truth-speaker who will tell the story a personal narrative needs to tell? That is the question The Situation and the Story asks--and answers. Taking us on a reading tour of some of the best memoirs and essays of the past hundred years, Gornick traces the changing idea of self that has dominated the century, and demonstrates the enduring truth-speaker to be found in the work of writers as diverse as Edmund Gosse, Joan Didion, Oscar Wilde, James Baldwin, or Marguerite Duras.This book, which grew out of fifteen years teaching in MFA programs, is itself a model of the lucid intelligence that has made Gornick one of our most admired writers of nonfiction. In it, she teaches us to write by teaching us how to read: how to recognize truth when we hear it in the writing of others and in our own.", "title": "The Situation and the Story: The Art of Personal Narrative", "url": "https://www.goodreads.com/book/show/222070.The_Situation_and_the_Story", "average": 3.85, "cover": "https://images.gr-assets.com/books/1386926447l/222070.jpg", "reviews": 165, "authors": [{"url": "https://www.goodreads.com/author/show/75060.Vivian_Gornick", "name": "Vivian Gornick"}], "type": ["Language", "Nonfiction", "Autobiography", "Writing"], "outlinks": ["http://www.goodreads.com/book/show/222070.The_Situation_and_the_Story", "http://www.goodreads.com/book/show/177333.Fierce_Attachments", "http://www.goodreads.com/book/show/22929524-the-odd-woman-and-the-city", "http://www.goodreads.com/book/show/301763.Approaching_Eye_Level", "http://www.goodreads.com/book/show/11059976-emma-goldman", "http://www.goodreads.com/book/show/267288.The_Solitude_of_Self", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}