{"ratings": 342, "userreviews": [{"userName": "KAT ♕ Kitty Kats Crazy About Books ♕", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/6245313-kat-kitty-kats-crazy-about-books", "userReview": "MY REVIEW  can also be found on my blog: \nKITTY KATS CRAZY ABOUT BOOKS\n SURVIVING TRACE:  Is a full length romance novel and the first book in ‘Surviving Time’ series by new to me author Calia Reads. Spoken in ‘Dual Perspectives’ Where to start!! First off this was definitely a 5 star read for me, it's not something I would generally one click and read but I am so glad I took that leap, and gave it a shot, I read this in record time, from front to back I was lost within the pages of this book, I didn't want it to end, And like the rest that have read this I can't wait for the next instalment!!I finished this a few days ago and still it’s sitting forefront in my mind.Straight away we’re thrown into a dream Serene is in, a man laying on her lap dirt and blood smeared over his face, she’s holding a gun to her forehead she tells the man that she loves him as she pulls the trigger. Serene Parow is happily engaged to Will, a guy she met during her second year at Penn State. Planning the big day and just happily being in love. She also owns a fairly new antiques business with her bestie Liz.Liz drops off some boxes that she came across at a flea market which Serene riffles through and comes across an old black and white photograph dating back to 1912 with four men standing in front of a gorgeous mansion like building, she’s inexplicably drawn to one man particularly in this photo and swears he’s the man that was in her dream. She can’t stop gazing at it. thinking about the men in the photo, what their story is with only the date and E, L, E, A which she assumes are each mans initials. She knows it sounds crazy even to herself but she gets a strange sense that these men are important to her, to an extent that she’s even met them.\nA few days later without warning she’s catapulted back in time, and she comes face to face with the man in the photo that she was so intrigued with. It’s April 12, 1912 and she is the wife of Etienne Lacroix, they have been married for three years. She has the same body, the same first name of his wife, they actually look identical, but their personality traits could not be any different. The chemistry between Serene and Étienne was off the charts, a too and fro as she tries to adapt to life in 1912 and he tries to unravel what has happened to his wife that he didn’t get along with, to now wanting to spend every waking moment with her. \n\n This connection we share is undeniable. It transcends time and all logic. Nevertheless, it's there. Utterly owning us and pushing us out of our comfort zones until all we have left to is to cling to each other. \nWhat makes this story even more special though is that when it came to trying to convince Étienne that she is not of this time and that she has time travelled, it didn’t take much for him to sit back and actually believe her. Now it's a race against time to try and figure out why she's there, and how to get back to her own time.\n If you were given the choice to stay or go back, what would you choose? \n* Teasers used are off the authors facebook page *"}, {"userName": "warhawke", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/25494927-warhawke", "userReview": "Genre: Time Travel RomanceType: Book 1 of Surviving Time seriesPOV: First Person – Female (Partly dual)Rating: Serene Parow had a love affair with the past. As owner of an antique store, she was drawn to anything old and laden with history. She was at a good place and completely in love with her fiancée Will Myles but the discovery of an old photo dated 1912 ripped her from everything she knew and into the world of Étienne Lacroix, the mysterious man on the photo.\n She’s gorgeous, there’s no getting around that. But I’m drawn to her intelligence and smart mouth. She’s unpredictable in every way.\nI very rarely like book heroine because they're often lacking certain aspects compared to the hero. That's not the case in this book. Serene was the hero who carried the story with strength and grace - well her version of grace :p\n Being alone with the man is akin to being alone with a master manipulator. I don’t know what he’s going to do, how he’s going to react.\nÉtienne was everything a hero should be. He was smart, ambitious and protective. What I love the most about him was his slight uptightness that made him endearing.I started this book not knowing what to expect. There were some parts earlier that felt slow but it ended up consuming me completely.\n But if I’ve learned anything from my journey through time, it’s that nothing is impossible and everything is a lie.\nI love every moment of the past scenes. As someone who love old objects and architecture, I could easily relate to Serene's passion. Through the author's words, I lived the era and walked through the hallways of Belgrave.\n “You think you belong in another time. Belong to another man. But maybe you have it all wrong. Maybe you belong here, with me.”\nThe storyline was captivating, I couldn't put it down. There were quite a number of characters to keep up with but the mystery, suspense and angst (and sexiness) propelled the story from the first page to the last.\n “No matter what happens, I am yours,” I whisper fiercely. “And you are always mine. Nothing can change that.”\nThe Surviving Trace is an evocative tale of love that transcends time. It would appeal to readers looking to be swept by a time travel romance.🔸 ⏳ 🔸 . . . (F)BR With Twinsie CC . . . 🔸 ⏳ 🔸For more reviews/reveals/giveaways visit:"}, {"userName": "Hulya Kara Yuksel", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/32793174-hulya-kara-yuksel", "userReview": "OMFG WOW! This book literally blew my mind...I need a minute to catch my breath...I need a very long sleep...Also I must read epilogue again or maybe like 5 times more...WTF had happened?😐😐😐Full review to come later / maybe / not sure about it because I have no single fucking idea what to say right now! I'm speechless..."}, {"userName": "NMmomof4", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/24665574-nmmomof4", "userReview": "[- Does  have cheating (see above)- Does Not have a descriptive sex scene with OW/OM-  Does have both the h and H pushing away-  Does have a separation between the h and H-  Does Not have abuse - Does Not have a HEA ending (hide spoiler)]"}, {"userName": "Jennifer Kyle", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/9916227-jennifer-kyle", "userReview": "4.5 Stars\nSerene Parow is very happy owning an antique shop with her best friend, Liz and is looking forward to setting a wedding date with her fiancé, Will. That is until the day her partner uncovers a box of photographs and memorabilia from 1912. Serene is extremely drawn to one photo in particular. It’s of four men sitting in front of a southern plantation. The intrigue and mystery goes one step further when she connects a vivid dream she had prior surrounding one of the men in the photo. Okay, I’ll try to explain. So, the story really gets interesting when Serene finds herself at the planation in the photograph and married to the man from her dream! Calia Read makes the time traveling aspect believable and at times I found myself dying to get back to the hero of the past! There is mystery, connections, and a few plot twists. The story is very intriguing. The characters were all very likable and the heroine was as solid as the hero in this tale. The couples' fall into love was believable and very well written. Overall, I enjoyed this long awaited story. I was left with a few questions. However, that may have been the done intentionally by the author. If not I would like to follow what happened to the other person during this time period. Look for this book to release on May 21!! **ARC provided in exchange for an honest review**"}, {"userName": "Nazanin", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/39893246-nazanin", "userReview": "3.5-3.75 StarsI love this author’s works and read some of her books but they were mostly dark. I don’t like time travelling but still I wanted to try this one because you know it’s Ms. Read we speak about. So I read it and I was loving it! Until I read the last chapter! WTH?!?! I don’t know if this book is a standalone or not (all of the books I read by her were standalone) but this one didn’t end with HEA or even HFN! It just ends!!!! I don’t call it surviving time! Think about it, you have a perfect life at the first and in the end you have nothing!!!! Really WTH?! I just can hope it wouldn’t be a standalone and in the next installment we can find what we want! Told in dual POV (mostly the h, and except for the epilogue), 1st person. It’s well-written and a bit slow. It’s the first installment in the \"Surviving Time\" series, I can’t tell you if it’s a standalone novel or ends on cliffhangers. Overall, I enjoyed it a lot and hope you like it as well!"}, {"userName": " Sonya ♕Chatterbooks book blog♕", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/27885126-sonya-chatterbooks-book-blog", "userReview": "“ Love is your hoarse cries. Its your anger, it’s your sadness. It’s your happiness and laughter. It’s everything wrapped up into one.Love is one of the heaviest words to exist.It’s a miracle anyone survives it.It’d be a wonder if I survive it.\"  WOW!I didn’t think it would’ve been possible for this author to render me speechless, but damn it she did!! Im still trying to figure out what I just read but if I’m being completely honest wit myself, it’s the final chapter that did me in. I’m confused, happy, sad, and mournful at the same time. How is that possible? How can I feel all of these emotions at the same time and be content? I simple call it the power of words. Have you ever wonder what it would be like to live in another lifetime? To be a part of history and witness some of the greatest mark on the world? I’m sure we all have and Serene Parow is no different. Being a lover of antiques and everything historical, Serene has always loved the classical time error and the year 2017 has made no difference to her. When she comes across an old photo from the year 1912, there’s an automatic pull to the strangers who are in the picture. Particularly one important. \nAs time goes by, Serene realizes that her finding the picture was no coincidence and that she was meant to help in some way or the other. But by doing that, will she alter the future and change everything for the better or make it worse? How far will you go to protect someone you love? Does time or distance really matter?   “ You think you belong in another time. Belong to another man. But maybe you have it all wrong. Maybe you belong here with me”. I really loved how different this story was. I knew all about the time traveling and if I’m being honest, that is what drew me to the story in the first place. It was refreshing in my eyes, classy, heartbreaking and it sucked you into this time era that made you fall in love with it all over again. These characters were amazing but it was their journey and refusal to quit is what was awe inspiring to me. \nAs much as I loved everything else about the story, I just couldn’t for the life of me get over that final chapter. I felt like as deflated balloon with bittersweet feelings. I guess I’m still trying to process everything and figure out my true feelings on it but at this point, I’m happy and sad at the same time. If you’re in the mood for something completely different, I would highly recommend this one. The writing is flawless, the characters will make you feel, and your heart will quite possibly get bruised in the process but I think it’s worth it. To me, the most beautiful things are sometimes the most painful ones."}, {"userName": "Ashley (5171MilesBooks)", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/25226945-ashley-5171milesbooks", "userReview": "Read this full review and more at: 5171 Miles Book Blog.My first Calia Read book was a hit! First of all, I just have to brag on this woman because I think I might have a crush on her. ;) I had the privilege of chatting with her on Instagram while I was reading this book and she was incredibly nice and personable. I've always been amazed by the strength and resilience of military wives, not only is Calia one of these women, but she's also a mother of five! How she manages to write books on top of all she has to do blows my mind. Can you say Supermom? The Surviving Trace's blurb sounds fascinating and I highly doubt anyone will be able to resist its temptation. I sure couldn't say no! Time-travel Romance is one of my favorite sub-genres and I get so excited when I am able to venture back to a new time period while reading. I love how Calia chose to write about a time I haven't read a load of information about. One of my favorite things about The Surviving Trace was the photograph putting the whole story in motion. Just like Serene, I'm drawn to old photographs and I find myself creating stories for the people in them and wondering what kind of lives they led. This story starts off with a dream about a photograph Serene finds in an old album. Apparently, this aspect of the story had a huge impact on me while reading, because I was awoken by a dream so vivid, it felt real about this very book. I always know I truly love a novel when it shows up in my dreams!I was dazzled by Calia's writing and her perfectly immersive setting. I felt as if I was actually in the giant home with Serene and Etienne, feeling the stifling South Carolina summer of 1912. And Etienne, oh Etienne. Holy wow, I loved this man! I love the guys who are a little cranky and tough to crack because they are the most rewarding characters to read! Serene was the perfect woman to counter him, though they were similar in many ways. She was strong-willed and determined, letting nothing prevent her from making an impact on whichever era she resided in. I have to say, I normally can do without love scenes in books because I'm more interested in the story than getting jiggy with it. ;) I read for emotion and connection and I was absolutely rewarded with these things, but I actually felt the love scenes were essential to the story. The passion between the characters was simply the best I have ever read - the love was tangible and realistic. My heart felt heavy and consumed with the way the characters were written.I adored this book and didn't want it to end. I'm so relieved to hear there will be more books to come because I need more of these characters like I need air in my lungs. Though this was my first book by Calia Read, I will continue to pick up her books and can't wait to finally read Unravel, along with the rest of her previous works! Her storytelling is stellar.Be sure to pick up this beauty today!I can't wait to hold the paperback in my hands - this cover is EVERYTHING."}, {"userName": "♥ Jx PinkLady Reviews ♥ ", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/16496589-jx-pinklady-reviews", "userReview": "'The Surviving Trace,' is a mysterious story involving a heroine, a hero, and a fiancé who, for me, became somewhat irrelevant as the story is mainly focused on the time travel element. Serene has a fiancé in present day but very quickly into the story she travels back in time to the era of 1912 where she has a whole different life with a man called Etienne, a man who is her husband and, it would seem, he's not terribly fond of her which is where a hate to love relationship begins to develop. A mystery unfolds along with the probable reason Serene was sent into the past and it is this aspect that I enjoyed the most, along with her developing relationship with Etienne. I thought this would be a story that I would love completely, a story that would grab my emotions but sadly this was not the case. For my personal taste, some parts were overly detailed and did not add to the development of the story and parts of the dialogue did not feel 'diologue-like’ to my ear. The term TIME TRAVEL(ED) was used a lot and I know it was needed because that's what the heroine did but sometimes, especially towards the end, I would have liked her to express it differently, to the extent I started to think of alternatives as I was reading. Perhaps the biggest stumbling block for me and maybe the thing that made all the afore mentioned magnified and stopped me falling in love with the narrative was the fact that I didn't fully buy into the time travel element and I think this caused major problems to my enjoyment as this is where all the angst and character emotion was driven from. I've thought a lot about why I didn't connect with this story and the characters because I love, 'The Time Travellers Wife,' and I see many readers are loving, 'The Surviving Trace,' I'm definitely firmly in the minority so maybe if I read at a different moment in time, I'd feel differently, maybe it was the wrong book at the wrong time or maybe this trope is not generally suited to my tastes. I really enjoyed the main protagonist’s chemistry, their banter, their hate to love relationship and I really liked the mystery element so if you enjoy time travel stories with a contemporary romance feel then this story is definitely worthy of a read. Contemporary Romance/Time TravelAdvance copy provided **"}, {"userName": "Christie«SHBBblogger»", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/6650940-christie-shbbblogger", "userReview": "[When she returns home, she realizes that nothing is the same for her, and she needs to be honest about her feelings with Will. She decides to tell him about traveling back in time, fully expecting that he's going to trust and believe her insanely crazy sounding story. When (naturally) he starts to worry that she's having a mental breakdown, he calls her family out of worry for her. What anyone would do for someone they love. She turns blame onto him for reacting that way, and dismisses their relationship, and her guilt. A small part of me understands why Will called my brothers and that he’s coming from a place of love and concern. But a bigger part feels betrayed. It’s as if he took all the trust that had been built between us throughout the years and crushed it with one hand. I have a feeling that when I walk out of the front door, I’ll also be walking away from Will.How IN THE WORLD did HE betray HER? He did absolutely nothing wrong. If anything, she is the one who betrayed in their relationship. I'm not going to lie, this resolution to her inconvenient engagement was very frustrating. But that brings me to another related point. In comparison, when she was stuck in the past, and she decides to use her knowledge of the sinking of the Titanic in order to prove that she's from the future, that was another thing that really didn't make sense to me. This is actually a good way for her to prove herself, since she knew very specific facts about the disaster that contradicted what the newspapers were originally reporting. However, when she insists to Etienne that the newspapers are wrong, and spouts off a bunch of facts to him about what happened...he suddenly automatically believes her. Wouldn't it make more sense if he believed her after what she was saying was proved to be right? Just because she's giving him this story and says that it's all true....that means it's true? Crazy people say things all the time with confidence, but normal people need evidence to believe a story like hers.  (hide spoiler)]"}, {"userName": "Calia", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/5918467-calia", "userReview": "Follow me on Wattpad to read the first couple of chapters of The Surviving Trace before release on May 21st!! I just posted chapter 2! This will be updated weekly until release day!!!https://www.wattpad.com/user/ailac5"}, {"userName": "CC", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/12625026-cc", "userReview": "4.5 Stars!Serene Parow seems content in her life with an antiques business and a fiancé that wants to set a wedding date until one day she becomes distracted by an old photograph dated 1912. Always interested in history, Serene begins to imagine what life was like in that era and particularly for one unknown man depicted in black and white. As she searches for answers, the truth takes Serene on an unexpected journey.\n“Like everything else from this time, my mind whispers, you’re touching a piece of history.” \nWhen Serene is transported back in time, she is confronted by the mystery man that has consumed all her thoughts. Seeing him in the flesh is a shock, but as she pairs the face (and body) with a name, she discovers much more about what makes Etienne tick. In trying to determine her purpose, Serene realizes the complexity and instability of her situation.\n“His eyes dip toward my lips for a millisecond, then he moves toward me. I’m almost confident he’s going to kiss me. And if he does, I know I won’t stop him.” \nTold mostly from Serene’s perspective, experiencing the level of unease and curiosity she feels is effectively conveyed and I felt immersed in her transition and the era’s history. Serene is a strong, competitive character that is compelled to do the right thing and ultimately trust her instinct and heart. \n“This connection we share is undeniable. It transcends time and all logic.” \nBetween Serene and Etienne the chemistry is combustible and the push-pull dynamic they share adds to the building sexual tension. Etienne infuriates Serene yet the more she gets excited, the more intrigued he is. While Etienne slowly reveals more about himself, he becomes sexier and completely won my heart.This book offers an interesting premise with time travel. Due to the theme, some things just are inexplicable and it adds mystery and romance to the storyline rather than casting doubt. Throughout reading, it made me think of the possibilities, choices and fate these characters experienced. With endearing characters and a convincing narrative, Calia Read pens a compelling and thought-provoking story. The Surviving Trace would appeal to those who enjoy mystery with romance.*An ARC was generously provided in exchange for an honest review.**This was a (F)BR with Twinsie Hawkey!*For more reviews/reveals/giveaways visit:"}, {"userName": "Wendy ⏃: ✦●•CCBH Blogger•●✦", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/6135885-wendy-ccbh-blogger", "userReview": "5 STARS!\n📷: Taken by my bestie boo, Brie 💜I just finished the most incredible book! Ugh, how can I even function right now... What is life!?I really don't even know where to begin. Let me first and foremost thank \nChristine from Shh Moms Reading\n. Once again she reached out to me, encouraging me to take a chance on a story and since the first recommendation from her, she hasn't steered me wrong. Calia Read is a new author to me and The Surviving Trace was the first book I've ever read by her and let me tell you, she did not disappoint! She's a lyrical writer. At times it felt like poetry and was just filled with beautiful lines throughout the entire story. I will be devouring everything this author writes from now on.The Surviving Trace was set both in the present and the past. It was a timeless love story filled with intrigue, passion, and mystery. It consumes you from the very first page to the last! You're left with so many questions and the desire and need to hold your breath until the next book. I feel like I'm experiencing a heartstopping adrenaline rush! Everything about this book was perfect, especially the characters! From the cover to the intriguing synopsis, The Suriviving Trace had me in its clutches even before the story captivated me completely with just a few chapters!*AN ARC WAS KINDLY PROVIDED IN EXCHANGE FOR AN HONEST REVIEW.*"}, {"userName": "Pavlina Read more sleep less blog❤❤  ", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/6603203-pavlina-read-more-sleep-less-blog", "userReview": "It sounds amazing!! ❤️"}, {"userName": "Yasmin", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/61560493-yasmin", "userReview": "Why have I never heard of this author before? Where have you been hiding, Calia? WHERE?!You guys, I don’t even know what to say about this book. It’s so unique and riveting, I want to read it all over again! I was spellbound by this phenomenal story.The Surviving Trace has some amazing characters that you’ll love instantly, an intriguing storyline, and such captivating writing.I’m so glad I took a chance on this one because it was definitely worth it. A must read! Expect all the feels, especially when it comes to Étienne. *sigh* I love him!"}, {"userName": "Dilek VT", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/49572641-dilek-vt", "userReview": "I just listened to the whole story of Book 1 from my friend Bookylicious on the phone and here's what I think:1. If the so-called ending of this book is a cliffhanger and if the story of the same characters is continuing in Book 2 in the series, then, everything is fine. Very interesting and worth reading...2. If the second book in the series is about different characters and the ending of this first book is the final ending, then, stay away from this book because that ending will infuriate you, I am sure! It is a \"WTF#$@&%*! Are you kidding me?\" kind of ending, believe me... I just asked the writer about Book 2 and as soon as I learn about it, I'll be posting the news here. Until then, let's wait if you ask me..."}, {"userName": "Talon", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/35885066-talon", "userReview": "\"Truth be told, I think I've always been slipping away. I've been walking the tightrope between all the yesterday and tomorrows for a long time. At some point, I was bound to fall. In a few seconds, everything will be over.\"\nWell...shit. Just...shit.I am going to break this review down into three different parts. That's the easiest way that I can think of to do this because I want to gush so much about these three things in particular that my fingers might not ever stop typing. Writing, plot, and characters.The writing:Calia has this way with her words that most authors do not have. I say that with complete confidence as a reader and as a reviewer. The distinction between Calia and other authors is her clarity and her vividness. Her settings, her characters, and events- they're all so clear and vivid to me because she's so careful with her words and structures. It's captivating, actually. I can't look away from her books even if I tried. With The Surviving Trace, Calia so strategically crafts a time that she doesn't stray from or get lost on. She writes what she knows about the present world and then she never strays from the other time frame that takes place during this story. There are no slip ups, no mishaps. You don't get confused for even one second. The words within these pages flow so smoothly they put melted butter to shame. \n\"Love is your hoarse cries. It's your anger. It's your sadness.It's your happiness and laughter.It's everything wrapped into one.Love is one of the heaviest of words to exist.It's a miracle anyone survives it. It'd be a wonder if I survive it.\"\nThe characters:It was so fascinating seeing and feeling Serene and Etienne together. It was all consuming and overwhelming. There is really no other way for me to put that. I felt like I lived within these characters. Their pain- was mine. Their happiness- was mine. And I didn't just feel that with them, I felt that with Calia's secondary characters too. They all had a purpose and a specific place and Calia executed them all so wonderfully. The plot:WOW! I just loved this plot line. That is all I can really say about that. I can't say much but I still wanted to touch on it. When authors take their time and don't force a book- it all comes together wrapped like a nicely package present. And The Surviving Trace is the epitome of this. I felt exhilaration, angst, and excitement. I felt longing for characters that, as a reader, I haven't felt in SO LONG. And for that, I am forever indebted to Calia Read."}, {"userName": "Butthisbook", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/21914278-butthisbook", "userReview": "Pretty damn incredible!!I always find it really hard to review books that I really love. And it’s no different with this one. I want to scream at the top of my lungs for everyone to read this story. The Surviving Trace was nothing like I’ve ever read before. It had me hooked from the very beginning and even more so the moment Serene time travels to the year 1912.Serene, passionate for history and old relics, owns an antique store with her close friend Liz. She is in love and newly engaged to Will, who she met in her second year of college. Life is good and just as it should be until she comes across an old photo of four men that’s dated back to the early 1900’s. This is where things start to get really interesting. The moment Calia Read took me back to 1912, it was as if I stopped reading and watch everything unfold before my very eyes. I wasn’t reading what was happening anymore but rather I felt like I was watching a movie. The way she described everything and everyone, felt like I was right beside Serene experiencing that era right along with her. I had a clear image of how everything looked. If that isn’t a testament to the greatness of this author’s writing, I don’t know what is. The chemistry between Serene and Étienne… Étienne, ÉTIENNE!!!!!!!!!!!! God, I appreciate a good, strong, male name. It suited him perfectly. Now, where was I? Oh yes, the chemistry between these characters was off the charts. The side characters were just as amazing. Gahhhhhhhh I was to say so much more, but I don’t want to accidentally spoil anything. Again, Calia Read delivers a unique and addicting story. I can’t wait to read more."}, {"userName": "M. ", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/38974361-m", "userReview": "5 STARSJust finished reading this beauty and wow, what an incredible adventure of love and intrigue it was! The Surviving Trace had me completely captivated from page one. This story, the time period, the characters, the mysteries... everything! Such a ride! It's been a while since a book had me glued to my kindle like that! I would highly recommend to literally anyone. In fact, you, yes you person reading this, you'll love it. Go buy it now. Trust me on this. Also, side-note: Etienne... swoon. Now I shall be waiting (im)patiently for the sequel to come out! 😍"}, {"userName": "Christine (Shh Moms Reading)", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/5334715-christine-shh-moms-reading", "userReview": "WOW! You know what I love about this author... that she takes her time writing and invests so much time and effort into doing the research behind her book so that us readers get a complete masterpiece when all is said and done.And that is what The Surviving Trace is... a masterpiece.It's no secret that I love time travel because hello—Outlander—so when I saw that Calia was writing a time travel romance, I knew from the get-go that I was IN!Unfortunately I won't be revealing much of the story as I feel that you have to experience it for yourselves but I will say this:I love a strong heroine... someone who is confident and strong-willed and no matter the era—won't back down. Serene was so special and unique in this way being a time traveler from the present going into the past where women were more submissive and meek. Watching her keep everyone on their toes was an experience in itself and while Will was a good guy for her in the present... oh Etienne... experiencing her no-nonsense husband fall for her in the past was something to behold in itself—their relationship truly standing the test of time was magnificent. Calia writes eloquently and delivers a romance that is breathtakingly beautiful—from the imagery specially crafted to touch upon the reader's senses, to the characters and their bond that never died, to a story that is unique and will get you excited to read more because yes, there is MORE to this series.I have so many questions about things that were left unanswered. I loved the connection to other books written by this author. And at the end of the day, I am just excitedly waiting for more (I will try to be patient with this but I NEED TO KNOW ALL THE THINGS!!)"}, {"userName": "Shayna", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/7305727-shayna", "userReview": "\"Will I ever have the chance to own your heart and body?”\nWhat an unexpected GEM of a unique romance! I feel like it’s been AGES since I’ve read a Calia Read romance, and yet after diving headfirst into THE SURVIVING TRACE, it feels like just yesterday when I absolutely FELL IN LOVE with her storytelling. As unique and special as this story was, it still had this author’s known strengths woven in between each and every single page. Only this author could take a genre like Time Travel Romance, one that I’ve never read or never been interested in, and make me crave nothing BUT that. This beautiful and breathtaking story takes us on an emotional journey into the past, present, and future. It’s a story of hope and redemption. It’s a story of love conquering all. It’s about personal growth and acceptance. THE SURVIVING TRACE is nothing like you’ve ever read before. You could try to compare it to others you’ve read, but in the end, it has Calia’s unique stamp all over it. This is a VERY special read…a read laced with beauty, heart, and hope. It will keep your mind sharp, your body at the edge of your seat, and your heart in your throat. I absolutely LOVED IT!"}, {"userName": "Tianna", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/17755257-tianna", "userReview": "Edit Dec 8, 2015.... seriously, Calia. What is this about? I need itWhat is this about???!!!!I Need to know!!"}, {"userName": "Rebecca Wash", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/24850092-rebecca-wash", "userReview": "\"Only the water will feel your heartbeat and choppy breathing. Only the wind whistling through the trees will see you reach for him. They'll keep this secret.\" This book consumed me completely from the time I opened it until I finally finished. Every free moment I had I was reading and even when I didn't have a free moment I was reading. I read while I cooked dinner and I read while I was waiting for my daughters to get in the car after school. Yes, I was that obsessed. I want EVERYONE to read this book. \"You think you belong in another time. Belong to another man. But maybe you have it all wrong. Maybe you belong here, with me.\"*Sigh* One of the reasons I loved this book is because I'm like Serene, I love history. Give me any book that has history in it and with any kind of romance mixed in and I'll devour it. It is a book about time travel. So it takes place in present day and in 1912. I loved this book, guys! Loved. The romance is epic. The tension between the two main characters are smoldering. The action is great! I was biting my nails. All I can say is read this book. Oh! And I have to mention Etienne! whew! That man!!! He is just so many things that I adore! :)"}, {"userName": "Emily Snow", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/12484275-emily-snow", "userReview": "I didn’t think anything could top Unravel (one of my top ten favorite books of all time) but The Surviving Trace is epically perfect. Admittedly, I didn’t read the blurb before I went in—if Calia wrote it, I know it will be good, and that cover is gorgeous—so I was surprised when I discovered it’s a time travel romance. Pleasantly surprised. From the very first page, I was hooked. Calia has this incredible way of drawing her readers into the story and making us feel everything. I felt like I was in 1912 Charleston. I felt like I was walking the halls of Etienne’s home, Belgrave, right along with Serene. And most importantly, I felt all the emotions between Etienne and Serene—from the initial hatred and distrust to the moments that ripped my breath away. This book, y’all … this book. It’s smart and romantic, twisty and mysterious, and I couldn’t put it down. If I could give it ten stars, I would in a heartbeat."}, {"userName": "Bex | TotallyBex.com", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/37774641-bex-totallybex-com", "userReview": "★★ 4.5 stars! ★★I’ve been a fan of Calia Read’s writing since I read \nUnravel\n (one of my top 10 reads in 2015!). Her writing is gorgeous, she weaves spectacular tales, and she loves to throw in all the twists and turns.What starts as a vivid dream quickly turns into reality for the heroine of The Surviving Trace, Serene. Always a lover of the past, Serene owns an antique store with her best friend. She discovers a photograph of four men taken in 1912—one of which is the man from that unforgettable dream. A few days later she is transported back in time and finds herself married to the man from her dream/the photo.This story is purely immersive and impossible to put down once the story picks up steam. The hero and heroine are fantastic and the storyline is so unique. It’s a suspenseful mystery and an angsty romance all in one. Read has once again given us a well-written, passionate, and totally believable story. I haven’t read a time-travel romance since \nOutlander\n, but I am so glad I read this one! I can’t wait for the next installment of the story (this is book one of three).ARC generously provided in exchange for an honest review.▸ Purchase: Amazon US | Paperback▸ For more reviews, visit http://www.totallybex.com"}, {"userName": "Brit", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/11119498-brit", "userReview": "How do i even begin to even write this review. How to write about a book that consumed my soul; my being. Ive waited years for this novel. Since 2014, when i was first introduced to Calia Reads novels. I fell in love with Unravel, broke my heart with unhinge and now she consumed me with the surviving trace. I'm still wiping my tears away from finishing. I never wanted this to end it. Every novel you read by calia you know its worth it. She takes you beyond the pages of the story she makes you live within it. Calia read is my all time favorite author and everyone knows it, the bookworld, family and friends. So if your reading this review there will be another book. But i hope you enjoy it like i did. Because im still a mess after 4 days after finishing"}, {"userName": "Angie - Angie's Dreamy Reads", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/8524618-angie---angie-s-dreamy-reads", "userReview": "This was the first time I'd ever read a travel romance and it blew me away. That ending about killed me. Can't wait to see what happens next."}, {"userName": "Lacey (Booklovers For Life)", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/9303686-lacey-booklovers-for-life", "userReview": "4.5 stars! What a fantastic time travel romance. I NEED MORE!"}, {"userName": "Melissa Brown", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/969856-melissa-brown", "userReview": "One of the most beautiful covers EVER... and it's a Calia Read book. Can't go wrong!"}, {"userName": "Rebecca", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/10850816-rebecca", "userReview": "Calia Read’s new release, The Surviving Trace, is quite a unique story, partly because of its time travel story line, but mostly because of the timeless love that seems to exist between two people who had never met until the heroine is transported back to 1912, immersed into a life that is completely foreign to her, and forced to make decisions that will not only alter the lives of the hero and the heroine but of everyone else involved in their lives - in both the hero and heroine’s eras. The Surviving Trace is the idea that despite events that happen that take the hero and the heroine away from each other…that force the past to be rewritten and the future to look unlike anything it once was, what they leave behind is what’s most important, and for Serene and Etienne, that means that despite their lost connection due to time, their feelings, their attraction, and their love seems to remain behind and make them yearn for another chance to stop time and bring them back together. Serene’s love of old photographs definitely plays into the story line because they literally are ‘portals to the past,’ but for Serene, it’s so much more than that, and it seems like the four males in the photograph she becomes obsessed with all play a part in her mission…a mission that is not completely clear to her or to readers, which means that the journey is slowly unraveling instead of revealed all at the same time, and that is what will keep readers invested until all the facts are laid out and clearly understood. Even though Serene may not truly understand why she’s been transported to 1912 and may seem quite out of place in the new world she finds herself in, she does find her footing in that era, and it’s almost as if she was meant to be there and meant to be with Etienne, Nat, and Livingston…meant to help them in some way while also helping herself with the realization of what a timeless love looks and feels like. And while there’s still a plethora of questions that have yet to be answered by the end of the book, I’m anxious to continue Serene and Etienne’s story because I was completely captivated with the relationship that developed between them and what that bond means for their two worlds. I get that some readers may take issue with the time travel aspect of the book; in fact, I’ve read reviews that question the believability of it, but that’s the thing about fictional stories, liberties can be taken, which means that realism doesn't need to be a factor, so as I headed into The Surviving Trace, I gave myself up to the love story that begins as anything but, but then turns into something truly beautiful and truly timeless, which is a good thing due to the nature of Serene and Etienne’s lives and the years and distance between them. The Surviving Trace is an exceptionally well written story that transcends eras and provides detailed accounts of what each time period is about, and as Serene learns to live in 1912, readers get to witness her come into her own and realize where she truly belongs. Now, we’ll have to wait and see what time decides because it’s clear that time is the thief - time is the antagonist - time is the culprit that seems to cause everything, both good and bad, and it has to be the one to make things right for both Serene and Etienne. 4.5 Poison Apples (The Fairest of All Book Reviews)"}], "description": "Our love is timeless.\nWill is my fiancé. The shy man I met years ago in college. The person I’m supposed to spend the rest of my life with. This is the life I’ve always wanted until finding a picture of four men changes everything…Etienne says he’s my husband and the year is 1912. He can’t stand the sight of me, but I don’t know why. Oh, and he’s one of the men from the picture. I’ve done the impossible and have become trapped in time and I know Etienne is my key to going home.The more time I spend with Etienne, the further I fall for him, until I’m questioning which time I belong in and if the life I left behind is the one I truly desire. All I know for certain is I need to survive time. I need to survive love. And I need to make it out on the other side alive.Contemporary Romance/Time Travel", "title": "The Surviving Trace\n      \n          (Surviving Time #1)", "url": "http://www.goodreads.com/book/show/22289995-the-surviving-trace", "average": 4.4, "cover": "https://images.gr-assets.com/books/1400761667l/22289995.jpg", "reviews": 119, "authors": [{"url": "https://www.goodreads.com/author/show/6466717.Calia_Read", "name": "Calia Read"}], "type": ["Romance", "Science Fiction", "Historical", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/22289995-the-surviving-trace", "http://www.goodreads.com/book/show/40182823-the-surviving-trace", "http://www.goodreads.com/book/show/16466436-unravel", "http://www.goodreads.com/book/show/15818820-every-which-way", "http://www.goodreads.com/book/show/16156394-breaking-the-wrong", "http://www.goodreads.com/book/show/23834615-unhinge", "http://www.goodreads.com/book/show/17665832-ruin-you-completely", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}