{"ratings": 16506, "userreviews": [{"userName": "Trudi", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "I was browsing in my library’s fiction stacks one day when I came across Nancy Pickard’s The Scent of Rain and Lightning. Let me just say I was smitten from the start as you’ll never meet a bigger sucker for a great cover or even better title. I’ve been cruelly disappointed using this method to ferret out books in the past, but I’ve also stumbled upon some real gems.I grew up in the Maritimes of Canada – Newfoundland to be precise – a craggy, fogged in island rock that’s bathed in the sun’s rays about 15 minutes every year. I’ve since transplanted myself to the Canadian Prairies and oh how I’ve fallen in love with the never-ending blue sky that stretches uninterrupted as far as any ocean, and the rolling flat prairie lying out as far as the eye can see. This is where land and sky come together with dazzling results. A common joke from these parts is you can watch your dog run away for three days. The cover of this book grabbed my eye because it immediately reminded me of any grid road in southern Saskatchewan on a sunny day (of which there are plenty). The title charmed me – calling up my favorite things. You live through enough prairie storms and it doesn’t take long to realize that rain and lightning do indeed have a scent. At this point, I didn’t even care what the book was about I just knew I wanted to read it. Once I started reading it I was drawn into the landscape (small town Kansas) and to the characters that populated it – strong, rough, country people, hewn from the soil and forged through hard work. At the heart of this story is a murder that happens on a dark and stormy night, with the rain lashing the earth and lightning sundering the sky. A father is shot in cold blood, his wife is also presumed dead even though her body is never recovered. Their little girl – three year old Jody Linder – is left parentless, though not an orphan since her loving grandparents swoop in to raise and protect her, as well as three uncles who would do anything for her – Meryl, Chase and Bobby. When the book starts, twenty-three years have passed since that horrible night and Jody is a grown woman about to embark on a career as a high school English teacher. She is looking towards the future until her past shows up on her doorstop one morning; it’s her three uncles with the news that the man convicted of killing her parents has been released from prison and is on his way back to Rose. The news is devastating and causes a ripple effect throughout the town’s inhabitants and shakes the Linder family to its very core. Because not everyone believes Billy Crosby is guilty of the crime he was sent to prison for – and now Jody’s life is shattered and everything she ever believed thrown into chaos, for if Crosby didn’t kill her parents, who did?Once I started this story I couldn’t put it down. Not only did I have to know what the hell really happened that awful night, I became submersed in the lives of the people involved. Pickard has a way of writing that puts you into the story – I could see everything unfold as if it were a movie playing in my mind’s eye, and I love when a book can do that. Let’s just say more than once I could smell the scent of rain and lightning."}, {"userName": "Nancy", "userReviewDate": "Feb 28, 2010", "userURL": "http://www.goodreads.com/user/show/1956252-nancy", "userReview": "Thank you Goodreads! --Another First Reads win!I particularly wanted to like this book because it was a freebie from first reads. However, I found the plot trivial and predictable, the characters unbelievable and the ending wrapped up just a little too neatly without enough substance to warrant it. I’d be more specific, but I don’t want to ruin the plot line for those who haven’t read the book. But, just let me say this—Pickard’s story didn’t hold me in suspense like a good mystery should. She establishes early on why the suspected killer couldn’t have committed the crime, and yet her characters (or at least the main ones) seem oblivious. It was relatively easy to figure out who the real killer was by the process of elimination. No surprises here. What I did like was her using the real fossil rich chalk lands of western Kansas known as Monument Rocks as a primary feature in her story, renaming them Testament Rocks. She gets kudos for that. I also liked the devotion the patriarch of her wealthy Kansas family, Hugh Linder, Senior, and his wife Annabelle had for each other and their efforts to extend a helping hand to young people from more unfortunate circumstances. However, the fact that they raised an alienated daughter and three sons, none of whom found a lasting or satisfactory relationship, didn’t ring true. You’d think at least one of the kids would emulate the love their parents had for each other.The back of the book lists various accolades and awards Nancy Pickard has received for her writing, so I’m going to assume this book is the exception."}, {"userName": "Becky", "userReviewDate": "Jan 30, 2010", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "I received this book as a FirstReads giveaway. Initially, I was drawn to the cover and the title - if you know me at all, you know that there's nothing I love more than thunderstorms and a good book - so I was thrilled when I won this one, even before really knowing what it was about. I knew it was a kind of cold-case mystery, and that was enough to get me to request the book. Well, along with the gorgeous cover, that is.The edition I read is an Advance Reader's Copy, so there were some grammatical, punctuation and spelling errors, but I'm not holding those against the book, as it obviously hadn't gone through the final spit-shine yet. I imagine that all of those little errors and tweaks will be all gone or fixed by the time this is on the shelves in bookstores. I enjoyed this story more than I thought that I would, to be perfectly honest. I will admit that I was a little concerned in the beginning that I wouldn't love the fact that it was about Kansas and cowboys, but I was so quickly drawn into the story that I forgot all about that. Rather than feeling like small-town Rose, Kansas and the cattle ranch were boring settings that I wouldn't be interested in, they actually came to feel like they had a personality of their own, as if they are living, breathing characters just as the human players are. I was pleasantly surprised by this when I realized it about 3/4 of the way through the book. I loved the people characters, too. They all felt real, and fleshed out and true to themselves. I loved the way that the past and present times merged in them to form a full picture and to make them 3-dimensional people that I felt like I would actually meet in Kansas, should I make a trip out there. I loved that they felt true to their situations and not caricatures of the \"Good Guy\" or \"Bad Guy\". But I especially loved the family, and how they banded together to form this protective and impenetrable barrier when necessary, and the closeness and the trust and strength they both gave and took from each other. And, I even had Hugh-Jay pictured in my mind as Marlboro Man. No, not THE Marlboro Man, but this Marlboro Man from Ree Drummond's \"Pioneer Woman\" blog, which I LOVE, and highly recommend people read. She's witty, funny, and makes delicious creations in the kitchen. I thought that I had this book figured out three or four times, and when everything was laid out and shown for what really happened, I was as shocked as anyone. I never guessed. I suspected everything BUT what actually happened. I love when that happens. Mysteries are the only books that I will allow to manipulate me, but if this one did, it was very tricksy, because I felt oh-so-smart coming to my conclusions... until I was proved wrong every time.The romance bits were a nice break from the tension, and the relationships that were shown were pretty true to what I'd expect of the characters. Nothing really steamy here, but there were some sensual scenes that were welcome replacements for overly graphic sex-scenes that seem to be taking over these days. I very much liked the writing style once I got into it. The first few pages struck me as a little rough, but it didn't take long for me to be absorbed in the characters' lives and the story, so that roughness didn't last long. Mainly it was a bit of choppiness and delay in the form of background information in the first couple of pages that I felt interrupted the story more than enhanced it. There were some pretty great quotes in the book, and even though the writing wasn't flowery or poetic (thank goodness), it still felt true and honest and wise, in a way. I wouldn't mind owning a finished copy of this book, and I would definitely recommend it to my mystery loving friends. I am happy that I got a chance to read this. I have a feeling that I've just been introduced to an author I'll be reading more of in the future. :)"}, {"userName": "M. Garzon", "userReviewDate": "Feb 24, 2012", "userURL": "http://www.goodreads.com/user/show/7154674-m-garzon", "userReview": "I read this book because it got starred reviews from both Booklist and Publisher’s Weekly, but after reading it I can’t help wondering at those accolades. The prose is not particularly poetic, the characters (though likeable enough) are not compelling, and the plot is not that engaging. I had no trouble setting it aside when it was time to go to bed, and I’m the type of person who is easily and thoroughly absorbed by a good story.I wonder whether the reviewers at Booklist and Publishers Weekly were old fogeys, because there’s something a bit old-fashioned about the writing. Maybe it’s the leisurely pace or the sometimes-extraneous dialogue, but it’s not as brisk as we’re accustomed to seeing in ‘younger’ writing. Not that that’s necessarily a bad thing, but be advised that if you’re looking for intensity you won’t find it here.As some other reviewers have mentioned, the guilty party’s actions at the end weren’t terribly believable, but I could have looked past that. What I found most disconcerting were the series of small details that gave me pause—one of them on its own wouldn’t be problematic, but you can’t get lost in a story when unlikely details keep jarring you out of your state of suspended disbelief.*****Spoiler Alert*****For example (some of these are minor—it’s the cumulative effect): -I’ve never heard of anyone wearing rubber gloves to muck out stalls, especially in the heat of mid-afternoon, and it’s even less likely on a ranch that is doubtless littered with leather gloves. And mucking out stalls—particularly those bedded with straw—is hard, heavy, dirty work. It seems highly unlikely that a woman in her 70’s would be doing it, even in an emergency. And it wasn’t an emergency, because the horses were already turned out to pasture.-Does caller ID really work from a cell phone to a landline when the person’s never called before? It doesn’t, in my experience. The author could have avoided raising that doubt and just written, “Collin called”.-Neither a blue heeler nor a Husky are hunting dogs (they are working breeds; the blue heeler, in particular, is a very fine cattle herder). Red, as a cowboy, would have known that.-After the main character finds the dead body of her recent lover she calls someone she barely knows, in a motel in another town, rather than warning her own family, who are in grave danger a stone’s throw away. I personally thought that bordered on the ridiculous.-The declaration of love near did not ring true to me. The author has led us to believe that, although they’ve lived in the same small town all their lives, these characters have shared about five minutes of actual conversation. Based on this, the man states ‘I’ve always loved you’? I can’t see it. Infatuation, yes. Wild attraction, certainly. But love? This is a 30-year-old lawyer we’re talking about, not a hormonal 16-year-old.-Finding the bolo tie suddenly makes a wife of 20-odd years suspect her husband, and immediately connect his guilt with the hidden box? Which he hasn't gotten around to destroying in the intervening 23 years? That strains credulity.You get the idea. Perhaps I would have enjoyed the book more if I’d known less about it, but this is a critically acclaimed novel by an award-winning writer. Frankly, I expected more."}, {"userName": "Vera (GirlySunglasses)", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/21808739-vera-girlysunglasses", "userReview": "3,5 stars.It was better than I expected, especially because it was not a recommendation, but an Amazon Black Friday bargain.The Scent of Rain and Lighting was a fast read. The characters were not as rich as I'd preferred, but they managed not to ruin the story. The scenarios were wonderful, though. I could easily picture the places in my mind.The solving of the mystery felt a little forced to me, and the ending (aside from the reveal), predictable.In short, it was a good read but no masterpiece. And it didn't bore me, so yay!Oh, and I just found out it's being made into a movie, so there's that.***Review updated on January 26, 2016.Review now also posted on my blog. You can check it here."}, {"userName": "Beth", "userReviewDate": "May 03, 2010", "userURL": "http://www.goodreads.com/user/show/584609-beth", "userReview": "I absolutely loved Nancy Pickard's \nThe Virgin of Small Plains: A Novel of Suspense, but this book is even better. Nancy is a magician at making you feel what her characters are feeling and at weaving enough suspense into her writing that you just know that something dreadful is going to happen on the next page, and you have to get to it to find out what. She uses different viewpoint characters who only see part of what's going on and understand even less, and lies, and hidden objects to draw you into a mystery that will lead you in many different directions until you're shocked by the surprise at the end. This is a mystery that transcends its genre into mainstream, almost literary, fiction because of its beautiful prose, the spot-on descriptions of the Kansas cowboy country setting and life, the complexity and depth of the characters, and the masterful way that it's plotted. I don't want to give anything away about the story, because in no way do I want to diminish someone else's joy in reading it, and joy you will find!"}, {"userName": "L", "userReviewDate": "May 26, 2011", "userURL": "http://www.goodreads.com/user/show/2049188-l", "userReview": "This novel reminded me a lot of the novels of Joshilyn Jackson (portraits of deep south, family mysteries and so on) and for a while I thought it would live up to Jackson's novels, but unfortunately, it doesn't. There's some good writing here, and the reveal did honestly surprise me, but it sort of falls apart at the end. I was raising eyebrows at the sudden reveal. Yes, a tie clip at the rocks reveals everything. No, maybe he didn't lose it just going out there, it obviously reveals he's a murderer. Obviously now is the time to check that one box which you've probably forgotten about which contains random person's files. Of course that's what she's going to think of and it's not going to be erased by the grief and you know, twenty odd years. Plus, the love affair between Collin and Jody just sort of...happened. It's really a shame because if it wasn't at its core so contrived with the way it ended, I'd might be singing its praises. This aside, it does have a nice cast of characters, occasional good writing and an interesting mystery up until the disappointing end."}, {"userName": "&#x1f339;Rose☮️", "userReviewDate": "Mar 19, 2011", "userURL": "http://www.goodreads.com/user/show/278701-x1f339-rose", "userReview": "A young woman (26) whose father was killed 23 years ago and whose mother went missing, presumed dead, finds out that the murderer has been set free and is coming back to town. We now go back in time to 1986 and learn about all the events that took place leading up to the infamous crime. Once we have all the information regarding the events of the past, the author takes us back to the present to see how the story unfolds. This is a mystery so not too much can be said here. I am not one who reads the standard mystery and was happy to see that this was literary fiction with elements of a mystery thrown in.I felt that the author did a wonderful job painting life in a small farm town in the heart of Kansas. The characters she created jumped off the pages. My only grumble about the main family in the story, the Linders, were that I kept having flashes of Bonaza and kept picturing the patriarch as Ben Cartwright :) I found it a bit distracting. Another grumble is that I wished the author would have fleshed out the character who was accused of the murder. Billy seemed like just a mean and nasty person all the way around and I guess that's what led to his troubles. However I found it very hard believe that his wife would have stuck with him all those years and waited for him in the end. There times when I was just lost in the people and found myself not trying to solve or figure out the mystery and I liked that I was able to just let that go and get lost in the story itself. I felt the story weakened a bit when we back in time a second round to see how the events of that horrible evening really went and who committed the crime seemed a bit hurried and settled into a somewhat formulaic ending.Not to say that I did not enjoy this book. I couldn't put it down! It was a very engaging read, well-written with characters you could care about. I only had a few grumpy moments. I would recommend it."}, {"userName": "Leona", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/7020824-leona", "userReview": "It started out strong, but it just fizzled out towards the end. It was almost as if the author didn't know how to bring the story to a powerful close."}, {"userName": "Michael", "userReviewDate": "Jun 27, 2010", "userURL": "http://www.goodreads.com/user/show/1177534-michael", "userReview": "Several recent mystery stories from Laura Lippman have delved not only into the whodunnit aspect of crime fiction, but also the impact it has on the characters and the community. Following that trend is Nancy Pickard's \"The Scent of Rain and Lightning.\"On a hot afternoon, Jody Linder is visited by her three uncles to let her know that Billy Crosby is being released from prison. Billy was sent to jail 23 years earlier for the murder of her father and on suspicion of doing something to her mother. Jody is shaken by the news, especially as she's just returned to town to teach English at the local high school. The mystery of who killed her father and where her mother disappeared to that fateful evening has haunted her for years and there are whispers in town that maybe Billy didn't really do it. At this point, \"Scent\" flashes back to the fateful afternoon, showing the events that led up to the death of Jody's father and her mother's disappearance. But while the story leads up to the events, putting in place a variety of potential suspects, it avoids telling us who was killed, why and how until late in the story. Instead, the story looks at the nature of justice and how Billy Crosby probably deserved to go to jail for a series of other crimes but may or may not have been the one who killed Jody's father. Pickard carefully introduces each character and then shows the fall-out and implications of the crime. The story develops in surprising ways with sympathetic and flawed characters. Even the suspected murderer Billy has his moments when you may feel more for him that animosity. Pickard also helps us understand that Billy's family suffers just as much as the Linders do when Billy is arrested, tried and convicted of the crime.The story sets up a number of potential other suspects as well as a myriad of motives. When the big reveal comes, it's a satisfying resolution to the mystery, but also one that has some interesting implications for the characters we've got to know during the story. The novel looks at the nature of justice and forgiveness as the story unfolds."}, {"userName": "Elizabeth of Silver's Reviews", "userReviewDate": "Jun 21, 2010", "userURL": "http://www.goodreads.com/user/show/1882027-elizabeth-of-silver-s-reviews", "userReview": "MAY BE SPOILERSRose, Kansas, the Linder Ranch, and the Linder family...................Jody Linder was left an orphan at the age of three, and the man who had been accused of killing her parents 20 years ago was being released from jail on this hot, muggy, rainless day in Rose, Kansas. Her uncles arrived together at her home to tell her the news.The story then moves from the present back to the events that led up to the murder of Laurie and Hugh-Jay Linder. The Linder family owned a huge cattle ranch, and every family member except Belle along with hired hands, which included Billy Crosby, worked for them. Hugh-Jay Linder woke up one morning to broken fences and a dead, pregnant cow....he KNEW it had been Billy Crosby. Hugh-Jay planned a scenario to get Billy at the ranch and have him arrested for the crime. As a thunderstorm is raging outside the tavern where the Linder children are enjoying their evening, along comes Billy Crosby saying there was no evidence that he broke the fences and killed the cow, and he was free and clear....he was also very drunk, crude, and loud, and was thrown out by the tavern owner. When everyone woke up the next morning, Annabelle Linder was rounding up her children to get some pancakes at a local restaurant. She had to go to her son's house to waken him and his wife but found the doors all locked, and that was unusual. She then found her son dead in an upstairs bedroom.....her screaming roused the neighbor, and he came running over to find the grisly scene. Billy Crosby was of course the sole suspect because of his previous actions and drunkenness from the night before and a trial took place. The trial of Billy Crosby got him forty plus twenty years in prison for the murder....meanwhile the Linder family and the town of Rose, Kansas had to try to carry on. It was always difficult when Annabelle Linder ran into Valentine Crosby and Collin Crosby....Billy's wife and son. Valentine and Collin were ostracized in the town, and poor Collin had a rough time at school as well. Along with mourning their son and his wife, the senior Linders had to raise Jody and help her cope with the tragedy. It was a difficult ordeal for everyone. When things finally started getting back to normal, Billy Crosby is released from jail and the fear, memories, and pain all surface again. What made the release worse was the talk that some folks believed Billy never did kill Jody's parents, and that he had been framed.Events lead to more trouble for the small town of Rose, Kansas, and the Linder family. The ending is a little predictable, but also a surprise. You will like the story. The ending is definitely a page turner. The love and the kindness the Linder family has for everyone draws you into the storyline. I am going to rate it a 4/5 because it was a little slow at times, but the mystery keeps you guessing."}, {"userName": "Elizabeth Salom (elistar)", "userReviewDate": "Jul 31, 2010", "userURL": "http://www.goodreads.com/user/show/3006450-elizabeth-salom-elistar", "userReview": "While on some levels I did like this book, as a whole I found it to be mostly disappointing. It started out as a typical \"whodunnit\" and while it could have actually been a good one, about three quarters in it felt like Ms. Pickard ran out of steam. It ended so abruptly, without any real sense of closure for any of the characters or any explanation of how their lives were affected by the unexpected ending. I just didn't feel satisfied. I kept expecting to gain some insight into the main character's mind, but Pickard spent more time developing the supporting characters than she did with the narrator. Given, some of the characters were lovable or memorable - I enjoyed the back story leading up to the murder much more than the ending itself - in those chapters, where Pickard was writing in ominscient narrative, I felt much more connected to the characters and to their stories. First person narrative just didn't work as well. I'll give Ms. Pickard credit for decent writing and suspense building. But this book could have been so much better. Too bad. Copied from my book blog, www.52bookschallenge.blogspot.com"}, {"userName": "Sarah Ryburn", "userReviewDate": "Feb 15, 2010", "userURL": "http://www.goodreads.com/user/show/1054222-sarah-ryburn", "userReview": "In accordance with FTC guidelines, I'll begin with the disclosure that I won a copy of this book through Goodreads First Reads program.Review: Pickard's novel is my first \"first-reads\" selection. I was drawn to it by the description of Pickard's writing as \"blurring the lines between mystery and literary fiction.\" To label this short novel as \"literary fiction\" stretches the definition of the term a bit. She does have some nicely turned phrases: \"...she trotted back to her truck, feeling as if something within her had both opened and focused, like a long-slumbering dinosaur waking up to turn its eyes toward dinner.\" Reminds me of Yeats, the final lines of \"Second Coming,\" which maintains a nice, if loose, parallel with the plot structure. The \"she\" of the quote is young Jody Linder whose parents were killed when she was three. The man imprisoned for their murders has been released from prison after twenty-three years, and he's the \"beast\" slouching toward Rose, Kansas, the setting of the novel and scene of the murders. A bit of a stretch, too, to think that Pickard had Yeats's poem in mind when she penned those lines; still, it was a good simile and much better than others like \"tense as fresh-strung barbed wire\" or the author's description of jody and her cowboy-lover after sex \"sprawled on their backs like sated puppies who'd just had their bellies scratched for half an hour.\" Perhaps these early blunders signify a writer grasping too desperately for a \"literary\" way to establish exposition. The use of simile improves a bit, it seemed to me, as the author relaxes more into the story, but the characters remain rather stock and uninteresting. The ending is vulnerable to two loathsome literary accusations: it is both cliché and predictable. The shame of it is that the book might have been more interesting if pickard had focused on the character of the murderer, written the novel around him as a sort of anti-hero, rather than simply revealing his identity at the end (remember, it's a mystery, right?). Instead, we learn of his crimes almost as an afterthought or, worse, as an ill-timed and thinly disguised Deus ex Machina serving entirely to remove the obstacles that threaten to keep our heroine, Jody, from a happily-ever-after romance with her father's formerly alleged murderer's son cum love interest, if you follow that. Exactly."}, {"userName": "Kari", "userReviewDate": "Mar 10, 2010", "userURL": "http://www.goodreads.com/user/show/1762694-kari", "userReview": "Some writers ease the reader into their story, but Nancy Pickard dives right in with The Scent of Rain and Lightning. By page six, she has set up the framework of her novel and by the end of the first chapter, the reader is hooked on a tale of murder, mystery, family and love.Jody Linder is infamous in the town of Rose, Kansas. On a dark and stormy night 23 years earlier, someone shot and killed Jody’s father; her mother disappeared and is presumably dead. From that night on, three-year-old Jody Linder was a girl with a story. Now Jody’s three uncles have upsetting news: Billy Crosby, the man convicted of killing her parents, has been released from prison and granted a new trial, thanks to the effort of Billy’s lawyer son, Collin. After years of comfortably living with justice—knowing the man who killed her parents is behind bars—Jody’s world crumbles as everything she has believed is thrown into question.If anyone can understand the notoriety surrounding Jody, it’s Collin. The same town that coddled Jody treated Collin like a pariah as the two grew up side by side. Despite avoiding each other for their entire lives, Jody and Collin have a connection, and with this new case, Jody begins to see that hers was not the only life affected by this tragedy.Against the backdrop of a small town like Rose, the reader understands how one event can define both a town and its people’s history. The standout feature of this novel is Pickard’s creation of complex characters that are deeply tied to history and setting. The characters are flawed, possessing feelings that aren’t resolved and struggling with the idea of accepting a new version of the truth. Pickard constructs a puzzle of interlocking events into which, as the story progresses, we slowly see how each character fits. The Scent of Rain and Lightning grabs you from the beginning, and Pickard holds you until the end, keeping you guessing the whole way through."}, {"userName": "Carol", "userReviewDate": "Mar 13, 2011", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "I was captured and enraptured by The Scent of Rain and Lightning by Nancy Pickard. I haven't read anything by Pickard in years but perhaps it's time to fill in the gaps. Nancy Pickard is an Edgar winning author so I think I was expecting more of a who-dunnit when I picked this up. There is a murder and you do want it to be solved and justice to be served in the end. Where the story really shines is in its exploration of family with all their flaws. Set in Rose, Kansas, we meet The Linder Family, well-known, powerful ranching family with strong leaders at their helm. When one of their married sons is killed, and his wife goes missing, the elder Linders take on the responsibility of raising their only granddaughter, Jody. A ne'er do well, Billy Cosby is charged with Jody's father's death and imprisoned but no one knows what became of her mother. Of course, this uncertainty at her mother's fate plagues Jody but much is kept from her by her protective grandparents, aunt and uncles. Secrets, manipulation, wealth, privilege, greed, tragedy and love are excellently handled in one fine story. Pickard was able to impart the gathering of an oncoming storm, thrill me with the scent of the rain, and had me holding my breath waiting for the lightning strike."}, {"userName": "JoAnn/QuAppelle", "userReviewDate": "May 30, 2010", "userURL": "http://www.goodreads.com/user/show/1244119-joann-quappelle", "userReview": "What a fantastic book.....I had no idea until the very last chapter what had happened and who was responsible for this cold case.....one night and so many people in the small town of Rose affected in such awful ways Every bit as good as Pickard's last book, \"The Virgin of Small Plains \".I was hooked from the first page and was on the edge of my seat until the last page. I had no idea of who the villain was until the very end.....and cannot imagine why anyone would think this book was predictable. Pickard has a wonderful \"voice\" and managed to foreshadow and do flashbacks that did not annoy me (I usually hate these two \"devices\"). I thought the character development and dialogue were very well done and the descriptions of Rose, Kansas and its environs and citizens was realistic and on-target. The slowly escalating tension was effective and real.An outstanding book."}, {"userName": "Stacey", "userReviewDate": "Mar 08, 2010", "userURL": "http://www.goodreads.com/user/show/2050500-stacey", "userReview": "I won this book in the first reads giveaway. I loved this book. I am a hard core mystery fan and this wasn't a typical mystery. They way that the book is laid out it starts out as more of a story about the murder and then progresses into a \"who done it\". The characters were very well described and you felt that you had a clear idea of who each person was and what they stood for. The story kept you hooked the whole time. Some people in their reviews said that the characters were not believable, but I would disagree with that. I think that the characters are very believable and dead on with some people that I know. I judge a good book by how many times I put it down. Seeing as how I read more than half the book yesterday I would have to say it was good. I would recommend this book to everyone and I look forward to reading her other books."}, {"userName": "Rachel", "userReviewDate": "Feb 28, 2010", "userURL": "http://www.goodreads.com/user/show/2726401-rachel", "userReview": "Won this on goodreads. This was an enjoyable read. At first I thought the characters were pretty predictable and they kind of are, but there's some pretty surprising twists towards the end (even if they aren't totally believable).There's not much to say without ruining the book."}, {"userName": "Terri", "userReviewDate": "Dec 29, 2011", "userURL": "http://www.goodreads.com/user/show/45128-terri", "userReview": "Jody's parents were murdered over 20 years out and now the killer is out of jail. Only maybe he didn't do it. The emotional struggle and depth of characters kept me hooked. I loved this book"}, {"userName": "Robert Beveridge", "userReviewDate": "Jun 23, 2010", "userURL": "http://www.goodreads.com/user/show/766524-robert-beveridge", "userReview": "Nancy Pickard, The Scent of Rain and Lightning (Ballantine, 2010)In the end, as I've mulled this over (I finished it about two weeks ago and have been letting it stew), I feel like I should have liked The Scent of Rain and Lightning a lot more than I actually did. I've been reflecting on this, and I've come spot up against a conundrum that I haven't yet quite figured out how to solve. But deadlines loom, and thus I'm writing the review instead of letting the book stew a bit more. In any case, the conundrum is this: as I was reading the book, I was relatively certain I had it figured out. In fact, it seemed to me Pickard was making sure it was obvious that the central “mystery” of the book was not a mystery at all (viz. Mysterious Skin; Heim emailed me after I published my review and said yes, that's exactly what he was after). Which is dangerous, but done correctly, it can work quite well (viz. The Lost Honor of Katharina Blum, and don't bother with the movie version). Then we get to the final chapter or two, and I find out I was entirely wrong. And I should have known I was entirely wrong based on one of Roger Ebert's rules for mysteries (telling you which one would give the game away). And when it happened, I felt deflated rather than wowed. I have no idea why this is. We get to the end and it all makes sense and the mystery really was a mystery and that's supposed to be the formula for a cracking mystery, isn't it? And yet for some reason it didn't work. I wish I could put my finger on why.In 1986, Jody Linder was three years old. She lost both of her parents during a violent storm; one was shot, the other disappeared. Now it's 2010, and in the first chapter of the novel, Jody's uncles come by the family homestead to tell her that Billy Crosby, the man convicted of killing her parents, is being released pending a new trial, because the sheriff, then young and full of beans, botched a couple of things about the investigation. And leading Billy Crosby's defense is his son Collin, a man Jody had a fascination with all the way through her childhood...(yes, you can cue the romance subplot here.)I'm having the same problem figuring this out as I did while writing my review of Imago Mortis (q.v.); all the elements are here for a bang-up finished product, but it never quite gets there. The characters in The Scent of Rain and Lightning are well-drawn, and if a few of them (notably Jody's grandmother) are stock, it's made up for by the times Pickard zags when you assume she's going to zig (Billy Crosby's post-prison personality is especially amusing). The setting is wonderfully done, if a bit sketchy at times. (Specifically, I wanted more detail on the house itself; Pickard paints it as a small-town mansion, more or less, but then provides us with a frustrating lack of detail.) And I've already talked about the mystery angle. 99% of the time I'm a huge fan of the red herring, especially when you get blindsided with the revelation at the end. As long as it all stands up to scrutiny, naturally. And it does here, though I'm wondering if part of my confusion is that I simply haven't looked enough to uncover the holes. So when it comes right down to it, a solid-seeming mystery that left me cold for an undefinable reason. You have my apologies. I'm giving it a hesitant recommendation because, well, your mileage may, and probably will, vary. ***"}, {"userName": "Jen", "userReviewDate": "Nov 06, 2010", "userURL": "http://www.goodreads.com/user/show/1719442-jen", "userReview": "Mmm…okay. I am in a book club with my two sisters. I will not name them here, partly because I want to protect their privacy and partly because I already feel badly enough about making them share genetic traits. I’m the oldest of the three girls and am an omnivorous reader. Granted, I might not like everything I read, but when I’ve got the shakes from word withdrawal and need to read something I don’t let finding only a small fold-out on Playtex tampon application get me down. Toxic Shock is real, folks. Real.My middle sister, who chose this book, likes smut and tragedy. She is drawn to slave narratives. She does not read in her spare time. To be honest, I don’t know what exactly she does with her spare time, but she can dress a casserole in frozen hash browns like nobody’s business. She is electric and curls her own hair and the hair of others without the use of plugs or outlets. She is the Odie when I am a tired Garfield, she laughs like the devil, and I love all her kinds of crazy.My youngest sister is kind and polite. She likes all things Jane Austen. Living in England and sipping tea suits her. She is the kind of person who worries that her coexist bumper sticker might offend someone. In short, she is the person I probably should be, but alas!This book is not a slave narrative. It is supposed to be a murder mystery, but I am not going to be polite or kind and pretend that I think it really delivers on that. The title is fine, the cover is interesting, but I had trouble with the characters and the writing, although the story itself was not bad.Certain characters that played a lesser role in moving the story forward were better fleshed out than other major story characters. This resulted in my finding the twist at the end to be more surprising in a “Say what?” way than an “A ha!” moment of clarity and respect for the author and her craft. Ultimately, I found the ending a bit deflated and more unlucky than truly tragic. This might have been because I couldn’t sympathize with the woman killed; for me the author villanized the girl’s mother more than the killer. I want to think that all these issues were a readability problem and not a personal one, but I’ll not kid myself: I’m outnumbered on this site, and overwhelmed by the number of other reader reviewers who didn’t seem to have as many concerns as I did. Perhaps I’m not the happy omnivore that I thought I was . But, in my defense, both my sisters agreed with my assessment of the narrative. In fact, my youngest sister confessed to being embarrassed by the amount of cheese on the line level. She might have been referring to one particular passage early on in the story involving the main character jumping from the post-coital bed and running naked to the window. Clutching her naked breasts, she fears for the family farm. But I am unfairly speculating; I can’t be sure what passage it was that had my sister smelling limburger; I only know that it was that bit early on that gave me the giggles.  All things considered, I would be willing to try another book by the author if I got the shakes bad enough. Until then, I’m feeding my habit with work by other authors."}, {"userName": "Nicole R", "userReviewDate": "Feb 09, 2013", "userURL": "http://www.goodreads.com/user/show/10762842-nicole-r", "userReview": "I don't remember where I first saw a description of this book, but something about it kept drawing me back to it and I finally decided it was time to give in to the urge to read it. And I am so glad I did...On a night in 1986 on a small Kansas town, the lives of the Linder family were forever altered. Three year old Jody was left an orphan after her father was murdered and her mother disappeared, presumed dead. Jody's grandparents, aunts, and uncles sheltered Jody from the worst of the investigation and trial but they were all unanimous in their views: the small town bad seed Billy - the man who beat his wife, abused his son, and unwillingly worked on the Linder ranch - was guilty. As the years go by the family does what they can to deal with this unimaginable tragedy but cannot move on without physical and emotional scars. Especially when they still have to live side-by-side with Billy's family. And then, 23 years later, the unspeakable happend. Billy is released from prison and doubts arise as to whether he is actually guilty of these crimes. What really happened that that stormy night?This book was amazing. The writing was so descriptive and smooth to read that you just slid into the story. The characters were realistically complex and the story slowly unfolded to reveal the truth about that night. I was so convinced I knew exactly what happened at the beginning of the book, but then I jumped around until nearly every single person was a suspect at one point or another. My one complaint was that the end felt a little rushed after the midwestern mosey pace of the rest of the story and it was a little too much of a surprise for me to give it the full 5 stars.I hate to call these things too early in the year, but this one has a good chance of being in my 2013 top 10!"}, {"userName": "Andy Miller", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/2448436-andy-miller", "userReview": "This novel starts with a 26 year old woman in a small Kansas farm town learning that the man who was convicted of murdering her father(the same night that her mother went missing, presumably also dead) was being released from prison, largely about concerns about the fairness of the original trial. The book then flashes back to 23 years earlier and details the events and the people involved in the death and disappearance.The first half of the book was just great, Pickard does a great job creating full characters and creating suspense and incidents such as the murder victim's compassion for the convicted killer's wife and young son were truly touching. The son was one of the most interesting characters, growing up with poor parents, then a dad in prison, ostrasized from the town and school but studying hard and going to law school and eventually obtaining his dad's release from prisonThe second half was a bit of a let down, as if Pickard reverted to her earlier style as a \"mystery\" writer. It sometimes read as a mystery with unnecessary and gratuitous killings and unrealistic changes in character attittudes. And to be honest, the ending which tied everything together was dumb.But still, Pickard did a great job describing life in a small Kansas farm town and creating interesting and complex characters so all in all it was a good book though the end was a bit of a let down.I did have some picky differences with the legal issues in the book, it is the prosecutor not the sheriff who is responsible for providing legal discovery to the defense, the description of legal and political issues of commutation procedures was not realistic."}, {"userName": "LORI CASWELL", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/4770012-lori-caswell", "userReview": "Nancy Pickard takes us to Rose, Kansas where a man’s conviction of murder has been overturned and he is returning back to the scene of the crime. That shakes up the whole town but especially the family of the man who was killed and whose daughter-in-law is still missing. Their daughter Jody takes us through her story and finds things may take her down a very unexpected path.Colin Crosby, the son of the man convicted of murder had a very interesting story as well. His father treated him terribly but he still grew up and became a lawyer and he was the one that was able to get the man’s conviction set aside.Pickard has woven a story that could have taken place anywhere but she makes Rose, Kansas come alive and draws the reader right in. The vibrant characters jump off the page, but the story evolves slowly unveiling the mystery and the truth. The family is very close, brought closer by tragedy. She explores family relationships and the secrets and lies that can either draw a family together or rip it apart.I was so impressed with the easy flow. There were surprises and twists but I would not call this a thriller as other reviewers have. It has a totally different kind of feeling. In addition to the mystery there is also an underlying love story that added another element to an already fabulous story.I am truly sorry it took me so long to read this story. It was getting great reviews when it first came out that made me buy the book and while a few years have passed it is still getting those great reviews. If like me you missed this story when it first came out it is one that shouldn’t be missed. Add to your reading schedule as soon as you can."}, {"userName": "Judyw Winkleman", "userReviewDate": "Mar 02, 2010", "userURL": "http://www.goodreads.com/user/show/673085-judyw-winkleman", "userReview": "I get a lot of used books from my friends and family, but nothing is better than getting a brand new book. Similar to getting a new dress, which as the third girl in my family of six children did not happen very often when I was a child.I enjoyed this book very much. I started reading and spent several nights up late to get past the next big event. The story is written about a small town called Rose, Kansas. Jody Linder's father was murdered and her mother disappeared when Jody was a young child. Jody was raised by her grandparents and protected by her Aunt and Uncles. The man accused of killing Hugh-Jay Linder is being released after 23 years in prison. Billy Crosby's sentence has been overturned and he is being given a new trial.This story has some great twists and turns, with fear and romance on the side. I believed, like a couple others in the story, that Billy didn't kill Hugh-Jay. And I was sure I knew who did. But it wasn't until the very end before another twist, and another turn, finally gave me some answers. I can't wait to share this book with others."}, {"userName": "Nancy (NE)", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/1882126-nancy-ne", "userReview": "I enjoyed Pickard's The Virgin of Small Plains and thought I would give her another try. I guess I like contemporary mysteries more than I want to admit and need to stop being a book snob! I don't care for the shallow characterizations and action packed mainstream thriller genre. But I have come to appreciate the work of writers like Kent Krueger, Nancy Pickard and in particular Tana French. When I want something that is entertaining enough to keep me turning pages in the wee hours, has a bit more substance, a deeper characterization and writing that doesn't spell it all out in black and white... they are my \"go-to.\" Of course she sets the reader up for several possible perpetrators by laying little crumbs of suspicion along the way. And I was close, but missed the mark on my guess! While I liked the first one better, this was definitely engrossing by the end. 3.5 to 4..."}, {"userName": "kari", "userReviewDate": "Sep 20, 2010", "userURL": "http://www.goodreads.com/user/show/2207055-kari", "userReview": "I haven't read a mystery in a while and I'm so glad I did. This book, start to finish, is terrific. Here is one that I thought, well, I'd just do the first chapter and see if it's interesting, but then I was hooked. One chapter. I couldn't put it down.Excellent writing. Interesting characters. The plot pulls you, keeps you reading and and yet there aren't any car chases or lots of running around. It's just a well-developed plot that is rolled out in such a way that you find yourself trying to figure out the mystery while getting to know the characters.And I'll admit, when all is revealed, I was surprised. Since I can often figure mysteries out pretty early on, I was delighted that I didn't get 'whodunit' until it was revealed and then, I could think back and see the subtle hints were there. When all the pieces are put together, the picture is clear. Will look for more book from this author.Loved it."}, {"userName": "Kelly ", "userReviewDate": "Mar 15, 2010", "userURL": "http://www.goodreads.com/user/show/1943394-kelly", "userReview": "I liked this book but I didn't love it, although I'm not sure that I can put my finger on exactly what was missing. For some reason, I just did not connect with any of the characters except for Belle, who made me chuckle because she's the same way with her mom that I am with my own! The female lead characters were relatively strong for the most part, but the males were just one-dimensional descriptions on a page. As for the murder mystery itself, I felt like the author dropped too many in-your-face clues... she made sure you picked up on something by mentioning it three or four times, when one time would have sufficed. The whole thing felt quite contrived, but it wasn't awful. I would give it an average 3.5 stars if I could."}, {"userName": "TeriLyn", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/1459307-terilyn", "userReview": "I found The Scent of Rain of Lightning to be a very enjoyable read. The author's third person POV writing is such that it's meant to be savored. Her story telling is eloquent and concise as she weaves a mysterious tale of love and betrayal that intertwines the lives of two families for over two decades. Some predictability and an abrupt ending kept me from rating the full five stars. However, if you enjoy subtle mystery in your fiction, lots of questioning in a slow building plot with tones of romance and layers of family drama you'll find this book satisfying."}, {"userName": "Tejas Janet", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/15332219-tejas-janet", "userReview": "Almost 4 stars so I rounded up. There were some inconsistencies I didn't like, but overall well above average for the genre. Had some really good suspenseful moments. Fun read but ending got too suddenly neat and tidy without enough clues to see what really happened. It was like it kept shifting from unreliable narrator to unreliable narrator. But since I was able to track what happened, 4 stars instead of 3."}], "description": "One beautiful summer afternoon, Jody Linder, a young English teacher, is unnerved to see her three uncles parking their pickups in front of her parents’ house—or what she calls her parents’ house, even though they have been gone almost all of Jody’s life. The three bring shocking news: the man convicted of murdering Jody’s father is being released from prison and returning to the small town of Rose, Kansas.It has been 26 years since that stormy night when Jody’s father was shot and killed and her mother disappeared, presumed dead. Neither the protective embrace of Jody’s uncles nor the safe haven of her grandparents’ ranch could erase the pain caused by Billy Crosby that night. Now Billy has been granted a new trial, thanks in large part to the efforts of his son, Collin, a lawyer who has spent most of his life trying to prove his father’s innocence.Jody knows that sooner or later she’ll come face-to-face with the man who she believes destroyed her family. But what she doesn’t expect are the heated exchanges with Collin. Having grown up practically side by side in this very small town, Jody and Collin have a long history of carefully avoiding each other’s eyes. Now Jody discovers that underneath their antagonism is a shared sense of loss that no one else could possibly understand. As she revisits old wounds, startling revelations compel her to uncover the dangerous truth about her family’s tragic past.10 hrs and 9 mins", "title": "The Scent of Rain and Lightening", "url": "http://www.goodreads.com/book/show/25756966-the-scent-of-rain-and-lightening", "average": 3.8, "cover": "https://images.gr-assets.com/books/1484928345l/25756966.jpg", "reviews": 2156, "authors": [{"url": "https://www.goodreads.com/author/show/49538.Nancy_Pickard", "name": "Nancy Pickard"}, {"url": "https://www.goodreads.com/author/show/2743336.Tavia_Gilbert", "name": "Tavia Gilbert"}], "type": ["Mystery", "Fiction", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/25756966-the-scent-of-rain-and-lightening", "http://www.goodreads.com/book/show/6606456-the-scent-of-rain-and-lightning", "http://www.goodreads.com/book/show/7937233-the-scent-of-rain-and-lightning", "http://www.goodreads.com/book/show/19727443-the-scent-of-rain-and-lightning", "http://www.goodreads.com/book/show/9194946-the-scent-of-rain-and-lightning", "http://www.goodreads.com/book/show/8380324-the-scent-of-rain-and-lightning", "http://www.goodreads.com/book/show/180648.The_Virgin_of_Small_Plains", "http://www.goodreads.com/book/show/1054641.But_I_Wouldn_t_Want_to_Die_There", "http://www.goodreads.com/book/show/1054666.The_27_Ingredient_Chili_Con_Carne_Murders", "http://www.goodreads.com/book/show/1054679.The_Whole_Truth", "http://www.goodreads.com/book/show/1054670.Generous_Death"]}