{"ratings": 18304, "userreviews": [{"userName": "Clif Hostetler", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/793473-clif-hostetler", "userReview": "Before reading this book I believed that I and most other humans used our rational minds to make life's decisions. After reading this book I now know that the subconscious mind is a raging monster and the rational mind is the midget hanging on for dear life who thinks that since his hands are on the reigns that everything is under control. The following is an example of how some of the most important parts of our lives depend on guidance from our subconscious minds with very little training or formal preparation:\"Children are coached on how to jump through a thousand scholastic hoops. Yet by far the most important decisions they will make are about whom to marry and whom to befriend, what to love and what to despise, and how to control impulses. On these matters, they are almost entirely on their own. We are good at talking about material incentives, but bad about talking about emotions and intuitions. We are good at teaching technical skills, but when it comes to the most important things, like character, we have almost nothing to say.\"The objective of this book as stated by the author:1. Synthesize the findings of research of the subconscious mind into one narrative.2. Describe how this research influences the way we understand human nature.3. Draw out the social, political, and moral implications of these findings.4. Help counteract a bias in our culture to ignore the importance of the human subconscious mind.5. Explore why experiments in improving the educational system almost always result in disappointing results. 6 Explore ways that integration of our true makeup could improved education.David Brooks uses his journalistic skills to organized this material into an interesting and easy-to-read format. He narrates the lives to two fictional characters and follows every step of their development (from pre-conception through to death) to illustrate the findings of research findings from the fields of psychology, sociology, physiology, economics, politics, and neuroscience. At first I thought the use of fictional characters to demonstrate the nonfiction facts was a bit hokey. But by the end of the book I emotionally identified with these fictional friends, and I was sad to see them grow old and die.The following are some miscellaneous quotations from the book that I found interesting:\"People rarely revise their first impression, they just become more confident that they are right.\"\"Subjects [were given] microsecond glimpses of the faces of competing politicians. … subjects could predict, 70 percent accuracy, who would win the election between the two candidates.\"\"Sensitive early [childhood] care predicted competence at every subsequent age. … Attachment-security and caregiver-sensitivity rating were related to reading and math scores throughout the school years. Children with insecure or avoidance attachments were much more likely to develop behavior problems at school. Kids who had dominating, intrusive, and unpredictable caregivers at six months were much more likely to be inattentive and hyperactive by school age.\"\"By observing quality of care at forty-two months … researchers could predict with 77 percent accuracy who would drop out of high school. Throwing in IQ and test-achievement data did not allow researchers to improve on that prediction’s accuracy.\"\"Attachment patterns in early childhood also helped predict the quality (though not the quantity) of other relationships later in life, especially romantic relationships.\"\"A child born into a family making $90,000 has a 50 percent chance of graduation from college by age twenty-four. A child born into a family making $70,000, has a one-in-four chance. A child born into a family making $45,000 has a one-in-ten chance. A child born into a family making $30,000 has a one-in-seventeen chance.\""}, {"userName": "Dan", "userReviewDate": "Dec 10, 2011", "userURL": "http://www.goodreads.com/user/show/934928-dan", "userReview": "The premise of this book is a wonderful one and it seems like this book would have been both a challenge and really fun book to write. In trying to describe modern advances in psychological sciences, Brooks takes the unusual and potentially exciting tactic of weaving these findings into the lives of two fictional characters. Thus the book holds the promise of straddling an interesting narrative and yet providing an informative look at the way the mind works. Unfortunately, the book overreached and fell flat in both arenas, at least for myself. As I was most \"sold\" by the non-fiction aspect of this book (i.e. the way the subconscious mind works to regulate our choices in the world), this was where I was the most disappointed, and is where I will start. By taking two (fictional) characters to follow through a lifetime's worth of decisions, the breadth of the psychology that Brooks attempted to cover was ambitious, to say the least; mental ability and inclination were mentioned from infancy to senility,and gender differences, interpersonal relationships, family dynamics, sex, power, and more were all discussed or alluded to. But I firmly believe that to capture the interesting aspects of any of these topics, Brooks would need to slow down. The science in this book is sprinkled in and popularized in the very worst sort of way. Whole disciplines and areas with huge academic disagreements were summarized in half-sentence factoids. Through the first half of the book, I kept waiting for the scientific discussion to get a little more meaty, but it really just felt like a barrage of pop-sci references (most of which seem to have become overused in recent literature). I am sure that I partially fell this way because I have read a few other similar books and so the material was not quite as fresh. Instead, it just came across as far too over-simplified, even to me - a casual reader of popular science psychology books. Furthermore, I even had to remind myself of the central thesis of the book at times (i.e. the role of the unconscious mind), as it seemed like the ideas that were discussed ran all over the place, including some very conscious decisions and aspects of personality that we do have some control over.The fictional aspect of the work was less disappointing to me. I think that Brooks has a flair for picking some really great moments to highlight, and for picking out little subtleties or pet peeves in his character that to make for moments of biting clarity. In some of these moments, the author really seems to have a detailed understanding of the depth of the brilliance and irrationality of the human condition and his characters take on a spark of life. But here too, the breadth of the subject overwhelmed the story. The narrative of Harold and Erica was scattered and jumpy, I guess because we were forced to leap to each moment of their lives where they made a significant choice or were affected by fate. To cram it all in, Brooks had to resort to a clipped style of describing certain scenes and people who crossed paths with our protagonists. These passages felt like grocery lists of personality characteristics stamped onto the foreheads of lumps of protoplasm, and I could never really get into most of the people or events described. In the end, the use of these two characters had the effect of cheapening and marginalizing the scientific points. Since I never really identified much with Harold or Erica, I would end up frequently thinking \"well, that might be true for them, but...\" - even though I already knew that the scientific idea Brooks was illustrating was much more global.I would still consider recommending this to a non-scientist who hasn't read anything in psychology and has a very broad interest or aptitude for trivia. But I can't help but feel that any number of books that are slightly more specialized would be a much better popular way to be introduced to modern ideas in psychology and neurobiology."}, {"userName": "Mike", "userReviewDate": "Aug 12, 2012", "userURL": "http://www.goodreads.com/user/show/1398087-mike", "userReview": "The Social Animal is a ‘lost opportunity’ book. Similar to The Black Swan, I can recommend portions for its startling insight into the patterns of thought from which we must extricate ourselves to progress and reflect. Unfortunately, those insights are packaged in a specific way, and most unfortunately, they are packaged by David Brooks.The book, which rapidly oscillates laundry-lists of half-baked research summations told without sufficient reflection or implication (or really sufficient information regarding the methodologies, the conclusions, the rebuttals or the conflicting theories that are ever-so-present in the bullshittery of social sciences). When it is not taking little tidbits and making impossibly giant leaps to its conclusions (more on that in a minute), it is telling the story of Harold and Erica.The story of Harold and Erica is a boring, stagnant, impossible story. It is told episodically in an embarrassing show of exposition that would make a creative writing teacher blush. It is also told in a seeming stasis of chronological time, hopping from contrivance to contrivance in the hopes of explaining some sect of neuroscientific research. For a book about love and character, these straw men are infuriatingly unidentifiable as people. Much of the examples of their lives as it moves from chunk to chunk hardly account for the passage of time, or really abide by the rules of the book. They drift from scenario to scenario through a floating chronology that hardly accounts for any MAJOR societal shifts or diverse arrays of human experience wherein perhaps more than one thing happens at a time. These are social animals, you say? These are people who are imitators, prone to put on “different selves” around other people? Why are the prototypes, then, hardly seen to interact with anybody? Why doesn’t time seem to pass whatsoever? Why aren’t they socializing after college? How are their identities so distant?Not to mention Brooks’ condescending writing style, which either tends to take whole communities of people and pan them for their lack of originality (note the habits he delineates of Harold and his collegiate peers, and how smug Brooks is for being so exacting in his holier-than-thou judgment of the archetypal college-student community), or exploits cheap strategies to keep the interest of the lowest common denominator in check (you and I): the occasional fuck, the pop culture reference (e.g. sad as a Tom Waits song), and the teenage girls talking about – for no real reason – their own bulging tits. Throw in some sex, some “bullshit”, and perhaps the reader will find herself engaged if only because her reading levels only keep her engaged through the unexpectedly wry use of sex and profanity. It is not that I object to either of these, but when it’s (also) contrived into a (contrived) narrative, one realizes how abominable Brooks’ delivery system truly is. It’s smug beyond belief, and unjustifiably so.Back to the giant leaps of logic. I am very skeptical of the findings that are put forth in the book, but this is meant to not suggest that the research itself is faulty, but that it is poorly summarized or not given sufficient credence. I’m not confronting social science methodology at large, but much of the time, Brooks doesn’t do his subject matter justice. For example, he states, through one parenthetical phrase, that people who ruminate do not tend to perform as well on problem-solving tasks are those who are distracted. (NB: I hate how the book is annotated: there are no superscript numbers to reference each study, and there are no footnotes. The endnotes are numbered but not to correspond with a number in the book. One has to simply go by a four-word quotation. Good luck putting in the work to re-find what you are looking for. It’s almost like Brooks is concealing the absence of scientific rigor and hoping to get by on the aesthetic sheen of a note-less page.) Yet, back to rumination: several years ago a study was published in the New York Times about the evolutionary advantages of depression. It suggested that depression was important to put people into a headspace that allowed them to solve problems. How? By encouraging rumination. Why did they know that? They saw that ruminators performed better on problem-solving tasks.So who is right? They’re both published studies by renowned social scientists. Disagreements between 'camps' still elicited sympathy for the others' perspective. So who’s right? I can’t really go on one word or the other, because The Social Animal is a literary review of other literature reviews, and the other’s an article with no citations at the bottom. Am I supposed to take both at their word? Did one get disproved? Can Brooks at least discount some of the opposing literature that his home newspaper printed and circulated to millions of readers?I hope he can, and I wished he can. I want to believe he isn't susceptible to the oft-condemned confirmation bias, but I have a hard time trusting Brooks. Sometimes his glance at different findings is so cursory that it elicits a sense of alarm, a sense that he is taking things at face value. Sometimes it seems he is hypocritically obliging his own confirmation bias despite desperately railing against it. Sometimes, not enough information is given. For example, a brief aside tells us that Kenyans prefer paintings of the Hudson river over the desert pastures of their homeland because – and I’m paraphrasing – people find art that is reminiscent of the landscapes of the Pleiostocene era more pleasing to look at. This little study comes off the heels of recognizing the following: people changing their actual tendencies upon being observed in an experiment, people changing their opinions based on being properly anchored by a certain number, being primed by certain images, or having an issue framed appropriately (e.g. Hillary Clinton’s approval rating is lower than Secretary of State Hillary Rodham Clinton). After going through the innumerable variations on self and identity, the tenuous nature of true individual identity in different contexts, the importance of contexts in decision-making, and the variability of preferences or truths within one person over the course of a shift in circumstance, Brooks expects the reader to accept straightaway that a sampling of Kenyans’ painting preferences overwhelmingly proves the existence of a deep evolutionary coding.Let’s do a thought experiment here. Let’s ponder what the results of this particular study would be if we mixed it with other studies in the book. One: you took the same research group to the Hudson river to tease them and beat them up, then asked them which landscape they prefer. Would they still prefer their primitive origins, or does the emotional context override that? If you showed them an image of a beautiful woman or man before you showed them the desert landscape, they wouldn’t necessarily prefer the Hudson landscape. Or would they? Other studies show an increased physiological arousal creates more outward approval. Would their affinity for primitive origins override their sex drives? Which abject truth in social science outweighs the other when you push two disparate “findings” like that together? What if they played with framing and introduced one painting as the “polluted, hideous” Hudson river and the other as the “pure, sacred” desert lands? Would framing go against their evolutionary grain? Which ultimate truth is, then, true?The thing with these studies is that they are attempting to eliminate factors to illuminate some past, some inalienable fact, about evolutionary behavior or human characteristics. But this knowledge is virtually inapplicable. There is no way I could demonstrate my preference for a painting without the circumstances of that day affecting it, whether it be the weather, a cornucopia of beautiful men and women walking down the street, etc. This is established by Brooks himself. We may have approached a small bit of truth, but this truth cannot be applied or replicated in real life because it is intentionally reductive of the human experience, yet it is reductive in order to garner insight for the selfsame experience. But when social science attempts to reintroduce the innumerable factors that come with being human and socializing, multiple truths seem to arise, but they also conflict, and some truths may, as we saw in the previous paragraph, be preferred over other truths, all because of context. Some of the Kenyans may be primed, some may be aroused, some may bring trauma to the experience. All are truths, but none of the research really coalesces well enough to make such a blanket statement such as “Pleiostocene preference.” Ultimately, weaving the studies together only illuminates the diversity of mind and complexity of mind. Nothing more. And that’s not something The Social Animal needed to say. The book needn't exist to make this point. But it can exist to show us the problems with its own existence.The previous paragraph is meant to bring further illumination into the human experience by allowing for these studies to intertwine. This would introduce more factors into play. But the problem with social science – and possibly with many of the studies quoted herein – is that they reduce the irreducible. It is foolish to apply this variable-eliminating regression analysis to any form of human behavior, because to make any kinds of conclusions, one attempts to control instead of allow for other factors. That’s the apology after a high-falutin conclusion, anyhow: “It controlled for other factors.” Which “other factors”? The other factors that the human mind can control for, which turns out, according to other experiments, to not be that many. We can control situation, maybe context, maybe environment, but we cannot control for most influencing factors. What about the other factors we don’t know about? What about the other factors beyond human comprehension, let alone control? How do we control in an experiment for the behavior of the unconscious, or the most complicated object in the known universe? How do we dare predict the unconscious based on the models of the purely conscious mind? It's some form of cognitive imperialism: a conscious brain imposing itself on a greater unknown to disastrous effects.These overly-reductive bits and pieces are not woven together very well in The Social Animal, leaving a disjointed, segmented, sometimes confusingly over-simple read. In one section, Erica concentrates deeply on a tennis game – and even creates pictures in her head - to manage her self-control, yet in another Brooks says the experts perform best when they are not concentrating. How do these facts relate? Brooks doesn’t relate them, and continues to hastily and shoddily breeze past all the things that would make a skeptic pause. This is strange given how overzealous he is to look to discredit the rationalist and scientific models. Yet I’m supposed to just “believe” him? I’m supposed to believe in his radical implementation of social policy change based on a compilation of conflicting and/or outdated studies, studies that have not been replicated since 1978 and have only been performed once? (That year may not be exact, but consider it the 70s). Or a study that was only cited – it seems – through a blog post?My point here is not that social science is bullshit (it kind of is, but that's not my point). Far from it. My point is that Brooks needed desperately to elaborate upon the credibility of his findings instead of finding an oblique means of referencing his studies and veering past results with abandon. These studies were not meant to be shoehorned into the under-developed life narrative of two inhuman protagonists, either.In closing: an episode in the book involves an imaginary, grossly hypothetical school called The Academy. It is Brooks’ invention that is meant to make a point about assimilating underprivileged students into a higher class. Whether or not I found the imaginary place dehumanizing and sad is irrelevant; the point is that he’s using untested, unverified, imaginary symbols to make a scientific point. It is the equivalent of examining Hogwarts for cues on adolescent development. Sure, there's some interesting cocktail-party information in there, and The Social Animal is rich with those nutrients and minerals. But it’s the nutrients and minerals in an overzealous vitamin-taker’s bucket of piss. Good luck getting some use out of them."}, {"userName": "Trish", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "I listen to David Brooks because he has a way looking at the world that adds depth to my perceptions. As a result of hearing his point of view, I can articulate my own positions better. Between the two of us, we do not cover all possible iterations of an argument, but we make a wider circle of opinion. He seems to be a man I could negotiate with, and come up with a better solution than if either he or I made decisions on our own. Well, anyway, he’d have to negotiate if he wanted my participation. Another thing I like about David Brooks is that he is not despairing, despite knowing what he does about the way Washington works. He just plods along, looking for and picking up little gems along the road that might mean the difference between collapse and success in our post-apocalyptic world. Because he doesn’t make me comfortable that Washington is going to be able to change enough to save us from ourselves. I think he essentially has a dark view of the path our leaders are walking. But, he says, we the populace could change our fate if we took responsibility for learning the lessons science is now teaching us.In The Social Animal Brooks writes a story meant to illustrate in narrative the results of studies done for the psychology, sociology, neuroscience, and medical fields in recent years. It is a quick and easy read, though I paused several times over the choices the protagonists made, remembering choices in my own life that echoed. I am familiar with many of the studies he used as a structure for the narrative, so could follow his lead, though I did wonder whether this was the best way to explicate the material. It’s not what I would have done, but then, I didn’t write it. It’s his way, and once again I’m willing to negotiate. Protagonists Erika and Harold grow up in different types of social environments and we follow them through life. Things happen to them, and they also impact and shape their environment. They both end up in the same place, despite getting there by very different means. Brooks has his main character muse about limited government, but with targeted interventions that may help people focus on the hard work that is necessary to build a democratic society with (and here he laments that the term “socialism” has already been taken) a strong social-izing bent. He gives voice to his Hamiltonian interest (from conservative President Alexander Hamilton) and tries to describe ways this successful president might make choices were he alive today. Brooks makes a thoughtful attempt to synthesize disparate fragments of information that he has gleaned in the course of his life and work, and so adds to the national dialogue."}, {"userName": "Deb", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/6188366-deb", "userReview": "*A beast of a book* Oh my goodness.Huh?What was that?Those responses are not the typical ones I have after completing a book, but they're the ones that have been circulating in my head after finishing (and trying to digest all that went on in) David Brooks' _The Social Animal_.Starting out the book, I was pretty optimistic and hopeful. There were tons of copies in the New Book collection in the library (that's got to be a good sign, right?), the content seemed deliciously irresistible (who doesn't want to learn about \"the hidden sources of love, character, and achievement\"?), and the book jacket itself promised that \"This is the happiest story you'll ever read\" (sign me up!).The first part of the book was pretty engaging. Admittedly, I'm a psychology junkie, so having chapters that rehashed what I've been reading about in recent books was pretty fun. This part of the book was kind of a trip down a summary lane, which had the cross streets of topics like: behavioral economics, choice architecture, attachment, limerence, learning, intelligence, memory, and culture. But, the more I read, the more I realized that this section was indeed just a rehashing. It was almost as if the author had spent years collecting interesting findings of psychology and sociology, and was using the first part of the book to catalogue them. There wasn't a whole lot of creativity and integration happening here despite the author's attempt to \"integrate science and psychology with sociology, politics, cultural commentary, and the literature of success\" (p. 377).OK, I was a little disappointed at this point, but the principle of loss aversion (one of the many rehashed topics of this section) kept me going. I had already invested time (and hope) in this book, and I couldn't admit to defeat.There was, after all, still the promise that this book was going to be the happiest story I'll ever read. Unhappily, this was probably the biggest (and most deluded?) over-promise I've ever read on a book jacket. Perhaps the author was referring to another book, or he neglected to read what he had written? The story of Erica and Harold (the main characters in the book) is anything but happy. Let me use the author's own words to demonstrate:\"They both had become profoundly sad. Erica would cry while blow-drying her hair. She wondered to herself if it would be worth trading her career success in exchange for happiness at home. Harold would sometimes see couples his own ageout for a walk, holding hands. That was unimaginable for him now. For Harold, as for Erica, the profoundest source of satisfaction was work, and it wasn't enough. Harold wasn't going to commit suicide, but if someone told him he had a fatal disease, he felt he could face the prospect with equanimity.\" (p. 266)But, once I got passed the happiness-ever-after over-promise, I was kind of entertained by just how absurd these characters (or caricatures, as other reviewers have noted) were. I could cite countless examples (see other reviews), but the one that stands out is the couple's \"decision\" not to have children. Although Harold clearly and deeply wanted children, he only mentioned this one time to Erica whose response was \"No, not now! Don't you ever burst in on me with that.\" And, the issue was never discussed again. This is the happiest story I'll ever read? (OK, maybe I never did get over that over-promise.)So, now I was two-thirds through the book, and admitting defeat was not an option. I was going to get through this (social) animal, line by excruciating line.The final part of the book seemed to be the author's attempt to congeal and share the political ideas that have been marinating in his mind over the past few decades. Admittedly, I am not familiar with the author's life's writings on politics, policy, society, and culture, but I'm guessing they're embodied in Harold's views and ramblings. I could not help but wonder if the author was reflecting on his own mission and experience when describing Harold's exhausting plight: \"He spent those years writing essays, peppering the world with his policy proposals. Not many people seemed to agree with him...Still, he plugged away, feeling that he was mostly right about things and that someday others would reach the conclusions he had....He was confident that his 'socialist' approach, in one guise or another, would someday have a large impact on the world.\" (p. 335)The ending of the book was the icing on the disappointment cake. It was convoluted, forced, and disillusioned. But, I suppose that complemented the flavors of the rest of the book. On the other hand, the ending was a happy one for me--I had finished this beast of a book! (I'm not quite sure if that is the happy ending the author had in mind.)Would I recommend this book to someone who wants a satisfying, enlightening, creative, and well-written read? No.Would I recommend this book to someone who wants a rehash, over-promise, self idea promotion, and absurd character development? Yes.Oh my goodness.Huh?What was that?These thoughts won't stop. It's time to return this book to the library."}, {"userName": "Trevor", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/175635-trevor", "userReview": "I read this after reading this review - http://www.goodreads.com/review/show/.... Really, I don’t have much to add to that review.In part this book is a kind of summary of lots of other books I’ve read – and these are mentioned along the way. In that way it reminded me a bit of Drive: The Surprising Truth About What Motivates Us – although, I think this was perhaps a more interesting summary. He even discusses Bourdieu at one point and the idea of cultural capital in relation to education, this guy really has been reading the books I’ve been reading lately – but I think he then contradicts himself later on exactly the same topic. I found it hard to know what to make of the two main characters. As a device to structure the work I could see where he was going, but they became too particular at times and at others seemed to be little more than mouthpieces for the political views of the author. I agree with many of these views, but that really isn’t the point.The other thing that annoyed me about this book was this:“Harold (the ultra-ego of the author) pointed out that most nations have tried to battle this problem, spending a lot of money in the process. The United States has spent over a trillion dollars to try to reduce the achievement gap between white and black students. Public-education spending per pupil increased by 240 percent in real terms between 1960 and 2000. Major universities offer lavish aid packages and some of the richest, like Harvard, waive tuition entirely for those from families making less than $60,000 a year. The United States spends enough money on antipoverty programs to hand every person in poverty a check for $15,000 a year. A mother with two kids would get a $45,000 check every year if the programs were converted into a simple transfer.“He then goes on to explain that money isn’t the solution. Have you ever noticed that money is never the solution? Let’s look at this a little more closely.Firstly, what was this trillion dollars spent on and by whom and over what time period? Is it a trillion dollars over the last six weeks, for example? Or a trillion dollars since 1776? Does part of that trillion dollars include the cost of bringing black people to the land of the free in slave ships, for example?Secondly, never trust aggregate data. A book I’ve just finished reading The Flat World and Education: How America's Commitment to Equity Will Determine Our Future points out that rich schools get three times the funding of poor schools in the US. But if you talk about aggregate data you can say there has been a 240 percent increase in per pupil funding and that sounds like something has been done – when, in fact, nothing has been done but more benefit being provided to those already well off.And just how many students at Harvard have had their tuition fees waived entirely? One percent? Ten percent? And what percentage of the population of the US earn less than $60,000 per year? Do you imagine for one second that the proportion of students in Harvard from such families matches the proportion of such families in the US population generally? Sometimes granting free access to one person is a way to deny access to thousands.But overall I agree with the main message of this book. We need to see ourselves as social animals and we need to have more compassion."}, {"userName": "Holly", "userReviewDate": "Jun 03, 2011", "userURL": "http://www.goodreads.com/user/show/150689-holly", "userReview": "While i like david brooks a lot actually, and often find his political commentary interesting and expressed well, i was ultimately dissapointed in his book, the social animal. The device of harold and erica was so filled with boring and unimportant information and stereotypes that i almost gave the book up. What saved it was the interesting research, though it would have been a much better book had it been a discussion of research with small examples woven in rather than the other way around. That brought the book up from a 1 to a 3 for me. Additionally, the pop culture references were often a bit misplaced, especially the reference to a girl who would have wanted to be in a girls gone wild video being a disciple in the church of lady gaga! Its definitely common knowledge that lady gaga is all about self respect and freedom of expression, not about reckless drinking and boob videos. Also, is it necessary in a book like this to discuss what bands individuals were listening to at different periods as a social commentary. It seemed like a ploy to look connected to pop culture that just didn't add anything to the book in my opinion."}, {"userName": "Caroline", "userReviewDate": "Apr 07, 2016", "userURL": "http://www.goodreads.com/user/show/6257531-caroline", "userReview": "[* Vocabulary. We judge intellect via the other person's vocabulary (a fact I find animating, arresting and commoving!) Words are the fuel of courtship - which may be why we have such large vocabularies.* Making decisions. Emotion is important in helping us reach decisions eg \"I like this. This will make me feel better.\" If you have no emotion it becomes difficult to make any decisions. You don't become a logical Mr Spock, you become rudderless.*BabiesBabies find physical touch as important as food. They make an intense effort to get their mother's attention.  They organise their internal states by seeing their minds reflected back at them in the faces of others. A baby's brain is built by his mother's brain. Mammal brains grow properly only when they are able to interpenetrate with another.  A mother's love and attention can make a baby's IQ grow by 50 points.* GistHumans beat computers in the sense that we can see the *gist* of something. We are capable of fuzzy thinking. We have rough ideas of things, and from variable patterns we can create gists. Computers on the other hand are utterly precise.*ImaginationThis is phenomenally complex, and consists of the ability to blend neural patterns.'The Eureka Moment' - This is the unconscious working its magic - combining adjacent idea systems in new and creative ways.*Emotional intelligenceWork by David Van Roov suggests that only 5% of a person's emotional perceptiveness can be explained by their IQ score. This is shown in Williams Syndrome - whereby people with impressive social skills are severely impaired when dealing with other tasks.*PersonalityIn high school we fall into social circles of people who are social allies, and we are acutely aware of this. These are the personality types we get with. We are also aware of the personality types who are our social opposites. The adult personality - including political views - is forever defined in opposition to one's natural enemies in high school.* Groups. People have a tendency to form groups, even on the basis of the most arbitrary characteristics imaginable...and when groups are adjacent, friction will arise.There is a lot of pressure to conform to the norms of your group, and agree with other group members.We feel deep loyalty and affection for our group, and much less for other groups.We empathise much more when someone in our group feels pain - when someone in another group feels pain, it is much easier to dismiss it.*Learning. People who already have some knowledge about a topic will become faster and better at acquiring more knowledge and remembering what they learn. Core knowledge helps us learn more about a subject.People want to take conscious knowledge and turn it into unconscious knowledge, which is almost automatic eg learning to drive a car. The way to do this is via repetition.It is far better to go over material five times on consecutive nights, than it is to cram one long session into one night. We need to read new things again and again.* PraiseIt is much better to praise people for working hard than for being smart. The former encourages more hard work, whereas the latter suggests that achievement is an inborn trait, and it deters people from doing difficult tasks.*ChessSurprisingly, IQ is not a great predictor of performance in chess. Nor do the good players have brilliant memories. What they do have is the ability to see formations. eg when you lay out a mid-game formation, experienced players can remember the place of each piece on the board. On the other hand when you lay out the pieces randomly on the board, they can't remember where they are.*ExpertiseThis is not just about remembering facts. It's internalizing the relationships between pieces of information.Every field has its own structure, its own scheme of big ideas, organizing principles and re-occuring patterns - in short, its own paradigm. The expert has absorbed this structure and has a tacit knowledge of how to operate within it. Economists think like economists. Lawyers think like lawyers.The result is that an expert doesn't think more about a subject - they think less.*Anticipation.The brain is an 'anticipation' machine. It is always (automatically) trying to build patterns out of data. A telephone transmits only 10% of the tones in a voice, and yet from that any child can easily build a representation of the person on the phone - this is what the brain does easily and well.The mental system is geared towards predicting rewards rather than the rewards themselves. The main business of the brain is modelling, so we can anticipate things. We continually construct little anticipatory patterns in our brains to help us predict the future. When we are right we get a little surge of reward or tranquillity, when our model contradicts reality, there is tension and concern.*Fight or flight responsesWe all veer naturally towards a fight response (showing low reaction to stimuli) or a flight response (trying to avoid stress and pain.) Even babies. Some researches refer to dandelion kids and orchid kids. Dandelion kids will do pretty well wherever you put them. Orchid kids are more variable. They bloom in the right environment and wither in the wrong one.*Fake it until you make itTimothy Wilson of the University of Virginia has said that one of the most endearing lessons of social psychology is that behavioural change often precedes changes in attitude and feelings.*IQ and workA good IQ enables you to do well at school, but after school a good IQ only contributes to about 20% to successes in life. Ambition and a high work ethic is more important for success in business.*SuccessPeople succeed who tend to find one goal in the distant future then chase it through thick or thin. People who flit from one interest to another are much less likely to succeed.*We are influenced by thousands of random factors...eg Asian women reminded they are Asians will do better in a maths test. Reminded that they are women, they will do worse.eg A $30 bottle of wine will seem expensive when placed amongst £10 bottles of wine, but cheaper when placed amongst £100 bottles of wine.*InertiaMost of just stick with things we know, investments we already have and so forth. We therefore tend towards the status quo.*Self regardA personality test asked teenagers if they considered themselves an important person.1950 - 12% said yes.Late 1980s - 80% said yes.Most people are overly self-confident about their abilities. People with the least skills and talents are the most likely of all to do this.Most people are incompetent. Most people are in denial about their incompetence.*The Power of Social Networks.We do what our friends do. If our friends smoke, we smoke. If our friends are lonely we are lonely. If our friends are fat we are fat.Happiness.People who place tremendous emphasis on material well-being are less happy than people who don't.What really makes people happy are intimate bonds, mixing with people even casually, and big challenges.*See it my wayMuch late night bar conversation involves one person trying to get another to see the world as they do.One of the reasons the Israeli-Palestinian conflict has been so stubbornly unresolved is that each side wants the other to accept its historical narrative.*PrejudiceWe see and apprehend only what we already half know and believe. eg fans at a football match can see the game very differently, depending which side they support.* The Conscious v the Unconscious MindThe conscious mind relies heavily on the working memory system - the bits of information that are consciously in the mind at any given moment. The unconscious mind has vast, implicit memory systems it can draw on. It has a much higher processing capacity. At its highest potential it is 200,000 times stronger than the conscious mind. It can help us know things we can't consciously remember eg we will know that someone is nasty or nice, without remembering why we know this.The conscious mind generally can't follow what is really going on. It just looks at the results and forms an interpretation. it makes up a story.Some researchers believe that this is all the conscious mind does....ie we have no free will, just a bunch of post-hoc rationalizations.But there is a split - some researchers take a dim view of the unconscious. Some take a rosy view. Some researchers seem temperamentally inclined to trust emotion and intuition, others are distrustful of these things.*Free willThe unconscious mind doesn't rule us. We can nudge it. \"We may not possess free will, but we possess free won't.\" We can discourage some impulses and even overrule others.*The Human MindWe can't handle distractions very well.We're better at handling visual images than abstract concepts.We can only hold a thought for about 10 seconds at a time. Lists and agendas are therefore helpful.We are much better at comparing one thing to another thing, rather than to three or four things. We work best with binary comparisons.We like evidence that confirms our own bias. To hear opposing viewpoints it is better to listen to them first.We are good at spotting our own mistakes eg typos are typed with a lighter stroke than the strokes for correct letters on our keyboards. We hesitate with mistakes.We often make errors. Life is about progressing forward through our errors - learning as we go along.*Alcoholics AnonymousIt doesn't work for most peopleResearchers can't predict who it will or will not work for.Researchers can't agree if the programme works better than other programmes out there, or if it works at all.It is the quality of specific AA groups that matter - the core people running the group.*MoralityPeople who discuss morality a lot are no more or less moral than anyone else.* Murder and genocideMurderers don't kill people they regard as fully human like themselves.The unconscious has first to dehumanise the victim. This is also found in those who enact genocides.After the act, the perpetrator will justify what he has done. He will tell himself that the victim had it coming, or that circumstances compelled them to act as they did, or someone else is to blame.* PoliticsMost people inherit party affiliations from their parents, or they form an attachment to a party early in adulthood. Few switch parties once they hit middle-age, even in the face of major historic events such as war or the Watergate scandal.Drawing on a vast range of data researchers argue that party attachment is more like attachment to a religious denomination or a social club. People have stereotypes in their heads about what Democrats and Republicans are like, and they gravitate towards the party made up of people like themselves.Once people have formed an affiliation to a party, they bend their philosophies and perceptions of reality so they become more and more aligned with members of their political tribe.eg In 1988 voters were asked if they thought that the nation's inflation had fallen during the Regan presidency (It had, it had fallen from 13.5% to 4.1%)Only 8% of strong Democrats thought inflation had fallen.But 47% of strong Republicans said they thought inflation had fallen.The way candidates look is very important. Candidates for senate or political positions elsewhere in the world can be largely picked (correctly) by students .....from photographs or from 10 second silent movies.Most voters are moderate, but political campaigns are structured to take a moderate nation and make it polarized.Once politics become a contest pitting one identity group against another, it is no longer possible to compromise. Everything becomes a status war between my kind of people and your kind of people. Even a small concession feel like a moral capitulation. Those who try and build relationships across party lines are ostracised. Politics no longer becomes a place for trade-offs, but a contest for honour and group supremacy.*Older peopleThey are still capable of learning and growth.Some aspects of the brain aren't as good though:- Working memory- The ability to ignore distractions.- The ability to solve maths problems.Whilst many neurons die in old brains ad many connections between different regions of the brain wither - older people's brains re-organise to help compensate for the effects of ageing. Older brains may take longer to produce the same results, but they do tend to get the problems solved.Most people report being happier as they get old. Laura Carstensen of Stanform University found older people better able to keep their emotions in balance, and they bounce back more quickly from negative events.People don't get wiser. They reach a pinnacle of wisdom in middle age and this level continues until they're about 75.*Historical EcstacyHistorians speak of historical ecstacy, the feeling that magically comes over them when the distance of the centuries disappears, and they have the astonishing sensation of direct contact with the past.* Common errors in our thinking.Path Dependence:Things that seem normal today began with a choice that made sense at a particular time, and survived even though it might no longer make sense at all.The Focusing IllusionKahneman has said \"Nothing in life is as important as you think it is while you are thinking about it\" (I find this a bit ambiguous and wish the author had elaborated....)The Pareto PrincipleWe have in our heads the idea that most distributions fall along a bell curve (ie most people are in the middle.) But this is often not how the world is organised.eg The top 2% of Twitter users send 60% of the messages. \n(hide spoiler)]"}, {"userName": "Bill", "userReviewDate": "Feb 23, 2012", "userURL": "http://www.goodreads.com/user/show/2892405-bill", "userReview": "Children are coached on how to jump through a thousand scholastic hoops. Yet by far the most important decisions they will make are about whom to marry and whom to befriend, what to love and what to despise, and how to control impulses. On these matters, they are almost entirely on their own. We are good at talking about material incentives, but bad about talking about emotions and intuitions. We are good at teaching technical skills, but when it comes to the most important things, like character, we have almost nothing to say.\nI appreciate this comment by Brooks in his introduction (xiv). Teaching character, being intentional about teaching character, is a foreign matter in our society today. We are very good at allowing the culture to instruct and inform us (I'm thinking largely of the grip consumerism has on our behaviors as a society) on matters that have deep consequences for how we think and live. We do not do the difficult work of critiquing our culture and learning to behave in ways that counter the more harmful effects of our cultural norms.This is one of the main objectives of Brooks' work, to demonstrate through fictional narrative that we are indeed largely creatures of habit, living lives of ritual and routine that are often unquestioned and unexamined. We seldom give serious thought to how are social context is serving to shape our thoughts, feelings, and beliefs through our daily behavioral patterns.In this realm, Brooks has done an excellent job of communicating his message. Though the more scientific mind might question the validity of a narrative approach, his method is enjoyable and entertaining. It's a different \"genre\" of academic material, and obviously not the type of book that can stand on its own in the academic world. But I do think it offers a different perspective--an opportunity to use the other side of our brain as we consider the power of culture to shape our character."}, {"userName": "Michael", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/2179154-michael", "userReview": "Only intermittently interesting. NY Times columnist Brooks has done a lot of research on brain science, and popularizes it in this book using a couple fictional characters, Harold and Erica. He takes you through their lives from childhood to old age. The book begins with his statement, \"This is the happiest story you will ever read.\"I cannot figure out why he wrote that. There is nothing particularly happy about Harold and Erica. They don't seem especially happy; and their lives are neither unusual nor noteworthy. They have no children, they have no spiritual lives, and they seem essentially selfish and limited. So I don't get what Brooks seems to have thought he was going to show his readers. But, if you are unaware of most of the human science of the last 10 years, Brooks will tell you about it. Parts are very interesting; wish I could say the same for the whole book. If you didn't already know that we humans are more emotional and non-rational than we are rational, you will find it out."}, {"userName": "Adela-diana Almasi", "userReviewDate": "Nov 30, 2012", "userURL": "http://www.goodreads.com/user/show/15021232-adela-diana-almasi", "userReview": "I just finished this book a couple of weeks ago and overall, this book was a disappointment. It's the kind of book that seems awesome, fun and insightful at the beginning and then just goes downhill from there.It didn't go as far as giving it up, but the last chapters I just skimmed through, still hoping somehow that something interesting will happen, or at least that I'll get it over with.Don't get me wrong, there are a few good things to this book, just that....not that many. It's easy to read, fun at times. It does provide quite a number of interesting bits of disconnnected data that can come in handy in a coffee break conversation. The problems, however, are just so easy to notice. You have shaky science, incredibly badly constructed characters, not much connection between chapters, plus...it gets boring quite fast.Much has been said in other reviews about how this is not a scientific way of presenting scientific facts, so I won't dwell on it.It's the characters that I find annoying, the fact that there is no logical progression from one chapter to the next. There's nothing wrong in having characters as a means to transmit concepts; it's been done before and it's proven to work. But this is not a narrative and the characters are not very convincing. There is no growth or development for them, they only change from one chapter to another.Harold - is a happy, popular, outgoing highschool kid only to turn into an introvert, a lonely and idealistic spectator of life as adult. Erica is passionate about tennis as a girl, but after this chapter of her life ends, tennis is never to be mentioned again. Harold has a group of close friends in college, they're like an extended family and they spend all their 20s together, but after that the friends vanish into thin air. Erica wants to get a divorce, but then they both become interested in politics and their communication problems are never mentioned.These are just a few examples, but except their names, it's hard to recognize the characters from one chapter to the.next. Which doesn't help in making you relate to them..Overall, if you're looking for a book to read on the morning commute (if sleepy) and the evening bus ride (if tired), this might be it. But for life-changing insight, look elsewhere."}, {"userName": "Tracey", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5858840-tracey", "userReview": "Here's what I absolutely hated about the book. The whole Harold-Erica concocted storyline. Really, could Brooks BE any more rigid with gender roles and adopt a more hetero-sexist view of the world?! A book that is discussing people as social animals should approach the topic with keener eye that would examine how much we, as animals, socialize ourselves through constructions of race, gender, etc. and that these constructions are fluid...changeable...I would go so far as to say \"bendy\" (just because that's a funny word).Here's the deal. I think David Brooks and I have read many of the same books and articles and so the basis for much of what he's 'woven' together, I have already read in a more complete version, so this book felt a little bit like an \"introduction to...\" for me. I was familiar with many of the case studies he cites, etc., etc. I will say that Chapter 20, which begins on page 312, was the chapter that I felt was most worthwhile in the book for me. It discusses the relationship between poverty, culture, economics, and government. I don't agree with some of his ideas, but there was a lot there that made sense (yes, I just said that about a conservative political pundit)."}, {"userName": "Larry Bassett", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "I am very impressed with David Brooks, sometimes so impressed that I forget to be very critical of his thoughts and ideas. Sometimes I realize I don’t agree with him But it doesn’t even really matter. This book is filled with ideas and illusions to books and data and studies. I try to imagine I had filled with all this information and then trying to make sense of it and comprehend what it all means.This book is predominately structured as the story of the life and lives of a man and woman. Occasionally there are bits of David Brooks himself although he generally does not identify those bits. But when he talks about the politics of Alexander Hamilton and Abraham Lincoln and Theodore Roosevelt and suggest an admiration for their kind of thinking, he does allude to a commentator who writes for the NYTimes Who may think similarly.As most of my reading these days this was experienced in the audible format as I follow along in the Kindle edition. Having the Kindle edition makes it easy for me to save paragraphs although there were quite a few segments of the book where I did not do that very often either because I thought a single paragraph did not really capture the moment or simply because I was enjoying the flow of the language too much to stop and cut and paste."}, {"userName": "Marcus", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/762235-marcus", "userReview": "There's a lot about this book that could have gone really wrong. In fact, it's the perfect recipe for disaster. I can imagine the pitch to the publisher, \"I'm going to tell a fictional story whose purpose is to briefly summarize each of of more than 50 popular books and bring the disparate ideas together in a way that supports an over-arching, but somewhat nebulous, thesis that humans are primary social and rarely rational. Oh and I'm going to throw in some literature, pop culture, religion and philosophy in just for good measure.\" If that idea crossed my desk, I don't think I'd care that it was from David Brooks, there's no way I'd believe it could work.And yet... it does. The Social Animal probably won't change they way you live and it probably won't even change your ideas on politics, economics, philsophy or psychology even though it dives into all those areas. What it will do is give you a great jumping off point for further though and research. The underlying story of Harold and Erica is sometimes shallow, but ocassionally poingant. More importantly, it serves its purpose of providing continuity, structure and sometimes a humorous platform for all the ideas in the book.It's nothing new for a journalist or full-time writer to take a few ideas coming from scientists or \"real\" researchers and write a soon-to-be-forgotten pop-sci book, but The Social Animal stands apart both for the breadth of the ideas it contains and for the enjoyable way that they're presented."}, {"userName": "Dianne", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/20940446-dianne", "userReview": "It took me ages to read this book. It is full of theories of why humans behave in the ways they behave. These many ideas backed up by numerous studies are then put into a fictional format using a sample family. This made the book a combination of a sociology text and a modern novel. I like David Brooks articles and books on societies and how they adapt to change. At first I was not interested in the fictional family he used in this book to illustrate his observations about American society today however they grew on me towards the last chapters. I became interested in whether or not the marriage of Erica and Howard would last or fall apart. I learned about the desire for limerence. This is the pleasure experienced when there has been some difficulty overcome by a satisfactory conclusion. Apparently without some situation needing completion life would be lacking this limerence. His explanation of moral intuition is very interesting. We humans know instinctively that if we engage in an act that we consider wrong we will feel disgust and revulsion. So because we are human beings and not wild animals we use a superior level of consciousness to guide and guard our behaviour. This follows his theory about the importance of the unconscious mind in directing our behaviour in situations that are new or complex. The unconscious mind has stored away data to guide us to correct behaviour. Another fascinating fact is that we can actually live vicariously through the observation of others. There is a chapter, chapter 14 The Grand Narrative, which covers theories of economics as well as philosophical arguments of each theory; it was interesting but difficult to understand. I did like the criticism of rationalism, how it denies emotions and human nature. Brooks usual brand of humour and sarcasm remain throughout the book. The most interesting section of the book is Brooks research into politics. He explains why we choose a political party and how that choice determines all else about our values and political decisions. There are two chapters on political election campaigns and Washington politics that are very interesting. Brooks has explanations for the way things are that make good sense, such as how economics and guns have become the vital forces and morals have slipped out the back door.A study done at MIT found that in older people’s brains the amygdala remains active when people are viewing positive images but is not active when people are viewing negative images. They’ve unconsciously learned the power of positive perception. The book becomes increasingly more interesting with each chapter. The final chapter summarizes the development not only of our social skills but of the soul within. I enjoyed Bobos in Paradise a great deal and found The Social Animal intriguing so I will read future books by David Brooks."}, {"userName": "Kressel Housman", "userReviewDate": "Mar 09, 2011", "userURL": "http://www.goodreads.com/user/show/575806-kressel-housman", "userReview": "I must say, I’ve never read a book quite like this one. On one hand, it was similar to a novel in that it’s a cradle-to-grave account of the lives of two fictional characters, Harold and Erica. On the other, because it’s more of an intellectual history of the two characters, it doesn’t always employ the usual elements of fiction, like dialogue and drama. There’s some, but there’s even more philosophizing on the part of author, David Brooks. Basically, the book violates the cardinal rule of fiction; it tells more than it shows. Occasionally, you’re in the characters’ world with them, but most of the time, you’re an outside observer. Yet in spite of this, the book works.Brooks draws on the many of the same psychological studies I recognized from other books, particularly Malcolm Gladwell’s. But because he sticks with the two main characters instead of weaving together diverse threads the way Gladwell does, he comes across as more scholarly and less “pop.” The main lesson is the same as Outliers, though: context matters. Humans are hard-wired to live in social groups, so the outcomes of our lives are very much the result of our social settings at every stage of our lives. My favorite minor character was Harold’s high school English teacher. She was exactly the person I dream of being: a matchmaker between students and books. The description of how she launched Harold on his love of learning was also right up my alley: she got him journaling. It was just like the “commonplace notebooks” I read about in Where Good Ideas Come From. Many of the chapters contained inspiring messages, but that one, called “Learning,” was definitely my favorite.But even though my favorite chapter was about Harold, Erica is the more compelling character. She’s a real “pull yourself up by the bootstraps” type of person, half-Mexican, half-Chinese, and one hundred percent a child of immigrants. But I could not help but wonder if readers with similar backgrounds would relate to her, knowing that she’s the creation of a highly successful white man.Harold and Erica never have children, but we do get some chapters about parenting early on with Harold’s parents. In late middle age, Harold and Erica get politically active, and even though the entire book is the author’s soapbox, it seemed just too much of a device here. But the section on old age was surprisingly moving. Harold and Erica become so contemplative and creative, it made old age seem like something to look forward to. If you like a novel to read like a novel, then I suggest you skip this book. But if you’re open to philosophy and psychology presented in a non-academic way, then perhaps you’ll find this book as inspiring. I certainly did."}, {"userName": "Gina", "userReviewDate": "Apr 12, 2011", "userURL": "http://www.goodreads.com/user/show/453699-gina", "userReview": "Well, David, this is a new you. I must admit I am totally suprised and delighted by this new David, witty, racy, uproariously funny. I have loved the old David for a while now, the one I see sparring with Mark Shields on The Jim Lehrer News Hour Friday nights when I have not fallen asleep.That David, bespeckled, elegantly dressed, represents The Conervative viewpoint. . . the REAL Conservative viewpoint as expressed by many of our forefathers and formulated for modern times by Barry Goldwater. From this one can deduce that he is not a screaming, irrational yahoo the likes of Glen Beck, Bill O'Reilly and the rest of that depraved lot. The Momma Grizzly does not even deserve to have her name mentioned only to describe the creature as a nonentity. Back to loving David. How could this be? A Conservative with the imprematur of the NY Times and criticizes Obama and his agenda from time to time. But . . . he is civil, he is decent, he also has written many columns praising the President for his civility, decency and integrity. The twinkle in his eye as he shoots off an occasional bon mot has deeper underpinnings as I am learning from reading this Novel of Social Commentary. David, you rascal! Emotions as the most important part of a human's make-up. The whole population of Philosophs and Englightenment wags are spinning at great speed in their graves!  While Brooks frames this incredibly wonderful thesis is the story of a contemporary American couple and their offspring, he is still the mind that astonishes and the stylist who effortlessly, or so it seems, puts together paragraphs such as these.  He is describing the wonder of a newborn: \"The truth is, starting even before we are born, we inherit a great river of knowledge, a great flow of patterns coming from many ages and many sources. The information that comes from deep in the evolutionary past, we call genetics. The information revealed thousands of years ago, we call religion. The information passed along from hundreds of years ago, we call culture. The information passed along from decades ago, we call family, and the information offered years, months, days and hours ago, we call education and advice. But it is all information, and it all flows from the dead through us and to the unborn. The brain is adapted the the riveer of knowledge and its many currents and tributaries, and it exists as a reature of that river the way a trout exists in a stream. Our thoughts are profoundly mouled by this long, historic flow, and none of us exists, self-made, in isolation from it. So even a newborn possesses this rich legacy, and is built to absorb more, and to contribute back to this long current.\" I wish I could quote some of his outrageous zingers, but even David Brooks should have an aura of mystery. Read him soon!"}, {"userName": "Elyse", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "4.5 Stars!Wonderful Book.....I'm taking off a 1/2 star for a 'few' spots in the book that I was a little bored with ---(BECAUSE I'm so SMART)....lol I had read a few of the things the author wrote about in this book BEFORE....\"Mr. David Brooks\". (but I'll forgive you).However....gotta share a cute funny in the book (which I haven't read in other reviews)---which by the way --so many of the other reveiws on this book are so GREAT --- I figure I don't need to repeat what has been said....but nobody talked about the (1 pop-in-her mouth), M&M's Erica ate every time a HOT SHOT ---during a \"VERY IMPORTANT BUSINESS MEETING\"--- mentioned that 'so-and-so' graduated from HARVARD. Erica played the quiet game to herself of eating 1 M&M from the candy bowl in the room each time they said \"HE GRADUATED from HARVARD\". The woman could get FAT, (lol), --- soooooooooooo many 'name drops' of HARVARD! (as if...we need not know anything else about their character???) lolThis book told me what I always knew was true: \"LOVE and OUR relationships matter\" ---Do you still want to know my SAT score? LOLReally, ---wonderful book...and how can you not LOVE David Brooks?/!!!!!!"}, {"userName": "Bookmarks Magazine", "userReviewDate": "Apr 06, 2011", "userURL": "http://www.goodreads.com/user/show/1008236-bookmarks-magazine", "userReview": "With the exception of the New York Times Book Review, which panned the story of Harold and Erica as well as Brooks’s conclusions, most critics deemed Brooks a capable storyteller but otherwise spent little time appraising his literary skills. Science forms the crux of The Social Animal, and the reviewers’ agreement with or refutation of Brooks’s claims constituted the greater part of their reviews. A gifted social observer, Brooks makes some valid points regarding the duality of the human mind, but he too often bases his conclusions on questionable data and unduplicated experiments, “commit[ing] a variety of statistical errors and tiptoe[ing] through a minefield of contradictory evidence” (Wall Street Journal). The Social Animal may not be the last word in neuroscience, but it nonetheless provides an engaging and thought-provoking tour of the human mind. This is an excerpt from a review published in Bookmarks magazine."}, {"userName": "Fabio Ismerim", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/26466919-fabio-ismerim", "userReview": "Não somos quem pensamos ser.Se tivesse de escrever em poucas palavras a mensagem que este livro me passou é essa. Uma frase que eu já tinha ciência através de outras obras, mas que nessa é muito bem contada. Inspirado na obra de Rosseau, de 1760, Emílio ou Da Educação, que trata de como seres humanos podem ser educados, o autor criou dois personagens fictícios, Harold e Erica, e conta toda sua trajetória desde o nascimento até sua morte, mostrando o poder do inconsciente nas nossas vidas e nas decisões, e tudo isso muito bem embasado pelas pesquisas realizadas nos últimos 30 anos nos campos de psicologia, neurociência, economia comportamental, biologia. Peguei-me, literalmente, segurando as lágrimas no final do livro.Por ser um tema que eu sou apaixonado, este livro me emocionou muito e foi de grande impacto na minha vida. Estamos em uma busca constante em responder perguntas e buscar significado em tudo, na vida principalmente. Como diz Kafka: “Quão praticamente escasso é o meu autoconhecimento se comparado, digamos, o conhecimento do meu quarto. Não existe observação do mundo interno da maneira como existe do mundo externo”. Dizem que somos frutos de nossas escolhas, mas ao mesmo tempo achamos que temos plena consciência delas. Platão dizia que tínhamos de domar a razão para “podermos levar uma vida em felicidade e harmonia, mestres de nós mesmos”. O que as pesquisas recentes evidenciam é que razão e emoção muitas vezes estão de mãos dadas, de modo que ao melhorar uma você também acrescenta habilidades na outra, muito embora o que chamamos de razão pode ser algo desconhecido, afinal temos uma mente que cria narrativas a todo instante.Vale mencionar também o belo trabalho realizado pela editora Objetiva e pela tradutora, Camila Mello, que acrescentou muitas informações explicativas sobre diversos termos específicos da cultura e instituições norte-americanas. Parabéns!Um livro que certamente lerei novamente e que consultarei as inúmeras anotações que fiz."}, {"userName": "Jess Dollar", "userReviewDate": "Dec 02, 2011", "userURL": "http://www.goodreads.com/user/show/6514697-jess-dollar", "userReview": "Wow... a must read. I didn't love this book. I think a better word is \"cherished\". I loved the concept, I loved the breadth of it, I loved that it made me cry while talking about neuroscience. How to describe it...it's a book on neuroscience and what this new field is teaching us about being human. I've read a bunch of books like this, so many that I get annoyed when I read the inevitable references to the same studies, same researchers, same books. I think it must be a rule that every book on this subject must include the following:Reference to Flow and optimal experience.The marshmallow test.Mirror neurons and monkeys and Giacomo Rizzolatti.Vilayanur S. Ramachandran or Oliver Sacks and a poor stroke or epilepsy patient that can't recognize his mother.One or more books on music and the brain such as \"This is your brain on music\".Descartes' Error.I appreciate all of the above but it's annoying to read about them ALL THE TIME. I read about them in this book, too, but I can forgive it because this book gave me something new. It wasn't new science. It was a new way to experience the same science, and THAT is priceless. I loved reading how this science is changing our world and how we engage it. Brooks focused on business, politics, and poverty in a way that can really change they way you engage with these huge issues. The entire book is based on fictional characters living their lives, which allows Brooks to explore all kinds of mega-issues in a small context. It's really priceless in the way it brings neuroscience and social science together. Our future is changing and how we fix our problems will change based on the relatively new field of neuroscience, and this book explores that future in a hopeful, intelligent way."}, {"userName": "Nick Davies", "userReviewDate": "Apr 23, 2016", "userURL": "http://www.goodreads.com/user/show/51454575-nick-davies", "userReview": "An interesting idea - that of writing a book about sociology and the importance of both ‘rational’ and ‘emotional’ (or instinctive) thought - but doing so in the style of a novel. It’s a framework which I felt worked well in places, covering a wide range of areas of sociology and psychology, as well as diving into politics as well. However, it did prove a bit disappointing overall, to me. My main reasons for this were that the ‘novel’ style sat slightly uncomfortably, because it meant that the central characters had to experience every single aspect of sociology etc. that the author wished to write about. This felt quite contrived (necessarily so) and I consequentially couldn’t care much about these people because as a consequence they felt less real and more like ‘a representative character’ in nature. Additionally, due to the nature of the field in which he was writing, and my prior interest in the subject, most of what the author had to say I already knew. Some of the rest was US-centric political stuff which didn’t interest me very much. Nevertheless, an easy and thought-provoking read, perhaps better suited to the less scientifically anchored reader."}, {"userName": "Andy", "userReviewDate": "Apr 24, 2011", "userURL": "http://www.goodreads.com/user/show/1980223-andy", "userReview": "This is definitely worth a read if you're interested in how the brain works. Brooks sets out to show that intelligence alone can't make a person successful. He argues that the key to success lies in harnessing the power of the subconscious mind--which, as the book's title suggests, requires the right kinds of interactions with people and institutions. Brooks explores this theory and its implications for learning, decision making, morality, politics and a lot of other areas. As he makes his case, Brooks presents a lot of interesting research on this stuff in a very accessible way (think Malcolm Gladwell).Although Brooks sold me on his theory of how the brain works, I didn't buy some of the practical lessons he drew (especially the ones related to politics). The conceit he used to organize the book also got on my nerves after a few hundred pages. Still, the book gave me a new perspective on the brain and human behavior--definitely worth the time.(Side note: I'd rate this 3.5 stars if I could.)"}, {"userName": "Keytrice Castro", "userReviewDate": "Apr 12, 2011", "userURL": "http://www.goodreads.com/user/show/4805645-keytrice-castro", "userReview": "I read The Social Animal: The Hidden Sources of Love, Character, and Achievement, by David Brooks, after seeing it on Amazon.com’s Bestsellers list. I have one major problem with this book, so I’ll mention it first—the hypothetical (and very stereotypical) characters he uses in the book. I understand the subject matter is weighty and its difficult to find true examples that exemplify everything he discusses in the book, but that’s all the more reason to stick to real anecdotes—the thoughtfulness of the content should be backed by worthy examples or everything becomes very discredited. But with that being said, the book IS very well-articulated, and although dull at moments, is a very smart read. Unfortunately many authors to books that analyze our society fall short of the writerly skill of storytelling, making their work very medical, and not-so-entertaining. Brooks only partially falls into that category, because the characters that I criticized just moments before paint pictures for us that bring issues like career, culture, morality, and self-control back to life."}, {"userName": "Troy Blackford", "userReviewDate": "Dec 09, 2015", "userURL": "http://www.goodreads.com/user/show/4177031-troy-blackford", "userReview": "I couldn't wait for the inanity to be over.This book gives you the impression that David Brooks always wanted to be a novelist rather than a journalist. About 70%-80% of this book is a fictionalized account of two people, who go through dramatic changes whenever it suits the popular psychology Brooks wants to talk about. It almost seems like he wrote a bad novel, his publisher responded with 'What do you expect us to do with this?' and he added in a little bit of pop psychology cliches to repackage it as a non-fiction book. The sad thing is: that's probably not what happened.This book is sweeping in its scope, which is too bad because it's full of tendentious hogwash. Thusly, you get a panoramic view of ill-conceived balderdash."}, {"userName": "Friederike Knabe", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/1746401-friederike-knabe", "userReview": "Interesting in parts. I am not sure the integration of the life story of a fictional couple from infantcy to old age with popularized aspects of neurological, social and other science really works. One can argue the fundamental positions but they tend to get lost in an overoad of details. On the other hand Brooks uses broad generalizations that are not substantiated."}, {"userName": "Theresa", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/368236-theresa", "userReview": "I can’t fault the book for being ambitious. It attempts to be a character-driven work of nonfiction—aggregating compelling statistics and factoids from various areas of the research realms (sociology, tech, neuroscience, politics, etc.)—delivered through the vehicle of a married couple’s life. But its unevenness is inevitable. A book can’t do proper character work when communicating information is the driving motivator rather than story. Also it can’t be avoided that certain aspects of the human experience are going to be left out when choosing a particular couple that speaks to as many “universal” experiences as possible. Especially now at this particular time in the world, so many urgent issues have come to the forefront of the American psyche. I couldn’t help feeling the book was dated despite much of the research still holding true."}, {"userName": "Sunil Maulik", "userReviewDate": "Jan 16, 2012", "userURL": "http://www.goodreads.com/user/show/3664388-sunil-maulik", "userReview": "I would give this book ten stars if I could! David Brooks has truly written a magnum opus - one that seamlessly weaves together decades of research in the neuroscience and psychology of the mind into a single coherent narrative that is both a literary and technological tour de force. Starting with an (admittedly slightly hokey) premise that follows the birth, childhood, adolescence and adulthood of two completely opposite archetypes trapped in the ubiquitous present, Brooks cleverly overlays a wealth of scientific knowledge illuminating the underlying reasons why they behave the way in which they do. At times scabrously witty (Brooks is particularly good at skewering the uber-wealthy, Aspen-, Davos- and Hampton-inhabiting set, while politicians on both the left and the right are unmercifully lampooned), Brooks ushers in mellifluous prose that combines the inner- and outer-worlds of his principal characters into a seamless whole. Far better than all the blinks, nudges, switches et al. in synthesizing decades of research into a readable whole, what truly distinguishes Brooks' work from other popularizations is the beauty of his prose. (The chapter on the sunset years and eventual death of one of his protagonists is particularly moving).I have read a number of the criticisms of this book and found all of them wanting: one school of thought posits that while knowing the underlying neuroscience of what moves us is of only academic interest since it does nothing to help us modify our behavior. This criticism is facile. Brooks not only points out what we can do to effect a more complete mindfulness (e.g. engaging both our level 1 and level 2 brains by partaking in both artistic and technical training); Indeed he proposes a new, societal approach to politics that shows us that many of the seemingly intractable problems of today (poverty, income inequality, inferior education), are social problems refractive to the classic cudgels of money and regulation. Only by engaging these emergent systems with social, behavior-based approaches can we transition our society from its current partisan impasse to a higher level. Brooks compares the French enlightenment with that of the British and argues that the latter better understood the 'animal spirits' and 'moral sentiments' that truly move society: What Brooks has done is to show, not tell us how to make this possible in this evocative tome that marries science with literature in a way that would make both Proust and Priestly proud."}, {"userName": "Schmacko", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/1242165-schmacko", "userReview": "With the advent of just a few things, the science of social psychology has changed significantly. First of all, scientists used to only be able to study humans from outside their own brains, but now fMRI helps us understand what happens inside the deep recesses of the cognitive and emotional brain as people operate. What we’ve found is one of the most profound discoveries of the human brain; about 82 percent of what we do is subconscious or unconscious, built on a deep history of human nature, genetics, past behaviors, personality, culture, habit, physical environment, pattern, situation and cue. No longer do we humans seem the masters of our individual destinies.Another great tool is the advent of social media to track people’s connections and behaviors. It seems crazy, but studying what a person posts and who a person connects with, how, and how often can give a wealth of information that used to take months or years to gather. And now, people do the work for you!Brooks write a book about the information based on all this new data and insight. He provides as a frame a typical American couple, starting when they were children – one is from a semi-affluent family, one has drifted between lower-middle class and poverty. One is Caucasian, one is mixed race. One has certain personality traits; one has others. They become a couple; their behavior changes.As Brooks discusses his fictional test subjects, he gives the reader the new data. It’s a good idea, if not entirely original. (Even Brooks admits others have done it.) Brooks succeeds more strongly when he also acknowledges the emotional pull this data has instead of just spouting facts. As the poor girl tries to get into a charter school, she makes an emotional connection with the school’s rich, gauche donor. This is a real human story that has data and punch. Not everything does.In fact, Brooks – even with some awesome new information – can make his characters a little dull, a little flat, a little lifeless. Things like death and divorce are drained of heart. I understand this wasn’t his point in this book, but he could’ve really set his information apart from others by doing this, being a bit more of a creative fiction writer and telling us the science that got him to those moments of imagination."}, {"userName": "Megan", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/1215485-megan", "userReview": "This book is the fictional story of an American couple, Harold and Erica, and their journey through life (suspended in time in the early 21st century). The author uses Harold and Erica's lives to serve as a jumping off point for the points he wants to make about psychology, culture, and human nature.I really enjoyed this book in the beginning; it starts off with a look at how Harold's parents met, then goes into infant development and also into Erica's childhood. However, as the two subjects grew older, I grew less interested in the book. I don't think it was necessarily because the two grew older, but I think because I felt less grounded in the story of the couple. Their lives are pretty darn incredible for two random people on the planet. They had to have incredible lives to follow the path that Brooks wanted them to take so that he could make the points he wanted to make, but it sort of took away from the realism of the beginning and the ordinary-ness of the first few chapters.There are a lot of interesting points in this book and Brooks is really good at taking lots of information and research studies and putting it down so that it all makes sense together, in relation to human nature. That stuff was really good. And the sense of humor is really nice - I liked the wry look at some of the topics, and it wasn't all super serious.I absolutely hated one part - the politics section. I just couldn't relate to Erica and Harold anymore, and I hate politics to start off with, so I just didn't care about it at all. It literally nearly put me to sleep - I almost dozed off on the couch.Afterwards, when Erica and Harold begin exploring old age and retirement, and how it changes a person, including the way they are viewed by society, it became interesting again. That's basically when Erica and Harold went from superstar entrepreneurs/CEOs/famous history book authors/major government officials (all in one couple) back to normal. I liked that.This was a really interesting book with an interesting premise, but I wanted more from it. More of the beginning and the end, less of the middle."}], "description": "With unequaled insight and brio, David Brooks, the New York Times columnist and bestselling author of Bobos in Paradise, has long explored and explained the way we live. Now, with the intellectual curiosity and emotional wisdom that make his columns among the most read in the nation, Brooks turns to the building blocks of human flourishing in a multilayered, profoundly illuminating work grounded in everyday life.This is the story of how success happens. It is told through the lives of one composite American couple, Harold and Erica—how they grow, push forward, are pulled back, fail, and succeed. Distilling a vast array of information into these two vividly realized characters, Brooks illustrates a fundamental new understanding of human nature. A scientific revolution has occurred—we have learned more about the human brain in the last thirty years than we had in the previous three thousand. The unconscious mind, it turns out, is most of the mind—not a dark, vestigial place but a creative and enchanted one, where most of the brain’s work gets done. This is the realm of emotions, intuitions, biases, longings, genetic predispositions, personality traits, and social norms: the realm where character is formed and where our most important life decisions are made. The natural habitat of The Social Animal.Drawing on a wealth of current research from numerous disciplines, Brooks takes Harold and Erica from infancy to school; from the “odyssey years” that have come to define young adulthood to the high walls of poverty; from the nature of attachment, love, and commitment, to the nature of effective leadership. He reveals the deeply social aspect of our very minds and exposes the bias in modern culture that overemphasizes rationalism, individualism, and IQ. Along the way, he demolishes conventional definitions of success while looking toward a culture based on trust and humility.The Social Animal is a moving and nuanced intellectual adventure, a story of achievement and a defense of progress. Impossible to put down, it is an essential book for our time, one that will have broad social impact and will change the way we see ourselves and the world.From the Hardcover edition.", "title": "The Social Animal: The Hidden Sources Of Love, Character, And Achievement", "url": "http://www.goodreads.com/book/show/35543919-the-social-animal", "average": 3.84, "cover": "https://images.gr-assets.com/books/1498753244l/35543919.jpg", "reviews": 1565, "authors": [{"url": "https://www.goodreads.com/author/show/3136576.David_Brooks", "name": "David  Brooks"}], "type": ["Psychology", "Nonfiction", "Sociology", "Social Science", "Science"], "outlinks": ["http://www.goodreads.com/book/show/35543919-the-social-animal", "http://www.goodreads.com/book/show/10031670-the-social-animal", "http://www.goodreads.com/book/show/9628743-the-social-animal", "http://www.goodreads.com/book/show/21894262-o-animal-social", "http://www.goodreads.com/book/show/12248558-the-social-animal", "http://www.goodreads.com/book/show/11175860-the-social-animal", "http://www.goodreads.com/book/show/22551809-the-road-to-character", "http://www.goodreads.com/book/show/106330.Bobos_in_Paradise", "http://www.goodreads.com/book/show/141603.On_Paradise_Drive", "http://www.goodreads.com/book/show/10281561-the-paradise-suite", "http://www.goodreads.com/book/show/262015.Backward_and_Upward"]}