{"ratings": 119, "userreviews": [{"userName": "Matt", "userReviewDate": "Feb 09, 2009", "userURL": "http://www.goodreads.com/user/show/1205220-matt", "userReview": "When I was younger, I spent endless hours in the history sections of college library browsing through the history books looking for concrete lists of facts, numbers, measurements, parts, names, and well lists that I could gather and utilize in my role playing games. Every such book was viewed through a lens of how much data it could provide to my simulations, and with few exceptions most were judged unworthy being filled with dry stories and no concrete facts.Now though, it seems every historian out there is ready to cater to my earlier needs. Facts are collected and drawn up in tidy little lists, and everything is categorized and laid out in logical sections as if ready to draw up the requirements or setting encyclopedia for the latest wargame or RPG. And naturally, far from content, I find myself missing history that was stories and contained long direct quotes from the real life characters. So it is with this book. I'd have loved 25 years ago.It's still an excellent introduction to the subject matter, and might be a decent 'sophomore text book' on the Age of Piracy. But as History, it needs more story in it, and a bit more history rather than just a study and summary of history, however well organized it is. I found myself yearning for the actual journals that were the author's source material, and wished for more direct views into their contents. Most of all, I would have preferred more detail about how it was actually done, with examples. It's all well and good to say that the Pirates preferred an ambush, but how was that actually accomplished on the open sea with boats that would sail 3mph or so in a fair wind? What customary behavior might ships have had that allowed a nare-do-well to cozen his prey into close range? We glimpse the scene I think too dimly, and with too little information. The only hints we are given are brief mentions of flying false colors and hiding your crew below decks so as to seem more harmless than you are, but I think that's probably only a taste of a broad range of aiming to misbehave."}, {"userName": "Zeb", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/3072179-zeb", "userReview": "Excellent study of how pirating worked (or didn't) in the Golden Age of Piracy. Would have liked a little bit more on the political/social dynamics of pirates in port, etc. but overall solid work."}, {"userName": "Evan", "userReviewDate": "Nov 10, 2013", "userURL": "http://www.goodreads.com/user/show/1256809-evan", "userReview": "The Sea Rover's Practice is one of the most phenomenal pieces of enthusiast history, if not one of the most engaging history books, that I've ever read. This book is near the top of the small list of pirate non-fiction literature; for anyone with an interest in the era, Little is required reading along with Exquemelin, Johnson, and Cordingly.The best part of the book is how well-researched it is. There are footnotes, numerous appendices, and hardly a paragraph passes without an excerpt from a fascinating first-hand source. The Sea Rover's Practice is crammed with 1001 delicious factoids. The only downside is that the prose can be workmanlike. Some chapters are harder to get through than others. I found my eyes glazing over far too often for such engaging material. Even with all his enthusiasm, Little can be a little dull.Here are but two random samplings of the treasure trove of 'fun facts' on offer within The Sea Rover's Practice:The simple act of leaping from one ship to another was dangerous, not only because of enemy fire, but because the two ships were working board and board. Duguay-Trouin was stunned during his first boarding action when the ship's master fell between the two vessels and was crushed, part of his brains splattering the young officer. This gruesome death gave Duguay-Trouin pause, as he had not yet found his sea legs and wondered if he could get across without being similarly crushed. The French eventually took their prize \"sword in hand\" after three consecutive boardings....Besides drink there was food, fresh and cooked well, a relief from a ship’s rations. In the West Indies turtle flesh was a common cure for everything, and although plentiful in the region, it was so very popular that it was even imported from the Canary Islands. Turtle liver was “very wholesale, searching and purging,” and such purging was necessary. Between the diet of salt flesh and hard liquor at sea and the diet of fatty flesh, far too much hard liquor, and sexually transmitted diseases ashore, the sea might have been the healthier environment of the two. Besides the qualities of turtle liver, turtle oil was believed good for strains and muscle aches, and the flesh was not only a good antiscorbutic but also an “Antivenereal Diet.” For what it’s worth, eating the liver dyed one’s stool black, and the fat turned urine sea green."}, {"userName": "Bill", "userReviewDate": "Nov 12, 2011", "userURL": "http://www.goodreads.com/user/show/3090558-bill", "userReview": "The Sea Rover's Practice by Benerson Little, is a great read for those who want to delve into the tactics and techniques used from 1630 to 1730 by pirates and privateers in the Caribbean. Author Little is a former Navy SEAL who also teaches fencing. His love of history, military experience, and his skill with swordplay is very apparent in this highly readable book. For those of use who want to delve deeper into the subject of piracy, his appendices are invaluable. I also very much appreciate that Little has taken the trouble to keep an updated PDF file of errata and commentary for this book on his author's web site, www.benersonlittle.com.I very much enjoyed the way Little draws numerous parallels between the 17th and 18th century sea raiders and modern special operations units like the U.S. Navy SEALs. Little calls attention to the intelligence gathering activities used by sea rovers to select their targets and corroborate information. Little reveals the sea rovers as sophisticated operatives who used their knowledge of the sea to carry out successful shore raids and take valuable cargo at sea.Little has written a number of books on pirates. I also have How History's Greatest Pirates Pillaged, Plundered, and Got Away With It: The Stories, Techniques, and Tactics of the Most Feared Sea Rovers from 1500-1800 and I will review this book shortly. Little's book, Pirate Hunting:The Fight Against Pirates, Privateers, and Sea Raiders From Antiquity to the Present is high on my to-read list."}, {"userName": "Becky", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/6316460-becky", "userReview": "History books that are written by enthusiasts rather than professionals, can be hit or miss. Almost always they are more entertaining, but their accuracy can sometimes be questionable. This is not the case with Little, you really get the whole package. It’s fascinating, well written, expertly researched and documented. Now, is this a book for everyone? No, but if you have ANY interest in maritime history its certainly the book for you. For beginners just looking for something a little piratical I would refer them to Peter Cordingly’s “Under the Black Flag.” Its definitely an authoritative work, probably a little advanced for beginners, but absolutely fascinating the whole way through. One of my best maritime reads in years."}, {"userName": "Nicholas", "userReviewDate": "Oct 23, 2010", "userURL": "http://www.goodreads.com/user/show/1052384-nicholas", "userReview": "Boring as fuck.Quotes:\"Any leader is bound to see his crew turn against him if he takes their material gains, whatever their degree of consent or participation in the process.\"\"The sea rover put his body in harm's way in the service of his greed.\""}, {"userName": "Scott", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/20862076-scott", "userReview": "Superior research material for those interested in learning about piracy in the late 17th and early 18th centuries, particularly in the Caribbean. Exhaustively detailed, but engaging facts and accounts about the privateers, filibusters, pirates, and merchant trade."}, {"userName": "MeltingPenguins", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/62346413-meltingpenguins", "userReview": "Pretty good research material, though as I know a good chunk of the sources, I can't help but feel that in some cases Mr Little did draw conclusions that suited his personal wishes/views more than what was likely going on in reality.Still, very good research material."}, {"userName": "Jack", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/1062937-jack", "userReview": "So you want to be a pirate? Well what's it take be a pirate? You can watch old Hollywood movies (sorry - too much fantasy in ol' Jack Sparrow) or you can read 'The Sea Rover's Practice' by Benerson Little.So you have Errol Flynn and Burt Lancaster and other Hollywood types on one side and Little's book based on primary source material.The movies are fun to watch; the book is loaded with facts- real facts.From what they ate and drank to how they got paid (if they did. Sometimes the poor boys didn't) to the weapons and tactics they used.Well written; well documented; full of information.A very good book."}, {"userName": "Mary C", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/7266310-mary-c", "userReview": "I strongly recommend that potential readers disregard the one star review by “Nicholas” of Goodreads and instead survey the reviews on Amazon.com or, even better, the very positive legitimate reviews by noted journals and book reviewers, including The Mariner’s Mirror, The Historian, The Naval Review, the Naval War College Review, The Midwest Book Review, Sea History, and others, many of which are excerpted on the author’s website. A few notable excerpts are on the book’s Amazon page as well. As for Google Books, with all the reviews of Sea Rover’s Practice available, it should have a broader, better selection available, or at least the ability to link to them."}, {"userName": "Anton Tomsinov", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/22506695-anton-tomsinov", "userReview": "Typical low-grade American non-fiction: repetitive, primitive, full of triteness. This one also lacks structure and just throws a bunch of random facts. The author's constant ‘when I served in SEALS…’ remarks make it even more tiresome. Ex-SEAL tactical wisdom shines in conclusions that gunpowder gets wet if you put a musket into water (sic! no exaggeration here). And say what you want but ‘African Americans‘ in the Spanish Caribbean of the 17th century is a silly anachronism."}, {"userName": "Michael Thompson", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/22061077-michael-thompson", "userReview": "Benerson Little is a trusted source about Pirates. He's involved as a consultant with the popular series Black Sails and his reference books read with the type excitement and entertainment you'd expect from a novel. I've read this book twice and use it constantly for reference."}, {"userName": "Angela", "userReviewDate": "Aug 09, 2010", "userURL": "http://www.goodreads.com/user/show/378675-angela", "userReview": "Really interesting book, with a lot of great detail and information about piracy in this period. I recommend having a decent basic knowledge of sailing before reading this. Otherwise the sections that directly involve sailing and the tactics pirates used will probably be confusing."}, {"userName": "AKA", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/43585007-aka", "userReview": "Thorough and detailed. Author is an ex-SEAL and historicizes as one of the buccaneers, or one following in their ethos.Best flipped through, as there's no real order to the sections."}, {"userName": "Scott", "userReviewDate": "Nov 23, 2012", "userURL": "http://www.goodreads.com/user/show/4018253-scott", "userReview": "Interesting to have the modern perspective of a Navy SEAL on historical golden age of piracy tactics and logistics. Well thought out and very insightful."}], "description": "To read of sea roving's various incarnations - piracy, privateering, buccaneering, la flibuste, la course - is to bring forth romantic, and often violent, imagery. Indeed, much of this imagery has become a literary and cinematic clich?. And what an image it is! But its truth is by halves, and paradoxically it is the picaresque imagery of Pyle, Wyeth, Sabatini, and Hollywood that is often closer to the reality, while the historical details of arms, tactics, and language are often inaccurate or entirely anachronistic. Successful sea rovers were careful practitioners of a complex profession that sought wealth by stratagem and force of arms. Drawn from the European tradition, yet of various races and nationalities, they raided both ship and town throughout much of the world from roughly 1630 until 1730. Using a variety of innovative tactics and often armed with little more than musket and grenade, many of these self-described \"soldiers and privateers\" successfully assaulted fortifications, attacked shipping from small craft, crossed the mountains and jungles of Panama, and even circumnavigated the globe. Successful sea rovers were often supreme seamen, soldiers, and above all, tacticians. It can be argued that their influence on certain naval tactics is felt even today. \"The Sea Rover's Practice\" is the only book that describes in exceptional detail the tactics of sea rovers of the period - how they actually sought out and attacked vessels and towns. Accessible to both the general and the more scholarly reader, it will appeal not only to those with an interest in piracy and in maritime, naval, and military history, but also to mariners in general, tall-ship and ship-modeling enthusiasts, tacticians and military analysts, readers of historical fiction, writers, and the adventurer in all of us.", "title": "The Sea Rover's Practice: Pirate Tactics and Techniques, 1630-1730", "url": "https://www.goodreads.com/book/show/124115.The_Sea_Rover_s_Practice", "average": 3.89, "cover": "https://images.gr-assets.com/books/1348971364l/124115.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/71447.Benerson_Little", "name": "Benerson Little"}], "type": ["History", "Adventure", "Nonfiction", "Reference", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/124115.The_Sea_Rover_s_Practice", "http://www.goodreads.com/book/show/8299202-the-sea-rover-s-practice", "http://www.goodreads.com/book/show/497833.The_Sea_Rover_s_Practice", "http://www.goodreads.com/book/show/28818887-the-golden-age-of-piracy", "http://www.goodreads.com/book/show/9392025-how-history-s-greatest-pirates-pillaged-plundered-and-got-away-with-it", "http://www.goodreads.com/book/show/6764151-pirate-hunting", "http://www.goodreads.com/book/show/1967870.The_Buccaneer_s_Realm", "http://www.goodreads.com/book/show/28351810-fortune-s-whelp"]}