{"ratings": 13108, "userreviews": [{"userName": "Carol. ", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "Seven Dials is Christie's subversion of the 1920s style thriller, only with a plucky female heroine and a subtle commentary on English society. A manor murder, a secret society, a slummy club in the East End, and international espionage that make it seem artificially complicated, but it was enjoyable enough, with a few chuckles and a sweet little romantic angle to neatly round it out. A group of young people gather at the English estate the Chimneys, rented out to steel magnate Sir Oswald and his wife, Lady Coote. One of the young men visiting has a propensity for coming late to breakfast, so the group forms a plan to plant eight alarm clocks in his room to wake him with a violent noise. Coincidentally, he never wakes again. Lord Caterham owns the manor, and his daughter, Lady Eileen Brent, \"known to her friends and society in general as \"Bundle,\" becomes involved when she realizes she knows several of the people involved. Besides, it'll be smashing good fun, right? Her father's an old dear straight out of Wodehouse--he might have been Bertie in 50 years. \"They needn't die in my house,' said Lord Caterham... 'Naturally I expect Brents to die here--they don't count. But I do object to strangers. And I especially object to inquests.'\"Initially, Bundle is just satisfying her curiosity about poor dead Gerry as she pokes around the house. She finds part of a letter she feels she should deliver to his surviving sister. As she's taking the car out for a quick errand, she runs into a man in the road. Not long after, she joins forces with one of the men in the house party who works for the government, and then the sister of the murdered lad. Investigation takes them from the countryside to a seamy club to a political house-party. If you forget the murder, it's charming fun.Therein lies my greatest problem with the story: tone. Murder mystery? Light-hearted romp through the English countryside? Mock-up of English society? Daring espionage thriller? It just doesn't quite work. A forward discusses Christie's similarity with Wodehouse, and while I can understand, part of Wodehouse's charm is the sheer daffiness of the capers, and the utter inconsequence of any of the events. However, with one murder down and state secrets at stake, her social commentary doesn't jibe as well as it could with the plot. Characters, however stereotypical, are drawn with depth. Christie could be master of the subtle, and one of my favorite characters by far was Lady Coote who kept her aggressive husband firmly in check through seemingly daffy actions and her ability to cheat at bridge. Oh, and perhaps \"the girl called Socks. Subtle was a word of which she was rather fond. She used it a great deal.\" Her lines were great fun as well, especially when she forces the use of subtle in a most unsubtle way:\"'We don't want a subtle clock,' said Socks. 'We want one with a good loud ring.'\"Overall, enjoyable without being gripping or especially memorable. One of Christie's more light-hearted stories.*Note--read and owned as part of Murder At The Manor: An Agatha Christie Lost Classics Omnibus"}, {"userName": "karen", "userReviewDate": "Apr 14, 2007", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "Jimmy Thesiger"}, {"userName": "Kaya Dimitrova", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/33420591-kaya-dimitrova", "userReview": "Агата Кристи до момента не ме е разочаровала и тази книга не прави изключение. Въпреки че романът не ми се стори на нивото на останалите нейни, които съм чела, беше достатъчно непредсказуем, увлекателен, заплетен и напрегнат, за да ме държи на тръни с всяка една своя страница."}, {"userName": "Simona Bartolotta", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/5312173-simona-bartolotta", "userReview": "Not as intriguing as I thought it would be, but the surprising ending almost makes up for how uninteresting all the rest was."}, {"userName": "Ginia", "userReviewDate": "Nov 02, 2009", "userURL": "http://www.goodreads.com/user/show/1540545-ginia", "userReview": "I've decided that you cannot go wrong with Agatha Christie. Her books are character driven and sometimes I get confused about who's who, but she never fails to keep me reading on. This was a test in who-dun-it skills which I need to master. I thought that the Superintendent/police chief was the bad guy. I got it all wrong. The story is wrapped up in tons of funny, aristocratic dialogue. And then all of a sudden Christie adds a couple of sentences like this: There is no need to describe in detail the conversation of the next ten minutes. It consisted mostly of repetitions.Classic! It's funny because before you get to this sentence there seems to be ten minutes of a gushy love scene full of repetitions.On the whole, a good historic/espionage/who-dun-it. I'm a huge fan. Now onto the next one. Crooked House or Ordeal By Innocence?"}, {"userName": "Bill", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/4380068-bill", "userReview": "I enjoyed this Agatha Christie mystery very much. It had quite a different feel to it from the Miss Marple and Poirot mysteries. Dare I say, it was almost an adult Nancy Drew (ish) style mystery; mainly due to the fact that the protagonists were young people, rather than the more mature sleuths that Christie peopled her stories with. You find wealthy, carefree, Lady Eileen (aka Bundle) Brent and Jimmy Thesiger and their acquaintances trying to solve the murders of two of their friends. What it the Seven Dials group? Who are the mysterious members? I thought it was a pretty standard thriller/ mystery, but in the last section, there were many twists and turns and any guesses I had about the culprit and the mysterious group were turned on their heads. Excellent story."}, {"userName": "Obsidian", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "Wow. This was so good. I took a while to read this one since the first few pages didn't grab me at all. However, when I finally went back to it, I was totally engrossed. We have the second book in the Superintendent Battle series. I read \"Cards on the Table\" a few years back and realized that was considered the 3rd book in his series and decided to work back from book 1. I finished \"The Secret of Chimneys\" and just gave it three stars. Christie does such a great job with not showing her hand until the very end. Believe me I went what the what at the ending and had to go back and re-read after all is revealed.\"The Seven Dials Mystery\" starts off with house guests staying at Chimneys. It seems to be a lively group of bright young things who decide to play a joke on one of the young men who seems to oversleep every day. The joke goes off without an issue, but then a young man, Gerry Wade, is found dead. \"The Seven Dials Mystery\" for the most part follows two characters throughout. Lady Eileen Brent (otherwise known as Bundle) and Jimmy Thesinger. Jimmy was staying at Chimneys when Gerry died, and many think it was an accidental overdose. However, when Bundle comes across another man who was staying at Chimneys who was shot to death, she and Jimmy team up to figure out what connection there is between these deaths and a place called Seven Dials. Bundle was awesome. I loved her. I wish that we got another book starring her. She was definitely a mini-Miss Marple/Poirot. Once she realizes that something is going on, she is determined to do whatever it takes to solved the mystery of Seven Dials. She does go and meet with Superintendent Battle who I liked way much more in this one than in book #1. Jimmy Thesinger seems happy to play a fool (not an ass) and realizes that things are pretty deep when Bundle brings him the connections between two deaths and Chimneys. He starts investigating and starts suspecting some higher ups in society.The book's ending was so freaking awesome I had to go back and re-read this as soon as I finished."}, {"userName": "Nahed.E", "userReviewDate": "Mar 30, 2015", "userURL": "http://www.goodreads.com/user/show/37363150-nahed-e", "userReview": "جميع روايات أجاثا كريستي تتميز بالحبكة الشديدةلدرجة أنه من الصعب عليك أن تحل اللغز في النهاية هذه الرواية غامضة للغايةوقد اتعبتني جداخاصة في كثرة الأحداث والأسماء المتشابهةولكنني - وعلي غير العادة - لم أستمتع بها كثيراً أثناء القراءةفعادة ما أشعر أثناء قراءتي لروايات أجاثا أنني واحدة منهمأحيا مع الابطال ، اركض معهم ، وأخاف مثلهم ، واخاف عليهمأترقب وانتظر ثم اندهش في النهايةواغلق الرواية في متعة كبيرةهذا للأسف لم يحدث في هذه الروايةوقد تكرر شعوري هذا في رواية أو روايتين سابقتين فقط من ضمن عشرات الروايات التي استمتعت بها يبدو أن القراءة لأجاثا كريستي تحتاج لحظ كبير في اختيار عنوان روايتكفأنت وحظك (:ولكنها تستحق المغامرة"}, {"userName": "Lily", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/21047992-lily", "userReview": "The Seven Dials Mystery is a fast paced and a very enjoyable book. Some of the characters are from another Christie novel, The Secret of Chimneys. As a huge fan of the queen of crime and whodunits, I had a very nice time reading this book and I was satisfied with the ending which was surprising and full of twists. Agatha Christie always gives the best mystery and it’s never disappointing!"}, {"userName": "Kavita", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/5858699-kavita", "userReview": "A young man dies while on a visit to a country house, and very soon a secret society is suspected of murdering him. We have the dead man's sister, a young man working at the Foreign Office, our heroine, Eileen Brent aka Bundle, a Police Superintendent, and a young man working in politics, all more or less banding together to solve the mystery.This book is written in a very light vein and there is plenty of humour in the Wodehouse style. But unlike the other Christie books, this one somehow lacks substance. The plot is a little far-fetched and I really resented that Bundle was set up as a heroine by the author but then made a fool of at the end by others. Why didn't they tell her about their own suspicions instead of acting all high and mighty about it? The mystery was never solved for me. It was all about some vague plot about papers of international importance stolen and then somebody randomly 'solved' the mystery without letting us readers in on it, while we, along with Bundle, were off on a wild goose chase. How did anyone ever begin to suspect the murderer? Nothing about this part is made clear. It was a fun read because of all the quirky characters but it all led nowhere in the end. and made no sense at all. AC should never have forayed into spy thrillers genre."}, {"userName": "BrokenTune", "userReviewDate": "Dec 12, 2014", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "\"The clocks were wrapped up and paid for. Mr Murgatroyd watched the cars drive away with a puzzled air. Very spirited the young people of the upper classes nowadays, very spirited indeed, but not at all easy to understand. He turned with relief to attend to the vicar’s wife, who wanted a new kind of dripless teapot.\"There is a lot to like about The Seven Dials Mystery. The spirited young people, the charming older generation, the country house setting - complete with a despotic gardener, London nightlife, and of course a murder which could not have possibly been committed.A fun read with a twist."}, {"userName": "Ivonne Rovira", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/3803671-ivonne-rovira", "userReview": "Expect no Hercule Poirot, no Miss Jane Marple, no Tommy nor Tuppence Beresford; however, Superintendent Battle does just fine in The Seven Dials. The mountainous but subtly clever policeman manages to solve two murders and break an international ring of crooks in a cozy that will engage you to the very last page.The caper begins with the death of a guest at — this is Dame Agatha Christie, after all — a house party. The deceased’s half-sister, the deceased’s friend, and another young woman, Lady Eileen Brent — Bundle Brent to her friends, who featured in Battle’s first novel, The Secret of Chimneys — launch an investigation. In due course, the trio stumble onto a conspiracy to commit a crime with international repercussions.Christie crafted a four-star cozy up until the ending, which was so surprising and suspenseful that it bumped my rating up to a five. Superintendent Battle may not be a household name like Poirot and Miss Marple, but, as I said, he does all right in The Seven Dials."}, {"userName": "Amy", "userReviewDate": "Jul 21, 2015", "userURL": "http://www.goodreads.com/user/show/2329228-amy", "userReview": "An absolutely wonderful gift from Tori.I had no idea Agatha Christie was so absorbing. This book was on par with Georgette Heyer, P.G. Wodehouse, Dorothy Sayers, Robert Benchley...even Helene Hanff! I suppose it shouldn't surprise me but that ending completely blew me away! Absolutely worth reading.Some of the names are a little odd and dated...Socks and Codders and Bundle...but I like the characters and the writing. I like how it feels old fashion and intelligent yet entirely readable. And that end! Excuse me while I interrupt myself to go re-read this novel with newly opened eyes..."}, {"userName": "Kirsti", "userReviewDate": "Jun 29, 2008", "userURL": "http://www.goodreads.com/user/show/933226-kirsti", "userReview": "A minor Christie work. Gets more interesting toward the end. Life among the upper classes gets a bit tiresome. Some of the main characters are named Bundle, Pongo, and Socks. It's as if the murder has been perpetrated and is being investigated by puppies."}, {"userName": "Laurel Young", "userReviewDate": "Oct 12, 2010", "userURL": "http://www.goodreads.com/user/show/3137295-laurel-young", "userReview": "The Seven Dials Mystery marked a return to form for Agatha Christie. Following the remarkable achievement of The Murder of Roger Ackroyd in 1926, she hit a terrible slump following the death of her mother. With a book due every year, she cobbled together some of her short stories into the abysmal Big Four, then hurried through Mystery of the Blue Train--which I didn't think so bad, but she was not proud of it acc to her autobiography. Seven Dials takes us back to Chimneys, the country manor house of The Secret of Chimneys (1925), and with it a return to the lighthearted adventure mode of some of Christie's early work.I admit frankly that I dislike most of the early adventure-mysteries and prefer the pure detection puzzles of her Golden Age, but Seven Dials is a treat. Christie would release Partners in Crime the following year, and clearly had already found her stride with creating charming young amateur sleuths. Bundle Brent (aka Lady Eileen Brent) is an absolute delight--wealthier than Tuppence but just as spunky and clever. Her friends are equally well-drawn, and Battle is an enjoyable detective even if less famous than Poirot or Miss Marple today.Much as I love Bundle, the best thing about Seven Dials is that it corrects the worst error of The Big Four. In that novel, Poirot contends with a gang of \"super criminals\" that is simply too outsized and silly to be borne. With Seven Dials, in complete contrast, the reader is given credit for intelligence once more--if a secret society sounds like something from a book, it's because it's a deliberate front; there are no master criminals or secret weapons. The ending was a complete surprise and shows that Christie's ingenuity had returned and she was back in top form. Hail to the Queen of Mysteries!"}, {"userName": "lydia", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/43905585-lydia", "userReview": "“You shouldn’t shoot people”, said Lord Caterham in a tone of mild remonstrance. “You shouldn’t really. I daresay some of them richly deserve it- but all the same it will lead to trouble.” Maybe it was the plot, maybe it was my reading slump, but I wasn’t really invested in the story. And when, finally, the murderer was revealed I felt quite disappointed; Christie doesn’t supply the reader with enough clues, so the big reveal seems rushed and out of place.On the other hand, her writing is, as always, extremely witty and although a modern reader could condemn her offensive comments and prejudice against the Jews or the Russians, we shouldn’t forget that Christie was a woman of her time, and such misconceptions were the norm among her class. After all, Christie criticizes the stuck-up English society even more, by creating quirky and lovable, yet laughable characters, such as Lord Caterham, Lady Coote and MacDonald, the gardener.Be as it may, I have strong suspicions that Lord Caterham is my spirit animal.“It's not death,” said Bundle. “It's marriage.”“Very nearly as bad,” said Lord Caterham."}, {"userName": "Kimberly", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/7837519-kimberly", "userReview": "I enjoyed Emilia Fox's narration of this audiobook. In this story, we're taken back to the Chimney's estate and we meet up with a cast of characters, some of which we were introduced to in The Secret of Chimneys. Bundle (Lady Eileen) is one of the characters that takes centre stage. And what a great character! Her energy and independence are captivating. She adds so much wit and sparkle to the story. Also prominent is Superintendent Battle who, as well as representing the authority of the novel, also serves as a type of Poirot character who puzzles out the mystery and knows all. Well, in the end anyway. Speaking of which, I was kept guessing right to the end. I was sure that I knew whodunnit, but was totally surprised. I liked the story wrap-up, but found it a bit far-fetched. Overall, a fun read. 3.5/5 stars"}, {"userName": "J.S.", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/3777762-j-s", "userReview": "Nearly gave up on this one several times. It turns out I should have."}, {"userName": "عبدالله", "userReviewDate": "Sep 02, 2016", "userURL": "http://www.goodreads.com/user/show/10007258", "userReview": "مالذي دعاني لشرائها؟ لا اعرف ولكن اعتقد بانه نوع من الحنين .. هناك العديد من الطبعات لقصص أجاثا تجعلني دائماً اتسائل عن طبيعة حقوق الملكية الفكرية هل هي مشاع وهل هي ترجمة واحدة ام تراجم مختلفة!!تعجبني القصص الكلاسيكية هناك قاتل ويتم البحث عنه، الا ان اكثر ما يزعج هو ان لكل شخص اربع اسماء عليك حفظها جميعها فالسيدة فكتوريا بيلاشوفا على سبيل المثال هي فيكا وهي فكتوريا وهي الانسة بيلاشوفا و..و..و ما يجعل المصاب بالزهايمر القرائي يعاني الرواية لطيفة وكلاسيكية"}, {"userName": "Ann", "userReviewDate": "Oct 03, 2007", "userURL": "http://www.goodreads.com/user/show/446509-ann", "userReview": "This was the first Agatha Christie book I read - and what a good choice! It's been ages since I've read it, but I'm still marveling at the plot! When trying to figure out \"who-dunnit\" I did consider the true culprit, but dismissed it instantly - oops! Not as light-hearted and fun as the Tommy and Tuppence series, but a wonderful mystery and a credit to Christie's writing abilities."}, {"userName": "Sıla", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/36743621-s-la", "userReview": "Başlarda sıksada sonunda şaşırttı. Polisiye kitaplardan her zaman uzak duran biri olarak, bana birazda olsa sempati kazandırdı bu alanda. Artık benzer senaryolar kendini tekrara başladığından, ancak 4 yıldız verebiliyorum."}, {"userName": "Michael", "userReviewDate": "May 15, 2012", "userURL": "http://www.goodreads.com/user/show/3222017-michael", "userReview": "I didn't think I'd ever be able to say this about one of Agatha Christie's books, but I didn't really care for this one that much so I'm just going to leave it at that."}, {"userName": "Carmen", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/25353295-carmen", "userReview": "Pretty good mystery. I like the nickname “Bundle”."}, {"userName": "Ashley", "userReviewDate": "May 02, 2017", "userURL": "http://www.goodreads.com/user/show/43590107-ashley", "userReview": "Rating: 4.5/5(I listened to an audio version, so please excuse any spelling errors for names)***Minor spoilers***First, Gerry Wade was found dead at Chimneys, believed to have overdosed on a sleeping draught. While this may have seemed suspicious because Gerry never took any sort of sleeping draught before, there was nothing really to suspect it was a murder. Not long after, though, a woman named Lady Eileen Brent, nicknamed Bundle, comes across a man in the street who appears to be dead. As she investigates, she hears his final words - something to do with \"Seven Dials\" and \"tell Jimmy Thesiger\" before he dies. Believing that something having to do with Seven Dials was the cause of death, Bundle seeks help from Jimmy Thesiger, friend to both the deceased and Gerry Wade. They begin their own investigation of what possibly could be happening with Seven Dials.This is my third Agatha Christie novel, and I have to say that each one is getting better and better. I first read Halloween Party, which was good, but not great. I then read Cards on the Table, which was even better, and had me fooled to the end. But now, with this book, I was gaping at the ending of this one. Christie had me 100% fooled right to the very end. I almost couldn't believe it, but looking back, the signs were there. It's so amazing how Christie manages to pull everything together and yet still have it make sense. It was insane.One of the things I noticed in the last two books I read was that Christie's books tend to be mostly just okay until you hit the big reveal at the end. While this was a bit true for this book, I was still interested in the middle, mainly because of the main heroine, Bundle. She was intelligent, independent, and strong. My last two books have been Hercule Poirot books, so this was a welcome change. Emilia Fox's narration of the characters was great, especially considering there were so many. Sometimes it was hard to keep them all straight, but she managed to make them all distinct. Overall, this is my favourite of the Christie books I have read thus far, mostly because of how it was all pulled together. It had an interesting plot and a great heroine, but what really shot my rating up was how thoroughly Christie had me fooled. I've listened to all three books on audiobook, and I think it's really improved my experience since it makes the reveals that much more expressive and shocking. I'd definitely recommend this book to you, and especially the audiobook because I think it helps with the Christie experience."}, {"userName": "İlkim", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/5318323-lkim", "userReview": "Başmüfettiş Battle benim sevdiğim bir karakter, zaten Agatha'nın sevmediğim pek bir karakteri yok ya neyse. Bu kitap da bence iyiydi, olaylar yavaş aksa da gerçekten güzel bitti. Ya katil şu çıksa ne garip olur dediğim kişi katil çıktı bu arada, biraz kendimi kutlamalıyım heralde. Kadının yazacağı her şeyi tahmin edemiyorum ama nedense kafasında kim üzerine kurguladığını daha sık yakalar oldum. Hala okunacak romanları var neyse ki, sonra da başa dönüp her birini tekrar okumalı aslında."}, {"userName": "Kirsty", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "I appreciate what Christie is trying to do here, but frankly, I found it rather disappointing. I far prefer her forays into cosy crime. The plot here was rather weak and all too predictable, which surprised me, particularly when compared to her other work."}, {"userName": "Wend", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/50953088-wend", "userReview": "Battle"}, {"userName": "Joelle", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/11645462-joelle", "userReview": "Well that was a topsy-turvy, wild ride."}, {"userName": "قارِئـة", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/65987664", "userReview": "حقيقة أبهرتني أجاثا مرة أخرى أبهرتني بدقة وتسلسل الأحداث..فحتى الأوراق استسلمت أمامها حيث كانت تتوارى أمامي الواحدة تلو الأخرى حتى استطعت انهاء الكتاب في يوم واحد..فعلا كتاب رائع زادني شوقا لأقرأ بقية أعمالها.."}, {"userName": "J.A. Kahn", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/23772607-j-a-kahn", "userReview": "I’m giving this book 2 stars only because when compared with other Agatha Christie novels it doesn’t have the same intricacies or depth at its heart. That’s the problem when the bar is set so high. The story and mystery didn’t grip me at all. If anything it’s more Enid Blyton than Agatha Christie. The plot has a more childish and humorous rhythm and the characters are not as developed as in her other work."}], "description": "Gerry Wade had proved himself to be a champion sleeper, so the other house guests decided to play a practical joke on him. Eight alarm clocks were set to go off. But come morning, one clock was gone, and the prank had tragically backfired.", "title": "The Seven Dials Mystery\n      \n          (Superintendent Battle #2)", "url": "http://www.goodreads.com/book/show/483103.The_Seven_Dials_Mystery", "average": 3.78, "cover": "https://images.gr-assets.com/books/1351674470l/483103.jpg", "reviews": 733, "authors": [{"url": "https://www.goodreads.com/author/show/123715.Agatha_Christie", "name": "Agatha Christie"}], "type": ["Mystery", "Fiction", "Classics", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/483103.The_Seven_Dials_Mystery", "http://www.goodreads.com/book/show/528945.The_Seven_Dials_Mystery", "http://www.goodreads.com/book/show/12233415-the-seven-dials-mystery", "http://www.goodreads.com/book/show/16247245", "http://www.goodreads.com/book/show/7735790-the-seven-dials-mystery", "http://www.goodreads.com/book/show/18882134-the-seven-dials-mystery", "http://www.goodreads.com/book/show/15820406-the-seven-dials-mystery", "http://www.goodreads.com/book/show/918881.The_Seven_Dials_Mystery", "http://www.goodreads.com/book/show/26111784-yedilerin-gizemi", "http://www.goodreads.com/book/show/1524791.The_Seven_Dials_Mystery", "http://www.goodreads.com/book/show/23702917-the-seven-dials-mystery", "http://www.goodreads.com/book/show/23260800", "http://www.goodreads.com/book/show/16299.And_Then_There_Were_None", "http://www.goodreads.com/book/show/16343.The_Mysterious_Affair_at_Styles", "http://www.goodreads.com/book/show/853510.Murder_on_the_Orient_Express", "http://www.goodreads.com/book/show/16331.Murder_at_the_Vicarage", "http://www.goodreads.com/book/show/16328.The_Murder_of_Roger_Ackroyd", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}