{"ratings": 5872, "userreviews": [{"userName": "Alex is The Romance Fox", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "I really like this series and despite what we know about Frederik from the previous books, I have always found him fascinating…so I was so looking forward to his story.\n\nSeeing his life unfold is something I never expected.We know he’s a killer, an interrogator with some sadistic and horrible methods and we figured out that there is something dark in his life.\n\"My past has shaped me, molded me. Molded me into a monster with a persecuted heart and a dead soul.\"\nWe discovered his history with Seraphina,\n\nShe was the darkness in his life\n\nThe light was Cassia..\n\nShe had been kept prisoner in his basement for a very long time…\n\nFrederik believed she had the answer to Seraphina’s disappearance.With Cassia, he was able to show a caring and a soft side we have never seen before.\n\nThe twist at the end just blew me away. I was not expecting that at all!!This is not a love story just like the author tells us before we open page 1.I am totally addicted to this series and I cannot wait to see what happens next to the Company of Killers."}, {"userName": "Screamingz", "userReviewDate": "Mar 02, 2014", "userURL": "http://www.goodreads.com/user/show/7272265-screamingz", "userReview": "Me starting this book:Seeing Izabel in this book:Me at the ending:Trying to hold back the tears:Failing:And me finding about the next book:My poor heart can't take it anymore!"}, {"userName": "ღFloღ the coffee addict", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/7643503-flo-the-coffee-addict", "userReview": "5 **break my heart why don’t you?** STARSI started this book on a complete whim. I’ve been meaning to catch up with the In the Company of Killers series for a while now, but I guess the release of Behind the Hands that Kill really gave me the last push. And what a ride it has been. I read The Swan and the Jackal in one sitting. I couldn’t for the life of me put it down. Ever since we met Fredrik the ‘interrogator’ in Killing Sarai I was intrigued by the man and I was curious to learn more about his past and Seraphina. \n\n“My beautiful swan. My savior and my undoing.”\n\nWhat is it they say? Be careful what you wish for? WOW. This book and his story was a complete trip. I started out a bit weird, and I wasn’t sure if I would like this book in the end, but then the big twist and the gut wrenching feels happened. I cried. Yup. At 2am in the morning I sat in my bed bawling my eyes out and I have no regrets. Sometimes a book just needs to hurt real good. And it did. Angst, pain, violence. I’m slightly surprised the author went there, but I have to say I’m impressed. Might be because I’m a huge Courtney Lane fan, but I appreciate a good mindfuck and can handle these kinds of turns of events. On the other hand I can absolutely understand why some people wouldn't like this book as much. Different tastes and maybe even the wrong mood can be a killer with this book. Pun most definitely intended.All in all, an emotional and very different read. I enjoyed it immensely and I'm going to continue with Seeds of Iniquity right away. That is all. Thank you for your time. ;D"}, {"userName": "TheCrazyWorldOfABookLover", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/34338862-thecrazyworldofabooklover", "userReview": "\"Though I learned the hard way that love is cruel and dangerous and more fiendish than a man like me could ever be.\"\nFredrik Gustavsson. This man. This dark, sick, twisted man has stolen my fucking heart!!! I apologize now ladies for whoever has claimed Fredrik... But ... I don't care. I need him. I love him. I will totally fulfill his twisted little fantasies. \n\"I want to take her. Now. To press her tight pink flesh against the wall and ravage her little body violently from the inside out. I want to mark her with my blade and lick the blood from her wounds.\"\n\nThis story blew me the eff away. My heart has been wrecked, shredded, shattered .. I don't think I've read a book that has left me so destroyed before. I don't think my jaw has ever hit the floor so hard! \n\"I ache. Every part of me aches. For her. Only for her.\"\nI was NOT expecting anything that happened and just when I thought I knew what was going to happen next, BAM, JA bitch slapped me with something else!I'm still reeling over it. My heart still hurts for the characters. Once again I don't think this is a book you should know too much about before going in. It's best to just start to read and get mindf*cked from start to finish.\n\"My beautiful swan. My savior and my undoing.\"\nI loved it I loved it I loved it! This series just keeps getting better and better!\nFind Me On:Instagram ❤ FB Page ❤ FB Blog ❤ Blog ❤ Twitter"}, {"userName": "Georgia ♥ Team Dex ♥", "userReviewDate": "Dec 24, 2013", "userURL": "http://www.goodreads.com/user/show/9138738-georgia-team-dex", "userReview": "5 Dark Love and Need Stars\"I love you. I despise you. Because love is pain. Love is a wicked game.♪♫ We stand, we rise, we give our lives.We looked for light but we found only darkness. ♪♫You've all met Fredrik. If you haven't, let him introduce himself.\n\"The past has shaped me, molded me into a monster. A monster with a persecuted heart and a dead soul.\"\nDangerous, seductive and with his own set of moral codes he craves only one thing. His wife Seraphina. Destroyed by her betrayal, he will do anything to have his revenge. And on his way stands a blonde angel, hidden in his basement. His prisoner and his captor, the one he loves. Cassia, the light to the darkness that is Seraphina.\nMy beautiful swan. My savior and my undoing.\nI am sorry but I can't say anything more about the plot, the characters or the story without major spoiling. I will share that in my opinion, you can read this book separately from Viktor & Isabel's previous story. Now about my feelings....Mindblown, utterly devastated, heartbroken. Fredrik just blew me away. Exciting, mysterious with major twists that caught me totally off guard, this book I believe is absolutely fantastic. No romance, no erotica, no mystery. It's completely wrong to try and categorize it. It's one of a kind, dark, gritty and unapologetic about it. A journey to the most hideous places of a human soul where our inner child hides and cries himself to sleep. A story about abuse, killers and torturers. And above all, survivors and lovers.Oh God, please don't let her hurt too badly and, please, never, never let me love like that.Jennifer WildeWhile I was patiently (and totally unaware) waiting for this book...Fredrik's story!!!!"}, {"userName": "Jennifer Kyle", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/9916227-jennifer-kyle", "userReview": "”The past has shaped me, molded me into a monster. A monster with a persecuted heart and a dead soul.”\nWhile the majority of fans were anxiously awaiting Fredrik’s book, I was on the fence about it. My apprehension had a lot to do with the sheer fact of what his story would include. Let’s face it, this guy gets off on interrogating people in his dentist chair and then proceeds to remove their teeth with pliers. For me, I wasn’t as taken with him as I was with Victor or even his hot pain in the ass brother, Niklas. I knew that 'gruesome' and 'handsome' was only some of the words that could be used to define Fredrik Gustavsson.\n”I don’t kill innocent people. I, while although a sadistic bastard and torturer and killer, have limits and standards.”\n\n”Seraphina is the epitome of darkness. And I need her back. She and I have unfinished business.”\nThis story may not be one any of the fans of this series envisioned. I sure didn’t expect the author to go this route but I have to give her props it wasn’t your typical fall in love with your captor while learning their kinky sex ways and embracing under a rainbow type of story. Casia Carrington is imprisoned in Fredrik’s basement because she has information on his wife, Seraphnia (coldblooded killer, traitor, etc.) for ONE YEAR! Casia is suffering from amnesia and can’t recall her connection to the woman Fredrik seeks. It also appears that the dreaded Stockholm Syndrome has infected yet another book I have picked up. \n”But I happened to like where I am, confined in a sunless, starless, rainless room with only my thoughts for company on some days. I guess it’s the price I pay for being in love with the Devil.”\nAlong with keeping Casia, finding Seraphina, Fredrik works a few cases with the new Order headed by Victor Faust. Izabel Seyfried does indeed play a part in this story as well as Dorian Flynn, who I liked a lot! Just when you think you have a strong grasp on what is going on in the story J.A. Redmerski turns the tables on you!I really liked this change of events and I was glued to the story to see how things would play out. Well, things didn’t end up under that rainbow and I can’t say I was happy, but it was good story and I have to give the author credit for knowing what readers would expect and doing what the story called for in her opinion. Going forward it appears there will be a prequel for this story of Fredrik’s past, which I may skip because I’m just not that into him. But the moment that Dorian or Niklas' books are released, I’ll be back!!"}, {"userName": "Jen", "userReviewDate": "Sep 28, 2014", "userURL": "http://www.goodreads.com/user/show/6049062-jen", "userReview": "OMG! I am reeling from what I just read! Seriously, this book was the darkest in the series so far. (in my humble opinion!) Fredrik Gustavsson, aka: The Specialist works in Victor's new organization called the \"New Order.\" His job is to torture people to talk, and one thing about Fredrik is that he enjoys every single minute of the torture he instills onto others. In fact, he will go through withdrawals if he doesn't get an ongoing dose of making his victims bleed. Don't worry though, he makes sure that the ones that sit in his torture chair are guilty of some crime. That would be his main rule; no innocents. Pretty gruesome right?!!! So, how on earth can someone like the sadistic Fredrik be a hero in the story? Well, as with most of our anti-heroes, he has had some terrible things happen to him in his dark and disturbing past. He didn't become this way on his own. The monsters created a monster within himself, and he very well knows it.This story is Fredrik's and Seraphina. She was his wife that betrayed him six years ago; but their story isn't done yet. Fredrik can't stand the fact that she betrayed him, and he is looking for her. In the process of his search, he comes across a woman who may know the whereabouts of his wife. There is a huge problem though. Cassie doesn't remember anything of her past...nothing...not who she is, where she lived..zilch. She does have nightmares though, and guess who stars in them?? Seraphina does, and Cassie is so terrified of this woman that she has accepted that Fredrik has held her captive in his basement for a year. OOPS! Did I forget to mention that part?? Oh yeah, he has secretly held her captive in hopes that her memory will come forth one day, and lead him to his wife. Feelings begin to develop between Cassie and Fredrik though, and this makes him become very confused as to what he really wants. This was a very good read. The story held me captive the whole time I read it. I forewarn anyone thinking of reading it though, it is a lot darker than the first two. It left me with a major book hangover, and I am going to have to pursue a light, fluffy read next just to take me out of this head space. I don't regret reading it though. This series is explosive, and should have a slogan of; \"Expect the unexpected!!\" I kid you not, these stories take you on a roller coaster ride of emotions. \"The Swan & The Jackal\" has some major twists that set a very somber mood for the rest of the book after they happen. My heart bled for Fredrik by the time I was done, and I'm still teary eyed just thinking about this story as a whole. Brace yourself for a ton of feels, and some very hot, primal, and raw sex!!!! This book won't be for everyone, but if you are a reader that is determined to go through this whole series; then brace yourself...you are in for one hell of a ride!!!"}, {"userName": "Beatrice Masaluñga", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/4590441-beatrice-masalu-ga", "userReview": "Reread: October 2017Let me put this gif to summarize my feelings on rereading this book:Can I just hug Fredrik Gustavsson? *wailing* My goodness, his story wrecked my heart. I'm going to take a break for days then I'll proceed on Seeds of Iniquity. I think there are more clues for the seventh book than this one. -------------------------------------------First read: January 2016Nothing is more exciting than to hear the story of Fredrik Gustavsson -- The master torturer, The Specialist, The Jackal.  I got more curious and intrigued with him on Reviving Izabel. He is attractive, compelling, and clever but also dangerous. In the series, this is by far the  darkest story I've ever read. Brace yourself if you're going to read this book.Like Izabel, Fredrik had an awful childhood experience that traumatized him for life. He's a heartless monster. He became more of it when his wife and the only woman who can match him, Seraphina Bragado betrayed him. They have an unfinished business and he wants to conclude it. However, he needs to find her by imprisoning Cassia Carrington. She was a kind, innocent and loving woman. She brings the lightness in him and a total opposite of the vile and cruel Seraphina. The story is a total mind-fuck. What. the. heck. was. that?! It is something I totally didn't see coming. I just can't believe it. The twist left me conflicted, sad and brokenhearted. That revelation made me speechless. It is a bitter ending but I'm satisfied with it. My heart breaks for both of them. My fucking feels. I'm drained. I need a happy book right now. Once again, I'm amazed with this masterpiece."}, {"userName": "Lainey", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/22889537-lainey", "userReview": "MY NON-SPOILER SERIES REVIEW https://www.youtube.com/watch?v=CVyN9...First Read: September 2015Second Read: February 2016Third Read: April 2018Second Read Thoughts: So I loved this re-read, keeping my rating at a 5-star. What was the best about rereading this, was being able to pick up on all the things I missed and if you have read this boo, you know what I'm talking about."}, {"userName": "Lady Vigilante (Feifei)", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/2551178-lady-vigilante-feifei", "userReview": "[Cassia is Seraphina (hide spoiler)]"}, {"userName": "Vina", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/18492568-vina", "userReview": "My beautiful swan. My savior and my undoing.I HAVE to start by saying how amazing the cover is! “One day, Victor Faust will be the death of you, Izabel,”he (Frederik) cuts in and I’m stunned by his words. He looks over, locking his eyes on mine. “If you want to help me, you can by keeping that in the back of your mind. One way or another, you’re going to die because of him, because you love him.”This is not a happy book. I think people have to be made aware of that fact. Just like JA Redmerski says at the start of the book, this isn't a romantic book by any means. This book is about Fredrick... his search for his wife who betrayed him, destroyed him and broke his heart. It's about seeing the monsters that made him into what he is today; another kind of monster. It's about him using another woman's vulnerabilities to get the information he needs from her... how to find Seraphina. But he never could have been prepared for what he actually found in the end.It was beyond shocking. Complex and brilliant, all at the same time. JA Redmerski knows how to write a bloody good story. So even though this book is incredibly difficult to read at times, it's totally worth all the pain. But I have to warn you again, if you're looking for a light book, or romance, or a beautiful ending... you're not going to get it here.There is some great storyline progression with Victor, Sarai and the gang. I loved seeing Izabel (Sarai) again and she was so great with Fredrik. She was there for him when he wouldn't let another soul in. She didn't always tell him what he wanted to hear, but she was there nonetheless. Overall, this was a fantastic addition to the series, even though I prayed for things to end differently."}, {"userName": "Hulya Kara Yuksel", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/32793174-hulya-kara-yuksel", "userReview": "WHOA this series are just getting better and better with each book.... I freaking loved this one too!"}, {"userName": "Sarah ❤", "userReviewDate": "Dec 26, 2013", "userURL": "http://www.goodreads.com/user/show/10822409-sarah", "userReview": "[ (hide spoiler)]"}, {"userName": "Natalie The Biblioholic", "userReviewDate": "Aug 28, 2016", "userURL": "http://www.goodreads.com/user/show/39243185-natalie-the-biblioholic", "userReview": "Amazing. Amazing. Amazing.Every thing I thought I knew about Fredrik... well that was thrown out the window with this book. This was his story and it was tragic, beautiful, devastating, illuminating, dark and twisted.As we learned in the last book, Fredrik has some dark secrets and even darker pain. His past was absolutely atrocious and I felt the tragedy that was his life growing up. But as a man, he found some peace and her name was Seraphina. She was as savage and as twisted as he was. But she ultimately betrayed him and he's been hunting her for the last 6 years. That is until he finds a major clue, Cassia, whom he keeps captive in his basement. He's sure that she can lead him to his first love.Although I had anticipated and had pretty much figured out the twist, I was still left devastated by it. My heart just kept breaking for Fredrik throughout the entire story. I wanted him to catch a damn break. I wanted the brief glimpses of his happiness to remain forever.This is NOT a true love story. It is NOT romantic. It is a suspenseful thriller and it is incredibly entertaining!XO"}, {"userName": "DW", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/40762852-dw", "userReview": "Going into this one I knew that Fredrik was going to be vicious. I mean he tortures people in a dentist chair after all. I wasn't prepared for him at all. I thought that I was but I wasn't. He is a beautiful man on the outside but he is nothing but darkness on the inside. I just wish that he could find true love! I can't say to much without giving it away but let's just that I was shocked when it all came out. Like seriously, I was stunned!!  On to book four!!!!"}, {"userName": "Barbara", "userReviewDate": "Dec 26, 2013", "userURL": "http://www.goodreads.com/user/show/5408262-barbara", "userReview": "[image error]"}, {"userName": "Irmak", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/18184151-irmak", "userReview": "Bu kadın inanılmaz bir hayal gücüne sahip bence. Net yani. Karakterlerin duygu yoğunluklarını böyle anlatmasına okuyucuyu böyle sarsmasına bayılıyorum. Kitabı her ne kadar çok sevsem de diğer kitaplardan bir puan daha eksik verdim çünkü karakterler bu kitapta bana bir başka geldi. Yani önceki kitaplardaki Victor, Izabel, Fredrik sanki tamamen başka insanlar olmuştu. Şöyle izah edeyim. Victor patron olunca biraz kasıntı mı olmuş yoksa bana mı öyle geldi bilmiyorum ama önceki kitaplardaki tutkulu Victor'u göremedim pek. Gözümde hep bir Godfather tiplemesi canlandı durdu. Onun ağzından okuduğumuz zamanlarda içindeki tutkuyu, vicdanlı adamı görebilirken bu kitapta bana biraz daha duygusuz geldi. Izabel de gittikçe Victor'a benzedi sanırım. Biraz daha soğukkanlı bir kadın olmuş. Sevdikleri için her şeyi göze alan bir kadın. Ve Fredrik. Serinin ikinci kitabında Fredrik soğukkanlı bir işkenceci ve katil olmasına rağmen aynı zamanda eğlenceli, mizah sahibi bir karakterdi. Fakat Kuğu ve Çakalda Fredrik'in mizah anlayışını hiç görmüyoruz. Hatta aksine ne denli soğukkanlı bir katil olduğunu, içinin tahmin edebileceğimizden kat kat daha karanlık olduğunu görüyoruz. Yani karakterler ilk iki kitapta gördüğümüz hallerinden çok çok farklı geldiler bana. Ben bunu sevmedim. Değişimi sevmedim. Başka karakterleri okuyor gibi hissettirdi. Yoksa bu kitaptaki halleri bence asıl olması gereken halleriydi. Sonuçta hepsi acımasız bir organizasyonun üyeleri. Önceki kitaplardaki halleri de bu kitaptaki gibi olsa bu kitaba da beş verirdim kesinlikle. Ya da bu kitaptaki halleri önceki halleri gibi olsa yine beş verirdim. Beklediğim sadece karakterlerin tutarlı olması. Onun dışında kitabın sonları beni gerçekten şoka soktu. Hiç böyle bir şey beklemiyordum. Cassia'nın onu kaçıran insanı böylesine sevmesi ve güvenmesi bana başlarda çok saçma gelse de sonradan her şey yerli yerine oturdu. Beni çok şaşırtan şeyler oldu. Fredrik'in iç çatışması da içimi parçaladı resmen. Bu seriyi gerçekten çok seviyorum. Ve devamını baya sabırsızca bekliyorum :')"}, {"userName": "Barbara", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/17906160-barbara", "userReview": "For me the song that keeps playing in my head for this book is …You give love a bad name (Bon Jovi)\nShot through the heart, and you're to blame.Darlin', you give love a bad name.An angel's smile is what you sell.You promise me heaven,then put me through hell.Chains of love got a hold on me.When passion's a prison, you can't break free.Oh, you're a loaded gun, yeah.Oh, there's nowhere to run,no one can save me, the damage is done.Shot through the heart, and you're to blame.You give love a bad name.I play my part, and you play your game.You give love a bad name.Hey, you give love a bad name…\nI will express my thoughts trough imagesThis book is like a storm of feelings! \n Frederik and Seraphina relation…\nNot a HEA book, but a mess up psychological and emotional thriller, at the end my heart was so broken that I felt I was...\nAnd ...\nJessica Ann Redmerski, thank you for this brilliant and unforgettable book! Also thanks to my Buddy Read Girls, Carolina and Barbara … for another fantastic BR! XOXO"}, {"userName": "Ilze", "userReviewDate": "Dec 24, 2013", "userURL": "http://www.goodreads.com/user/show/12206696-ilze", "userReview": "review to follow.OMGGGGG, COVER REVEAL!!!I am speechlessIt totally ranks in my all-time-favorite-book-cover top #5 and release date for the book is only 4 days away - March 5, 2014!!!!"}, {"userName": "arissa", "userReviewDate": "Dec 18, 2013", "userURL": "http://www.goodreads.com/user/show/4746404-arissa", "userReview": "MIND FUCK. THAT'S ALL.\n\nShe is mine and she’ll be mine until the day she dies.\n\n\n\nThe woman who if I let live, will certainly be the death of me.\n\nFirst of all, I had a moment of shock when I found out the connection between Cassia and Seraphina. I had this theory that could be it, but I quickly discarded as to be completely crazy and nonsensical. It wasn't crazy, and it made complete sense.I remember the first time I read the blurb from this book, I thought: 'Hey, maybe we can get a threesome with Fredrik, Cassia, and Seraphina!' HA-HA-HA-HA-HAAA-HA\n\nThe past has shaped me, molded me into a monster. A monster with a persecuted heart and a dead soul.\n\nFredrik, oh Fredrik. He cries, I cry. He aches, I ache (Redmerski, you're evil!). How to describe my love for this man? I just can't.I'm not talking about his relationship with Seraphina and Cassia, whatever I say will sound spoilery. I loved his bond with Izabel, and I hurt bad for them in the end.Izabel had her share in this book. She even had a pov once.\n\n“Nothing you need to worry about,” he clarifies. “My brother, on the other hand, I wonder every day if I’ll get word that she has finally slit his throat.”\n\nI love that Niklas and Izabel still hate each other and I hope they keep that way.I admit! My mind loved how the end turned out. But my heart in the other hand. Since I can't say any more without slip some spoilers, I'll leave it at that.That's it.\n\nMy beautiful swan. My savior and my undoing."}, {"userName": "Michelle ", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/23450274-michelle", "userReview": "5+++ Stars!!I have no idea how I forgot about this series when I loved the first two books!!That's why I love GRs so damn much! Friends don't let other friends forget about great books!! Thanks Kirsten!! I loved it! I was up all night reading this baby! I could not and would not put it down once I started! Fredrik is damaged. His brutal childhood has made him the dangerous man he is today. He finally finds a woman Seraphina that is equal to him in every way. Once she betrays him he will stop at nothing to find her. He has been searching for her for six long years! He believes his prisoner he's kept in the basement for a year Cassia is the key to getting his Seraphina back. Cassia has no memory of her past and Fredrik will do whatever it takes to get her to remember. While this is going on Fredrik can't help to develop feelings for the kind and compassionate Cassia.Cassia is the exact opposite of Seraphina. Cassia is light to Fredriks darkness. Seraphina is his equal. She is as dark as him and has helped him control the darkness that is in his soul. Fredrik finds himself struggling with his love for Seraphina, and his growing feelings for Cassia—because he knows that to love one, the other must die.My mouth flew to the ground around halfway through!!! I would have never guessed that!! That's my kind of writing!!! Will light win out over darkness, or will something more powerful than either further destroy an already tortured soul? You will have to read to find out! Start at the beginning of the series and enjoy your ride! You will not be disappointed!!I'm off to read the next book:))"}, {"userName": "❥Lil", "userReviewDate": "Dec 19, 2013", "userURL": "http://www.goodreads.com/user/show/14097794-lil", "userReview": "****4 messed-up stars****While I was reading this book, I was listening to a playlist on repeat. When I finished, the song left playing was “No ordinary love” by Sherrie Lea. How fitting, I thought...I gave you all the love I gotI gave you more than I could giveI gave you loveI gave you all that I have insideAnd you took my loveYou took my loveDidn't I tell youWhat I believeDid somebody say thatA love like that won't lastDidn't I give youAll that I've got to give babyI gave you all the love I gotI gave you more than I could giveI gave you loveI gave you all that I have insideAnd you took my loveYou took my loveI keep cryingI keep trying for youThere's nothing like you and I babyThis is no ordinary loveNo ordinary LoveThis is no ordinary loveNo ordinary LoveWhen you came my wayYou brightened every dayWith your sweet smileDidn't I tell youWhat I believeDid somebody say thatA love like that won't lastDidn't I give youAll that I've got to give babyThis is no ordinary love\nSeraphina, the seraphine, a dark-haired, blood-thirsty, damaged soul, who is hiding in the shadows and has become Fredrik ’s obsession and partner in crime.\nCassia, the white angel, the light in the darkness, the kind, forgiving soul who holds the key to Fredrik ’s freedom from his tortured, destructive remnants of a man.\nA dark angel and a white angel, darkness and light, evil and good, the eternal battle.Who is going to win Fredrik’s black heart?\n\nAn extra bonus is that we get glimpses of Victor and Izabel, as well as other members of the notorious gang while they continue working on their projects after the events of the previous two books.This would have been a pure 5-star read, if it wasn’t for the slow first half. Until the 50% mark I wasn’t really knowing what I was reading and where everything was heading at. The story really got my attention around 60%."}, {"userName": "Fadime Tüylüoğlu", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/47412209-fadime-t-yl-o-lu", "userReview": "En azından ortada bir gerçek var. Bu iki ruh hastası karakterimizde Fredrick'e deliler gibi aşık.\"Galiba gezegenin en kaçık kadınına aşık oldum.\" Fredrick'in çaresizliği.. Bıçağı saplaması... O kadar, o kadar, o kadar üzüldüm ki...Cassia'nın son sahnede \"Pişman olma, beni kurtardın.\" demesi yok mu. :(O kadar güzel bir kitaptı ki!! Sonunda gözyaşlarımı bile akıtmak zorunda kaldım. Kesinlikle bu kitap benim için farklı bir bölgede kalacak. Yeri bambaşka.İlk başta zaten Cassia'nın Seraphina olduğunu düşündüm. Sonradan vazgeçtim. Ve tekrar olduğunu düşündüm. Tam o değil deyip kitabı ortalamış iken o olduğunu öğrendim. Yazar o kadar fazla çelişkiye düşürmüş ki.. Neyin nasıl olduğunu anlayamadım. Ve bu beni her sayfayı daha hızlı okumama neden oldu. 1 günde 400 sayfalık kitap bitti. İnanabiliyor musunuz? Yemedim, içmedim, okudum. :)Bu kitabın birinci ve ikinci kitaptan daha iyi olduğuna KESİNLİKLE emin olabilirsiniz.Kitapta bir de Cassia'nın küçüklüğünü yanlış hatırlaması, yok mu? Bu beni delirtti. Resmen Seraphina ona savaş açmış hayal dünyasında. Aslında bu tür hastalara günlük yazdırıldığını biliyorum. Hasta bunu okuduğunda daha önce ne yaptığını hatırlasın diye. Keşke Fredrick öldürmeden önce böyle bir tedaviye başvurmayı deneseydi.Ahhh zavallı Cassia. :( Seraphina bir de hiç acımadan herkesi öldürdü. Greta'yı ona Cassia dediği için öldürmesi. Greta'nın kitabın ortalarında Fredrick'e \"Ona senden daha çok güveniyorum.\" deyişini hatırlıyorum. Stockholm sendromu da çok tuhaf bir şeymiş. Sarai sayesinde bununda ne olduğunu öğrendik. Şöyle bir düşüncem var, Fredrick, Cassia'yı odadan çıkarmasaydı belkide tekrar Seraphina olmayacaktı. Ağlayarak, \"Neden beni koltuğuna oturtmadın? Bana bunu nasıl yaparsın?\" diye sordu. Parmak uçlarını göğsüme daha da bastırdı. \"Vücuduma zarar ver! Direncimi kır, Fredrick! Ama kalbimi sakın incitme!\"Kaderin şu anda yapmama izin verdiği tek şeyi yaptım ve avuçlarımın içine ağladım.Fredrick ağlarken benim içim yandı. Ben kahroldum. Bu kitap için yazara sonsuz teşekkürlerimi iletiyorum."}, {"userName": "Kübra Yağmur", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/36997724-k-bra-ya-mur", "userReview": "3,5Kitaba audiobook olarak başladım, kindle’den devam ettim gece okurken baya bir uyku bastırdı. Bırakıp uyumayı düşünürken öyle bir yere gelmişti ki olaylar gözlerim fal taşı gibi açıldı vallahi.Katiller Çetesi'nden olaylar Fredrik Gustavsson ile devam ediyor olsa da yoğunluk Fredrik'in üstündeydi.Karanlık ve acılı geçmişinden sahneler, onu bu cani işkenceciye dönüştüren gerçeklerle yüzleştik.Cassia, karşılaştığımız ilk andan beri bana gerçekçiliği olmayan, tuhaf bir kadın olarak görünmüştü. Olanları okuduğumda her şey yerli yerine oturmuş oldu. Ama sonunda olmasını beklediğim şey bu değildi.Victor ile İzabel'i de gördük ara sıra. Ben Izabel ile Fredrik'in arasındaki bağa, başı sıkıştığında onu aramasına bayıldım. Ama Victor pozisyonuna baya baya alışmış gibi geldi. Adamın içinde bir patron yatıyormuş da haberimiz yokmuş :D"}, {"userName": "Şeyma", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/63296352-eyma", "userReview": "Sadece VAY CANINA HARİKAYDI demek istiyorum."}, {"userName": "Asu De", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/24448675-asu-de", "userReview": "Söyleyecek söz bulamıyorum. Kitap tek kelimeyle mükemmeldi!Okuyanlar beni anlayacaktır ama okumayanlara şunu söylemeliyim ki bu kitap sizi duygudan duyguya, karmaşadan daha büyük karmaşalara itecek.Kitap, Sarai ve İzabel’den tanıdığımız acımasız bir işkenceci ve katil olan Fredrick’in, ondan bile sorunlu eski karısını bulmaya çalışmasını anlatıyor. Fredrick ve Seraphina bu dünya üzerinde belki de birbirine en uygun iki insandır. İlişkileri hastalık derecesinde tutkulu, aşk dolu, aynı zamanda karanlıktır.Ancak Karısı Seraphina sevdiği adama ihanet edip kayıplara karışır. Fredrik onu bulmak uğruna masum, kırılgan bir kız olan Cassia’yı kaçırır ve bir yıl boyunca evinin mahzeninde prangalara vurur.Çünkü Cassia Seraphina’yı tanıyan, onun geçmişini bilen tek kişidir.Sayfalar ilerledikçe Fredrick’in hislerini ve içindeki çelişkileri okuyoruz. Ama sakın hataya düşmeyin! Çünkü tahminleriniz tutmayacak.Kitabın iki büyük kırılma anı var. Bunlardan ilkini az çok ön görmüştüm ama ikincisini okuduğumda tam anlamıyla şoka girdim. Asla beklemediğim bir şey satırlarda can buluyordu ve o an gerçekten çok sarsıcıydı.Sarai ve İzabel kitaplarında gördüğümüz karakterlerin diyalogları ve olayları sizi gülümsetip, eğlendirirken Fredrick’in yaşadığı olaylar üzecek,âşık edecek, bazen asla onaylamayacağınız şeylerle kızdıracak ve nihayetinde bir adamın aşkı uğruna neleri göze aldığını duygulanarak okuyacaksınız.Kitap tam anlamıyla bir aşk romanı ama gerilim unsurları da yoğun bir şekilde var. Bu da merakı ve heyecanı sürekli canlı tutuyor. Kısacası bu kitabın içinde her şey var, şiddet de, hüzün de, mutluluk da...Okuduktan saatler sonra bile aklımdan çıkaramadığım için benim nezdimde artık çok özel bir yere sahip.Fredrick gibi bir adamı, Seraphina gibi bir kadını, Cassia gibi yaralı bir kurbanı okumak gerçekten özel bir deneyimdi. Tavsiyedir..."}, {"userName": "CasPerfitz~SLiTsReaD", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/9406114-casperfitz-slitsread", "userReview": "5 GUT-WRENCHING STARS!Seraphina, Fredrik’s ex-wife, lover and partner in crime for 2 years has betrayed him and played him for a fool… She is a psychotic, sadistic, cold blooded killer that kills and tortures even the innocent. She reminds me of a rabid dog that needs to be put down.Fredrik, his past… his love life…. just heartbreaking! Though he is a vicious and sadistic killer himself, he only tortures and kills the guilty ones.\n\nI only feel this pain when the victim is innocent…\n\n\nHis love for Seraphina, beyond!\nBut don’t get the teaser wrong, this is NOT a love story….NOT N.A., NOT even erotica…. but a but a psychological thriller and suspense, that had me at the edge of my seat. It is dark and gut-wrenching.In Fredrik’s quest to find Seraphina, he found Cassia instead, his key to drawing Seraphina out and to get more information about Seraphina. But Cassia is innocent, sweet, could not hurt a fly even if her life depended on it person… BUT is also suffering from amnesia…. To top it all, she is in love with Fredrik. My heart reach out for Cassia’s cry for help deep inside….. While the rest of the cast of In The Company of Killers that we’ve grown to love are back… with the new growing organization lead by Victor. A window to Fredrik and Seraphina story…..What I love most about this book is that surprising twist that I never saw coming…. all throughout, something was bugging me and when it was revealed, I was stumped… I felt conflicted, lost, helpless and heartbroken. I’d wish for a better ending, but then again, it wouldn’t be as perfect as it was.AMAZINGLY written on multi POV.P.S.If you are one of those that likes to skip to the end… don’t… it’s worth every page."}, {"userName": "Kelli C ~ Jack Sawyer's Heart", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/14931216-kelli-c-jack-sawyer-s-heart", "userReview": "4.5 Stars for the JackalIt has been a while since I got lost in this series. I was always intrigued by the great torturer Frederik...his struggle with his past...his dark wife, Seraphina was quite crazy. Having finished this book and watching the struggle of this damaged man in trying to find his Seraphina I was quite blown away! There was contrasting dark and light from the beginning. Frederik's mission for revenge is halted by the prisoner in his basement. Shackled to a wall, Cassia is so much more than a means to an end. It is who she is and what she means that makes this story so amazingly complex! There is no way to adequately review without giving anything away, so I will just say that the story is definitely riveting...the characters and their tasks, quite heartbreaking. I loved having more Victor and more Izabel. I loved that in the midst of all the darkness and the blood spilled, there was family. I cannot wait to see where this force will go!!!"}, {"userName": "Debra", "userReviewDate": "Mar 27, 2014", "userURL": "http://www.goodreads.com/user/show/13247178-debra", "userReview": "Fredrik's story!!! Fredrik:  Can't wait!!"}, {"userName": "Nihan E.", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/6123903-nihan-e", "userReview": "Erkek karakter işkenceci ve eline geçirdiği eroin satıcısının dişlerini kerpetenle tek tek söküyor. O sırada yan odada rehin tuttuğu kadın karakter ağlıyor. Ve işkenceci yanına gittiğinde ona sarılıp \"senin çocukluğunda neler oldu da böyle oldun kuzum?\" diye soruyor. Ahahaha böyle saçma kurgu mu olur bir bırak ya :DYazar serinin üçüncü kitabında batırmış. Dnf."}], "description": "-Reading Order-#1 - KILLING SARAI#2 - REVIVING IZABEL#3 - THE SWAN & THE JACKAL#4 - SEEDS OF INIQUITY#5 - THE BLACK WOLF#6 - BEHIND THE HANDS THAT KILL#7 - SPIDERS IN THE GROVE---Fredrik Gustavsson never considered the possibility of love, or that anyone could ever understand or accept his dark and bloody lifestyle—until he met Seraphina, a woman as vicious and blood-thirsty as Fredrik himself. They spent two short but unforgettable years together, full of lust and killing and the darkest kind of love that two people can share.And then Seraphina was gone.It’s been six years since Fredrik’s lover and sadistic partner in crime turned his world upside-down. Seraphina went into hiding and has eluded him ever since. Now, he’s getting closer to finding her, and an innocent woman named Cassia is the key to drawing Seraphina from the shadows. But Cassia—after sustaining injuries from a fire that Seraphina ignited—suffers from amnesia and can’t give Fredrik the information he desperately seeks. Having no other choice, Fredrik has been keeping Cassia locked in his basement as he not only tries to get her to recall her past—because she and Seraphina share it—but also to protect her from Seraphina, who clearly wants her dead.But Cassia is a light in the darkness that Fredrik never believed existed. After a year subjected to her kindness and compassion, he finds himself struggling with his love for Seraphina, and his growing feelings for Cassia—because he knows that to love one, the other must die.Will light win out over darkness, or will something more powerful than either further destroy an already tortured soul?(Note: THE SWAN & THE JACKAL is NOT a New Adult title. It, and all other books in the series are categorized as Suspense/Crime/Thriller.)", "title": "The Swan & the Jackal\n      \n          (In the Company of Killers #3)", "url": "http://www.goodreads.com/book/show/19500066-the-swan-the-jackal", "average": 4.23, "cover": "https://images.gr-assets.com/books/1393731803l/19500066.jpg", "reviews": 793, "authors": [{"url": "https://www.goodreads.com/author/show/5437976.J_A_Redmerski", "name": "J.A. Redmerski"}], "type": ["Dark", "Romance", "Adult", "Suspense", "New Adult"], "outlinks": ["http://www.goodreads.com/book/show/19500066-the-swan-the-jackal", "http://www.goodreads.com/book/show/20983755-the-swan-and-the-jackal", "http://www.goodreads.com/book/show/34208587-ku-u-ve-akal", "http://www.goodreads.com/book/show/16081272-the-edge-of-never", "http://www.goodreads.com/book/show/17899696-the-edge-of-always", "http://www.goodreads.com/book/show/20559676-killing-sarai", "http://www.goodreads.com/book/show/20559695-reviving-izabel", "http://www.goodreads.com/book/show/13432620-the-mayfair-moon", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}