{"ratings": 2917, "userreviews": [{"userName": "Denise", "userReviewDate": "Dec 21, 2009", "userURL": "http://www.goodreads.com/user/show/2673817-denise", "userReview": "The Secret of Everything is a beautiful story about love and family, good food and gorgeous landscape, faithful dogs and a mysterious town. Tessa is a hiking tour guide who is recovering from a traumatic, near drowning experience. As she recovers strange memories from her mysterious childhood begin to surface. She sets out for Los Ladrones, the small town in New Mexico where she was born, in an attempt to uncover the truth.What a gorgeous book! The strength here is in the real, down to earth characters. I just fell in love with them and then became so wrapped up in their stories I couldn't put the book down. The detailed descriptions of New Mexican landscape, its ferocious storms, and the enticing food are icing on the cake. The plot is unique enough to be interesting and only requires a little suspension of belief. Barbara O'Neal writes the kind of captivating novels that keep me up late at night turning pages. I will anxiously awaite her next one!"}, {"userName": "Mary", "userReviewDate": "Oct 27, 2009", "userURL": "http://www.goodreads.com/user/show/1002344-mary", "userReview": "I am one of the lucky ones who won a copy of this here on Goodreads and can't wait to get started! I loved The Lost Recipe for Happiness by this same author.Edited to add...I just finished this book, and I was so moved by it that I had to come right to Goodreads to post my review. I spent about seven hours today, devouring this book, and I enjoyed it so much. It had everything I look for in a book...wonderful characters that I felt an instant connection to, a location that makes me want to book a flight to New Mexico tomorrow, a little bit of mystery and a little bit of love, and an ending that brought a tear to my eye and a smile to my lips.There was a strong theme of food throughout this book, just as there was in The Lost Recipe for Happiness and as a food lover, I really enjoy such an element to a story. Although I am not a great cook, I sometimes think that I would love to be, and this book awakened in me that yearning. I also wish I were better at photography, and that was another pastime found in this book that makes me want to sign up for a class and improve my skills. And most of all, I am sucker for happy endings, and the happy endings that this book gave me made it well worth giving up my entire day to lose myself in its pages. I look forward to more winning books from this author...she has a fan for life."}, {"userName": "Ian", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/6703235-ian", "userReview": "After a tragic accident on a hike she was leading, Tessa returns to Las Ladronas, the town in New Mexico where she was born. Living with almost overwhelming grief she starts searching for answers to questions that have long been buried. Questions of her childhood and the hippie commune where she lived the first years of her life. While there she meets Vince, a single father who is raising his three daughters, one of whom is still grieving the devastating loss of her mother. It's hard to avoid superlatives with this book. It's just amazing, it's a journey of forgiveness, and perhaps even redemption. As Tessa pulls at the threads of her past she forms an unlikely bond with Vince's troubled daughter and together they are able to learn to move forward again. I've read a lot of books with similar plots. What really separates this one is an almost oppressive malevolence that seeps from the pages. Are they ghosts? All I'll say is when I found out I was surprised."}, {"userName": "Mary", "userReviewDate": "Dec 13, 2009", "userURL": "http://www.goodreads.com/user/show/254596-mary", "userReview": "Tessa Harlow enjoyed leading hiking tours until the hike that had a nightmarish ending. Feeling tremendous guilt and responsibility for the incident she goes to her father's home to heal. From the time of the accident she has flashbacks from her early childhood - memories that don't make sense. Feeling a pull to the area where she spent the first years of her life, Tessa heads to New Mexico to scout possible hiking tours and that's where her journey really begins. By meeting people who are new to her but from her past Tessa starts to put pieces together that lead her to the truth of her early years.I enjoyed Tessa's journey of discovery and how she learns to make reparations. It seems that more than a few characters in the book are looking for a way to make amends in their lives and find that they can help each other along the way. The depth given to the major characters had me pulling for each one. My favorite was Natalie, the daughter of Tessa's lover. Natalie is grieving the loss of her mother and is acting out. Tessa feels a connection and wants to help her. I loved how the author makes that happen.Barbara O'Neal's writing is beautiful and evocative. Her descriptions of sights, smells, and sounds give wonderful atmosphere to Los Ladrones - the small New Mexico town where the story takes place.I enjoyed reading The Secret of Everything and look forward to more novels by Barbara O'Neal. 4.5 stars"}, {"userName": "Sierra", "userReviewDate": "Dec 06, 2009", "userURL": "http://www.goodreads.com/user/show/3016623-sierra", "userReview": "I really enjoyed reading this book. It is a magical blend of love, lust, grief and secrets. A mix of magical realism, chick lit, food lit, romance and mystery all in one story.Quick synopsis: Tessa Harlow is a woman who has travelled the world but never truly found a home. A bad accident brings back long forgotten childhood memories and has her questioning herself so she travels to Las Ladronas, NM to rediscover herself by learning more about her past.I really liked Tess. I was able to connect with her, which is crucial for a good read. She wasn't whiny or overly insecure, instead she was the type of women you could see as a friend (one of your more interesting ones). While Tess is the main character of the story, there are actually many different stories involving other significant characters that in the end all connect. They could be termed as subplots but I don't really like that. All the side stories were important to the main story line. I liked the way the plots unfolded and in a way became one.Tess's mysterious past kept me reading til the end. The slow unfolding of events was suspenseful and entertaining.And I must say I loved the recipes included in the book (especially the last one) and I plan on trying some of them very soon. Hopefully they will turn out to be as good as in the book."}, {"userName": "Sharon A.", "userReviewDate": "Oct 31, 2009", "userURL": "http://www.goodreads.com/user/show/2307144-sharon-a", "userReview": "I absolutely loved this book. I had been on a run of reading fairly serious novels (The Historian, The Secret of the Wind), and had been looking for some light reads. Just before I received this goodreads giveaway, I had read an absolutely dreadful, formulaic chick lit/romance. So I probably wasn't in the best frame of mind when I started this one. Interesting premise, but unknown author and very few expectations. Right off the bat I was smitten with Tess. Tess is in her late 30s, the child of a hippie surfer dad who followed renaissance festivals performing magic during Tess's childhood, and is now settled with a margarita stand and a surfboard in California. Her mother died when Tess was a child, and all Tess really knows about her early childhood was that she and her parents lived in a New Mexico commune. Tess works as an adventure guide, and after a tour gone bad, she is left with some vague returning memories, and some time off to heal from her physical injuries. She decides to combine a work fact-finding trip with business and return to the area of the commune. I thought this was a unique and interesting setting, and found the interspersed recipes neat and appropriate to the story. Once Tess arrives in the area of the commune (now an organic farm/bakery), she finds a variety of interesting people, and an up and coming tourist area. She also crosses paths with Vince, a single dad of three little girls. Vince has all the attributes of a good romance hero, but he's also a caring, decent man who has his own baggage. Vince and Tess have an instant attraction, but aren't interested in anything long-term. They are absolutely perfect together, and their romantic scenes are beautifully written. I enjoy a little romance (okay, sex) but I'm a grown-up and don't need a pornographic tutorial. There are a myriad of characters sprinkled throughout; Tess's dad, local cafe owner Vita, abuse victim and recent parolee Annie, Vince's eccentric and troubled oldest daughter Natalie, and a mysterious man lurking around town. I couldn't get through this story fast enough to find what Tess would learn or remember about her early history, and how the romance with Vince would play out. The ending was eminently satisfying, and absolutely right. The only sticking point I had was the resolution of the mysterious man. I thought that was odd and didn't really fit. But otherwise I completely loved this book; it reaffirmed my belief that there are romantic fiction writers who actually put some thought into their stories and strive for realistic characters and situations. I can't wait to read more by this author, and I absolutely want to try some of the recipes!"}, {"userName": "Da", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/6076458-da", "userReview": "This book is so good!! I wish there was more stars to give it. The story is great, the characters are so well developed and she has such a beautiful way of kneading them gently and respectively into your experience; but in a way that you don't realize how deeply they have touched your soul. Every single one of them. Natalie is just the best child character I think I've read in a long time. She could have an entire movie, or kids show done about her. A kids show would be great. Anyway, I digress. This book must be experienced. This is the second book I have read by Barbara O'Neal. The first was \"How To Bake A Perfect Life\". I had the same feeling about that book. I loved it. I hadn't heard of her before that, I had been away from reading for sometime. Life had gotten overwhelming and sad for me and I lost interest in most things I had once found passion for. I decided it was time to return to the library. It was nice to be in there, the feeling enough brought a sense of well-being. However, choosing a book was going to be a different task. Any Authors I liked in the past, I knew I wasn't feeling in this moment. I needed something new. This particular library was enormous, with many levels to be overwhelmed by. I decided a book would have to find me as I walked through and if it didn't then that was ok too. Just being there walking around was enough. Out of the corner of my eye I saw the cover of \"How To Bake A New Life\". I bake and have 2 dogs. These two things were the only things left at the time that expanded my heart. And the title, well, clearly, it resonated. I couldn't put it down. I now bake bread, I bake a lot of things but bread was never of any interest to me. Baking bread has been a great new addition to my life. It's all the things she writes about and more. The day after finishing it, I went back for \"The Secret To Everything\" . I just now finished it. Tomorrow I will start on the next.Thank you Barbara O'Neal. These books, so far, have echoed my own life in a most haunting way. But beyond that, it is profound writing with so much lovely detail. But not too much as that can get gratuitous on the writers part if not done well. Your writing is done in a way that is not about you, but about the telling these characters way in a very simplistic yet intelligent way. The simple and beautiful things in life such as cooking, baking, dogs and having the courage to uncover yourself and follow life where it may take you as a result. And the recipe's...GENIUS. I can't say enough about how this expands the experience. I'm on a mission to try them all. Thank you for sharing your gift!"}, {"userName": "Carolyn Hill", "userReviewDate": "May 26, 2010", "userURL": "http://www.goodreads.com/user/show/1233028-carolyn-hill", "userReview": "I'd give this three and a half stars. For the most part I liked the main character, Tessa Harlow, who leads high end adventure tour hikes with diversions for nice restaurants. Sounds like a good gig to me. But after recovering from injuries in a terrible accident on a hike, she heads to the town of Los Ladrones in New Mexico to search for her past while scouting possible future tour locations. Born in a commune and raised by a former hippie surfer dude, she had nearly drowned in the river there as a child, but had no recollection of the events, only what her father had told her. When she had her traumatic injury, she had flashed back to the time she nearly drowned as a child. Further explorations lead to more flashbacks. She also meets a man and promptly falls into his strong muscled arms (there's a steamy - in both ways - bathroom scene for starters). Vince, the love interest, is a likeable guy, a widower overwhelmed with rearing three young daughters. He's almost a bit too heroic -- great looking, hot, muscular fire and rescue worker who's devoted to his girls. He seemed like a character in a made-for-TV movie or a typical romance. He hits on her at a restaurant, they feel sparks, etc. Too formulaic romance type stuff for me. All the people Tessa meets end up being connected to her past, surprise, surprise. I read this book on the recommendation of Sarah Addison Allen, an author I enjoy. While there was a touch of magical realism at the end, it was not like the dominant feature of S.A. Allen's books. There was also a foodie element with recipes, both of which would lead to comparisons with Allen's work, but they seemed very different. This book had a mild metaphysical tone with psychic foreshadowing and the character sought redemption in a Christian ritual, so it had a soulful quality. But the dogs were the most soulful of all (and there's a cat, too, for cat lovers). Though I'm no cook, the recipes sounded delicious, but I'm not sure why they were included since the main character was a traveler, not a cook. All in all, the book was a mixed bag. It held my interest, the characters were likeable, the mystery was not deep, complicated or surprising, and the love story was formulaic and would appeal to those who like their romances on the hot and sexy side."}, {"userName": "Kimberly Kincaid", "userReviewDate": "Feb 21, 2011", "userURL": "http://www.goodreads.com/user/show/3996771-kimberly-kincaid", "userReview": "Another incredible offering from Barbara O'Neal, who is now an auto-buy for me, no questions asked. This book had a little bit of a different feel than both Lost Recipe and Perfect Life, but O'Neal's stunning language and insightful, poignant voice shines through from the first chapter. There's a lot of emotion in this book (as with her others), and I was drawn in on page 2, unable to stop thinking about the characters long after I'd put the book down. Tessa is so wonderfully flawed, humble yet stand-offish, that I loved her in spite of being mad at her sometimes. Vince was just...I'm making that dreamy sigh-noise, he was THAT appealing to me (I like the troubled brooders. A lot). My heart broke for him, and the entire storyline with Natalie just broke my heart (it was okay, I mended in the end!). I thought the storyline with the commune was well thought out, the details of the setting were described perfectly, and the setting matched the mood of the book, adding to the experience. I loved that Tessa had life changes to go with her discoveries, and her resolution was sweet but not sappy. The whole book was very real to me. Loved it. Would highly recommend."}, {"userName": "Audrey", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/1511008-audrey", "userReview": "Probably my favorite of her books so far. loved the different relationships and her soul searching family discovery"}, {"userName": "Elyse", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "\"Eating a good hearty breakfast holds the secrets to life\".... Yet, I couldn't figure out why anyone would need a recipe for her 'Hearty Oatmeal' with raisins?I've been cooking it that way for at least 30 years. Also, It was the only Soluble Fiber breakfast mentioned in the towns beloved eatery of 100 Breakfasts. The other 99 choices didn't seem to be 'Heart Healthy' (so beware). ---\"The Secret to Everything\" (caution at your own risk)...lolOn with my review: The writing was amateurish --- During the first half of the book --the characters were annoying -- the plot trite. The author spent too much time with OVER-THE-TOP descriptions (leaving the reader little room to have our own imagination).It was annoying and shallow. I would have loved this book to be a 'comfy' book ---but with so many problems I couldn't help but 'feel' during the first half of the book--I found it this book more stressful and joyful ---However: I stayed with it: The 2nd half of the book moved into the story more ---(leaving behind the authors need to describe every detail along the way) --- giving the reader a little more intellectual credit. Yet--What was the purpose really for the mysterious man? (didn't add to the plot)...And What grandmother doesn't buy their grandchild an apple? (not believable)And the Random Ghost scenes popping up ---also didn't add anything to the story --The Sexy-Sparks between Tessa and Vince were a little hot...Natalie: filled with loss and grief, trying to be her own unique self --was an interesting character--The dogs had heart and soul...The FOODIE thing: (at times also lost its purpose and recipes were just tossed into the pages of the story). Again...TOO much description --lacking a sense of purpose with the plot. However: I am not a 'Foodie person myself. (so I found it all so dull and boring). Besides, I cook better! I'm almost 60 years old. I know how to cook. I know about fresh hearty food --organic --and good meals....but its a 'part' of my life....NOT my life. Also: Our main Character was a *TRAVELER*....(not a cook) ---yet the THEME (the SECRET??) -- is in the FOOD??? ---ie: home, family, love, relationship?/!)....OK, I get it. I got it years ago. The 'mystery' was not deep or complicate--no surprise! (yet, I can enjoy a happy ending as much as the next person).Cheers for love --and healthy relationships! Kudos for 'The Happy Family' coming together! Whew: Now, maybe Natalie will be allowed to eat all the apples her heart desires!"}, {"userName": "Elizabeth", "userReviewDate": "Jan 31, 2010", "userURL": "http://www.goodreads.com/user/show/2105748-elizabeth", "userReview": "This book doesn't belong in the top tier because it's not life-changing or edifying in any way, but boy does it entertain! It was the quintessential \"beach book\" and, if truth be told, probably a \"chick book.\" It was just what I needed to push away the winter doldrums and get my mind off anything stressful, and I carried it with me so I could read whenever I was waiting for anything (dentist's office, meetings, etc.).Tessa Harlow is recuperating from an injury sustained when a landslide occurred while she was leading a hiking tour group in the mountains and one of the members was swept into the river and drowned. Tessa's own rescue from the river awakened long-dormant memories of a similar rescue when she was a child, an accident about which her father has been strangely quiet, though it was responsible for her mother's death.Drawn to the New Mexico town of Las Ladronas and thinking it would be the ideal destination for a future tour group, Tessa finds herself embroiled in a series of strange emotions and coincidences that add layer upon layer to the mystery of her life and questions about the relationships between people in the story who seem to be so drawn to each other. Of course there is delicious love interest in the person of Vince Grasso, a handsome widower with three appealing little girls, one of whom is troubled over the death of her own mother and to whom Tessa feels especially drawn.The book's appeal is heightened by the charming presence of very affectionate dogs and the sprinkling of real recipes (the author is actually a food professional herself). The recipes remind the reader of the power of good, nourishing food, lovingly prepared, to comfort and heal.I was so sorry when this book ended...it gave great pleasure."}, {"userName": "Christina Mitchell", "userReviewDate": "Mar 24, 2012", "userURL": "http://www.goodreads.com/user/show/5891560-christina-mitchell", "userReview": "And....another book club read. :oD I would have never picked this up on my own. My honest opinion of the book: great summer beach read! Truly! It is filled with wonderful characters and just enough intrigue without heavy language or symbolism to enjoy from bath, to beach, to sangrias on the deck. It even has a surprise ending.I gave it only two stars because I truly cannot deal with any romance. None. Zilch. That is my hang up. I fully admit I have a broken heart that calls for the constant replaying of Adele's 21 album and trying to figure out some peace with which I can live. On that note, I could relate to Tessa. But that is about all I could stomach about her. I was more fascinated by Vita, Annie, Cherry, and the rest of the townspeople. This book for me was lovely for the simple reason that it took me home. I was born and raised in northeastern New Mexico. I know the areas of Santa Fe, Taos, and Pueblo (Colorado) very well. I loved being back home for awhile. I enjoyed the familiarity with a little bit of the spirits said to be haunting most of the off-beat places of New Mexico. I grew up with the legends of the Llorona. She was everywhere. You could do worse than this book for a little get-away reading. It isn't great literature, but do you always need great literature, or do you sometimes need a little escape with the blessings of spirits?"}, {"userName": "Sharon", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/8043608-sharon", "userReview": "The characters were interesting - all - to a person- emotionally damaged to one degree or another and searching.... The story line, about lost childhood memories of traumatic events surfacing in the present was entertaining, if not finely nuanced - it relied alot on improbable coincidences - so you were either into it or not. The descriptions of the New Mexico scenery were compelling, and there were the requisite steamy love scenes. As with other O'Neal books food was a key part of the story, and there were some good recipes included, although including a recipe for hot oatmeal cereal seemed kind of unnecessary - more like part of the story's mystic. The fact that everyone 'lives happily ever after' seemed a bit disingenuous given all the baggage each character brought to the tale.I found this in my EReader, which indicated I had already read the book- but I didn't remember it, so read it again. Once a got into it a bit I began to remember the story line and characters, and decided to finish reading it again. That about sums it up- an interesting read - not super-memorable."}, {"userName": "Lea", "userReviewDate": "Nov 11, 2009", "userURL": "http://www.goodreads.com/user/show/1073701-lea", "userReview": "FirstReads: This is the best book I have read in a while. There is something for everyone: Mystery, Romance, Food, Dogs, Beautiful Scenery. What more could you ask for?Tessa is injured in a work accident, nearly drowned. This stirs up memories of her long buried childhood. As she recovers from her physical injuries, she is unable to heal as quickly from the emotional ones. Much to her father's dismay, she returns to the town where she was born, in the New Mexico mountains. There she meets many colorful characters, including Vince, a man as lonely and lost as she is, his 3 daughters who are also a bit lost. There are the members of the commune where she was raised the first few years of her life, Vita at 100 Breakfasts and her parole assistant Annie. Such a great cast of characters that bring the story to life, in each of their voices.A must read for anyone. Fans of Kris Radish will really enjoy Barbara O'Neal."}, {"userName": "Rory", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/270540-rory", "userReview": "This doesn't seem possible, considering how wonderful \"The Lost Recipe for Happiness\" and \"How to Bake a Perfect Life\" are, but it is: \"The Secret of Everything\" is Barbara O'Neal's best novel. She is a poet in a novelist's body. There will be so many instances when you'll read a line in this one, put the bookmark in the spine, and close it just to think about her descriptions, to smile with pure pleasure at what you've read, to revel in those descriptions. I had a slight interest in New Mexico because of the movie \"Swing Vote\", but \"The Secret of Everything\" sealed it for me. I want to visit one day.If you pick up this book, give yourself many uninterrupted hours for it. It will be worth it."}, {"userName": "Trish", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/23248374-trish", "userReview": "Decent writing, but I feel like the author was just trying to tick off too many boxes with this book: mystery - 60s history - animal lovers - foodie novel (oh, and throw in some offbeat spirituality and some psychological trauma as well)I think I was most disappointed with the foodie novel part, as that's what actually made me pick this up. She describes food, and even includes recipes, but there was nothing that made me want to toss the book aside and instantly try it. The descriptions just weren't vivid - I wasn't imagining scents or textures.And well... the ending? We all like a happily-ever-after, right? But this had far too many coincidences and everything tied up in a bow for it to be realistic. Don't think I'll be reading anything else from this author."}, {"userName": "Michelle", "userReviewDate": "Mar 20, 2010", "userURL": "http://www.goodreads.com/user/show/1391050-michelle", "userReview": "SPOILER ALERTI didn't love this book because I was either annoyed by the characters or ambivalent about them. The plot pretty much lost me at the mention of hippies and a commune. Also, Sam's mention of evil spirits in Los Ladrones (misspelled on the back cover--hilarious) is glossed over. There is one evil spirit, which he would know nothing about. Vince's mother needs a whack upside her head. Who doesn't buy a kid an apple, especially when she's begging for one and said adult thinks that the kid is fat? Geez. The two stars are actally for the ending. It's predictable and typical chick lit."}, {"userName": "Maureen Mullis", "userReviewDate": "Mar 18, 2014", "userURL": "http://www.goodreads.com/user/show/4447292-maureen-mullis", "userReview": "A very well written and interesting story, THE SECRET OF EVERYTHING tells about a young woman finding herself in her hidden past. The thing I like about Barbara O'Neal's books is that they are full of interesting characters and situations that you could easily see yourself in. At times she is repetitive in her writing (every fountain in the book is \"chuckling\" for instance) but that is a small thing. Her writing is cohesive and her voice is strong and melodic. If you like women's fiction I would highly recommend reading not only THE SECRET OF EVERYTHING, but I would encourage you to check out her other books."}, {"userName": "Beth", "userReviewDate": "Dec 21, 2009", "userURL": "http://www.goodreads.com/user/show/584609-beth", "userReview": "I loved this book! The New Mexico mountain setting, so similar to my home state of Colorado, the damaged people, adults and children, from an old hippie commune finding healing, the luscious recipes for New Mexico-style breakfasts from the 100 Breakfasts cafe, the love story and more were just perfect. I've loved every one of Barbara Samuel/O'Neal's books that I have read, but this one was truly special. I know Barbara, and she's full of love and old-soul wisdom, and she pours those into her books. I can't wait to read the next one by her on my TBR list!"}, {"userName": "Carrie", "userReviewDate": "Jan 12, 2012", "userURL": "http://www.goodreads.com/user/show/203302-carrie", "userReview": "more mysterious then the other ones...this one had breakfast recipes throughout...YUM and the man...vince...sounds PERFECT for me :)"}, {"userName": "Sara", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/2446286-sara", "userReview": "Typical Barbara O'Neal... Good storyline, happy ending and food! Like the plot twists."}, {"userName": "Janga", "userReviewDate": "Sep 26, 2009", "userURL": "http://www.goodreads.com/user/show/1206531-janga", "userReview": "I loved everything about this book--the characters, the setting, the plot, the prose! Natalie has been added to my top ten list of kids in fiction. Such a real, heart-tugging child!"}, {"userName": "Nicola Marsh", "userReviewDate": "Jul 19, 2010", "userURL": "http://www.goodreads.com/user/show/4030737-nicola-marsh", "userReview": "Beautifully written, so richly evocative."}, {"userName": "Joan Silva", "userReviewDate": "Dec 11, 2013", "userURL": "http://www.goodreads.com/user/show/24382930-joan-silva", "userReview": "Fun read. Love her books and storyline"}, {"userName": "Kathryn", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/3076351-kathryn", "userReview": "Review to follow"}, {"userName": "Gaia Amman", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/20261733-gaia-amman", "userReview": "Tessa is a hiking guide in her late thirties and she messed up. She was content with her life, but the accident (no spoilers) forces her to stop and reconsider her choices. She will end up unveiling secrets from her past and changing her direction entirely.This novel reads very well but it's SO SLOW. It was not boring, I was with it until the end, but the narration was trying to accomplish too many things at once at a very slow pace. There is the mystery aspect of it: what happened to Tessa? What's in her past? Who's the scary character she sees lurking all the time? Then there's the romance aspect: are they going to sleep together? Is it going to go anywhere? Then there's the foodie aspect. While I did not mind the occasional description of a recipe or a meal, I found the ever-present recipes at the end of every chapter to be disruptive. I skipped all of them. I think they would have been better placed as an appendix. Then there's the photography aspect because Tessa LOVES photography. I personally appreciated it because I love photography as well, but it made for very slow progress. Then there's the self-discovery aspect and the abused women angle. Add many endless descriptions of hiking and landscapes and…yeah, you get the idea.I felt like I was spinning in circles. I actually love novels with multiple plot lines, even more so if they cross genres. It's just that the pace was a bit slow for me. She wakes up and thinks, goes for a walk, takes some pictures, has a meal… The excellent writing made it enjoyable but it was not a book I made time for or looked forward to immersing myself in. (You can see it took me forever to get through it. After I finished it I thought it was 800 pages or so, but I checked and it's only 400!!!! Lol)I read it, I kind of enjoyed it. It did not blow my mind."}, {"userName": "Suzy", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/6352563-suzy", "userReview": "I really enjoyed this book. I have read almost all of O'Neal's novels and have adored them all. She has such a lyrical voice throughout her stories and the landscape comes to life so beautifully. I felt like that I was there with Tessa and going through all the struggles with her. Los Ladronas (though I am not sure the town is a real place) sounds so earthy and alive and makes me want to go there immediately. I have been to Santa Fe, NM and the mountains and the air there were just lovely. I really enjoyed Teesa's photography and how she captured the world around her. I also loved the dogs throughout the story. And then there was the food. O'Neal always threads food throughout her books and I adore that. This one had some amazing recipes that sounded like something that would be delectable to try. I had a hard time putting this book down and will be flipping through it for recipes soon."}, {"userName": "Carla J", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/16766198-carla-j", "userReview": "It took a bit to get interested but then I really liked this book. It was surprising with just enough mystery to make it unique and not really a typical romance novel. Tessa, injured both physically and emotionally, goes back to the town she left as a child. Her past memories are beginning to have her asking questions about her mother and the children of her youth."}, {"userName": "Joanne", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/40987231-joanne", "userReview": "I wish the story could have continued! It was written with an eye for beautiful scenery, some great dog friendships, cafe interactions (and recipes!), and family love. My first book by the author, but will read others."}], "description": "In this spectacular new novel, Barbara O’Neal delivers a generous helping of the best in life–family, food, and love–in the story of a woman’s search for the one thing worth more than anything.At thirty-seven, Tessa Harlow is still working her way down her list of goals to “fall in love and have a family.” A self-described rolling stone, Tessa leads hiking tours for adventurous vacationers–it’s a job that’s taken her around the world but never a step closer to home. Then a freak injury during a trip already marred by tragedy forces her to begin her greatest adventure of all. Located high in the New Mexico mountains, Las Ladronas has become a magnet for the very wealthy and very hip, but once upon a time it was the setting of a childhood trauma Tessa can only half remember. Now, as she rediscovers both her old hometown and her past, Tessa is drawn to search-and-rescue worker Vince Grasso. The handsome widower isn’t her type. No more inclined to settle down than Tessa, Vince is the father of three, including an eight-year-old girl as lost as Tessa herself. But Tessa and Vince are both drawn to the town’s most beloved eatery–100 Breakfasts–and to each other. For Tessa, the restaurant is not only the key to the mystery that has haunted her life but a chance to find the home and the family she’s never known.", "title": "The Secret of Everything", "url": "https://www.goodreads.com/book/show/6664525-the-secret-of-everything", "average": 3.92, "cover": "https://images.gr-assets.com/books/1320481016l/6664525.jpg", "reviews": 352, "authors": [{"url": "https://www.goodreads.com/author/show/941508.Barbara_O_Neal", "name": "Barbara O'Neal"}], "type": ["Womens Fiction", "Fiction", "Romance", "Contemporary", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/6664525-the-secret-of-everything", "http://www.goodreads.com/book/show/8731563-the-secret-of-everything", "http://www.goodreads.com/book/show/17590661-the-secret-of-everything", "http://www.goodreads.com/book/show/35817446-the-secret-of-everything", "http://www.goodreads.com/book/show/8538883-how-to-bake-a-perfect-life", "http://www.goodreads.com/book/show/4944721-the-lost-recipe-for-happiness", "http://www.goodreads.com/book/show/18248416-the-all-you-can-dream-buffet", "http://www.goodreads.com/book/show/12819479-the-garden-of-happy-endings", "http://www.goodreads.com/book/show/818096.No_Place_Like_Home"]}