{"ratings": 347, "userreviews": [{"userName": "Grace Krispy", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/2907985-grace-krispy", "userReview": "After being suspended from the paper, Pulitzer prize winning journalist Ty West is desperate to revive his career. Luckily for him, there’s a medieval serial killer on the loose in San Diego, and Ty is uniquely situated to get all the scoops. With some serious perseverance and a bit of luck, everything seems to be going his way. But things can change in an instant. Chasing down this story may be the most dangerous story of his career, and one false move means Ty stands to lose everything that’s ever mattered to him.A former columnist himself, the author seems to know his way around newspaper business (love the “Wheaties test”). The characterization in this book is well done, and the richness of the detail serves to pull the reader into the story. In fact, I’m a little frightened of the author, due to the impeccable research he’s put into the character of Friar Tom. The information about the instruments of torture is exquisite, and really adds to the storyline. Somehow, the author manages to make such a wild storyline believable, and the result is a riveting, and frightening, tale. Told in both first person (Ty) and third person (Friar Tom), it’s easy to follow the plot as it builds to its inevitable conclusion.This was a book I found really difficult to put down. I began reading it on Sunday morning, and I could hardly be parted from my reader all day long until I finished the book. It was engrossing and well- written. I’m a big fan of Michael Connelly’s books, and I think Ty West may be Harry Bosch’s biggest competition. The twists in the story were easy to follow, and I never was lost or confused about what had happened.Originally posted @ GraceKrispy's MotherLode review blog"}, {"userName": "Breia", "userReviewDate": "Feb 03, 2012", "userURL": "http://www.goodreads.com/user/show/2736850-breia", "userReview": "This is the best free book I have picked up from Amazon. This novel is the author’s first fiction work and I thought it was very well done. The suspense and drama/horror (though I would not categorize this as horror at all) is spot on. Though you know who the killer is about half way through, I still could not put it down. I had to know why and when and disturbingly enough, what. I am rating this 4.5 stars only because I felt the conversation parts were a bit off.This would be a great beginning to a series and the author is certainly talented enough to make it happen. This is free with Amazon Prime right now (or $3.99 – definitely worth it) so if you are into serial killers, pick this up. You will not be disappointed."}, {"userName": "Jenny Hilborne", "userReviewDate": "Jan 29, 2011", "userURL": "http://www.goodreads.com/user/show/4121068-jenny-hilborne", "userReview": "I just finished reading The Scavengers Daughter and had to share my comments so you don’t miss out on a fabulous read. A combination thriller/mystery/horror, this book starts out with a gripping prologue and launches straight into action with the first of its high-profile victims. McIntyre spares us no mercy in the vivid detail he gives of each torture method inflicted on his victims. The tension builds in every chapter – and there are a lot of them.Set in San Diego, Southern California, the story dives into the gruesome world of medieval torture inflicted by a modern day killer. Investigative reporter, Tyler West continually defies the police in a desperate search for the sadomasochist, Friar Tom, before he loses everything that matters to him.The Scavengers Daughter is an involved, complicated plot expertly woven together to create a fantastic, suspenseful read. The chapters are short, the pace is fast and furious, and the reader is immediately hooked right up to the end. The characters are realistic, well developed and likable, even with their flaws. The villain, despite his cruel and dire passion for torture, is believable and convincing.I didn’t want this book to end."}, {"userName": "Al", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/1698114-al", "userReview": "The protagonist of \"The Scavenger’s Daughter,\" Tyler West, is convinced that a series of murders are the work of the same person. Frustrated by police and city leaders who insist the murders aren’t related, Tyler digs deeper and uncovers the common thread that nobody expects. A killer, who calls himself Friar Tom in tribute to the first Grand Inquisitor of the Spanish Inquisition, is committing each of the murders with a medieval torture device.I found \"The Scavenger’s Daughter\" to be one of those books I didn’t want to put down. It was fast-paced and never apparent what was coming next. At times, it seemed everyone was working against Tyler, which brought out my natural instinct to root for the underdog. A secondary story thread, offering the possibility for Tyler to redeem a past mistake by rekindling a romance, also helps make Tyler a sympathetic character and ties in well with the main story line. Thrillers don’t get much more intense than this.**Originally written for \"Books and Pals\" book blog. May have received a free review copy. **"}, {"userName": "Jack", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/4854532-jack", "userReview": "A serial killer thriller with some particularly grotesque methods used."}, {"userName": "Caleb Blake", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/4674768-caleb-blake", "userReview": "A self-appointed inquisitor is exacting a grisly revenge against the San Diego elite using medieval instruments of torture. Such is the premise of \"The Scavenger's Daughter\" by Mike McIntyre. I am not a thriller afficionado, but I do have an idea on what I think a thriller should be: the language should be relatively simple (dense phrasing can slow things down), the pace needs to be break-neck (or at least needs to become faster as it progresses), the novel needs to quickly become `unputdownable'. So do I assess this novel as fitting these three criteria? Absolutely! I devoured \"The Scavenger's Daughter\" and was left at the end feeling like I'd just watched a thriller at the cinema. For an author of this genre I'm guessing this is pretty high praise. This novel does not break new ground and the plot is not highly original, but playing it safe has its advantages; why fix what ain't broke? The central character, previously acclaimed, now a bit down on his luck is trying to establish himself again as the investigative reporter du jour. Some seemingly unrelated stories put him on the trail of a sick serial killer. Happy circumstance gifts our hero with contacts in the FBI and forensics - both giving him a helping hand along the way which is quite convenient from a plot point of view. An assistant district attorney ex-girlfriend provides the extra depth and some scattered love scenes (tastefully written). The pacing was very well done. I was hitting the page turn button rapidly as the novel progressed and the shorter chapters only helped convince me to read \"just one more chapter\". This is exactly what you need in book of this genre so I would judge the author to have been very successful in this area. In a thriller, when the tension is at its peak and the hero needs that one piece of the puzzle to put everything into place, we come to our final revelation - that moment when we approach the resolution of the story. The Scavenger's Daughter had a number of revelations and pre-requisite false turns and crises that jeopardise the redemption of the main character. Some profiling from an FBI friend gave a somewhat over-accurate laundry list of serial killer characteristics to match suspects which I thought was a bit contrived, but the final piece of the puzzle was even more so and rather unlikely. It was the square peg hammered into the round hole to push the story to resolution in my mind and probably my main gripe in the novel. Given that the serial killer dispatches his victims with medieval torture instruments, one might expect some rather gruesome depictions of torture within the novel. Maybe I have a steel stomach, but I felt that the author was admirably restrained. General descriptions of the use of such instruments were furnished and would still allow the reader some uncomfortable visuals, but the narrative itself didn't become that blend of pornography and gore prevalent in some cult horror movies produced in the last few years. However, there was some license used in the depiction of at least one of the torture devices, the scavenger's daughter after which the novel was named. As I'd never heard of this device, I did some research of my own as I was curious how it achieved the effect described in the book. After some reading, I felt that the author had produced an amalgam of two different versions of the instrument used centuries ago. One version locked limbs and neck together but would not have had the rapid or acute effect described in the book and the other did not need to lock wrists, legs or neck into place to have the effect that was clearly being described within the book. It's a very small thing, but I'm not sure why the author danced with authenticity when it should have been just as easy to have used historical detail accurately. McIntyre does not blaze new trails and frankly does not need to with \"The Scavenger's Daughter\". It has that thriller movie feel that authors of this genre should covet, it sticks to a successful formula of character, pace and plot and it left me satisfied. I would definitely recommend this book to thriller lovers if you don't mind covering similar ground while you're enjoying the ride."}, {"userName": "Bradley Convissar", "userReviewDate": "Jul 22, 2011", "userURL": "http://www.goodreads.com/user/show/4464763-bradley-convissar", "userReview": "I picked up Mike McIntyre's The Scavenger's Daughter based on several good reviews I read. And I'll admit, I enjoyed it.I tend to not read too many books in the thriller/mystery/suspense genres simply because I am overwhelmed with fantasy and horror books. But, I am a fan of Deaver's Lincoln Rhyme books and Preston/Child's Pendergast books, I needed something to read on my Droid X, and it was only $.99 so I decided to give this book a try.The story was fast-paced and follows suspended, Pulitzer-prize winning journalist Tyler West as he tries to tack down the man who is murdering several rich and famous people in San Diego using medieval instruments of torture. The descriptions can be gruesome at times, as can be expected considering the contraptions used are quite gruesome, but the author never goes overboard with his descriptions. I will admit, though, while reading the book, I went online to view some of the awful devices. Hey, I'm a dentist. I love instruments of torture.Like I said earlier, I enjoyed the book. It was a quick, fun read, informational and engaging, with a likable and well-developed lead character. McIntyre paints a vivid picture of his location, int his case San Diego, which always helps the reader to put himself into the story. There were some events and circumstances that were a little too convenient and coincidental, needed to move the story ahead, but nothing too egregious to affect the story. Not plot holes, exactly, but a couple of logic jumps.My biggest gripe with the book is the length and how much the author tries to accomplish in the single book. Now, we all know that with the advent of digital publishing, page count has gone out the window. Now what matters is word count. Conventional wisdom says it is 250 words per page, but we all know that, when you count the number of words on an average printed book page, it is between 350 and 450, depending on the amount of dialogue. So if an eBook is 75,000 words, that can be converted to approximately 300 pages. But, if that same book were converted to print, it would only be around 250 pages.But I digress... I don't know how long The Scavenger's Daughter was, but it seemed on the short side. I felt that there could be more meat to it. More side stories. Now, McIntyre did set up a contentious relationship with the local police which can be, and I expect will be, explored in later books. But I thought the mythology of Tyler West's world could have been opened up and explored more. He finds a lost love who hates him at the beginning of the book and patches things up over a single novel. Now, their relationship is important to the plot, but I felt that maybe it could have taken two or three books for their relationship to heal. And if that meant that this had to be the 2nd or 3rd book in the series, then so be it. My next blog posting will actually be a short commentary on eBooks and length, so keep your eyes open for that.Anyway, these are all mild complaints which really won;t affect how much you enjoy the story. And for $.99, you get your money worth. Hell, this book is worth $2.99. And I will definitely pick up the next book in the series when it is released."}, {"userName": "Ken", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/31585133-ken", "userReview": "The Scavenger’s Daughter: A Tyler West Mystery by Mike McIntyre is a detective story, a reporter’s story, a love story, a crime story, and a mystery. A serial killer is terrorizing San Diego, seemingly picking his victims at random. The twist is that the killer uses implements of medieval torture to dispatch his victims, upping the level of tension and suspense, and terrorizing the city. Tyler West, a Pulitzer prize winning journalist, watches his career and life circle the drain. He has lost touch with his girlfriend after spending several years in the Middle East reporting on those conflicts. The mayor, the police, and his publisher hate him for the exposure he has brought to high-level corruption in San Deigo. His publisher wants to get rid of him so much that he is assigned to the fashion beat at the art museum opening of a new exhibit. This is an exhibit of Medieval instruments of torture, where the mayor is the first to die. Having almost witnessed the murder, West sees an opportunity here to redeem himself by exposing the killer. But the police want him gone since they consider his investigative reporting to be interference in their investigation. Not helping matters is West’s superior detective skills keeping him one step ahead of the police, who are not willing to listen to his theory of the case. Along the way West is reunited with his old girlfriend, and they tentatively restart their relationship where they left off years ago. West’s investigation runs through a interesting cast of characters in the Art world, the Medieval history world, (and the Medieval torture world), any one of whom could be the killer. As the story develops we learn that these crimes may not be as clear cut as they seem, and the deaths only appear to be random. Mike McIntyre has previously written several travel books; this is his first fiction novel, and it is a worthwhile one. He builds the suspense throughout the story with believable situations and characters. Tyler West is a likeable guy who is beginning to realize his faults and do something about them. Looking over West’s shoulder as he races after the killer is suspenseful and holds your attention through the end. This is one book that you will not want to put down. McIntyre also takes you into the mind of the killer, who is forced to counter West’s moves through each crime and still not get caught. The story is a swift ride of twists and turns as tension builds towards the final act. Fans of crime and detective fiction will find this book highly rewarding."}, {"userName": "Babs", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/1970552-babs", "userReview": "A Southern California self-storage unit filled with medieval instruments of torture…A modern-day Torquemada hell-bent on updating the Spanish Inquisition…An investigative reporter racing to connect the lurid dots…Deadline has a whole new meaning.Tyler West, suspended Pulitzer Prize-winning reporter from the San Diego Sun, is desperate for a scoop that will save his career. Defying a spiteful publisher and a vindictive homicide detective, he investigates the baffling deaths of several of San Diego's powerful, rich and famous. Police call the murders unrelated, but Ty uncovers a common link: torture devices last used during the Dark Ages, including the Iron Maiden, the Pear of Anguish, and the most sinister of all—the Scavenger's Daughter. Ty is plunged into a mysterious world of medieval torture scholars, antiquities collectors, museum curators, and sadomasochists. Aided by photojournalist Melina \"Mel\" Koric, a former Bosnian War refugee, Ty must break the brilliantly conceived series of slayings that has cast a dark shadow over a city better known for its sun, sand and surf. The elusive killer goes by the name Friar Tom, in tribute to his hero, Tomás de Torquemada, the first Grand Inquisitor of the Spanish Inquisition. As Ty scrambles to unmask the monstrous zealot, he must juggle his investigation with his personal life: He pursues his lost love, Jordan Sinclair, an assistant district attorney, and continues to mentor inner-city kids at his youth golf clinics. With the city caught in an escalating nightmare of medieval mayhem, Ty is drawn into a lethal game of cat and mouse that could cost him everything. Lightning-paced, intricately plotted and wildly suspenseful, The Scavenger's Daughter grabs the reader early and doesn't let go until its heart-pounding climax.My 2 cents:Another great thriller, mystery and a touch of horror that will grip you from the beginning. Tyler will go to whatever he needs to do to save the people that are important to him. The book is faced paced and you will not want to put the book down.I liked the book for the vivid details from the author. He spares non of us from the tales. I also liked the suspense through out the whole story. As you read each chapter you get more and more involved and want to know what is going to happen next. The story will keep you on the edge of your street."}, {"userName": "Shelleyrae at Book'd Out", "userReviewDate": "Mar 07, 2011", "userURL": "http://www.goodreads.com/user/show/1607230-shelleyrae-at-book-d-out", "userReview": "The Scavenger's Daughter is an impressive thriller by Mike McIntyre who draws on his experience as an investigative journalist to create a gripping tale of a terrifying serial killer spree in San Diego. Tyler West is a Pultizer prize winning newspaper writer whose investigation of several celebrity murders identifies a tenuous connection in the method of their death. His instincts are ignored by the police so Tyler follows up on his own, only to find himself a suspect, and the love of his life held hostage at the mercy of a madman.Tyler West is a fully realised character, once a golf pro who switched to journalism after his game faltered, his life has been a series of ups and downs. He struggles to balance his passion for reporting with his personal life and a tendency to pursue a story to the exclusion of all other considerations. McIntyre's first hand knowledge of the field provides an authenticity that grounds his protagonist but he doesn't neglect to round out West's character by exploring his vulnerabilities. His relationship with Jordan and her daughter, and the boys he mentor's, all contribute to creating a well developed and appealing lead.Ty's investigation leads him to the distorted mind of Friar Tom, whose obsession with medieval torture instruments, supports his taste for sadomasochism. The Scavenger's Daughter that the title refers to is a cruel torture device used by Tomás de Torquemada, the first Grand Inquisitor of the Spanish Inquisition. It compresses the victim in such a way that their death is slow and agonizing. Friar Tom has several similar instruments at his disposal and delights in terrorizing the populace of San Diego with his horrifying crimes.Intricately plotted, fast-paced and exciting, The Scavenger's Daughter is a well crafted page-turner. I was impressed with the quality of the writing and thought the entire premise to be well executed. I'd favourably compare this novel with popular titles in the genre by established author's like Jeffrey Deaver. The Scavenger's Daughter is a chilling novel of suspense that will keep you engrossed until the very last twist."}, {"userName": "L.C. Evans", "userReviewDate": "Jan 31, 2011", "userURL": "http://www.goodreads.com/user/show/1613057-l-c-evans", "userReview": "First Rate ThrillerI'm not a fan of serial killer books and rarely read them, but The Scavenger's Daughter promised something different. And it delivered. Main character Tyler West is well-drawn and entirely believable as an investigative reporter who won't quit. Not surprisingly he has made enemies among some of the higher ups in his city--San Diego. Even the police don't like him or want to work with him. But someone is using Medieval torture implements to kill people and the police don't have a clue. Tyler West does, but the police won't believe him. The killer wants publicity and a worthy opponent and he quickly realizes Tyler West can provide both. The suspense starts right in the beginning and rarely lets up until the final page. This book was hard to put down. The author alternated between first person point of view from Tyler West's viewpoint and third person viewpoint from other characters. The viewpoint switches were skillfully handled and not a distraction and the book was well-plotted. Warning: The well-researched descriptions of the torture implements and how they were used are not for the squeamish. Readers will be glad they live in more enlightened times. A great read. If you love well-written thrillers, this book is for you."}, {"userName": "Albert", "userReviewDate": "Sep 11, 2012", "userURL": "http://www.goodreads.com/user/show/9227027-albert", "userReview": "Overall Feedback: A very compelling read, makes you never want to put it down. You will never want to put it down long enough to finish everything else. Go ahead and grab this one but make sure you either have everything else done or can do without getting it done.Point of View: You follow Tyler throughout this suspense ridden storyline.Voice: Does a great job of compelling the reader forward.Character Development: Expertly crafted and spot on. The characters become a part of the reader and as the reader you will be caught up in it all.Plot: Crafted to precision and will have you on the edge of your seat.Dialogue: Genuine dialogue that only reinforces the development of the characters.Pacing: Short quick chapters and written in a way that makes the story breeze by.Setting: The scary part is this could all be true, glad to know for now it is all in the pages of this book.Continuity: Does not miss a beat and the writing allows the reader to move through the story without effort."}, {"userName": "Bob", "userReviewDate": "Apr 10, 2013", "userURL": "http://www.goodreads.com/user/show/2401232-bob", "userReview": "Tyler West is an investigative reporter currently on suspension from his paper following an expose with some erroneous facts. His editor assigns him to cover the opening of a Museum of Torture and while there ends up covering a murder of the Mayor killed in the Iron Maiden, one of the displays. The editor takes his story and assigns it to another reporter, but Tyler continues to probe into the murder on his own time. When several other high profile celebrities also turn up dead and attributed to accidents or random events, Tyler tries to convince the Police that they are connected and caused by variety torture of devices and are the work of a serial killer. The chase becomes more involved as Tyler tries to find some concrete evidence to point to the killer, he is slick and Tyler is unsuccessful. Things come to a head when Tyler’s girlfriend is kidnapped by the killer in an attempt to get Tyler to write more articles about the killer. Good pace, characters and all around good read."}, {"userName": "Marla Madison", "userReviewDate": "May 26, 2013", "userURL": "http://www.goodreads.com/user/show/5478259-marla-madison", "userReview": "The Scavenger's Daughter is a very well-written suspense novel.The main premise, a killer who uses medieval torture apparatuses to murder his victims, is both interesting and disturbing. The plot has many tantalizing subplots and twists, all of which were fun to read.The only detraction for this reader was the relationship of Tyler with his long lost love which went from him wondering about what she was doing all these years after dumping him, to finding her, reconnecting with her and marrying her, all in about six chapters. The reader has no time to form any kind of real interest in their getting together.Fortunately, the rest of the story is very engaging and suspense lovers will find it a great read."}, {"userName": "Pamela ", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/3925721-pamela", "userReview": "If you love thrillers about seriel killers, look no further as this one has it all. The author has spun an amazing story with well-rounded characters that come across as real and believable, not to mention likable. Not only is it suspensful with lots of twists and turns to keep you guessing who the killer is, but it's also full of gory, descriptive details about Medieval torture devices, which the killer inflicts upon his many victims, that will keep you on the edge of your seat. This book is definitely not for the squeamish as the details are quite descriptive taking horror to a whole new level. I highly recommend this book. I read it in one sit as it grabbed my attention right from the get-go and never let up. I look forward to reading more books by Mike McIntyre."}, {"userName": "Ashley", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/6373757-ashley", "userReview": "The Scavenger's daughter was a surprising, always suspenseful mystery from the beginning of the book to the very end. The main character, Tyler West, is one of my favorite protagonists. A disgraced writer, a pulitzer prize winner who finds himself in the middle of a set of murders done using medieval torture devices. I love the medieval time era, and reading a mystery involving instruments used during the Spanish Inquisition felt deliciously evil. I enjoyed how the author wrote different parts of the book from either Tyler's or Friar Tom's persepctive, allowing the readers to get a glimpse of the monster within. I will definitely read more works from this author, if this one is any indication!"}, {"userName": "L.T. Fawkes", "userReviewDate": "Apr 05, 2012", "userURL": "http://www.goodreads.com/user/show/7606477-l-t-fawkes", "userReview": "Tyler West is an investigative journalist in San Diego who has run afoul of his publisher and is being taken off the best stories in retribution. When the mayor dies in a bizarre accident, he thinks there's a lot more to the story.When he begins to suspect a serial killer is targeting San Diego's elite, West can't stand to sit on the sidelines. He moves to on-line media and goes after the killer.Tyler West is a very likeable character. The other characters are fully-fleshed and interesting; the plot is very inventive, if macabre (not for the squeamish); and the action is well-paced.Highly recommend."}, {"userName": "Linda", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/6003538-linda", "userReview": "This book was a two_edged thriller. It was repulsive and grotesque, however, I could not stop reading it....even though I wanted to. It was well written, but if very descriptive torture is not for you...you might want to skip it. You do get to like the main characters ( the good guys of course). Well written, but definitely not for the squeamish. Discovered it by accident...though it was a regency type, as was the apothecary a daughter and anatomist's apprentice. Needless to say...a slight shock as I got into it. If you like psychological thrillers, and are not squeamish, this is a possibility."}, {"userName": "Ellen", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/8820521-ellen", "userReview": "It's a 3 1/2 but because I enjoyed the ending, I will go with the extra half star. This is murder mystery thriller. The kind that makes me wonder if there is something wrong with me or with us as a society that we want to be voyeurs on such horror. It was an excellent thriller, page turning. The characters likeable if somewhat flat. Exciting, horrifying and thank you Mr McIntyre for the ending."}, {"userName": "Toni Rakestraw", "userReviewDate": "May 27, 2012", "userURL": "http://www.goodreads.com/user/show/4820884-toni-rakestraw", "userReview": "I plowed through this book while waiting at the hospital for a family member to get a procedure. It was entertaining, kept my interest during a stressful time, and kept me guessing. The hero, Tyler West, finds himself pitted against a modern day Torquemada, who enjoys hearing his victims scream. The stakes get higher when Ty's new bride is slated to be next on the killer's list. I highly recommend this book to anyone who enjoys a good thriller."}, {"userName": "Elizabeth", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/382579-elizabeth", "userReview": "I downloaded this free onto my Kindle and decided to give it a shot based on the reviews. I love this genre as well. This turned out to be one of the best crime-fiction thrillers I've read in recent months. I loved the main character and the story lines. This really did have me in suspense most of the way through. I could wait to finish. I would read more by this authors for sure."}, {"userName": "Patricia", "userReviewDate": "Jul 03, 2015", "userURL": "http://www.goodreads.com/user/show/9327771-patricia", "userReview": "Is the pen mightier than the sword . . . or a medieval torture devise? A serial killer is on the loose in San Diego and investigative print journalist Tyler West is trying to find him. Will his articles and contacts help him solve the mystery before another person is killed? The story is set in my hometown and it was fun to read about places that I know well.No sexNo graphic violence"}, {"userName": "Rebecca Whitley", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/29699040-rebecca-whitley", "userReview": "The scavengers daughter, very intense, good read.Good read. story line was built up and maintained through out the book. This book was hard to put down. Thank you Mrs. P for suggesting this book"}, {"userName": "Isabella Ellis", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/9896254-isabella-ellis", "userReview": "Enjoyed the story and was particularly fascinated with the various medieval instruments. However, the ending felt too abrupt."}, {"userName": "Susan Crowe", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/4036154-susan-crowe", "userReview": "This was my Amazon Prime Lending book for the month. It was actually really good. I'm thinking this is suppose to be the first in a series. I'll be reading more from this series if so."}, {"userName": "Yvonna", "userReviewDate": "Jul 11, 2014", "userURL": "http://www.goodreads.com/user/show/1470567-yvonna", "userReview": "This first-rate crime novel did seem to ramble a bit in different sections, but it did not lose my attention. I hope McIntyre writes more thrillers with this character."}, {"userName": "Robbie", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/20008550-robbie", "userReview": "This was a well-written book. Not for the squeamish, but good."}, {"userName": "Diane", "userReviewDate": "Mar 10, 2013", "userURL": "http://www.goodreads.com/user/show/2074592-diane", "userReview": "A predictable page turner."}, {"userName": "Krissy", "userReviewDate": "May 06, 2012", "userURL": "http://www.goodreads.com/user/show/8227854-krissy", "userReview": "I'm usually not into these lines of books and it takes me weeks to finish one. it took less than a week, I couldn't put it down!!!"}, {"userName": "Nanda Zacharias", "userReviewDate": "Apr 04, 2012", "userURL": "http://www.goodreads.com/user/show/6168355-nanda-zacharias", "userReview": "Really good book. I couldn't stop reading it."}], "description": "\"A superb writer\"--Los Angeles TimesDisgraced journalist Ty West is desperate for a scoop that will save his career. When he investigates a series of shocking murders among San Diego's elite, he uncovers a common link--torture devices last used during the Spanish Inquisition.Plunged into a mysterious world of medieval scholars, antiquities collectors and sadomasochists, Ty scrambles to unmask the monstrous zealot--and soon learns that he is fighting for much more than his job.What readers are saying about The Scavenger's Daughter\"I'm a big fan of Michael Connelly's books, and I think Ty West may be Harry Bosch's biggest competition.\"--Grace Krispy, MotherLode\"One of those books I didn't want to put down...Thrillers don't get much more intense than this.\"--BigAl's Books and Pals\"Mike McIntyre has built a stunning plot, with perfect characters, and enough twists and turns to keep the reader guessing.\"--Chris Truscott", "title": "The Scavenger's Daughter: A Tyler West Mystery", "url": "https://www.goodreads.com/book/show/10182536-the-scavenger-s-daughter", "average": 3.76, "cover": "https://images.gr-assets.com/books/1304555728l/10182536.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/4619640.Mike_McIntyre", "name": "Mike  McIntyre"}], "type": ["Mystery"], "outlinks": ["http://www.goodreads.com/book/show/10182536-the-scavenger-s-daughter", "http://www.goodreads.com/book/show/10635526-the-scavenger-s-daughter", "http://www.goodreads.com/book/show/20350449-the-kindness-of-strangers", "http://www.goodreads.com/book/show/12047540-the-wander-year", "http://www.goodreads.com/book/show/20464689-the-distance-between", "http://www.goodreads.com/book/show/36524369-the-big-blue-ball"]}