{"ratings": 8473, "userreviews": [{"userName": "Becca ", "userReviewDate": "Jul 25, 2009", "userURL": "http://www.goodreads.com/user/show/967127-becca", "userReview": "There was a homeless guy that my dad let stay in our unfinished house when I was a kid-- Greg. He stacked up all the slate tiles neatly... and sliced apart the antique bannister poles. I fell once and he rushed over with a first aid kit and doused my knee with witch hazel and bandaged me up. Then he stole the radio and threatened to kill my dad with a baseball bat. After he got violent, cops came, and Greg didn't come back to the house. As a kid I was fascinated and terrified and curious, and totally thrilled when I spotted Greg, months later, on the metro, wearing my dad's walkman. Greg stayed a mystery-- one in a sea of unknown tragic lives. In this story, Steve Lopez, the intrepid journalist, takes us into the life of Nathaniel Ayers, a Julliard musician, and a homeless schizophrenic. And we readers and sit by safely, applaud Ayers for his progress and Lopez for his charity where we don't dare to go. Lopez is a straightforward writer-- his reporterly style reminds me of Heat: Driven middle-aged reporter follows impossible subject matter to dangerous personal limits, and comes out of the experience transformed! The Soloist is not really the story of a homeless musician's recovery-- it's Lopez own journey. He realizes that Mr. Ayers (as he comes to call him) doesn't want, or possibly need, the kind of quick fix that would make a good \"happily ever after\" column. Lopez is obsessed with Mr. Ayers progress and his backsliding, and feels personally accountable for his public and quantifiable success. In order for his column to be more than shock value and exploitation, he feels that something positive has to come of their relationship. In the end, he decides that the positive transformation has been more in his own outlook than in Mr. Ayers life. p196: \"Nathaniel turns my gaze inward. He has me examining what I do for a living and how I relate to the world as a journalist and as a citizen. Despite the many frustrations he presents, I'll never have a richer reward than knowing him well enough to tell his story.\"I loved Lopez's description of the night he spent on Skid Row with Mr. Ayers. He walks by the addicts and dealers and broken veterans and prostitutes it's an still and uneasy dream. 62: \"I'd make an easy mark for a quick mugging. But there's nothing behind me except my shadow. Still, my flesh rises as the man slides by like a shark.\" Bravo, Mr. Lopez!He never becomes a social worker, he's not an expert on mental health, he doesn't have any big answers to these enormous social problems that Nathaniel symbolizes-- but I don't think this book is trying for anything that big. It's just the story of this strange and unbalanced friendship. It's compelling because it feels familiar. I could imagine myself in a situation like this-- wanting to help, not wanting to get hurt, wanting to understand but not be sucked into the undertow."}, {"userName": "Daniel", "userReviewDate": "Dec 08, 2009", "userURL": "http://www.goodreads.com/user/show/4695-daniel", "userReview": "\"The Soloist\"'s story is so well-known at this point -- grizzled newspaper columnist befriends once-promising classical musician whose schizophrenia has left him long homeless -- that there's little need for me to recount it here. Steve Lopez's writing is less that of a top-tier author and more that of a solid reporter (today's poetry is tomorrow's birdcage liner), but the true story is well-served by Lopez's relatively unadorned and straightforward prose.While Nathaniel Anthony Ayers's story was well-told in Lopez's original columns -- stories I read when they first ran in the Los Angeles Times years back -- \"The Soloist\" offers a more cohesive version of the musician's travails. There's some filler to bring the story to book length, but not much.To call Ayers's story heartbreaking would be a severe understatement. While any story about a man living on the streets because of mental illness would be wrenching, when the man is not only as talented as Ayers is -- he plays string bass, cello, violin and piano proficiently, and experiments with other instruments -- but is also intelligent, educated, caring and well-spoken, it becomes an even harder story to get through. I know it shouldn't be that way -- we should feel the same compassion for anyone in a horrible situation not of his own making, no matter what his or her talents are -- but it's nevertheless true.And Lopez is refreshingly honest about such inherent problems in telling Ayers's story: Ayers shouldn't get treatment different from Los Angeles's other homeless people, but he does because of his talents and because Lopez is writing about him; Lopez is using Ayers to fill his column quota and advance his career, but also genuinely cares about the man; Lopez wants to get Ayers off the streets and living a more normal life, but Lopez realizes that such efforts are partly to satisfy his own ego; Lopez wants to be a good friend to Ayers and have him in his life, but he's sacrificing time with his own family, who should be his first responsibility, to devote so much time to Ayers.I resisted reading \"The Soloist\" for a while because, having read Lopez's original columns, I felt I knew the story. It turns out, though, that the book is compelling reading even for religious Los Angeles Times followers -- and easily recommended to anyone who doesn't read Lopez's column. Ayers's story is a tough one to tell, and Lopez does a good job telling it without romanticizing it or making it overly maudlin."}, {"userName": "Kim", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/1519524-kim", "userReview": "Geez, where to start? Whenever I've passed by a homeless person, I've always thought \"how did you end up here?\" This was a beautifully sad story of one such person. So talented but mentally ill. A vicious cycle of they should be on meds but the meds don't make them feel right so they don't take them, etc. I am holding out hope for Nathaniel."}, {"userName": "Josh", "userReviewDate": "Nov 21, 2008", "userURL": "http://www.goodreads.com/user/show/1719940-josh", "userReview": "This book is not a novel, though that is unclear from the cover of my edition. It is a true story based on investigative journalism, which eventually tells more about the author than the subject. So I tried not to judge it by the standards of a novel.The trouble is that Lopez is a journalist, and has been for decades. So he writes like one. The tropes of newsmen get old fast, which is Ok in newspapers b/c you're probably only reading one article anyway. But it gets pretty tiresome in a long book when Lopez insists on giving the setting in present tense at nearly every new section of every chapter: \"I'm on foot in downtown L.A., hustling back to the office . . . \", \"We meet at Canter's Deli . . . \", \"The Village is a three-story redbrick building\". Or he'll end a chapter or section related to one line of thinking and then start the next with something he mentioned a while back, and then cleverly remind you what he's talking about and how it ties into the main story about Nathaniel. But he does it repeatedly, like a three-trick pony: \"Whose names are those?\" \"My classmates at Juilliard\". END CHAPTER. NEXT CHAPTER \"I half run back to the L.A. Times Building, a downtown landmark . . . \" and he goes on to talk about the building and his job there. You can just see that he wants this to be a movie, and the director will cut the scene at the chapter break, and move quickly from Nathaniel's character thread to a shot of Lopez hurrying toward his office. This is all very entertaining (if not indicative of good writing) in an actual movie, but not in a book, done repeatedly.The first third of this book is basically Lopez saying over and over, \"isn't it weird, this guy is homeless and crazy but he went to Juilliard\"! Well, no, it's not that weird. You never know who you're going to find where. And musical people are often a bit nuts. And we've seen tons of examples in recent TV, of characters who are overeducated bums. This is an old concept; cool to find it in real life, but an old concept. So the author spent way too much time talking about it.Another old concept that the author spends too much time thinking about is what it means to be crazy, and whether it makes you less human and so to be treated differently. Old, old, old. It is scary, though, when you get a chance to see how a schizophrenic thinks, and see how similar it is to yourself. But not new or interesting.The second third of the book is about Lopez. This was good, actually, and turned a two-star book into three-star. I felt like he was hiding the fact that the story was really about him, and I was getting pissed about it. But then I came around and saw he was being pretty explicit. This book is about how a busy, job-endangered reporter takes the time to get to know a crazy bum named Nathaniel, and writes widely-read stories about helping him and all the crazy homeless. Now a major motion picture!That's a story I understand. Of course, it diminishes the more interesting story about Nathaniel's world, which would have made a good long article or short story in Harper's.But it enhances our understanding of what we think is a correct and reasonable way to live. And we compare our views with Lopez's and Nathaniel's. And we see how Lopez seems to realize by the end that he was pushing his view on someone who might or might not accept it. Lopez does play it hands-off, so that was really good. But he still has an agenda and pushes toward it: Nathaniel should spend the night inside, should be safer, should not cling to a shopping cart, should train his musical gifts, and should make more sense. Without acknowledging that a person might want to sleep outside, take risks, just have fun practicing his gifts, and not rely on reason or connect to reality. Again, old, old, old ideas. But at least he forces them by making himself the main character.And of course we have to think about whether he's exploiting Nathaniel (of course he is partly, of course that's not always a bad thing). We hear about his company's troubles as a way of reminding us that Lopez is still protecting his job and looking for a story, and Nathaniel is the best story he'll ever find. And the thousands of other bums he walked by before he met Nathaniel were not, and that's Ok.Oh, and did you know that crazy people are people too? Lopez seems far too surprised by this, despite being a reporter in a culture saturated with references to mental illness. Of course you can actually be friends with a schizophrenic! But Nathaniel as a character was pretty good, and made for great interactions among people, as you try to decode him. But since this wasn't fiction, I was constantly reminded that there was a reason for his being in the book, and drawn away from enjoying his personality.This book blew its potential to be funny, and that made me mad once I noticed it. My first smile was p. 110, and few after that.Wasn't it heroic how the main character got the mayor to come and support fixing Skid Row? He's so hot. Too bad he never mentions that most of the people there are not schizophrenic, and we're left with the idea that maybe all \"those\" people, who we know nothing about, are supremely helplessness through no choice of their own. Which is true of many people down and out. But many, many of them made some choices leading them down a bad road, and almost none of them would be as resistant to outside help as Nathaniel. But b/c we have his story told and no one else's, we have only the one perspective on the general issue of homelessness. Hopefully the story will encourage people to think, though, when this issue comes up, \"maybe the people I'm talking about have backgrounds like Nathaniel's\", instead of just dismissing the hard up. That would be positive.There is a lot people could do to help, and this book will get that into people's minds. Probably won't make a difference to the problem, but I respect the book anyway for doing what it does. I don't enjoy it, but I respect it, especially when the agenda isn't crammed down your throat. Still, I didn't learn a thing from this book about the issues, b/c the information is already out there many places, more condensed as essays.A specific trouble I had was that Alison worries that her bipolar brother will end up like Nathaniel, and Lopez never corrects her. He really should say something about the differences b/w mental illnesses and the rarity of overlap b/w bipolar and schizophrenia. And the treatability of both.A last note, this one positive. I mentioned before how Lopez decides on the hands-off approach to helping people who don't want help, and might not understand how much it will help them. I liked that he went for this, and seemed to have his book say that it is hard and perhaps not always right, but usually right, and right in Nathaniel's case. It's just one more plug for allowing for the natural development of people's personality and freedom."}, {"userName": "Liz Dunham", "userReviewDate": "Jan 23, 2009", "userURL": "http://www.goodreads.com/user/show/1325083-liz-dunham", "userReview": "I was originally skeptical of this book presenting too polished a case of \"saving\" a homeless man. Similar to \"Have You Found Her,\" Mr. Lopez undergoes a personal development in essentially entering the social work field. He is naive, shocked, etc. Then he is intrigued, obsessed, dedicated. But he, too, crosses into a phase of boundary issues. He makes himself and his resources available to Nathaniel without a sense of boundaries or limits. He also begins his dedication before understanding the illness that has perpetuated Nathaniel's homelessness. To his credit, Mr. Lopez does a phenomenal amount of research, field work, and background work (perks of having a journalist take this awkward role) and he learns quite a bit about the illness, the politics, the resources, and even about boundaries. This book does a good job of introducing this experience and familiarizing the public with a mental illness and social condition that are all-too missunderstood by the general public. It really delves into the complexities of offering help to Nathaniel while maintaining his dignity, working with the rhythms of his illness, and the social services capacities. However, again, like in Have You Found Her, as a non-professional he struggles with boundaries. Interestingly, both Steve Lopez and Janice in the other book reach a point (to their own horror) where they are so exhausted and frustrated that they just wish someone would take the \"problem\" off their hands. Although both have caring relationships, they realize that a sense of relief would come from their no longer being able to help. (with Janice, when Samantha is in rehab, Janice rejoices to have time again, she is not allowed to go see Samantha, and yet she feels that someone is taking care of it). I think it is a sensation that family members may experience when dealing with the severely and persistently mentally ill, particularly with substance abuse and homelessness mixed in. Families are not allotted the boundaries that protect professionals from being too invested or attached because families are expected to be the resource that is always there. And yet, families of people like Samantha and Nathaniel endured years and years of turmoil before their loved ones ran off, essentially releasing them from responsibility (by not being able to find them). To see how Steve and Janice felt the intensity of these feelings with people they had only known a year, and had no true ties to provides a sliver of insight into how painful it can be for families. All of this being said, I recommend the book for anyone familiar or not with homelessness or mental illness. As a professional it was interesting and I think it must be interesting to any citizen who has walked by a homeless person on the street and wondered about what was going on there."}, {"userName": "L.A.Weekly", "userReviewDate": "May 09, 2008", "userURL": "http://www.goodreads.com/user/show/873780-l-a-weekly", "userReview": "Review by Alan RichBack in September 1964, Jascha Heifetz, the formidable fiddler, was attempting an ill-advised comeback recital at Carnegie Hall. The crowd out front was enormous, and it naturally included many people with long faces hoping for a turned-back ticket to this sold-out event. I was covering it as a music critic for the New York Herald Tribune of lamented memory. At that time, there was a violinist, 20 or so, nice Jewish boy, reasonably talented, who played in a regular spot in front of Carnegie on most concert nights, with his violin case open to receive coins. I had the idea that this guy would make a pretty good story for my paper, and what better time than after I had taken him to this night of nights? I proffered him my extra ticket; he looked at me the way Little Orphan Annie must have first looked at Daddy Warbucks.Come concert time, the seat next to me was fully occupied, not by my grateful minstrel but by a corpulent heavy-breather who had bought my extra ticket, at a fairly inflated price, from the street fiddler. When I came out at intermission, that guy was still sawing away at his sidewalk station. I’ve never trusted one of those street players since.Until, that is, Mr. Nathaniel Ayers began to restore my faith, with help from Steve Lopez. The slice-of-life columnist for the Los Angeles Times comes into the picture where I might have, if that klutz in New York hadn’t sold my ticket. Lopez’s splendid new book, fashioned from his columns, is called The Soloist: A Lost Dream, an Unlikely Friendship, and the Redemptive Power of Music. Lopez discovers Ayers first, a lone fiddler playing astonishingly well, on a downtown street corner. They meet, some bullshit is exchanged for better or worse, they part, they meet again. “...[Nathaniel] plays for a while, we talk for a while, an experience that’s like dropping in on a dream,” writes Lopez. Read the rest of the review at:http://www.laweekly.com/art+books/boo..."}, {"userName": "Adriana Scarpin", "userReviewDate": "Aug 01, 2014", "userURL": "http://www.goodreads.com/user/show/3233112-adriana-scarpin", "userReview": "O lance é que li esse livro para um trabalho de estudo de caso para a faculdade, Steve Lopez não se aprofunda nas questões clínicas da esquizofrenia, mas dá uma lição de como se deve tratar um esquizofrênico, com muita paciência sobretudo, embora medicação seja também importante. Tentei pesquisar se finalmente ele aderiu à medicação nesses últimos cinco anos, mas não achei nenhuma informação conclusiva sobre o assunto, a não ser que até 2011 ele ainda não a tomava."}, {"userName": "Nicole R", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/10762842-nicole-r", "userReview": "I just finished this book and am having a hard time coming up with words to describe how I feel about it. Steve Lopez is a columnist for the LA Times who stumbles across a homeless man in a tunnel who is playing a two stringed violin. Mr. Lopez begins talking to the man, who obviously has a mental illness, and learns that he previously attended Juliard on a scholarship for the bass. Mr. Lopez leaves the meeting thinking that if this mans story checks out it would be an interesting column....and ends up embarking on a journey to help Nathaniel Anthony Ayers - ex-Juliard student, lover of music, and victim of schizophrenia, get off the streets and on the path to \"recovery\". Along the way, Mr. Lopez gains as much, if not more, from the friendship than Mr. AyersThis book documents the first two years of the friendship between Mr. Lopez and Mr. Ayers; the struggle Mr. Lopez has to grasp the extent of Mr. Ayers disease, the constant ups-and-downs of Mr. Ayers mental health, and the love and exceptional talent Mr. Ayers demonstrates for music which is the bright beacon that cuts through the fog of schizophrenia. There is no doubt that Mr. Lopez has helped Mr. Ayers in many ways simply by providing support and friendship but Mr. Ayers relates life lessons that brought a tear to my eye. This book was phenomenal and I highly recommend it to anyone looking for something to read this month. I also recommend checking out the origninal columns which can be found online. I am now looking forward to the movie but know that it will pale in comparison to the book. I often become immersed in my reading but it has been a long time since I have been so moved by a story of compassion, friendship, and humanity."}, {"userName": "Christina", "userReviewDate": "Mar 10, 2011", "userURL": "http://www.goodreads.com/user/show/1863703-christina", "userReview": "Steve Lopez does a wonderful job in capturing and sharing the story of Nathaniel Anthony Ayers; homeless man, who, in his prime, was a musical protege in Julliard. Steve Lopez puts a face to the disease paranoid schizophrenia and mental illness as a whole. Lopez reaches into a downtrodden and forgotten community of people to help a man who was left to fend for himself out in the streets without support, family, and treatment for close to 30 years. Lopez writes this biography in a journalistic nature, drawing in readers with his wittiness, clever word choices, and infusing his own personality, fears, and joys into this great work. A column writer by day, Lopez meets Ayers while out and about. Thinking that this man might be his next big ticket story, Lopez seeks Ayers out to hear how a man of his musical caliber is out there living on the streets. Lopez in turns finds out more about himself than about Ayers, and the mental illness that has wrapped up Ayers for over 30 years. Lopez tries to help Ayers in recovery, but soon finds out that recovery is not linear, and it could mean 1 step forward, and simultaneously take 2 steps backwards. The road to recovery is slow, cannot be forced, and a great deal of patience is required to help Nathaniel start the process of improving. Nathaniel Ayers is a Cleveland, Ohio native, who has transplanted himself to Las Angeles. He started his career as a musical genius while in high school, and became a protege` that followed in the footsteps of men who helped him path the way into Julliard. While at Julliard, Ayers fell prey to the insurmountable pressure of being great, and had a mental breakdown. This mental breakdown started his fall from grace, and landed him on the streets as a homeless man with paranoid schizophrenia. While on the streets of LA, he comes in contact with columnist, Steve Lopez, and thus a friendship begins. Throughout this book, I was fully engaged and educated about this mental illness. Even though this book was not about paranoid schizophrenia, Lopez did a wonderful job in painting the picture of a person who goes through life, on a daily basis, battling this sickness. I went through similar emotions as Lopez, hoping that Nathaniel would get better with time, frustrated with his bad days, and happy on his moments of breakthroughs. I definitely learned a lot about this disease, and also about Nathaniel and how a person could get to where he is. I would recommend this book to everyone, especially those who like books that are turned into movies. The book makes me want to see this film again, and the film does an excellent job in telling this story. I would rate this book a 5; it's definitely in my top 15."}, {"userName": "Jeff Grogan", "userReviewDate": "Apr 30, 2013", "userURL": "http://www.goodreads.com/user/show/12184624-jeff-grogan", "userReview": "This is one of my favorite music-centered books I've read in my life. Lopez perfectly blends the dizzying world of schizophrenia with the counter-dizzying world of music in a story that will charm musicians and laymen everywhere. Being a real person, Nathaniel was not just dialogue and description on the page, but he walked and spoke and pushed his cart through the room as I read. Lopez's wording was straightforward, journalistic, and simultaneously deeply personal. Although I have never seen and certainly never experienced Nathaniel, I feel as if he is a brother, a sick, tormented brother that I have sworn to protect. This is the first straight nonfiction book I've read that tells a personal story, and I was pleasantly surprised by its elegant delivery.I believe anyone, whether in orchestra or the marching band, who can understand the redemptive power of music would greatly benefit from reading Nathaniel's story. And for those who have no clue about music, as the narrator started out, it teaches the power and an appreciation beyond the simple enjoyment of a tune. I also believe the awareness it brings to those who suffer from mental illness and/or homelessness is an act that should not be understated. Before reading the Soloist, I believed a majority if not the entirety of the mentally ill were easily curable by simple medication. Clearly this is not the case, and I am more open minded now because of this terrific story."}, {"userName": "Fili", "userReviewDate": "Dec 30, 2008", "userURL": "http://www.goodreads.com/user/show/1840876-fili", "userReview": "I was attracted to this book when I realized it was about a subject close to my heart (schizophrenia), music and that it was the true story of Nathaniel Anthony Ayers. To top it off, the book is also a major motion picture starring Jamie Foxx and Robert Downey, Jr. to be released in April. I had to read it.I finished the book today having started it just two days ago. I could've read it quicker had I no distractions. The author, L.A. Times Columnist Steve Lopez, is not the next great American novelist, but his prose is clear, concise and honest. While there were parts of the story that I felt were misplaced, twice near the end, I fought back tears while reading.Not only is this a good story, but for anyone who has a loved one with schizophrenia in their life, it may be eye-opening and help understand the condition, what to expect, which approaches work and which do not, and perhaps get some help. Immediately after finishing the novel, I Googled Nathaniel Ayers and got a peek at the man himself in a video clip posted on the L.A. Times website. I can hardly wait to see the film."}, {"userName": "Brenda Bissett-steinhofer", "userReviewDate": "Jul 24, 2009", "userURL": "http://www.goodreads.com/user/show/2552510-brenda-bissett-steinhofer", "userReview": "Thank you Steve Lopez for reserving us a front row seat at this symphony in the big city in \"The Soloist.\" The story was both eye-opening and heartbreaking, a score of stunning human crescendo and stark morendo, blowing the doors wide open on the stigmas and misconceptions associated with mental illness and homelessness. We are glad that Nathaniel Ayers has emerged from the shadows and that his story has been told. Anyone who has ever passed a person sleeping in a doorway or with their belongings heaped in a shopping cart,or observed a family huddled in a makeshift dwelling under a bridge,or visited a shelter where strangers simply exist side by side,unable to rest, keeping close watch around them,will emerge with a much different view of mental illness and homelessness. The saving grace in this book is not that Nathaniel Ayers was \"cured,\" but that he found a community of musicians, friends, and fans who understand him, respect him, care for him and love him regardless of the ongoing challenges."}, {"userName": "TL ", "userReviewDate": "Aug 17, 2014", "userURL": "http://www.goodreads.com/user/show/4342402-tl", "userReview": "Story and writing: four starsNarrator for audiobook; four starsShort review since I gotta work:I'm not sure when I first heard about this but the movie trailer inspired me to go pick up the book... I was intrigued by Nathaniel's story and what happened to him.Second time around: Still captivated :) Mr. Lopez does a wonderful job and justice to his friend's story. Nathaniel steals your heart and you root for him to get better. His achievements, history, and low moments make you smile/cringe but you can tell he's doing the best he can. He's an interesting individual...my heart broke for him, hearing how he was getting sick and how rough he had it before coming to LA.The one fight he had with Steve still saddened me and made me mentally take a few steps back at one part.. Nathaniel is one person I would have loved to meet, specially to hear him play music:)Would recommend <3"}, {"userName": "Mitch Albom", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/10580759-mitch-albom", "userReview": "I work with the homeless in Detroit, so Steve Lopez's account of a stunningly gifted violinist living in the street didn't shock me. But it brought to light how much talent is out there unnourished, needing only a chance to grow. The fact that Lopez and Nathaniel Ayers had their differences kept it real, and you wonder how many others like Ayers are homeless right now."}, {"userName": "Sydney", "userReviewDate": "Mar 14, 2009", "userURL": "http://www.goodreads.com/user/show/1981674-sydney", "userReview": "This is soooooo good. Its so heartwarming, I guess you can say. Haha. Its a book for everyoneeee"}, {"userName": "Patricia", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/2393496-patricia", "userReview": "I suffer from mental illness and l like to read about how others fare, even if it’s difficult. I’ve read a few books about mentally ill street dwellers and this is one that shows how an astonishingly talented person with profound difficulties can progress in a positive way. I do believe the author may have been really blessed by his often frustrating relationship with his friend."}, {"userName": "Mazola1", "userReviewDate": "May 12, 2009", "userURL": "http://www.goodreads.com/user/show/825885-mazola1", "userReview": "The Soloist reads like a book written by a columnist, which is to say it's clear, it's compelling and it's easy to read. The subject matter is not so easy. Many reviewers have said that this book puts a face on mental illness and the homeless and that's true. The mentally ill central character of the book is not just an illness, he's a real person, with a family, a history, hopes, dreams and problems. That being said, the book also shows how difficult it is to treat mental illness, and how much time and resources are needed to achieve even small gains. While the book might also be read as an indictment of the less than stellar job our society has done in treating the mentally ill, it's also true that the book suggests that this problem may not have any good solutions. In this sense, the book The Soloist is just as schizophrenic as the character, the Skid Row soloist Row Nathaniel Ayers. Parts of the book are uplifting, but parts are just downright depressing. While Ayers' life does improve (in the teeth of his own stubborn opposition, and with the dedicated help of dozens of people) it's clear that he, and thousands like him, are damaged goods, and that it is beyond our current ability to really \"save\" them. I suppose this touches on the debate about the civil rights of the mentally ill. There was a time when mentally ill persons were forcibly hospitalized, forcibly medicated with drugs that dulled them and even forcibly subjected to brain mutilating surgeries and electroshock treatments. Today's medications and treatments, including the new and improved electroshock, are supposed to be better, so is it now ethical to force these on the mentally ill?All of which could be summed up by asking if there is a \"right\" to live on the street and refuse treatment? At times, Ayers demanded that right in no uncertain terms, but he was mentally ill, right? Should he have been forced to get into treatment and take medications? Lopez figured out that this path doesn't really work, that the person has to make that choice for themself. As The Soloist shows, getting that to happen takes an immense investment of time, patience and resources, and there is no guarantee of success. So the grim reality is that most of the mentally ill will probably remain on the streets, largely ignored by the swirling society around them. Few will be lucky enough to receive the attention and extraordinary care that Ayers received. The truth is that most of us think that the mentally ill are just different than we are, and we can't be bothered to try to help them. For some, The Soloist will no doubt be taken as proof that bothering to help can be uplifting. For others, it will be a reminder of just how daunting that task can be."}, {"userName": "K", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/13779-k", "userReview": "This story could be straight out of fiction -- a seasoned journalist discovers a talented, homeless, mentally ill musician, befriends him, struggles to improve his quality of life, and finds him outlets for his talent. It's no Disney movie, though, and I give Lopez credit for acknowledging the three-dimensional aspects of this story. If the schizophrenic musician resists others' attempts to offer him housing, to what extent should his wishes be respected? Is it possible to eliminate the ego appeal of investing in such a friendship, especially when writing about it as a journalist? And if not, is it really exploitation? For telling an interesting story and being so honest about the issues, Lopez deserves four stars. I wish I could give him five, really; unfortunately there was something about the writing that failed to engage me. Still, the book was provocative and inspiring overall."}, {"userName": "Trixie St. Claire", "userReviewDate": "Nov 03, 2008", "userURL": "http://www.goodreads.com/user/show/1355168-trixie-st-claire", "userReview": "I read this on flights between Raleigh, NC - Atlanta, GA and Tampa, FL. It was a very quick read, but moving and honest. Usually stories like this get sugar-coated and the \"helper\" becomes the hero. I am glad this book didn't turn into a fairy tale ending where everything is wrapped up neat in a bow. I was glad the book focused that mental illness recovery is not linear- that you can go two steps forward and ten steps back. I hope the upcoming movie of this book doesn't ruin the lovely story."}, {"userName": "Maricarmen Estrada M", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/13421080-maricarmen-estrada-m", "userReview": "3.5 Stars - There are some great things about this book that kept me interested and connected to the story, which is actually great. Mental illnesses became something I took a lot of interest in quite a few years ago. \"The Soloist\" deals with schizophrenia through the eyes of Steve Lopez, a journalist who meets Nathaniel, a musician that lives in the streets of the underworld of Los Angeles who ended up there after having been a Juilliard student because of his mental illness. The story of their friendship is remarkable and if you have not had the opportunity to experience what is like to deal with someone close with a mental illness, this book will open that door for you. This story did happen and it does feel real all along. The language used for this book was very simple and direct. I read it in Spanish, which took a lot for me from the original, I could just tell... if I can avoid it, I'd rather not read translations. Unfortunately, in this occasion I just had the Spanish version and I decided to give it a go, but it didn't really do for me. That's why I didn't give the book a higher rating."}, {"userName": "Hope", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/902527-hope", "userReview": "I had seen the movie without reading the book. The movie was very good; the book was excellent! I appreciated the author's writing style, honesty, and vulnerability as he told this true story. I had two key take-aways from reading this book: I have a new appreciation for and interest in classical music, and relationships change our brain chemistry. Steve Lopez's relationship with Nathaniel Ayer was complex and not easy, but it was a special and rich relationship for both of them. It actually changed the chemistry in Nathaniel's brain that led to him living life in a healthier way. Everyone needs a friend; we need one another."}, {"userName": "Robert", "userReviewDate": "Oct 29, 2008", "userURL": "http://www.goodreads.com/user/show/1627591-robert", "userReview": "The Soloist is a successful variation a formulaic relationship between a not-normally-activist columnist and a schizophrenic street musician who once was a student at Juilliard. It's written with skill and honesty, a great part of its success. Whereas the title highlights the \"the redemptive power of music,\" the text itself makes clear that no one is fully redeemed and the degree to which anyone achieves progress--emotionally, in life skills and survival--depends on human kindness, patience, tenacity, and a refusal to accept the painful contradiction in our society that it is all right for some people to \"make it\" and others not.Nathaniel, the street musician, naturally is the key figure in the text but only slightly more so than the narrator, Steve Lopez, who at fifty-something is wondering how much he has left in his tank for writing newspaper columns that ding incompetent government agencies and general American complacency with the status quo. Lopez knows he is no angel, and he knows the same about Nathaniel, which is what makes this book real. In part because the story occurs in L.A., it reminds me a bit of the movie \"Heat\" in which Al Pacino, a cop, becomes over-involved with his police work (chasing Robert DeNiro) at the expense of his marriage. Lopez has that kind of problem, needing understanding from a wife and young child who don't have that much to give him. The time he spends on Nathaniel clearly takes away from the time he spends at home, and yet he can't let go of Nathaniel, whose descent into mental illness is deep but not beyond connection.Several musicians and mental health care professionals help Lopez help Nathaniel move in off the street and recover some of his life-sustaining musical gifts. Lopez is generous, and accurate, in ensuring that the reader knows that no single individual, or even institution, is enough to get through to a man like Nathaniel after thirty years on the sidewalks, in subway tunnels, and in parks. More realism, in other words.What one wonders, on finishing a book like this, is how such volumes can be published without provoking a nationwide reassessment of our social safety-net. There aren't enough fellows like Steve Lopez around, desperately needing someone to save who just as desperately need saving."}, {"userName": "Lindsey", "userReviewDate": "Jul 20, 2009", "userURL": "http://www.goodreads.com/user/show/602296-lindsey", "userReview": "Lindsey #17 The Soloist - Steve LopezThe back says\tWhen Steve Lopez sees Nathaniel Ayers playing his heart out on a two-string violin on Los Angeles' Skid Row, he envisions this \"Violin Man\" as the topic of his next column for the Los Angeles Times--only to unearth an even more extraordinary story about the mysterious street musician. More than thirty ears earlier, Ayers had been a promising classical bass student at Julliard--ambitious, charming and also one of the few African-Americans at the school--until he gradually lost his ability to function, overcome by a mental breakdown. When Lopez finds him, Ayers is alone, suspicious of everyone and deeply troubled, but glimmers of that brilliance are still there. From an impromptu concert of Beethoven's Eighth in the Second Street tunnel to a performance of Bach's Unaccompanied Cello Suites on Skid Row, the two men learn to communicate through Ayers's music. Their bond takes tortuous turns as Lopez imagines he can change Ayers's life--finding him lodging, reconnecting him with his family, taking him to Disney Concert Hall to meet a former Julliard classmate. For each triumph, there is a crushing disappointment, yet neither man gives up. And though it's Ayers he initially sets out to save, Lopez finds that his own life is profoundly changed. I was expecting this to drag on since it is one of those \"heart-warming\" stories, however I really love it. Steve's relationship with Nathaniel is an excellent portrayal of what everyone has experienced in the toxic friendship. Nathaniel is the kind of person everyone wants to root for and help but as Steve finds out it is difficult to deal with the bad times especially when they are so much more frequent than the good. Nathaniel has his ups and downs but sadly, the small progressions he makes make the reader sad without really knowing why. The repetition of the actions become a bit daunting but I really enjoyed the moral of the story. I think it coincided well with my counseling classes. I felt like it was a good preview of some of the things I might be working with."}, {"userName": "Annalisa", "userReviewDate": "Sep 19, 2009", "userURL": "http://www.goodreads.com/user/show/542037-annalisa", "userReview": "In Lopez' memoir, he interviews a violinist on skid row thinking he might make an interesting story for his newspaper column. It turns out, that the man is a musical prodigy who dropped out of Julliard because of schizophrenia. Lopez attempts the help Nathaniel, but must fight against his mental disorder. The distrust of other people, the warped sense of what is safe and who is out to get him, the switch from anger to happiness, Lopez shows how difficult schizophrenia can be to deal with. What Nathaniel needs most is medication, but he does not think anything is wrong with him and how do you convince someone they are mentally ill or force them to receive treatment? Every step anyone took to help Nathaniel only encouraged his believe that people were plotting against him. Dealing with him is exhausting, but if you don't invest the time and money and patience than you further his mistrust of people. What could Lopez do? Leave him on the streets to get mugged? It is so sad how normal someone with schizophrenia can seem sometimes and how heart breaking to help them forward only to watch them slide backward. Lopez's story of Nathaniel is an interesting look in dealing with someone who has schizophrenia and how hopeless at times and tiring the process can be to help them."}, {"userName": "Margaret Chan", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/6022997-margaret-chan", "userReview": "I watched the movie before I hunted the book down. Never before, both the movie and the book gave me the exact sentiments over the story of Nathaniel Ayers which was told by Steve Lopez mixing with his own reflections over his personal experience and journey with Nathaniel. These themes still stay with me after I finished this book:1) 'Mental health expert will say the simple act of being someone's friend can change his brain chemistry, improve his functionality in the world.' (from the movie) 'What to do, then? Let him find his way. Be patient. Be his friend. \"Relationship is primary,\" Ragins says, \"It is possible to cause seemingly biochemical changes through human emotional involvement. You literally have changed his chemistry by being his friend.\"' (from the book). And from Steve Lopez's reflection, the brain chemistry effect is not one-directional but both-directional.2) 'I learned the dignity of being loyal to something you believe in, of holding onto it, above all else; of believing, without question, that it will carry you home.' (from the movie).It is a must-read story for anyway who wants not to lose heart and use heart in the work in Social Service field."}, {"userName": "Joanne", "userReviewDate": "Jul 06, 2009", "userURL": "http://www.goodreads.com/user/show/655304-joanne", "userReview": "In case you haven't seen the movie trailer: Lopez is a journalist for the LA Times whose soul is touched by the violin music of a man who's homeless. Then he discovers that the man, Nathaniel, attended Julliard, and his interest is piqued. Apparently he ran a series of columns in the Times about Nathaniel, and this book is an expansion of them, as well as the story about his telling Nathaniel's story. Nathaniel's story is a fascinating one, and it takes us through genius. mental illness, race relations, and the modern social work and health care system. Lopez does a great job of portraying Nathaniel's ups and downs and his own desire to help. Throughout he grapples with the question of what IS the best way to help Nathaniel? I sympathized with Lopez's desire for an easy fix and admired his dedication when he realized the quick fix wouldn't work. Like A Beautiful Mind, this book broke my heart. I'm sympathetic towards those with mental illness and admire those who interact with the mentally ill on a regular basis. I haven't done it very well at all.Haven't seen the movie."}, {"userName": "Carla Patterson", "userReviewDate": "Mar 31, 2016", "userURL": "http://www.goodreads.com/user/show/14241704-carla-patterson", "userReview": "Having heard about this story ahead of time, I knew the general outlines but I enjoyed hearing the whole book quite a bit. Anecdotally, it was an interesting story but I couldn't help wondering how each of the protagonists viewed the situation. I feel a lot better about it after having heard the whole story from Lopez' point of view. It would be great to be able to hear it from his subject's point of view also but that's not available at this time. Lots of good stuff in this book - wouldn't want to get more detailed than that because there would be too many spoilers.One side note: Since I have a close relative who was diagnosed schizophrenic (now they prefer to call it bipolar with a schizoid affect - whatever!), it was especially interesting for me to see how Lopez slowly got more familiar with someone diagnosed similarly. His reactions and descriptions were of interest to me. Although it's not definitive, his writing on the subject is a good addition to the anecdotal writing about what it has been like to live in California with such a diagnosis and also some of the ways it affects family members and close friends."}, {"userName": "Charles", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/8297294-charles", "userReview": "This is a very good story about music, mental illness, family, and friendship. How a mentally ill man finds a refuge in music was compelling enough for me, but I also appreciated the sensitivity of the author--a newspaper columnist who is mindful of how writing about that man's experience turns his personal story into this man's column. Lopez does a good job of balancing the narrative by focusing on one man's journey while exploring some of the bigger questions of a homeless epidemic, with one recurring question that never gets answered: what does progress look like? Because even in the midst of telling a success story, that person's success emphasizes the fact that this is one of many thousand. Despite my praise of the author, I'm tempted to deduct a star because of the repeated trope of \"I learned far more from him than he did from me.\" No kidding. No one is reading this book to learn about what a great thing you did for somebody. You found a great story and you told it, because you wanted us to share in what you learned from Nathaniel's journey, and for the most part you did it very well."}, {"userName": "Siobhan", "userReviewDate": "Mar 30, 2009", "userURL": "http://www.goodreads.com/user/show/1004158-siobhan", "userReview": "This is an interesting book, written in an easy-to-read, journalistic style. Which is to say it's not great literature, but it's good to read. This book confirms my belief that everyone has a story to tell, and Steve Lopez found a particularly compelling one in the person of Nathaniel Anthony Ayers. It also shows how small actions can be life changing. A columnist stumbles across a story idea -- a homeless, mentally ill man who plays the violin -- and the column puts the man on the path to \"homefulness,\" so to speak. The larger story, of course, is that mental illness is extremely difficult to treat, and that the US has done a terrible job of it. That's a story that's not changing much and until public policy takes into account that treating mental illness is a slow, time-consuming process, it won't change. Lopez's descriptions of Skid Row in Los Angeles are well drawn and disturbing. Thinking of the thousands of people who live on the streets in this country is sadder than sad. I read once that many people who are homeless are mentally ill, and if they aren't when they start out on their homeless journey, they will be pretty quickly."}, {"userName": "Chris  Ibert", "userReviewDate": "Mar 01, 2010", "userURL": "http://www.goodreads.com/user/show/1317771-chris-ibert", "userReview": "Book Club book pick - enjoyed it tmuch more than I thought I would. I did not vote for this book and I was initially turned off to it simply because of the movie (which I hadn't seen but thought looked too slick and \"feel-goody\" to me). I ended up being fascinated by Nathaniel Ayers' tragic life events and also inspired by the kindness and investment the people in this true story were willing to extend to this man. It's non-fiction and written by a journalist and reads as such, but this is not necessarily a bad thing. I watched bits of the movie after reading this and would say (naturally) that the book is so much better. The movie simplified everything way too much and I was annoyed by it. I would recommend this book and especially to people looking to have a better understanding of homelessness and mental illness and how the two are so intertwined in ways that we may not be able to otherwise imagine. This is one man's story and a very unique man at that, but the story of how his mental illness developed adn how he came to live on the streets of LA are clearly all too common. The descriptions of LA's Skid Row were shockingly eye-opening to me."}], "description": "\"When Steve Lopez sees Nathaniel Ayers playing his heart out on a two-string violin on Los Angeles' Skid Row, he finds it impossible to walk away. At first, he is drawn by the opportunity to crank out another column for the Los Angeles Times, just one more item on an ever-growing to-do list: \"Violin Man.\" But what Lopez begins to unearth about the mysterious street musician leaves an indelible impression.\" \"More than thirty years earlier, Ayers had been a promising classical bass student at Juilliard - ambitious, charming, and one of the few African-Americans - until he gradually lost his ability to function, overcome by a mental breakdown. When Lopez finds him, Ayers is alone, suspicious of everyone, and deeply troubled, but glimmers of that brilliance are still there.\" From an impromptu concert of Beethoven's Eighth in the Second Street tunnel to a performance of Bach's Unaccompanied Cello Suites on Skid Row, the two men learn to communicate through Ayers's music. The Soloist is a story about unwavering commitment, artistic devotion, and the transformative magic of music.", "title": "The Soloist: A Lost Dream, an Unlikely Friendship, and the Redemptive Power of Music", "url": "https://www.goodreads.com/book/show/2176660.The_Soloist", "average": 3.88, "cover": "https://images.gr-assets.com/books/1442952451l/2176660.jpg", "reviews": 1397, "authors": [{"url": "https://www.goodreads.com/author/show/154409.Steve_L_pez", "name": "Steve López"}], "type": ["Music", "Autobiography", "Nonfiction", "Mental Health", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/2176660.The_Soloist", "http://www.goodreads.com/book/show/6277203-the-soloist", "http://www.goodreads.com/book/show/8256572-the-soloist", "http://www.goodreads.com/book/show/3272968-the-soloist", "http://www.goodreads.com/book/show/3340359-the-soloist", "http://www.goodreads.com/book/show/8364839-el-solista", "http://www.goodreads.com/book/show/9816296-the-soloist", "http://www.goodreads.com/book/show/264408.Third_and_Indiana", "http://www.goodreads.com/book/show/2128406.The_Sunday_Macaroni_Club", "http://www.goodreads.com/book/show/264403.Land_of_Giants", "http://www.goodreads.com/book/show/2176659.In_the_Clear", "http://www.goodreads.com/book/show/10293197-dreams-and-schemes"]}