{"ratings": 658, "userreviews": [{"userName": "Carrie", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "Nell Williams receives a phone call informing her that her mother, Mary, has been admitted into the hospital in Vermont. Not only is her mother's health a real concern for Nell but just why in the world was her mother even in Vermont is the big question, Mary was supposed to be in an assisted-living facility in Massachusetts.When Nell arrives in Vermont she finds that her mother has had a secret life that no one in the family had known about. Mary owns a small cabin and it seems that she has had the place for years, even before Nell's father had passed away. Now while waiting for news of her mother's health Nell needs to piece together this secret life that her mother had been living. The Taste of Air was a fantastic contemporary read that almost had a bit of a thriller edge to it when it came down to unwinding years and years worth of family secrets. The story alternates between the current day and the past leading the reader to find out what exactly Mary had been hiding from her closest family for years. Not only did Mary have her secrets for Nell to uncover but the book touches upon Nell's own self discovery along with other characters during the read. It was quite intriguing and had the pages turning all throughout watching the characters grow and find themselves right along with solving the mystery of the small lakeside cottage that Mary had kept and why she hadn't even told her daughters. Definitely a compelling read for those that enjoy more of a family drama and secrets spanning decades unfolding before your eyes, one that I'd highly recommend. I received a copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.wordpress...."}, {"userName": "sue", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/7377874-sue", "userReview": "I had read one of this authors previous books so I am aware of her style, but this book surpassed the last read but in a different way.It was written with sheer passion for the characters which shone through each page. The more I got to learn about this double life of the Mother the more I fell into the emotional trap of secrets.Imagine 40 years of a families secret known only by the Mother. Family secrets can go any two ways, crumble a family into a heaped emotional mess with anger, frustration and dysfunctional to pulling them closer together.I couldn't help but wonder which way this would unfold.A fantastic well written book which evokes many emotions of family life.Makes me wonder, who is hiding secrets in my own family, because I am sure through the lineage of most families there are some.My thanks for the invitation to read this from the author and connected to Red Adept Publishing, LLC via Net Galley"}, {"userName": "Shelly", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/71918445-shelly", "userReview": "The Taste of Air is a fabulous and intriguing story about choices and consequences, secrets and revelations. Two sisters find out that their elderly mother is in the ICU of a Vermont hospital when they believed her to be living in a Massachusetts retirement home. The secret choices of their mother are revealed, spurning the daughters to examine their own life choices. The characters are real; they are genuine, imperfect and likable. Their lives, though messy at times, are touching. You will be pulled into this book right away and will be grateful that you were."}, {"userName": "Keep Calm Novel On", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/29575773-keep-calm-novel-on", "userReview": "The Goodreads group Making Connections provided a copy of the ePub in exchange for an honest review.Mary Reilly has been living her life with secrets. When her daughter Nell receives an unexpected phone call from a hospital informing her that her mother, Mary has been admitted, she immediately drives to her mother’s bedside. The town is not familiar to Nell and she is puzzled as to her mother’s whereabouts. Nell discovers her mother’s secret home and life—and the many layers begin to unravel. The reality of their mother’s hidden life is shocking to Nell and her sister Bridget.The Taste of Air is a truly original read. It explores the life of a woman, Mary—loyal wife, loyal parent and loyal friend. The consequences of one’s choices are cleverly revealed as the author takes the reader back in time to share Mary’s life changing experiences. The author also gives the reader a glance into Nell and Bridget’s lives. The author has created strong and distinct main characters. The secondary characters add texture to this fast paced read. The author explores emotional topics with compassion and sensitivity. The women in this well-written novel show the reader that they must learn to trust their instincts when it comes to their relationships. The men in their lives add many twists and turns to the plot as well. The title is perfect for this contemporary fiction. Will the discovery of their mother’s life allow Nell and Bridget to live their own authentic lives?"}, {"userName": "Nancy Baker", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/29267077-nancy-baker", "userReview": "I wavered between 3 and 4 stars and finally decided to split the difference and give this book 3-1/2 stars. This story gets a solid four stars for being engaging and causing the reader to want to hurry to the end and bring meaning and closure to the mystery. A mother, Mary, has taken ill and lands in an ICU ward in a hospital in Vermont. Her youngest daughter, Nell, gets a phone call saying her mother is in the hospital and has named Nell as her health proxy. Nell assumes her mother is in a hospital in Massachusetts, where she lives, only to be shocked to find she is in Vermont. She leaves her two children in the care of her husband and rushes to Vermont only to find her mother nearly comatose and also discovers her mother wasn’t just visiting Vermont, she owns a cottage there. In fact, she has owned it for many years – even when Nell was a young girl. The older daughter, Bridgett, arrives soon carrying some heavy luggage – and not just the kind you pack in a suitcase. Both begin a journey to uncover the life of their mother they never knew. The story line was interesting and, for the most part, well written, but it gets only three stars for presenting a scenario that this reader found a bit too unbelievable. Some secrets can be easily hid, other can be covered up enough that no one realizes what they are seeing, but owning a house for years and years with frequent visits and your husband and children never catch a whiff of it, stretched the boundaries a bit too far for me. There are just too many items involved in owning a home (taxes, insurance, repairs, utilities, etc.) that one spouse would be able to hide those expenses from the other spouse. If you put aside the things I found difficult to swallow, it was still a moving story of the things a mother does for love, the sacrifices a mother makes and the importance of not losing yourself in the mix."}, {"userName": "Leslie aka StoreyBook Reviews", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/272944-leslie-aka-storeybook-reviews", "userReview": "Life is too short to not enjoy life and those around you. Nell and Bridget, Mary's (aka Ellie) daughters, find out when they receive a call that their mom is not living where she should be living.This is a journey of a mother and her daughters and their various experiences and how history sometimes repeats itself. It is also a journey of self-discovery for each of these women.This book jumps back and forth in time, revealing snippets of history that tie the story together in the end. As you read further into the book you might figure some of it out before it is officially revealed, but the anticipation in waiting for the truth to be revealed had me on the edge of my seat. I wanted the characters to hurry up and reveal their secrets, but I had to wait and it was worth the wait.Each character had a hurdle in their life that needed resolution and I think each found that happiness in the end. There are some moments that will make you laugh and others that will make you cry.A very enjoyable book and while there could have been more conflict to create some tension and drama, it is still a good book."}, {"userName": "Jennifer", "userReviewDate": "Dec 25, 2016", "userURL": "http://www.goodreads.com/user/show/44048770-jennifer", "userReview": "What would you do if you learned that your mother was living a second life in another town?Nell receives a phone call one day from a hospital in Vermont letting her know that her mother has been admitted to their ICU, but Nell is confused because her mother lives in a senior's community in Massachusetts. And her mother no longer drives. What is she doing in Vermont? How did she get there?As Nell sees her mother in the hospital, weak and unable to really speak, Nell learns from those around that her mother has a complete second life, complete with a lakeside cottage, car, neighbours, Fall Festivals, and even her own puppy.As her mother remains in the hospital, Nell and her sister Bridget begin unraveling the secrets of this other life.I really enjoyed reading The Taste of Air! It pulled me in from the very first page and had the perfect balance of secrets and suspense to keep me going. To give you a taste, you can read chapter one here. Timelines from Nell, Bridget, and their mother Mary interweave throughout the novel, slowly revealing pieces of a complicated puzzle. I always love novels where the characters' stories steadily merge together at the end, and I found the three women's different lives easy to follow.The Taste of Air is about love, longing, family, friendship, impossible choices, and the internal struggle we all face to find a space that we can call our own.If you enjoy books about family secrets, then you will absolutely enjoy The Taste of Air. An excellent way to spend some of those Amazon gift cards you may have received over the holidays :)\"What we do for love...to ourselves and for each other.\"- Gail Cleare, The Taste of AirDisclaimer - I was sent a copy of The Taste of Air courtesy of the author. All thoughts and opinions are entirely my own"}, {"userName": "Samantha March", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/4681357-samantha-march", "userReview": "Whew. The Taste of Air by Gail Cleare caught my attention from the moment I began to read it. What begins to unfold from page one is a captivating story filled with mystery, suspense, love, longing and family. As I write this review and begin to relive the story once again, my eyes are filling with tears. This is a book that I have told many people about already, recommending it to all of the book lovers in my life, because I have the hope that it will stay with them like it did with me. The writing was emotional, the scenery imaginative, and each plot point revealed mesmerizing. From beginning to end, I was wrapped up in this story and I found myself trying to prolong the ending, not wanting the story to close, but finding myself far too curious to leave this down for long.The story of two sisters and their mother that unraveled throughout this novel was actually breathtaking at moments. From love and war to secrets ready to be uncovered, each little piece played a pivotal part in how this entire book came together. It was wonderful watching the personal journeys of Nell and Bridget, two very different sisters yet alike in so many ways also, as they tried to find their own happiness amidst their mother’s sudden illness. Their bond was a comfort to me as I read. Overall, I hope you can see that I truly loved this story. Filled with plot twists and unpredictable moments, get ready for a wild ride. I promise you it’s worth it though. The Taste of Air by Gail Cleare is a poignant tale not to be missed. Reviewed for Readers Favorite"}, {"userName": "Marlene", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/5401033-marlene", "userReview": "What would you do if you found out that the mother you’ve known all your life has been living a secret life?As far as Nell knows, her mother resides in an assisted living community in Massachusetts. When she receives a startling call informing her that her mother is in a hospital in Vermont, she can’t comprehend how this could be. When Nell arrives in the town that her mother is said to be at, it is foreign to her. While there, she discovers that her mother has a life that her and her family were not privy to. And as they uncover the double life that Mary has led, they are transported back in time to the choices that Mary made that would change the course of all three women’s lives forever."}, {"userName": "Sally Coles", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/36433618-sally-coles", "userReview": "Mary Ellen is a woman with a secret - her daughters Nell and Bridget think they know everything there is to know about her - so why is Nell getting a phone call to say she is in intensive care in Vermont when she should be living in MassachusettsRushing to the hospital Nell is astounded to find that her mother owns a cabin by the lake and she got ill while out boating on the lake with her neighbour, why do they know nothing of this? When she goes to the cabin she finds all sorts of things pointing to a life that she knows nothing of and so a story starts to unravelA great book with lots of surprises but the love and warmth of the family coming through as they pull together and find out the back story - definitely a book not to put down!"}, {"userName": "Carla Burgess", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/40186592-carla-burgess", "userReview": "This is an enjoyable, emotional, and thought-provoking story about family ties and unexpected secrets. I loved all three women in this story and found them well drawn and relatable. I particularly enjoyed the flashbacks to Mary's earlier days, which revealed what a good and loving woman she had been throughout her life. Although Mary's secret life comes as a big shock to her daughters, it never feels sordid or bad, and I really liked that about it. Rather it just peels back the layers of Mary's life and acts as a catalyst for change in Nell and Bridget's own lives. A lovely story and highly recommended."}, {"userName": "Ann", "userReviewDate": "Oct 28, 2016", "userURL": "http://www.goodreads.com/user/show/2562832-ann", "userReview": "When Nell gets a phone call informing her that her mother Mary is in the hospital in Vermont she is shocked. She is supposed to be in a nursing home in Massachusetts. Nell and her sister Bridget get to visit briefly with their mother before she dies. They discover she owns a home and is a part of the small Vermont community. They also discover some big family secrets. This was a fascinating book and was narrated by three very different women. I hope to find more books by Gail Cleary, she very talented. I enjoyed this story of how both sisters made major changes in their lives based on how their mother lived her life."}, {"userName": "Jennie", "userReviewDate": "Nov 01, 2016", "userURL": "http://www.goodreads.com/user/show/47099565-jennie", "userReview": "The Taste of Air is an intriguing and engaging mystery of long-held family secrets. It’s also a heart-warming story of three women’s journey towards self-discovery and leading authentic, satisfying lives. The novel is written with warmth and perception in Cleare’s smooth, easy-to-read style. Also there are some wonderfully evocative descriptions of Vermont, which made me long to go there.Some themes and questions raised in the book really resonated with me, especially that of how one (a woman usually, it has to be said) can to be true to oneself despite the multitude of limitations and compromises that can arise from marriage and family life. Nell, married to David and a mother of two, is called to a hospital treating her mother Mary who has become seriously ill - only it’s hundreds of miles from the elderly-friendly home where her mother is supposed to be living. Shocked by the discovery of her mother’s secret getaway, a lake-side house in Vermont, Nell sets off to uncover the mystery behind the house and the reasons why her mother, who Nell thought she knew well, has been living there without telling anyone. Away from her day-to-day family life while visiting Mary in hospital, Nell installs herself in her mother’s house and gets to know the people in Mary’s life she never knew existed, especially Mary’s neighbour and close friend Jake and his rather dishy son, who Nell clicks with straight away...The novel is told in the alternating close third person viewpoints of Nell and her sister Bridget in present day America, and Mary starting from when she is a nurse stationed in Vietnam during war in the 1960s. This past strand is skilfully woven with the present-day chapters so that the reader slowly learns the truth of the past along with Nell, and why Mary has apparently been living a double life for years. I could relate to all three female characters, especially Nell who feels somewhat trapped in her life with corporate go-getter husband David. She begins understand that she has choices to make - and she is more like her mother than she ever guessed - indeed startling parallels in their lives begin to emerge. Of the male characters I found gruff, alcohol-riddled Jake the strongest and most interesting. The author kept me guessing all through as to what was going to happen next. I was surprised at how the story panned out, which took me in a different direction to that I’d been expecting. The ending I found satisfying and well resolved, emphasising the importance of family... Overall, I much enjoyed this book - I now have a fantasy of leaving the boring bits of my life behind and finding a blissful lakeside hideaway in Vermont :) I would definitely recommend The Taste of Air to readers of family life novels and women’s fiction. I received a copy of this book from the author and was very pleased to review it. This is my honest option."}, {"userName": "Kathy", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/6412885-kathy", "userReview": "This was an excellent book. Do you really know who your mother is? A good story about a woman and her secrets and two sisters navigating middle age together."}, {"userName": "Mary", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/55562973-mary", "userReview": "I received this advance copy in exchange for a fair and honest review.Nell was proud of her ability to maintain her well-ordered life, but everything turned upside down the day she received a phone call that her mother, Mary Ellen, was in the intensive care unit at a hospital in Vermont. As far as Nell and her sister, Bridget, knew, Mary Ellen was living in a lovely apartment in a senior citizens’ complex in Massachusetts. What was Mary Ellen doing in Vermont? When Nell arrived at Hartland General Hospital, she was stunned to find out her mother owned a small cabin by the lake, and had developed the life-threatening respiratory infection while boating on the lake with a neighbor. Entering her mother’s cabin left Nell unsettled and somewhat confused, wondering how many other secrets Mary Ellen had been keeping from the family. The photographs on the walls, the familiar décor, and their mother’s personal items obviously in use left Nell and Bridget with more questions than answers. I really enjoyed this story of family love and loyalty. Mary Ellen was an incredibly strong woman caught in an impossible situation, and yet, she was able to do the right thing with grace and dignity. Nell’s determination to discover who her mother really was, and Bridget’s ability to understand loss and pain brought the family secrets full circle and resolved them in a warm and positive way."}, {"userName": "Nicki", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/4953912-nicki", "userReview": "Thanks to NetGalley and Red Adept for the advanced copy.Set in New England this a story about the secrets a mother has kept from her family for over forty years. A surprise phone call from a hospital in a different part of the state, calls into question everything Nell thought she knew about her family when goes to sit by her sick Mother's bedside.This is a wonderful novel that caught me by surprise as I wasn't expecting to enjoy it as much as I did. It hooked me from the beginning and kept me reading, wanting to find out what had been going on behind the scenes of Mary Reilly's life. The characters all felt real and the setting was perfect for the story.I kept thinking about my elderly Mother and if she has any secrets and if I'd want to know about them. This is my first book my this author and I'd definitely like to read more by her.I recommend this for lovers of women's fiction, it reminded me of novels by Barbara Delinsky. I think it would work really well in a book group too as there as some great themes in there."}, {"userName": "Kate Murdoch", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/54781739-kate-murdoch", "userReview": "I very much enjoyed this warm and insightful novel. Nell’s and Bridget’s mother has always presented herself as devoted and selfless, so when they discover her secret life and home in Vermont, they are forced to re-examine everything they know about her, and by extension, their own lives and choices. Her boldness in carving out a second life for herself gives them confidence to do the same. The way in which Gail Cleare shows the closeness between the sisters is masterfully done, and I think many women would relate to the impetus to be true to themselves and forge new paths. Not so much a mid-life crisis, but a desire to be honest and pare life back to the essentials. The author also toys with expectations, such as when Bridget and Nell meet Adam and Jake. We are expecting romance, but the relationships evolve in other ways. The insights about marriage and how to be ourselves within a partnership are also very well done. This novel has deservedly been receiving excellent reviews."}, {"userName": "Sharon", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/28180449-sharon", "userReview": "Red Adept Publishing and NetGalley provided me with an electronic copy of The Taste of Air. This is my honest opinion of the book.Nell Williams gets a call about her mother, Mary Ellen Reilly, who is in a hospital located hours away from her home in Massachusetts. As Nell discovers her mother's secrets, a life emerges that she and her sister Bridget knew nothing about. Will the past that is revealed tear apart the family for good?The biggest issue that I had with The Taste of Air is that it is simply just not that believable. If her daughters had not been a part of her life, I could see Mary being able to pull off the deception. However, I found it implausible that she could have fooled so many for so long. There were certain plot points along the way that seem to exist only to move the story along. I had trouble forming a connection to any of the character and, to that end, I do not feel that The Taste of Air warrants a recommendation to other readers."}, {"userName": "Kelly Topolinski", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/52716183-kelly-topolinski", "userReview": "I really enjoyed The Taste of Air, and the descriptive writing by Gail Cleare brought me right into the story. It is a family tale in which two daughters are stunned to uncover the secrets kept by their mother, and I believe that the characters are ones that can be identified with by many. I particularly enjoyed how the author brought a complex story together by weaving chapters based on the individual characters and their respective background stories. The historic parts of the story were my favorite! Vivid descriptions brought the characters and the cottage at the center of the story to life, and the way that the characters interacted was so familiar and real. It is a captivating story and one that I would recommend as an investment of time. I was sad when it ended because I wanted more. Note: I was provided a review copy of this book in exchange for my honest opinion."}, {"userName": "Caitlin Avery", "userReviewDate": "Nov 22, 2016", "userURL": "http://www.goodreads.com/user/show/6634101-caitlin-avery", "userReview": "The Taste of Air is one of the best books I’ve read this year. As the story unfolded I was most intrigued by the history of secrets that were slowly revealed about the mother of the main character. The scenes that focused on the love story during WWII and the struggles the mother faced as a wartime nurse were my favorite, since they were the ones that took me into a world most unlike my own. The need to keep secrets made sense as her life’s struggles unfolded and it was nice to see how her nonconventional approach to pursuing her true love inspired both of her daughters to make needed changes in their own lives. This is the second book I’ve read by Gail Cleare and I look forward to following her writing career. In full disclosure: I received a review copy in exchange for my honest opinion."}, {"userName": "Pamela Barrett", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/2587252-pamela-barrett", "userReview": "Do we ever really know our parents? We might have heard some stories about their lives before we were born, we may think we know everything about them; their thoughts, their dreams, their desires: but what if there was more to their stories? Author Gail Cleare delves deep into these questions in her novel The Taste of Air. It’s the story of a mother and her 2 daughters and all the secrets she kept until she ends up on life support in a hospital in a town far from where they thought she lived. Written through the eyes of each woman, we enter into this journey of the heart to a place where secrets finally see the light of day and everything changes for them and the people they care about. 4 stars"}, {"userName": "Tracy Quarrell", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/17234378-tracy-quarrell", "userReview": "This book reminded me on an Anne Tyler type of book and I love Anne Tyler and have enjoyed my first taste of Gail Cleare and The Taste of Air. This story begins with a family mystery and takes two sisters on a journey into the country of their family's past. It is a thoughtful and well drawn out family drama which examines the dynamics between lovers, friends, mothers and daughters and friends. A very engaging story which will keep you turning the pages to discover that we may not know our parents as well as we think we do and that each family has its own secrets and lies. Thanks to all involved for the opportunity to read and review this book at NetGalley."}, {"userName": "Sarahpeacock", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/7387651-sarahpeacock", "userReview": "A beautiful depiction of how decisions can impact a family through the generations. It's a tale about moving into the next stage of our lives, as our children grow up and of making a life of our own. It's also a tale about the secrets that mothers hide in order to keep those closest to them safe and the sacrifices that are made, as a consequence. Bridget, Nell and Mary's characters are sympathetically drawn and the movement through the turbulence of their lives is convincing. I am particularly impressed with the writer's depiction of life in the Vietnam war and the lasting effects it left on people's lives. Well recommended."}, {"userName": "Jack Bates", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/43675421-jack-bates", "userReview": "Reading about secrets is always fun and I'm a firm believer in the notion that you never know anyone, not really - and that probably the people you know least about, as people, are your parents. Certainly this is what Nell and Bridget find when they discover their mother had a house they didn't know about, friends they'd never met, and a story she'd never told them. An engaging read, deftly plotted with complex, empathetic characters - and some fantastic descriptions of the Vermont countryside which make me long to visit."}, {"userName": "Deedra", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/746417-deedra", "userReview": "This book is SO good!How many of us truly know our parents?Nell gets a phone call from a hospital a state away telling her that her mother is there in the ICU.Nells mother lives no where near there.Thinking it was a mistake,Nell drives there and finds a whole other life for her whole family.Marnye Young was a wonderful narrator.“I was given this free review copy audiobook and have voluntarily left this review."}, {"userName": "Katie O'Rourke", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/6666192-katie-o-rourke", "userReview": "The Taste of Air is an engaging story about what our mothers teach us. When Nell and Bridget start pulling at the thread of their mother's deceptions, their own worlds unravel. What does it say about the image the sisters have been living up to all these years?I received an advance copy in exchange for an honest review.—Katie O’Rourke, Amazon bestselling author of Finding Charlie"}, {"userName": "Cheryl Bellingham", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/55301099-cheryl-bellingham", "userReview": "The taste of air. Like a breath of fresh air I loved the book. What a nice fantasy to have a home just for you with no outside demands. Mary was lucky to have two homes where she was loved. A lovely legacy for the girls time for them away from the day to day and time to examine their lives and make new friends. Beautifully written about the tapestry of life. I was totally enthralled"}, {"userName": "Sandy", "userReviewDate": "Aug 27, 2016", "userURL": "http://www.goodreads.com/user/show/20637109-sandy", "userReview": "What an excellent book. A story of parents and adult children. Daughters think they know everything about their mothers, but do they really. Read this book and see one mother's secrets and the effect it had on everyone and how they came to really know each other. Family love, hurt, confusion and plenty of mystery solving. Loved this book!"}, {"userName": "Tatum Rangel", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/21378538-tatum-rangel", "userReview": "This story wasn't what I expected. It's a beautiful story of family, love, and hope. I loved how it was written and each chapter was full of surprises. I'm happy I've had the opportunity to read it."}, {"userName": "Linda", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/8060484-linda", "userReview": "I have to thank the author, publisher and NetGalley for letting me read this book in exchange for my unbiased review.This is one of those books you won’t be able to put down unless something beyond your control happens. It starts out interesting and just gets better and better until the final beautiful page. It’s got so much in it but not hard to follow at all. About a family, the Vietnam war in places, children, parents and children. Extended families and beautiful towns. Some tragedies along the way too but it’s so worth reading. Mary(Ellie) has two daughters who she loves beyond words. She would do anything for them that she can. Thomas, their dad got Alzheimer’s and Mary took care of him until he died. She had met him before they both were sipped overseas during the Vietnam war. Her a nurse, him a pilot. They were engaged to be married. Mary/Ellie becomes friends with an ambulance driver, Jake. They share time together and see some pretty awful things. One thing I liked about this story is it did not go into bad gruesome details of bloody and hurt soldiers or the horrors they faced when they came home. Although it did happen. It’s good to read about some of the pleasant things even though they were most likely few and far between. Jake and Mary were the best of friends and eventually Mary became best friends with Jake’s wife Jennie. Mary had many secrets that her daughters would uncover in her cottage in Vermont. She had a completely separate life there from the one at home or in the assisted living facility in Massachusetts where she was suppose to be. Nell and Bridget learned a lot about their mother that they never knew. They got to know themselves much better along the way also. They uncovered some secrets that their mother kept from them and learned why. Everyone possible has some secrets they would like to keep but in Mary’s case it helped her daughter to move forward learning who and what their mom was and had done. She was a wonderful lady in my opinion and in theirs too. This truly is a wonderful story that will touch your heart in so many ways. Make you feel like taking time for yourself is ok and a must sometimes. I throughly enjoyed this book from start to finish. It was so heartwarming, beautiful and touching. I cried, laughed, cringed a bit, while reading this one. It’s a good must read for anyone who loves a story that will unfold chapter by chapter. It is told from Mary/Ellie, Nell and Bridget’s lives. Not in the least hard to follow. It will leave you feeling happy. It did me.I loved it and gave it a big 5 stars. Well written, great characters and beautiful scenery."}], "description": "USA TODAY BESTSELLERA simple phone call disrupts Nell Williams’s well-ordered life. Her mother, Mary, is in a hospital in Vermont. But her mother is supposed to be safely tucked away in an assisted-living facility in Massachusetts, so Nell can’t fathom why she would be so far from home.After notifying her sister, Bridget, Nell hops on a plane and rushes to her mother’s side. There, she discovers that her mother has been living a second life. Mary has another home and a set of complex relationships with people her daughters have never met.When Nell and Bridget delve deeper into their mother’s lakeside hideaway, they uncover a vault of family secrets and the gateway to change for all three women.", "title": "The Taste of Air", "url": "http://www.goodreads.com/book/show/31439514-the-taste-of-air", "average": 4.09, "cover": "https://images.gr-assets.com/books/1471110939l/31439514.jpg", "reviews": 107, "authors": [{"url": "https://www.goodreads.com/author/show/4351413.Gail_Cleare", "name": "Gail Cleare"}], "type": ["Fiction", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/31439514-the-taste-of-air", "http://www.goodreads.com/book/show/32179161-the-taste-of-air", "http://www.goodreads.com/book/show/34958433-the-taste-of-air", "http://www.goodreads.com/book/show/12744962-destined-a-novel-of-the-tarot", "http://www.goodreads.com/book/show/35001489-destined-a-novel-of-the-tarot", "http://www.goodreads.com/book/show/22555406-remember-boston"]}