{"ratings": 2067, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "Sep 15, 2015", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "3.5 A fast paced thriller that could have been torn from current headlines. Really makes one think. How little is known about other countries, their problems and their people. How opinions are formed based on incomplete news stories, biased journalists, governments that only tell us what they want us to know. So many problems in the world, situations and people are very seldom black and white. We really get to know many of these characters, they are multi-faceted many in jobs harkening back to a tragic or formative event in their own lives. Experiences and how they form the people we become. A good look at hostage taking, negotiating and the might of the US government.My only concern was at times this was a bit too coincidental, written as if for film, a little to preachy, and maybe wrapped up a little too tidily.Still I enjoyed this novel, with all its moral complexities. Enjoyed learning about Somalia, liked these characters, and wanted to keep reading to find out how everything turned out.Arc from Netgalley."}, {"userName": "Lori", "userReviewDate": "Oct 05, 2015", "userURL": "http://www.goodreads.com/user/show/3332895-lori", "userReview": "Fantastic! I went into this novel totally blind... deciding to read it based on the star rating and the beautiful cover. I wasn't sure if it was something I was going to enjoy once I discovered it was about a Somolian pirate hijacking. I was afraid it was going to be a retelling of a Captain Philips. Boy, am I glad I stuck with it. When I realized that Addison was the author of A Walk Across The Sun, which I thoroughly enjoyed, I knew I was in for a memorable and insightful journey. Addison does such a wonderful job of taking current international events from around the world and relaying them in a very humanizing manner. I can not recommend this author enough. 4.5 strong stars."}, {"userName": "Sierra Faith", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/30959621-sierra-faith", "userReview": "Genre: Contemporary.Age Range: 18+Series: No.Stars: 2 out of 5 stars.(Should be one star, but I’m generous.)Publisher: Thomas Nelson and Zondervan Fiction.I didn’t like this book at all. I will be telling exactly what I disliked about it so there are spoilers below. I stopped reading this book with one hundred pages left.This book is published by a CHRISTIAN company. When I pick up a secular book, I expect language. When I pick up a book published by a Christian company, I expect it to be fairly clean. This book was anything but clean, that is language wise. There were several uses of the S-, B-, and D-word throughout the book.After I got over the shock of the cuss words, I actually started to enjoy the story. Daniel and his son, Quentin, have been sailing for several months now, and were ready to go home. Suddenly, pirates attack! My interest was finally piqued as things started speeding up. The FBI was called and everything was finally in place.FBI agent Paul Derrick is trying to get Daniel and Quentin off the boat without getting them killed. That’s when the story gets confusing. For some reason the pirate, Ismail, who seemed to be cooperating, kills Daniel. Ismail’s actions didn’t fit his personality. After this happened, Ismail was captured, and Quentin was saved.There were two hundred pages left, and I persevered for one hundred pages, but that was all I could handle. The action had all died down. They introduced Ismail’s sister to try and build a little more suspense, but I really didn’t care about her at all. There was no Christian faith in the book as far as I had read. The only faith was Muslim and wasn’t a big point in the book.Overall: I was very disappointed in this book, since it was published by a Christian publishing company. I probably won’t be picking up another Corban Addison book any time soon.**I received this book from the publisher, Thomas Nelson and Zondervan Fiction, in exchange for my honest review.**"}, {"userName": "Veronica ⭐️", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/6716390-veronica", "userReview": "Daniel Parker, his marriage in tatters and his son ready to self destruct, decides to follow a long held dream and, along with his son, sail around the world.Ismail and his band of Somali pirates are in the depths of desperation after an attempted oil tanker hijacking goes terribly wrong. That is until Daniel Parker and his yacht the Renaissance cross their path.Little did they know that that night would change the lives of many…..forever!When I received an ARC of The Tears of Dark Water my first thoughts were, pirates, hostages, negotiations, this is going to be a real suspense thriller. I was wrong. The Tears of Dark Water is a story about dreams, hopes, desperation and family. It’s about facing your demons and making peace with yourself and your past. It’s about a country in crisis and the lengths people will go to help the ones they love.The story progresses with chapters on each of the main characters where the reader learns not only about the character’s present life but also their past. It seemed like every character in the story was flawed and had a traumatic past.The story bogs down a little after the hijacking is over but with the introduction of Yasmin, a young Somali woman who was kidnapped to become a wife for, Najiib, the leader of the Shabaab, it picks up speed and held my interest again. Yasmin was by far my favourite character.A well written novel with great characterization and descriptive prose! The storyline is very predictable and you will have to suspend belief a few times with a bit of eye rolling concerning the character Megan’s thoughts and decisions. Still, well worth a read!"}, {"userName": "Pamela", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "\"Our memories bind us to our pain, our regret, our failures, and those of everyone else who has hurt us. What does contrition really mean in a world full of scars? Is it even possible for one person to forgive another for the hurts he has caused?\"  Any book that is intelligently written and studiously balanced, making me pause at great length - contemplating ethical quandaries in relation to systems such as: political, judicial, religious, criminal, cultural, economical, sociological, psychological - deserves high praise.  FIVE ***** STAR ***** HIGH ***** PRAISE!  \"It requires a fine balance to humanize a wrongdoer without compromising one's judgement about the wrong.\"  Author Note, The Tears of Dark Water.Addison Corban took great care (legalistically and ethically) presenting a complex, hardcore, ripped-from-the-headlines piracy crime and putting a humanizing face on it; a face that is deserving of punishment befitting the crime, but is also deserving of fair judicial process and humanistic consideration. In addition to an objectively balanced story, Corban also presents a diverse, realistic cast of characters. There were those I loathed, some I adored, others left me cold but respectful; a few I greatly admired - surprisingly so with great depth; and one who I respected as a legal professional - but on a personal level, regarding a painful time in her history, I wanted to take shake the 'poor-pitiful-me' victim-syndrome out of her whiny self! And as for Ismail..... I'm still pondering, contemplating, mulling-over so many things. For there are none perfect. No not one. No one can control where or to whom they are born. Time and chance happen to us all. And no matter how you look at it, two wrongs (or a string of wrongs for that matter) can never right a single wrong. Justice doesn't equate to forgiveness; the first is hopeful; the other is necessary - though many have no clue why.  FIVE ***** Ethically Pensive, Judicially Embodied, Suspense-Thrilling- ***** STARS"}, {"userName": "Beth", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/4075354-beth", "userReview": "I've seen a few other reviewers mention this, and I agree - The Tears of Dark Water has the feel of two books in one. The first part is a a suspenseful negotiation between the United States and Somali pirates, and the second part is it's aftermath and the trial that goes with it.I read both Christian fiction and mainstream fiction. I don't like limiting myself to saying I \"only\" read this kind of fiction or this kind, etc., and I think that there's value to be found in many genres. In Christian fiction particularly, I tire of the same type of plot devices over and over and cookie cutter ideas of faith, and appreciate stories that are gritty and authentic. The Tears of Dark Water doesn't water down the situations presented, and I also think it reminds readers of how things are in other areas of the world. It's narrative forces you to look at the realities of the world and dares you not to be affected. In this way, I applaud the author for taking on this story.I can't say I ever missed it when I put it down (although I admit that I read a lot less suspense than I do other genres), but it was a good read while I was reading it. It is definitely a story carried by the plot, which had a lot of exciting moments, and there were certainly times that I didn't want to put it down. I prefer character-driven stories myself, and though this story changed points of view, there was not a huge distinction between the voices of the characters, at least for me.I'm conflicted about rating this because on one hand, it was an enjoyable read. In mainstream fiction, I'm not easily offended by profanity, and I can usually overlook it unless it's very prevalent in the story. I also know that given the situations in this book, the language was really mild and probably way underdone. However, Thomas Nelson is a Christian publisher, and while I had heard that they were getting a bit more relaxed with their standards, I had never experienced it for myself until this book. In addition to the language, there was nothing to distinguish this story as Christian fiction. The faith aspect while present is on the periphery, so much so that I wasn't sure what characters it was supposed to be important to and who it was not. This book actually seems to highlight Islam more than Christianity (which doesn't bother me except for the whole publisher thing and how it doesn't fit the audience), and I'm not sure what the reasoning for that was supposed to be. I wonder why this publishing house chose to publish this novel, when it would have seemed more at home in the general market.This book has a lot of high reviews, so please take my review with a grain of salt. Honestly, if it was published by a different publisher, I wouldn't have mentioned any of those things - however, I think many of my GR friends, especially those from CFD would appreciate knowing this if they were considering picking this up.Solid, plot-driven story touching on a serious topic that I'm glad is addressed in the story, but not what I've come to expect from Thomas Nelson. 3 stars."}, {"userName": "Melinda", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/30751354-melinda", "userReview": "“The Tears of Dark Water is not really “about” Somali piracy. It is about the multi-dimensional fallout of Somalia’s disintegration over the past two decades. Piracy offered me a narrative framework to explore not only how a hijacking and hostage crisis could end in tragedy but also how the breakdown of social order on land could inspire young Somalis to take to the ocean.”\n\nI was moved by this book, a story of forgiveness as well as shining light on Somalia, a country under chaos and never-ending turbulence, an ongoing civil war with zero results, its people left with desperation as their only hope, what's risk when you have absolutely nothing to lose, also how far will you go to save your family. A narrative with a poignant message, don't let the jacket summary mislead you, this book is powerful, more than a gripping suspense thriller.Three parties paths collide, their stories are affecting, the outcome heartbreaking. You will find yourself emotionally spent, however the power of forgiveness and understanding serves as a soothing balm. Every emotion was felt as I read this story, I vacillated between anger, sympathy, love, hate, understanding and callousness, what I related to most was the power of forgiveness. Two favorite forceful characters Ismail and Yasmin, I kept thinking - if only their circumstances were vastly different, what if their country wasn't so troubled, what could have been for both without the trauma and hardship suffered.No doubt you will be asking yourself numerous questions long after you have completed the book. Ethics, human rights are a few scratching at the surface. Learning of someone's past and what they have endured, where they come from is important, worldwide we should have knowledge of the struggles fellow humans face, what better way to bridge the gap of ignorance and foster understand along with compassion. The biggest question of all... Does one's desperation and horrid circumstances excuse them from nefarious deeds?Addison delivers another compelling narrative with poignant characters, his writing and extensive research pull you into the story, he tackles hard-hitting issues while educating the reader forcing questions to be considered. Every player in this story was a victim, no winners, heartbreaking tale, eye-opening with all certitude."}, {"userName": "Julie", "userReviewDate": "Jun 11, 2015", "userURL": "http://www.goodreads.com/user/show/8074032-julie", "userReview": "Compulsive and captivating reading from beginning to end was my experience with The Tears of Dark Water! This is one of those very rare books that leaves you somewhat bereft after you’ve reluctantly turned that last page. A gritty and enthralling story of families living in vastly parallel worlds, damaged and hurting for different reasons whose courses collide in explosive circumstances changing their worlds forever. Daniel, a successful American power broker and father, is nearing the end of an around the world sailing odyssey from the helm of his own sailboat. A trip undertaken in the optimistic hope that it may provide some clarity on his crumbling marriage and also the hope that it may provide some healing and direction for his troublesome teenage son, Quentin who has accompanied him. Whilst out in the Indian Ocean fate crosses their path with a band of Somali pirates who are opportunistic, determined and frustrated from a previous hijacking gone wrong. They are led by Ismail, a young man driven by a perilous mix of desperation and devotion who will stop at nothing for resolution to what he holds dearest. The book is almost two in one whereby the first half of the story takes place mostly out at sea followed by the second half which sets out to resolve all that transpired in the first part. At this point the reader is given a small lull in tempo before the drama builds up again. The chapters are based on specific characters and although there are several pivotal characters, each one with a rich and intriguing story, one never loses the thread. Strong themes of hope, faith, redemption and reconciliation are explored. The story highlights the power of family bonds and love and to what level of desperation these bonds can push a human to go, driving you into a muddy area which will beg the question if there is ever a point where crime becomes justified? Poignantly exposed is the unimaginable way of life faced by humanity living in a war torn country. The story also addresses an accountability that is necessary when the U.S. government takes action, balancing individual needs against the perceived best interests of a powerful nation. A riveting, convincing and thought provoking read that will keep you turning page after page for more!"}, {"userName": "DeB MaRtEnS", "userReviewDate": "Apr 19, 2016", "userURL": "http://www.goodreads.com/user/show/9827967-deb-martens", "userReview": "Such a great adventure -- nail biting suspense, international politics, true-to-life dilemmas, relatable characters, matters of social conscience and legal, moral and religious ethics, courtroom drama--- WOW! I will not be my usual verbose self here but simply say that this novel is rich and marvellously paced with Somalian pirates setting off this powerful cannon of a story with complex and increasingly interesting repercussions. John Grisham, who has never endorsed the work of debut authors, did so with Addison's first book and has let his name stand with this one. John Hart, one of my favourite writers of layered and complex suspense novels, considers Corban Addison a rare find. His earlier works are now on my radar, and again, Goodreads friends and recommendations have matched me with a winner."}, {"userName": "Laine Cunningham", "userReviewDate": "Oct 23, 2015", "userURL": "http://www.goodreads.com/user/show/20821394-laine-cunningham", "userReview": "Book Review: The Tears of Dark Water by Corban AddisonThomas Nelson 2015This novel reads as if it were written specifically to go straight to a movie screen. And I mean that in the least flattering way. A father and son set out for an 18-month cruise on their sailboat. The mother stays behind; the marriage is faltering and she isn't sure whether she will join the two later at a midpoint docking. The sailboat is boarded by Somali pirates led by a man whose sister is held hostage by the men who operate the piracy ring. Tension is supposed to ensue. Herein lies the problem. Novels depend on characterization and description to lead readers into the interior lives of others...to get them to care. Movies rely on visual and auditory elements, and must strip away the interior elements to present the different sensory input. Two very different formats, two very different types of requirements. Addison gives us very little interior story. Instead, the 439 pages are pretty much choked with technical details. We discover the types of guns the pirates use and hear about the ships and helicopters that come to the rescue. We learn about the emergency signal that alerted everyone the sailboat had been taken. If only we had been given the same perspective on the characters who handled those weapons and ran those machines.Oh, and the dialog. This is about the most boring dialog ever. It's terrible because it reads like a movie script. It's filled with things the characters do not need to say to each other (or shouldn't if the narrative had revealed their personalities). It's lacking the meaningful moments that really provide emotional resonance for a book. Overall, this novel relies on the plotline to shove it through all 439 pages. There is an effort in the latter half to reveal the motivation of the lead pirate and generate compassion. And in fact the court case reflects this \"triumph\" of humanity. But it's far too little, and the machinations the characters go through to unveil this final moment don't do anything justice in terms of the novel. I received a review copy of this book from the publisher. I really wanted to enjoy the story on at least some level but did not. 1 star.If you enjoy stories with gripping tension that puts family and friends of the main character in danger, check out Reparation: A Novel of Love, Devotion and Danger."}, {"userName": "Staci", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "On the surface, The Tears of Dark Water was about piracy off the coast of Africa. The novel was much more complex than that however. It was about loss, guilt, forgiveness and love.I've also read Corban Addison's debut novel, A Walk Across the Sun. While I found the debut to be stronger, The Tears of Dark Water is definitely a novel I recommend to readers that enjoy complex and thought provoking story lines."}, {"userName": "Nate", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/7141410-nate", "userReview": "I got an ARC of this from the publisher, and this book is gripping, nuanced and very much worth your time. HIGHLY recommended."}, {"userName": "Kiwiflora", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/2356893-kiwiflora", "userReview": "This is great story telling. A riveting story of modern day piracy, a clash of cultures, people's lives torn apart. The quality of the writing is not so great, and for that reason many will consider it not much better than an airport or pool side read, but in terms of being a page turner, it is right up there. It also raises a large number of issues that have become so much a part of our daily news - terroism, piracy in the Indian Ocean, the might of the US government vs everybody else. As well as intangibles such as the basic human needs of justice and truth, the bonds of family, religion, and simple human decency. Daniel Parker, a successful lawyer, and his 17 year old son Quentin are most of the way through a world sailing trip on the family yacht Renaissance. Wife/mother Vanessa continues to live at their home in Washington DC and working as a doctor in the practice she founded. Quentin has not given his parents an easy ride through the teenage years, and this trip is an attempt by Daniel to re-bond with his son. The relationhip between Daniel and Vanessa has also beeen sorely tested over the previous few years. The trip, so far, has been a fantastic success, with the Renaissance now off the coast of Somalia. So you already know what is going to happen next. A band of pirates, led by the young Ismail, hijacks the yacht and its two sailors. Isamil is a highly intelligent young man, in his short life having lived through violence and murder, been kidnapped himself and seen his family and life as he knew it torn apart. He has a sister, Yasmin, who has disappered, her only link to the outside world a mobile phone she has managed to keep secret from those around her. As news of the hijack leaks out in the US, the Navy, the Seals, and a hostage negotiator, Paul Derrick, are deployed to do their part in the rescue of Daniel and Quentin, as well as the apprehension of the seven hostage takers. Being a novel, things do not go to plan. About half way through the book, things take a decidedly interesting turn, with everyone out to protect and save themselves - the Navy, the Seals, the Parker family, Paul, Ismail and Yasmin. How these diverse elements and characters come together is gripping and very well done, if at times a little melodramatic in the telling. But, as I said earlier, the quality of the writing is surpassed by the quality of the story and the people who fill it. So it is much more than an airport book shop read with a big glossy cover and author's name in large letters. And at the end of it all, there is a serious message - we do actually have to learn to get on with our fellow human being, to understand them and their pasts, not just their immediate pasts but where they have come from. So the book isn't really about Somalis hijacking foreign vessels, and the author makes this point in his notes. Piracy is his narrative framework for looking at the much bigger issue of the breakdown of Somalia over the past twenty years or so, and the lawlessness that has resulted from the ongoing civil war. It is tragic, and hardly surprising that the problems spill over into the Western world - after all Somailians really do have nothing to lose by taking the law into their own hands. The author's starting point for this novel was the 2011 hijack of a US flagged sailing boat, the Quest, in the Indian Ocean by Somali pirates. HIs 'research odyssey' as he calls it includes visiting Somalia, getting to know the people there, interviews with many US government officials, an FBI hostage negotiator, learning how to sail, staying on an aircraft carrier, going to the trial of the Quest hostage takers - immersing himself in these strange and diifferent worlds. The result is this excellent story, well worth the effort .Part of his dedication at the beginning of the book is \"For the jewel of the Indian Ocean, may you rise again\". And after finishing this book, you too may well hope for such an outcome."}, {"userName": "Peg (Marianna) DeMott", "userReviewDate": "Oct 31, 2015", "userURL": "http://www.goodreads.com/user/show/5194666-peg-marianna-demott", "userReview": "Wow! I really wasn't expecting a whole lot when I checked out this audiobook. I figured it was just a placeholder until I found something better. I am so glad I stumbled across it! Below is a short list of what makes a 5 star book for me:Characters I love because I can relate to them.A book that takes me to a new place or time. A novel that teaches me something.A story that helps me empathize with the plight of others.A book that keeps me peering around the next corner.A book that has beautiful language. Except for the last, this book gets a check in all the boxes. The main characters Daniel and Vanessa apparently have it all, she a fulfilling medical practice and a passion for music, Daniel a power career in law. In fact when the curtain is pulled back we see a troubled family navigating life's very dark waters, and a marriage in peril. When their troubled son Quentin finds himself in trouble with the law father and son decide the best way to put it all behind them is to embark on an around the world journey in their sailboat. All is going well, Quentin healing nicely, Daniel reflecting on his failure as a father and husband when the pair decide to ignore a coast guard warning when they reach the coast of Africa near Somalia. Their boat is boarded by pirates and I challenge you the reader not to get swept up in this very compelling story. Now I'm pleased to say that Corban Addison's two earlier books await my listening pleasure."}, {"userName": "Debbie", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/12691311-debbie", "userReview": "I received this book in the mail, it didn't say who it was from or anything. I looked at the cover and I was like, I've never even heard of this book or author. The next day, I got the same book again and it was from Fiction Guild. And I was like okay, guess I will be reading this one.Wow, was I surprised! I absolutely got into this book after the first couple of chapters and COULD NOT PUT IT DOWN! There was a lot going on in this book. A couple who let the work rat race come between their marriage, a man and a son who took off for a journey around the world, an FBI negotiator who has a twin sister who works for a well known Washington law firm, Somali pirates and a history of Somali. Even Captain Phillips (the role portrayed by Tom Hanks in the movie of the same name) was mentioned in this book. You can imagine how all this comes together, but you can't imagine that the story is only half way over after the hostage crisis. You will have so many feelings for the hostages, plus so many different feelings for one of the hostage takers. It's like no book that I have ever read. Suspenseful, emotional, sad, characters facing all their demons and fears and just down right entertaining and intriguing. I profoundly recommend this book as it makes you judge your own character as well as you think \"just what would I have done?\".Thanks to Thomas Nelson for providing me with a free copy in exchange for an honest review!"}, {"userName": "Margie Jeursen", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/17172629-margie-jeursen", "userReview": "Brilliant! Just when you think halfway through the book the story should end, the rest of the book was even more intriguing. Have read his first book, A Walk Across the Sun...it was a page turner, so bought the second and third. This book tells the story of a man and his troubled son embarking on a round the world sail adventure, which gets hijacked by pirates and the tragedy involved in this crime, then goes on to explore the reason the head pirate had embarked on this wicked deed. Corban Addison has researched his subject well tried to understand some of the problems in Somalia and what drives people to do what they do but also the need to face the consequences of their actions."}, {"userName": "Nicole", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/15459313-nicole", "userReview": "In this novel, three families each touched by their own separate tragedies, will forever be bound together in a tangled web of betrayal, love, and forgiveness.Daniel and Vanessa Parker have a struggling marriage that is only made worse by the problems they’re having with their teenage son, Quentin. To give his marriage and Quentin the second chance they desperately need, Daniel takes Quentin on a voyage sailing around the world. His hope is not only that Quentin will benefit from the voyage, but that Vanessa & Daniel will be able to rediscover their love for each other and save their marriage after the voyage is done. Ismail is a young Somali pirate that has seen his fair share of tragedy. Not only has he seen family and friends murdered before his very eyes, but the man who committed these murders also kidnapped his sister, Yusmin. Whether good or bad, every choice Ismail has made since Yusmin’s kidnapping has been to put him on a path to rescue her. Paul Derrick is the government’s top hostage negotiator. His sister, Megan, is a well-respected criminal defense lawyer in Washington. The two siblings share a deep bond that was born out of a family tragedy that has affected them throughout their entire lives. Oh, this was a wonderful story! I was initially intrigued by the description of the book and I was hooked immediately. There’s a strong theme of familial bonds and loyalty that is just beautiful throughout the book. I immediately found myself swept up in Daniel & Quentin’s story of circumnavigation and then being transfixed with Ismail & Yusmin’s story later on in the book. And about halfway through the book the author brilliantly unearths more of the story to give the reader a deeper glance and it truly kept me hanging on in suspense until the very end. I appreciated the separate points of view from the characters that gave their stories an added depth as well. This was a riveting, multi-layered story that is sure to entertain and keep you in suspense. I also have to add that with 10 or less cuss words in the entirety of its 400-something pages, I wouldn’t hesitate to recommend it to others. I really appreciate that while the author was able to describe some harsh realities, especially for women, there was no graphic sex or violence. I was shocked at how “clean” the book was. It’s truly hard to find a good book without all the junk in it and this book passes with flying colors. While it’s difficult to leave a detailed review and communicate just how well-written and fantastic this story is without giving away any spoilers, I can for sure say that I highly recommend this book and am making it a priority to get my hands on the other two books by this author!(I received and ARC of this book in exchange for a fair and honest review. The above opinions are entirely my own.)"}, {"userName": "Betty", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/3541694-betty", "userReview": "Let me say right upfront that I wasn’t sure about this book at first. What did I really know about Somali pirates? I wasn’t sure I would find it interesting. But now that I have finished the book I am certain THIS IS THE BEST BOOK I HAVE READ THIS YEAR. (And I read a lot of books.)In “The Tears of Dark Water”, Corban Addison tells a compelling, gripping story of fractured families dealing with tragedies in their own lives and global tragedies. If you enjoyed the movie “Captain Phillips” I believe you will like this book. It is not a story about piracy; it is about what drives someone to being a pirate and the consequences of their actions on all those involved.The Parkers – Daniel, Vanessa, and their son Quentin – seem to have it all. Successful careers, a nice house, all the trappings of success. But their marriage is shaky and teenage Quentin has gotten into trouble and become very distant. In an attempt to reestablish ties with Quentin, who loves the sea, Daniel and Quentin set out on a sailing trip around the world. But their dream turns into a nightmare when their sailboat is taken captive by a team of Somali pirates led by Ismail Adan Ibrahim. In violation of all his religious beliefs, Ismail turns to hijacking ships for ransom. His father was killed in front of him and his sister taken captive by the leader of the Shabab. All his actions now are focused on rescuing his sister, at any price to himself and others.Paul and Megan Derrick, twins, have dedicated their lives to helping others. Paul is an ace negotiator with the FBI; Megan is a defense attorney. But both live with horrific memories of the day their brother killed his father and then himself.Paul is assigned as negotiator in the hijacking of the Parkers’ boat. Thus is set in motion the intertwining of these three families. None of their lives will ever be the same after. Trust turns to betrayal. Power and corruption destroy lives. Now, how do these families carry on after the devastation they encountered? Can these families by patched back together?Addison writes with such precision, fully developing all these characters into people you feel you know. People with admirable traits, and with faults. How do you find justice in such an incident? What would you have done had you been Daniel, had you been Ismail, had you been Quentin, or Vanessa, or Megan, or Paul? Each has choices that may or may not backfire on them. Addison leads us rapidly toward some scenes while slowing us down in others. Savor each moment. Mull over each decision. Feel the fear, the pain, the hope, the despair. Addison does a remarkable job getting into the heart of each character.As a result of reading this book, I learned that Addison writes about global human issues, a topic I am certainly concerned with. Now I must read his other books which address human trafficking and gender-based violence."}, {"userName": "Susan", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/733980-susan", "userReview": "Thriller with a missionCorbin Addison writes thrillers with a moral dimension. I loved A Walk Across the Sun. The Tears of Dark Water is the story of a Somali pirate hijacking gone bad despite the best efforts of Paul, the best hostage negotiator the FBI has. It tries to explain the reasons behind such acts of piracy without excusing them. Addison takes real incidents and fictionalizes them. There are some twists and turns, but this novel fell at several points into predictable romantic melodrama. And although the author's notes state he did not want to excuse piracy, I felt that the character of Ismail, the main pirate, was drawn in such a way, with a backstory so powerful, that the reader cannot but help to root for him in the end - which does become an excuse. The romance of Quentin and Adelaide was charming. But other romances seemed predictable and disappointed. This was a page turner with moral depth, but it was also trite when it did not have to be. It strains credulity that Paul's sister is the lawyer who ends up defending the main pirate (at Paul's request)."}, {"userName": "Kara Peck", "userReviewDate": "Dec 21, 2015", "userURL": "http://www.goodreads.com/user/show/32753591-kara-peck", "userReview": "I wasn’t sure what to expect from The Tears of Dark Water. At times I found it slow and others quite intriguing. My expectations were short sighted, and thus I found the second half to move a little faster. A much longer story than I had assumed I would be reading. You could almost make two books out of it. At least thats what I originally thought. Once I finished and let the story ruminate for awhile, I realized I enjoyed the story and the pace. Beautiful ending and well woven. I liked the element of realism to the romance and characters lives in general. Not a fluff book, but not action packed either. I am sure others will find it more gripping than I seem to have. I would recommend it to many people without hesitation. *I received a copy of this book in exchange for review. However, I am under no obligation to read or review and my words are my own*"}, {"userName": "Angmdc", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/23272100-angmdc", "userReview": "4.5 I have been looking forward to this book since reading the authors previous, and it did not disappoint. It was an interesting read and opened my eyes to Somali, and their hardships. Great story and characters, found it captivating right until the end"}, {"userName": "Kelly", "userReviewDate": "Oct 29, 2015", "userURL": "http://www.goodreads.com/user/show/24754376-kelly", "userReview": "If I could rate this book in two parts I would. Part 1: 5 stars Part 2: 3 stars. Since this was a book club read I will wait to update my review until after the discussion!"}, {"userName": "Mary Ann", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/11710808-mary-ann", "userReview": "I loved this book! Until a few years ago, like many Americans, I didn't know very much about Somalia other than the all too sparse national news coverage, e. g., the 2009 hijacking of the Maersk Alabama and Captain Phillips. That changed when I discovered the heroic Somali refugee and scholar Ayaan Hirsi Ali, first as a lecturer and interview subject, then through her wonderful and courageous autobiographical works, Infidel, Nomad, and Heretic (all of which I highly recommend), and learned much about Somalia, its landscape, history and culture, its devastating civil war, the dominance brutally asserted by jihadism over Somalia's traditional more moderate Islam. This background greatly enhanced my enjoyment of this book.Corbin Addison is a terrific storyteller. There is plenty of thriller-like suspense and tension, but it's so much more than that. The characters are complex and multi-faceted; each has been severely physically, emotionally, or psychologically traumatized before their stories converge in the book, and I genuinely cared about all of them. Underlying the absorbing narrative are the moral and ethical dilemmas each character must confront and struggle to resolve. Addison explores these with sensitivity and empathy.It is not a perfect novel; there are a few rough spots and the occasional not quite credible coincidence, but it's very well-written, and, overall, an extremely satisfying reading experience."}, {"userName": "Gina Morphy", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/31897979-gina-morphy", "userReview": "A hidden gem that I paid only $7.00 for! I was completely absorbed in the story from the get-go. Daniel Parker and his son, Quentin are on a trip around the world when their sailboat is hijacked by Somali pirates. With narrative from every side, it was difficult to say where my loyalty lay. The writing kept me on the edge of my seat and just as things took a turn for the worst, there came what felt like a complete second book. Following the devastating turn of events aboard The Renaissance, the author delves into the trial of Ismail, the Somali pirate who assumedly killed Daniel Parker. We were introduced to Ismail's hardships in contrast to those of Paul Derrick (and sister Megan). I was satisfied with the way things wrapped up and enjoyed the mix of emotions this book made me feel. As my boyfriend can attest, there were several times I finished a chapter and had to close the book before bed with an \"oh snap\"."}, {"userName": "Amy", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/11788956-amy", "userReview": "-Not my typical read but I really liked this. I found it thought provoking in terms of the blurred lines that come about when you can empathize with those who do horrible things. The plight of sufi Somali Muslims caught in a civil war with Al-Shabaab; not only oppressed, abused and in danger of being murdered, but also lacking any opportunity was eye-opening. The background of Ismail made his motives so real to the reader....I actually found myself rooting for a good outcome for him. The only reason I would give it 3.5-4 stars is it's over abundance of mundane detail, which is kind of a peeve of mine. I did find myself skimming through some chunks of text and thinking to myself, \"Oh come one, get on with it already.\""}, {"userName": "Jill Robbertze", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/14456870-jill-robbertze", "userReview": "A well-paced exciting story about a hijacking by Somalian pirates, the negotiation, the aftermath and ultimately the courtroom drama. I love that Corban Addison tells this story from the perspectives of both the victims and the perpetrators and their lives and backgrounds. This book has a bit of everything, adventure, drama, family relationships, a very well constructed plot and much more. I give this one 4.5 Stars."}, {"userName": "Sara Soukup", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/32799778-sara-soukup", "userReview": "I almost quit on this book because the first 125 pages were quite tedious for me. But I hate not finishing what I start so....Once I got around the fact that I know nothing about sailing, piracy, Somali, or the piano, I took what I do know about best intentions, the egos of some men, the love for your children, and how things will get better and just read the book for what it was."}, {"userName": "Kalei", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/69182134-kalei", "userReview": "Heart racing, tragic, and brilliant! Corban Addison brings his reader to a place of personal understanding of both the innocent and guilty parties. This novel had romance, adventure and politics intertwined wonderfully and kept the reader wanting to find out what happened next."}, {"userName": "Margie", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/29628091-margie", "userReview": "So enjoyed this book."}, {"userName": "Karla Seyb-stockton", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/20269733-karla-seyb-stockton", "userReview": "I enjoyed learning about Somalia and broadening my horizons about this country. As a navy veteran whose ship plied the waters of the Indian Ocean during the '90s, on the lookout for Somali pirates everywhere we went, it was especially interesting. The medical scenes on the aircraft carrier had a couple of small details that didn't seem quite right, but otherwise the Navy's part was pretty plausible. I will read more from this author."}], "description": "Daniel and Vanessa Parker are an American success story. He is a Washington, DC, power broker, and she is a physician with a thriving practice. But behind the gilded facade, their marriage is a shambles, and their teenage son, Quentin, is self-destructing. In desperation, Daniel dusts off a long-delayed dream a sailing trip around the world. Little does he know, the voyage he hopes will save them may destroy them instead.Half a world away on the lawless coast of Somalia, Ismail Adan Ibrahim is living a life of crime in violation of everything he was raised to believe except for the love and loyalty driving him to hijack ships for ransom and plot the rescue of his sister, Yasmin, from the man who murdered their father. There is nothing he will not do to save her, even if it means taking innocent lives.Paul Derrick is the FBI s top hostage negotiator. His twin sister, Megan, is a celebrated defense attorney. They have reached the summit of their careers by savvy, grit, and a secret determination to escape the memory of the day their family died. When Paul is dispatched to handle a hostage crisis at sea, he has no idea how far it will take him and Megan into the past or the chance it will give them to redeem the future.Across continents and oceans, through storms and civil wars, the paths of these individuals converge in a single, explosive moment. It is a moment that will test them and break them, but it will also leave behind an unexpected glimmer of hope that out of the ashes of tragedy and misfortune, the seeds of justice and reconciliation can grow.\"", "title": "The Tears of Dark Water", "url": "https://www.goodreads.com/book/show/26404001.The_Tears_of_Dark_Water", "average": 4.14, "cover": "https://images.gr-assets.com/books/1442603528l/26404001.jpg", "reviews": 363, "authors": [{"url": "https://www.goodreads.com/author/show/4880808.Corban_Addison", "name": "Corban Addison"}], "type": ["Fiction", "Thriller", "Contemporary", "Mystery", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/26404001-the-tears-of-dark-water", "http://www.goodreads.com/book/show/22889899-the-tears-of-dark-water", "http://www.goodreads.com/book/show/26313549-the-tears-of-dark-water", "http://www.goodreads.com/book/show/25849647-the-tears-of-dark-water", "http://www.goodreads.com/book/show/27160549-the-tears-of-dark-water", "http://www.goodreads.com/book/show/11469379-a-walk-across-the-sun", "http://www.goodreads.com/book/show/16089283-the-garden-of-burning-sand", "http://www.goodreads.com/book/show/29492073-a-harvest-of-thorns", "http://www.goodreads.com/book/show/25482127-interviewing-authors-anthology-volume-iii", "http://www.goodreads.com/book/show/28203677-interviews-with-gene-ambaum-and-corban-addison", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}