{"ratings": 28395, "userreviews": [{"userName": "mark monday", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "To: Mr. Dan SimmonsFrom: Associated Publishing Industries Unlimited, Ltd.Subject: Your Recent Submission The TerrorThank you for your recent submission. Unfortunately, at this time, we do not see a fit between your product and our company's goals. Although our senior staff appreciated your technical ability, we noted several serious issues with your submission that need to be resolved prior to your product finding placement. These include, but are not limited to:1. Extensive and Excessive Length. A common error made by both the reading public and the writing community is that the modern novel must exceed 700 plus pages. The success of the Harry Potter series has only contributed to this misunderstanding. What many fail to understand is that this is simply the result of spacing and font size; the truth of the matter is that novels like those written by Ms. Rowling are no larger than any given novel by Beatrix Potter. Despite the fixation on what are basically large-print serials, our focus groups more frequently maintain that \"The Shorter, The Better\" - particularly given their short attention spans and addiction to pop culture media e.g. Us Magazine, Jersey Shore, Charlie Sheen, and the like.2. Lack of Genre. Your product appears to include traits from the Historical Novel, the Horror Novel (specifically its subset, the Monster Novel), and the Metaphysical Odyssey. Associated Publishing Industries Unlimited, Ltd. products must strictly adhere to our \"One Novel, One Genre\" company philosophy. The general reading public is a busy public, and have no time for the perplexing muddiness of genre mixing-and-matching.3. (a) Lack of Traditional Romance; (b) Negative AND Positive Depictions of Homosexual Activity;(c) Interracial Sexuality Not Resulting in Punishment and/or Death of Non-White Character by Novel's End. Please understand that our editorial staff has no personal issues with any of the above-noted items (in fact, our marketing department actively supports the targeting of the lucrative Gay/Homosexual demographic within our Ghettoized Associated Publishing Industries Unlimited, Ltd. subset label). However, the presence of all three alternative lifestyle choices/options within a single novel - one intended for mainstream consumption - can only yield confused, 'buy-shy' reactions from our reading public.4. (a) Lack of Resolution. Your novel does not have a solid ending. It only offers questions, not answers. Additionally, the \"dreamlike tone\" of the final pages were off-puttingly \"poetic\" \"ambiguous\" and \"transcendent\"... three adjectives that our focus groups vehemently reject when considering reading options. this Lack of Resolution would not necessarily be problematic if your submission was intended to be the first in a multi-novel saga; however it is quite clear from your ending that another issue is (b) Lack of Potential for Sequel or Series.5. Too Many Details. oh, and 6. Too Many Big Words.We sincerely thank you for your time/effort.Signed,An Associated Publishing Industries Unlimited, Ltd. Representative"}, {"userName": "karen", "userReviewDate": "Mar 06, 2010", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "**lo! i have made a readalike list for this book over on riffle!** http://www.rifflebooks.com/list/25427...oh my god, let me never get scurvy.i am glad i am such a grad-school overachiever. for both the horror/sci-fi and mystery portions of my readers' advisory class, i have read one extra title from the selection list, and both times, i have liked the extra title best. (i did not choose to read an extra romance title, so we will never know how that would have turned out, alas)this book is a rare combination of to the lighthouse, and the thing, with hardy-esque occurrences of misunderstanding and some cannibalism thrown in for the kiddies. plus boats and ice and monster.like the descent, it is the supernatural elements of the story that end up being the least scary. nature is scary enough. cave-exploration, even for feisty extreme-sport doing, athletic-looking girls, becomes terrifying, even before any monsters show up. monsters are icing. for this book, scurvy, madness, murder, temperatures of 78 degrees below zero, starvation, frostbite, gangrene, botulism, did i mention scurvy??- i mean, isn't that enough without a giant monster stalking and eating your seamen? but i am,to my great dismay, not easily scared.this, to me, was the most promising trailer in the world: http://www.youtube.com/watch?v=2lm2hZ... but the movie was not scary, and in fact made me cross because of the ways in which it was not scary. i thought i had finally met my match, but i wound up being utterly disappointed. being scared is not too much to hope for, is it?? this book, while it is not going to keep me up tonight, has several really good \"oh shit\" moments. (and i hope that answers lori's question)i love the cold, but this book made me pray for global warming to hurry up and save these poor men. (this feeling will last until one of you jokers sends me a picture of a sad polar bear - awwww) but seriously, shit is COLD!! and i got so into the book that i took the wrong bus on monday and traveled a half hour in the wrong direction before looking up from the book to realize my mistake, and also skipped work (ostensibly because of residual bad-feeling from hellish customers yesterday and faulty alarm clock [both true:], but also because i wanted to finish this book before the ending could get ruined for me in class tonight)it is an amazingly well-researched book, which may ruin it as horror genre-fiction for people who want their horror fast, cheap, and hard. there are tons of details about rigging and naval protocol and ice conditions and many repetitions of the survivor's names - there are echoes of moby dick here, in its dullish bits about whale anatomy that might be a staple of maritime fiction for all i know, but make the progress a little slower than the monstrous stephen king i read as the other horror title for this class. i think all the details add too much weight to the story to let it retain its status as genre fiction. for myself i would consider it historical fiction with some supernatural zazz. but it remains totally absorbing, totally gripping, and despite all the questions i raised about the pacing, it is ultimately scarier than the king, whose characters remain cartoonish and too one-dimensional to be scary. except for large marge, cartoons are not scary. here, the danger seems imminent - there are incredible moments of tension and so many beloved characters having unfortunate things happen to them. do not become attached to any of them, because in the end, many seamen are swallowed, and several are spit out. (that was unavoidable and you know it)"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "UPDATE: $2.99 on kindle US 7-27-17People, just turn around and go home!I probably shouldn't have went and read some facts about the history of this book because I might mess this review up. It's just so freaking interesting and I want to read about it. The author left a lot of resources for books at the end and there is one I'm going to try to get for sure. The fact that Dan Simmons added an horror element to a historic novel is pretty awesome. And there are so many characters that I liked in the book and well. . . you know what happens if you read anything about the real story. Some parts of the book had me confused because it would go back and forth at different times but I pretty much know what's going on. Captain Sir John Franklin and Captain Crozier take the HMS Terror and HMS Erebus out to try to go through the Northwest Passage, which was called the 1845 Franklin Expedition. And it's doomed!!!! Not only do they get stuck out there for a couple of years, they have some monster thing <---(I know what the monster thing is) killing them, along with scurvy, starvation, random stuff, etc. I LOVE the cold weather and WINTER is my favorite, but not this kind of stuff. Not being stuck in the ice in the middle of no where land with minus a million degrees with food running out, disease running all around, oh and lets not forget the monster! I liked Dr. Harry D. S. Goodsir, he is one of the surgeons on the ships and after awhile he has an epiphany: •One reason that Dr. Harry D. S. Goodsir had insisted on coming along on this exploration party was to prove that he was as strong and able a man as most of his crewmates. He soon realized that he wasn't.•He's a very good man and does all he can for the crew members. He also keeps a diary which I enjoyed reading because it gave his point of view on things. There is an Esquimaux lady that is on the Terror. They call her Silence because something chewed off her tongue. Yeah! She was brought there with her father or husband, they are not sure and I will let you read about that little mystery. I was freaked out by Silence the whole book. But there was a lot more going on there than meets the eye. One of my favorite crew members was Irving, he was such a nice guy and he was told by Captain Crozier to watch over Silence because he didn't trust her. Boy did he see some crazy stuff going on with her. I also liked Captain Crozier, Fitzjams who took over for Sir John, Mr. Diggle and Blanky. I loathed a man named Hickey. He was more evil than the monster I do believe and I wish he would have had some great torture befall him! Trust me, you won't like him either! The story isn't just about the monster, this is a big tome of a book at almost 1000 pages but the monster isn't in it a whole lot. The story is about other horrible things that happen. The worries of what the crew is going to do when they are running out of food and find out that food is tainted (true story about the tainted food), running low on coal, people catching scurvy and dying a slow horrendous death, the cold, don't forget the cold. Some really nasty stuff happens that had to do with the cold. But that monster does some crazy stuff. It's almost like he has a sick sense of humor! •\"It?\" snaps Crozier. \"One body? Back on the ship?\" This makes no sense at all to the Terror's captain. \"I thought you said both Strong and Evans were back.\"Third Lieutenant Irving's entire face is frostbite white now. \"They are, Captain. Or at least half of them. When we went to look at the body propped up there at the stern, it fell over and . . . well . . . came apart. As best we can tell, it's Billy Strong from the waist up. Tommy Evans from the waist down.\"Crozier and Fitzjames can only look at each other.•You never know what you will find in the never ending night! •On a Tuesday dogwatch in the third week of November, the thing from the ice came aboard the Erebus and took the well-liked bosun, Mr. Thomas Terry, snatching him from his post near the stern, leaving only the man's head on the railing.•I thought this was a really good book. I did think it was a bit long as a few parts dragged for me. And that's not because it's a tome, I have a few favorite tomes that are bigger than this one. Either way, I still very much enjoyed it and the ending and finding things out was so cool. Of course at one part you start to get an idea of what it's going to be about. And it took a turn I didn't see coming! I will leave you with a picture of the Erebus they found in 2014/2015, I forget what the article said now but you can google it. They still haven't found Terror. They also found mummified corpses and stuff so be prepared when you google! MY BLOG: Melissa Martin's Reading List"}, {"userName": "Amanda", "userReviewDate": "Sep 09, 2009", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "September 7, 2010: I don't want to talk about it right now. It's too soon and the pain is still too fresh. I shall review on another day.September 17, 2010: It's been well over a week since my encounter with The Terror and the thought of writing a review still exhausts me, but here it goes. I have read many glowing reviews of The Terror. That is, in fact, why I bought it. I mean, check out this kick ass plot: Two British ships, the Terror and the Erebus, are frozen in the polar sea for years, waiting in vain for a summer thaw. This is, of course, based upon the doomed Franklin expedition, so we have some serious history going on here. Now, add to that a dash of the supernatural--something is out there on the ice. It terrorizes the men, seeming to materialize from nowhere. It's three times the size of a polar bear and has the vicious, bloodthirsty nature of a predator, as well as the keen intelligence of a man. It's like a giant cat toying with the two ships as if they were terrified mice in a corner. There's nowhere to go, guns don't faze the the thing the men dub \"The Terror\", and, now, the food supply is running out.That's some frightening shit. It's the arctic. That alone is frightening. It can drive a man insane. It's the nothingness. The whiteness. The endless-ness. Howard Moon and Vince Noir knew not to take the tundra lightly.And that's part of what ruined the book in the beginning. All I could think as I read the first few chapters was \"ice floe, nowhere to go.\" I think that might have taken away from the tone a bit.But here are some other more text-based reasons for the seething black pit of hatred that I have for this book:a) History or supernatural, Simmons needs to pick a side because the two storylines always seemed to run parallel to one another and never quite came together. It was like, \"Okay, for 100 pages, I'm going to have the men fearing for their lives as this thing attacks them. I'm going to build tension and suspense and have my readers empathetically shitting down both legs! And then I'm going to flashback for 50 pages to boring nautical talk amongst stuffy British types before the expedition and then spend 150 pages talking about Welsh Wigs and Goldner food tins and building sledges and maybe I'll even talk about buggering, but no mention whatsoever of the monster for another 50 pages!\" Simmons was at his best when describing the encounters between the men and the thing on the ice, but these moments were so few and far between that I just got to the point where I didn't care anymore. b) Too much historical minutiae. The book should have been 300 pages shorter. There were entire sections that didn't add anything to the narrative. I like my history like I like my men: short and concise. c) Scurvy is some wicked bad shite. A slow death by scurvy is undoubtedly one of the worst ways to die. But do you know what's worse? A slow death by reading endless accounts of the symptoms of scurvy.d) There are no likeable characters. In fact, there is little to differentiate one man from another. If you left out the dialogue tags, it would have sounded like one man having a conversation with himself. The only character I like is Pangle, who, alas, appears in just a chapter or two of this 766 page behemoth. e) I was really pissed when I finally found out what the thing was. The main reason? THAT'S what I wanted to read more about. And it took roughly 700 pages to get to a point where I was actually interested and intrigued and it cut me off. There were some bright spots. When Simmons wrote about the thing attacking the men, leaving bait for them and taunting them, he evoked moments that were truly terrifying and suspenseful. However, there just weren't enough of them. Sure, the attempts to survive against cold, hunger, and disease should have been compelling stuff, but they made for anemic reading when pitted against a terrifying adversary without name or shape. Also, the chapter in which the men throw a carnivale and erect tents that mirror the rooms in Edgar Allan Poe's The Masque of the Red Death is admittedly brilliant. When it comes right down to it, though, The Mighty Boosh did a far superior job of capturing the terror of the arctic. When Howard admonishes Vince that \"The arctic is no respecter of fashion,\" I still get chills. The same cannot be said of my reaction to The Terror. Cross posted at This Insignificant Cinder"}, {"userName": "Ginger", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/14097149-ginger", "userReview": "Whew! I finished it. Wowza!This is such a long book!!!!!!!Don’t go into this one unless you enjoy big books, having the patience to let the story evolve and knowing that the pace can be slow at times.I stuck in there from the beginning and the ending was well worth it! I was struggling in the beginning because the first 10 or so chapters in this book alternate between the present and the past when the Franklin expedition was started.It also has different POV chapters with characters so also know that going in as well. You'll figure out who everyone is if you just take the time to let the story develop.While reading \nThe Terror\n during winter, I always felt cold. This story sucks all the warmth from you from the below freezing temperatures in the book, the bleak surroundings and the isolation that the Franklin expedition endured. The Arctic was its own character in this book with the constant darkness and freezing conditions.Good grief, I now need to go on a vacation to a warm, tropical island after reading this book!This was a re-telling of the Franklin expedition from the details of the officers, seamen and the steps they took that got them stuck in the ice during the period of 1845-1848 near King William Island. The Royal Navy wanted to find a Northwest Passage from Britain to China and going through the Arctic was the steps they wanted to take to accomplish this.In the Royal Navy’s mind, whether this expedition made it was another story.Just keeping trying until they can get that Chinese tea and opium! It's gold I tell ya!Dan Simmons not only used the real names of the crew from HMS Erebus and HMS Terror but he used historical details of the nautical life during that time and geographical locations to really give this book staying power. I kept thinking, is this non-fiction but then the white, monster-like Yeti would come into the next chapter and I would say, “Nope!”.The best part of this book was finding out that men can be more of a monster then the \"demonthing\" monster. Simmons writes this well and I experienced such hatred and despair while reading the last 25% of this book!Jesus, I wanted to turn into the white, monster-like Yeti myself and kill some people!I’m still not sure how to categorize this book. I’m guessing its a main dish of historical fiction, a side dish of some horror with a dessert of magical realism.I really enjoyed the ending. It ended on a high note and I was satisfied with slogging through the Arctic and the slow beginning to get there!"}, {"userName": "Michael", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/65909643-michael", "userReview": "Why am I reading so many books about the cold? Maybe because it's freezing here in Chicago!This is a buddy read with Cristina, and I'll review as I go.The first couple of hundred pages were surprisingly slow-going. There was very little propulsion about the plot--just occasional glimpses of the \"terror\" along with long passages of backstory that I didn't really find compelling. I don't know why I reacted like that. Maybe it was because I'd just read Crime and Punishment, another (and very different) tome that managed to be fascinating throughout. Or maybe it was the prose, which isn't terribly stylish. I'm always a sucker for great prose, and I miss it when it isn't there. At that point, I would have given the book two or maybe three stars.Then, at some point, things brightened up--the plot started shifting into gear, with all the various elements (the terror, the ice, scurvy, boredom, and inter-character conflict) starting to come together. I still think it took too long for that to happen, but boy, I'm glad it did![Some spoilers follow]***I love the scene of the Carnival, no doubt because it self-consciously replicates Poe's The Masque of the Red Death. You just knew, given that setup, that the creature would strike, but it was quite well-done all the same. And the scene where Irving watches the creature and Lady Silence together was just magical. It deepened the sense of the creature as not merely being a source of terror, but also perhaps something more.Of course, against the backdrop of the creature striking, we have the \"ticking clock\" in the form of scurvy and running out of food. The sailors need to do something to escape, and their ice-bound ships will not suffice. What can they do? It's a terrific source of tension.***In the end they make an ill-fated attempt to cross the ice by foot, and here is where the interpersonal tensions come to a head. It's also where we see, in shocking terms, just what the cold does to a human body. The creature recedes somewhat into the background as the elements take over. I may have wished for more of a confrontation with the creature, as it seems to emerge at times conveniently, only to fade away when its presence is inconvenient, but this is a minor quibble. In the end, the group splinters, and a new source of evil in the form of Cornelius Hickey comes to the front of the stage. The pages here are quite gripping, even as the moral valence isn't terribly complicated.What does become complicated, and what ultimately elevates this book, is the relationship between Captain Crozier and \"Lady Silence\" that emerges after Crozier is left for dead by Hickey and his band. What's interesting is how Crozier changes and becomes like an Eskimo himself--how he becomes a different person. The climax is when the creature emerges and cuts out his tongue just as it had Lady Silence's, and while this is never really explained, I took it as a metaphor for the limits of language itself--how they had to free themselves from language to see beyond its obscuring haze of words. In the end, much of the final part of the book is interwoven with songs and language taken from the Eskimo, and while I couldn't understand it, it nonetheless had a certain power. Like a Latin Mass, the sounds themselves conveyed a certain meaning beyond the rational, which may have been part of the point--that all that British rationalism only got the men killed, while the liturgical melding of Crozier and Lady Silence and the landscape itself was what saved him."}, {"userName": "Bentley ★ Bookbastion.net", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/7971097-bentley-bookbastion-net", "userReview": "See this review and more like it at www.bookbastion.net!_______I'm late to the party with this read, I know, but The Terror just came onto my radar when I realized that AMC was turning it into a television show. I'm a book-over-movie/tv adaptation purist. So many details end up falling to the wayside in an adaptation - for example, I've watched one episode of the show, and already spotted a major difference from the book. I knew I'd want to experience this story as Dan Simmons originally told it, so I ran out and got myself a copy. I knew going in that this would be a book that would challenge me on a number of fronts. I enjoy horror, but historical fiction is not exactly my purview so to a mix of both is definitely something I'd not experienced before. I'm happy to report that this book far and away exceeded my expectations. This book is as dark and desolate as its setting, packed with perfect atmospheric horror at its greatest.Inspired by real events, The Terror is a fictionalized account of Sir John Franklin's lost expedition of the HMS Erebus and HMS Terror into the artic seas in 1845-1848, to force the Northwest Passage. Dan Simmons weaves together a fictionalized possible explanation to what happened to the men aboard both these sister ships, incorporating both real and supernatural horrors that fill the story with a limitless supply of dread.Some of the best horror is borne out of that same sense of isolation that proliferates this novel. Trapped on the artic ice, in sub-zero temperatures, with a murderous beast hot on their trail, the men of HMS Erebus and HMS Terror already had enough on their plate for me to feel disturbed by. Couple all that with failing food supplies and the gloomy prospect of what must come next when the food runs out, things get even scarier.I spent pretty much the entire second half of the story aghast at the levels certain characters are forced to sink to. Make no mistake about it, when people say this book is dark, it is seriously dark. Just when you think things cannot get worse for these characters, they do. Horror fans in general are curtained to be delighted by it, so if you enjoy bleak and existential dread in your horror, you must give this a try. One other aspect I really enjoyed about this was the characters. I went into this novel hoping to be impressed by the supernatural bear-demon hunting a trapped crew in the artic and came away feeling like the depth and actions of certain characters really blew that out of the water. I was more compelled by a desire to see how certain characters stories would turn out than I was in the supernatural elements by the end of the novel.Keep in mind that there are a lot of characters here. You've got a cast of 100+ characters counting all the men on both ships, and though many cycle to the forefront of the story only to be excised by death, a few frontrunners who stick around for the long count ended up really capturing my heart. Crozier, Irving, Peglar and Bridgens in particular were three side characters that are so well developed and written that I found myself the most greatly invested in their outcomes.The level of detail and attention paid to historical accuracy is staggering, though perhaps a little overwhelming to readers who aren't expecting it. I was never bored for a moment and was very pleasantly surprised to encounter a properly scary and well written adventure encapsulated in this horror novel.4.5 out of 5 stars, rounded up for Goodreads!follow me on instagram @bookbastion"}, {"userName": "Michael Fierce ", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/6880123-michael-fierce", "userReview": "The Terror is a fictional tale based on the real life experience of the notoriously doomed John Franklin Expedition.These brave men journeyed hundreds of miles by sea voyage in the HMS Erebus and HMS Terror, part of the British Naval fleet sent to the Arctic to force the Northwest Passage in 1845–1848, and then travelled the rest on foot into the desolate, below-freezing temperatures of the Arctic wasteland.\n  All died or were never seen or heard from ever again.Dan Simmons imaginative story explains how and why. The Terror is a book drawn from a historical background so deep and so thoroughly well-researched that I'm quite sure I've never heard of any other writer of fiction attempting to do so at this level ever before. For those that like to pick apart every bit of a story with a goal in mind to repute the validity of the facts given, you won't find much to work with here. Set in the harshest conditions, with handfuls of men that may be hard to discern not only which side of the fence they're on, but just who is who for a ways, these characters aren't so much as enjoyable as they are absorbing. As their living conditions become more severe and their hardships grow more intense, good decision-making is made less and less often. Way below freezing temperatures, sparse food supplies, sickness, soreness, etc., would be tragic for even the most stalwart men.The Terror, providentially, is more than all this. What is it exactly? ~ This is a horror book, right? Yes. Even though it didn't have to be. Dan Simmons could have left out all the fantastical elements in his historical tale and it would've been enough to cringe to and have nightmares about and be fascinated all the same. But, he didn't stop there, thankfully. So what is The Terror exactly? Is it a man? Is it natural, man-made, myth or legend? The word Tuunbaq comes up. Is it a living creature, a guardian spirit, or an evil elder monster from eons past, or maybe something from another world?\n   ~ Is it the Wendigo? Or possibly a Yeti? ~\n  \n   ~ A Polar Bear gone mad with frenzy? ~\n \n   ~ Is it the mythical Tuunbaq, maybe? ~ \nI can't say. The story itself is very long, a bit heavy, hopeless, and as can only be expected, if you don't stay on it you will probably confuse a few of the officers with eachother which could result in you wanting to forget the whole thing altogether. This book cannot be compared to Simmons previous novels in any shape or form. This book is not science-fiction nor does it have the framework or set-up of a traditional horror tale either. For anyone fascinated with historical adventures and cryptid horror and for readers who crave oldschool antiquated storytelling. It takes an investment of time and patience beyond the norm that should be very rewarding if you stay with it until the end. I thought it was truly great and really enjoyed all the finer details that breached to the surface.If you are a modern reader and you only like *page-turners*, this is certainly not for you. If you have a million and one things going on at once, just say no for now. If you are into comic book type action of super-heroic proportions, not for you. If you like quick answers and are impatient in any way I suggest reading something else. If you are somebody who needs happy American-style endings to your movie, where you finally get the girl and there's a big smooch in the end with sunlight or fireworks streaming in the background, don't even touch this book for fear you might be infected by the dreadful truth of reality. There are many reasons why you should want to read this though. In this book you will share and feel the experience the crew are feeling: the cold, the despair, the loneliness, the dread and terror of the unknown, unstoppable creature, and the tragic understanding of, what inevitably feels to be, a hopeless outcome. You might feel the need to put on layers and layers of clothing, and stand so close to a fire you may be tempted to put your hands and feet right into it. You will feel like you are living this book. I believe it is Dan Simmons magnum opus. I give it 5 stars not because I'm necesarily going to return and re-read it again anytime soon but because, other than being a tad too long, it is flawless. It doesn't fall into modern traps or pitfalls of always trying to please the reader nor does it have the feeling of a Hollywood movie where you know your main characters are going to survive to the end, regardless of any other surprises. This is the real deal. Live it. Experience it. Draw from it. Then pick up some fluffy fun read you can rollercoaster through for 2 days straight to a walloping climax so you can recuperate and recover. * For fans of the book, you will be glad to know AMC is bringing it to television in the form of a tv series and if that news isn't good enough, Ridley Scott is purportedly producing it and my guess is he may even direct an episode or two.** There have been several releases of this book, even a few just recently. I prefer the standard-sized 2009 paperback release. It has a little better cover art than some of the others, having distinct yellow and white embossed lettering, and inside and on the back, a lot of cool quotes and kudo's by reviewers and other notable authors. Kind of fun to read what others have to say about this extraordinary novel. Highly recommended!!!!!"}, {"userName": "Edward Lorn", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "[Yo! Welcome. I hope you've read the book, because I will be spoiling major plot points below. If you plan to join in on the spoiler discussion in the comments section, make sure to use spoiler tags. Thanks!Man, this book was a blast to read. I loved the circular narrative. The book begins and ends with Crozier and the aurora borealis. I dig it when an author brings a story full circle. Hickey was a nightmare. What a helluva human monster he turned out to be. I appreciated how Manson and he were \"sodomites\" and vilified, yet Bridgens and Peglar were homosexuals whose relationship was handled tenderly by Simmons. The unbiased nature of the narrative was well done. No author intrusion. No judgment. Just terrific characters. Irving's death was truly a shock. I love that about Simmons, though. He's like King and Martin in the sense that he doesn't mind killing off major characters in brutal ways. Goodsir's torture was also well done. Enthralling and horrible. I especially didn't expect the last 100 pages. I never could have foreseen Crozier and Silence coming together the way they did. Such a terrific read. Thanks for joining me. See you next time. (hide spoiler)]"}, {"userName": "Rachel", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/2805400-rachel", "userReview": "Wow... I absolutely loved this book. Don't let the page length stop you from reading it! Despite its length, the story moves quickly and there's incredible tension throughout. There are a ton of characters to keep you interested (but not too many that you lose track) and who you'll want to scream at for doing the wrong thing or an incredibly awful thing. Some parts were breathtakingly tense and some parts were frightening. Don't think of this as a horror book with a monster... This is so much more. The last 200 pages were a triumph IMO... Simply one of the best books I have ever read!PS: The actual ship was just found this past September. SO COOL! http://www.cbc.ca/news/canada/north/h..."}, {"userName": "aPriL does feral sometimes ", "userReviewDate": "Feb 12, 2012", "userURL": "http://www.goodreads.com/user/show/3409532-april-does-feral-sometimes", "userReview": "[The character Hickey goes on my list of one of the most horrifying fictional evil bad guys ever, alongside Hannibal the Cannibal. But unlike some readers whose reviews I have read on GR, I did not see any homosexuality presented as an evil. Hickey was simply an evil man, full stop. Hickey’s homosexual behavior, in my opinion, was a means to hook him up with Magnus, otherwise it would have been harder to set up the relationship. Hickey committed an evil in using Magnus as an assassin when Magnus had a child-like mentality and obviously could not understand fully why he was being ordered to kill people. Hickey also took advantage of Magnus's very innocent love, too. Hickey was a person who could manipulate others into evil acts without caring whether people trusted or loved him. He only cared about having power over people. Hickey didn't give a damn who he destroyed. Frankly, I thought the author was presenting homosexuality as a simple fact of life, in itself something not fraught with any moral presumptions at all. I thought the takeaway was a demonstration of how evil Hickey was in faking empathy and love, not in how homosexual he was, gentle reader. Obviously, I disagree with some reviews on this issue. Besides, there is another homosexual relationship among the sailors which is very natural and emotionally normal. (hide spoiler)]"}, {"userName": "Christy", "userReviewDate": "Aug 07, 2007", "userURL": "http://www.goodreads.com/user/show/248667-christy", "userReview": "Dan Simmons' The Terror may be one of the few novels I've read that makes me grateful to live in Texas. This imaginative re-telling of the doomed Franklin expedition of 1845 to find the Northwest Passage is overwhelming in its details of life and death in the Arctic north. The cold is constant, the dark is depressing, and the wind, snow, ice, fog, and (when it appears) water are life-threatening. These are things Texans don't have to worry about. I must remember this book when I want to complain about 110 degree temperature in August. I must remember temperatures of 70 below zero with wind and wet and blindness on top of that. The two ships of the expedition, the HMS Erebus and the HMS Terror, sail from England in 1845 and explore the area around Beechey Island and Cornwallis Island before attempting to sail south between Prince of Wales Island and Boothia Peninsula to find the Northwest Passage through the Arctic Circle to the Pacific Ocean. However, they press on southward along this path in the face of glaciers, oncoming winter, and dwindling supplies, only to become stuck, frozen in the ice for two years along the west coast of King William Island. They press on at the insistence of the expedition leader, Sir John Franklin, and against the advice of other seasoned explorers and naval officers, including Francis Crozier, the book's central character. Eventually, the men have to abandon ship and take off on foot across King William Island to try to find a passage south and, hopefully, rescue. The men die slowly from disease, starvation, and exposure as time wears on, and sometimes they also die suddenly as the land or its inhabitants betray them and their expectations. The Terror is a long novel at 766 pages, and it is long for this very reason. The slow death of over a hundred men cannot be represented quickly. It is also a surprisingly suspenseful novel, given the facts of the case. We know, with the assistance of some quick internet research, that there were no survivors, there was no rescue. To this day, no one really knows exactly what happened to this expedition. Yet we read on, willing the men to survive, to find a way out of this awful mess.There are fanciful (less than strictly factual) elements to the story, too, including a large creature that stalks the ships and kills men easily, a creature that is not merely physical, but spirit. And the final chapters of the book turn from realist representations of attempts at survival in the fatal north to mythic representations of Inuit culture and finally to a synthesis between the two. I haven't fully decided yet how to feel about these inclusions. Do they weaken the very vivid realism of the novel and diminish the terror of the terrain itself as well as the terror of the evil that grows in some men in such situations? Or do they reinforce these elements, standing in as metaphors for the dangers of the north and the dangers of some humans?One thing these inclusions certainly do is reveal the stark contrast between the European expedition's goals and methods (and the madness of these goals and methods) with the knowledge and skill the native people have in this land. The Englishmen carried with them, from England and then from their ships, cutlery, books, jewelry, trinkets. They did not know how to survive and yet they thought they would conquer this frozen world. Franklin's very insistence on pushing forward, his insistence that any day now the pack ice would melt away from the ships and reveal the Northwest Passage is, in this context, nothing short of insanity. The things that are described in the Inuit culture (communion with spirits, communion between humans that requires no speech, etc.) may seem like insanity to outsiders, but no more so than the European methods of exploration and survival seem like insanity when seen from the perspective of those who survive the severity of the Arctic circle. The Terror is about the terror of the Other, the terror borne of a lack of understanding. The Terror is also about how we deal with that terror. Do we flail against it, try to beat it into submission, as did the Englishmen? Or do we learn to live with it, learn to appease it and live alongside it, as did the Inuit?"}, {"userName": "Wil Wheaton", "userReviewDate": "May 20, 2009", "userURL": "http://www.goodreads.com/user/show/2040005-wil-wheaton", "userReview": "Without getting into any spoilers: this is a fictionalized account of the doomed Franklin expedition to find the Northwest Passage in 1845. It is about hubris, greed, strength during unspeakable adversity, and possibly redemption.Oh, there's also a terrifying monster that they call The Thing on The Ice which is slowly killing everyone aboard the two ships.It's Dan Simmons, so he takes his time getting into the meat of the story (my dad said that he was telling three stories when he could have told one) but I consider that to be a feature of his writing, rather than a bug.I absolutely loved this novel. In fact, I loved it so much, I read most of it during JoCoCruiseCrazy in the beginning of 2011, because I just couldn't put it down, even though I was in the middle of the Caribbean on an amazing cruise."}, {"userName": "Wilja", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/40211206-wilja", "userReview": "3,75 Sterne 🌟 Puh, es ist vollbracht. Ich gebe zu, ich bin schon erleichtert, das ich jetzt durch bin. Zwischendurch hat mich mal kurz die Motivation verlassen....Dennder Autor spielt wenig mit den Emotionen der Besatzung. Er erwähnt natürlich das der ein oder andere Mal Angst hat aber das könnte er viel besser ausarbeiten, so das ich es auch fühle. Stattdessen verwendet er all seiner Energie darauf jede Situation möglichst detailliert zu beschreiben und das war zwischenzeitlich sehr ermüdend, zum Ende hin war das wiederum schockierend spannend. Außerdem kann man sich wirklich Bildhaft vorstellen, wie so eine Expedition aufgebaut ist, wirklich gut recherchiert 👌🏻Es ist ja im Grunde von Anfang an klar, das Franklin sich falsch entschieden hat und das wird sehr gedehnt, jede darauffolgende Entscheidung und Unternehmung war ähnlich gestrickt und vorhersehbar. Die Tunbaaq-Sache war interessant aber sehr abstrakt und in den ersten 600 Seiten nur ein einziges Mal erwähnt. Aaaaaaaber. Viel Genörgel um nichts. Das Ende war grausam, traumatisierenden, ekelerregend und großartig. Der Autor schafft es doch noch alle Facetten der menschlichen Seele abzudecken und darzustellen. Von Übelkeit bis Schockstarre war alles dabei. Ich bereue nicht, meine Zeit in dieses Buch investiert zu haben. 👏🏼👏🏼👏🏼"}, {"userName": "Agnieszka", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "On May 1845 two ships, HMS Terror led by captain Crozier and flagship HMS Erebus commanded by captain Fitzjames, set sail on the expedition to find legendary Northwest Passage. Leader of the enterprise which was to get England fame and glory but also establish it primacy on the field of Arctic exploration was sir John Franklin. The whole expedition counted 129 people in total. And no one of them ever returned from the voyage. Both people and ships get lost in the vastness of ice .The whole undertaking, despite obvious risk, seemed to be doomed to success. Two well-equipped vessels, food stores for at least three, or in the need even five to seven years, experienced in previous polar expeditions commanders. We can only guess what went wrong. Some fatal factors : severe this year, even for the Arctic weather, misjudged chances, false pride, bad decisions , incompetency and greed in choice of the supplier of the food ( most of it just rot or appeared poisoned with lead ). Freezing cold, hunger and scurvy effected debility, decline of health and strength and slowly decimated the crew. Some of them arguably died on the ships, others had a try to escape ice trap and abandoned ships to find death in ice desert, probably in the end resorting to cannibalism. These are historical facts but also back story for Dan Simmons' novel The Terror  . HMS Erebus and Terror . (John Wilson Carmichael/National Maritime Museum)I love reading about discovering new lands, brave travellers and adventurers of all descriptions, this mixture of courage, daring and curiosity which pushes people to go into unknown, to find their limits, to experience joy of success but sometimes meet inconceivable disaster. And amongst these readings polar expeditions are my favourites.  The Terror  is a work of fiction of course since virtually almost no evidence from ill-fated voyage remained but it feels, at least to some extent, very probable. Novel is very well-researched, Simmons from available sources, reliable reports from later rescue expeditions, from recent researches and discoveries wove a vivid and colorful story, creating a thrilling picture of courage and audacity, suffering and struggle to survive in harsh climate.But, hey, since Simmons wrapped this story up in horror costume so we have here also an unearthly creature, half – bear, half-bloodthirsty thing from hell. Well, from Inuit myths and legends actually. And no, I didn’t mind it at all though I thought it was unnecessary. I rather like being scared by something unknown and inenarrable than graphic and literal description. It really does nothing to me. For people tormented by extreme weather and hostile environment, plagued by starvation and hallucinations, prisoned in the sea of ice for years there was no need for any mythical monsters. The Arctic itself was scary enough. Besides, I’ve always thought that real monsters live only in people’s minds. It is a good and gripping reading though sometimes pace leaves a lot to be desired. It doesn’t definitely explain demise of the expedition, doesn't clear any doubts away but for sure brings to life wretched voyagers and leaves to our imagination their ghostly odyssey through ice landscape. And since in 2014 and 2016 shipwrecks of HMS Erebus and HMS Terror were located , though much further south than scientists assumed, there is a chance one day we get close to solve that mystery too.3.5/5"}, {"userName": "Brad", "userReviewDate": "Aug 21, 2008", "userURL": "http://www.goodreads.com/user/show/1022982-brad", "userReview": "Is the Terror a mythical beast in the Arctic? The Tuunbaq?Is the Terror Her Majesty’s Ship of the same name?Is the Terror nights that never end?Is the Terror a Ripper style murderer and his penchant for mutilation?Is the Terror knowledge?Is the Terror sodomy?Is the Terror a silent Esqimaux?Is the Terror scurvy?Is the Terror unrelenting ice floes?Is the Terror belief?Is the Terror remembrance?Is the Terror dreams?Is the Terror the past?Is the Terror cannibalism?Is the Terror doubt?Is the Terror hope?Is the Terror ignorance?Is the Terror magic?Is the Terror misunderstanding?Is the Terror fire?Is the Terror interminable cycles?Is the Terror hubris?Is the Terror hate?Is the Terror capitalism?Is the Terror “civilization”?Is the Terror humanity?Is the Terror the unknown?Is the Terror failure?Is the Terror duty?Is the Terror ego?Is the Terror alcohol?Is the Terror visions and hallucinations?Is the Terror death?Is the Terror suffering?Is the Terror starvation?Is the Terror ice?Is the Terror morality?Is the Terror shame?Is the Terror foolishness?Is the Terror delusion?Is the Terror love?Is the Terror life?Is the Terror solitude?"}, {"userName": "Olivier Delaye", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/9854601-olivier-delaye", "userReview": "This long (oh so long!) novel about Franklin’s 1848 lost expedition of the HMS Erebus & HMS Terror to the Arctic in hopes of finding a North-West passage was a bit of a mixed bag of highs and lows for me. First of all, I love historical novels with a touch of the fantastic like Kostova’s The Historian and in this regard Simmons hits a home run with The Terror, weaving to perfection authentic facts and Inuit legends and superstitions. Also, the descriptions and action scenes are masterfully written, taking us on board the ill-fated Terror as the crew goes from discovery to setback, hope and despair, all the while hunted by a nightmarish beast whose every entrance literally got me on the edge of my seat. But then there were too many lulls in the narrative (especially the flashback scenes!) and more than once it felt like Simmons was just as lost as the castaways in his story and simply didn’t know how to end it. Add to this a very weird mix of American and British English meant to convey the lingo of the crew (but more often than not failing to do so), and you’ll understand why I can’t give The Terror five stars. So four stars is what it gets. Which is really good.OLIVIER DELAYEAuthor of the SEBASTEN OF ATLANTIS series"}, {"userName": "Crystal Craig", "userReviewDate": "Dec 13, 2013", "userURL": "http://www.goodreads.com/user/show/4729956-crystal-craig", "userReview": "Wow! This book is quite the adventure - for the characters and the reader. I'm writing my review having not completed the book; I'm 77% finished. I've held onto every single word; have had a hard time putting the book down - I don't want it to end, but it has too. We've lost many beloved characters along the way, and there's one evil doer who remains alive and I can't wait to see what his fate is. I know what he deserves, but we won't go into that ... spoilers and all. Also, what about this creature on the ice? Will the remaining men of the two crews be able to 'conquer the beast' or were the fates of the men on HMS Terror and Erebus written the minute they stepped onto the ice? I can't wait to see how it all ends. The Terror is grand in scale, an epic adventure that will keep you captivated from start to the very last page. Before I made the halfway point, I knew I'd go on to rate it five stars; I knew it would make my favorites shelf; I knew I'd recommend it for months after I finished; and I knew I'd be going out and buying a paper copy for my personal library even though I have a copy on my Kindle."}, {"userName": "11811 (Eleven)", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/4460829-11811-eleven", "userReview": "*Update*Read 02/12 & 03/16This is probably in my top ten for any book in any genre.-----------I'd volunteer for crucifixion before I volunteered for the Franklin Expedition. The supernatural element was unnecessary here; the reality of it alone was horrifying. Top notch storytelling, highly recommended."}, {"userName": "Alex", "userReviewDate": "Sep 28, 2007", "userURL": "http://www.goodreads.com/user/show/49732-alex", "userReview": "'The Terror' is the name of a ship. We join the ship in 1847 as it plows through chilly waters looking to chart new territory in the extreme North. It is rare that I go in for period pieces and I really can't abide the whole Master & Commander/we're-at-sea-in-days-gone-by literary movement that seems to have captured the hearts of so many old men. What I do go in for is man vs. nature set in extreme cold (child of the South- lover of mountains and winter -go figure). I thought once these folks got off the boat and onto the ice this book would have a chance to entertain me. The book opens with a very nice description of the northern lights at play in the night sky as the boat sails through a fog bank with the temp holding steady at a balmy -50 degrees Fahrenheit. The opening description is nicely done; the prose was impressive enough that I thought I might have stumbled on a real find here. Then after two very nice pages we slip into the mind of captain. These are the first character thoughts we read, \"Well... I've been drunk more often than not now for three years, haven't I? Drunk ever since Sophia. But I'm still a better sailor and captain drunk than that poor, unlucky bastard Franklin was sober. Or his rosy-cheeked lisping pet poodle Fitzjames, for that matter.\"I shit you not. These characters need to be fleshed out before you could call them two dimensional. I've seen my son (age three months) make puddles of piss with more depth than these characters have. After the opening- Simmons not only proves that he is incapable of creating readable characters, he also demonstrates that he has reached the point in his career in which he is allowed to write without an editor's influence. We are all the worse for it. In the subsequent pages (the few I could stand to read) the man fires off an array of detail so nonsensical that it truly boggles the mind. Who wants to know the exact degree of pitch change in the bow and stern in the middle of a character's unrelated thoughts? The ship is rolling- he has to adjust his stance. We get it already. \"...he thinks, automatically adjusting his balance to the icy deck now canted twelve degrees to starboard and down eight degrees by the bow...\" When we move past thoughts and into dialogue I actually become sea-sick. 750 pages of this? Are you shitting me? You have to be really fucking desperate to escape into a particular fantasy to have this novel work for you. This is a novel for people without imagination - pure and simple. Another gem:\"Lady Jane stood, aghast. 'You looked cold John. I put it over you as a blanket.'\"\"'My God!' cried Captain Sir John Franklin. 'My God, woman, do you know what you've done? Don't you know they lay the Union Jack over a corpse!\"A nice touch using the exclamation point at the question's conclusion as well as the double use of 'My God!' Flourishes like that really drove the emotion home for me when I read Dan's prose.Dan Simmons has written a great many books. My God! My God, how many more do you think I'll be reading!"}, {"userName": "Gorgona Grim", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/17672459-gorgona-grim", "userReview": "[Na moje veliko iznenađenje, zapravo dobijamo ovaj odgovor. Ako se većina knjige oslanjala na to kako ljudi funkcionišu u nadi da će ipak preživeti nesreću koja ih je zadesila i prati njihove sudbine, poslednjih sedamdesetak stranica je potpuno nov nivo pripovedanja i upliva motiva. Simonsovo istraživanje obuhvatilo je i spiritualizam te njegove veze za samom lokacijom, kao i Eskime i njihovu kulturu. (hide spoiler)]"}, {"userName": "Cody | codysbookshelf", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/56352820-cody-codysbookshelf", "userReview": "Dan Simmons’s 2007 epic horror novel, The Terror, is the finest work of his I’ve yet read. A historical fiction, this long story documents the failed 1845 Franklin Expedition. It’s been a long time since I’ve read a horror novel of this stature. I’ve read a lot of short, grisly stuff lately, so it was nice to kick back with something by Simmons: he who is known for painstakingly detailed, complex narratives. This one challenged me — especially some bits toward the end — and I liked that. Told in alternating perspectives from several crew members on the two icebound ships, the pace never really relents and Simmons is able to keep the story interesting. I always wanted to know what happened next. And, without my realizing, a large and complex world had been created, one filled with men I truly cared about and wanted to see live . . . but we all know how the Franklin Expedition went. Part of the horror in this novel comes from the inevitable: we know these men will die; it’s a matter of timing and circumstance. Simmons handles his large cast of characters with a deft, skilled hand, and he makes each death meaningful, heartbreaking. I was afraid I wouldn’t like The Terror; I thought I might get bogged down or bored. But I didn’t. I really enjoyed myself! And now I can’t wait for the television adaptation."}, {"userName": "Joe Valdez", "userReviewDate": "Dec 24, 2013", "userURL": "http://www.goodreads.com/user/show/26876584-joe-valdez", "userReview": "Dan Simmons has a multitude of strengths -- undeniable attention to detail, dialogue that sings with clarity, set pieces that can haunt for days -- but most notable might be restraint from barreling down any one genre: ghost story, alien story, survival story. The Terror has elements of each but trusts the reader's imagination to give the novel shape and texture.This epic is a fictionalized account of the final voyage of Captain John Franklin, who set off for the Arctic Ocean in 1845 to locate the Northwest Passage and never returned. In Simmons' novel, Franklin's ship HMS Erebus becomes trapped in the ice along with the HMS Terror, whose skipper Francis Crozier proves a far steadier command presence as starvation and scurvy set in among the men. Hunting expeditions are unable to shoot much in the way of game on the ice and Caulker’s Mate Cornelius Hickey makes matters worse by slaughtering a party of Eskimos that the crew briefly make contact with.The sole survivor is an Eskimo girl whose communication skills are null; her tongue has been torn out. Lady Silence, as Crozier dubs her, is seen as a bad omen as shortly after her arrival on the Terror, giant footprints are found in the ice and a creature begins to prey on the crew. Assumed to be a polar bear, bullets prove no deterrent against the beast. The thing seems to come and go with the omnipresence of a ghost, but its teeth and claws are very real. It reduces the number of the crew even further, giving Hickey the fuel to divide the survivors into a mutiny.The book is long in the tooth, with the creature's rampage extended without adding significant clues as to what it might be. Simmons had a great novel focusing on starvation, malnutrition and mutiny at the end of the world without the addition of a creature. Fantastic but credible, grisly but elegant, the storytelling is ingenious, particularly the way Simmons identifies members of the crew when their bodies are covered in coats and hoods and blankets to ward off the freezing cold."}, {"userName": "Joseph", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/1281880-joseph", "userReview": "The Terror is the fictional story of the Franklin expedition through the Northwest Passage in 1845. HMS Terror did exist and did have some previous fame attached to it. The ship newly commissioned in 1813 was one of the bomb ships at the Ft McHenry that Francis Scott Key wrote about in the Star Spangled Banner. The bomb ships were built extra sturdy to withstand the launching of mortars. This sturdiness made the ships prime candidates for Arctic and Antarctic service being better able to withstand the pressures of the ice. HMS Terror served in the Arctic in 1839 and Antarctic service in 1840-1843. Captain Francis Crozier was given command of the Terror in 1839 and sailed with The Erebus both in the Antartic and in The Northwest Passage exploration known as the Franklin expedition after the captain of the Erebus. Both ships were seen entering Baffin Bay in August of 1845. This was the last sighting of the ships until The Erebus was discovered in 2014 and the Terror in 2016 underwater near King William Island. Here the history ends.The story jumps around a bit at the start introducing characters and character histories.  The Captains are real as are some of the crew.  How much liberty was taken with the biographies or how many characters were simply made up is unknown to the reader.  The ships and crew are weathering their second winter trapped in the ice west of King William Island.  With Winter temperatures dropping well below -50F both physical and psychological effects play on the men.  The ships are cramped and essentially unheated. Terror comes in many forms.  It is the isolation with little hope of rescue.  Terror is the endless winter nights and the groaning of the ice. It is in canned food.  Three years provisions were secured at a cut-rate price for the expedition.   Some canned swelled, some provisions were not properly heated/sterilized before canning.  Botulism and lead also provided threats.  Cold was always a threat.  Layers of clothing helped but made life difficult. The clothes were bulky and remained unwashed.  Some advancement in medicine were known such as carrying lemon juice to fight scurvy.  The only animals on the ice were polar bears, a threat in themselves.  Finally, as an added terror, something is killing the men.  Only glimpses of the creature are seen by the survivors.  The best description of the creature is a polar bear of unbelievable size.  This is where the novel drifts into a more supernatural thriller than historical fiction. I did enjoy the realism of the early expedition.  The hardships were well written as well as the role of the captains.  With limited or no communications the ship's captains were the law not only for the crew but as representatives of their nation at times creating national policy in faraway lands. Scurvy remained a dreadful disease and Simmons documents its effects extremely well. Also represented in the story are the Royal Marines.  Their role in ship security and as a land force is noted.  Although little is known about the actual happenings aboard these ships, the life aboard a British ship is documented well. A well written and lengthy account of early arctic exploration, hubris, and terror -- Part historical fiction, part thriller."}, {"userName": "Carol", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "WOW! This historic tale of a doomed arctic expedition set in 1845 aboard the HMS TERROR is based on true events and one horrific adventure complete with unbelievably brutal sub-zero temperatures, and a terrifying monster from hell. Loaded with great characters including the mysterious 'Lady Silence' and a unique and surprising ending to say the least. While sometimes descriptively gruesome, an engaging story and thrilling read!"}, {"userName": "J.D.", "userReviewDate": "Apr 21, 2008", "userURL": "http://www.goodreads.com/user/show/939619-j-d", "userReview": "I'm a big Dan Simmons fan, but at several points during this book, I found myself thinking, \"will someone get this man an editor?\" There's a great horror tale in here. Unfortunately it's buried under layers of fat. Ironic, since lengthy descriptions of starvation and scurvy take up so much space in the book."}, {"userName": "Barney", "userReviewDate": "Jul 26, 2008", "userURL": "http://www.goodreads.com/user/show/72162-barney", "userReview": "GIANT SUPER-LONG ALL SPOILER CROSS-TALK REGARDING DAN SIMMONS THE TERROR - YOU HAVE BEEN WARNED.A few friends of mine and I read this last month. I've not had the time to back through all the traffic this has generated but there seem to be questions, particularly about the end of the novel. I have an interpretation, particularly with regard to \"the rat-thing in the bunk.\" The following is a back and forth between myself and two friends not on this list. Everything from this point forward is SPOILER if you've not read the book. Before calling \"nonsense\" on this interpretation, remember that Dan himself once described this novel as THE THING in the Age of Sail - and look again at that dedication. Here we go;DON'T READ THIS UNTIL YOU ARE FINISHED WITH THE TERRORI believe after 700 pages of teasing, Simmons finally does acknowledge that this novel is - among many other brilliant things - a bankshot \"prequel\" to John W. Campbell's WHO GOES THERE? and the Hawkes/Carpenter movie adaptations of that story as THE THING.I believe \"the Terrible Thing On the Ice\"/ Giant Polar Bear / Polar Bear shaped demi-god is a supernatural being in the broadest sense of the term. \"Supernatural\", if we are talking about an \"earthly\" nature.I believe that he is The Hero of this novel and not the bad guy AT ALL.I believe that the Eskimo translation of meteorite as \"star-shit stone\" is no accident and that the Real People know that everything that falls from the heavens is not necessarily good for them.I believe the perfectly round black hole in the ice at the wrong time of year where the ice will not freeze over is some portion of some otherworldly craft that is still leaking massive amounts of heat - and possibly radiation. And that it has been there for SOME TIME.I believe the Bear-God creature killed who it did mostly to keep people from getting south - to protect the greatest number of Kabloona.I believe the people it killed below decks may have already been infected - perhaps very recently, which was why it appeared below decks in the first place.I think it might be worth asking if Hickey and Manson (particularly Hickey) were still human by the end of the novel.I think the entire Eskimo mythology chapter near the end of THE TERROR can be read as an Olaf Stapleton-esque SF novel that has been told for thousands of years until the SF edges have worn off.I think the Norwegian rats were the 1st line of attack/assimilation by the REAL THING on the ice.I think the two halves of bodies stacked on top of one another were a sloppy second attempt that failed. Either it couldn't be made to work or it was abandoned because it somehow sensed it would not be convincing.I think the Norwegian Rat-Captain was a third failed attempt (but just barely) and prior to the destruction by burning of the Terror, that \"stasis\" was the best that could be hoped for.I don't think Simmons broke the \"two many impossibilities before breakfast edict\" because he didn't portray two fantastic disparate elements in one novel- but rather two aspects of ONE fantastic element. This still plays by the rules. But in an obscenely clever way.- Barney Dannelke Barney, Son of a bitch. I can't believe I missed that. Especially because my original expectation for the novel was \"THE THING in the age of sail\", back when Simmons put the note about it on his website including mentions of the Things (story and movies), and I'd just forgotten about that since then. I've even the THE THING FPS game on my PC.It makes SO MUCH SENSE, because what the hell else was that man with 3-inch-teeth doing in Crozier's cabin at the end of the book? Authors don't drop things like that into books for no reason, especially at the END.More later, because I'm tired and have had some wine, but I'm going to think about what else this explains.Such as: why the attack on the Carnivale, and why weren't there more deaths? Because the men in costumes must have looked like infected men, Things who couldn't quite maintain proper human form, but a taste revealed that they were not, so no more need for a cleansing mission.Why so few killings at the hands of an unstoppable monster? Because it only has to tag the infected.I suspect you're right about Hickey, but not Manson. Because Manson died. But Hickey, Hickey survived at least 10-20 minutes naked on the ice before and after he killed Irving. In April - not August. Longer than 20 minutes, if he washed off the blood (with what? snow?) beforereturning to camp rather than afterward, in a tent withco-conspirators.And if Hickey had been Thinged, and if Things could infect and animate dead (or at least recently-dead) flesh, Hickey may have been right when he though he could reanimate Manson and the rest of his party.Are there any scenes in the novel that parallel McCready's heated-pin blood tests in the Carpenter THING? The sled-dogs freaking out at TERROR could be a nod to the dogs in the movie.I don't yet have any idea about: - why the sixam ieua need to surrender their tongues - how the Thing vessel got to Antarctica for the short story/movies.Is there more than one?- why was the Tunbaaq after Peglar? With your idea in mind, would a re-reading note where he was infected?Good stuff, Barney. It's already kept me up later than I'd planned to be up tonight, damnit. - Kevin  Kev, It's okay. I did a slow-ish reading until about the time Crozier is ambushed on the ice and then burned through to the end. All the while I played the game of saying HOW does this fit into the Campbell/Hawkes versions. Simmons was not too enamored of the Carpenter so don't look for as many parallels there.It makes SO MUCH SENSE, because what the hell else was that man with 3-inch-teeth doing in Crozier's cabin at the end of the book? Authors don't drop things like that into books for no reason, especially at the END.There was someone on Webderland who was also confused by this, but to me it makes perfect sense. It has plenty of bodies to replicate from or use as templates but I think the intelligence has been \"seated\" in the Norwegian rat brains so long that the fucked up rat-captain at the end was the \"best\" it could do. There may have been more than one of these sailing the Terror south and these were abandoned or self-cannibalized once their run for freedom was thwarted by the enclosing ice.Such as: why the attack on the Carnivale, and why weren't there more deaths? Because the men in costumes must have looked like infected men, Things who couldn't quite maintain proper human form, but a taste revealed that they were not, so no more need for a cleansing mission.Yes! Also why it may have given up on Blankey.>> Why so few killings at the hands of an unstoppable monster? Because it only has to tag the infected.<< Yes! It follows them out on the first and subsequent expeditions to King James Island, but it only kills a few when it could have killed SO many given what it did the night of the \"bear-blind.\"I suspect you're right about Hickey, but not Manson. Because Manson died. But Hickey, Hickey survived at least 10-20 minutes naked on the ice before and after he killed Irving. In April - not August. Longerthan 20 minutes, if he washed off the blood (with what? snow?) before returning to camp rather than afterward, in a tent with co-conspirators.Consider he was approaching Manson in the ships hold VERY early on. This may have just been a homosexual liason, or Hickey may have been one of the earliest infected. I'd have to re-read the whole novel to pinpoint his infection AND it wouldn't explain why Hickey survived SO LONG since, if I were the bear-god I'd have made a bee-line for Hickey.And if Hickey had been Thinged, and if Things could infect and animate dead (or at least recently-dead) flesh, Hickey may have been right when he though he could reanimate Manson and the rest of his party.Agreed entirely. It was this aspect of the god delusion that I felt Simmons was steering us towards as forshadowing and to put us back into the THING -physics mindset.Are there any scenes in the novel that parallel McCready's heated-pin blood tests in the Carpenter THING? The sled-dogs freaking out at TERROR could be a nod to the dogs in the movie.I think Simmons has put some thought as to what the dogs do and when they bark but that's another reading. I think looking for point by point Carpenter parallels is a mugs game. I really need to see the old Hawkes/Arness version again. That's where there will be overt nods I suspect.I don't yet have any idea about:- why the sixam ieua need to surrender their tonguesI think this is Simmons bending known eskimo mythology to his story. Eskimos not kissing and having a cultural aversion to it. Also, it's not so much that it's the tongue as it is a removal of a body part. This is your final McCready test. Heh heh heh.Think about who stayed healthy. Think about who avoided amputations.- how the Thing vessel got to Antarctica for the short story/movies.Is there more than one?I think so. I think there are a few things coming out of the sky up and down there in the Hawkes and Campbell stories. If you broaden it to X-files type warring alien civilizations the logic starts to break down. I haven't worked this all out. But I strongly suspect Simmons has.- why was the Tunbaaq after Peglar? With your idea in mind, would a rereading note where he was infected?Maybe Peglar. Maybe someone else in the boat.Another strong possibility is that not everyone was eaten by the Tunbaaq.Or anyone, for that matter. Their boat could have been capsized by a rotating mini-berg. It's partially described that way. This shit happens up there. At that point the drowned bodies become a prime polar bear feast. And at THAT POINT, the Tunbaaq MUST start killing polar bears to be safe.Masterful misdirection. The God-bear is our Hero.- Barney"}, {"userName": "Sean", "userReviewDate": "Oct 21, 2011", "userURL": "http://www.goodreads.com/user/show/5753689-sean", "userReview": "The Terror is the ultimate tale of the human struggle for survival. Dan Simmon’s huge tome is based on Sir John Franklin’s failed 1845 exploration of the Northwest Passage. In real life the crew of the two ships, the Terror and Erebus, all perished. However, Simmons portrays a fictionalized account of this expedition by expanding this historical narrative into a horror story by dropping in a man eating ice monster to make everybody’s day just a little bit shittier. My initial reaction was that the book was several hundred pages too long and focused much more on the harsh arctic conditions and the immeasurable suffering that the crew experienced rather than on plot. However, as I read on, the long descriptive passages and the descriptions of pain and suffering are meant to draw the reader into the story and gain a true understanding of the brutality of the arctic and it's devastating effects on both the human body and soul. As the crew’s hopes of being rescued slowly dissipates, I learned that once the dim flame of hope in man’s heart is forever extinguished, man will stop at nothing to survive. Many of the scenes are very graphic and many moral questions about the extent of man's will to survive come into play. As far as the ice monster is concerned, I believe that this is an unnecessary character in the story. This monster was only used as a plot device to add more color and draw in more readers so that this book does not stay trapped in a strictly historical fiction setting. Overall, Simmons depicts a very grim but otherwise realistic account of this failed expedition and, in doing so, has crafted a work of fiction that explores some of the darkest depths of the human soul."}, {"userName": "Thomas Strömquist", "userReviewDate": "Mar 12, 2016", "userURL": "http://www.goodreads.com/user/show/32669562-thomas-str-mquist", "userReview": "A truly uniquely fantastic book. Simmons dramatizes a true historical event and makes a number of sailors' struggle towards an inevitable end over a course of seemingly way, way too many pages into a story that nothing short of mesmerizes! I've seen a few reviewers that has stated that the story could have been told in its entirety in a much shorter book but, while this is true, when the long result is this good, why would you wish for that?There is not really much I can say about the story without spoiling a lot, but I can tell that I think the irresistibility lies very much in the fantastic characterization and in the inherit fascination about what motivated people of the time to expose themselves to such risks and extreme hardships as an arctic expedition meant. The abuse and horrors bestowed on the cast of this novel is way beyond my comprehension and a constant source of the needing to know more and to follow through on the story told.I read this through a very stressful time at work and, instead of giving me a hard time on focusing on a demanding book, this really was helpful in disconnecting me and offering moments of relaxation. Reading it with my super-buddy Edward Lorn was also a great privilege, please read his review he said it, not surprisingly, better."}, {"userName": "Sandi", "userReviewDate": "Nov 15, 2008", "userURL": "http://www.goodreads.com/user/show/811687-sandi", "userReview": "\"The Terror\" really came close to that 5-star rating. However the last 75 pages or so were so out of character with the rest of the book, they really seemed like they didn't belong. \"The Terror\" is 90% historical fiction and 10% horror. The historical part is much more terrifying than the horror part. Simmons obviously did a lot of research on 19th century Arctic exploration in general and Franklin's Lost Expedition in particular. He fleshes out what little is known about the fate of the Erebus and the Terror with some really great details. He captures the sights, smells and sounds of life on ships trapped in pack ice. I felt the cold as I was reading. The little details are absolutely fabulous. I think Simmons would have been well advised to write a novel that was strictly historical and leave the horror out. In the grand scheme of things, the monster was superfluous. The mythological ending was unnecessary and confusing. Despite it's flaws, \"The Terror\" was a really good book that will stick with me for years to come."}], "description": "The bestselling author of Ilium and Olympos transforms the true story of a legendary Arctic expedition into a thriller worthy of Stephen King or Patrick O'Brian. Their captain's insane vision of a Northwest Passage has kept the crewmen of The Terror trapped in Arctic ice for two years without a thaw. But the real threat to their survival isn't the ever-shifting landscape of white, the provisions that have turned to poison before they open them, or the ship slowly buckling in the grip of the frozen ocean. The real threat is whatever is out in the frigid darkness, stalking their ship, snatching one seaman at a time or whole crews, leaving bodies mangled horribly or missing forever. Captain Crozier takes over the expedition after the creature kills its original leader, Sir John Franklin. Drawing equally on his own strengths as a seaman and the mystical beliefs of the Eskimo woman he's rescued, Crozier sets a course on foot out of the Arctic and away from the insatiable beast. But every day the dwindling crew becomes more deranged and mutinous, until Crozier begins to fear there is no escape from an ever-more-inconceivable nightmare.", "title": "The Terror", "url": "https://www.goodreads.com/book/show/3974.The_Terror", "average": 4.03, "cover": "https://images.gr-assets.com/books/1442713631l/3974.jpg", "reviews": 3145, "authors": [{"url": "https://www.goodreads.com/author/show/2687.Dan_Simmons", "name": "Dan Simmons"}], "type": ["Historical", "Fiction", "Fantasy", "Horror", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/3974.The_Terror", "http://www.goodreads.com/book/show/3708616-the-terror", "http://www.goodreads.com/book/show/6279969-the-terror", "http://www.goodreads.com/book/show/6356629-terror", "http://www.goodreads.com/book/show/10794562-teror", "http://www.goodreads.com/book/show/2346615.The_Terror", "http://www.goodreads.com/book/show/10852751-the-terror", "http://www.goodreads.com/book/show/77566.Hyperion", "http://www.goodreads.com/book/show/77565.The_Fall_of_Hyperion", "http://www.goodreads.com/book/show/3977.Endymion", "http://www.goodreads.com/book/show/11289.The_Rise_of_Endymion", "http://www.goodreads.com/book/show/3973.Ilium", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}