{"ratings": 14838, "userreviews": [{"userName": "Linda", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "\"Sometimes you make choices in life and sometimes choices make you.\" (Gayle Forman)Hugo Langley, an RAF pilot, finds himself behind the controls on a bombing mission near the northern hills above Lucca, Italy. December of 1944 brings no choices, only commands from the powers that be. The Germans have taken over the area and Langley and his crew are in a destiny to stop them. Once airborne, Hugo and his co-pilot have been hit by enemy fire. Too late for the co-pilot, but Langley parachutes and miraculously hits the ground still alive. Desperately, he wraps up the parachute even though he is in extreme agony from a bullet wound to his leg. He crawls behind a tree and passes out. Hugo's eyes open to what he perceives to be the face of an angel. It is Sofia Bartoli from the tiny village of San Salvatore who was picking random mushrooms in the area. In his broken Italian, Hugo describes his situation and Sofia describes hers. The Germans are a threatening force and both Englishman and Italian woman are in danger of being discovered.Rhys Bowen fast forwards this story to 1973 and swoops it down amidst the surroundings of Langley Hall Estate. Sir Hugo Langley has passed away and his only child, Joanna, has come to claim his things. She has been studying law and preparing to take the bar exam. Langley Hall had been sold and turned into a private school because of vast debts. As Joanna packs away and sorts through years of items, she comes across a letter to a mysterious Sofia from San Salvatore. Joanna had no knowledge of her father's plight in Italy during the war. Determined to find out more, she travels to this isolated village to find out what she can and to come to know this man who was her father.The reader leans in as Bowen tells a story like no other with much detail and laces it with quick dialogue and a shifting storyline from one generation to another. She brings the warmth of Italy with its rich countryside and its hearty people into play. There are curious characters both on the English front and in the Italian setting. But make no mistake, a dead body will find its way to floating in a village well. Those above-mentioned choices will certainly take seed from the past and sprout into the present with consequences both good and bad. A delightful read by the very talented Rhys Bowen.I received a copy of The Tuscan Child through NetGalley for an honest review. My thanks to Lake Union and to Rhys Bowen for the opportunity."}, {"userName": "Liz", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "Barely 3 stars. I had enjoyed In Farleigh Field, so I was pleased to get an advance copy of this novel. Bowen is again covering the time period of WWII. The book is told in two parts, Hugo Langley’s escape after his plane goes down over Tuscany in 1944 and his daughter Joanna’s return to their home after his death in 1973 and subsequent trip to Italy. This book starts off slowly. I wasn’t immediately invested in Joanna’s story. For starters, I had trouble identifying the era. The only time the 70s came through was when Joanna was explaining why she was a solicitor rather than a barrister. It took me right back to my own story, back when I was starting off in banking and told I couldn’t enter commercial lending. In both cases what we lacked was down below not up above. Luckily, Bowen does a much better job placing you in Tuscany than in time. Her descriptions took me right back there. And don’t read this while hungry, she does a great job describing the food. But overall, the book had trouble holding my interest. Even with a murder, it lacks suspense. I could see where things were going from miles away. Also, there are several implausible scenes in the book, especially at the end. The only good news is that there is a big twist I didn’t see coming in Hugo’s story. My thanks to netgalley and Lake Union Publishing for an advance copy of this book."}, {"userName": "❀⊱Rory⊰❀", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/25852225-rory", "userReview": "5 Stars. Wonderful. When Joanna Langley's father Hugh passes away in 1973 she returns home to arrange his funeral and sort out his possessions. Among his things she finds a small box and within it a letter addressed to an Italian woman named Sofia. Joanna wasn't close to her father, a rather cold and withdrawn man who became even more distant after the death of Joanna's mother. The mysterious letter gives Joanna a glimpse into her father's heart, revealing to her a man very different from the one she knew. In an effort to understand her father's past she decides to go to Italy and discover what happened to him there in 1944 and, if possible, to find Sofia.What Joanna doesn't realize is that not everyone in San Salvatore wants to her digging up the past. There are secrets some will do anything to protect and when Joanna becomes a suspect in a murder investigation, who can she trust?This is such a wonderful story, with beautifully drawn characters and an amazing Italian setting. There's heartache, great food, romance and a satisfying mystery. I'll be reading this one a second time."}, {"userName": "Phrynne", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "I chose to read this because I enjoy Rhys Bowen's Her Royal Spyness series so much. This was a very different kettle of fish being set half in World War 2 and half in 1970's England and Tuscany. A big problem for any book when the author has chosen to write alternately in different time periods is if the two are not perfectly balanced in interest for the reader. In The Tuscan Child I was much more interested in Joanna than I was in Hugo which meant I put the book down and went off to do something else much more than I normally would!Nevertheless this was still an enjoyable if predictable story. Tuscany sounded absolutely delightful and there was a lot of interesting information about food! Worth a read."}, {"userName": "Bam", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "*3.5 stars rounded up.In December, 1944, Hugo Langley is a young British pilot who is forced to parachute from his burning plane over Italy. Hugo has received a leg wound and is sure he will soon die until a young Tuscan woman comes to his aid. Nearly thirty years later, his daughter Joanna is sorting through his papers after his death when she discovers an old sealed letter addressed to an Italian woman named Sofia. A letter that is marked \"Not known at this address. Return to Sender.\" It is a love letter in which Hugo says \"I want you to know that our beautiful boy is safe. He is hidden where only you can find him.\" Joanna is stunned--did her father have a child with an Italian woman during the war? If so, was that child ever returned safely to his mother? Since her own life is currently in shambles, Joanna decides to travel to San Salvatore in Tuscany, Italy to see if she can piece together the past. No one there remembers a wounded British pilot during the war but soon a man is found murdered and Joanna becomes the chief suspect. A nice blend of the past and present (1973) reveals an interesting story. Perhaps the ending is a bit too pat, hence the drop in stars, but it is a heart-warming story filled with descriptions of delicious-sounding Italian meals and pleasant, welcoming villagers. Many thanks to NetGalley, Rhys Bowen and Lake Union Publishing for the opportunity to read an arc of this new book in exhange for an honest review."}, {"userName": "Tiffany PSquared", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/27443399-tiffany-psquared", "userReview": "Historical novels usually have to be very good in order to capture and hold my attention, and this one fit the bill. In this story, we travel with Joanna Langley from Surrey, England in the early 1970s into the lush, rolling hills of Tuscany and the little village of San Salvatore as she searches for clues about her recently deceased father’s past. Along the way, we are also treated to her father’s story of survival and romance at the end of German occupation of Italy during WWII.The story was well-written and compelling. The dual timelines were not distracting, but instead lent even more drama and build-up to the story as a whole. Both perspectives were given equal attention and were very well represented by the author. Bowen’s writing was crisp and colorful without being muddled in unnecessary details. I especially enjoyed the descriptions of the Tuscan landscape and the delicious food – it made me long to visit Italy.Fans of historical fiction will appreciate this novel for its skilled placement in two distinctly different eras of history. Lovers of romantic fiction will also appreciate the tender love stories that develop as well.**Many thanks to NetGalley, Lake Union Publishing, and the author for the opportunity for me to read and review this book."}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "Netgalley # 25Many thanks go to Rhys Bowen, Lake Union, and Netgalley for the free copy of this book in exchange for my unbiased review."}, {"userName": "Siobhan", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/35855553-siobhan", "userReview": "Having read and enjoyed Rhys Bowen’s In Farleigh Field, I was more than happy to pick up The Tuscan Child. The synopsis intrigued me, and I was excited to see how the story came together.From the very start, The Tuscan Child sucks you into the story. It pulls you into the past, leaving you turning page after page as two interconnected storylines play out. You know they are linked, you have ideas of how, but it is not until you’ve worked your way deep into the story that everything becomes apparent. If you’re a fan of historical mysteries, this is certainly a book to pick up. It may not be the dark and twisted thriller you find in other books set in this time, but this one will keep you gripped throughout.While there was a lot about this book I enjoyed, I think my favourite aspect was how atmospheric the book was. Rhys Bowen really brings the locations to life, providing so many details that the world comes alive around you. Each and every element is vivid, the detail enough to transfer you to someplace new. Honestly, I was surprised. I tend to find the level of imagery I had with this book usually comes from the author being too detailed – yet, somehow, Rhys Bowen managed it without burying me under endless pages of description.Another thing I really enjoyed, something I also enjoyed about In Farleigh Field, was the attention given to the dynamics of the characters. There was a lot of fun to be had with the mystery, the world came alive around us, but what I constantly found myself wanting more of was the details pertaining to the individual characters. There were many layers to uncover, and I found myself desperate to know all there was to know about the characters, to see more of the way they played off each other.The one thing I wasn’t crazy about, though, was the ending. I felt as though it didn’t have the high impact I had been anticipating. I enjoyed it, yes; I was glad to see how everything came together, sure; but I had expected something a bit more. The ending didn’t quite feel up to the same standard as the rest of the book.Overall, though, I had a lot of fun with this one. I’m certainly interested in reading more Rhys Bowen in the future."}, {"userName": "Kathryn", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/3076351-kathryn", "userReview": "In the Tuscan Child Rhys Bowen has written a novel with a dual time line. One part is set in Tuscany during World War 11 time, where Hugo - an English pilot is forced to eject from his damaged plane. Badly injured he is helped by Sofia - a local young woman. She hides him in bombed monastery and carries food to him when she can.As well we meet Joanna - Hugo's daughter, in 1973 returning home to Langley Hall on the sudden death of her father. She finds some items amongst his things that lead her on a journey to Tuscany to find answers to her questions. From her we receive a picture of Hugo as an old defeated man, out of touch with his daughter. Yet in the mid 1940's we see a completely different Hugo. Mystery surrounds what went on in that small village during the war, how did Hugo and Sofia not end up together? The town has one story but is that correct? Joanna finds welcome from some in the village but not from others. Her hostess is lovely and soon has her sampling all kinds of wonderful Tuscany cooking. Yet there seems to be something not quite right going on, a bad force at work. While Joanna finds the son of Sofia still alive - Renzo, it takes awhile for him to warm to her, however soon they are working together to find the answers Joanna is seeking about her father and his cryptic note he tried to send Sofia.I enjoyed the Tuscany setting and the description of the food and people. Sofia was a warm, courageous young woman, Hugo a man changed by her, Joanna a daughter kept somewhat at arm's length but still with a connection to her father, that makes her determined to find out what went on here in San Salvatore during the war. And the day of reckoning for some is about to take place."}, {"userName": "Cynthia", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/1802440-cynthia", "userReview": "Genre wise this Tuscan Child is a blend of mystery, romance, and general fiction. The setting is stunning set in a fictional town called San Salvatore in northern Italy the action pivotal between 1944 and 1973 and between a gunned down RAF pilot and his daughter. At first I was more intrigued by the WWII story but as things progressed and the mystery heated up I enjoyed the daughter’s tale also.I can’t say the conclusion was as enticing as the rest of the book but the story zips along so pleasantly that hardly matters. Bowen touches on not only WWII but also art and artists, Nazis, Italy, and cooking that you can almost taste through the pages. Her strongest skill was the setting of post war England and its crumbling class system and Italian culture and the beauty of the area. The two create a nice dichotomy both in time and traditions.Thank you to the publisher for providing an ecopy.3.5/5 stars"}, {"userName": "Stephanie Anze", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/27117957-stephanie-anze", "userReview": "When Joanna Langley is cleaning out the house of her father after his unexpected death in the English countryside, she comes acrosss a sealed letter. Having beeen stranged for a few years, Joanna realizes how little she knew about him and his past as an English airman in the RAF. The letter is adressedd to Sofia Bertoli and in it there is information that unsettles her. Not being able to contain her desire to know, Joanna takes off to the village of San Salvatore, the address on the envelope. In her attempt to find the truth about her father, she will embark on a personal journey of her own.I love the premise of this novel. The cover is beautiful. A mix of a historical book with romance and some mystery, this seemed like a book that I would love. But alas, I do not. With a dual narration, that of Joanna and her father Hugo, this novel takes place in 1973 and 1944 respectively. Hugo Langley was a pilot for the RAF and while flying over Tuscany, his plane was hit. Hugo managed to save himself by jumping off with his parachute. But he sustained a serious injury upon landing in a German-controlled area. Luckily for Hugo, he was found by Sofia Bertoli, a local woman who then comes to his aid and helps conceal him. Growing up Joanna knew his father was in the war and was able to return back home but she never knew the details. Thus as Joanna heads for San Salvatore, she hopes to learn of this facet of her father. Once in the village, she meets an array of characters, from the kind woman who rents her a room to the man that seems to control the whole village with his money. While everyone denies having known about her father, Joanna feels something is off. This notion is futher reinforced when a man is found dead. In the end, this book was nice but not outstanding. There was just something missing. Even with a murder, there was a lack of suspense. I had a hard time believing that events unfolded in the time frame and order in which they did. And the ending? It was just too neat and perfect. Again, hard to believe. The characters were one note and predictable. I did find all those Italian and English countryside vignettes lovely and the food descriptions were a nice touch. I found myself really craving risotto and stuffed zucchini flower. As a historical novel though, it did not deliver. It was not memorable for me, this book. I read quite a bit regarding WWII and this novel was underwhelming."}, {"userName": "Janelle", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/20742472-janelle", "userReview": "Thank you so much Little Bird Publicity and Lake Union Publishing for providing my free copy - all opinions are my own. I thoroughly enjoyed this novel as it is a quick and easy read with two very compelling storylines. The chapters alternate between Hugo’s life in 1944 as a bomber pilot, and his daughter, Joanna, dealing with the aftermath of his death in 1973. Joanna is sorting through her estranged late father’s possessions when she comes across a mysterious letter addressed to a woman named Sofia in San Salvatore, Italy. The letter gives Joanna a glimpse to a side of her father she’s never known so she decides to take a trip to Italy to understand her father better by revisiting his past and possibly finding Sofia.The novel is a perfect blend of historical fiction, mystery, and romance. Above all, the best part of this reading experience is Italy itself. One of my favorite aspects of reading historical fiction are the vivid descriptions of beautiful settings and this did not disappoint. The story is atmospheric with rich, warm, countryside vignettes, and descriptions of Italian culture. Bowen writes a wonderful story with great character development that kept me engaged. My only issue is with the ending. It didn’t quite work for me, but overall I enjoyed the story."}, {"userName": "Cindy Burnett", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "I love the Lady Georgie books and the last stand alone by Rhys Bowen, In Fairleigh Field. The Tuscan Child was too slow for me, and I just could not get into the story line."}, {"userName": "The Lit Bitch", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/4537892-the-lit-bitch", "userReview": "WWII romances are so my thing, but this book was so much more than just another romance. It’s story about family, loss, children, and life choices. It’s not very often that I find a book set during WWII that is set in some place other than England or France but this was that unique and rare occasion.Rhys Bowen is an experienced author with a couple of impressive mystery series under her belt. I have been lucky enough to read a few of the Molly Murphy mysteries in the past and have grown to love her prose and abilities. Recently Bowen has started writing some stand alone novels set in WWII, I read her first one In Farleigh Field a few months ago and while it had a few technical flaws, I liked that she was trying to make a stand alone book for fans of the historical era.This book sounded similar the In Farleigh Field novel, but different enough to grab my attention and read it. I loved the the novel was set some place other than England or France and I think that the freshness of the location added a lot to the narrative. I loved her descriptions of the locations and landscape. I loved how much of the story took place in the Italian countryside. I haven’t been to Italy but the way that Bowen describes the countryside was exactly how I would imagine it in my mind. I want to visit there even more so than I did before reading this novel. I could almost feel the sun on my skin and all the glorious Italian food mentioned.Another thing that stood out to me was the intricate plot. I wouldn’t say that it was overly complex or twisted, but delicately intricate. I never felt rushed in the plot nor did I feel that it was too drawn out. I loved how the ‘modern’ (1970s) side of the plot fit right into the ‘historical’ (1940s) part of the plot. The relationship between Hugo and his daughter (or lack there of) was dynamic and made the plot more interesting and so much more than just another ‘war romance’. I thought that it added depth and value to the characters. The romance, setting and intertwining past/present stories made the book so moody and a pleasure to read and it hit me in the all the feels.While this book had a lot of romance and romantic elements, I thought it had more than just love and a boy meets girl plot. It had family secrets, a great location with vivid descriptions, likable characters, history, and of course love. It had a so much to like and I think readers looking for something to escape into that isn’t frivolous or over done will find a lot t enjoy with this book.See my full review here"}, {"userName": "Karen", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/17286642-karen", "userReview": "I finished reading the ARC of The Tuscan Child by Rhys Bowen on Thursday night, but I am still in heavy book hangover. This book is one of those rare books that not only sticks with you but that you feel like you lived through. It was undoubtedly brilliant and engaging, and just how Rhys writes it I could see this as a major motion picture with academy award accolaids. I am not usually a fan of historically based cozies, mysteries or stories, at least that was until I discovered everything Rhys Bowen has written. Each book is so rich in history but presented in away that just envelopes the reader. I enjoyed this book in so many ways. The characters are complex and well layered. The setting is unmistakably beautiful even though it doesn't exist you feel like it does. The storyline, mystery and jaw dropping reveal are some of the reasons I could not put this down. This is one of the best reads I have had the good fortune of having on my table and it shall stay forever in my heart. I loved it. The Tuscan Child will be released February 20th. Clear your schedule and turn off your phone. This is a binge read."}, {"userName": "Vicki", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/77001729-vicki", "userReview": "I am a big fan of Rhys Bowen for the Royal Spyness series. But I found this book to be cheesy and cliched. There were times when I rolled my eyes at some of characters and typical storylines. It seemed like the book dragged on for a long time -- right about until the last 2 or 3 hours, when things miraculously fell into place (without much explanation as to how such things fell into place). It also seemed too quick for Hugo and Sofia to fall in love. There wasn't much explanation; just seemed like he fell for her after she started caring for him. Overall, I was disappointed in this as I really love the Royal Spyness series. I kept reading because I wanted to find out how things were resolved at the end, though I did not have strong feelings one way or another because I didn't care much for the characters."}, {"userName": "Karen", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/41376337-karen", "userReview": "I received this from netgalley.com in exchange for a review. In 1944, pilot Hugo Langley parachuted from his plane into the fields of German-occupied Tuscany. Badly wounded, he found refuge in a ruined monastery and in the arms of Sofia Bartoli. 1973, Hugo’s estranged daughter, Joanna, has returned home to the English countryside to arrange her father’s funeral and travels to Italy to discover his past.For me, books written in duo timelines can be a hit or miss. This time, neither timeline was better - or worse - than the other. The story read in ebbs and flows. Highs and lows.3☆"}, {"userName": "Bebe (Sarah) Brechner", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/10381238-bebe-sarah-brechner", "userReview": "This is an excellent, standalone story by the wonderful writer Rhys Bowen. The story is set both in WWII Italy and the 1970s. Bowen is superb at period stories, and in this book, she brings to life the story of a downed British pilot hiding away in the hills above a small Italian village. The more contemporary story follows the daughter of that pilot who is picking up the pieces of her life after her father dies. This is a moody and romantic, and yet realistic, story that is a true pleasure to read."}, {"userName": "Rebecca ", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/5759902-rebecca", "userReview": "A sweet cozy mystery Immensely enjoyed this cozy mystery with elements of World War II history, exceptional food, Tuscany, England, and timeless romance involved."}, {"userName": "Kathy ", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/971945-kathy", "userReview": "Last year, the prolific Rhys Bowen gifted us with a stand-alone book, Farleigh Field. Set in England during WWII, it was a smashing success, and it was just my cup of tea in WWII novels, with mystery and history and shocking revelations. That I had two more novels from Rhys to enjoy last year, too, in her Royal Spyness series and her Molly Murphy series, was incredible good fortune. Well, she has done it again in 2018 with the stand-alone The Tuscan Child, another WWII novel, but set mostly in Tuscany. I knew that Rhys had spent lots of time in Tuscany recently, and I was quite envious, but her meticulous research benefits us all in this new novel, as the fictional village town of San Salvatore comes gloriously alive to our senses while reading this gripping tale. How does this author put out three outstanding books in one year? I suspect cloning, but I don't mind that science would work for my reading pleasures. The novel is told in two timelines, December 1944-Spring 1945 and April 1973-June 1973. The story begins at its beginning, in December 1944. British bombing pilot Hugo Langley is the sole survivor of his plane when he is shot down over Italy by the Germans. Although wounded, he is able to parachute to the safety of an olive tree orchard in the Tuscany area of Italy. Continuing his good fortune, he is discovered by a young woman named Sofia Bartoli, who, at great risk to herself, helps him struggle to a bombed out monastery on a hill above the village. With the Germans occupying the area and Hugo's leg compromising his ability to travel, he is forced to hide in the shambles of the old monastery and rely on Sofia to bring him food and supplies. It is a life and death situation for them both, as Hugo's hiding and Sofia's assistance could be discovered and reported to the Germans at any time. As time passes, Hugo's thoughts of his half-hearted marriage in England turn to thoughts of love for the brave and beautiful Sofia, and Sofia, whose husband has been missing in action for some time, falls in love with Hugo, too. It is a time and place where love is stripped of its class boundaries and impossible futures, and the aristocratic Hugo and Sofia of simple means dare to tempt fate and probability. Fast forward to April 1973, and Hugo's daughter, Joanna Langley, comes home to Surrey England from working on her law degree in London to bury her father, who has died at the age of only 64. Joanna's mother had died when Joanna was eleven, and she and her father had continued to live in the gatekeeper's house where Joanna had been born on the Langley estate, an estate that had to be sold after the war due to death taxes from Hugo's father's death. Upon going through her father's possessions that had been stored in Langley Hall's attic, Joanna discovers an unopened letter to a Sofia Bartoli in Tuscany with a \"return to sender/address unknown\" stamp on it. It is a love letter written after her father returned home to England, and in it Hugo mentions his and Sofia's \"beautiful boy.\" Joanna is thunderstruck at this revelation that her cold, distant father had been in love with an Italian woman in the village where his plane had been shot down during the war, and that here might have been a child from the affair is astonishing. In further examining her father's belongings, she comes across a sketch of a woman and some of his art work that he had never shared with Joanna's mother and her. Joanna realizes that she hadn't really known her father, who had kept himself closed off to her. She suddenly wants to know about the man he had been before he shut the world out, and the only place she feels she can get answers is the Tuscan village of San Salvatore. So, she sets off for Tuscany on a mission to understand the mystery that was her father and see if she possibly has a brother left behind. With Joanna's appearance in San Salvatore, the bulk of the novel takes place in Tuscany, which now gives readers a look at the present-day village as well as the war-torn village when Hugo hid in its hills. The scenery and food are both luscious and engaging. The woman whose place Joanna stays at in the village is a cook from Italian culinary heaven, and reading about the meals she fixes is a wonderful bonus to the story. But, Joanna's friendly, nurturing atmosphere of Paola's house is not the typical reception she gets in this new place. There are secrets that have lasted far too long to be dug up by a nosy Englishwoman. Tuscany is a place of great beauty and time-honored traditions, but it is also a place where the past can deliver a dangerous present for someone disturbing it.I'm a fan of different timelines in stories, but there is a skilled finesse to creating a smooth sync between them. Rhys Bowen does that masterfully. Hugo's story in 1944 and Joanna's story in 1973 need each other to tell a complete story for both characters. The Tuscan Child is a great story in showing how people get to be the people they are, and it's an interesting look at the family dynamics of parent and child, making the point of parents as people before they are parents. The historical aspect of this fictional tale touched upon the interesting aspects of the demise of the great estates in England after WWII and the suffering of the Italian people once their alliance with Germany was ended in 1943. I appreciate historical fiction that spurs you on to learn more, and this story does that. Rhys has long been a talented character creator, and the characters of Hugo and Joanna and Sofia, along with an intriguing cast of minor characters, will stay with you long after the last page is turned. This book will be an easy choice for my 2018 favorite reads list."}, {"userName": "Susan Haught", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/12794004-susan-haught", "userReview": "Mixed Feelings**SPOILERS AHEAD**I saw the book trailer for this title, and the similarities to my own book (A Promise of Fireflies) intrigued me. And I'm a pushover for anything Italian. But as they say, give five authors the same idea and you'll end up with five completely different stories.I enjoyed the historical aspect of the book, but not much detail was given about the German occupation in the area. There was little in the way of the constant fear that must have been prevalent, simply telling what had happened, and the fear of what might happen. I adored the parts about the land, culture, food and wine, but felt at times like I was reading a travel piece or a cookbook written for the Tuscany region of Italy instead of a fiction novel. The dialogue was extremely stilted and at times hard to read, and there was little emotional connection to any of the characters. I felt Joanna's heartache over her recent breakup and loss of her baby was glazed over and never truly resolved. Renzo seemed nonchalant at best over the death of his father--professing to love him and acknowledging he was good to him, yet he was more concerned about Joanna, whom he'd just met, than realizing his father was a monster and his sudden death. I'm sure there's room in his heart for both but it just didn't come across on the page. And the parts about the murder investigation were fairly unbelievable even for a very small town. However, I'm not familiar with Italian law, so I can only surmise that it couldn't have been portrayed as it was (amateurish), and thus unconvincing. I could be totally wrong.The story progressed nicely and I LOVED the dual timelines. I actually enjoyed Hugo's story over Joanna's. Again, however, after a harrowing experience and his return home to near bankruptcy, his home taken from him, and the unopened returned letter from the love of his life, he immediately takes up with the housekeeper with an offer of marriage? No. Just no.Overall, the story was intriguing, lush with description, full of local color, and Ms. Bowen's deft use of dual timelines was very well done. This is what kept me reading. Though I found some things hard to swallow, I would recommend the book for a quick escape into English and Tuscan landscapes, small town culture, people, and food. So much food. With a generous helping of wine."}, {"userName": "Mark Baker", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/4545420-mark-baker", "userReview": "When Hugo Langley dies, his daughter Joanna finds a letter in his possession addressed to someone named Sofia in Italy. It references “our beautiful boy.” Joanna knows her father was shot down in the Tuscany region during World War II, but does this letter mean she has a half-brother? Intrigued, Joanna sets out to learn about that time in her father’s life. What will she learn?This book switches back and forth from Hugo’s story in 1944 and Joanna’s journey in 1973. The chapters are clearly labeled, so it is never hard to follow which time period we are in. While this is not a traditional mystery by any means, we do learn what happened back then and how it plays out in the more “modern” setting. This book is just as much about Joanna’s growth, and she lead a cast of very strong characters I quickly fell in love with as I read.Read my full review at Carstairs Considers."}, {"userName": "Margaret", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/3621970-margaret", "userReview": "I enjoyed The Tuscan Child up to a point. I liked the historical setting of 1944 and the descriptions of Tuscany and Italian food are beautiful. It’s easy reading and the dialogue gives a good impression of people speaking in a foreign language in which they are not fluent. Although I love Italian food I did begin to groan when yet another meal was being prepared and described in detail.But the split narrative between Hugo and Joanna didn’t work too well for me. I liked Hugo’s story more than Joanna’s and I wanted to know what happened to him which kept me reading. But I thought the book was more of a romance than a historical mystery. And I thought the mystery element wasn’t too difficult to work out with rather too many convenient events that revealed what had happened to Hugo.My thanks to Lake Union for a review copy via NetGalley."}, {"userName": "Annette", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/13005524-annette", "userReview": "The book has some interesting parts and some parts where story or dialogue doesn’t move the story forward. It’s stagnant and not interesting. I had to start skipping the stagnant parts in order to continue with the story. But after a few chapters of such reading, I didn’t see a point of continuing to read it."}, {"userName": "Julie Daniels", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/45131882-julie-daniels", "userReview": "I have yet to read a WWII Historical Fiction that hasn't destroyed me by the end or at the very least made me cry. This one was so good and had such a beautiful yet tear-jerker ending! Full review to come closer to release day. Thanks to Little Bird Publicity for sending me an advance copy.Review: When I receive a review copy of a book from a publisher, author, or publicity company, whether it's an advance copy or finished copy(early or released) it usually takes me a week or two to finish what I'm reading and get around to starting it. That was certainly not the case when I received The Tuscan Child by Rhys Bowen. I quickly finished the book I was reading so I could start this one right away. Historical Fiction, mainly WWII-era, is one of my favorite genres. I've been eager to read Rhys Bowen's In Farleigh Field since it came out last year and I'm even more eager to read it now that I've read and loved The Tuscan Child. There really isn't much to say - this is an amazingly compulsively-readable, unputdownable story full of history and heartfelt characters. I've come to love Historical Fiction with dual timelines and this is one of the best I've read. I must note though that this story's main focus is the present timeline POV- Joanna Langley and not the WWII timeline POV-, her father, Hugo Langley. This is more like a present-day story that has flashbacks to WWII. That was the only reason I rated it 4 stars instead of 5. I would have enjoyed reading the WWII-era POV in more detail or even as the main focus of the story. But I loved Joanna and her story though. She was such a sweet person. I loved following her on her adventure. And the food descriptions- oh my! Rhys Bowen did a superb job of transporting me to the Austrian countryside along with Joanna(and Hugo). This book really does have it all - history, food, travel, mystery, and of course Romance with a capital \"R\"! I'm eager to read more from Rhys Bowen and highly recommend picking up The Tuscan Child! You won't be disappointed! *Thanks to Little Bird Publicity and Lake Union for the ARC and early finished copy in exchange for my honest review*"}, {"userName": "Brenda", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/4189643-brenda", "userReview": "This was a really charming dual-timeline historical fiction that takes place partly in late 1944 WW2 Italy, and part in the early 1970's. The author did a masterful job at delivering the tension that we would expect with the pilot being shot down, injured in the crash, and the constant fear of being discovered by Germans (both when he had just crashed, and then later the heightened fear when a local woman risked her life to bring him food and care for him). This tension was presented in a realistic manner without being heavy-handed. I also very much appreciated that the author allowed a romance to blossom between Hugo and Sofia without feeling the necessity to make it all about sex.The 1970s portion of the book was equally engaging as I quickly got to know and like Joanna. I could relate to her guilt and regrets over not having a better relationship with her father, especially once she got to understand more of what he went through in the war. There is a little mystery with Joanna that I found intriguing - the \"reveal\" on what happened with Adrian was wrapped up a little too rapidly, but at least it did provide some context in what was going on with her life that had caused other challenges.I found it slightly unrealistic that she learned enough Italian in just a few weeks of a course to travel to Italy and be essentially fluent (except for dialect or very fast talk or unusual words) as I think it generally takes much longer than that to get to that level of fluency. But that was a minor sticking point in what was otherwise a very enjoyable book.This is not a historical fiction book that will necessarily drive you to learn more about what really happened in this time and place, but it is a good, fast, clean read with minimal foul language, sex, or violence. Very refreshing in that regard.Thanks to #NetGalley, the author Rhys Bown, and the publisher Lake Union Publishing for providing me with a free digital ARC of this book in exchange for an honest review. It was a distinct pleasure to read this book."}, {"userName": "Alona", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/10731908-alona", "userReview": "3.5 stars.First, a warning:You’ll want to jump on a plane straight to Tuscany while reading this book, AND your mouth will literally water and you’ll constantly crave Italian food!I want to go on a cooking course in a Tuscan villa NOW!This book is lovely.It’s a story of a WWII lost love.1944: Hugo, a British pilot, is shot down over a small village in Tuscany. Sofia, a young Italian woman, hides him from the Nazis and help him survive his injuries.1973: Joanna, Hugo’s daughter is traveling to the little village where her father’s plane was shot down, to try and find out what happened to him there, before returning to England and marrying her mother.The WWII story, and the love story is actually , IMHO, a setting to the story of Tuscany and Tuscan ppl. Their characters their land and their food. 3.5 stars for the story, rounded up to 4 for the atmosphere.It was magical to me!"}, {"userName": "Lynn", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/8644428-lynn", "userReview": "It's 1944, and a British fighter plane has just been shot down over Italy, forcing the pilot to parachute to safety. His leg is severely damaged, and he looks for somewhere to hide. A local woman, out gathering mushrooms, comes to his aid and he is able to survive. The Germans are everywhere, and life is incredibly perilous.\tIn June, 1973, his daughter Joanna travels to Italy to search for \"the beautiful boy, hidden where only Sofia and Hugo could find him\" mentioned in an old AirMail letter. Presumably a brother? But when she arrives, the village closes ranks and, to a person, they deny that a British airman was shot down in their area. Really? Seriously? Yes, they say that Sofia left the village with a German soldier. Not a Brit. So, what's the secret they are all keeping, and why?\tThis is a pleasurable read with a very, very interesting ending.I read this EARC courtesy of Edelweiss and Lake Union Publishing. pub date 02/20/18"}, {"userName": "Sarah", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/33969072-sarah", "userReview": "4.5 stars, this was really good!  The Tuscan Child is the first Rhys Bowen book I've read outside the Royal Spyness series, so I wasn't sure what to expect. It's certainly very different than that lighthearted, funny series, but it was really lovely. I was engrossed in the mystery and romance of it all, and it made me want to go buy a plane ticket and visit the Italian countryside immediately. Highly recommended for historical fiction fans, especially if you enjoy mouth-watering descriptions of Italian food."}, {"userName": "Tammy", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/1004125-tammy", "userReview": "The Tuscan Child is a wonderful blend of mystery, long buried secrets and romance set toward the end of WWII. The story is told in the dual view points of Hugo in the 1940's and his daughter, Joanna, in the 1970's. I was quickly pulled into the story and had a hard time putting it down. This is the first book by this author that I have read and I will be checking out her other works."}], "description": "From New York Times bestselling author Rhys Bowen comes a haunting novel about a woman who braves her father’s hidden past to discover his secrets…In 1944, British bomber pilot Hugo Langley parachuted from his stricken plane into the verdant fields of German-occupied Tuscany. Badly wounded, he found refuge in a ruined monastery and in the arms of Sofia Bartoli. But the love that kindled between them was shaken by an irreversible betrayal.Nearly thirty years later, Hugo’s estranged daughter, Joanna, has returned home to the English countryside to arrange her father’s funeral. Among his personal effects is an unopened letter addressed to Sofia. In it is a startling revelation.Still dealing with the emotional wounds of her own personal trauma, Joanna embarks on a healing journey to Tuscany to understand her father’s history—and maybe come to understand herself as well. Joanna soon discovers that some would prefer the past be left undisturbed, but she has come too far to let go of her father’s secrets now…", "title": "The Tuscan Child", "url": "http://www.goodreads.com/book/show/36097619-the-tuscan-child", "average": 4.03, "cover": "https://images.gr-assets.com/books/1507626327l/36097619.jpg", "reviews": 907, "authors": [{"url": "https://www.goodreads.com/author/show/202867.Rhys_Bowen", "name": "Rhys Bowen"}], "type": ["Historical", "Fiction", "Mystery", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/36097619-the-tuscan-child", "http://www.goodreads.com/book/show/36175491-the-tuscan-child", "http://www.goodreads.com/book/show/31287352-in-farleigh-field", "http://www.goodreads.com/book/show/383514.Her_Royal_Spyness", "http://www.goodreads.com/book/show/2241722.A_Royal_Pain", "http://www.goodreads.com/book/show/5981169-royal-flush", "http://www.goodreads.com/book/show/13542533-the-twelve-clues-of-christmas"]}