{"ratings": 50092, "userreviews": [{"userName": "Lola  Reviewer", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "Oh, thank gods, I thought. They’re going to leave me. All I want to do was lie in a dry prickly grass with my feet in a ditch forever. I could be a convenient sort of milemarker, I thought. Get to the thief and you know you are halfway to Methana. Wherever Methana might be.\nThe Thief is a high fantasy with, like any other high fantasy on this planet, a journey the characters undertake. Gen, the main character was a pleasant surprise. While I first thought he was a feminine character, I was proved wrong quite early in the story. Oops! That’s because many have compared this to Graceling and, as we know, that book’s lead character is a girl.But I loved male Gen. I was enchanted by his quick-witted personality and humour. He wasn’t boring or tedious but instead full of surprises and… skills! I liked how he never listened to anyone telling him how worthless he was and how he was someone who would open up to others who earned his trust. His looks were never widely described, which leaved place to some imagination digging, heh! As for the plot itself, it was long, slow and eventless. The only things that really saved it were the ending, which held many secrets and Gen himself… because he was that charming. Now I remember why I don’t read tons of high fantasy books. Oh well.I feel like the author wanted to create a special world building filled with history and linked to the background of the characters, but it failed miserably. It’s all about the GODS people believed or did not believe in… Who they were… How they became gods… But I wanted to know more about the people themselves, the places and the kings and queens. On a side and possibly spoiler-ish note…I’ll have to admit I was really disappointed when I discovered that Gen was not gay… because there were TONS of signs throughout the story! Clearly, I thought he would end up with Sophos. Every time Sophos blushed… Every time Gen touched him… THERE WAS A CONNECTION BETWEEN THOSE TWO. Grr."}, {"userName": "Tatiana", "userReviewDate": "Dec 08, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "[ (hide spoiler)]"}, {"userName": "Emily May", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "[the title of the series? I noticed that early on and began to wonder... (hide spoiler)]"}, {"userName": "Mary ~Ravager of Tomes~", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/1452829-mary-ravager-of-tomes", "userReview": "Gen is a thief. The story begins with him being rescued from prison by the King's Magus in order to help him steal an object of political power that is so historically obscure it is almost considered a myth.So there's a lot I didn't enjoy here.To begin with, this book is mostly composed of a very, very, very long travelling sequence. Now, I should take this opportunity to point out that I don't dislike journey stories. In fact, one of my all time favorite novels is The Lord of the Rings, which is, at its core, a massive journey.The problem with this book is that nothing even remotely interesting happens while our characters are travelling. Somehow a relatively short 280 pages ends up feeling more like 2800 pages while trudging through scene after scene of riding on horses, campfire chatting, and bickering.It was over halfway through the book before I really distinguished between all the side characters that weren't the Magus. And of course I had the unfortunate experience of accidentally imagining the Magus as Governor Ratcliffe, aka this guy:So yea. That was.. not the book's fault but it was certainly interesting. Anyway, once I finally had a firm handle on who everyone was, I realized they're mostly stereotypical in nature. Angry, masculine rival. Soft, young apprentice who isn't good with a sword. Tough, stoic guardian. Eh.I suppose it's important to remember that this was published in 1996, and so these stereotypes were probably a lot less abundant at that time. This definitely doesn't read like a modern Young Adult book, but this doesn't change the fact that my experience with these now is no more welcome than it would be reading a book published more recently. The dynamic between the characters is even confusing for me. I have no idea how I'm supposed to feel about Gen or the Magus because their statements & actions are just a slew of contradictions.One minute they're all messing around, joking, the next characters are threatening other characters with actual, physical violence. One minute Gen is at the complete mercy of the Magus, the next the Magus is allowing Gen to contradict his mythology stories without reprieve. Gen even points out the Magus' inconsistency so honestly, I'm just now sure how I'm supposed to view these characters.Speaking of mythology, this book spends a lot of time exploring mythological characters of the realm & telling their stories, and much less time than I would've liked expanding the world. These sections of the book come off very info-dumpy, and I could feel myself zoning out whenever they would pop up. Honestly, I can only think of one scene where I chuckled near the beginning of this boring trudge of a book. Otherwise, I spent most of the time hoping it would be over soon.Relieved to finally make it to the end of this story, I was planning to stick it with a 1 star & forget about it. But then something interesting happened.The twist at the end practically flips this story on its head, contradicting everything you may have thought about it up to this point. It's almost a brand new story which is the ONLY REASON I am considering continuing the series. I'm not 100% sure I agree with a twist like the one presented here. I'm not clear how it works, to be honest. It seems contradictory on many levels, but I'll definitely give it points for originality.This twist brought the book's rating up a bit for me. It doesn't make up for how hard the rest of the of it is to get through. 2 stars it will have to be, but I'm kind of excited to see where the story goes from here because it feels like a fresh beginning.Read this with the gorgeous miss Kaylin! ♥"}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Mar 25, 2015", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "[Alright, so I know that 90% of my friends seem to have found out the truth about Gen, but I... didn't. I knew there was a twist, but to my delight, my hypothesis proved to be utterly wrong : I thought that maybe, Gen was a girl?? And I know, I KNOW, there are scenes where he strips down, but I could always convince myself that he could hide it, one way or another. Crazy, right? *awkward giggle* Even Sonos's reactions - when he acts so surprised that Gen's dad wanted him to be a soldier - fed my delusion XD (hide spoiler)]"}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "$1.99 Kindle sale, Jan. 22, 2018. One of my favorite YA series EVER, with just a touch of fantasy to it. Stick with it through at least the first three books and I promise you won't regret it. Avoid spoilers.Review originally posted at Fantasy Literature. Megan Whalen Turner’s award-winning 1996 YA fantasy The Thief, set in a fantasy world that has very strong echoes of ancient Greece, follows the adventures of Gen, the eponymous thief, as he is yanked from a filthy prison cell to go on a journey with a group of four men who hope to steal an unnamed object. The magus, who is leading the group, is the only person in the group who knows what they are searching for and where it is hidden.In honor of the deep importance of mythology and the panoply of Greek-like gods in the tale of The Thief, several Greek gods and goddesses have graciously agreed to make guest appearances in this review, to add their brief thoughts and opinions regarding this book. \nARTEMIS: “Actually, when you think about it, the whole plot of The Thief revolves around a hunt. Okay, it’s a hunt for a hidden object, not a wild beast, but still. It’s really quite fascinating.”Gen spends most of the lengthy journey recovering from his months-long stay in prison, whining about their current conditions and the limited food, and sassing the magus and other members of the group. Although the journey is a rocky one, in more ways that just one, gradually Gen begins to gain respect for most of the group, and they for him.\nPOSEIDON: “The role of the river Aracthus in protecting the treasure was a high point. But the story needed more bodies of water and less wasteland. Sea of Olives, pfft. Poor excuse for the real thing.”The characters are well-drawn and believable, with intriguing layers.… Ambiades was not going to move a step at the request of a worthless and insolent petty criminal. Ambiades, I realized, was the kind of person who liked to put people in a hierarchy, and he wanted me to understand that I was at the bottom of his. He was supposed to treat me politely in spite of my subservient position, and I was supposed to be grateful. For my part, I wanted Ambiades to understand that I considered myself a hierarchy of one.The tale of their journey is also interspersed with mythological tales of their world, such as the creation of the earth and birth of the gods, which give additional depth to the overall story.\nARES: “I liked the sword fighting and the importance of the art of war in the plot of this story. Recognize! Too bad most of the fighting scenes were so short. But the conflicts between the countries of Sounis, Eddis and Attolia! Yeah, that has potential.”The first half of this book is somewhat slow-paced, as the group journeys to their destination, but once they arrive the pace quickens and the plot takes some unexpected and fascinating turns. The Thief has joined the list of my favorite YA fantasy novels.\nAPHRODITE: “Why does the most beautiful woman in the book only make a brief appearance? Where is the love?” *pouts*The Thief is the first book in a series of five books, with possibly more books to come, but can easily be enjoyed as a stand-alone novel. By the end of the book, I was a huge fan of the characters and of Megan Whalen Turner. I’ve bought all five books in this series and will probably automatically buy anything else she writes. THE QUEEN'S THIEF series shouldn't be missed by anyone who enjoys YA fantasy. In fact, my favorite book in the whole series is the third, The King of Attolia.\nHERMES: “I love how Eugenides, the god of thieves like *ahem* yours truly, is worshipped and honored by the main character. And did you notice how Eugenides doesn’t have to do any of the messengering crap? How about that, there, Zeus? Best book ever!”4½ stars, and a big \"thank you\" to my guest reviewers!Reread July 2015 with the Buddies Books & Baubles group."}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "This felt like such a classic fantasy novel. You know those 2005-era books about journeys that you liked for some inexplicable reason? Yeah. That kind. Except with really good worldbuilding and a lot of potential built up.This novel follows Gen, a thief hired by a magus of Sunis to find a stone that gives the holder the right for rulership of Eddis. ➽Sunis - the king’s county, attempting to take over Eddis➽Eddis - the country across, a country they must overtake➽Attolia - a country lying in between, over which they must journey➽Mead - a threatening country across the sea.There’s clearly a lot of interesting potential set up in the worldbuilding realm, and I have a feeling things will get intense and political by the end. While the characters aren’t my favorite ever, a few have serious potential. Sophos is a really sweet character I wanted the best for. (Am I the only one who spent around eight pages thinking him and Gen would be a thing?) The magus is a character I started out hating and ended up sort of liking. Gen, our lead character, has a sarcastic sense of humor and a somewhat duplicitous narrative that made him easy to love. Something that stood out to me here was the subtle discussion around classism, the mage’s belief that Gen is lesser because he is an immigrant. Some of the things he said about Gen’s culture – the comments about how he knows Gen’s culture better than Gen’s mother did.My biggest thesis statement about this book - my most overreaching opinion, if you will - is that this book is an extended prequel to what promises to be an intriguing series. And not to offend anyone, but honestly: isn’t that every first book in every good series I’ve read in my life? I’ve heard a lot that the sequels to this get better, and I totally believe it — the worldbuilding here is so complex, so intricate, that a mediocre first book is almost needed to build it up. You can’t go straight to the climax - you have to go for the basic premise first. Hey, I’ve always said that middle book syndrome is a myth and the middle book is usually better than book one in good series. And I stand by that. So everyone agreeing with me for once is actually totally nice. Overall, while I didn’t think this was the most stunning book ever, I’m super excited to continue on. Blog | Goodreads | Twitter | Youtube"}, {"userName": "Keith", "userReviewDate": "Nov 07, 2008", "userURL": "http://www.goodreads.com/user/show/1290678-keith", "userReview": "This was another book my wife insisted that I read. It was our before-bed read aloud book last month.Reading 10-15 pages a night, the first half of the book was enjoyable, but unfolded rather slowly. I was a bit puzzled about why my wife was so enthusiastic about the book. Then, about half way through, the excitement and tempo increased a few notches, and it become a real page-turner.This is a fantasy novel, but it is not your typical swords and sorcery adventure. There are swords, and even a couple of fights, but the closest we get to sorcery are some mysterious occurrences that could best be described as super-natural. Turner's alternate reality evokes the feeling of Greece. The landscape is rocky, somewhat mountainous, and filled with olive trees. The \"old\" religion has the feeling of Greek mythology although the divinities are mostly different. And the political backdrop is a set of small rivalrous kingdoms that could be stand-ins for the city-states of ancient Greece. The story is told (first person) by Gen, a thief who opens the book imprisoned in the kingdom of Sounis. He is freed by the King's Magus---a wiseman-type councilor---who needs a skilled thief to help him recover a lost artifact. They set out on this expedition, accompanied by the Magus's two apprentices and a soldier. In the first half of the book, we slowly get to know the characters through Gen's eyes, and learn something of the world where this story is set. Turner does a good job developing and describing the mix of relationships between the members of this quest---rivalries, respect, jealousy---and as we get to know the characters better, it becomes apparent that there is a bit more to each of them than meets the eye. Midway through the book, just when it seems that the entire plot is going to be character-driven, the tempo increases dramatically. There are fights, escapes, chases. Amongst this action there are still the puzzles of characters whose motivations we don't entirely understand---including our narrator, who carefully hides a few secrets of his own until the end. All-in-all, a well-told story, with a good combination of plot, characters, and an interesting setting.Once again, my wife picked a winner. I should pay more attention to her recommendations."}, {"userName": "Bibi", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/33411728-bibi", "userReview": "Yes, it starts off slower than molasses. Yes, you will be perfectly misdirected by Ms Turner. Yes, you will wish to set it aside for these reasons. And all I can say is, Don't. Persevere.Because you absolutely need to read this book in order to get to the sequel, The Queen of Attolia, which is one of my fave books as well as having one of the best male protagonists of all time. Seriously, I love Gen to bits.Read this series."}, {"userName": "Iryna (Book and Sword)", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/57236678-iryna-book-and-sword", "userReview": "1.5/5 stars Good riddance!!! I must have read a different book than everybody else had because I cannot for the life of me comprehend how this book has won any literal awards. As an avid fantasy reader I can tell you that this book is as close to a \"riveting fantasy novel\" as flour is to being a spice.Why flour you ask?Beuase it reminds me of this book - dry, bland and boring. ​And I really tried to tie this book all of the chances I could. I wanted to dnf it after 30 pages, but:1. I was told that it gets much better as the book goes on. It didn't.2. I was told that series get much, much better. I still have to see that for myself. One day.3. I scored 4 books from this series at a thrift store for dirt cheap in mint condition, so I wanted to give it a chance before I donate all of them back and forget I ever wasted my time on them. But Iryna, what about that awesome twist at the end? I'm sorry, but that twist? I guessed \"the twist\" pretty early in the beginning of the book. I'm not saying that I'm Sherlock Holmes (okay sometimes I pretend I am), but after reading many fantasy books that twist is not so twisty anymore - pretty standard trick, if you ask me. ​I can sum up about 85 percent of this book in few sentences.​Gen (main character) whines, Gen is tired, Gen is hungry, Gen is being a smart mouth, Gen is hungry, Gen is tired, Gen is hungry. The words \"I'm hungry\" and \"so I took a nap\" were probably said at least 20 times. If you are looking for the world's most annoying fiction character, you may stop now. Gen got the prize (in my eyes at least). The rest 15 percent were taken up with all the action that this book decided to throw at us and some political intrigues. By that point I just wanted it all to be just over so I could move on with my reading life. ​The book is a 280 pages, and it took me 9 days to read it. 9 days! Why? Because I was so unbelievably, out of my mind, ripping my hair out - bored. Was the twist at the end worth the 200 pages of redundancy and absolutely nothing happening? No, no it was not. I know I sound very bitter right now, but I was genuinely excited for this book. And it let me down, big time. I hated the first person narrative, and I loathed Gen as a narrator even more. Side characters were bland, world building was okay at best and the plot didn't go anywhere till the last 30 pages. ​Despite all of this I will (not soon, but sometime) continue with the book 2. I didn't suffer through this for nothing, I will see for myself if the series do indeed get better. My hopes are very low though. Lower than low. Also I looked ahead and book 2 is written in third person, which is an improvement because I don't like first person narration fantasy, BUT who writes first book in first person and then switches to the third person? Who does that? Why?My WEBSITEMy INSTAGRAMMy WORDPRESS BLOG"}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "Buddy read with some friends at \nBuddies Books and Baubles\n\n\nI am a master of foolhardy plans, I thought. I have so much practice I consider them professional risks.\n\nEVERYONE told me not to expect much from this book and to be patient. They said the beginning isn’t very good but the second half is pretty good and the next two books are amazing…so just hang in there. Well I found that to be true and false at the same time.It is true the second half of this book is much more interesting, there is more going on action wise and the last 100 pages just fly by. But the first half isn’t that shabby either if you are paying attention. The only reason parts of it felt a little long are the backstories to the gods feathered in a little like info-dumping. They are interesting lore stories but it is unclear how they fit into the book until later and almost felt like filler while I was reading them. However with Gen the Master Thief there are clues to be found and double meanings to a few things that don’t become clear until the end of the book. I found it to be quite entertaining trying to figure out who/what Gen really is and what his true purpose was. But even if you find the first half a little dull this is a short book at only about 215 pages so it really doesn’t take that long to go through and figuring out Gen’s story is totally worth it. He is a lot of fun to read as he is antagonizing his traveling companions.\nWhile we ate, I picked at the magus. I liked to watch him lose his temper and then regain it when he remembered that I was supposed to be beneath his contempt.\nI did guess quite a few things about Gen correctly, but I also guessed just as many wrong so there were still some surprises to be had and enough interest generated about the three kingdoms in the story that I’d be interested in continuing.Even though this book is listed as MG/YA it didn’t really read that way and I hear the later books are more adult than this one. Overall a really quick fun read that had action, mystery, betrayal and a few unexpected surprises that made it all the more interesting to read."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "I'm glad I heard that the sequels are better because I'm not sure I would've finished this otherwise. It's a decent high fantasy world with good writing, but the first half of the book is pretty slow. Gen basically gets out of prison, takes a bath, eats some oatmeal, and travels foreverrrr. The story also spends a lot of time establishing the gods... but it does pick up a bit by the end.So it's kind of slow and not particularly engaging, but that doesn't matter too much since it's a short read! I'll probably check out the sequel someday now."}, {"userName": "Jean", "userReviewDate": "Mar 13, 2008", "userURL": "http://www.goodreads.com/user/show/951107-jean", "userReview": "A thief sprung from jail to help a Magnus steal an ancient treasure, warring kingdoms, political intrigue, sword fights, narrow escapes,a mythology invented especially for this fictional place, and a quest--everything, it would seem, to keep me reading. So I am wondering why I so disliked this book that I had to force myself to keep reading to the end. I think I hit upon the answer spoken by one of Turner's characters near the last weary lap of the book: \"Oh, fine,\" I told him...but I didn't really care. I didn't care much about anything...\" And that is my experience with this book in a nutshell. The characters never matter to me. Gen, the thief, is so arrogant and obnoxious in playing his role that I could really care less about whether he succeeds. And the other characters are never really fleshed out enough for them to matter to me either. By the end of the book when the identity of the thief is finally revealed I began to have moments of interest, but not enough to be anxious to read the sequels."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "May 21, 2009", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "What do you do when you want to gain possession of something that's nearly impossible to obtain? You hire a thief who can steal just about anything.Gen has no disillusions about his abilities as a thief. He's actually named after the god of thieves, Eugenides, as a matter of fact. While his father wanted him to be a soldier, he knew that was not the life for him. Instead, he honed his skills at stealing, until he was one of the best in the land. Too bad he did a little too much bragging about stealing the King's seal and ended up in jail. He's approached by the King's magus and offered a proposition, steal something for the King, and he'll be released from jail. If he refuses, he'll simply disappear (not in a good way). It's not a proposition an intelligent young man would say no to. So begins this story.Gen is one of those characters that I couldn't help but enjoy. His irreverent, jaundiced, but very insightful view of human nature insinuated him into my affections. I like that kind of humor, so I tend to gravitate towards main characters like Gen. From the beginning, I knew he was a thief, but that didn't make him unlikeable to me. Instead, I wanted to find out what made him tick, and I was rooting for him to come out of this story for the better. I liked that I saw some character growth in him as this story progressed.The Thief is a story set in an alternate world in which various gods hold the devotion of the populace. I liked how part of the story was hearing the tales of the gods who made this world; and those stories are very smoothly integrated into the plot, playing a crucial role in the narration, characterization, and the unfolding of this story. Reading the extra material at the end of this novel revealed Ms. Turner's thought process. I could see a heavy Greek mythology influence, but there were unique elements about the pantheon and the story-telling that showed the author's specific vision. There are also aspects that surprised me, in that the gods actually play a real role in this story. I liked how the fantasy elements didn't dominate, but the focus is Gen's character and his quest to steal something that has the potential to affect three kingdoms in this novel.There was an interesting twist towards the end that I was not expecting at all, and I always give my respect to an author who can do that, and surprise me. I'm not a jaded reader, by any means, but I read a lot, and I've seen a lot of common plot devices; so a writer who can throw me a curve ball is always appreciated.I have to say that this Newbury Award Winner did impress me. It's one of those stories that doesn't try to go elaborate, but has a richness that won me over as a reader all the same. Fortunately, this is part of a series, so I can look forward to more adventures in this interesting world."}, {"userName": "Kaylin (The Re-Read Queen)", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/47627265-kaylin-the-re-read-queen", "userReview": "2 Stars and a mini review because I am the worstCons:- Super straight forward writing style that was unbelievably boring - Forgettable plot- Forgettable characters - An MC who doesn't take things seriously but also isn't funny Pros:- The last three pages- seriously they make it seem like this book was one really long prologue Overall:*shrugs* 🤷🏻‍♀️ Read with my split-soul, Mary! 💖 (I will tag when not on mobillleeee)"}, {"userName": "Lois Bujold", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/7672661-lois-bujold", "userReview": "Having dutifully tried a few new things to my lack of satisfaction this past week, I turned instead to an old favorite that I knew would be a pleasurable read. This is a book that re-repays a re-re-read, not only soon, but after finishing its sequels once they widen one's view of its world and characters.There is not too much one can say about The Thief that is not a spoiler, and this is a book that should NOT be read with preconceptions. Set in an alternate fantasy world loosely inspired by Greece both ancient and medieval, it opens with a bedraggled young thief, Gen, being plucked from the king's prison in Sounis to accompany the king's magus on a peculiar quest, for which his talents will be needed. Written as a first person memoir in Gen's engaging voice, it is classified as YA, and was a Newbery Honor book when it first came out in 1996, but really, I mention this mainly to make the book easier to find in a library or bookstore. Simply written but never simple.Trust me. Just read it. Then read it again, because it will not be the same river twice.It has at this time three follow-ups, The Queen of Attolia, The King of Attolia, and A Conspiracy of Kings, of which my favorite is The King of Attolia. These should be read in strict order for the best and most delightful effect and to avoid big honking spoilers.I do wonder, idly, if Turner has been unduly constrained in further development of the series by the book's YA-market origins. It seems to me further expansion would require shifting to adult-market fantasy as the main characters age out of YA parameters, which would be tricky but not impossible to bring off. If it were to be kept YA it would almost have to jump to the next generation, which also has possibilities, but may not be where it (or its writer) wants to go. Ta, L."}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "This book seemed promising but I ended up a bit underwhelmed. I'm still planning on continuing the series since it apparently gets better!"}, {"userName": "Riley", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/23179211-riley", "userReview": "3.5The second half of the book totally made up for the slow start. I am very intrigued by this series now"}, {"userName": "Kaya", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/15462098-kaya", "userReview": "I can't say this book is bad but it isn't great either. Boring interactions and dull protagonist with the plot I couldn't care less about. Nothing even slightly exciting happens. The start reminds me a bit of \"Throne of Glass\" series and that's the only good thing about this book. I'm not even a big fan of Throne of Glass.A thief named Gen got out from jail in order to help a Magus steal an ancient treasure. When the identity of the thief is finally revealed I was occasionally interested in the plot, but not enough to care. Gen had been locked up because he bragged too much about stealing the King’s seal. Gen has his own agenda. All that mythology was bland as hell too. I got through the first 100 pages with hope it'll get better, because I was told it would. The writing style was too factographic and lifeless. I wasn't interested in the world setting and didn't like any of the characters. I won't be coming back for the sequel, definitely. I couldn't connect to the characters and the whole time I was waiting for something to happen, but nothing essentially did. Suddenly I was at the end with poor excuse for a plot twist. This book has a very slow pace with almost non-existent plot. They've started their journey, and then traveled, and traveled, and traveled. And yes, you guessed it - they traveled. Maybe I should've found the banter interesting, but I didn't. I started skipping it at some point. Gen is obnoxious, underdeveloped, uninteresting and annoying. He's like a male version of Celaena Sardothien. His brilliancy didn't do much for me. He's so arrogant in playing his role that I really lost interest in whether he'll succeed or not. He tried so hard to be sassy and witty, but none of it had any impact on me."}, {"userName": "Lara", "userReviewDate": "Nov 20, 2009", "userURL": "http://www.goodreads.com/user/show/309689-lara", "userReview": "I'm giving up on this one. It's not BAD, just...excruciatingly BORING. To me, anyway. I found the main character obnoxious and all the other characters underdeveloped and uninteresting, and over half way through the book, nothing's really happened--they've started their journey, and then traveled, and traveled, and traveled, and traveled, and traveled, and...you get the picture. I've heard really good things about this series, and maybe at some point in the future I'll give it another try. But I have too many other books that look far more exciting than this one has been, so I'm moving on to one of them."}, {"userName": "Emma", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "Well written story and enjoyable in a meandering way. I enjoyed the mythology woven into the story. Gen was an engaging unreliable narrator."}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "Me : I need to stop with that obsession with The Queen's Thief series and Eugenides.Also me : *downloads the first audiobook on Audible*Really though, I had no idea that Steve West narrated this book! Is it reason enough to listen to this less than a week after having read the book?  Absolutely. My review of the novel : here"}, {"userName": "chandler ainsley ❁", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/48727754-chandler-ainsley", "userReview": "on pausehope this book steals my heart (lol wow please ignore my horrible puns). buddy read with sofia!"}, {"userName": "Morgannah", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/6241201-morgannah", "userReview": "3.75 StarsI enjoyed The Thief for the most part even though it took me a while to fully immerse myself in the story. There was never a sense or urgency and for the first 100 pages or so I was bored. So bored in fact I put it aside and read 4 other books in the meantime. Most of my friends here on GR say the series gets better and better with each book so I finally finished it in hopes that subsequent installments would be better. I am certainly glad I did because the last 80 pages of the story were absolutely enthralling and brilliant. I think the author is the real thief here. She almost lulled me to sleep then snuck up on me and delivered a surprise ending I had no way of seeing coming. I will definitely be continuing on with the next book."}, {"userName": "Phee", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/26480778-phee", "userReview": "Okay, so this was my third attempt at reading this book. But I finally did it!! I don’t know why I struggled so much the first two times, I mean the book is less than 300 pages. But for some reason I just couldn’t get into it before. I thought I’d give it one last attempt and I downloaded the audiobook to help me along, which was fantastic by the way. Now you may look at my rating and assume that I didn’t much care for it. That’s not true, whilst it did have its problems I did actually really like this book. My rating is more of an rating of overall experience and I am trying to be a bit harsher in my ratings this year. Firstly I’d like to talk about the world. The world in this book is heavily influenced by Greece and Greek myths. Lots of kings, queens and Gods. I really enjoyed the overall feel of the world and the way the author built the world for the reader. Most of the world building was actually done in the form of characters telling stories. Which was really interesting. They would literally sit round a campfire and tell the stories of the old Gods and the myths attributed to them. This is where the Greek influence comes into play. I loved learning about the gods along with the other characters and I really appreciated the clever way the author used storytelling in the book. I gave me Iliad feels and you all know I adore that. Another thing I simply adored in this book was Eugenides himself. At first he was quite whiny and annoying. But he quickly becomes easy to love. By the end I was quite smitten with him to be honest. Gen was humorous and charming and when he was annoying the Magus or other characters he had me in stitches. Over the course of the book you come to some realisations about Gen, and his sometimes strange actions/reactions make sense once you realise that every single thing he does, he does for a reason. He is terribly clever. Simply put, there is very little I didn’t like about him. Now then, the parts that weren’t quite so good. The plot, whilst interesting, was completely predictable for me. I had guessed how it was mostly going to play out by the time the characters reached the first inn. But I shan’t spoil anything for those of you that haven’t read it or figured it out. Whilst it was very predictable it was still enjoyable. The characters and storytelling really helped keep my enjoyment levels up whilst reading. Despite guessing the ending it was still very satisfying to see all the revelations made and get some answers to questions I still had. I was feeling the same as Gen, waiting to see the shock in the other characters faces. But nonetheless, it’s hard to really enjoy a plot you can see straight through. I also think the pacing was all over the place. It started off fine, then drags towards the middle, then got better then wavered again. You’d think you were getting to an exciting part and then everything would crawl to a stop. The best bit was the ending and it zoomed through it. Which was a shame. Forgot to mention that I loved the audiobook. The narrator, Steve West had a great voice. It suited Gen perfectly and I think I’m going to have to listen to the rest of this series on audio. All the other characters were distinguishable from each other and he put on different accents for people from different places. I’m going to look out for more audiobooks narrated by Steve. I’m glad that I have finally managed to make my way through this book. I already own the second book which I shall be starting soon as I’m very interested in seeing where the story is going to go. The seeds of a very political story were planted in this book and I am very curious to see how they grow. I love my fantasy novels to have political elements so I’m hoping this will satisfy me in that regard. I also want to see what our Thief will do now."}, {"userName": "Kay", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/5611008-kay", "userReview": "This book was okay. On one hand, I can't deny that Megan Whalen Turner is a great writer. Her command of the English language, especially her rich descriptions of a pseudo-Greek landscape, is superb. On the other hand, I found the story very slow up until the very hasty end, and the ending felt a bit off. I should have known to not let my expectations get out of hand. Reviewers did offer cautionary notes that the next book in the series, Queen of Attolia, was much better. From the book synopsis and the author's writing style, this seemed like a blend of The Lies of Locke Lamora and partially Finnikin of the Rock. An arrogant thief caught up in a larger power game between empires, forced into performing an impossible task, and coming to terms with his own limitations. What's not to love?To be fair, the story was less a swashbuckling adventure with extroverted plot twists, and more a contemplative and slow-moving character study. Most of the book read like a dysfunctional road trip with grouchy and unrelenting dads, uncles, and sullen cousins. The main focus was on the dynamics among Gen, the magus, Pol, Sophos, and Ambiades, with each revealing surprising complexities and individual quirks. Good thing too because once the journey begins all they do is travel, travel, eat, sleep, travel, travel...you get the gist. It’s not until the party reaches the temple that things start to speed up and the plot actually starts to unfold. Secrets are revealed, some more surprising than others, and the book takes twists and turns to end up in a place that I'd never expected. It just takes a while for them to get there.Overall, the book wasn't bad. In fact, for the type of story it was, I'd like to give it more stars for being able to keep my attention for so long. I appreciate the effort put into developing the characters, but the beginning dragged on way too much. Plus, considering how the book progressed, I found the twists and turns at the end erratic. A solid three stars, and recommended for those who like meandering, journeying plot lines. I was, however, impressed with the writing and will be picking up Queen of Attolia soon."}, {"userName": "TheBookSmugglers", "userReviewDate": "Jul 18, 2009", "userURL": "http://www.goodreads.com/user/show/1223249-thebooksmugglers", "userReview": "Full Review LinkIt is safe to say that I spend most of my free time reading. I read three to four books every week, sometimes more. I am very careful with what I choose to read which means that most of the books I read, I end up enjoying at least to some degree. But it is rare, extremely rare, to read a book that falls in that category of Books for Life. You know the ones: those that take over your heart and your mind, that even when you are reading you know that you are experiencing something unique, a connection with a story and its characters (that only serial readers can understand); those that you know will remain with you, forever.I experienced such rapture when I read The Name of the Wind by Patrick Rothfuss earlier in the year, and to my utter surprise and delight, again a few weeks ago when I finally read The Queen’s Thief series by Megan Whalen Turner.This series came under my radar only recently when Angie from Angieville started to blog about the books with not a little amount of excitement. From then on, I started to see more and more people talking about them with such fervor that I thought I should give them a try. And, HOLY GUACAMOLE.I am totally, irrevocably, head over heels in love with this series. I knew I would have to review these books eventually, I had hoped to do so during this YA Month but I also realised that I had a decision to make: I could either review each book in the series separately or I could review the series as whole. The former would naturally lead to spoilers being revealed and since these books cannot, should not be spoiled, I opted for the latter by writing an overall review of the series, spoiler free. This is what I am trying to do here – although I am fully aware that so far, I only managed to basically behave like a fan-girl.But it cannot be helped. I now completely understand the fervor, the excitement that this series inspire. As I was reading the books, as the pages were being turned I had only one thought in mind: this is why I read. THIS is why I read. THIS IS WHY I READ. And it all comes down to one word: Eugenides.Gen, Eugenides is a thief. He boasts that he can steal anything. That lands him in the King of Sounis’ prison where he spends a couple of months until he is offered, by the King’s Magus, his freedom but in return he has to steal something that people don’t even think really exists.This is how the whole thing opens, in The Thief and we are told about this expedition in search of the Gift, by Gen himself, a humorous narrator of this dashing adventure across the neighbouring countries of Sounis, Eddis and Attolia. This person, this ragamuffin, lazy, starved boy – can he really steal anything?But you see, Gen is extremely clever, a fact which the reader and his companions in the first adventure, come to slowly realise. Close to the end of that book, we learn something that is crucial to the entire series – that Gen is actually cleverer than anyone else. And there is something else too, something that makes him important. But that doesn’t matter to us here and now, because what really matters is how amazing Gen is. By the end of book 1, it is impossible not to like the guy or his “voice”.Then book 2 starts, and shock of the shocks. Gen is no longer the narrator – the narrative has shifted to third person with Gen’s, the Queen of Eddis’ and the Queen of Attolia’s PoV. At first, it is almost painful to lose Gen’s narration but then somewhere in the middle of the reading it hits you with a certainty:OF COURSE the narrative has to change.Because this is a different book. It is still the same story but progress has been made. Because now, the destiny of countries is at stake, war is brewing in the horizon between Attolia, Eddis and Sounis. This is a more sophisticated book, it has political discussion , political intrigue, it discusses the role that the Gods play in the fate of men and nations.In the beginning of the series, Gen is a boy. A cocky, impetuous, adventurous, conniving boy. When book 2 starts, something terrible happens (did I say shock of the shocks before? Well, this is even more shocking) that shapes the man Eugenides becomes. A man who has now to steal more than a simple object: he is tasked to steal a man, a woman and peace.The way he does it, takes us back to more twists like in the first book. And we, once again, are surprised by how clever Eugenides is. Even if we expect it by now.Then book 3 starts. Once again, a shock. The book is entirely from the point of view of a character we never saw before. As the book progresses, the certainty hits once more:OF COURSE the narrative has to change.Because this time, this time we KNOW how clever Gen is. But no one else does. Including Costis, the narrator, a member of the Queen of Attolia’s Guard who commits the mistake of underestimating Eugenides. And this is the genius of Megan Whalen Turner because in book 3, we, the readers, are Eugenides’s accomplices. We sit back and wait for the coin to drop for everybody else as it has dropped for us in books 1 and 2. This is about pay-off, about Eugenides stealing respect and a kingdom. And what a story this is.This is a series of books that have deep meanings, hidden clues throughout the story. Where everything matters from the type of clothes someone wears, to the reason behind a pair of earrings being worn at a particular right time, to the declaration of love that the raising of one’s eyebrow is.And speaking of love: there is also romance in these books. It starts towards the middle of book 2 and it takes centre stage in book 3. But not in it a blatant way: the romance is subtle, almost private (especially in book 3) and I am not exaggerating when I say it is the most amazing romance I have read of late. It is unexpected and it is unusual. For starters, Eugenides is shorter and younger than the person he loves. But she is everything he ever wanted and he is everything she ever needed. Because of that, their dynamic is simply awesome and there is no other word for it. And what Eugenides is to his lady is aw-worthy at the same time that it is powerful. This is good stuff, plain and simple.To sum up: I was lost in the world of Attolia and Eddis and I did not want to get away from it. I would be remiss if I didn’t say one last thing: that the female characters in the series are extremely capable, intelligent, strong, and I admired both of then, the two Queens, as different as they were in their personalities, immensely.If you like unreliable narrators, cons, plot twists, political intrigue, character development, mythology, stories within stories, strong female characters and heart-warming romance and above all, a male protagonist that is all kinds of awesome, you should look no further than this series. It is not a perfect series by any means – there is change in pacing from one book to another, and the first book is clearly for a younger audience than the other two books. This is why, in my opinion, they should be read as a collection of books and not individually. I still love them though, flaws and all.At the end of book three, Eugenides has stolen: a gift; a man; a woman; peace; a kindgom. He has also stolen my heart.___________I know how cryptic this overview has been and that I did not provide any real details about the story. I still think you should find them out by yourself by reading the books, but if you want to know more you can read these reviews:Angieville’s: The Thief, The Queen of Attolia, The King of AttoliaOne last word: book 4 in the series, A Conspiracy of Kings is coming out in 2010. It is safe to say it my most anticipated book for 2010 along with The Wise Man’s Fear by Patrick Rothfuss."}, {"userName": "Ashley *Hufflepuff Kitten*", "userReviewDate": "Sep 10, 2014", "userURL": "http://www.goodreads.com/user/show/29787548-ashley-hufflepuff-kitten", "userReview": "Buddy read with Buddies Books & Baubles July 2015Three stars feels a bit generous, but oh well. It was pretty good for what it was. I'll call it 2.5 rounded up.I found the interweaving of Grecian names interesting, although the book could definitely have benefited from having a map in the front pages. Between Sounis, Eddis and Attolia I found myself getting a bit confused about what was where. I liked Gen's selfishness (reminded me of Meda from Cracked) and he just had a cool laid-back sort of attitude. I didn't like Ambiades from the start, and Sophos was interesting. I liked that Gen just dubbed them the Useless brothers, even though they weren't related in any way. I feel like I would have enjoyed this more if I was younger and not coming off the stellar workings of a Tamora Pierce novel. As it is, with this being a 1997 Newbery Honor book, I'm stunned that I didn't read it when I was a kid. My kid favorites shelf upstairs is full of the Little House books, Number the Stars, Julie of the Wolves, Holes, and Island of the Blue Dolphins. Pretty much everything I remember reading in elementary school was a Newbery or Caldecott book."}, {"userName": "Tara ☽", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/26094436-tara", "userReview": "This was a great little adventure fantasy book that I really loved. It was short (coming up to about 280 pages) but the author managed to fill it with world building and mythology and history that I found so fascinating! I've heard that the later books in the series are even better by leaps and bounds, so I can't wait to get to them!Ladies and gentlemen, I would like to formally announce that I have found the new love of my life, and that is Gen. I'm a sucker for the trickster Aladdin-type thief characters with a truck full of secrets, so I think Gen and I were just meant to be. He's like an even snarkier, trickier Han Alister. I can't wait to continue reading Gen's story and follow his future adventures!!I adored how the setting was based in Greek mythology. Some of you might not know this but I am a fucking huge Greek mythology nerd (all stemming from my childhood full of Percy Jackson). The stories of the old gods were both familiar and unique, and I loved seeing where Megan Whalen Turner took Greek mythology and placed her own spin on it. I can't wait to see Gen again when I get to the next book <3"}, {"userName": "Sarah", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/61130478-sarah", "userReview": "Thank you to the Booktuber who recommended this book. I enjoyed this book so very much and look forward to the next book in the series.This book was so well written and truly compelling. It was a little slow at times, but thought provoking. I really enjoyed the dynamic between the characters and how it changes throughout the book. The banter between characters was great. Eugenides was so quick witted and sneaky! He was what kept me reading and kept coming into my thought when I put the book down. I'm starting to have a love hate relationship for authors not telling us all what the main character is up to. I love the twist and turns it can give, really creating the unexpected. However, when I find something out that was kept from me I feel left out, I mean I want to be in the loop! Haha. I'm so ready to dive into the next book."}], "description": "The king's scholar, the magus, believes he knows the site of an ancient treasure. To attain it for his king, he needs a skillful thief, and he selects Gen from the king's prison. The magus is interested only in the thief's abilities. What Gen is interested in is anyone's guess. Their journey toward the treasure is both dangerous and difficult, lightened only imperceptibly by the tales they tell of the old gods and goddesses.", "title": "The Thief\n      \n          (The Queen's Thief #1)", "url": "http://www.goodreads.com/book/show/448873.The_Thief", "average": 3.9, "cover": "https://images.gr-assets.com/books/1427740839l/448873.jpg", "reviews": 5800, "authors": [{"url": "https://www.goodreads.com/author/show/22542.Megan_Whalen_Turner", "name": "Megan Whalen Turner"}], "type": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/448873.The_Thief", "http://www.goodreads.com/book/show/1082753.The_Thief", "http://www.goodreads.com/book/show/30363359-the-thief", "http://www.goodreads.com/book/show/1082754.The_Thief", "http://www.goodreads.com/book/show/34414113-the-thief", "http://www.goodreads.com/book/show/40158.The_Queen_of_Attolia", "http://www.goodreads.com/book/show/40159.The_King_of_Attolia", "http://www.goodreads.com/book/show/6527841-a-conspiracy-of-kings", "http://www.goodreads.com/book/show/8306741-thick-as-thieves", "http://www.goodreads.com/book/show/11921764-thief"]}