{"ratings": 41867, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "May 20, 2012", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "The Knights Templars were founded in Jerusalem in 1118 to protect the pilgrims visiting Palestine at the end of the First Crusade of 1096. The full, original name was \"The Poor Knights of Christ and the Temple which is in Jerusalem\", but the for the sake of this review I will just refer to them as The Templars. \nBy papal decree only The Templars were allowed to wear the cross patee. The red cross is probably the most famous identifying symbol for the order. The Templars because of their austere living conditions and their shrewd lending policies became very wealthy and powerful. Philip the IV of France, a man with ambitions that exceeded his pocketbook borrowed large sums of money from The Templars. When the interest payments became inconvenient Phillip the IV began putting pressure on Pope Boniface VIII to disband the order. \nWELCHER!!!To facilitate this end Phillip went so far as to attempt to kidnap the Pope. The Pope survived long enough to excommunicate the king, but then died from wounds received in the attempt. The new Pope decided it was in his best interest to lift the excommunication order, but it was his successor Clement the V who gave Phillip what he wanted. \nOn Friday the 13th 1307 The Templars are rounded up. They are charged with satanism and unnatural practices. Inquisition tactics are used to illicit confessions. It always amazes me the creativity the human species can bring to bear in finding new and malicious ways to torture another human being. Wouldn't you think you'd find a tried and true method and stick with it? The sick perversion of the amount of time spent thinking about and testing new ways to elicit pain from a helpless individual is beyond my comprehension. Jacques De Molay is the head of the order, the grand master, when the purges begin. He receives special attention from the inquisition, but once they acquire his confession they continue to inflict pain on him. \nHe at one point is nailed to a door and then the door is swung back and forth to put the utmost pressure on the bones grating against the nails in his flesh. In 1314 they burn him at the stake and finally his ordeal is over. Templars did survive the purges and they reformed, but kept themselves hidden and out of the public eye. Legend has it that De Molay hid a great treasure before his incarceration and with it an item only referred to as The Great Device.Steve Berry weaves his story around the rise to prominence of a Grand Master Templar who wishes to restore the order to their place of respect and honor. The hero of the story is Cotton Malone, a retired CIA operative who decided to move to Copenhagen to open a bookstore. His old boss comes to visit him in Copenhagen and before they can even meet Malone finds himself in a desperate chase across Copenhagen. As Malone moves around Europe interpreting clues and in the process thwarting the aims of the Grand Master Templar, the plot unfolds in spectacular fashion. There is blackmail, murder, betrayal, mayhem, secret doors, inventive escapes, and not a single sexual situation or even a hint of romantic entanglement. Steve Berry kept all his characters too busy to even pause for a moment of sexual gratification. This is a plot driven novel, characterization is actually very weak, and is the main reason why I bumped this down to three stars. I really wanted to know more about Cotton Malone's life in Copenhagen, but before we are able to see \"a day in the life of a Copenhagen bookseller\" we are blasted into this complicated, elaborate plot that keeps the pages turning. Malone is like MacGyver, Van Damme, and James Bond all rolled into one SUPER AGENT. A misstep is only an opportunity for him to concoct a dazzling display of unequivocally awesomeness. He does receive some good advice from his boss. \"Say it, do it, preach it, shout it, but never, absolutely never, believe your own bullshit. I've got a few people I know that I might forward that bit of wisdom to.I can only hope that with further entries in the series Steve Berry will actually convince me that Cotton Malone has any real interest in the book trade. Further development of Malone and adding more time spent in the book world could place this series at the top of my guilty pleasures list. I thought the plot may have tilted too heavy a nod to Dan Brown, but the primary purpose of a thriller is to be a page turner; a book that takes the reader away from their own mundane existence, and this book fulfills that stipulation admirably."}, {"userName": "Todd", "userReviewDate": "Jul 21, 2008", "userURL": "http://www.goodreads.com/user/show/780655-todd", "userReview": "Steve Berry is the thinking man's Dan Brown. I was immediately impressed after reading The Romanov Prophecy, and The Third Secret. The Templar Legacy does not disappoint. If you enjoyed The DaVinci Code you will appreciate this novel all the more.Berry mixes a decent understanding of folkore and history in this fast paced quest for the real Templar Treasure.\" He even takes a decent pot shot at all the conspiratroialists and others who have made fortunes off a well-documented hoax. The book's idea of \"The Great Device,\" and what it was is based on speculation that has goes back at least 2 or more centuries, and it has nothing to do with Mary Magdelene or the supposed Holy Grail, which was nothing more that Christianized versions of pre-Christian European Myths - the nonsense about san graal meaning royal bloodline not withstanding.Great Fiction writing!!!!!!"}, {"userName": "Jim", "userReviewDate": "Jun 01, 2014", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "Maybe not quite a 4 star read, it dragged a bit in places & was quite long, but Berry certainly did his historical homework & came up with a great conspiracy. If you're not familiar with some of it, as I wasn't (I looked up more online.) he had a great author's note at the end that covered the main points.While about religious people, orders, & conspiracies, Berry took a great secular look at it all, but wasn't insensitive to religious folks. He didn't berate the Gospels for their inconsistencies, but did cover many of the points & give a very realistic look at why they are, yet still made a case for religion. Pretty cool & I'm a pretty anti-religious person.It was certainly a twisty mystery, somewhat overdone. Most of the characters were very well done. I didn't care for Cassiopeia, though. She overdone & wasn't believable at all. Felt tacked on in a lot of ways.Overall, quite good. I'm not sure how good a sequel will be, but I'll give one a shot some day."}, {"userName": "Ashley *Hufflepuff Kitten*", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/29787548-ashley-hufflepuff-kitten", "userReview": "So fascinated by the amount of research that went into this. Really cool book, and I'm excited to follow Cotton on more adventures!"}, {"userName": "Heather", "userReviewDate": "Jul 21, 2007", "userURL": "http://www.goodreads.com/user/show/176566-heather", "userReview": "once again i'm longing for half stars (2 vs. 3). i'm settling on this just being ok/2 stars, though, because:- the dialogue is not afraid to spell things out. as in, explaining the obvious, in a predictable, simplistic manner- the actual storyline meanders a little too much, at least for my taste in historical thrillers. i'd like these books to be, i don't know, thrilling.- there were a couple of spelling/grammar errors. true, it could happen to anyone. true, it's an enormous pet peeve of mine in general. but in a professionally published book, it smacks to me of sloppiness and often reflects on the overall quality of the book. - the 'big religious discovery' in this book, while interesting, was extremely disappointing in its resolution. complaints aside, it really was ok. it was fun to explore some slightly new historical territory (at least for me). i ended up watching a documentary about the templars while i was reading this book and found the two in relative harmony, which was nice. so there you go. 2 stars. =)"}, {"userName": "Mike (the Paladin)", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "[ Yes this is another book that tells us all we (Christians) believe is a lie. Peter left a book telling that all in the Gospels is a lie. How many more times will this ending be copied? Christianity is based on a lie. Jesus died and was not resurrected. Okay there it is. Now I need a bath. (hide spoiler)]"}, {"userName": "Maurean", "userReviewDate": "Feb 29, 2008", "userURL": "http://www.goodreads.com/user/show/855228-maurean", "userReview": "I enjoyed this tale; I have just recently 'discovered' Berry (I read \"The Third Secret\" in August), but the mister has been enjoying him for some time now..In a sort of Cliff Janeway–meets–The DaVinci Code story (although, much better told, in my opinion), we follow “Cotton” Malone, one-time federal agent with an eidetic memory and now a Copenhagen-based bookseller, as he becomes unwittingly involved in a search for the Great Devise, an ancient Templar archive that supposedly disproves the Resurrection and demolishes traditional Christian dogma. Also searching is a host of supporting characters including Stephanie Nell, Malone’s former supervisor; Mark Nell, the son-turned-Templar thought dead in an avalanche; Thorvalsen, the wealthy Dane supporting Malone; Cassiopeia Vitt, the wealthy mystery woman of Islam; Raymond de Roquefort, the fanatic Templar wanting to restore the Order to old glory; the old Master of the Templars and Geoffrey, his servant, aspiring to the Holy Order by doing his master’s will. I enjoyed the story. Mystery, historical information, plenty of twist and turns, all added up to an entertaining read. And, unlike many of the Amazon reviewers, I found Cotton Malone to be an interesting, likable guy, and I intend to look for “The Alexandria Link” to find out more about him, and perhaps gain the answer to the origin of his name. If, like me, you are a closet conspiracy theorist and aren’t easily offended by writers who try to interpret religious ‘what if ?’s, I recommend giving this one a read"}, {"userName": "Josen", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/3660423-josen", "userReview": "What can I say I just really like these kinds of books with thriller/action-adventure based on history and historical landmarks. This is about an American, Cotton Malone (which I’m not too thrilled with that name, lol!), who is now a bookseller in Denmark after retiring as a US Operative. He’s trying to live the quiet life when he finds himself embroiled in a quest (with his former boss) that involves the Knights Templar and looking for “The Great Devise”. Yes this type of storyline and pace is reminiscent of The DaVinci Code but again, I really like these kinds of books. One part of the story is disputing the belief that Jesus Christ rose from the dead and the thought-provoking line: “It has served us well, this myth of Christ” – Pope Leo X. I, myself, was brought up Catholic so the thing about these types of stories is that you have to go into it with an open mind. Obviously the author does his research and a lot of the book is based on historical references. But you also have to realize that a lot is fiction…….embellished. There’s nothing wrong with that since the book is……...fiction. I’ve seen way too many reviews on stories like these where people complain that it’s wrong, there’s no basis for it, no proof. Whatever. It’s fun. It takes you all over the world. Leave it at that. That being said, I liked it, thought it was fun and I’m going to continue on with Cotton and his adventures. :)"}, {"userName": "Jesse A", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/21013603-jesse-a", "userReview": "Dan Brown esque. Interesting thriller with the seemingly sole intent of challenging pre conceived historical beliefs. Long spots of historical info dumps, which I found interesting but could bore some. Entertaining at least."}, {"userName": "Lauren", "userReviewDate": "Feb 23, 2011", "userURL": "http://www.goodreads.com/user/show/4731410-lauren", "userReview": "The Templar Legacy1 StarThis is my third attempt at reading this book and its time to call it quits. The main character is interesting enough and the plot has potential, but it moves along at a snails pace with excessive descriptions of the scenery (villages, buildings, forests, gardens, etc.) and the innermost thoughts of each and every character most of whom I couldn't care less about. Enough is enough!"}, {"userName": "John Yelverton", "userReviewDate": "Aug 05, 2011", "userURL": "http://www.goodreads.com/user/show/5928256-john-yelverton", "userReview": "Total load of garbage from the beginning of the book until the end. This book was not even worth the paper it was written on."}, {"userName": "Jenny", "userReviewDate": "Sep 12, 2007", "userURL": "http://www.goodreads.com/user/show/282889-jenny", "userReview": "It has served us well, this myth of Christ. — POPE LEO XThe above appears on the back dust jacket of The Last Templar and as an epigraph for The Templar Legacy. Fascinating, isn't it? My initial reaction upon seeing it for the second time, having just brought home The Templar Legacy, was, oh no, it's the SAME BOOK! Really, though, aside from both dealing with lost Templar treasure and the possible non-divinity of Christ, they're quiet different novels. (I may have even enjoyed this one more than either The Last Templar or The Da Vinci Code.) Berry tells the story cleanly with few unnecessary distractions, and the pacing is excellent. The twists and turns of plot were only predictable in that they were legion; Berry kept me guessing almost all of the time, and I was always intrigued. All in all, a good read.What's really interesting for me, though, in all of these novels, is how much I find myself reflecting of my own religious beliefs. I think I enjoy them even more because they do challenge established Christianity, and, consequently, my beliefs. They make me think about things I often take for granted. I think that's partly why I'm drawn to them, and have read them all, despite their undeniable similarities. There is a fourth, a just-released novel called Labyrinth that I think I'll be checking out within the next few weeks. Apparently I can't get enough! Challenge away!"}, {"userName": "Benjamin Thomas", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/4209082-benjamin-thomas", "userReview": "This is the first of the Cotton Malone series. The author, Steve Berry, has been described as \"the thinking man's Dan Brown\" and I can see why. I am certainly no biblical scholar but the book seemed to be well researched and real world mysteries are dealt with in a plausible way. I do wish, though, that readers who are offended by anything that challenges their religious views would just avoid those novels in the first place rather than read them and then trash the book's viewpoint.I enjoyed learning much more about the Templars and how they evolved through history. I also liked the settings in Copenhagen and France, and having been to most of the locales described in the novel, found myself transported back to those places.The plot was intriguing and while I thought the overall mystery to be sufficiently compelling and well paced, I felt the dialogue was a bit stilted. I've noticed this with other Steve Berry novels as well. The one thing that I appreciated the most was that Cotton Malone, our protagonist, served as a great foil for the reader. Just when I felt like saying, \"That doesn't make sense,\" Cotton says, \"That doesn't make sense.\" Since the mystery elements of the plot are quite complicated, it really helped when he asked the same questions I wanted to ask at exactly the right points. It was almost uncanny.So, yes, I will definitely be reading more of the Cotton Malone series."}, {"userName": "Piyangie", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/48056505-piyangie", "userReview": "This is the first book of the Cotton Malone series, and thus far, the best one I have read. I'm sure my fascination with the history of Knights Templar was a weighing factor in my rating of the book. Nevertheless, Steve Berry has done a good job in mixing history with an interesting story line. The story was quick paced with full of action. The employment of diverse characters made it all the more interesting. I liked most of them, especially the Seneschal, Mark Nelly. But Cotton Malone was another story. His lack of authority and inaction made me irritable at times. I wonder what Mr. Berry was thinking in using such a lousy character as his lead. I'm only too glad that his character didn't diminish my interest in the book."}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "I'm not going into the the whole story line as the synopsis gives us a lot of information on that.This is the 2nd time I have read this book...I decided to start the whole series again as I have now copies of his later books.I enjoyed it a lot and what makes this series interesting for me is the hero, Cotton Malone - love his name and also the amount of research done for the story....though at times, I felt bombarded with so much all at once....but I am liking getting into this series again."}, {"userName": "Stacy", "userReviewDate": "May 14, 2016", "userURL": "http://www.goodreads.com/user/show/55502227-stacy", "userReview": "I thought the book was good, held my attention, and kept me guessing. I thought it was well researched, but since there was no roving reporters, internet, video cameras or cell phones centuries ago we rely on documents written by whoever was paying to have them written, and naturally if King Phillip IV, the Pope, or the Templars wanted to document an event, they would have it recorded to put themselves in the best light. So, historically, I think the truth lies somewhere in the middle of what is said by all the documents. That said, I enjoyed the book and thought it well written."}, {"userName": "Mike French", "userReviewDate": "Oct 18, 2012", "userURL": "http://www.goodreads.com/user/show/6761276-mike-french", "userReview": "My first Steve Berry novel and it will not be my last. Even though I not into the Knights Templar,I found the book enjoyable and entertaining from start to finish!"}, {"userName": "Kelsey", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/5113930-kelsey", "userReview": "This was a fun, adventure-filled thriller full of history about the Knights Templar, or as they called themselves, Poor Fellow-Soldiers of Christ and of the Temple of Solomon. They were a Catholic military order founded around 1119 until around 1312. \"The Templars were closely tied to the Crusades; when the Holy Land was lost, support for the order faded. Rumours about the Templars' secret initiation ceremony created distrust, and King Philip IV of France—deeply in debt to the order—took advantage of the situation to gain control over them. In 1307, he had many of the order's members in France arrested, tortured into giving false confessions, and burned at the stake. Pope Clement V disbanded the order in 1312 under pressure from King Philip.\" [source]During the time period they were active, they were the wealthiest and most powerful group, which grew rapidly. Their abrupt disbanding led to speculation and legend, which is where this book comes in. It plays on the legacy and legend of the Templars, and this now shadowy group of Knights are hunting for the secrets that have been passed down from master to master. Cotton Malone, the protagonist of the story, is a retired top operative of the U.S. Justice Department who is drawn back into the cloak-and-dagger world when his former boss, Stephanie Nelle, is violently robbed.I thought the story was very well written (although it did drag at times) and was excellently researched. I felt like I was learning a lot about history, but at the same time, taken on this thrilling, shadowy, conspiracy-filled world. The story switches views several times, between Cotton, Raymond de Roquefort (the villain of the story), as well as few other characters, but the story never lost track with the different POVs. If you love Dan Brown's \nThe Da Vinci Code\n, Indiana Jones and the Last Crusade, National Treasure, or any story filled with both history and adventure, you will love this book!"}, {"userName": "Jen", "userReviewDate": "Jul 01, 2008", "userURL": "http://www.goodreads.com/user/show/43351-jen", "userReview": "A \"Me too!\" in the Da Vinci Code genre. Enh.Ok, finished it. OMG, you mean Jesus didn't ACTUALLY rise from the dead and that it's all a metaphor?! No shit, Sherlock. He hinges the whole plot on Jesus' resurrection, and then you're supposed to act all shocked when the characters actually find his bones. BFD. Of course then his characters are all like \"Well this info doesn't really matter in today's modern society...\" after they spent all this effort finding it. The characters are all underdeveloped and constantly tripping over each other- did Berry seriously need the whole troop present for the final confrontation? Some of the characters seemed like they were created just because the author thought there weren't enough, or that his already existing characters were too boring, or something. I'm still trying to figure out why Cotton Malone was the main character. Oh right, so Berry could create a travel/adventure/thriller series based on him. Otherwise there was no reason for Malone to be moving the plot forward. Cassiopeia was interesting but gone before she actually ever became relevant. She was just there to provide another plot twist (Thorvaldson sure gets around!) and to save Malone's ass from situations Berry couldn't write him out of.Anyway, this book was lame. I'm tempted to read more though... just can't get enough of the fictional Biblical analysis! ;)"}, {"userName": "Andrea", "userReviewDate": "Oct 13, 2009", "userURL": "http://www.goodreads.com/user/show/228427-andrea", "userReview": "This was an enjoyable read. I liked it, I thought it was well written, it kept me in suspense, there were twists and turns, and it was interesting. (Although if you don't like fictional books that question the Bible or faith then this book is NOT for you!) It's a very Dan Brown kind of book (that I think is a bit...only a bit...more realistic.) I wavered between 3 and 4 stars for this one and settled on three. I settled on three because-At times the books gets very preachy/too lecture like.-It's very repetitive. The book rehashes the same information over and over and over again. By the end I was thinking, \"yes, I know we already covered this. It doesn't matter if THIS character isn't up to speed. I am. I don't need to read this again.\"-The characters were (mostly)realistic...but not all that likable. I wanted to care more about them and what happened to them. Perhaps if their motivations were explored more fully (rather than the rehashing of details) I would have liked them more.Even still - I think I will get Steve Berry another try. I'll have to see what's available in the library."}, {"userName": "Ben Chenoweth", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/5172018-ben-chenoweth", "userReview": "I should have known: this is, after all, an attempt to muscle in on Dan Brown's Da Vinci Code territory. Lots of anti-New Testament material here! Oh, how I wish authors who want to write books in this \"genre\" would do wider research. Berry refers to Bishop Spong, for crying out loud! In my opinion, one book by N. T. Wright (Resurrection And The Son of God) would have been enough to alter the ending of Berry's book for the better. If you are looking for an escapist page-turner, then this book may be of interest. But please don't take any notice of his theological discussions. His dating of the Gospels is questionable, and he makes no mention of Paul's writings. 1 Corinthians is an undisputed Pauline letter, and Paul's chapter on the resurrection (chapter 15) blows Berry's liberal scholarship out of the water: it's early and refers to all of Jesus' resurrection appearances that were later written about in the Gospels. So there!"}, {"userName": "Katherine Coble", "userReviewDate": "Jan 31, 2010", "userURL": "http://www.goodreads.com/user/show/295586-katherine-coble", "userReview": "I got this for free on Amazon Kindle. It's worth what I paid for it. I couldn't make it past the first 80 pages, which were an obvious attempt to not only ride the coattails of The DaVinci Code but to also build a franchise around the main character. The fact that I came here to update my review and see that the goodreads title lists it as \"Cotton Malone #1\" pretty much seals the deal on that. I grow very weary of these action franchises, and more than one speculative fiction author (James Rollins, I'm looking at YOU!) has had a strong body of work overshadowed by the special ops-covert military goofiness that seems so popular in these strains of novel. I'm just not in the mood to cavort through the streets of Europe and the pages of history with yet another multi-lingual, eidetic memory-having, erudite military man."}, {"userName": "Carl Kleinebecker", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/6279091-carl-kleinebecker", "userReview": "So... I'm always looking for a new series to read and Steve Berry's Cotton Malone series fits the bill. In a formulaic Dan Brown-esque fashion we start off LONG ago in a land far away... laying the ground work for the \"action\" that will take place in the present(ish) day. While Cotten's backstory could have been built out a little more fully... hits are given that things will be either explained later in the story or... we are lead to believe this is a \"story\" for another time i.e., another book... thus the drawn out backstory can bit a bit annoying. Other than that the characters in the book are well thought out and the action is great fun... I will be looking forward to the next book in the series and all those there after!"}, {"userName": " Marla", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/593597-marla", "userReview": "[* So many deaths on a religious quest* Pope's palace that didn't have any religious theme* Heretic secret \"religious truth\" (hide spoiler)]"}, {"userName": "Christian, Kelanth, Scala", "userReviewDate": "Jan 18, 2011", "userURL": "http://www.goodreads.com/user/show/4584197-christian-kelanth-scala", "userReview": "L'ultima cospirazione, in originale \"The Templar Legacy\", è un romanzo thriller a sfondo avventuroso, pubblicato nel 2006, ed è il primo libro della saga riguardante Cotton Malone, personaggio inventato dallo scrittore americano Steve Berry.La trama del romanzo si può così riassumere: Cotton Malone, ex agente operativo del dipartimento di Giustizia americano, si è da tempo lasciato alle spalle una vita fatta di pericoli e agguati e ha deciso di trasferirsi a Copenaghen, dove gestisce una libreria antiquaria. Un'esistenza tranquilla, che però viene sconvolta quando il suo ex superiore, Stephanie Nelle, giunta in Danimarca per una breve vacanza, cade vittima di uno scippo e il ladro, poco dopo, muore in circostanze misteriose. Malone allora segue Stephanie a un'asta di libri antichi e lì scopre la ragione del viaggio della donna: acquistare un volume, apparentemente senza valore, che tuttavia viene aggiudicato a qualcun altro, disposto a pagare una cifra esorbitante per impadronirsene. A questo punto, Stephanie è costretta a rivelare a Malone la verità: sta ricostruendo una catena di indizi rinvenuti dal marito, uno studioso di esoterismo morto alcuni anni prima, e quel libro è la tessera fondamentale di un puzzle che potrebbe risolvere il mistero del paesino francese di Rennes-le-Château e, di conseguenza, del mitico tesoro scomparso dei Cavalieri Templari. Ma è ormai ovvio che Stephanie non è l'unica a voler far luce sull'enigma che circonda il luogo in cui sarebbero custoditi numerosi testi segreti, proibiti dalla Chiesa, e immense ricchezze. Lo dimostrano la spirale d'intrighi e di morte che si dipana all'istante intorno a lei e a Malone, e che sembra aver origine proprio da un'antica cospirazione legata ai Templari.Siamo al solito filone post-Il Codice da Vinci, dunque un thriller storico-religioso che pone in chiava romanzata un pezzo di storia che è apparentemente avvolta da qualche mistero. Non nego che in alcune parti sia entusiasmante e coinvolgente, con un testo che è scritto in maniera scorrevole e che si legge abbastanza velocemente anche quando l'autore elargisce spiegazioni storiche. I personaggi sono abbastanza interessanti e ben caratterizzati, si muovono in un ritmo incalzante e attraverso un mistero affascinante da risolvere.Il problema essenziale è che letto uno di questi libri che si rifanno al filone thriller storico-religioso, hai la sensazione di averli letti tutti. Anche se gli argomenti, i personaggi e i misteri da risolvere cambiano, per tutto il libro continui ad avere un, in questo caso, pesante senso di deja-vu."}, {"userName": "Billy", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/10554432-billy", "userReview": "I found this book after reading The Da Vinci Code. I was enthralled from cover to cover and have found through this book, The Da Vinci Code and 1 other book that I am now a closet Templar conspiracy theorist.Well written with good plot twists and suspense. Steve Berry is a gifted author with a special talent for suspense and history.Historical fiction lovers will get plenty from this book. Suspense lovers will not be disappointed. There is even some blood for the horror fans. I guess the only people who wouldn't enjoy this are those that like romance novels.This particular novel centers on the search for the Holy Grail and present day Knights Templar that exist in total secrecy. Cotton Malone, the main character, is pulled in to a plot of international intrigue when his former boss (from a secret government agency he retired from) turns up in his hometown and and has her purse stolen. When the man is pursued he commits suicide after uttering a latin phrase that is connected with the Knights Templar. Cotton must use his skills as a former government agent and his knowledge as a bibliophile to solve a riddle that is hundreds of years old. All the while, he is pursued by a sadistic man bent on eliminating him because he knows about the Templars.Regardless of your tastes, Berry has written 4 novels on 4 different topics and all 4 are fantastic. Just look at the reviews for his other books and you can trust that you are buying a great book when you get this one."}, {"userName": "Siobhan", "userReviewDate": "Mar 03, 2008", "userURL": "http://www.goodreads.com/user/show/462617-siobhan", "userReview": "[>About halfway through we find that Jesus never rose from the dead. I liked the ulitmate conclusion of the novel; how it handles the issue of faith, and what faith is for. But I was pretty annoyed that the gospel of Matthew, which the author specifically references, also explicitly states that guards were set at the tomb and therefore obliterates the novel's entire premise that followers stole and hid Jesus' remains. If you're going to be postulating exotic and revolutionary what-ifs in a quasi-realistic way, don't be sloppy. However, author gets points for including an afterword that clearly states what is history and what is fiction. (hide spoiler)]"}, {"userName": "Paul Gaya Ochieng Simeon Juma", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/19439030-paul-gaya-ochieng-simeon-juma", "userReview": "Thriller.There is a book.The book goes missing.There comes a man, arrogant as usual, divorced as usual and retired. You know what am talking about.Then there is a woman, partner to the man, divorced too.What are they looking for, the book.Then we have the bad guys, they are killing people for the book.The story is not as simple as I have put it though. The book is actually interesting. A lot of history to learn and other valuable facts. Kudos to Steve Berry. I never thought I could read this kind of book.The action unfolds in Denmark, when Malone and Stephanie meet and attend an auction together with the aim of bidding for a book that has secrets of ancient monks. They don't acquire the book, sbdy else does and they have to find the book.The action spills to France after they obtain the book. There they have to find sbdy who can interpret the contents of the book.Am in page 260"}, {"userName": "Christopher Stephen", "userReviewDate": "Dec 07, 2007", "userURL": "http://www.goodreads.com/user/show/120028-christopher-stephen", "userReview": "Well, I have recently finished \"The Templar Legacy,\" and for those who like Templar historical fiction, I highly recommend. Filled with facts and mysteries involving \"The Great Devise,\" the long lost Templar treasure who some hypothesize as being proof of Jesus' mortality, the book takes the reader through twists and turns, all the while being action packed. The book does have multiple characters, both as part of the story and the story's history, so sometimes is may get confusing. Don't dismay though, it is well worth the attention, and is an excellent read compared to others. Will Cotton Malone and Stephanie Nelle find the Great Devise before evil others do? Is the treasure made of gold, or secret knowledge? ENJOY!!!"}, {"userName": "Janice", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/2513987-janice", "userReview": "This book reminds me a lot of The Da Vinci Code. Instead of the Illuminati, this book has the Knights Templar. Instead of the search for the Holy Grail (Mary Magdelene), this book searches for the truth of the resurrection, whether it was fact or myth.The history lesson of the Knights Templar was worth the read."}], "description": "The ancient order of the Knights Templar possessed untold wealth and absolute power over kings and popes . . . until the Inquisition, when they were wiped from the face of the earth, their hidden riches lost. But now two forces vying for the treasure have learned that it is not at all what they thought it was–and its true nature could change the modern world.Cotton Malone, one-time top operative for the U.S. Justice Department, is enjoying his quiet new life as an antiquarian book dealer in Copenhagen when an unexpected call to action reawakens his hair-trigger instincts–and plunges him back into the cloak-and-dagger world he thought he’d left behind.It begins with a violent robbery attempt on Cotton’s former supervisor, Stephanie Nelle, who’s far from home on a mission that has nothing to do with national security. Armed with vital clues to a series of centuries-old puzzles scattered across Europe, she means to crack a mystery that has tantalized scholars and fortune-hunters through the ages by finding the legendary cache of wealth and forbidden knowledge thought to have been lost forever when the order of the Knights Templar was exterminated in the fourteenth century. But she’s not alone. Competing for the historic prize–and desperate for the crucial information Stephanie possesses–is Raymond de Roquefort, a shadowy zealot with an army of assassins at his command.Welcome or not, Cotton seeks to even the odds in the perilous race. But the more he learns about the ancient conspiracy surrounding the Knights Templar, the more he realizes that even more than lives are at stake. At the end of a lethal game of conquest, rife with intrigue, treachery, and craven lust for power, lies a shattering discovery that could rock the civilized world–and, in the wrong hands, bring it to its knees.", "title": "The Templar Legacy\n      \n          (Cotton Malone #1)", "url": "http://www.goodreads.com/book/show/75024.The_Templar_Legacy", "average": 3.81, "cover": "https://images.gr-assets.com/books/1413393638l/75024.jpg", "reviews": 1887, "authors": [{"url": "https://www.goodreads.com/author/show/3621.Steve_Berry", "name": "Steve Berry"}], "type": ["Fiction", "Thriller", "Mystery", "Historical", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/75024.The_Templar_Legacy", "http://www.goodreads.com/book/show/10075400-the-templar-legacy", "http://www.goodreads.com/book/show/1422161.The_Templar_Legacy", "http://www.goodreads.com/book/show/1467428.The_Templar_Legacy", "http://www.goodreads.com/book/show/6057008-the-templar-legacy", "http://www.goodreads.com/book/show/9770439-l-ultima-cospirazione", "http://www.goodreads.com/book/show/74824.The_Alexandria_Link", "http://www.goodreads.com/book/show/1178039.The_Venetian_Betrayal", "http://www.goodreads.com/book/show/75020.The_Romanov_Prophecy", "http://www.goodreads.com/book/show/5369.The_Amber_Room", "http://www.goodreads.com/book/show/7840156-the-emperor-s-tomb", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}