{"ratings": 1376, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”There are dogs and kids, great books and great paintings and good music all over the White House,” he said. “It’s human again, the way it must have been under Franklin Roosevelt.”\nThe power of John F. Kennedy didn’t just rest in his Hollywood good looks, or his youthful vibrancy or his beautiful wife or his inspiring speeches, but that he exuded this idea that anything seemed possible. Even something as crazy as landing an American on the moon. He was tougher than he looked. During the Cuban Missile Crisis he held firm and it was Nikita Khrushchev who blinked. The war against the spread of communism was heating up in Southeast Asia and Vietnam was becoming a country that more and more Americans could find on a map. \nNgo Dinh Diem, the brother with the camera ready suits.Ngo Dinh Diem and his brother Ngo Dinh Nhu are having PR problems. The country was destabilizing under their rule. They had more enemies than friends. The war against the North was going poorly. Buddhist monks were lighting themselves on fire in the street in protest against their dictatorship. These were all plenty of problems to deal with, but when the United States started to see the brothers as an impediment in the war against communism it would prove to be the final straw. The Americans gave the go ahead to a group of generals to take control of the country. A coup d’etat happened on November 2nd, 1963 when Diem and Nhu are riddled with bullets. The country celebrates.\nNgo Dinh Nhu, he was the cool, badass brother.Not Paul Christopher. He is a long serving CIA operative who doesn’t have to dig too deep into the data to know the United States changed the game. Assassinations breed assassinations and Christopher fears that hearing the first shoe drop will quickly be followed the thump of the second shoe. It is even bigger than he could have expected. President John F. Kennedy was assassinated in Dallas on November 22nd, 1963. It had been 62 years since the last presidential assassination. President William McKinley was shot and killed in 1901. There was a lot of problems with the trip to Texas. First of all Dallas was a known hostile city to the president. The secret service wanted him in a closed car, but Kennedy was trying to win over voters. He wasn’t going to do that by putting his light under a bushel. The crowds of people needed to see him and be swept away by the visual promise of Camelot. In the emotion of the moment Paul Christopher discovers something about himself. ”You’re crying. Would you like to pray with me?”“No, Father. I don’t believe.”“It’s a frightful thing.”Christopher thought the priest was talking about his rejection of faith. “For some,” he said.“For all. President Kennedy was a great man. That death should come like that to him--he was like a young prince.”“Yes, it’s a great shock.”“You must have loved your President.”“I love my country,” Christopher said.“It’s the same thing, perhaps.”“Ten minutes ago I wouldn’t have said so, Father. Now I think you’re right.”I remember as a child when I was reading through the encyclopedia set that some shady salesman had sold my parents when I was still too young to read them, and had come across the entry about John F. Kennedy. I asked my mom why John F. Kennedy was assassinated. She started crying. It was as raw for her in the mid-1970s as it was the day it happened. The budding investigative reporter part of my developing personality sensed I was on to a big story. She was at Ma Bell working a switchboard when it happened. Anybody alive at the time can tell you where they were when it happened. “I don’t know why they killed him, but they took him from us.” \nThat look on LBJ’s face gives me a chill every time I see it. As if he is calculating something nefarious. Bundy said after working for both presidents that Kennedy was most worried about looking stupid. Johnson was most worried about being looked on as a coward.We don’t know what Kennedy would have done if he had lived. McGeorge Bundy insists that Kennedy was not going to escalate the war in Vietnam. Some theorists think that may have been why he was killed. Big contractors knew that LBJ would be more amenable to getting things rocking and rolling in Vietnam. It could have been the mob after his brother Bobby had harassed them in court case after court case. It could have been Cubans who felt betrayed over the Bay of Pigs. It could have been the Russians for any number of reasons. The Vice President wasn’t particularly fond of Kennedy either. John had amassed a lot of enemies in a very short presidency.Paul Christopher thinks it has to do with the Diem and Nhu assassinations. He starts to investigate, puts together a pretty compelling case and submits it to his superior. His superior submits it to the Johnson administration. \nJack Ruby shooting Lee Harvey Oswald. What did you know Lee?Wait. What are you doing. This Kennedy Dallas mess had been wrapped up in a big bow after Jack Ruby shot Lee Harvey Oswald. Christopher is told to desist, take a vacation, sort out his priorities. He quits.He keeps digging until he has all the pieces assembled. One thing I like about Charles McCarry novels is that he always works into the storyline the books that Paul Christopher is reading. ”In the darkened lobby of a hotel, Christopher drank mineral water and read the two Simenons, dirty and swollen by the rainy climate, that he had bought from a street vendor.”Lee Harvey Oswald may not have known anything, but damn I wish we’d had a chance to find out what he did know. The alarming number of people connected to the Kennedy Assassination who died shortly afterwards and under sometimes bizarre circumstances makes my conspiracy flag unfurl. The majority of Americans still believe that it was a conspiracy to kill John F. Kennedy. \nMaybe we just don’t want to believe that a lone nut job can change the world. I grabbed this off the shelf after watching the documentary style film Parkland which was excellent. I still read books about Kennedy and the assassination. I watch films. I watch clips. I read articles. I put it aside, but ever so often I unearth it like a dog’s favorite bone and gnaw on it some more. I guess I’m still the 8 year old boy wanting to know who made my momma cry."}, {"userName": "Michael", "userReviewDate": "Dec 25, 2016", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "McGarry is growing on me as nearly as worthy as le Carre and Deighton for enthralling espionage tales set during the Cold War. In this second in the series, CIA spy Paul Christopher comes to suspect that the assassination of JFK was masterminded by a Vietnamese faction in retaliation for the American’s facilitation of the coup associated with the assassination of the dictator Diem a few weeks earlier on November 2, 1963, which put in place a more pliable dictator for America’s global war against communism, Thieu. Christopher’s insight is founded on his deep knowledge of the power structure there and their ancient traditions for avenging wrongs done to a clan member. However, the political head of the agency, upon hearing of the agent’s request to pursue the matter, shuts him down. Just the concept that a third world country could topple the head of the mighty U.S. is too dangerous politically even to ponder. The theory that the Cubans could pull it off in response to the Bay of Pigs invasion would be equally damaging to the American’s reputation in the world, and the more plausible prospect the Oswald was a KGB operative held the seeds to war. The story that Oswald was a lone madman was the only solution to be adhered to. Christopher resigns and goes off-reservation with his own resources to investigate the truth. Christopher bids farewell to his woman in Rome and pursues leads from contacts and sources he has leverage with in far-flung places such as Paris, Switzerland, and the Congo, and then he homes in on various members of Diem’s family in Vietnam. He is not quite James Bond, but his courage and skills in the face of danger and set-backs at every turn were fascinating and thrilling to experience. Spies from his own former agency are being used to thwart and put him out of commission. Luckily, an agent who has been both friend and competitor helps him along the way. The complex intrigue among factions in Vietnam and atmospheric details of life in this mysterious and dangerous society were nicely done. I recommend the review by Jeffrey Keeten for a more in-depth background and coverage of this tale."}, {"userName": "Gram", "userReviewDate": "Jun 02, 2013", "userURL": "http://www.goodreads.com/user/show/20951788-gram", "userReview": "The Tears of Autumn is a ripping yarn! In less than 300 paperback pages, Charles McCarry reveals - via the CIA super-spy hero, Paul Christopher - that almost everyone you can think of as likely candidates for killing President John F. Kennedy in Dallas in 1963 was in some way involved. But - and it's a big BUT - there is absolutely no evidence to show that any American intelligence agency of any kind was in any way involved in this conspiracy. Despite the subject, McCarry writes very prettily, just like LeCarre. I believe that, at heart, both men long to be be famous poets. McCarry's hero has even had a book of poetry published. He's also fluent in umpteen languages, never carries a weapon and seems to know everyone in the spying business. All the women in his travels east and west are beautiful and - like James Bond - he visits many exotic (and some not very exotic) locations. However, some of the people he talks with have an unfortunate habit of dying soon afterwards. In a very short time, Paul Christopher travels to many countries, talks to a score or more \"suspects\" and puts together a case for the prosecution which would satisfy any investigation into President Kennedy's assassination. All the while he manages to dodge most of the the attentions of various baddies who are out to stop him. Throughout the story there are some wonderful one-liners (although I'm almost certain he pinched one of them from ELO's 1973 song \"Showdown\"). At the conclusion of this wonderful spy thriller, I asked myself could it be that McCarry - who worked for the CIA for almost a decade - might have a vested interest in his conclusion that \"The Agency\" was definitely NOT involved? As an infamous Englishwoman once said: \"Well he would say that, wouldn't he?\""}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "May 21, 2016", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "While I didn't enjoy reading this book as much as The Miernik Dossier, this one introduces us more to the central character of Paul Christopher (and his women.. and his poetry.) Set in Vietnam and Thailand (and parts of Africa, Europe, and the USA!) right around the assassination of JFK, it was a different angle of those events. I am really loving these 1970s spy novels, right up my alley."}, {"userName": "Nancy Oakes", "userReviewDate": "Oct 10, 2008", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "I listened to, rather than read this book and it was so good that I rushed out and bought The Miernik Dossier (the first of the Paul Christopher series) and have plans to read each and every book in the series. What intrigued me was yet another JFK assassination theory. I'm not a conspiracy theory nut, but I am interested, and never did believe in either the single-bullet theory nor that of the lone gunman. And as much as I loved Oliver Stone's JFK, well, let's just say that it was a lot of theories rolled into one. Here, McCarry gives us one more theory to contemplate.When Paul Christopher hears that JFK has been assassinated in Dallas, he immediately knows who did it and why. At a time when Lee Harvey Oswald was considered both the mastermind and crazed lone gunman of Kennedy's assassination, nobody higher up wants to even consider the alternatives. But Christopher knows, and embarks on a journey filled with danger and intrigue to prove it, even if only to himself.Tears of Autumn is an intelligent read, and doesn't insult anyone's intelligence. The assassination plot is quite plausible, without being in your face about it, and the author's fine writing makes you believe that these events could have happened in the way he posits.The characters are very believable; the action is nonstop, and the writing is incredible. If you are at all interested in the JFK assassination, or in Vietnam, or if you just want a quality read, then I can definitely and most highly recommend this book."}, {"userName": "Tom", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/1245181-tom", "userReview": "After reading DeLillo's Libra, twice, I found it hard to imagine anyone matching, much less surpassing, his fictional take on JFK assassination. McCarry does not match DeLillo, but he does foretell, by 16 years, my favorite line in Libra: \"A fact is innocent until someone wants it. Then it becomes intelligence.\" The main tension in McCarry's telling is that no one, or no one who really matters, wants the intelligence born of those facts.The plot gets a bit convoluted at times -- as another reviewer commented, I, too, found myself wondering, 'Ok, now why is Christopher hanging out in a hut in Africa getting drunk with a Cuban officer fomenting revolution?' -- but overall this is a worthy contribution to the sub-genre. (I hear Stephen King's take on JFK is quite good.) This is my second McCarry novel -- after The Miernik Dossier -- and I like him well enough to read more, as much for the quality of his prose as for his vision of spy world."}, {"userName": "Bradley West", "userReviewDate": "Jun 12, 2016", "userURL": "http://www.goodreads.com/user/show/20492424-bradley-west", "userReview": "Charles McCarry is a less well-known spy novelist than le Carre or Deighton, but belongs in the same conversation even if \"Tears of Autumn\" was the only book he published. McCarry's protagonist Paul Christopher is somewhere between super human (e.g. ability to pick up almost any language--even tonal ones--in a month or two) and all-too-human (e.g. his feelings for his Australian lover). The pace is fast, the settings described in sufficient detail to convince the reader that McCarry knows them firsthand and JFK's assassination is the number one conspiracy of modern times.Where McCarry really shines is in the nuanced plotting and layered reveals that keep the reader riveted even if the basics of Christopher's take on Kennedy's murder have been known almost from the outset.\"Tears of Autumn\" stands alongside the best of spy novels of the modern era."}, {"userName": "Bill", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/1811095-bill", "userReview": "This is a really excellent spy thriller. At the beginning of the book, President Kennedy is assassinated, and an American spy, Paul Christopher, immediately knows who and why ordered the killing.The rest of the book involves him traveling all over the world in an effort to prove what he believes to be true. There is great suspense and non-stop action throughout, and by the end of the book, you will probably be pondering,as I am, just how persuasive his theory is. Highly recommended. And I can't wait to get to the other books in the series."}, {"userName": "Lance Charnes", "userReviewDate": "Aug 26, 2012", "userURL": "http://www.goodreads.com/user/show/7296900-lance-charnes", "userReview": "McCarry – like John LeCarre and Daniel Silva – is known as one of those authors who “gets it right” with his spy yarns. The Tears of Autumn is his second novel and the second to feature his series character Paul Christopher, a CIA agent active during the 1950s and 1960s. In this installment, Christopher decides to solve the JFK assassination. Nothing like swinging for the fences, eh?Even though Christopher flirts with super-agenthood – speaking multiple languages, near-photographic memory, dangerously handsome, culturally sensitive, etc. – he’s not a one-man killing machine like his counterparts in spy thrillers (which this isn’t). He doesn’t carry a gun, hardly kills anyone at all, and talks (or buys) his way into and out of trouble rather than blowing up things. This is spy work closer to how spies really work. The old-school (pre-9/11) received spy wisdom was if you kill someone, you’ve blown your cover and you’re done.McCarry’s depiction of Christopher’s stops in this 1963-64 travelogue (D.C., Saigon, Paris, Rome, Zermatt) are atmospheric and evocative without slowing things down; his settings remind me of Alan Furst’s, lightly drawn but presenting enough detail to feel authentic. Similarly, Christopher’s spycraft is described with confidence without descending into textbookism. Since McCarry was a CIA case officer for several years, we have some assurance that what his characters do is as real as he could get past the CIA’s censors.The downside? This novel is emotionally chilly; even when Christopher is supposed to be contemplating his internal demons or an unexpected chance at love, it feels as if he’s doing it because he thinks he’s supposed to rather than because he’s compelled to do it. It’s also fairly short and travels in a straight line. Christopher formulates a theory about the JFK assassination (which he doesn’t share with us) at the beginning and follows it without many twists or turns straight through to being proven right. This isn’t a thriller (Our Hero isn’t often in imminent mortal danger) nor is it a mystery; it’s a spy procedural, an exercise in watching a skilled operative do his thing, step-by-step, in a turbulent time. It’s fascinating, but it’s neither moving nor exciting.The Tears of Autumn is almost British in its reserve, LeCarre with an American protagonist. If you want explosions and global conspiracies, there are plenty of other authors to turn to. If you want to see an ideal real-world covert agent do his job at the height of the Cold War and want to go places other than London and Berlin, McCarry’s your man."}, {"userName": "KOMET", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/4183137-komet", "userReview": "\"THE TEARS OF AUTUMN\" is a compelling, well-crafted novel centered on Paul Christopher, a CIA Special Agent who has served in the Agency since the 1950s. When the story begins, it is October 1963 and Christopher is involved in deep cover work in South Vietnam. Weeks later, in the aftermath of President Kennedy's assassination, Christopher leaves the CIA and, on his own, armed only with his skills, a facility for languages, and a theory as to who killed Kennedy and why, pursues leads from Saigon, to the Congo, and Europe, to bring to light the assassins of the President. This puts Christopher at odds with both the government and the assassins, who would like to see him neutralized. This book shows Christopher to be a very complex, fascinating, multi-faceted person, one who with a highly developed sense of duty, honor, and ethics. is also open to love. Normally, I tend to avoid novels about CIA spies and operations because they are \"Johnny-Come-Latelys\" in the spy game and I much prefer reading stories about British, French, Russian and other assorted European spies. But \"THE TEARS OF AUTUMN\" packs quite a punch and has an assortment of characters not unlike those found in the best works of John le Carré. (When I was a few pages in, I was hooked and could hardly contain myself, so anxious to see how McCarry would spin this tale. TERRIFIC STUFF.)"}, {"userName": "Paul", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/4882193-paul", "userReview": "Actual rating: 3.5 stars.I'm late coming to Charles McCarry, having missed reading him the first time around (this novel was written in 1974). Reviews gave me the impression he's on the same plane as John le Carre, the great espionage novelist. After reading \"The Tears of Autumn,\" I think he's a more of a refined and elevated Ian Fleming, his character Paul Christopher an American James Bond.I don't compare Christoper to Bond in the superficial sense. Christoper's a behind-the-scenes CIA agent, a modest man who doesn't live lavishly. There are no bespoke suits from Savile Row, no fancy cars, not even any brand names if you don't count the Rolex he wears. Where he is like Bond is in doing covert work all around the world, in knowing the right suspects to call upon when he needs help doing something shady or off the books, in having ready access to unlimited travel money and fake passports. And more to the point, he's a bit of a superhero. His boss, like Bond's, gives him absolute freedom to act alone, and he owes his triumphs to no one else.Le Carre's characters have the Circus behind them, with its army of minders. There's very little of that here. A point of similarity with le Carre is that Paul Christopher has a conscience, a la George Smiley, but without the depth of character le Carre gives his characters. McCarry does a good job capturing the early 60s feel of Saigon, maybe as well as le Carre captured the 50s and 60s feel of Berlin, and there are other points of comparison as well. But le Carre's spies are believable, and McCarry's isn't. That is the big difference to me, and the reason I compare Paul Christopher to James Bond.\"The Tears of Autumn\" has a great hook in that it explores a possible motive behind JFK's assassination. It's a page-turner, and despite dealing with 50- and 60-year-old events does not feel dated at all. I enjoyed reading it. I can't put Charles McCarry on the same tier as John le Carre, though."}, {"userName": "Michael Martz", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/32716591-michael-martz", "userReview": "'The Tears of Autumn' is supposedly a classic espionage novel by one of the genre's greats, Charles McCarry. I still can't believe I hadn't heard of either until about a month ago. I'm glad I'm finally on the bandwagon!The Tears of Autumn was published in 1974, when both the war in Vietnam and the assassination of JFK were still pretty fresh in everyone's mind. In the novel, Paul Christopher, a CIA 'lone-wolf' spy, begins to form an idea on who was responsible for Kennedy's death and wants to investigate in his own inimitable way. His superiors don't see how the dots connect so he's literally cut loose to go at it totally off the books. The plot follows him as he bounces between continents (which was a lot more complicated to do in those days) and begins to build and solidify his case. He encounters more than his fair share of really bad characters and deadly situations along the way and survives a number of harrowing close-calls. In the end, Christopher proves his theory but to what end?Since belatedly 'discovering' McCarry I've learned that he's one of the guys who has been considered the American version of LeCarre. I can certainly see why. His writing is flawless, dialogue is strong, and unlike a few of LeCarre's earlier novels there doesn't seem to be any 'dating' of the style. Tears of Autumn was written at least 43 years ago and is still fresh, although the action is a little slower paced than more recent efforts. Tears of Autumn is a wonderful example of the spy novel of the post-war era. I loved it and will continue to get further into McCarry's catalog."}, {"userName": "Jake", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/1401909-jake", "userReview": "(4.5) Having read dozens of JFK conspiracy theories, I was prepared to be bored by the \"revelations\" in this one but McCarry offers a unique take on the Kennedy assassination filtered through the lens of a cynical international operative. The story is gripping and the spycraft is engaging without being oversaturated (looking at you, Quiller Memorandum). I enjoyed The Miernik Dossier when I read it a few years ago, though I wasn't a fan of the format. In the meantime, I've heard dozens of voices praising Charles McCarry's work. I shouldn't have put it off for so long and will be reading another of his sooner than later."}, {"userName": "Jack Saltzberg", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/47044932-jack-saltzberg", "userReview": "A novel that has an entirely new solution to the who killed JFK debate. Fascinating, and way too plausible"}, {"userName": "David", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/5547564-david", "userReview": "Not just one of the many fiction books that explores a theory behind the assassination of JFK, but one of the first. The theory can be explained in one or two sentences, so this book is more about the character of spy Christopher Paul trying to connect the dots to present a case that, as any astute reader can guess, will be covered up in the end. The biggest positives of this novel are that it is very readable, the action is good and shows almost no sign of being dated, which is good for a 1974 thriller. Where the book falls short for me is that it is a series book, to be specific - the second book. With a story about one of the most famous assassinations in modern history, this needs to be told as a stand-alone book. This book spends too much filler time with protagonist Christopher Paul in a shallow way that only devoted series readers can appreciate in one book. Really, the time isn't that interesting. Though there's nothing explicit, it's funny how many sex scenes are mentioned in this 276 page novel. Thankfully, writers of spy fiction such as Tom Clancy and Daniel Silva have created much more interesting protagonists that keep the reader engaged when they're off work."}, {"userName": "Ted", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/2025981-ted", "userReview": "Charles McCarry comes highly recommended from friends and literary blurbs that call him a master of the (spy novel) genre and compare him to LeCarre. This is the first book in the Paul Christopher series, but likely my last. The problem for me isn't the characters, although some were maddeningly one-dimensional, but the plot which bounces from a Thai family dynasty to defecting Russian agents to Fidel's Cuba to post-colonial Africa, Chicago Mobsters and even a midget super thief who breaks in to homes by climbing down the chimney. Conspiracy theorists will love this orgy of JFK assassination plots, and the political and spy worlds are expertly rendered, but for me there was just too much to read and too little to grab on to."}, {"userName": "Amélie Rêverie", "userReviewDate": "Aug 27, 2012", "userURL": "http://www.goodreads.com/user/show/1169872-am-lie-r-verie", "userReview": "The Overlooked International Spy ThrillerIf you have an undying passion for John le Carré (think: Tinker, Tailor, Soldier, Spy), run directly to the bookstore and pick up former CIA agent Charles McCarry's Tears of Autumn. Originally published in the '70s and reissued in 2005, the book follows Paul Christopher—an American spy so cool and competent he makes James Bond look like a buffoon—through Vietnam as he pursues an unauthorized investigation into JFK's assassination. McCarry's writing is so vivid and lush, you don't have to be a conspiracy theorist to appreciate all the twists and turns."}, {"userName": "Tom", "userReviewDate": "Oct 24, 2008", "userURL": "http://www.goodreads.com/user/show/931469-tom", "userReview": "I was introduced to Charles McCarry via recommendations about A.J. Quinnell. I found a copy of Tears of Autumn and very much enjoyed the espionage story about investigating the Kennedy assassination abroad.McCarry writes authoritatively - having served as an intelligence officer doesn't make him want to describe how a watch is made when you want to hear what time it is.I've already set aside Christopher's Ghosts."}, {"userName": "Jon Spoelstra", "userReviewDate": "Mar 27, 2010", "userURL": "http://www.goodreads.com/user/show/2554036-jon-spoelstra", "userReview": "This is one of the first Vietnam books and JFK conspiracy books. I read it a long time ago, then re-read it about four years ago. I loved it the first time and that led me to read every Charles McCarry books. The five-star rating was for the first read. Strangely, the second read wasn't as entertaining. I would give the second reading a four star."}, {"userName": "Jeannine", "userReviewDate": "Jan 10, 2012", "userURL": "http://www.goodreads.com/user/show/6434883-jeannine", "userReview": "I was hoping to love this as much as I enjoyed William Boyd's \"Restless\".....however, it wasn't nearly as riveting as I hoped it would be. I found the characters one dimensional. Paul Christopher was so macho and unrelatable and the women were all pathetic. This was clearly written by a man.....a less fun version of James Bond without the gadgets."}, {"userName": "Susan Springer", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/2913578-susan-springer", "userReview": "McCarry writes with such logic and knowledge of foreign affairs about the events surrounding theassassination of President John F. Kennedy that his theories go beyond plausible to probable, afascinating look into the world of international espionage."}, {"userName": "Sandi", "userReviewDate": "Mar 18, 2012", "userURL": "http://www.goodreads.com/user/show/1185451-sandi", "userReview": "This was not a fast paced thriller but an excellently written spy novel that was filled with tension throughout and had one of the better fictional explanations for the JFK assassination. Listened to the audio version read by Stefan Rudnicki"}, {"userName": "Kevin", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/38436048-kevin", "userReview": "Too much broken dialogue and not enough plot. Major disappointment."}, {"userName": "Steve", "userReviewDate": "Mar 19, 2010", "userURL": "http://www.goodreads.com/user/show/1254714-steve", "userReview": "Contains one of the most fascinating -- and somewhat plausible-- JFK assasination theories that I've ever run across. One of the best spy novels, by someone other than Le Carre."}, {"userName": "Joshua Lax", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/2775789-joshua-lax", "userReview": "One of the best spy novels of all time."}, {"userName": "Mac", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/10270148-mac", "userReview": "I began The Tears of Autumn with optimism. McCarry is recognized among the best writers of espionage fiction, and Paul Christopher is McCarry's best character at the trade. Throw in an exploration of the Kennedy assassination along with an intriguing title, and I was set for some compelling reading. I did find Christopher to be an interested character; he's a well respected spy with scruples and a compulsion to uncover the truth. The Kennedy assassination continues to fascinate many decades later, and the story's proof of a wider conspiracy is fairly credible. Christopher's growing affection for Molly has more substance and emotion than a typical espionage novel; it seems more than a check-the-box romance.That said, I was disappointed. The story has too many characters with too many motivations (and too many axes to grind) in too many locations around the world. I turned the pages seeking relief, not a resolution to the story. I understand McCarry's name is uttered in the same breath as Le Carre. Maybe so for other readers, but based on The Tears of Autumn not so for me."}, {"userName": "False", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/4769446-false", "userReview": "How do describe this book? I am reading all of Charles McCarry right now, and this is one of his earlier works, Number Two of the Paul Christopher series, a secret agent who is a tour de force of action and enigma. Christopher, at the height of his powers, believes he knows who was truly behind the assassination of John F. Kennedy and why. His theory is so destructive of the legend of the dead president, thought, and so dangerous to the survival of foreign policy that he is ordered to desist from investigating. He is a man who lives by the truth and his internal compunctions force him into the heart of the matter. Threatened by the Kennedy assassins and his own government, Christopher follows his suspicions through Vietnam, Rome, Washington, Paris crisscrossing back and forth these paths, trying to reach the truth. The book is a study of power, a commentary of illusion. You will learn a lot about the mindset of the Vietnamese and their culture. The upper reaches of spy fiction."}, {"userName": "Roger Anderson", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/69731959-roger-anderson", "userReview": "Entertaining though not believable plot. I also liked its dark ambience. It does capture a sense of being a singleton CIA Political Action officer; however, Paul Christopher is a bit too precious with the huge number of languages he speaks and his gorgeous young girlfriend . . . reeks a bit of later Dan Silva novels, which ruins its realism."}, {"userName": "Viktor", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/7575260-viktor", "userReview": "Kindle edition has an amazing amount of typos. It's ridiculous."}, {"userName": "Howard Kaplan", "userReviewDate": "Dec 17, 2016", "userURL": "http://www.goodreads.com/user/show/35013986-howard-kaplan", "userReview": "McCarry is about the best less known suspense writer out there and probably the only American who comes near John LeCarre. This is one of his early novels, reminds me of the Spy Who Came in From the Cold, both shorter novels who were followed by larger even bolder works which do not overshadow the greatness of these earlier novels. This one is about the Kennedy Assassination, entirely timely today."}], "description": "Paul Christopher, at the height of his powers as a secret agent, believes he knows who arranged the assassination and why. His theory is so destructive of the legend of the dead president, though, and so dangerous to the survival of foreign policy that he is ordered to desist from investigating. But Christopher is a man who lives by and for the truth, and his internal compunctions force him to the heart of the matter. He resigns from the Agency and embarks on a tour of investigation that takes him from Paris to Rome, Zurich, the Congo, and Saigon. Threatened by Kennedy's assassins and by his own government, Christopher follows the scent of his suspicion - one breath behind the truth, one step ahead of discovery and death.", "title": "The Tears of Autumn\n      \n          (Paul Christopher #2)", "url": "https://www.goodreads.com/book/show/871695.The_Tears_of_Autumn", "average": 4.0, "cover": "https://images.gr-assets.com/books/1387347288l/871695.jpg", "reviews": 131, "authors": [{"url": "https://www.goodreads.com/author/show/64540.Charles_McCarry", "name": "Charles McCarry"}], "type": ["Fiction", "Spy Thriller", "Thriller", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/871695.The_Tears_of_Autumn", "http://www.goodreads.com/book/show/4311821-the-tears-of-autumn", "http://www.goodreads.com/book/show/263456.The_Tears_of_Autumn", "http://www.goodreads.com/book/show/1468783.The_Tears_Of_Autumn", "http://www.goodreads.com/book/show/18954712-tears-of-autumn", "http://www.goodreads.com/book/show/13398094-tears-of-autumn", "http://www.goodreads.com/book/show/11496389-the-tears-of-autumn", "http://www.goodreads.com/book/show/651044.The_Miernik_Dossier", "http://www.goodreads.com/book/show/574791.The_Last_Supper", "http://www.goodreads.com/book/show/16129294-the-shanghai-factor", "http://www.goodreads.com/book/show/1062193.Old_Boys", "http://www.goodreads.com/book/show/577030.Christopher_s_Ghosts"]}