{"ratings": 6584, "userreviews": [{"userName": "Kelly (and the Book Boar)", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "[They do, so yay. (hide spoiler)]"}, {"userName": "Edward Lorn", "userReviewDate": "Apr 17, 2012", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "Normally I would delete my old review and write another one, but my previous review is so epically bad that I want to show myself how far I’ve come not only as a writer but as a critic as well. (Wow… that sounded pompous as fuck. I mean, I know I’m awesome, but that shit’s uncalled for.) Anyfuck, if you want a good laugh, read on after the final judgment for my original review… *cringes*The Traveling Vampire Show has long been on my Top 20 Reads of All Time. Going into this reread, I was scared that would change. I’ve grown quite a bit, must’ve put on at least forty pounds since my last first read of this one. All jokes aside, the last time I visited Laymon’s Vampire Show, I was not a father. Shit, I hadn’t even met the woman who would become my wife. I had a pretty significant drug addiction, but, oddly enough, I remember almost everything that happens within these pages. I didn’t expect that to be the case. This book reminds me so much of my childhood: from vicious neighborhood dogs, to a foul-mouthed, constantly-horny best friend, and a gal pal that would become a first girlfriend. The book captures perfectly how fucking annoying it is to be sixteen and in possession of a penis. Things pop up at the most inopportune times and inject themselves into the situation. Ladies, imagine your vagina prolapsing anytime it feels like it. You’re just walking down the street, wearing a skirt, it’s laundry day and you don’t have your favorite neon-yellow Simpson’s thong on, when all of a sudden, you’re dragging your baby-maker behind you. That would be awkward right? (I’m laughing so hard right now. My apologies.)Okay, so getting a boner in public isn’t anything like that, but it is annoying. Some of us guys realize early that a woman’s body is her own and not our entitled-ass’ free-rein playground. We can be invited to play, but it’s not our property. I think this book touches on that subject. I appreciate that Laymon, who was known for writing consistently about rape, wrote something that touched upon male sexuality in a positive light. Yes, some of us are rapey as fuck. Some of us are douche-tastic semen balloons just waiting to explode on the next pair of tits that walks by. Most certainly, if a man rapes a woman, it is ALWAYS the man’s fault. Yet some of us respect women. Some of us understand that you’re a person first and a gender second. And, although we love looking when you dress up, we understand that that doesn’t mean were are entitled to see what’s underneath. All that is what sets this book apart from most of Laymon’s work. Sure, Rusty is a deviant little shit. But Dwight is constantly worried about what his dick is doing at any given moment, and his respect for Lee and Slim is real, even if he does like to look and fantasize. Dwight is a teenage boy. A damn well-written teenage boy. Rusty is not the norm, but there are pleny of Rustys in the world. That’s liable to offend some. But at least it’s honest. All that is what I feel The Traveling Vampire Show is truly about – the uncontrollable aspect of our sexuality and the beast within. That perception is not always reality, is something else Laymon tackles. The title suggests this is a book about vampires, but it doesn’t have anything to do with vampires. It has to do with being a teenage boy. Know that going in, and you should be fine.Finally, the ending is one of my favorite endings of all time. I would say it’s easily in my top five, but would hazard a guess that it’s actually in my top three. It comes out of nowhere, like a brick to the face. Damn powerful.In summation: The Traveling Vampire Show is still one of my favorite novels. Having grown up, I appreciate it even more. I remember being a teenage boy, and it’s nothing to be romanticized. We’re all idiots until about thirty, but even then, some of us never grow out of the boner-in-public stage.Final Judgment: That ending tho.Previous ReviewThis is, by far, Laymon's best work. I have read EVERYTHING the man ever wrote before he died in 2001. Next to Stephen King, no one has played a bigger role in molding me into the writer I have become. Laymon is not for everyone. He's a minimalist, never verbose, and can drum up a shock a minute while still developing characters. He has a penchant for borderline porn. If you're a prude, do not pick Laymon up. If blood and gore aren't your thing, STAY AWAY!What I love about The Traveling Vampire Show, has nothing to do with vampires. Because, in fact, the book doesn't have any vampires in it until the last couple pages. Not being a fan of vampires, but a fanatic of Laymons, I decided to read this anyway. This book is about the kids Laymon draws so well. Period. Their youthful adventures rival that of any youngsters King has EVER written about. I will forever be a fan of Richard Laymon because of this book. Even when he's bad, he's still rather good. ***** 5 StarsE."}, {"userName": "Dan Schwent", "userReviewDate": "Oct 05, 2015", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "Teenagers Dwight, Rusty, and Slim are an inseparable trio. When they see that the Traveling Vampire Show is coming to town, seeing the only vampire in captivity becomes the most important thing in the world. The Traveling Vampire Show is a coming of age tale akin to Stephen King's The Boy or Robert McCammon's A Boy's Life, taking place in a single day in 1963. As the title indicates, the story revolves around the three teenagers' quest to attend the Traveling Vampire Show. Straight-laced Dwight, tomboy Slim, and asshole Rusty all seemed a lot like people I knew at 16.Much like A Boy's Life, there's a lot of meandering. A lot of the book is the trio running from threats, real or imagined, and Dwight trying not to get hard around Slim or his sister in law. The addition of Bitsy, Rusty's sister, to the group showed the ugliness lurking beneath the surface of a couple characters.I didn't mind that the Traveling Vampire Show doesn't make an appearance until the end. I did think it was unrealistic that they actually went given all that transpired early in the day. I also had some difficulty buying the others being friends with Rusty given what a selfish asshole he was.The ending was actually pretty bad ass. I knew someone had to die before the story was over and there was death aplenty. I also liked that there were a lot of unanswered questions. Do any of the characters make appearances in subsequent Laymon books?The Travelling Vampire Show is an entertaining coming of age tale but I wouldn't put it on the same tier as The Body or A Boy's Life. 3.5 out of 5 stars."}, {"userName": "Michael Fierce ", "userReviewDate": "Nov 04, 2011", "userURL": "http://www.goodreads.com/user/show/6880123-michael-fierce", "userReview": "So you know, I've been a Richard Laymon fan for 30 + yrs now, having gotten into him while searching for a list of books recommended by Stephen King while visiting The Dark Carnival, in Berkeley, CA, my favorite bookstore. The handful of books I have by Mr. Laymon, I've read several times and thought they were good, some frighteningly good ~ with the exception of The Stake which I have tried to read a few times and it just never bit me hard enough to keep me craving for more.So far, my favorite by him was Resurrection Dreams and if you like your horror with humor, you might just love it. Besides, it's about zombies...the best trendy thing since Halloween became a holiday. Funland was eerie, scary, and demented. Midnight's Lair was creepy and memorable. His characters are always entertaining, in a head-shaking sort of way, and fun to watch what materializes for them on the road ahead. \n  ...and to see what's just around that next corner.\n  His dialogue is fitting for the time & place, either steeped with dark humor or hellbent on making you laugh while you silently scream \n\"NO!\"\n, and I believe no book of his could reach its end without a character or few being as naïve as feeder fish in a shark pool.His stories are ripe with violence, blood red gore, full of sexual perversions, and horror galore. Perfect if you axe me.\n  ...and why he's been lauded by such notable authors as Stephen King, Brian Keene, Joe R. Lansdale, Jack Ketchup, Dean Koontz, Tim Lebbon, Edward Lee, Bentley Little, Simon Clark, and a slew of others, as one of their fave authors.The Traveling Vampire Show is Laymon's stab at Something Wicked This Way Comes, as if written by a zero conscience Stephen King. Recommended!!!!!*If you like this sorta thing check out my bookshelf: dark-carnival-night-circus.**If you are a book connoisseur like me, track down the 1st print of the paperback with embossed lettering. It's a great book to add to your Dark Carnival/Night Circus Horror collection."}, {"userName": "Horace Derwent", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/54083442-horace-derwent", "userReview": "i want somebody to tell me, answer if you can; i just want somebody to tell me, what is the soul of a man?--Ramblin' Jack Elliottwhen you look over your shoulder, can you just see america's been left behind your back? can you feel the ineffable silence which has fallen onto life? and do you feel that you're alone?last month, when me and my friend sat beside the sidewalk while he had his break during his work of gym card sales(he gave out leaflets then), we supped beer and nibbled dry pork knuckle slices then i asked, do you believe in ghosts?no, that's not possible, and who cares? came the replythen i said, i'd rather choose to believe, if you don't see something exist that doesn't mean it's really non-existingso you can prove ghosts are real? question offeredi just answered with a question, you can't prove they don't exist, right?~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~i feel something more bitter from those pages this time, i just can sense and taste itall i wanna do is to perceive this world with open eyes, it's not easy, really. emotions, affections, confusions and temptations, doubts and hates and desires, many many shits, you can't keep an open mind all the timei mean, the more true things you learn, the more pain you are ini just hope those authors' works can help me stop sinking down and get unfucked in this knowledge fermenting world, this world is not a temple, it might be just the asshole of some god of which i struggle to creep myself out thruthat's it"}, {"userName": "Chandra", "userReviewDate": "Mar 23, 2009", "userURL": "http://www.goodreads.com/user/show/1093377-chandra", "userReview": "This. Book. Sucked.Okay, first the plus side: Slim is awesome.And that's about it for the plus side.On the minus side: We have to see the awesome character Slim through the eyes of this annoying teenage boy who spends nearly ever scene she's in describing her butt. Also on the minus side: Pretty much all the other characters were downright annoying. I was very disappointed they didn't ALL (except Slim) die horrible deaths at the end.Once again on the minus side: This book was painfully BORING and full of descriptive descriptions describing descriptive things that don't need to be described. Picture Twilight, but about 5 times worse. (Yeah. Preeee-ty bad.) For example: in one of the flashbacks, they go into all this detail about how they ate milk duds at the movies. This, by the way, had nothing to do with anything. Ooh, or how about when they made burgers? Did I need to know that the characters both love cheese on their burgers, and also that they like their burgers thin so that the inside isn't raw?No. No I did not. And it didn't build suspense, like I know it was supposed to. No it did not. It just made me want to throw the book at a rabid squirrel and watch it chew the thing to pieces, but I couldn't, because it was a library book.And that made me very sad, and pretty much ruined the rest of my day.It's sad that a cool character like Slim can be in a book, and it can still be pretty much the worst book I have ever read in my life."}, {"userName": "Bark", "userReviewDate": "Mar 12, 2010", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "I've read a few Laymon novels with varying levels of enjoyment. Resurrection Dreams  I enjoyed for its gory over-the-top fun but I just couldn't get into  Flesh  or  Funland .Despite its title this book is not about vampires. It's about three 16 year old friends and their fascination with visiting the upcoming vampire show. It has moments of gore but mainly it's a coming of age tale focusing on these young kids. The lusty thoughts which I've come to expect from a Laymon book, and which usually crack me up for their out of place silliness, fit these characters and added to the tension of the book. The book takes place in the 60's when drive-ins were much more commonplace and the whole book has the feel of a good scary drive-in movie. It begins when these three hike out to an abandoned field reputed to be the dumping ground of a serial killer hoping to get a glimpse of the vampire before the crowds arrive. Instead they have a bad run-in with a mangy, possibly rabid dog and one of the kid's witnesses something she shouldn't and then weird things begin to happen and they suspect they're being taunted by the vampire folks. It's not until the very end of the book that the all out blood bath begins (and we learn some ugly things about some of our characters) but the tension leading up to it and the nice character study held my attention throughout it's 300+ pages. To date, this has been my favorite of all of the Laymon novels I've read."}, {"userName": "SUSAN   *Nevertheless,she persisted*", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/27255867-susan-nevertheless-she-persisted", "userReview": "This was my first Richard Laymon book and it won't be my last.It was a book that was beautifully done. It was a coming of age story that had characters that I fell in love with. This book was filled with girl power, Slim and Lee were powerfully written. They were brave,true and strong. When Slim quoted a few lines of the St.Crispin's Day speech from Shakespeare's Henry V.,I was verklempt. It was a pleasure to read a horror novel with strong female characters.And what can I say about Dwight,a hero worthy of Slim. Strong,sweet,brave and loyal.I loved the story but I loved the characters more.  Mr.Laymon wrote a book that was more than a horror novel. It is novel about honor, discovery, loyalty, compassion, friendship, young love, young lust and friendship...the vampire was the cherry atop a terrific book."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "I actually read this book twice. The first time I didn't care for it all that much. Maybe it was because I had just read Dan Simmon's classic SUMMER OF NIGHT, and THE TRAVELING VAMPIRE SHOW was the follow-up. Was I subconsciously comparing the two? Could be...Years later I got to wondering if maybe I missed something in Laymon's writing. I love coming-of-age stories and vampires, so I decided to give the book another shot. I'm so glad I did! This story is sad, funny, scary, and just a plain good time as the reader follows the summer adventures of this group of kids. Great fun!!!"}, {"userName": "Amy", "userReviewDate": "Jun 10, 2008", "userURL": "http://www.goodreads.com/user/show/1133843-amy", "userReview": "This book is much different from other Richard Laymon books I have read, lacks the sex and gore typical of his books, and moves at a much slower, suspense-building pace. I absolutely loved it! It is hot, the summer of 1963, and three teenagers, Dwight, Rusty, and Slim, are anxious to see the one-night-only performance of The Traveling Vampire Show, which claims to have the only living vampire in captivity, Valeria, at the legendary Janks Field. As soon as they head out to Janks Field to get a sneak peak at Valeria, bad, mysterious things begin to happen. The entire story spans one long day, with occasional mention of past events to help better understand the three main characters, and ends with a bang. I highly recommend this book. It is one of my favorite Laymon reads to date, but if you prefer typical Laymon, you may not enjoy this one as much."}, {"userName": "Anthony Vacca", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/27183668-anthony-vacca", "userReview": "The Traveling Vampire Show comes at the end of The Traveling Vampire Show because The Traveling Vampire Show is The Traveling Vampire Show’s metaphor for death, in particular, the death of sexual innocence and how that death defines the kind of person you will become if you survive The Traveling Vampire Show. Got me? This later, Bram-Stoker-Award-winning novel by Laymon is what counts for a “mature work” in the oeuvre of an author who had previously published a novel titled Flesh and another featuring rat people with a propensity for rape. This time around, the narrative is preoccupied with the details of an endless day of summer shared between three teenage friends, and how our narrator realizes his own romantic feelings for one, and his increasing unease with the oafish sexism of the other. Laymon’s characterization is often cartoonish, his plotting contrived, and his horror sleazy; however, it mostly works here, especially since Laymon seemed hell-bent on writing some strong female characters, even if he can’t help but do so through a sexed-up lens. Metaphor aside, the finale is a grisly riot, featuring a high body count and nude wrestling with a vampire that is essentially Vampirella. Breezy but disturbing, heartfelt but libidinous, The Travelling Vampire Show turns memories of adolescence into a celebration of sex and death. Like if Federico Fellini had tried his hand at directing an American grindhouse film."}, {"userName": "Mary", "userReviewDate": "Jun 16, 2008", "userURL": "http://www.goodreads.com/user/show/1243240-mary", "userReview": "This is the first Richard Laymon book that I read and the last he wrote before he died. It is an amazing book and won him posthumously the Stoker award of 2001. Though Laymon is not for everyone, his writing is filled with graphic nudity and often quite disturbing violence and images, many of his stories have a coming of age aura to them, and every book of his that I have read I was literally unable to put down until I finished it. He has definitely become one of my favorites. And I cannot recommend this book enough, especially to those unfamiliar with his work."}, {"userName": "Audrey", "userReviewDate": "Sep 24, 2008", "userURL": "http://www.goodreads.com/user/show/267866-audrey", "userReview": "I was totally disappointed in this book. I was expecting a chiller, and instead got a book about teenagers killing time. Halfway through the book we watched the protagonists do laundry, LAUNDRY! We don't even get to the Vampire Show until after page 400, and then the whole plot goes inexplicably bonkers. There were all sorts of loose ends left throughout the book that I was waiting to be resolved, but just left me with a bitter 'wtf' flavor in my mouth."}, {"userName": "Quentin Wallace", "userReviewDate": "Nov 19, 2014", "userURL": "http://www.goodreads.com/user/show/33274222-quentin-wallace", "userReview": "[ I'm guessing Slim, the female MC, ends up a serial killer since it's hinted she killed her abusive stepfather and at the end of the novel she's murdering people left and right, which was just so strange. And the character of Bitsy was bizarre as well. Every character seemed a little off now that I think about it! (hide spoiler)]"}, {"userName": "Layton", "userReviewDate": "Jan 18, 2013", "userURL": "http://www.goodreads.com/user/show/7675118-layton", "userReview": "Slim is awesomeRusty is nasty and crudeRichard Laymon was a fucking pervertI'm pretty sure about that too"}, {"userName": "Vicki Willis", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/32195771-vicki-willis", "userReview": "Every time I read something by Richard Laymon I think to myself, why don't I read more of him? This was no exception. This was a fantastic book that every time I picked it up I didn't want to put it down. Vampires really aren't my thing, but this was much more than a vampire story. It was about 3 teenagers and a few sidekicks out on an adventure. It brought me back to the times of my childhood before cell phones when kids were able to run amuck all summer all over town. The tension ran high throughout and I was constantly guessing where it would go next. There was some side and back stories that kept it interesting and Laymon was able to switch to those timelines seamlessly. There also, of course was the teenaged boy sexual angst and lots of breast oogling that Laymon includes in his books. Overall, an excellent read, probably my favorite Laymon book to date. I highly recommend it."}, {"userName": "Kaisersoze", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/22517400-kaisersoze", "userReview": "[Voluntarily opt to jump in a cage with a vampire after it's just gutted its previous adversary? Suuuure! You're hot and I haven't had any. Who cares if I die?... (hide spoiler)]"}, {"userName": "Rade ", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/8187431-rade", "userReview": "[there is no damn vampires at all. Thanks for the misleading title Laymon, you jerk! (hide spoiler)]"}, {"userName": "Kristen", "userReviewDate": "Apr 25, 2008", "userURL": "http://www.goodreads.com/user/show/1116185-kristen", "userReview": "I didn't have high hopes for this book after having read the Beasthouse Series, which although not bad, was fairly bland for my tastes. I was pleasantly surprised by this story, which was far more heartfelt and character driven. The entire story takes place in less than 24 hours, though a few flashbacks add into the depth of the tale. The story revolves around 3 friends - Dwight (who is the voice of the book), Rusty, and Slim (who changes her name depending on her favorite book at the moment). Much of the book is a coming of age story about the three of them, coming to grips with the changing of their friendships, the discovery of sexuality, and the brutality of the world. Although the \"Traveling Vampire Show\" comes up right in the beginning, we don't actually get to it until the last 50 pages or so of the book. Up until that point the teens are dealing with rabid dogs, strange intruders, bickering amongst each other, and plotting to get into the 18 and up Vampire show without their parents discovering the plan. Of course in typical Laymon fashion the ending is filled with violence and no-one is safe from death in his books. I don't think this book is a world changing piece of literature, but it is a very entertaining read."}, {"userName": "Katy", "userReviewDate": "Jun 03, 2011", "userURL": "http://www.goodreads.com/user/show/5552109-katy", "userReview": "Most of Laymon's books, as I read them, I ask myself \"what is WRONG with me? I must be SICK to enjoy this stuff!!!\" But this was a (relatively) lighter fare - sort of a coming of age fable, in a way. And, well, I enjoy anything having to do with vampires - as long as the vampires don't (completely) lose . . . :-)= That said, this, like any Laymon work, isn't for the faint of heart, nor for those who are looking for a happily-ever-after ending. Laymon wrote TRUE horror, which is becoming increasingly rare these days - even King is writing happy endings nowadays. It is truly inspiring. I had to leave off a star for the inexcusably terrible copy editing job - at least in my edition - which frequently caused me to shift out of the mood (who are they hiring to do this these days? Do they even speak and write English? Have they heard of SpellCheck? Yeesh - even THAT would catch SOME of the errors . . .). However, overall, this is one of the most fun Laymon pieces I've read."}, {"userName": "Adam Light", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/7004622-adam-light", "userReview": "I liked the concept, and the execution was nearly spot-on; the story is set in the early sixties and was rich with details from that era. The characters were very life-like. There was a lot of the author's trademark off-beat humor infused into the narrative, as well.This story was suspenseful, and built to a pretty satisfying conclusion, and it was almost perfectly paced. I bought it for my Kindle Fire, and have to point out that there were many typos and the author's name popped up in the middle of words here and there throughout the book. Not sure how that could happen, and it really wasn't terribly distracting, just making an observation.My expectations may have been set a notch too high - this book won the Bram Stoker award the year it was published, after all - or maybe I was expecting something more brutal and overboard like Laymon's Into The Fire. I wasn't exactly let down, but I was not blown away by this book, either.This was kind of like Laymon-lite."}, {"userName": "Victoria", "userReviewDate": "May 11, 2010", "userURL": "http://www.goodreads.com/user/show/3049657-victoria", "userReview": "Wow! I REALLY enjoyed this book. So much so, that I stayed up WAY too late to finish it because it was just so suspenseful. I seriously could not put it down for even one second! I really liked the writing style, not to mention the very-charming characters. And while not everything was explained, it somehow didn't bother me as much as it normally would... everything just worked. And the author is from Illinois!! I will DEFINITELY be keeping an eye out for other books by him! What an exciting thing to find a new author with such an extensive backlog of books to discover!"}, {"userName": "Rebecca McNutt", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "The author has a real talent for capturing the nostalgia of the early Sixties and for using descriptive vocabulary, but the vampire thing was really unoriginal and unmemorable."}, {"userName": "Oscar", "userReviewDate": "Apr 26, 2014", "userURL": "http://www.goodreads.com/user/show/1754850-oscar", "userReview": "Estamos en una calurosa mañana del año 1963, en un pueblecito norteamericano llamado Grandville, donde conocemos a una pandilla de amigos de dieciséis años, Dwight, Rusty y Slim, siendo esta última una chica cuyo verdadero nombre es Frances, aunque nunca los usa. Será Rusty quien ponga en antecedentes a sus amigos sobre una gran noticia: El espectáculo ambulante del vampiro llegará esta noche al pueblo para dar una única función en el llano Janks. El interés de dicho espectáculo radica en Valeria, una vampiresa, que obsesionará a los jóvenes, hasta el punto de querer saber realmente si es tan hermosa como suponen. Pero hay un problema, el espectáculo es para mayores de edad. ¿Y qué se les ocurre? Acudir inmediatamente al llano Janks para espiar a los feriantes y si es posible ver a Valeria. El día no ha hecho más que empezar, en lo que será el día más terrorífico de sus vidas.La novela ‘El espectáculo del vampiro’ (The Travelling Vampire Show, 2001), ganadora del Premio Stoker en 2001, está narrada en primera persona por Dwight, en una historia en la que la tensión y el suspense van en aumento página tras página. Los capítulos son cortos y adictivos, no puedes dejar de leer. La trama transcurre pausadamente, calando en el lector, hasta llegar a una parte final excesiva, sangrienta y sorprendente. Apenas si hay algún salto en el tiempo, necesario por otra parte para conocer el pasado de los personajes. Ya desde los primeros capítulos, donde se nos da a conocer el llano Janks, un lugar en el que sucedieron hechos atroces, una zona yerma, con agujeros y cristales por doquier, queda clara la atmósfera en la que se va desarrollar la acción. La carga sexual en la novela es constante (hormonas desatadas) y aparece hasta en los momentos más escabrosos. En cuanto a los personajes, están bien definidos y son carismáticos y creíbles.Leer a Richard Laymon me ha recordado al alter ego de Stephen King, Richard Bachman, por la falta de escrúpulos y las escenas sangrientas. De Laymon se ha dicho que es Stephen King sin conciencia, algo que me parece excesivo. Laymon no escribe alta literatura; tampoco escribe mal. Lo único que pretende es entretener, sin mayores pretensiones, como si de un escritor pulp se tratase."}, {"userName": "Steve", "userReviewDate": "Apr 09, 2010", "userURL": "http://www.goodreads.com/user/show/1254714-steve", "userReview": "It's got some padding in it (like all Laymon books), but it's never boring like it often is in King's books,and the pages fly by. Laymon's teenagers are among the very best in Horror Lit. They have one thing in mind: SEX. Outrageous, insane, but also fun. Let's see: a crazy ass dog that looks like a cousin of the one in The Road Warrior, a traveling vampire show that recalls Bradbury's Something Wicked, but with horny teenagers and nude wrestling. Even some Lovecraftian weirdness at the end. Probably the best Laymon I've read."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Mar 23, 2009", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "I must say this is the most unusual coming of age story I've ever read. It's also a different twist on vampires, and one of those books where you're never quite sure what actually was going on. This one is pretty gory, but enjoyable. Although the main characters are all kids, this one is not a good book for a very young reader (less than 16 years of age)."}, {"userName": "Tim", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/51688634-tim", "userReview": "Ach Laymon, das war leider irgendwie nichts. 😪 2,5 Sterne"}, {"userName": "Jeremy Bates", "userReviewDate": "Apr 24, 2012", "userURL": "http://www.goodreads.com/user/show/5709335-jeremy-bates", "userReview": "Stephen King said it best: “If you’ve missed Laymon, you’ve missed a treat.”I came across The Traveling Vampire Show by Richard Laymon by fluke. But as soon as I finished it, I read another four or five Laymon books in a row. He is somewhat hit or miss, but The Traveling Vampire Show was a bullseye. Moreover, it is the last book he wrote before he died, and it won him the Bram Stoker award (posthumously) in 2001.Like many of Laymon’s work, this is a great coming of age story involving a bunch of teenagers messing around in the 1960s. Dwight is the protagonist, a good guy with a crush on his friend’s much older sister. Then there’s Rusty, the requisite fat sidekick, and Slim, the young tomboy. The three of them find an ad pinned to a telephone pole for–you guessed it–a traveling vampire show in nearby Janks Field. The catch: It’s at midnight and for adults only.According to the blurb: The Traveling Vampire Show is the tale, told in Dwight’s own words, of what happened to him, Rusty and Slim on that hot summer day they hiked to Janks Field. It’s the story of their friendship and love, their temptations, their betrayals, and their courage as they went where they shouldn’t go, did what they shouldn’t do…and ran into big trouble.If you liked The Body (aka Stand By Me), you should enjoy this one also."}, {"userName": "Ryne Barber", "userReviewDate": "Apr 14, 2009", "userURL": "http://www.goodreads.com/user/show/1513500-ryne-barber", "userReview": "To be honest, I had never read a Richard Laymon book before this one. I had barely even heard of him. His name gets so bogged down with the weight of names like Stephen King that one can go years without experiencing one of Laymon's novels. Yet I picked The Traveling Vampire Show out at a Barnes & Noble, wanting to read what everyone was talking about, and was sure glad that I did.Laymon's 2000 Bram Stoker award-winner takes us all back to the 1960s (or in my case, for the first time), focusing on a boy named Dwight and his friends, Slim and Rusty. They're all 16 and out of school for the summer, looking for things to do, and one day they find out that a traveling vampire show is coming through their town, with a supposedly lovely mistress as the vampire. It's also an 18+ show, which spikes their interests more - will there be violence? NUDITY? Through the help of Dwight's brother's wife, Lee, they get tickets for the show, but encounter some problems along the way because of Rusty's little sister. For a while, the three friends think that the weird vampire show workers are out to get them for killing a dog, but they find out all of the mischief was just a prank. But when Lee, Rusty, Dwight, and Slim finally make it to the vampire show at midnight, they find out that Valeria really is the lovely and fearsome vampire that they thought she would be, but they weren't expecting all that they got themselves into.Laymon's ride to the past is amazing, especially because of his characterization of the three teens. The sexuality that runs rampant through Dwight's mind is not exaggerated, but is a reality of a pubescent mind that can't stop thinking of the opposite sex - and naked too. It's true to life and allows the reader to relate to Dwight, whether male or female, because his thoughts are uninhibited. We can get closer to him because we are deep in his psyche.It helps that all of the characters have some really distinguishing characteristics. Rusty is a chicken who tries to act tough, and though Dwight and Slim are best friends with him, they soon tire of his macho attitude. There's also an undercurrent of strangeness running through him and his little sister that is presented but not dealt with in the book that leaves the reader wondering. Slim is a tomboy, but a feminine one who likes boys, especially Dwight. When the two get together towards the middle of the book, it feels right and not cliched because it doesn't just magically happen as the book closes. It's already been established from the beginning, and it doesn't feel like love at first sight. Lee is one of the cutest characters; Laymon's description of her is very flattering and the reader will have a crush on her just as Dwight does.What I liked so much about the book is not the violence of the end finale, which is intense and a great closing to the novel, but the fact that Laymon doesn't jump right into the vampire show. He spends more time with the teens, giving them a deep background and building their relationships up so that there's a real shocker at the end. The backstories that Laymon writes about build off of normal teenage adventure stories but add originality to both tone and event. It feels like it actually happened at one point or another, and the bit about Halloween really made me yearn for the holiday.The Traveling Vampire Show is not full of action or violence, though, and if one goes in expecting an onslaught of vampires and death, one might be surprised and a little disappointed. But the horror is still found with every turn of the page - it may not always be a literal monster, but Laymon is always tackling some emotional monster of being a teen or what it feels like to be in puberty that adds a suspense through the whole novel. It's an emotionally charged, fun ride through a host of creative experiences that leaves you wanting more as you flip the back cover closed. I'll pick up another paperback by Laymon any day."}, {"userName": "Natalie", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/4936267-natalie", "userReview": "Do you know the whole frog in boiling water scenario? You start the poor little froggie in cold water and as it heats up, he doesn't realize that it's about to boil him to death. Reading horror is a bit like that. I don't typically read \"horror\". I avoid Stephen King and Dean Koontz and as much as I love the epic Neil Gaiman, the first Sandman book scared me to death...I just don't like it. Spooky is good. Mysterious is good. Horror...nope and nope.Things were going great with Richard Laymon. It was creepy, but the writing sucked me in and it wasn't too creepy. Dwight and Slim were great characters. I wanted to punch Rusty. Pretty much every horrid thing was his fault. I was rolling along, enjoying something different, until about the last 1/5 of the book. That's when things took an unexpected turn. Like I said, I'm cool with scary, what I'm not cool with is depraved, and that's the only word I can think of for the end. It was pretty horrible and it didn't make much sense. CAUTION: MAJOR SPOILERS BELOW!Slim and Dwight were great. Slim was a character I would love to learn more aobout. She went through a lot of crap but somehow managed to stay kind and fair. Obviously she had some issues, but for the most part she held herself together. Rusty is the worst. He's so horrible. I don't know why they were friends with him in the first place. Everything about him was nasty. And I have to say, after what he did in the cage, I don't feel bad about what happened to him. Nothing makes me more furious. Honestly, it made me want to throw up. I didn't get Lee at all. Honestly, I thought she was pretty horrible. Why she would ever take the kids to that place is beyond me. And she's a teacher?! She should be fired. And she seemed to want to be the new \"vampire\" at the end. What the hell was that? It was just too weird.Bitsy's bit was pretty obvious. She was a creeper too. Their whole family was totally messed up, which probably means some raunchy stuff was going on inside. I don't really feel bad about her either. And can we just talk about how they slaughtered a whole field of people at the end and didn't feel bad at all. Not that I feel bad either. All the people that were murdered were awful, but still...I think it should've been at least a little traumatizing. I'm on the fence if I'll read more Laymon. I was sold on a 4 or 5 star rating until the end. It went too far."}], "description": "Though gloomy with clouds, it is a hot, August morning in the summer of 1963. All over the rural town of Grandville, tacked to power poles and trees, taped to store windows, blowing along the sidewalks, fliers have appeared announcing the mysterious one-night-only performance of The Traveling Vampire Show.The show will feature Valeria, the only known vampire in captivity. According to the fliers, she is a gorgeous, stunning beauty. In the course of the performance, she will stalk volunteers from the audience, sink her teeth into their necks and drink their blood!For three local teenagers who see the fliers, this is a show they don't want to miss. But they may have to.Though they can probably scrape up the price of admission, other obstacles stand in the way. One problem, nobody under 18 years of age is allowed into the show. Dwight, Rusty, and Slim are only 16. Another problem, the show begins at midnight and the three teens always have to be home by then. If that weren't bad enough, the show is to take place at Janks Field -- a desolate patch of ground with a nasty history -- that has been declared off limits by their parentsThe situation appears hopeless.Though Dwight and his friends fear they won't be able to attend the actual performance of the Traveling Vampire Show, they do have the entire day to themselves. Why not hike out to Janks Field and take a look around? With any luck, they might be able to watch the crew make preparations for tonight's performance. If they're really lucky, maybe they'll get a peek at Valeria, the gorgeous vampire.And so the three friends set off on foot for Janks Field...Dwight is a solid, honest kid, long on common sense and loyalty to his friends. He always tries to do what's right.Rusty is a husky guy who relishes trouble.Slim, their long-time pal, is the brains of the outfit, a voracious reader of novels, an aspiring writer, and a girl. Also, she is sometimes too brave for her own good.The Traveling Vampire Show is the tale, told in Dwight's own words, of what happened to him, Rusty and Slim on that hot summer day they hiked to Janks Field. It's the story of their friendship and love, their temptations, their betrayals, and their courage as they went where they shouldn't go, did what they shouldn't do...and ran into big trouble.", "title": "The Traveling Vampire Show", "url": "https://www.goodreads.com/book/show/613605.The_Traveling_Vampire_Show", "average": 3.85, "cover": "https://images.gr-assets.com/books/1321692829l/613605.jpg", "reviews": 362, "authors": [{"url": "https://www.goodreads.com/author/show/83937.Richard_Laymon", "name": "Richard Laymon"}], "type": ["Horror", "Paranormal", "Fiction", "Fantasy", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/613605.The_Traveling_Vampire_Show", "http://www.goodreads.com/book/show/145166.The_Travelling_Vampire_Show", "http://www.goodreads.com/book/show/1888557.The_Traveling_Vampire_Show", "http://www.goodreads.com/book/show/8272217-the-traveling-vampire-show", "http://www.goodreads.com/book/show/6340369-el-espect-culo-del-vampiro", "http://www.goodreads.com/book/show/13519636-die-show", "http://www.goodreads.com/book/show/145152.The_Cellar", "http://www.goodreads.com/book/show/201644.Island", "http://www.goodreads.com/book/show/147590.Endless_Night", "http://www.goodreads.com/book/show/201642.In_the_Dark", "http://www.goodreads.com/book/show/1408049.The_Beast_House"]}