{"ratings": 8262, "userreviews": [{"userName": "Richard Derus", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: 2* of five The Publisher Says: Brimming with charm and whimsy, this exquisite novel set in the Tower of London has the transportive qualities and delightful magic of the contemporary classics Chocolat and Amélie. Balthazar Jones has lived in the Tower of London with his loving wife, Hebe, and his 120-year-old pet tortoise for the past eight years. That’s right, he is a Beefeater (they really do live there). It’s no easy job living and working in the tourist attraction in present-day London. Among the eccentric characters who call the Tower’s maze of ancient buildings and spiral staircases home are the Tower’s Rack & Ruin barmaid, Ruby Dore, who just found out she’s pregnant; portly Valerie Jennings, who is falling for ticket inspector Arthur Catnip; the lifelong bachelor Reverend Septimus Drew, who secretly pens a series of principled erot­ica; and the philandering Ravenmaster, aiming to avenge the death of one of his insufferable ravens. When Balthazar is tasked with setting up an elaborate menagerie within the Tower walls to house the many exotic animals gifted to the Queen, life at the Tower gets all the more interest­ing. Penguins escape, giraffes are stolen, and the Komodo dragon sends innocent people running for their lives. Balthazar is in charge and things are not exactly running smoothly. Then Hebe decides to leave him and his beloved tortoise “runs” away. Filled with the humor and heart that calls to mind the delight­ful novels of Alexander McCall Smith, and the charm and beauty of The Guernsey Literary and Potato Peel Pie Society, The Tower, the Zoo, and the Tortoise is a magical, wholly origi­nal novel whose irresistible characters will stay with you long after you turn the stunning last page. My Review: A couple whose marriage has crumbled under the weight of grief for their dead son live on in silence. Cutesy things happen to them. She leaves him. Cutesy things keep happening to them. The characters around them, all nonsensically daffy and wacky, do a variety of handstands and pirouettes for our amusement. She comes back to him, and all ends with a nice, pert little bow slapped on the fanny of the book.I gave it two stars because I laughed out loud twice. And then I stopped.Do not read unless you're in a desperately bad mood and want to become so furious you'll forget why you were grumpy, or you feel the need to immerse yourself in a vat of sugary stickiness and squoodge it between your toes and pack it into each orifice on your person before being rushed to the hospital for insulin therapy. Repetitious verbiage-o-phobes are strongly cautioned. \nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Oct 12, 2013", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "3 ½ stars rounded up to 4. Years ago my Canadian niece landed a summer job (how'd she do that - some places will hire anybody) as a tour guide at the Tower. To this day get a few cocktails in her and she’ll regale you (much to the annoyance of her husband) with stories of hanging out with Beefeaters. She adored them - so when I saw this I just HAD to read it. It backs her up - Beefeaters do have their own private pub where they pursue their favorite pastimes – hard drinking, tourist bashing and playing monopoly into the wee hours.Picked this up looking for something original and amusing - didn't disappoint- I'm pegging it realistic fiction. I know, I know, but it's my review...A story of everyday people who happen to have unusual jobs all dealing with life's challenges in admittedly odd ways (hey, whatever works) without ever losing their admirable British stoicism. Julia Stuart juggles a ton of storylines and characters (prepare to pay attention) skillfully, I ended up empathizing with most of them despite how WEIRD they were. Balthazar is a Beefeater assigned and ill-prepared for the duty of caring for a menagerie of exotic animals. \"Out of the deathly silence came the mournful wail of the solitary wandering albatross that mated for life.” That it failed to settle broke my heart while the instructions “Remember to keep the lovebirds separated. They hate each other …”cracked me up. See the books like that, an admirable blend of melancholic drama & humour. His wife Hebe works for London Underground’s Lost Property office, actually preferred her stories to Balthazar’s. Heads up, this is more than light fare. There’s a theme of loss woven throughout, with Hebe & Balthazar the loss of their son - a lesson on how we must learn to allow each other to deal with it in our own time and in our own way. Put me in mind of The Unlikely Pilgrimage of Harold Fry – if you liked that I suspect you’ll like this as well. Cons:  While you’ll pick up interesting historical tidbits about The Tower I was expecting more about it’s famous ravens. So many fascinating stories surround these mystical birds yet they were barely touched on- huh (:Humour bite:  “Your mother is in India trying to find herself. God help her when she does”"}, {"userName": "Melki", "userReviewDate": "Feb 24, 2012", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "Even though I want to hug this book, and love this book, and stoke its spine, that doesn't mean it's cutesy - because IT'S NOT. It's just that all the characters are so lovable, I don't want to let them go.We'll start with Balthazar Jones, a Beefeater, whose duties as a guard of the Tower of London require him to live within its walls. He is a student and collector of rain, and the newly appointed zoo keeper of the Tower's menagerie. His wife, Hebe, works at the Lost Property office of the London Underground. Strange and wonderful items are turned in every day, varying from false teeth to yellow canoes. She does her darndest to reunite the items with their owners. Then there's Reverend Septimus Drew, who is \"as sane as can be expected from a member of the clergy.\" He hides two secrets - his love for the local barmaid, and his other identity as Vivienne Ventress, an award-nominated writer of erotic fiction. In an effort to attract more visitors to the Tower, the powers-that-be have decided all of the animals that have been given to the Queen by visiting dignitaries should be moved from their current home at the London Zoo to new accommodations within the Tower. The move itself is loads of fun with too-tall giraffes and escaping penguins. The creatures prove to be a huge hit with the tourists, but cause problems for some of the Tower residents.The animals themselves, though thankfully NOT anthropomorphized, are delightful characters, from a pining, lovesick albatross, to a bearded pig, who loves to play ball and is gifted at comforting the lonely. Though not exactly a compelling read, I really enjoyed this unusual tale that managed to keep the tone lighthearted, while at the same time throwing in historical tidbits concerning the Tower's bloody past."}, {"userName": "Lydia Presley", "userReviewDate": "Mar 27, 2011", "userURL": "http://www.goodreads.com/user/show/50581-lydia-presley", "userReview": "This book made me laugh out loud so many times that my sides began to hurt. Normally I breeze through books quickly, but this one I savored, loving every minute of it. I'd heard that it was slow, and was dreading the slowing down of it, but I found it thoroughly and utterly delightful and so very, very British.There are so many scenes in this book that were perfect, and the characters - man, the characters were fantastic. The scene with the urn arriving at Hebe's workplace, the Erotic Fiction writing chaplain, the ravens, the turtle - but in spite of being so full of subtle humor, there was an underlying thread of thoughtfulness and kindness touching the story of Balthazar and his wife, Hebe.I laughed my way through the book, and then I found myself blinking away tears as I finished it - both because of the story and because I didn't want to say goodbye. Julia Stuart is an author to watch for."}, {"userName": "Will Byrnes", "userReviewDate": "Nov 03, 2010", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "Retired military officer Balthazar Jones is a Beefeater, working and living with his wife, the unfortunately named Hebe, in the Tower of London. The couple have been trying to cope with the loss of their young son three years ago, but seem unable to move past their grief. Balthazar collects raindrops, perhaps the tears he cannot, himself, shed. While there is an undercurrent of sadness here, it is more than mitigated by a lively cast of eccentrics, and when Balthazar is charged with setting up a menagerie on the Tower grounds, life gets even more complicated.There is a theme of lost-and-found here, particularly love. Hebe and a workmate toil away at the London Underground’s Lost Property Office, trying to restore sundry objects to their rightful owners, and there is much warm-heartedness to be found in those efforts. Hebe goes to extraordinary lengths to see that an urn containing someone’s ashes finds its way home, perhaps a way of coping with her personal loss. While I cannot imagine a Lost and Found department in which the employees engage in such research to locate the owners of found items, it is a wonderful literary device and does make for fun reading. Consider my disbelief suspended. Balthazar must search for lost penguins, a missing bearded pig and a wandering tortoise. But along with their late son, Balthazar and Hebe have lost each other. Other characters, not all of them human, are engaged in a quest for love or at least acceptance in one form or another. Although the book is not a constant yuck-fest, I laughed out loud enough times to matter. And while there is eccentricity to many of the characters far beyond what any collection of humans is likely to possess, their oddities are all part of the fun. Stuart has done considerable research and the bits of info and stories she incorporates about the Tower add an extra layer of delight to this sprightly yarn. I take issue with the title of the book, which misses much of what lies in the center of the story. Personally I would have preferred “Lost and Found,” or something akin. The Tower, The Zoo, and the Tortoise is far from a must read, but it offers a quirky look at an ancient institution, through the lens of a contemporary humorist of great talent. I was reminded a bit of The Guernsey Literary and Potato Peel Pie Society , the Mma Rwotse tales and other light fare in which the author clearly harbors very warm feelings for his/her characters. I am sure you will find it most entertaining. I did."}, {"userName": "Bill", "userReviewDate": "Dec 08, 2010", "userURL": "http://www.goodreads.com/user/show/1811095-bill", "userReview": "very few books actually make me laugh out loud but this one did.there is a very memorable cast of characters including a beefeater who collects rain,a woman who works in the london underground lost and found where people bring in things like a canoe, an inflatable sex doll and dustin hoffman's oscar trophy.there is also a chaplain who writes erotic fiction and a 181 year old tortoise.like i said, it's very funny. but it's not all comedy.there's also sorrow,pain and joy...all the things that happen in life. all in all it's a great book.highly recommended."}, {"userName": "Vonia", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/5204784-vonia", "userReview": "The best stories are told so seamlessly and so well that one hardly realizes one is being told, so swept up we are in the characters. Exhibit A: This adorable, whimsical debut novel from Julia Stuart. The perfect amount of whimsy, the right dose of magical realism- a fun read all around. The Tower refers to The Tower of London, short for Her Majesty's Royal Palace and Fortress. Related historical figures include Elizabeth I, Charles II, Edward III, & Richard The Lionheart. A historical UNESCO World Heritage Site, The Tower has served variously as an armory, a treasury, a menagerie, the home of the Royal Mint, a public records office, and the home of the Crown Jewels of England. This novel discusses all of this and much, much more. As the title suggests, it focuses on The Royal Menagerie, better known as The Zoo to the layman. As important as its inhabitants is the one individual chosen by The Majesty herself to oversee it. Who is this most fortunate, admirable man? Why- Our hero Balthazar Jones, proud Beefeater, of course! Which is the official nickname given to the guardians of The Tower of London. Quite naturally. (This unlikely nickname most likely refers to the way in which the first guardians were compensated for their duties, dating am the way back to the 1700s.) The Tortoise is Mrs. Cook, the oldest Tortoise in the world; the family pet for the Jones. A much loved member of the family, she was young Milo's favorite. When she lost her tail, he spent hours on hands and knees searching for it, devastated. Afterwards, he actually changed his career aspirations because of his love for Mrs. Cook. The only son to Balthazar and Hebe Jones, Milo unfortunately died from a mysterious, unexpected heart failure before he could begin to fulfill his aspirations. And this leads us to what is at the heart of this novel. The story here, actually, is not The Tower, nor The Zoo, nor The Tortoise. These are all but backdrops to a story about love, friendship, redemption, forgiveness. Mother and son, father and son, marriage. Daring to be different. Death, grief, loss. How it is as easy to lose your loved ones i HKn the aftermath as it is to become ever closer, buoying each other in the dark waters. Alas, it was all the little things in the novel that won me over. The first pages already told me this was my kind of book: A hand drawn map, accompanied by the short and sweet, funny and witty \"Cast of Characters\" (i.e., \"collector of rain\", \"man of indeterminate height\", \"the eclectic woman that falls for a man of indeterminate height\", \"Bartender @ The Rack & Ruin with a secret\", \"Reverend [that] writes erotic fiction on the side\".How lovely would it be for The London Underground Lost Property Office to exist in our universe? In the very real sense that the employees would be anywhere near as conscientious in reuniting lost articles with their owners as Hebe Jones and Valerie Jennings are? Imagine! Everything from the heart transplant to the magicians box, even the urn of ashes belonging to a certain Clementine Perkins. A safe that has been there for years, combination unknown. The office tradition is to try a new set of numbers every time one of the ladies passed it from the back to the front in order to greet patrons. The romance between Valerie and Arthur and adorable. The way Arthur, due to his shyness, does subtle things like \"find\" a new book by one of Valerie's favorite authors on a daily basis. Even the animals in the menagerie are imaginatively written. The glutton, the depressed albatross (they mate for life, but it has been separated), the lovebirds that need to be kept apart. Though they do not speak, the way Stuart writes, they might as well be. Alas, the last page turned, I have no choice but to await a sequel."}, {"userName": "Emily", "userReviewDate": "Sep 21, 2010", "userURL": "http://www.goodreads.com/user/show/2431873-emily", "userReview": "The Tower, the Zoo, and the Tortoise SHOULD be a book full of rollicking British fun, with an ensemble of quirky characters who live in the Tower of London. Stuart clearly did her research on the Tower itself: anecdotes about the Tower's previous inhabitants and various facts are spread throughout the text. The main character, Balthazar Jones, is a Beefeater who lives in the Tower with his wife, Hebe Jones, a transplanted Greek who is less than happy with her living accomodations. Though Balthazar and Hebe are still reeling from the shock of their young son's premature death, Balthazar is chosen for a new royal post. He is the new head of the Queen's menagerie at the Tower, which consists of animals gifted from the royalty of other countries. Hijinks ensue. The supporting cast includes a pregnant barmaid, a reverend who secretly writes erotic fiction on the side, the self-important Ravenmaster, and Hebe's coworker Valerie Jennings. Always hovering in the text is the shade of Milo, Balthazar and Hebe's son.I'll be totally honest here: I did not enjoy this book at all. I am usually a huge fan of whimsy and unique characters, but Stuart's writing is so self-conscious that I could not bring myself to care. The quirkiness of the characters is established from the first page, where we see Balthazar Jones collecting rainwater. Apparently, he can tell different types of rain apart, and he's waiting for a rare fall to occur. This drives his wife mad (rightfully so), since she knows he's just avoiding his grief at the death of their son.Of course, she has not dealt with it either. By day, Hebe works at the London Underground Lost Property Office, a metaphor so blunt I am surprised it did not injure me. (One of her lost objects inevitably turned out to be an urn still containing someone's ashes.) The narrative threads here are so numerous that they are lost, like the menagerie, which plays only a minor role in the story. There are intimations that Balthazar might lose his job, but those are also forgotten. Milo's story seems to have been introduced to add pathos, but it fails: I got whiplash going from a cutesy story about Monopoly impeding a baby's birth to the death of Hebe and Balthazar's only son.Additionally, the facts about the Tower become tiresome about 1/3 of the way into the story. They make sense when Stuart describes how the other Tower kids scare Milo with tales of terror, but they still appear almost at the end of the novel. At that point, I didn't care how many years Sir Walter Raleigh was incarcerated. I wanted some sort of storyline to be tied up for any one of the numerous, equally twee characters that I'd suffered through.I'm sure this book could be enjoyable. But for me, it would require heavy editing."}, {"userName": "Wanda", "userReviewDate": "Dec 06, 2014", "userURL": "http://www.goodreads.com/user/show/9246169-wanda", "userReview": "I liked this book. But I couldn’t help, while reading it, thinking that I should like it more. It has many elements that often provide me with reading pleasure. The animals for instance—the poor wandering albatross that is missing its mate; the monkeys wildly flashing their junk at inopportune times; the missing penguins.Plus, this is a book about grief—about Balthazar and Hebe Jones grieving the loss of their son, Milo. And grieving for a child has potential to either pull a couple closer together or push them completely apart. It’s exquisitely painful to experience and almost as painful to watch, and here we are as readers, voyeurs to this couple’s pain.I’ve never lost a child, but my parents were killed in a car accident and I think I know a thing or two about grief. I know that it was two fuzzy rabbits who kept me going in those days of depression following my parents’ deaths. Someone had to get up each morning to feed the bunnies and since I live alone, that someone had to be me. Once I was up and the rabbits were cared for, I would then think, “I might as well go to work, now that I’m up.” Without those two furry critters, I’m not sure how often I would have made it out of bed. So I could relate to Balthazar’s communing with the animals of the Royal Menagerie. The book is cute—almost to the point of being too cute. Lots of side stories get started—Valerie Jennings and Arthur Catnip’s romance, the Ravenmaster’s clandestine adultery, Reverend Drew’s secret career of writing erotic literature. They each get quickly, and for me, unsatisfactorily resolved at the end of the novel. Perhaps they were meant to lighten the mood in a book about grief? Each situation seems to be meant to be comic, but they are also real problems for the characters involved. The eccentricities that I would usually find charming were instead irritating—if the book is truly about grieving and communicating, why distract from that story with this fluff?Everyone has secrets—and their situations could be improved with less secrecy. Julia Stuart does have a talent for writing adorable, eccentric characters, but somehow her books just rub me the wrong way. I wish that I liked them more than I do."}, {"userName": "Jenny T", "userReviewDate": "Nov 24, 2010", "userURL": "http://www.goodreads.com/user/show/1807929-jenny-t", "userReview": "Thanks to the GoodReads First Reads program for sending me a copy, but I have to admit, this book just didn't quite work for me.The Tower, the Zoo, and the Tortoise tells the story of a Beefeater (or Yeoman Warder) named Balthazar Jones, who lives and guards the Tower of London, and his fading relationship with his wife Hebe after the loss of their son. This is the story of love in bloom at the London Underground's Department of Lost Things. And this is the story of the Queen's menagerie that Balthazar is put in charge of.This book could have been wonderful--the author's writing is rich in detail, and I loved the weaving in of the historical background of the Tower. However, the characters were just too quirky. I felt we really didn't get to know their feelings, just their idiosyncrasies (i.e., Balthazar collects different types of rain in tiny bottles) and *everyone* introduced in the story was introduced by their quirks. This got quite annoying. The book also couldn't decide if it was a comedy or a melodrama.I know many people who will probably love this book, but it just wasn't for me. Thanks just the same for the opportunity to read it, though!"}, {"userName": "Carol", "userReviewDate": "Aug 20, 2010", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "Simply put, delightful. The Tower, The Zoo, and The Tortoise has a lot to offer; history, love, humor, quirky characters and an 181 year-old tortoise named Mrs. Cook. Balthazar Jones, a Beefeater, lives in the Tower of London with his wife Hebe and the Mrs. Cook. Hebe works for the London Underground's Lost Property Office, a story in itself. After the death of their son Milo, they have not been able to rekindle the spark that once flamed their beautiful relationship. Their marriage is faltering and Stuart eloquently describes how the grief of loss can divide a couple. Life in the tower is pretty dreary when Balthazar finds out he is to become the keeper of a menagerie of exotic animals given to the Queen. Penguins, giraffes, and a Komodo dragon, oh my!Here's where the story truly takes off. The imagery shimmers. This is a book for animal lovers, for people who like a love story with passion and emotion, for those of you needing a tablespoon of humor. I rarely find books that can make me giggle but this one tickled my fancy from the outset. Simply put, delightful!"}, {"userName": "Lisa", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/14819128-lisa", "userReview": "What a lovely surprise this book was! I really enjoyed it. I found it to be funny, sad, quirky and charming in equal measure. What I particularly enjoyed was how the author wove the history of the Tower of London into the story and did so seamlessly. I also really liked the cast of characters, including all of the animals who were just as offbeat as their human counterparts. However, I did have one or two small problems with it which led to me rating it 4 stars instead of 5. The last couple of chapters wrapped everything up a bit too quickly for me (to the extent where a couple of things felt slightly convenient) and it was a little bit too saccharine at times but that is just my personal taste. If you are looking for a quick and easy read that packs an unexpected emotional punch, you could certainly do far worse than this book. It brought a smile to my face and tears to my eyes and was a pleasure to read. Highly recommended."}, {"userName": "Lynda", "userReviewDate": "Sep 14, 2010", "userURL": "http://www.goodreads.com/user/show/2688540-lynda", "userReview": "The title of this novel could have been so much longer. Author, Julia Stuart, could have entitled it: The Tower, The Zoo, The Tortoise, The Beefeater, The Quirky, The Son, The Loved, The Lost, The Found, The Reverend, The Ravenmaster, The Hopeful and The Grieving. Yes, that title would have been way too long. So, I understand Ms. Stuart’s shortened version. Rather than giving the reader all that information in the title she instead unfolds this material to the reader slowly and gently, using strategically placed reveals to open this beautiful story like a rose. Like the author, I will condense my review by not giving a synopsis of the plot but to suggest that this book is a collection of love stories, affairs of the heart. There are doors to unlock, passions to unleash and hearts to be joined and rejoined and hardships to be reconciled.Any person who is inclined to read this sort of novel will find Stuart’s character’s, whether human or otherwise, well drawn, quirky yet real, touching, sweet and occasionally even despicable. The settings are more than appropriate and the historical information she imparts is well timed, entertaining and relevant.Would I recommend it: I can see no reason, at all, for not recommending this jewel. It is something a little bit different from the usual same ole same ole and no reason not to give it 5 stars."}, {"userName": "Joy", "userReviewDate": "Aug 06, 2010", "userURL": "http://www.goodreads.com/user/show/1694004-joy", "userReview": "I really enjoyed this charming and touching story set in the Tower of London. We were visiting there recently and took the guided tour. Our Beefeater guide was wonderfully entertaining and informative. I hadn't known that the Beefeaters and their families are required to live in the Tower.Balthazar Jones and wife Hebe are stilling reeling from the unexpected death of their young son Milo. Balthazar is charged with opening and maintaining a new menagerie at the Tower. Hebe works in the London Underground's Department of Lost Things and goes to great lengths to return lost items to their rightful owners. I was reminded of how fun it was to take the Tube (mind the gap!) around London.One of my favorite lines was spoken to Hebe, \"You haven't lost Milo completely, you know. We always carry a part of those we love tucked inside of us.\"I hope they make a movie based on this book. I would love to see these characters brought to life on the screen. There is even a wonderful Hollywood ending that is really heartwarming."}, {"userName": "Amy", "userReviewDate": "Jan 12, 2012", "userURL": "http://www.goodreads.com/user/show/1710557-amy", "userReview": "What a torturous (as opposed to tortuous) book! There was loads of interesting historical bits stuffed in there, but the basic story line was so stuffed with adjectives and stolid writing that had I not wanted to find out how Milo died and what happened to the tortoise (now that's a combination I never thought I'd utter) that I would not have persevered. Give me my time back."}, {"userName": "Amy", "userReviewDate": "Aug 15, 2010", "userURL": "http://www.goodreads.com/user/show/3096541-amy", "userReview": "\"...for the rest of the evening the air in the Salt Tower was so fragile that they spoke to each other as if the place were filled with a million fluttering butterflies that neither dared to disturb.\"\"Hebe Jones ran a hand along the bed sheet that had been a weding present all those years ago. But it failed to find her husband.\"You might recognize an older bearded gentleman dressed in a Victorian uniform of red tights, dark blue breeches, matching tunic, and the classic white ruffle around the neck, wearing a blue Tudor hat, as an English Beefeater (possibly from a bottle of gin). The official name of the guardians of the Tower of London is 'Yeoman Warder of Her Majesty's Royal Palace and Fortress the Tower of London, and Member of the Sovereign's Body Guard of the Yeoman Grand Extraordinary'. For purposes of common use (and possibly for business cards) they prefer the term Yeoman Warder. These Beefeaters were obligated to live in the dark and damp Tower of London-adorned with graffiti left from previous prisoners and occasionally visited by the ghost of Sir Walter Raleigh. The Tower today is a hugely popular tourist attraction.This is the engaging story of one such Beefeater: Yeoman Warder Balthazar Jones, his wife Hebe, and the son they lost tragically, Milo. The other denizens of the tower: a prize-winning priest who writes pornography under an alias, another Beefeater 'Ravenmaster' who is cheating on his wife, and 'Mrs. Cook', a one hundred and eighty-one year old tortoise. Other animals reside as well, and their presence gives the often dry Beefeaters occasional undignified challenges, such as when a special Etruscan shrew dies, and they decide to tell people it's hibernating, or when they term bird poo as \"Parrot indiscretions\".Jones is a complicated man, obsessed with weather and avidly collecting rain samples. An odd hobby, of course, but it's part of how he deals with his son's loss. It's unique details that make the characters of this story special. Julia Stewart has the ability to describe incidents in an unusual way; her prose delights. She also describes incidents in a decidedly English way which accounts for moments of humor that are a bit startling.\"Fury coursed through her veins at yet another night of disturbed sleep. Her usual revenge, performed each time her husband returned...was an anatomical master stroke. Once she heard the muddy breath of a man descended deep into his dreams, she would suddenly leap from the bed and make the short journey to the bathroom with the gait of a demented sentry. Once installed on the lavatory, she would proceed to empty her bladder with the door wide open. The clamour of the catastrophic downpour was such that her husband would immediately wake in terror, convinced that he was lying in a nest of snakes.\"Enjoying the read, there was some distraction from a few repetitions of certain phrases. The second phrase needed only a different word-order to smoothly convey the thought. This is fairly common, as authors inadvertently do this all the time, but it's enough of a distraction that it jostles the pace of the story. All in all, this is a fun read unlike any other I've read. Note that the cover art appears almost as if it's a children's book, but the story within, while tame, is not intended for children."}, {"userName": "Alins", "userReviewDate": "Dec 07, 2010", "userURL": "http://www.goodreads.com/user/show/4244557-alins", "userReview": "Everybody knows about the Beefeaters in the Tower of London, of course, but it's unlikely you ever knew one personally. In this light- hearted novel you will meet the denizens of the Tower: Beefeater or Yeoman of the Tower Balthazar Jones along with his Greek wife, Hebe, are barely holding on to a marriage gone stale.We are introduced to the Reverend Septimus Drew, the Tower parson, who secretly pens erotic novels under the pen name Vivienne Ventriss. We meet Ruby Dore, the sexy barmaid of the Tower's pub Rack and Ruin, who was born \"slithering\" on to a kitchen floor because the resident Tower doctor would not leave his Monopoly game at a crucial moment in play to attend the crucial moment upstairs. And there's the black-gloved villain, the Ravenmaster, who looks after his flock of vicious black birds, one of which recently sent a tourist to the hospital when the unfortunate man tried to pet the bird. And there's Arthur Catnip, the Ticket Master and his voluptuous girlfriend Valerie...Hebe Jones works at the London Underground Lost Property Office and tries to unite the careless public with their left-behind objects which include, along with hundreds of umbrellas, a kidney transplant, an urn of ashes labeled \"Clementine Perkins\" and a yellow canoe.We cannot overlook Mrs. Cook, the 180 year old tortoise belonging to Balthazar Jones and who lost her tail to one of the ravens. We briefly meet in retrospect the Jones' little boy Milo, who dies at age eleven and with him dies the spirit of the marriage, only dregs are left. At this point in time there really aren't any happy campers among the Tower personnel, trapped inside those ancient circular walls.Elizabeth II has arrived at a momentous decision: all the exotic creatures constantly being more or less dumped on her royal head would be housed at the Tower, which had been used as a menagerie for centuries. There isn't any enthusiasm behind Tower walls over this bombshell of the Queen's but who are they to resist the will of the Monarch? However, Hebe Jones finds the menagerie the last straw, packs a bag and leaves her husband who has been hand-picked to be the reluctant director of this latter day Noah's Ark. Even old Mrs. Cook the tortoise, disappears.But they learn something from the animals foisted upon them, these human denizens of the Tower.\"The softness of the reclusive ringtail possums who fall asleep in their arms\"; the albatross who has lost his mate and is mourning; the bearded pig who chases a grapefruit around like a soccer ball; the Jesus Christ lizards who can walk on water and even the little Etruscan shrew with his velvet nose. The animals, who all need care, take the humans out of themselves and thinking instead about the welfare of the various critters in their charge.True love will find a way over rocky roads and thorn thickets. Will Hebe come back? Will Mrs Cook find her way home? Don't miss this heart-warming tale, written with great charm, in which the spirit of the little boy Milo weaves the story together and brings it to a close."}, {"userName": "Rachel", "userReviewDate": "May 26, 2011", "userURL": "http://www.goodreads.com/user/show/2439479-rachel", "userReview": "This is a picturesque novel about the employees and residents of the present-day Tower of London, the city's largest tourist attraction. The story focuses on Beefeater Balthazar Jones and his wife Hebe, who live in the Salt Tower with their ancient pet tortoise Mrs. Cook and who are grieving the recent death of their young son Milo. As the story opens, Balthazar is appointed to open and manage a menagerie on Tower grounds of the animals given to the Queen by foreign heads of state. He oversees the transfer from the London Zoo of a group of penguins who go missing en route, some giraffes who were transferred by mistake, an albatross who begins to molt in mourning of being separated from his mate, a Komodo dragon, an assortment of possums, various parrots, an Etruscan shrew who suffers from crippling shyness, and a bearded pig whom Balthazar basically steals from the zoo just because he likes his looks. Meanwhile, his wife Hebe goes to her job at the London Underground's Lost and Found department, where she spends her days trying to reunite lost items with their owners and lying down in the unclaimed magician's box (the kind used for sawing assistants in half) when things get to be too much for her. Mostly a comic novel, there's an undercurrent of sadness that runs throughout. The Reverend Septimus Drew pines for Ruby Dore, the barmaid of the Tower's Rack and Ruin pub who has recently learned that she's pregnant; Hebe's coworker Valerie and the ticket inspector Arthur Catnip love each other from afar but both too tentative to do much about it; the Ravenmaster suffers an unhappy marriage and various affairs; and Mrs. Cook the tortoise is tormented by the crows. But mainly it's Balthazar and Hebe, who in their grief over their son become isolated from each other and cope in their own ways, Balthazar by collecting rain samples and Hebe by trying to find the owner of an urn of cremated remains that was left on one of the Underground lines, until things come to a quiet head on Milo's birthday. I liked this book, but a lot of the characters were underdeveloped. It's a relatively short novel, so some of the subplots didn't get much attention and although Stuart tied up all the loose ends, some of it felt a little perfunctory. But it was a decent light read, and I liked it enough that I would read other things by the same author."}, {"userName": "Stephanie", "userReviewDate": "Jul 01, 2010", "userURL": "http://www.goodreads.com/user/show/3661919-stephanie", "userReview": "*This is a review of the advance reader copy*Well, I'm not going to beat around the bush here. I LOVE this book. The plot is a little bizarre, but the strangeness of life lends itself well to moments of humor. More than once I laughed out loud at some outrageous, but inevitable occurrence. The book is written in charming and entertaining vignettes, moving from character to character in a world I've only seen as a tourist. It ends on the most satisfying note despite the various turmoils the characters undergo. Characters include a lonely albatross, a high-strung Etruscan shrew and escaped penguins; that's just an unbeatable combination. Those addicted to English historical fiction, My Big Fat Greek Wedding, and The Art of Racing in the Rain alike will adore this book as much as I do. In my package, Doubleday publishers sent a little sketch of the Tower, and I really hope that sketch will appear in either the paperback or hardcover final version since I referred to it often and reminisced about my own trip to London. Even so, I found myself running to google about every 10 pages to look up more treats of Tower history. There are a few things that annoyed me however. Almost every chapter starts with the first and last name of a character. By chapter four, with unusual names like Balthazar, Hebe, and Septimus, I find that unnecessary and vaguely annoying. Some descriptions also appear multiple times. I don't like it when Laurell K. Hamilton does that, and I don't like it when Julia Stuart does it either, although I have the feeling this was done on purpose for some unfathomable reason. Other than that, I did really love it, and I think I'll be rereading it many times."}, {"userName": "Caroline", "userReviewDate": "Aug 23, 2010", "userURL": "http://www.goodreads.com/user/show/3858088-caroline", "userReview": "A Beefeater at the Tower of London with an obsessive interest in collecting rain specimens in Egyptian glass bottles is now called upon to look after a new royal menagerie. Foreign dignitaries have at times made presents of exotic animals found in their countries to the Queen of England. They're usually kept at the London Zoo, but following the death of one gift, leading to an offended Ambassador, the Queen decided that it might be better to have these specially gifted animals under closer care, and if so, whom better than her Beefeaters.Balthazar Jones, depressed and distant from his wife Hebe, after the death of their son, Milo finds himself having to supervise the transportation of the animals to their new enclosure, and reading up on their history (as much as possible) in case tourists have questions. Apart from having to ensure that they remain, if not healthy, at least alive in their new residence, Balthazar fights an ongoing feud with the Ravenmaster. The Ravens of the Tower have been harrassing his pet ancient tortoise and he's convinced that they ate her tail. Meanwhile, Hebe, who works at the London Underground's Lost Property department, is busy trying to find the owner of a magician's box, an urn, a locked safe, a Igloo with a kidney and other items carelessly left on the train or platform by passengers.Apart from the humorous antics surrounding the employees of the Tower of London and the Lost Property department, there actually is quite a bit of details into the history of the Tower of London and the people who were held prisoners there and who died there, whether by their own hands or by royal decree."}, {"userName": "Jolie Kerenick", "userReviewDate": "Aug 26, 2010", "userURL": "http://www.goodreads.com/user/show/3565436-jolie-kerenick", "userReview": "I had some trouble getting in to this book initially, but I stuck with it because I wasn't sure if it was me or the book. As it turns out, it might have been a little of both, however I am glad I stuck with it as it picked up. I tend to really enjoy books that leave me with the feeling of knowing the characters on some level. I think the fact that I work as a mental health therapist probably contributes to this in someway. The author did not let me down on that front.The story centers around the lives of several individuals who live/work in and around the tower of London. In my opinion, the author does a great job of giving the reader a glimpse into the inner psyche of the story's characters, flaws and all. After reading the book, I felt very familiar with several characters and familiar enough with others to understand their motivations and to recognize that if the author were to continue the story with a focus on further developing those that we are introduced to, I would be interesting in learning more about them.There is some interesting tower history that is woven in skillfully such that it is in no way cumbersome or distracting. The story is also sprinkled with moments of humor that caused me to laugh out loud, something I rarely do, often still with a tear in my eye related to the struggle, both internal and external, of one of the characters. It is entertaining and not too heavy or intense while still displaying some meaningful growth of characters. It was well worth the time!"}, {"userName": "Summer", "userReviewDate": "Dec 28, 2011", "userURL": "http://www.goodreads.com/user/show/1450256-summer", "userReview": "This is a story of Balthazar Jones and the life surrounding him as a Beefeater in the Tower. His life is really a soggy mess, as is everyone else's who inhabits the haunted Tower. Then one day he is informed that the Queen is leaving him the care of her Royal Menagerie. This soon to be chaos added to the priest that writes erotic fiction, the ghosts, the lost penguins, the numerous sad love stories, the lost Oscar, the sarcophagus, the lovesick Albatross, the collection of rain samples and the numerous urns, the dancing rats... you've got yourself one unique book!I really enjoyed this book. It was an odd book filled with DRY British humor. I learned a great deal about the Tower and I had ignorantly thought the Tower was just that, one tower and why would anyone be interested in seeing that!? When looking at the map provided of the MANY towers in the Tower I laughed and thought okay now I want to go see it. It occurred to me while reading this, the British have desert, dry humor in order counter act the wet and dreary life of England."}, {"userName": "Sterlingcindysu", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/946086-sterlingcindysu", "userReview": "For a book that is charming and whimsical, Stuart packs alot in it's pages. There's several sub-plots going on and everything is tied up at the end. I think she could have easily made 2 or 3 separate novels about the women who work finding the owners of items lost on the Tube or the minister who writes romances. Even the Tortoise exacts revenge for her missing tail. Let's face it, sometimes you want to read a light-hearted book. This fits the bill. Serious topics are covered but at no time is hope lost. Bearded Pig:"}, {"userName": "AdiTurbo", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/2199883-aditurbo", "userReview": "DNF. Not very into it. I loved the historical research but very little is happening, and the characters are not real people but a bunch of quirky habits and pastimes. The language is overly-decorative and smart-alecky, and I didn't feel that I cared, even though there is a serious tragedy in the center of this book."}, {"userName": "Lena", "userReviewDate": "Aug 28, 2010", "userURL": "http://www.goodreads.com/user/show/220791-lena", "userReview": "There are a lot of unusual characters in this odd novel. There is Balthazar Jones, the Beefeater at the center of the story, whose life giving tours at the Tower of London is complicated by the Queen's decision to put him in charge of the Royal Menagerie she has abruptly decided to move from the zoo to the Tower. There is his wife, Hebe, who is struggling to cope with the death of their son while working to reunite people with items that have been turned into her at the London Underground Lost Property Office. There is the Reverend Septimus Drew, the Tower Chaplain, who longs to find a wife to join him at his Tower home, yet somehow can't stop himself from sabotaging promising potential relationships by responding in colorful detail to the question of how many people have been killed there. And there is Arthur Catnip, a diminutive ticket inspector at the Underground with an eye for Hebe's Rubenesque colleague, Valerie Jennings.In addition to the human characters, there are numerous animal ones as well, including the historical ancient tortoise of the title. But it is the stories of the locations all these creatures inhabit that are in some ways the most interesting. The author weaves the fascinating history of the Tower and its numerous prisoners through the lives of all of her characters, bringing it to life in a way that a dusty history book never could. The London Underground Lost Property Office also is overflowing with strange items with even stranger tales attached to them, and the mini-mysteries revealed as the clerks seek to discover their owners was a source of endless fascination as I turned the pages. Although the attempts of the grieving parents to cope with the loss of their son lend parts of the book a melancholy tone, they are balanced out by ample doses of oddball humor. My only real complaint has to do with the abruptness of the ending - everything is satisfactorily resolved, but so quickly I didn't quite have time to catch up. Despite that flaw, however, I found this book a genuine pleasure to read."}, {"userName": "Mary", "userReviewDate": "Jun 19, 2010", "userURL": "http://www.goodreads.com/user/show/254596-mary", "userReview": "The Tower, The Zoo, and The Tortoise is about Balthazar Jones who is a Beefeater – he lives and works at the Tower of London. Balthazar and his wife Hebe are trying to go on with life after the death of their only child. She works at the London Underground’s Lost Property Office where she tries to reunite lost objects with the owners and Balthazar leads tours at the Tower. One day, it is announced that the Queen’s menagerie (gifts of animals from other countries) will be housed at the Tower and Balthazar will be in charge. This sets in motion a string of hilarious events that had me laughing out loud.There are supporting characters who are quite lonely. At the same time they add to the comedy with their quirks: the Reverend Drew whose other job would shock his parishioners; Valerie, Hebe’s coworker, who has a propensity for trying on/out found objects; and Ruby the pregnant barmaid who has a fondness for rats. All of Stuart’s characters shine in their own way and add a great deal to the plot.I learned a lot about the Tower of London. Facts and trivia are interspersed throughout the novel in an easy flow that makes me want to read more about the famous inhabitants since the eleventh century.The gentle pace, the wonderful characters, and the humorous events of the novel make for an enjoyable afternoon of reading. The Tower, The Zoo, and The Tortoise is a gem."}, {"userName": "Eric Klee", "userReviewDate": "Feb 10, 2011", "userURL": "http://www.goodreads.com/user/show/2581594-eric-klee", "userReview": "I picked up THE TOWER, THE ZOO, AND THE TORTOISE because of all the praise it had received from critics and reviewers. While cute, the story is as entertaining and fast-paced as watching two English women discussing the weather in London whilst sipping tea. The story involves a Beefeater (a ceremonial guardian/tour guide of the Tower of London; hence THE TOWER in the book's title) who lost a young son and, since then, he and his wife have been growing apart. They also have a pet turtle named Mrs. Cook that's been in the family for years (THE TORTOISE in the book's title). The Beefeater is then asked to be in charge of a new zoo they want to put together that would encompass all of the gifts of exotic and non-exotic animals given to the Queen of England from countries around the world (THE ZOO). Filled with interesting facts about Beefeaters, the Tower of London, and life in London, the novel seemed to be lacking in actual substance. While I don't require a lot of action or fast-paced stories, I do like books that I read to be interesting enough that I want to continue turning the page. THE TOWER, THE ZOO, AND THE TORTOISE did not do this for me and I can't help but wonder if critics gave it a high rating and exuberant praise only to make themselves feel culturally relevant and somewhat literary."}, {"userName": "Karin", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/20048682-karin", "userReview": "4.5 starsYes, I really enjoyed this novel--poignant, humorous, quirky, sad, happy, fun.Set primarily in the Tower of London, although also in a few other interesting places around the city, we see a bevvy of wonderful characters. We have a beefeater, Balthazar Jones (named after one of the wiseman) who is asked to care for the Queen's animals, which are to be moved there nearly 200 years after the Tower's menagerie was closed. He and his wife, Hebe (named after the Greek goddess) are each privately grieving for their son, who died several years before, and I thought the handling of this in the midst of all the quirky things was sensitive and well done. We have an erotica writing clergyman, a philandering Ravenmaster, a middle aged ticket inspector hopelessly in love with Hebe's coworker and so on.I have to say that I was very happy that I needed a 7 letter title and that I chose this one. I plan to read the novel Julia Stuart wrote before this, and then, if there are others, read more by her."}, {"userName": "Michael Fitzgerald", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/151004-michael-fitzgerald", "userReview": "Dear Author:If you don't know what words mean, please don't use them. For example, \"fulsome\" is not a fancy way of saying \"full\". Intelligent educated readers are aware of this and you make yourself look foolish when you write the phrase \"its tasselled tail flying like a flag over its fulsome buttocks\" once (p.123). When the exact same phrase appears on p.169, it's apparent that you are trying to be witty but haven't got what it takes. When the exact same phrase appears a third time (p.217), you brand yourself as a lazy writer. And when it finally appears as \"its tasselled tail flying at full mast over its generous buttocks\" (p.290), it becomes all too clear that you really do believe that \"fulsome\" means \"generous\". Now, that final phrase inserted but ONCE would be funny! There was never any need to repeat it. And of course, the incorrect use of \"fulsome\" once more on p.218 should have been eradicated too. I would say get yourself a dictionary and a thesaurus, but with all your flowery use of words like \"hirsute\" and \"garderobe\" and \"effluent\" and \"resplendent\", it appears you have gotten hold of these items but simply lack taste. Speaking of taste, I would hate to sample your cooking, because I can only imagine a recipe consisting of two cups of saffron, a quart of truffle oil, and a pound of cornstarch.I can't put all the blame on the author, however. Somewhere in the publishing workflow there should have been at least one editor who knew the correct meaning of the word and who should have put a stop to this nonsense. Hopefully that person would also have realized that much of this book is wasteful - just stupid redundant description in overblown flowery prose. Too much detail, too much pointless irrelevance, too many tangents - these are not the hallmarks of good writing. This 300-page book reads like it started life at 100 pages and had to be padded out to meet a length requirement. \"What, more? Oh, just insert another few random pseudo-historical anecdotes and a sprinkling of irrelevant backstory incidents for all the characters.\" \"Still not enough? Still? OK, I guess you could use every character's full name, first and last, for every single occurrence. That ought to fill up some space. Yes, even though they all have outlandishly unusual names like Balthazar and Hebe and Septimus and Oswin that would suffice on their own.\"Someone should have seen through this nonsense and stopped it well before the book arrived at the printers (deckled edges, natch). A portion of it might actually have worked well as a kind of cutesy short story."}, {"userName": "Lisa  Kilgariff", "userReviewDate": "Apr 20, 2011", "userURL": "http://www.goodreads.com/user/show/4606099-lisa-kilgariff", "userReview": "This book had the potential to be fantastic, but ended up disappointing me from the very first page. The concept is great, and in many places it is incredibly well executed (yes, that is a pun) but the writing killed it for me. In most cases I can ignore a couple of grammatical errors or weird sentence structures but this was not the problem, in fact it was well written in those respects. The problem was that the writing was incredibly repetitive! I don’t know if this was intentional, and it must have been for no one to have fixed it, but using the exact same descriptive phrase four of five times throughout the book was crazy annoying.The story itself is interesting enough but near the end, I caught myself skimming because of the repetition. The characters were wonderful and were well explored and grown throughout the book. My favorite is the Tower priest, who writes erotic fiction is his spare time. I really liked how the personality of the Tower came through it’s very odd assortment of residents. And I loved all of the fun historical facts that were scattered across the pages (did you know that only 7 people were actually beheaded inside the Tower grounds?) because I love having random facts to pull out! And the animals were fun… In the end though, this just wasn’t the book for me.The review was originally posted at BaffledBooks"}], "description": "Brimming with charm and whimsy, this exquisite novel set in the Tower of London has the transportive qualities and delightful magic of the contemporary classics Chocolat and Amélie.Balthazar Jones has lived in the Tower of London with his loving wife, Hebe, and his 120-year-old pet tortoise for the past eight years. That’s right, he is a Beefeater (they really do live there). It’s no easy job living and working in the tourist attraction in present-day London. Among the eccentric characters who call the Tower’s maze of ancient buildings and spiral staircases home are the Tower’s Rack & Ruin barmaid, Ruby Dore, who just found out she’s pregnant; portly Valerie Jennings, who is falling for ticket inspector Arthur Catnip; the lifelong bachelor Reverend Septimus Drew, who secretly pens a series of principled erot­ica; and the philandering Ravenmaster, aiming to avenge the death of one of his insufferable ravens. When Balthazar is tasked with setting up an elaborate menagerie within the Tower walls to house the many exotic animals gifted to the Queen, life at the Tower gets all the more interest­ing. Penguins escape, giraffes are stolen, and the Komodo dragon sends innocent people running for their lives. Balthazar is in charge and things are not exactly running smoothly. Then Hebe decides to leave him and his beloved tortoise “runs” away. Filled with the humor and heart that calls to mind the delight­ful novels of Alexander McCall Smith, and the charm and beauty of The Guernsey Literary and Potato Peel Pie Society, The Tower, the Zoo, and the Tortoise is a magical, wholly origi­nal novel whose irresistible characters will stay with you long after you turn the stunning last page. Published in the UK in August 2010 as Balthazar Jones and the Tower of London Zoo.", "title": "The Tower, The Zoo, and The Tortoise", "url": "http://www.goodreads.com/book/show/7745326-the-tower-the-zoo-and-the-tortoise", "average": 3.58, "cover": "https://images.gr-assets.com/books/1320449123l/7745326.jpg", "reviews": 1665, "authors": [{"url": "https://www.goodreads.com/author/show/1157469.Julia_Stuart", "name": "Julia Stuart"}], "type": ["Fiction", "Humor", "Animals", "Historical", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/7745326-the-tower-the-zoo-and-the-tortoise", "http://www.goodreads.com/book/show/7687396-balthazar-jones-and-the-tower-of-london-zoo", "http://www.goodreads.com/book/show/10168247-the-tower-the-zoo-and-the-tortoise", "http://www.goodreads.com/book/show/8777432-the-tower-the-zoo-and-the-tortoise", "http://www.goodreads.com/book/show/13330604-the-pigeon-pie-mystery", "http://www.goodreads.com/book/show/2626553-the-matchmaker-of-p-rigord", "http://www.goodreads.com/book/show/28092868-the-last-pearl-fisher-of-scotland", "http://www.goodreads.com/book/show/34800276-le-zoo-de-la-tour-de-londres", "http://www.goodreads.com/book/show/28961443-paracord-projects", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}