{"ratings": 41669, "userreviews": [{"userName": "Paul Bryant", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Two reviews in one. First, the supercilious parody :Tom : Oh Dickie, that shirt is so gorgeous. It’s so you. Where did you get it?Dick : You’re not a fairy are you?Tom: No! The very idea!Dick: Well then, I got it from a divine little boutique near La Fontana della Barcaccia in Piazza di Spagna. We should go there tomorrow.Tom : Oh Dickie, let’s. Marge (soliloquy) : Dick is just the handsomest American 25 year old trust fund baby in all of Italy. Or this part of it, anyway. Sigh. I love him so much it makes my eyes slightly bulge. But however much I press my cleavage upon his upper parts, and hang my dripping undergarments within his vicinity, I just can’t seem to get anywhere. Tom (soliloquy) :Dick is just the handsomest American 25 year old trust fund baby ever. Sigh. Why he wants to hang around with this gourd-shaped bitch I can’t say. I really would like to wear all his clothes and pretend to be him for a day. No, make that my entire life.Dick: Tom, for a creepy sociopath, you're quite good company. Let’s go boating.Tom: I don't know anything about small dangerously unstable motorboats in stretches of water with no other boat in sight, perfectly situated for a murder. How do you make it go?Dick : You just pull on this here until you can feel it throbbing, then you grab that long thing there and steer it wherever you want. If it doesn't start you give it a good whack with an oar.Tom : Well, if you say so. review number 2This interesting novel is, from a modern persepective, a bit iffy. Conforming to the 1950s stereotype, it elides homosexuality with deviant psychology and gives us a closet gay man* who is so much in love with this unavailable dreamboat - and the dreamboat's lifestyle - that he wants to be him. He creepily manipulates everyone around him and he despises every single human being he encounters, except the dreamboat. The 1950s was awash with sinister gay figures - George Sanders in All About Eve( and let us not forget Norman Mailer's 1954 essay \"The Homosexual Villain\" (he said about that time that he believed \"there was an intrinsic relation between homosexuality and 'evil.' \"). The character of Tom Ripley is also self-loathing, another closeted-gay cliche. He loathes himself to the extent of wanting to shed his own personality like a snake's skin and become someone much better. I think that Tom Ripley therefore was part of the problem which led - to take one example from millions - to Lou Reed's parents making him have ECT to get rid of his homosexual tendencies. Leaving the iffiness of this novel aside, it then suffers from the same thing as all other thrillers and crime novels - we are expecting murders, there's no suspense involved, one's only surprise is that Tom Ripley brains so few people. And also draining the interest away is that we know this was the first of a series of Ripley novels, so we know he won't die and probably therefore won't be caught, murder being a capital crime back then. This novel is in the 1001 Books You Must Read Before Next Week Or Else and I note it appears between Lolita and Lord of the Rings. Once again, poor little Lolita finds herself in some very dubious company.**in the second Ripley book he gets married - might be worth reading that one to see what Patricia Highsmith thinks is going on with her character"}, {"userName": "Dan Schwent", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "When Tom Ripley is offered a handsome reward to go to Italy to retrieve Dickie Greenleaf, he accepts and soon finds himself living the good life in Naples with Dickie. An obsession blooms and Tom finds himself wanting to be Dickie Greenleaf. But does he want to be Dickie Greenleaf enough to kill his new friend?I was somewhat familiar with The Talented Mr. Ripley because I nearly took a girl to see the Matt Damon version in the theater back in the day. We opted to see Dogma instead. Anyway, I knew Highsmith wrote Strangers on a Train so I decided to take a crack at it.The Talented Mr. Ripley is a tale of obsession, murder, lying, betrayal, and more lying. In short, it's a wholesome noir tale. Highsmith reads like a mannerly Jim Thompson, especially once things start going off the rails. Tom Ripley is the protagonist but he's far from a hero. In fact, he's probably a sociopath. He doesn't seem to be comfortable in his own skin, preferring to live a lie than to be himself. He's a liar, thief, and eventually a murderer. Since there are more of these books, I'm guessing he continues his lying murdering impersonating ways.The book is mostly the Tom Ripley show. Dickie and the rest of the supporting cast don't have much going on other than the way Ripley manipulates them. Actually, having never seen the movie, I was surprised at Dickie Greenleaf's fate considering I expected him and Tom to start making out at any moment. Did the movie have this big of a closeted gay vibe?Like I said before, this reads like a mannerly Jim Thompson book once things start coming unglued. It takes a lot of lying and killing to cover up a murder. I was a little surprised the body count wasn't higher once everything was said and done.Still, I caught myself wanted Tom get away with it, kind of like Dexter Morgan or Walter White. I guess that means Patricia Highsmith knew a thing or two about writing. Four stars but I'm not in a tremendous hurry to read more about Tom Ripley."}, {"userName": "Darwin8u", "userReviewDate": "Dec 09, 2012", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "Anticipation! It occurred to him that his anticipation was more pleasant to him than the experiencing.” ― Patricia Highsmith, The Talented Mr. RipleyHighsmith is amazing. She alludes to Henry James, plays with Nabokovian style, James Cain's dialogue, and blends it all with a Camus-like modern existentialism. Plus, the goddess walked around with snails in her purse. Face it, pretenders, 'The Talented Mr. Ripley' is an amazing psychological crime novel. This is one of those books which should be used as evidence to highlight the case that some of the best literature of the 20th Century came out of genre fiction. The novel is high-wire, high-risk, high-reward masterpiece. It leaves me amazed the Cure didn't just write their existential anthem to Highsmith:I can turn And swim awayOr I can raise up my oar Staring at a boatStaring far ashoreWhichever I choseIt amounts to the sameAbsolutely nothing.I'm aliveI'm deadI'm lying Tom RipleyKilling a Signor."}, {"userName": "Aubrey", "userReviewDate": "Aug 08, 2010", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "[Freddie Miles (hide spoiler)]"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/3.5 Stars\nI came upon a little list recently called “17 Books for People Who Hate People” and I immediately thought, “hey, that’s me!” Mitchell concurred. I ended up with a super stinker as my first selection, but luckily I fared better with The Talented Mr. Ripley.I knew the premise of this book to be Tom Ripley, an acquaintance of Dickie Greenleaf, is asked by Dickie’s father to go to Italy and attempt to convince Dickie to return to the U.S. I also knew at some point Tom’s developing friendship with Dickie while in Europe morphs into more of an obsession and that . . . . stuff happens. (No spoilers on this one, friends.) That was about it, though. I had never seen the movie because this . . . . \nis the most punchable face in all of mankind and I just can’t watch his movies. Completely unfounded and I’m sure Mr. Damon is a pleasant fellow, but I want to slap the crap out of him whenever I see him. (How will I ever deal with the movie version of The Martian????? Ohhhhhh woe is me!) I also can’t forget to mention the film co-starred Goop as the leading lady and, well, eww . . . \nThe one thing that might be worth taking a little looksee is this . . . \nPurrrrrrr. Anyway, enough about the movie I never saw. This is a book review (and obviously a super highbrow one at that). For a story that is 60 years old, The Talented Mr. Ripley holds up to the test of time remarkably well. There are a few “lost in translation” moments when dealing with things like money and the idea that a couple grand is a giant bankroll that will float you through Europe almost indefinitely, as well as the use of outdated lingo such as “sissy” or “pansy” used to describe Tom. Speaking of, I’m sure some might take offense to whether or not Tom was attracted to Dickie sexually being used as kind of a giant pink elephant in the room throughout the story, but I thought it worked well as a diversionary tactic. It helped hide the fact that Tom was not interested in anyone sexually (which he flat out tells you through his narrative), but he was quite possibly a sociopath who had fixated on obtaining a lifestyle like Dickie’s that no one seemed to notice. Recommended to anyone interested in a real slow roller type of suspense novel, an addition to your “modern classics” list, or those of you who like to read about people you’re supposed to hate (but really kind of love). Half star removed because there are FOUR more of these in the series? NOOOOOOOPE. As far as I’m concerned, this one is a standalone. Tom’s story does not have enough material for more books and I don’t believe the others could even come close to being as good as the first."}, {"userName": "Orsodimondo", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "UN FALSO QUALCUNO PIUTTOSTO CHE UN AUTENTICO NESSUNO New York anni Cinquanta. Tom Ripley sbarca il lunario tra furtarelli e truffe. Un giorno conosce un ricco industriale che gli propone di pagarlo per andare a recuperare il figlio in Italia, Dickie Greenleaf.Dickie si è insediato sulla costiera amalfitana, a Mongibello, paesello d’invenzione. Tra spiagge, barche, Venezia, Roma, la Liguria, la Grecia, si dipana un’intricata avventura, che è diventato un classico dei classici, almeno per me. Un sogno, una proiezione, un miraggio, una favola suadente.”Plein soleil-Delitto in pieno sole” di René Clément, 1960: Ripley è Alain Delon, l’amico Greenleaf è Maurice Ronet, la sua ragazza Marie Laforêt.Ripley è un truffatore, ma anche assassino con pochi scrupoli, uno psicopatico che Highsmith trasforma nell’eroe di una saga in cinque romanzi, che ha ispirato più volte il cinema, e ha ispirato una quarantina d’anni della mia vita. Questo primo, e poi a seguire Il sepolto vivo, L’amico americano, Il ragazzo di Tom Ripley per finire con Ripley sott’acqua, usciti tra il 1955 e il 1991.Tom appartiene alla schiera esigua degli eroi negativi (ben più numerosa quella di poliziotti e investigatori, di coloro che cercano e combattono il Male): Tom è il Male. Ma è il Male necessario, quello indispensabile, giustificato, sempre raffinato ed elegante.”L’amico americano” di Wim Wenders, 1977. Tom Ripley è Dennis Hopper. Ma il vero protagonista è il corniciaio interpretato da Bruno Ganz.La sua vita sul confine include anche la sessualità: nonostante dal secondo romanzo, spiazzando il lettore, sia sposato a una bellissima francese, Héloïse, ci vuole poco a percepire che in Tom abiti un’omosessualità più o meno latente. Highsmith non è mai esplicita e definita sull’argomento (come non lo fu nella sua personale vita: ha amato soprattutto donne, ma anche uomini, ed ebbe una storia con un gay), rimane reticente, allude, lascia aperta la porta all’obliquo, al mistero, come se mettere limiti, tracciare linee rigide in questa zona dell’essere togliesse linfa e gusto alla vita (è probabile che la stessa Highsmith abbia abbandonato gli USA proprio per il perbenismo sessuale dominante – molto più aperta e tollerante la Francia che la accolse, in seguito diventata Svizzera). Il fatto è che Tom probabilmente preferisce la castità a una vita sessuale intensa, preferisce la fedeltà alla bigamia, vive di passioni, più che di pulsioni, più attratto dall’arte che dal corpo umano.Non sorprende che Tom rimanga giovane nonostante gli anni passino, è una caratteristica della maggior parte degli eroi letterari, hanno un processo d’invecchiamento molto più rallentato rispetto al lettore.”The Talend Mr Ripley-Il talento di Mr Ripley” di Anthony Minghella, 1999. Matt Damon è Tom Ripley, Jude Law è Dickie Greeeleaf, la sua ragazza è Gwyneth Paltrow.Come mai piace così tanto al lettore, lo conquista, lo spinge a tifare per il suo successo anche quando uccide?Forse perché Ripley parte dai gradini bassi della società (orfano, istituti, una zia non proprio piacevole marchiano la sua infanzia) e arriva in alto grazie a forte personalità, impegno e determinazione, Highsmith riesce a inventare il villain che tutti vorremmo essere. Gli omicidi sono, o sembrano, tutti casuali: Tom aveva un piano, davvero programmava quello che ha fatto? E se invece, ha seguito gli eventi, come riusciva sempre ad anticiparli? Come ha fatto a essere così bravo?”Ripley’s Game-Il gioco di Ripley” di Liliana Cavani, 2002. Con John Malkovich nel ruolo di Ripley, Dougray Scott e Lena Headey.Qual è il vero talento di Tom Ripley?La truffa? L’arte della menzogna? L’amore per la vita? La ricerca del piacere?La meravigliosa invidiabile assenza di colpa?La mancanza di scrupoli?L’assoluta assenza di morale?È davvero colpevole dei suoi delitti, o non poteva fare altrimenti?Highsmith costruisce la sua suspense a base di psicologia, con pagine dove sembra non succedere nulla, avvolgendo il lettore in una fitta trama di inquietudini, attese, astuzie.”Ripley Under Ground-Il ritorno di Ripley” di Roger Spottiswoode, 2005, dove ripley è Barry Pepper."}, {"userName": "Melki", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "I was not a big fan of Highsmith's Strangers on a Train, so I wasn't really looking forward to tackling another of her novels. Fortunately, I had a much better experience with Tom Ripley. Oh, if only his other acquaintances could say the same . . . Our story begins with Ripley being sent to Italy to talk Dickie Greenleaf, the prodigal son of a wealthy man, into coming home. The two guys hit it off, and spend some time bopping around Europe like two Ken dolls on holiday. But things turn ugly when Ripley senses his time as Dickie's favorite toy may be coming to an end. Written in 1955, this one manages to stand the test of time, and still seems fresh and surprising. Highsmith featured her character Ripley in four more novels. This book has inspired two movies - 1960's Purple Noon and the 1999 version which starred Howdy Doody Matt Damon.This is a damn fine thriller, and one of those make-you-feel-skeevy-rooting-for-the-bad-guy books. On the whole, I enjoyed it very much. My only complaint? One of the same problems I had with Strangers on a Train: how can a female writer create such bland and uninteresting female characters? No wonder no one wants to hang out with poor Marge. She's not only boring, she's annoying as hell. But . . . Ripley's the star of this show, and oh, how he shines. I am tempted to follow him into another book just to see what happens next.The Talented Mr. Ripley is our January read in the Pulp Fiction group - https://www.goodreads.com/group/show/... There's still plenty of time if you'd like to join us for the discussion. Martinis and pernod are recommended."}, {"userName": "Richard Derus", "userReviewDate": "Dec 18, 2011", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: 4.5* of fiveThe Publisher Says: Since his debut in 1955, Tom Ripley has evolved into the ultimate bad boy sociopath, influencing countless novelists and filmmakers. In this first novel, we are introduced to suave, handsome Tom Ripley: a young striver, newly arrived in the heady world of Manhattan in the 1950s. A product of a broken home, branded a \"sissy\" by his dismissive Aunt Dottie, Ripley becomes enamored of the moneyed world of his new friend, Dickie Greenleaf. This fondness turns obsessive when Ripley is sent to Italy to bring back his libertine pal but grows enraged by Dickie's ambivalent feelings for Marge, a charming American dilettante. A dark reworking of Henry James's The Ambassadors, The Talented Mr. Ripley—is up to his tricks in a 90s film and also Rene Clement's 60s film, \"Purple Noon.\"My Review: This nail-biting page-turner is the first of Patricia Highsmith's novels featuring amoral, mass-murdering sociopath and all-around bon vivant Tom Ripley.What can I add to the generations of praise heaped on Highsmith's male alter ego? What else need be said? What delicious evil, what glamourous grue, and told with such economy of language!Well, for one thing, Tom's as bent as a bow, and because the book came out (!) in 1955 it wasn't possible to say frankly that he was *that way* and so was Dickie (!!) Greenleaf and Marge was a big ol' fag hag and Daddy Greenleaf was sending Tom to Italy in hopes that a cute boy would succeed where a revolted father failed to convince his queer son to return to a soul-killing life of pretending to be straight.And now that I'v delivered the post-Stonewallization of the book, I return to the text as presented.The characters are all deftly drawn to present us their essences in a short burst: Tom cruising bars and letting an older man (Pa Greenleaf) pick him up; Dickie resisting Tom's charm until Marge, acting as wing man, throws them together; Marge then doing the twist as she sees her efforts rewarded with too much success. It's all done in 30pp and it's set from there on, so suspense has to be created with audacity on the writer's part. We're drawn into Tom's troublingly untroubled world of crime, we're seduced into seeing the problems of Tom's murders from his point of view as puzzles to be solved in order to protect his now-customary lifestyle.It's a very difficult feat to pull off. It's even more amazing when one considers the author, a big ol' dyke, was writing in one of Murrica's most homophobic AND law-and-order obsessed eras. Highsmith, from all reports an unpleasant person to know, does this difficult balancing act with an assured hand at the storytelling tiller and a character-compass that pointed true north at all times. This is high quality storytelling, done in simple, unadorned prose. It is very much recommended and it's worth your time."}, {"userName": "Bradley", "userReviewDate": "Apr 22, 2016", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "Honestly, I'm of two minds on this one. The first is just how much fun I had running around with a trust fund buddy and the scam, enjoying 50's Italy, and especially the really delicious riffs from so many of the great authors doing their thing in the day, the subversion and the dark twist. I mean, we're all super-familiar with the heroic(anti-heroic) murderer protagonist, and some of us might be extremely familiar with it if they've read practically any mystery novels or watched ANY tv at all... but here it is, one of the first to really start the very popular modern mystery trend from the PoV of the sympathetic murderers. We'll ignore how much we love Richard the Third or the long line of True Crime novels or the Penny Dreadfuls, for now. This is the world of anti-hero worship, after all, thank you Dexter and Darth Vader. :)So yeah, I had a really good time with this. I remember watching the movie and have a great time with it, too, in the theater. Little did I know that I was missing out on great books, too. :) I'm making up for lost time. :) Mistaken identities, con games, great play-acting, opportunity, and, of course, seeing the bad guys win. What's not to love?And so I go to my second mind.Closet homosexuality. This novel, with so many others of the time including movies, always made the bad guys homosexuals. This is trope made tripe and it's as stale as it is insulting and almost entirely distasteful to modern readers, if it wasn't already so to people back then. I chose to read it as a buddy novel gone really wrong instead of thinly-veiled homosexuality, and I enjoyed it more, but the question still remains. I can write it off as a sign of the times or general ignorance or a cynical pandering to popular conceptions, or I can think again and be sad that such an otherwise interesting and cool novel should now be relegated to the back-shelf of history because of the implicit homophobia it exhibits, even if there was never an explicit hate comment.I'm willing to be generous, though. One doesn't toss out decades of literature just because the societal norms of today has changed significantly from those of our grandparents or great grandparents. We twist our noses and complain of the stench, but we still enjoy what is GOOD about what we've just read. That's where I'm standing, anyway. :)"}, {"userName": "William1", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/4684009-william1", "userReview": "I've been dabbling in some of the classic thriller writers. Simenon and Sciascia, too. It is summer (in the northern hemisphere) after all.The Talented Mr. Ripley will have you squirming in your seat. Tom Ripley is a man with champagne tastes and a beer pocket book. He possesses very low self-esteem, very little money and he is undoubtedly a closeted queer. He likes queers, likes to be among them, but doesn't like admitting to himself that this is so. Mr. Ripley's talent is an extraordinary gift for forgery, impersonation, mimicry and murder which with him become a form of self delusion. Add to this nerves of steel in the midst of interrogation, including the ability to formulate convincing fictions that is on a par with his creator, and you have the makings of more than a few hair-raising scenes. Dickie Greenleaf is AWOL from his father's shipbuilding firm in New York City and living in Mongibello, Italy. Dickie's father tracks Tom Ripley down in a New York bar. For some reason, he thinks that Tom's friendship with his son was consequential in a way it never was. Mr. Greenleaf offers to cover Tom's costs if he will go to Italy and talk Dickie into returning home. Alas, Mama Greenleaf is dying of cancer. Tom goes over, immediately becomes jealous of Marge, Dickie's lover. She repulses him in every way; women in general sicken him. Tom charms Dickie and moves in with him, estranging him from Marge. He is so in love with him and doesn't even know it. He is also very envious of Dicky's tremendous wealth and advantages. Tom begins to see a way in which he might subsume Dickie. So when Dickie intimates that Tom is queer, as he unquestionably is, Tom kills him with an oar in a motorboat then anchors his corpse to the sea floor.Well, that's all you need to know to get started. What follows is a masquerade in which Tom switches places with Dickie and back again to foil the ever present policia. A novel of plot and lots of fun. A real knucklebiter. Highly recommended."}, {"userName": "Diane", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "This classic novel of suspense lives up to the hype. I was familiar with the story of Tom Ripley because I had seen the Matt Damon movie, and the book was just as good as other readers had promised. Ripley is skilled at manipulating people, lying, impersonations, con jobs and feigning interest in others. What terrifies him is 1) getting caught and 2) being himself. It's a classic case of someone who feels arrogant and snide toward others but who also hates himself and feels like he doesn't fit in anywhere, unless he's impersonating someone else. In this first book in the Ripley series, he takes on the identity of Richard \"Dickie\" Greenleaf, who is a wealthy young man living in Italy. After living Dickie's life for several months, Ripley realizes he can't keep up the charade anymore because the police are looking for Dickie, and Tom has to revert to being himself again.\"This was the end of Dickie Greenleaf, he knew. He hated becoming Thomas Ripley again, hated being nobody, hated putting on his old set of habits again, and feeling that people looked down on him and were bored with him unless he put on an act for them like a clown, feeling incompetent and incapable of doing anything with himself except entertaining people for minutes at a time. He hated going back to himself as he would have hated putting on a shabby suit of clothes.\"I looked up what else Patricia Highsmith wrote and discovered that she wrote the novel that the Hitchcock movie \"Strangers on a Train\" was based on. Clearly I need to read more Patricia Highsmith."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 12, 2009", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "495.\tThe Talented Mr. Ripley, Patricia Highsmith (1921 - 1994)The Talented Mr. Ripley is a 1955 psychological thriller novel by Patricia Highsmith. This novel introduced the character of Tom Ripley, who returns in four subsequent novels known collectively as the Ripliad. It has been adapted numerous times for film, including the 1999 film of the same name.تاریخ نخستین خوانش: سال 2001 میلادیعنوان: معمای آقای ریپلی، نویسنده: پاتریشیا های اسمیت؛ مترجم: فرزانه طاهری؛ تهران، طرح نو، 1379؛ در 286 ص؛ شابک: 9647134134؛ چاپ دوم 1389؛ شابک: 9789647134132؛ داستانهای نویسندگان امریکایی - قرن 20 مهنر «پاتریشیا های اسمیت»، طرح، شخصیت سازی و سبک را، با مهارت تمام در هم میآمیزد، و داستان جنایی را، به ابزاری برای افشا و وارسی ژرفترین علایق و مشغله ی ذهنی خویش، بدل میکند. چگونگی احساس گناه، و همزیستی میان دو نفر (دو مرد)، که همدیگر را، هم جذب میکنند و هم دفع، از هنرهای یگانه ی ایشانست. ایشان در این رمان، با تحلیل روانهای رنجور سر و کار دارد. فیلم «ظهر ارغوانی» آلفرد هیچکاک، در سال 1961 میلادی، براساس این رمان ساخته شده است. ترجمه فارسی بانو فرزانه طاهری نیز بسیار شیواست. ا. شربیانی"}, {"userName": "Candi", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "\"His stories were good because he imagined them intensely, so intensely that he came to believe them.\"Tom Ripley has to be one of the most intriguing characters I've come across in a while – \"talented\", perhaps some would say so, but mostly conniving, obsessive, self-loathing, and quite lucky. Viewing everything from his perspective was fascinating and disturbing. I'm not sure if I was supposed to identify with him or not! I certainly never felt any empathy towards him, but at times, while not exactly rooting for him, I still felt as if I was placed in the position of a partner in his exploits. The Talented Mr. Ripley is an intense psychological thriller that builds to the peak of suspense a bit slowly and then erupts to a biting your nails, edge of your seat kind of pitch. I went into this book mostly unaware of the plot – I think this is the best way to enjoy this book. If you've seen the movie already or read too many descriptions of the story line, then I would imagine this would lessen the jolt you would otherwise experience. The vivid descriptions of Italy are captivating and I found myself wanting to visit this country even more earnestly than before. Having read the book, the movie will likely be less sensational; but the promise of being able to view the beautiful scenery on my television screen has me greatly anticipating watching this regardless. I highly recommend this book to anyone interested in a classic and rather brilliant psychological thriller. I have deducted one star only due to the fact that I reached a point where I felt this became slightly unbelievable; however the entertainment value allows this to be just a very minor criticism of the book as a whole."}, {"userName": "Algernon", "userReviewDate": "Apr 26, 2014", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "[7/10] I can do a number of things – valeting, baby-sitting, accounting – I’ve got an unfortunate talent for figures. No matter how drunk I get, I can always tell when a waiter’s cheating me on a bill. I can forge a signature, fly a helicopter, handle dice, impersonate practically anybody, cook – and do a one-man show in a nightclub in case the regular entertainer’s sick. Shall I go on? What Mr. Ripley leaves out from his resume is his readiness to murder anybody he sees as an obstacle in his path to personal happiness. And the fact that he doesn’t actually likes to work. He wants all the perks of wealth and leisure, but he wants them right now, while he is still young. Even worse, he feels entitled to a life of riches and the respect of the gentle folks, probably out of his exalted opinion of his own cleverness and out of a feeling discriminated against in childhood by an authorian aunt.Everything Tom Ripley ever wanted seems within his grasp when he somehow ingratiates himself with Mr. Greenleaf, an older New York industrialist, from whom he extracts money for a trip to Italy, there to convince his son Dickie to return home. Dickie has given up his place in the family business in order to pursue a painting career in Mongibello, a small seaside town near Napoli. When Tom arrives and sees Dickie’s lifestyle in southern Italy, so different from the hustle and bustle of New York, his own career as a small time confidence trickster pales in comparison: It wasn’t as much fun as sailing a boat in old clothes and being answerable to nobody for the way he spent his time, and having his own house with a good-natured maid who probably took care of everything for him. And money besides, to take trips if he wanted to. Tom envied him with a heartbreaking surge of envy and self-pity. I don’t think it is much of a spoiler to say that Tom Ripley is ready to commit murder to get his hands on all this. The novel is more an exploration of the character of a sociopath than a conventional whodunit. Spending time inside Ripley’s mind is a deeply disturbing experience, witnessing his total lack of scruples and his twisted self-justifications, the careful premeditation of his crimes and his obvious pride at getting away with it. I guess my reaction is normal, exactly what the writer wanted from the audience. I should have been more worried if I actually felt sorry for Tom. Still, my negative reaction to the main character of the novel explains the rather low rating for what is probably one of the best psychological thrillers of the 1950’s. There’s also more to admire in the book, beside the detailed investigation of Ripley’s character. There’s the sustained tension the reader is put through, the ominous build-up of hints that something bad is about to happen, the contrast between the innocuous outside visage Tom presents to the world and the darkness inside, the cat and mouse game between Tom and the police later in the book, his mood swings between paranoia and exhilaration at his lucky escapes. And, for those who love Italy like me, the book is quite accomplished as a tourist guide, praising the attractions of Venice, San Remo, Rome, Napoli, Capri, Cinqueterre, etc. ( He liked the fact that Venice had no cars. It made the city human. The streets were like veins, he thought, and the people the blood, circulating everywhere. )Patricia Highsmith builds a convincing case here to explain Tom Ripley’s exploits, yet again, given my own misgivings about him, I wanted real bad for Tom to be caught and punished as soon as possible. Often I felt that the police, Dickie’s girlfriend and all the other people pursuing Tom Ripley would compare notes and start asking the right questions, would for once see behind the mask and expose the monster’s duplicity. Highsmith brings two main arguments in favor of the mouse: his chameleon ‘talent’ and his willingness to take chances. We are presented repeatedly with Ripley’s boasts that he could impersonate anyone, anytime. I have to examples to demonstrate the thesis: Hadn’t he learned something from those last months? If you wanted to be cheerful, or melancholic, or wistful, or thoughtful, or courteous, you simply had to act those things with every gesture. - - - A cap is the most versatile of headgears, he thought, and he wondered why he had ever thought of wearing one before? He could look like a country gentleman, a thug, an Englishman, a Frenchman, or a plain American eccentric, depending on how he wore it. Tom amused himself with it in front of the mirror.  Risks are what made the whole thing fun  exclaims Tom at one point, ignoring previous moments of nail-biting terror and panic and promising more dirty deeds for the follow-up novels.I could spend more time on Tom, trying to decypher the puzzle of his sexuality and what influence it had on his pathological need to hide and to playact instead of being himself. Or on his fear of women and denial of homosexual attraction towards Dickie. On his obsessing over clothes and fascination with mirrors, with fine art and haute cuisine. Indeed, I could see the novel as a subject of study in medical schools, students being graded over how many symptoms of mental illness they can identify. But new titles are already claiming my attention. I probably will read the next Ripley books, but before that I might try other Patricia Highsmith titles (Strangers on a Train beckons me at the moment), hoping to have a less repulsive reaction towards the main character."}, {"userName": "Julie Ehlers", "userReviewDate": "Nov 11, 2014", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "When the 1999 film adaptation of The Talented Mr. Ripley was released, I remember reading a lengthy magazine article that discussed all the things about the book that were changed for the movie. I don't remember now what any of those changes were, but I do remember that I came away from the article thinking the book didn't sound very good. Thus, even though I had a copy of it, I avoided reading it for years and years. In 2017 it finally occurred to me that the book wouldn't have the staying power it does if there weren't something to it. I finally gave it a try and was amazed by how absorbing it was. The Talented Mr. Ripley is like an elaborate puzzle that Tom Ripley is constantly working, figuring out how to get himself into and out of treacherous situations entirely of his own making. While he's obviously some kind of psychopath, Ripley is also oddly sympathetic; Highsmith delves into his past and his psyche just enough to help the reader understand him, but thankfully without crossing over into sentimentality. It's a fantastic portrait, and I rooted for him the whole way through despite his pileup of bad deeds and appalling rationalizations. I truly loved every minute of this and was sorry when it was over. This isn't the kind of book I'm generally compelled to reach for, and I doubt I'll read any of the sequels. But I recognize perfection when I see it, and for what it sets out to do, The Talented Mr. Ripley is just about perfect."}, {"userName": "❀Julie", "userReviewDate": "Oct 10, 2015", "userURL": "http://www.goodreads.com/user/show/7425446-julie", "userReview": "This book got under my skin.  The narrator, Tom Ripley, is a sociopath who is one troubled and sinister character.   The father of a “friend” makes him an offer to go to Italy to bring the father’s son back to America.  Upon accepting his proposal, the tale of obsession and deception begins as Tom Ripley weaves his life into a tangled web, and what he manages to pull off is appalling.  This story requires a tolerance for unlikable characters, as Tom is a violent, manipulating, pathological liar who is lacking self esteem.  Since the book is from his perspective it was disturbing reading his calculated thoughts he expressed.  As despicable as this character was I almost feel guilty saying I liked the book, but I was definitely not rooting for him."}, {"userName": "Jon(athan) Nakapalau", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/58774673-jon-athan-nakapalau", "userReview": "One of the most chilling characters in literature I have ever encountered. Tom Ripley is all the more horrifying because of his total lack of empathy; someone who has looked into the abyss and thinks nothing of pushing others into it while laughing."}, {"userName": "Megan Baxter", "userReviewDate": "Jun 14, 2013", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "What a creepy little book. Highsmith takes us into the head of Tom Ripley, and it is an unsettling ride. Tom is a sociopath (or is he?), but an anxious one. And inside his head, we are carried along as his crimes mount, one upon the other, and feel the tension as he skirts the edge of disaster and discovery. Are we tense because we want him to be captured? Or because we want him to get away with it?Note: The rest of this review has been withdrawn due to the changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Nora Dillonovich", "userReviewDate": "Feb 23, 2008", "userURL": "http://www.goodreads.com/user/show/623295-nora-dillonovich", "userReview": "Oh Tom Ripley... what to say that hasn't been said dozens of times already? I clipped through the last pages at work tonite, hungry to know! desperate to hold hands with Tom Reeepley as he navigated his way through layer after layer of lie upon lie upon psychopathology! I found myself irked at customers who disturbed my reading, mid-paragraph (inconsiderate indecisive patronizing people! pick out your own damn flowers! take a chance for Christ's sake! No, I don't know what white roses \"means\"- pick a damn meaning and be gone!) and also rather paranoid. Every compliment or comment I recieved was questioned and then double questioned, as I toyed with the possibilities of varying double entendres and potential meanings as to my occupational/ social demise... what or how or why, I don't know. But I felt edgy at work. Like the day I first tried caffeine, twitchy. Edgy. Tom Reeeepley's mind is contagious I tell you. I still feel guilty- though i don't have anything to feel shame or guilt for! I am a New Englander, so, to a degree, feeling bad about all I am not doing all I could be etc is normal, but this? This Ripley-brain is far more intense, much more visceral. It makes my former Puritan guilt think look like moss beneath a flowering tree on the first day of spring. On a sidenote, the afternoon I bought the book at Powells, (one of my rare excursions into the Gold Room) I shared the Mystery 'H' aisle with a sophisticated old woman, peach hair, nice slacks, matching shoes and sweater- very nice jacket. Maybe it's because I'll be in Florida for a week soon, and I associate that state with old folks (mostly), that I couldn't help but dream, lust even, after a Patricia Highsmith mystery club with me and a handful of old ladies with peach and purple hairs and nice slacks and wide brimmed hats.... dreams. At least mine don't involve murder and European identity swaps. Or do they?!"}, {"userName": "BrokenTune", "userReviewDate": "Oct 15, 2014", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "He loved possessions, not masses of them, but a select few that he did not part with. They gave a man self-respect. Not ostentation but quality, and the love that cherished the quality. Possessions reminded him that he existed, and made him enjoy his existence. It was as simple as that. And wasn't that worth something? He existed. Not many people in the world knew how to, even if they had the money. It really didn't take money, masses of money, it took a certain security.The Talented Mr Ripley was my first introduction to the talents of Patricia Highsmith. That was way back in the 1990s, probably around the time that the Damon/Paltrow/Law film version of the book was released. Since then, I have read a few other books by Highsmith and about her, too. I am still in awe of her writing with every new book I pick up, but The Talented Mr Ripley remains special to me. Tom Ripley is a deeply disturbed character, who is described first in the book as a sort of failure at life. He's barely able to support himself, he's sponging off friends, he has no motivation to anything, and yet he sees himself as superior to his fellow man and enjoys manipulating people. Yet, he is also very afraid of being found out.Not just being found out of various crimes and misdemeanors, but also of being found out to be a failure, a nothing, nobody. Because Tom's greatest issue is that he has no personality whatsoever. That makes him as forgettable as it makes him desperate to be recognised.He was thinking that he had to identify himself, immediately. It would look worse for him, whatever happened, the longer he put it off. When he left the cathedral he inquired of a policeman where the nearest police station was. He asked it sadly. He felt sad. He was not afraid, but he felt that identifying himself as Thomas Phelps Ripley was going to be one of the saddest things he had ever done in his life.Now I am not going to try and analyse Tom. I couldn't. It is just that Tom's self-hatred and feelings of unacknowledged superiority set him up to take on any means of escape from his own life that present themselves, and this is where the gripping plot to this book starts off. We get to follow Tom on a mission, which he is bound to fail because the whole idea is ludicrous from the start. It does give Tom a new scene, tho, in which he can try and become something, become someone.I will not give much of the plot away but suffice it to say, there is murder involved, there is a police hunt across Italy, and there are various close encounters between Tom and other characters where I was just on the edge of my seat to find out how it would resolve. Would he get away? I must have spent half my time reading about Tom hoping he would be found out, and the other half hoping that he wouldn't - simply because it was such a thrill to read about this despicable, delusional, pathetic character that is Tom Ripley. Re-reading the book after so many years, I knew where the story was going, but was still thrilled by the details that I had forgotten since reading this in the 1990s - details which the film got wrong, by the way. Re-reading this also brought out many details about Highsmith's writing that I am not sure I appreciated on the first read: Highsmith toyed with Tom. She absolutely works him like a puppet in this story, and you can see that she derives a twisted kind of fun from doing this.At times when Tom wallows in self-pity, Highsmith makes us laugh at him.\"His parents had drowned in Boston Harbour, and Tom had always thought that probably had something to do with it, because as long as he could remember he had been afraid of water, and he had never learned how to swim. It gave Tom a sick, empty feeling at the pit of his stomach to think that in less than a week he would have water below him, miles deep, and that undoubtedly he would have to look at it most of the time, because people on ocean liners spent most of their time on deck. And it was particularly un-chic to be seasick, he felt. He had never been seasick, but he came very near it several times in those last days, simply thinking about the voyage to Cherbourg.\"At times when Tom's monstrosity seems to take over, Highsmith shows us his ineptitude.\"Marge had turned her Martini over. She daubed at the crocheted tablecloth awkwardly with her napkin.Tom came running back from the kitchen with a wet cloth. \"Perfectly alright,\" he said, watching the wood of the table turn white in spite of his wiping. It wasn't the tablecloth he cared about, it was the beautiful table.\"I'm so sorry,\" Marge went on protesting.Tom hated her. He suddenly remembered her bra hanging over the windowsill in Mongibello. Her underwear would be draped over his chairs tonight, if he invited her to stay here. The idea repelled him. He deliberately hurled a smile across the table at her.\"I hope you'll honour me by accepting a bed for tonight. Not mine,\" he added, laughing, \"but I've got two rooms upstairs and you're welcome to one of them.\"\"Thanks a lot. All right, I will.\" She beamed at him.\" So, what we get in The Talented Mr Ripley is the story told from two points of view - the delusions of Tom Ripley, and the observations of Highsmith who is orchestrating Tom's story. Highsmith had a wicked sense humor, and I do mean \"wicked\" in the sense of dry, dark and very twisted. This comes to full show in Ripley and, on this second read, I could not help but wonder what other nuances of Highsmith's personality may have made their way into the book, too. I am assuming that Tom's closetedness may also have been drawn from the author's own experiences, and that the overwhelming amount of alcohol that is described in the book may, sadly, have been another.As Andrew Wilson quotes from Highsmith's diaries in 1944 (11 years before Ripley), in Beautiful Shadow: A Life of Patricia Highsmith, Alcohol, for Highsmith, was another way of accessing her subconscious mind and throughout her notebooks and diaries she repeatedly refers to drink as essential for the true artist, as it ‘lets him see the truth, the simplicity, and the primitive emotions once more’.I have no doubt that I will refer back to Ripley - whether as a result of reading more of Highsmith's work or whether as a comparison to other thrillers I may come across. In the weirdest of ways, The Talented Mr Ripley has been such a fun book."}, {"userName": "Edward Lorn", "userReviewDate": "Mar 30, 2015", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "This one didn't work for me at all. For one, I think this is the first time I will ever say the following words. The movie adaptation is far more powerful than the book. Matt Damon was likable as Ripley. The Ripley in this book was fucking boring. Also, there's a character in the movie that is not in the book, and I think he made all the difference, even if he wasn't the center of attention. His character made for a much more interesting and emotional ending. Luckily, I read this after having seen the film over a decade ago, because had I read the book first I'd have no desire to watch the film, and that would have been a sad thing.Another problem I had with The Talented Mr. Ripley has nothing to do with this book. I rate my read based on experience. Unfortunately, this experience was ruined by me having had a Jeff Lindsay/ Dexter Morgan marathon last week. It is glaringly obvious that Dexter was modeled after Highsmith's formula, which makes me what to go back and drop my ratings of each Dexter novel. I dislike coincidence as a plot device. Let me clarify: I do not mind coincidence in books. It is a part of real life. But when your entire plot balances on coincidence (getting away with crime after crime because of some fortuitous circumstance), my give-a-fuck drowns like a passenger on the Titanic. That is me. That is my subjective opinion. I read this book because it was on this list: http://www.buzzfeed.com/iramadison/sh...I'll be reading everything on that list. In summation: Patricia Highsmith died in 1995, so I'm sure she won't take offense to me disliking her creation. She was a great writer, but this one wasn't for me.Final Judgment: Suck my Dickie."}, {"userName": "batsaki", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/40239126-batsaki", "userReview": "Κι ενώ το τέλος είναι αναμενόμενο -ο τίτλος το κάνει ξεκάθαρο- υπήρχε μια περιέργεια/αγωνία για το πως θα εξελιχθούν κάποιες σκηνές/συναντήσεις. Η πλοκή κυλάει άνετα, οι περιγραφές πολλές χωρίς να κουράζουν και οι χαρακτήρες στο σύνολο τους αρκετά ενδιαφέροντες. Ο πρωταγωνιστής οξυδερκής χωρίς ηθικούς ενδοιασμούς αλλά τρομερά ανασφαλής, δεν δέθηκα μαζί του, ούτε τον συμπάθησα όμως προκάλεσε το ενδιαφέρον και μαζί την λύπηση μου.4 αστεράκια για την γραφή την οποία πραγματικά απόλαυσα."}, {"userName": "Char", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "To Tom Ripley, being bored, being around dull people and having nothing to do are among the WORST things in existence. Of course, he never has to be bored again after brutally murdering his friend and assuming his identity.Tom is recruited by Mr. Greenleaf, (the father of Tom's acquaintance, Dickie) to bring his son home from Italy. Tom is even given a hefty sum with which to support himself in Italy while working his come-home-magic on his friend. Unfortunately, Ripley has no luck persuading Dickie to do anything, other than to get stumbling drunk nearly every minute of the day. Then, shortly after an awkward scene where Tom is caught trying on Dickie's clothes, Tom decides to whack Dickie and that's where this story really begins. I'd seen the movie with Matt Damon a long time ago, but I've always been fascinated with the character of Tom Ripley and wanted to read the book for myself. In the 50's, stories from the viewpoint of the murderer were rare, not like today. I think it was also rare, (feel free to correct me), to have the antagonist be likable at times. I mean, there you are, in Ripley's mind rolling along thinking about your afternoon cocktails and that evening's parties and then BAM! He's whacking someone across the head with an oar. And then whacking them again. And then across their neck. And then stabbing them with it as if it were a sharp instrument. He's wheezing and out of breath and he's still going. And there's the reader, a bit stunned, wondering how we got to this point and where did everything go wrong? This right here is what I liked best about the story. Now we have Criminal Minds and FBI profilers that write books about serial killers, sociopaths and the like. In the 50's when this book was written, that was not the case. I think Patricia Highsmith had the thought processes of Ripley down pat. Nothing is ever his fault. He is just so clever and everyone else so dull and stupid. The depravity of his thoughts are presented so matter-of-fact-ly that they could almost pass for normal. His ability to read the emotions and thoughts of others and anticipate what they'll do and how they'll react in certain situations is astonishing. It's almost like Ripley was not a person at all, but instead just a collection of facial expressions and witty banter wrapped around an all encompassing greed. He was a mimic of a person. He had nothing within himself-all that he was came from outside.\"He loved possessions, not masses of them, but a select few that he did not part with. They gave a man self-respect. Not ostentation but quality, and the love that cherished the quality. Possessions reminded him that he existed, and made him enjoy his existence. It was as simple as that. And wasn't that worth something? He existed.\"He was so good at his machinations that he, himself believed them. He would imagine scenes in his head over and over again-so they would become real. To him, real in his head equated to real in reality. He believed so totally and utterly that it was easy for him to make others believe too. To me, this is where the strength of this book lies-the creation of Tom Ripley. He is such a fascinating character that I can see myself reading this again in the future. This story really wouldn't work in today's world, with all of our phones and cameras and facial recognition software-in that regard The Talented Mr. Ripley is dated. However, as far as the creation of a believable sociopath, Tom Ripley would be right at home in an episode of Criminal Minds-and he would give the investigators a good run for their money. Highly recommended!"}, {"userName": "Nancy Oakes", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "if you're interested in the longer post I've made, you can read it at my  online reading journal. Spoilers are noted where needed. Tom Ripley is an extremely disturbed man. Knowing what we know about him, we probably wouldn't want him to come to dinner, live in our neighborhood, date our daughters or our sons, handle our investments -- in short, after we've gotten to know him, we discover he is someone we would avoid like the plague. But all of the above are judgments made from our outside, reader point of view. Rereading this novel taught me a valuable lesson -- when accepting an author's invitation to enter the mind of a paranoid psychopath, you may not like where things are heading, but you've made the choice to be party to his point of view for the time being. Reading The Talented Mr. Ripley demands that you step into Ripley's brain in order to more fully understand this guy and what makes him tick. It's the best and imo the only way to wrap your head around what he does and why he does it.Back in the real world, outside of Ripley's mind, of course the guy's a pathological killer, an amoral bad guy who will stop at nothing to get what he wants. He's the ultimate manipulator, the worst kind of bad guy, and someone you would want to never encounter. But none of that is applicable while you're inside of his world, where good and evil do not exist, where things just sort of follow a logical progression necessary to achieve his ultimate goals. In fact, it's easy to understand why everyone does what they do in this novel, and that's why it works so well, and why it has remained a classic for over sixty years."}, {"userName": "Alex", "userReviewDate": "Oct 17, 2015", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "This probably isn't going to sound good, but I feel for Tom Ripley. He embodies all my weakest, most petulant, lowest self-esteem moments - when I find myself asking, \"Why don't you like me more? Why can't I have what you have? Why can't I take the easy way?\" Just...my stuff sucks, give me your stuff.Nobody likes Tom. No one's ever really even tolerated him. He can't tolerate himself. You root for him not because you like him - you probably don't - but because...there but for the grace. What would you be like, if no one had ever liked you? \"The psychopath,\" Patricia Highsmith says, \"is an average man living more clearly than the world permits him.\" What makes you root for Ripley is not that he's a bottomless pit of want, but that he proactively tries to fill it. Where we think, \"Why can't I have what he's having?\" Mr. Ripley sets out to take it. He's ambitious, hard-working, and - in his own way - brave. I hope he gets away with it.This series goes downhill pretty quickly, and I suggest you don't bother. Here are my reviews of rest of them:- Ripley Under Ground (4 stars, fine)- Ripley's Game (3 stars, blah)- The Boy Who Followed Ripley (2 stars and we're well off the rails here, although the result is accidentally funny)- Ripley Under Water (1 star, just a dire waste of pages)"}, {"userName": "Eddie Watkins", "userReviewDate": "May 27, 2009", "userURL": "http://www.goodreads.com/user/show/1131783-eddie-watkins", "userReview": "\"Man, damn good book,\" I mumbled to myself as I turned the last page early this morning, far too early to express more substance or insight through the strange mental fog that renders me zombie-like yet still allows me to read with clarity, as what I read seeps down into my body & soul where nerves are racing and my palms are clammy while person after person files by examining me with suspicion for every indiscretion or deception I've ever committed. Deep in the fog I remember the lies I've told myself and others to cover up lies I've told all for the stimulation of puzzling my way through the sticky webs. I remember the exhilaration of getting away with the lies; the exhilaration of looking into the eyes of someone who believes my balderdash; balderdash I myself now believe in an ecstasy of self-revelation. I remember the sinking empty despair of imagining I've been found out, of the draining away of my identity through the mesh of devious self-invention, and I have been found out, but if I somehow wriggle out of this I swear to go straight, to be straightforward and honest and to delight in my cozy dullness, to never swipe another uni-ball pen from work or murder my mouthy mistress. In the new light of fog-less existence I will go to Italy where I will find myself afresh, where I will feel real affection for someone, where I will taste the fully accoutered good life and drink in the sun and disappear into the lives of others; to emerge absolved of all past sins, ready to begin it all again. \"Damn compelling,\" as I stumble to the shelves for another Patricia Highsmith."}, {"userName": "Thomas", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "3.5 starsA creepy thriller with themes of identity and sexuality at its core. Tom Ripley, an observant yet dull man, befriends Dickie Greenleaf, a rich and charismatic aspiring artist. Tom's relationship with Dickie turns into an obsession that spirals into bouts of anger and jealousy. When Tom makes a life-altering decision, he finds himself changed as well - a new identity forged from his own dark desire.I love Patricia Highsmith's characterization of Tom. Her portrayal of him raises so many questions: can we gain power by staying \"in the closet\" about our sexuality and other parts of our identities? How much of our selves comes from our immediate actions as opposed to more inherent traits? Are our personalities just performances of what we wish to present to the world? With The Talented Mr. Ripley, Highsmith creates a suspenseful tale that asks us to question ourselves and the people around us. Recommended for fans of mysteries and thrillers who also enjoy forays into backstabbing, violence, and complex, unreliable narrators."}, {"userName": "Nick Pageant", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/25561549-nick-pageant", "userReview": "Big thanks to Mishy for another great buddy read and to Giulio for scholarly guidance.For a super exclusive behind the scenes look at this amazing buddy read - follow this link!Here's a little peek at what you'll see:Mish and I are both camera shy, but sometimes the paparazzi gets past security."}, {"userName": "Ij", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/4341680-ij", "userReview": "2015: The Year of Reading Women"}, {"userName": "Richard", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/8386404-richard", "userReview": "7.5/10When an acquaintances father hunts down Ripley to dispatch him on a mission to Italy and persuade his estranged son to come home to then work in his shipyard what could possibly go wrong? The fact that you're sending a sociopath to a foreign land with quite a wedge of money to persuade someone who really doesn't want to be persuaded might dent the chances of success but let's give it a shot!The first third of this novel didn't sit well with me, I don't think I took to the plausibility of the plot and the writing didn't blow me away and Ripley wasn't a likeable character. Then things happened and something clicked. I liked the sense of claustrophobia that was felt, the noose tightening as every lie led to another lie. Ripley turned into a cunning master of deception, we were privy to some of his thoughts and it became apparent that he was emotionally absent and was only interested in his wants and desires. It was later on that I realised how well this was written, Ripley is essentially a horrible piece of work yet I found myself engrossed with how he was going to get away with it. This shows true talent to grab your reader in such a way. One thing I must mention that really aided me with the enjoyment here was that I was part of a very active group read. The differing thoughts and opinions of people made for some fascinating reading and probably led me to thinking about the book more and developing my own views whereas when I wasn't enjoying it this could have become a chore. Overall I'm glad I read this and would read more by this author in the future but I won't rush to read more from this series just yet.If you like this try: \"Gone Girl\" by Gillian Flynn"}], "description": "Since his debut in 1955, Tom Ripley has evolved into the ultimate bad boy sociopath, influencing countless novelists and filmmakers. In this first novel, we are introduced to suave, handsome Tom Ripley: a young striver, newly arrived in the heady world of Manhattan in the 1950s. A product of a broken home, branded a \"sissy\" by his dismissive Aunt Dottie, Ripley becomes enamored of the moneyed world of his new friend, Dickie Greenleaf. This fondness turns obsessive when Ripley is sent to Italy to bring back his libertine pal but grows enraged by Dickie's ambivalent feelings for Marge, a charming American dilettante. A dark reworking of Henry James's The Ambassadors, The Talented Mr. Ripley—is up to his tricks in a 90s film and also Rene Clement's 60s film, \"Purple Noon.\"", "title": "The Talented Mr. Ripley\n      \n          (Ripley #1)", "url": "http://www.goodreads.com/book/show/2247142.The_Talented_Mr_Ripley", "average": 3.93, "cover": "https://images.gr-assets.com/books/1435426615l/2247142.jpg", "reviews": 2402, "authors": [{"url": "https://www.goodreads.com/author/show/7622.Patricia_Highsmith", "name": "Patricia Highsmith"}], "type": ["Fiction", "Mystery", "Mystery", "Classics", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/2247142.The_Talented_Mr_Ripley", "http://www.goodreads.com/book/show/156024.The_Talented_Mr_Ripley", "http://www.goodreads.com/book/show/5114321-the-talented-mr-ripley", "http://www.goodreads.com/book/show/227032.The_Talented_Mr_Ripley", "http://www.goodreads.com/book/show/156027.The_Talented_Mr_Ripley", "http://www.goodreads.com/book/show/3101807-il-talento-di-mr-ripley", "http://www.goodreads.com/book/show/14060541-the-talented-mr-ripley", "http://www.goodreads.com/book/show/4859681", "http://www.goodreads.com/book/show/16300551-the-talented-mr-ripley", "http://www.goodreads.com/book/show/23199551", "http://www.goodreads.com/book/show/7853133-the-talented-mr-ripley", "http://www.goodreads.com/book/show/25622850-carol", "http://www.goodreads.com/book/show/15677.Strangers_on_a_Train", "http://www.goodreads.com/book/show/3845356-ripley-under-ground", "http://www.goodreads.com/book/show/3425503-ripley-s-game", "http://www.goodreads.com/book/show/427281.Deep_Water"]}