{"ratings": 1490, "userreviews": [{"userName": "Becky", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/7364610-becky", "userReview": "I really didn't find this to be as strong a book as one moment one morning, which was a shame. The subject is a moving one although I did find it a little hard to connect with Lou's near instant decision to have a child, especially when compared to the more considered desire of Cath. Considering the speed with which Lou seems to come to this decision it did seem somewhat cruel to the characters and the readers that the author decided to only grant success to one woman in this story. There seemed to be several sharp criticisms of single parents running through this book, which I do not feel were entirely necessary, especially not if one remembers the central story of 'one moment'. The title of this book is also a little misleading, the actual two week wait is skipped through remarkably quickly, and even the most traumatic and joyful scenes of the story seem to be given only a short moment within the novel, it does read a little as though the author ran out of steam around the conception stage of the story which is unfortunate. Overall this has the potential to be a very moving story, but ultimately I didn't feel that it held together as well as I would have liked."}, {"userName": "Jeanet", "userReviewDate": "May 18, 2012", "userURL": "http://www.goodreads.com/user/show/4766722-jeanet", "userReview": "Heartbreaking and life affirming. Two words I used to describe Rayner's first book about the Brighton based women Lou, Karen and Anna 'One Moment, One Morning' and they could easily be used again for the review of 'The Two Week Wait'. Sarah Rayner once more reminds us that ordinary lives are filled with extraordinary events and once we are able to connect the dots an amazing story is unfolding right before us. I love her no fuss way of telling a story. Written in present tense the events of the books seems to be happening around you - and the story is filled with characters that feels as real as were they truly a part of your everyday. The women of the book don't live perfect lives - and they certainly don't make perfect decisions - and the story is sad and joyous - terrible and perfect - it is filled with life as we all know it and love it."}, {"userName": "Chris Chalmers", "userReviewDate": "Feb 26, 2012", "userURL": "http://www.goodreads.com/user/show/7268416-chris-chalmers", "userReview": "I've read two of this lady's previous novels and loved them both.. This is a kind of sequel to the excellent One Moment, One Morning, though previous knowledge is not required to reap the full benefit of this moving and pacey tale. Her research on the subject of IVF is meticulous though worn lightly, and it's guaranteed to strike a chord with anyone who's been through a similar experience. After One and Two, you do wonder if a Third novel is in the offing - there's plenty of mileage left in Sarah Rayner's thoroughly engaging characters, and I'd love to hear what happens next! Highly recommended for a gripping commuter/holiday read!"}, {"userName": "Kara Hansen", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/10572178-kara-hansen", "userReview": "A solid 3 stars. This book took me by pleasant surprise! When I first started to read it, I wasn’t too sure about this book. The topic can be a sensitive one ( infertility), and some of the avenues pursued can be difficult. However, the story had a nice flow and the characters were fairly realistic."}, {"userName": "Lori", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/11611172-lori", "userReview": "This is a story about two women who never meet but are bonded for life. Lou makes a visit to the doctor after finding a lump in her tummy. The doctors treat her fibroids and suggest that if she ever wants kids, to do so a.s.a.p. Lou’s partner, Sofia, is not ready to take on that responsibility and they end their relationship on friendly (but painful) terms. Lou is not a wealthy woman and the treatments are pretty expensive. She is approved for a program in which she is able to undergo the treatment for free if she agrees to donate some of her eggs to another person seeking to have a child.Cath, who has undergone chemo and has had her ovaries removed, is the recipient of Lou’s eggs. Her husband Rich is very supportive and realizes that he wants to have a baby just as much as Cath does. Their stories of love, hope, anger, determination, and acceptance are woven together and told with such tenderness. However, the emotions that are stirred up in this fine read are not sappy or over the top. The very end, in which one of the ladies sends the other a note via their doctor, made my eyes well up (and I am not an “emotional” person). I received this ARC through Goodread’s First Reads and recently discovered that The Two Week Wait is a sequel to One Moment, One Morning. I’ve never read Raynar’s work, but I will now. I am definitely going to get the prequel and hope there is a sequel to the Two Week Wait in the works."}, {"userName": "Patrice Hoffman", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/5405898-patrice-hoffman", "userReview": "*Won Through a Goodreads Giveaway*At times I find my self wanting to binge on women's fiction and this novel in particular fit that bill. The story centers around two women who have found that their biological clocks are ticking or have already run out of time. After surviving a health scare, Lou's doctors tell her that if she wants to have children, the time is now. Cath, having dealt with cancer, was unable to have children of her own. These women don't know each other except through anonymity. They both decide IVF is the way to go in order to satisfy their want of having a child.The two week wait (2WW) is the period between having the embryos... um... put in and the proof of it's success... or at least a pregnancy test that says at that moment you're a pregnant lady. It was interesting reading what the women go through in order to stay sane during that waiting period. Sarah Rayner does a great job at explaining the process to the reader in a way that isn't like reading a medical document. She weaves it into the story instead of boring the reader to death with procedures and technical terms.This book also throws in the necessary anti- in vitro argument as well. But one person who was against it was painted as the most vile person ever. I usually have problems with cliched characters, but I think a lot of this book was too unrelatable. Or at least to me. I feel that no matter what, if a woman wants to be a mother, she will do whatever she can to become a mother. By that I mean adoption, IVF, or surrogacy. These women both kinda fell into wanting a child easily without much consideration of what they would do if IVF didn't work. It made their want, not need, of having a child seem too unreal. Although the premise of this book was pretty interesting, the characters weren't. I didn't feel any connection to these women. I was more connected to the women in their chat room than I was to them. I also felt more of a connection to the process of IVF than to either woman. Maybe that was the point Rayner was getting at. Overall, this book was a great quick read for lover's of women's lit'. It does not disappoint on the women's issues front. I look forward to adding her other works into my future women's literature binges."}, {"userName": "Danderma", "userReviewDate": "Apr 05, 2012", "userURL": "http://www.goodreads.com/user/show/8604247-danderma", "userReview": "The first book I read by Sarah Rayner, One Moment One Morning, was very good. It was sad but it had a certain type of story that people can identify with. The ending was good and provided a kinda happily ever after ending. When I was last in the UK I looked for more books by Sarah Rayner, only to find that she had written a second book, kinda like a sequel, to the first one. The second book was called “The Two Weeks Wait” and of course I grabbed it and it made the top of my books to read list, which is getting quite lengthy btw.I came back from the UK in March. I started reading the book right away. We are near the end of May… and I still haven’t finished the book. I've started and finished several books in between. I give up. I tried. I usually force myself to read so and so books in hope they get better in the end, maybe a different twist? But by doing so I would be hiding from a very obvious reality: Even if the ending was good, the book is boring! BORING! I can’t read it. I cannot engage in it. It tells the story about how someone who now suddenly decides to have a baby after a uterus illness scare and she is running out of time and in the same time trying to give her eggs to another couple where the woman just got out of cancer which killed off her ovaries but her uterus is still OK.First off, I totally cannot relate to it. The situation of sharing eggs and finding donors and what’s not is an alien world to me. Secondly, what happened to the story line from the first book? Its all but diminished. If any of the old characters do appear they are totally dull and now we have to be introduced to the other couple too. It could have been more interesting, but It wasn’t.Therefore, I am putting it down. I give up. Two months trying to force myself to read through the pages of the same book? I began flipping through the pages in the end. That’s it. The first book wasn’t the best book of the century but it was a pretty good one, quite interesting and everyone can identify with it. The second however is meh and the best thing about it is that it had a pretty cover."}, {"userName": "Shelagh Rice", "userReviewDate": "Feb 27, 2016", "userURL": "http://www.goodreads.com/user/show/20709970-shelagh-rice", "userReview": "A good solid follow up to One Moment One Morning, though you could read it without having read the first one. This follows the lives of four women and their children and the struggle some have with fertility issues. It follows two of them through the highs, lows and heartbreak of IVF. I liked the way the author used a forum the women use to educate the reader on the facts of IVF without feeling you were reading a medical paper. The story kept me engaged and I learnt at lot about a subject I thought I knew about. It is not a deep dark read, the author manages to make you care but does not overwhelm. Another solid 3 star."}, {"userName": "ALEXA", "userReviewDate": "Feb 28, 2012", "userURL": "http://www.goodreads.com/user/show/4988733-alexa", "userReview": "Reviewed on Alexa Loves Books.Ever since I was a little girl, I always knew I wanted to be a mother and raise a family. I thought the process was straightforward enough, but as I got older, I realized it was possible for many complications to get in the way - infertility, a lack of a partner, medical conditions just being some of the few I can name. The Two Week Wait is a beautifully written tale. Sarah Rayner takes us through the twists and turns with remarkable skill and just the right touch of emotion.The CharactersI very much admire Lou's character. Throughout the novel, she demonstrates a whole lot of patience, bravery, kindness, and love. She was stubborn enough to stick to her guns when it came to having a child, and wise enough to recognize the wisdom of going after what she wanted, even if caused a few ripples in her life. This straightforward doggedness in going after what she wanted is essentially what makes her character that much more lovable to me.Cath is a character that I really loved. I feel like I'm a lot like her in my determination to have a family, my propensity for \"nesting\" and the dreamy, emotional personality. She does pull a few crazy, obsessive stunts in this book, but somehow, I find her mood swings understandable. There are many times that I find myself empathizing with her (and often to the point of tears in my eyes).The StoryThis story just took my breath away. The reality of the struggle that Sarah Rayner presents in her story ignited a strong emotional response. I honestly found that, while I was reading, my emotions were going all over the place - there were moments of happiness, deep sorrow, bitterness, rage. To have a story play on my emotions like that... well, I can honestly say that I think it's an incredible ability for a writer to have.Using two women's different, but parallel stories to tell this particular tale was genius to me. Weaving both together made for a more interesting novel. I never felt like jumping from one to the other was confusing, as their stories are definitely easy to distinguish. The lapse in time, though often clarified later on, was a little confusing.I would rather not go into detail about the plot in order not to spoil it, but I thought Sarah Rayner did a wonderful job with her storytelling. Everything that occurred felt real to me, in the sense that it could happen to me or someone I know. I felt like I became much more aware of a few things after reading the novel.Personally, I say you should...Read this novel if you're interested in checking out adult books this year. It's a compelling, emotional read - and I absolutely loved it. The Two Week Wait will definitely strike a particular emotional chord in your heart."}, {"userName": "Juliet Loves Books", "userReviewDate": "Jun 01, 2012", "userURL": "http://www.goodreads.com/user/show/4476395-juliet-loves-books", "userReview": "I loved One Moment One Morning and Sarah Rayner's new novel does not disappoint. The Two Week Wait is about the fertility struggles some women face - in this story, a gay woman who wants a child and a straight couple who are unable to conceive naturally. Bizarrely, despite how common fertility problems are today, it doesn't seem to be a topic covered in novels, at least I haven't come across another, and reading the lives of Rayner's characters does feel like a realistic and close-up insight into what it might be like to be on that difficult journey - the painful desperation, the not knowing if treatment will work, how other people might judge you, and so on. It also makes you think about the lengths you might go to were you in a similar position to the characters. This story particularly focuses on egg-sharing, which I hadn't even heard of before and which is fascinating. What I didn't know, before reading The Two Week Wait, is that the main characters from One Moment One Morning are carried over, as it were, and so we get to find out what happens next to them. That said, it doesn't matter if you haven't read OMOM, this novel does stand on its own. So as well as being a story about trying to have babies, it is also about friendship and the bonds that bind. And it has a great ending, a last line that hit me out of the blue, sent a shiver down my spine and I had to catch my breath. I would definitely recommend this book."}, {"userName": "Gabrielle Kimm", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/4672355-gabrielle-kimm", "userReview": "I had absolutely loved 'One Moment, One Morning', so was very much looking forward to Sarah Rayner's new book. And then, as I began to read, I was delighted to find that the characters I had most cared about in that first book (especially Lou - my favourite from OMOM) were featuring in this new story.There is a tenderness in Sarah Rayner's writing which I really love - her characters are real, believable, engaging. This second story revolves around IVF - not something about which I knew very much at all when I began reading - and I learned a great deal about the procedure from reading the book. But the story wears its research very lightly, and the driving force of the book throughout is the interaction between the characters and how the realities of IVF impact on them.A terrific read. Thank you Sarah! I'm looking forward to Number Three!"}, {"userName": "Tyra", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/1299376-tyra", "userReview": "I think I found a new author! I enjoyed the story and the characters. Now I need to go back and read her first book and see which characters carried forward"}, {"userName": "Marissa", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/12196757-marissa", "userReview": "SPOILER ALERT!!!!! **spoiler alert**This is the most god awful, depressing, dry story I've ever read! I was literally forcing myself to read it just to get it over with. I'm sure a lot of it has to do with the fact that I'm American and therefore didn't understand a lot of the \"Proper English\". At one point I felt as though I'd be better off keeping a thesaurus on hand to translate. Word choices aside, I understand this is meant to be a touching story, but there's no need for it to be so damn depressing. I only laughed twice, and both of those were well after 200 pages in. I also understand that IVF is a tricky procedure and doesn't work like magic every time (surprise, modern medicine does have it's limits), but to add not one but two failed IVF treatments on top of a successful battle with caner just adds insult to injury. The fact that Cath's sister in law Sukey is such a heartless bitch about the whole thing just turns everything spiteful. And while I get that the egg sharing program is a fantastic way to go about IVF, it almost seems unfair that the egg donor gets everything financially taken care of while the egg recipient is almost bankrupted by the attempts.There were also several times during the book where I thought for sure Lou and Cath would put two and two together through their online forum, and have some way of being in contact that way, but no. Instead we have to wait until the very end of the book for them to have any sort of semi-anonymous contact via the fertility clinic. The only truly cute thing about the whole story is that Cath sends Lou the baby blanket she'd made for her own future baby during her first two week wait. And then you realize the book is over and you're just overcome with joy. It's finally over!! No more agonizing pain as you force yourself to soldier on in the hopes that things get a bit better. I would not recommend this book to anyone easily susceptible to bouts of depression as it will seriously make it worse. However, I do recommend it for anyone that's somehow romanticized IVF into being a miracle cure because it'll serves as a a brutal wake up call. All in all, not worth the read."}, {"userName": "Danielle", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/3394582-danielle", "userReview": "This is a really well written book. It may be about a sensitive subject, but it is explored in way that really teaches you something as well as being a really good novel. It is a proper page turner and the way the story twists and turns really leave you hanging onto every word. I really enjoyed this book, and it taught me a thing or two along the way."}, {"userName": "Carla", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/4909646-carla", "userReview": "It's an interesting topic that is core of Sarah Rayner's book: egg sharing. The story of two women that don't know each other, still are connected. Lou, a lesbian woman, hears after an operation that she shouldn't wait too long if she's thinking about getting children. Her partner Sofia is not ready for children (or will probably never be ready), so they split up. The other woman is Cath. Cath is cancer survivor and will not be able to get children in a natural way. Unless she gets the eggs from another woman. And that's where the lives start to connect, because Lou is going to be the donor of eggs that Cath will receive. The book tells about the background of their lives, their relationships (partner, friends, family), how they get to the decision of hopefully becoming mothers and then the medical procedure and of course after the egg implantation.The book is an easy read, lots of emotions, up until the end. I found however an imbalance in the beginning and middle part. To me the decisions of the two women and their partners (including Lou's perm donor) were a bit rushed. Those are big decisions! I would have preferred a bit more thoughts and dialogue here. No wonder Sofia runs away! The middle part, after the decision, on the other hand was too long and too detailed. The author clearly did her homework on the medical part and everything was explained in a clear words, but it slowed down the story. The speed picked up towards the end to the best part of the book. I really liked the last part, it just took a bit too long to get there."}, {"userName": "CuteBadger", "userReviewDate": "Aug 27, 2012", "userURL": "http://www.goodreads.com/user/show/4084869-cutebadger", "userReview": "The story of two women trying for \"last chance\" pregnancies through egg sharing, and the impact it has on them and those around them.I really enjoyed Sarah Rayner's first novel, One Moment, One Morning, so was greatly looking forward to reading The Two Week Wait. However, having now read it I can't say I really enjoyed it or thought it a worthy successor to her first book.This is almost entirely down to the subject matter and my complete lack of interest in pregnancy, IVF and motherhood - as this is pretty much the entire subject of the novel it wasn't ever a book I was going to enjoy or rave about.I also didn't realise until I picked the book up that it included some of the same characters from One Moment, One Morning. I'm not sure how I feel about this - part of me enjoyed seeing them again, but another part felt that it was a bit of a cheat on the part of the author. I never really made my mind up on that one even after finishing the book.Those who enjoyed Rayner's first book will probably enjoy this one too and I'm sure it will be relevant to the vast majority of women who, unlike me, are interested in reading about pregnancy and motherhood. It's just not for me."}, {"userName": "Anne", "userReviewDate": "Feb 03, 2012", "userURL": "http://www.goodreads.com/user/show/2464996-anne", "userReview": "From the author of One Moment, One Morning, and featuring the same characters of Lou, Karen and Anna, but this takes their lives in a wholly different direction. In this book, Lou steps into the forefront, deciding to have a child following a health scare. If you read the first book (and you really don't need to - this one will stand alone) you'll remember that Lou is gay, so there begins the search for a father, followed by IVF treatment which means she produces more eggs than she needs. I've never fully understood the agony of women who want a family beyond all else (I don't have a maternal bone in my body), but I understand it considerably better after reading this book. Sarah Rayner deals in raw emotion in an accessible and readable style, she has an equally deft touch dealing with love and friendship, and I loved this book every bit as much as I loved her first. Moral dilemmas abound, but are sensitively handled - and I found myself indignant, angry and weepy by turn.If you can cope with the content - and I can understand some people might find it difficult reading - I'd highly recommend this one."}, {"userName": "Maryellen", "userReviewDate": "Oct 24, 2012", "userURL": "http://www.goodreads.com/user/show/6023641-maryellen", "userReview": "Set in England, THE TWO WEEK WAIT follows Cath in Yorkshire and Lou in Brighton on their separate yet connected journey toward motherhood. Lou has recently dealt with having had a fibroid tumor removed and was told that if she wanted children she should do so sooner than later. Cath has survived cancer and with the help of an egg donor is told that she can carry a child. These women have never met yet their lives become intertwined. Telling the story in the present tense, the author makes the reader feel as though they are on the roller coaster journey of IVF with the characters. What happens in these women’s lives with their significant other; their family; and their friends will have you feeling every emotion possible. And then, the very last sentence of the book~~seven words~~don’t skip ahead and read them. Just wait for it. Worth the wait.I won this ARC as a First Reads Giveaway. The author first introduced us to these same characters in the book ONE MOMENT, ONE MORNING. THE TWO WEEK WAIT is not a sequel to ONE MOMENT ONE MORNING but instead a sister book to it. I plan to get to know these characters better by reading more of Ms. Rayner's work."}, {"userName": "Kat", "userReviewDate": "Mar 26, 2012", "userURL": "http://www.goodreads.com/user/show/3263758-kat", "userReview": "Sarah Rayner is a good writer, I have read the book before this \"one moment one morning\" and think that it should be read after the two week wait as it fits perfectly. This book was a great joy for me despite the subject the writing was powerful and kept you gripped. It made me sad as well as things happened that left a lump in my throat. My favorite character was Anna, as she's the friend everyone wants to have. She is thoughtful and kind in both books. The reason it's only four stars is because Sukey who is Cath's sister in law really annoyed me. She was so judgmental and thought she was perfect in every sense of the word, and every time her scenes came up I wanted to throw the book out the window. I've never felt passionately annoyed by a character before and I was quite shocked at myself. I felt sorry for Cath's brother Mike having to live with her on a daily basis. If you want to read something that will have you gripped, with emotion and good writing. This is the book for you."}, {"userName": "Abbie R.", "userReviewDate": "Oct 24, 2012", "userURL": "http://www.goodreads.com/user/show/5603366-abbie-r", "userReview": "The Two Week Wait is a touching, heartfelt and uplifting story. The story follows two strangers, Lou and Cath, as they each struggle to form a family of their own. The characters feel like real people and I could instantly relate to everything they were going through, even though I've never been in a similar situation.This isn't the type of book I usually pick up (I tend to go for love stories or action-packed books instead of those that deal with deep subjects like IVF and struggling to have children), but I thoroughly enjoyed reading The Two Week Wait.It had a great balance of family, friendship, love and drama along with a dash of lighthearted humor. It's about more than just wanting to have kids. It's about recovering from illness and dealing with depression and living life while you can.This book left me with a happy heart and more than once brought tears to my eyes."}, {"userName": "Joni", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/7875450-joni", "userReview": "I got this book from Goodreads GiveawayIt has been a long time since a book made me cry, and it took me by surprise. I finished the last page, closed the book and tears just poured down my face. Very touching story.I really appreciate how the writer focused only on the feelings of the two women and not weather it was right or wrong, and not getting into the politics of this topic. The story hit close to home for me because my oldest daughter was born with no ovaries, she is 20 now, and I know eventually this will come up in her life….weather to try or just accept it as is.I won’t give any spoilers but how it ended was very special, and I’m glad the one woman saw this for herself. I have to find and read the first book....."}, {"userName": "Lynne", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/12805595-lynne", "userReview": "I really enjoyed this book. I love the way the author just got right inside people's thinking. It is about two women's journey through infertility and the challenges and decisions they make in response to it. It's very much about their emotional journey which I find fascinating, but then as a former social worker I love hearing about people's emotional lives whether it's something I'm familiar with or not. I do think society as a whole is learning to understand and appreciate our inner lives and that can only be for our long term good. So it's not for just selfish reasons I hope she's writing more like this, it's a jolly good read!"}, {"userName": "Sheri", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/287060-sheri", "userReview": "While this was not my favorite book I did find aspects of it interesting. I found the whole process of egg sharing and IVF fascinating. The author did a great job of giving you enough information so you understood the process but not so much as to get too clinical and boring. My heart went out to poor Cath and Rich and their circumstances. I truly felt for them and their desperate desire to have children. The reactions of the different people in each of their lives and Lou's life to the process was eye opening especially to the whole God verses nature debate."}, {"userName": "Brenda", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/4437383-brenda", "userReview": "Brilliant.I wanted to both cry and be happy for the characters ... I was with them every step of the way.I suppose because I have been there in a 'baby situ' (8 miscarriages a still birth then two children) I was fingers crossed and holding my breath throughout the book whilst watching their lives played out like a game of russian roulette.It helped that I had read her previous book and knew some of the characters but it does stand as a read on it's own without having read her first book. The story isn't dependant on you kowing what went before."}, {"userName": "Corrie", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/13256698-corrie", "userReview": "I received this book through First Reads. Thank You! This was a very moving and emotional book for me. I felt a connection to both women, Cath and Lou even though I have never gone through what either of them had to. This book made me think about how lucky I am in my life and what strength and courage many families have to go through this process. This is the first book I have read by this author and I will read more!"}, {"userName": "Karen", "userReviewDate": "May 12, 2014", "userURL": "http://www.goodreads.com/user/show/30903377-karen", "userReview": "This book was excellent reading, it had me hooked from page 1!Two women, both of whom have fertility problems, will never meet but help each other and are linked together forever. All the characters in this book were believable and likeable people and I felt their pain and happiness as I was reading.By the final page I was in tears, and never before have I cried at a book.Would highly recommend!"}, {"userName": "Laura", "userReviewDate": "Sep 18, 2012", "userURL": "http://www.goodreads.com/user/show/11766863-laura", "userReview": "Nice book and good insight into IVF but I would have liked more detail, it seemed to miss huge chunks out and speed through important parts like the \" two week wait\" the writer failed to capture just how stressful a two week wait is. A nice read and fairly heartwarming but I'd have like to see the subject of infertility studied with a bit more depth and not just a rush through."}, {"userName": "Maite De fuenmayor", "userReviewDate": "Feb 22, 2013", "userURL": "http://www.goodreads.com/user/show/14460413-maite-de-fuenmayor", "userReview": "This book tells the story of Cath and Lou; two woman that want to have a baby and for different reasons they can't. Their life is connected since the day that they decide to fight for it. You can live their problems, their emotions and you can feel the value of a friendship relation. I want to tell you more....Just take a deep breath and begin to read!!!!"}, {"userName": "Tami", "userReviewDate": "Oct 23, 2012", "userURL": "http://www.goodreads.com/user/show/10185201-tami", "userReview": "I received The Two Week Wait as a first reads winner. This is the first book I have some what read by Sarah Raynar. It's also the first time I haven't been able to finish a book. I enjoyed the characters and the subject is a touching one. However, I just had a hard time getting into the whole IVF and egg sharing idea."}, {"userName": "Din", "userReviewDate": "May 07, 2016", "userURL": "http://www.goodreads.com/user/show/30665442-din", "userReview": "Great book about two women in parallel stories that are facing struggles in starting families. The struggles are different for each woman but you feel for both the characters as they struggle to make decisions about their future. A great read"}], "description": "A memorable and moving page-turner about two very different women, each yearning to create a family of her ownWhat if the thing you most longed for was resting on a two week wait? From the author of the international bestselling One Moment, One Morning, comes a moving portrait about what it truly means to be a family. After a health scare, Brighton-based Lou is forced to confront the fact that her time to have a baby is running out. She can't imagine a future without children, but her partner doesn't seem to feel the same way, and she's not sure whether she could go it alone. Meanwhile, in Yorkshire, Cath is longing to start a family with her husband, Rich. No one would be happier to have children than Rich, but Cath is infertile. Could these strangers help one another? With her deft exploration of raw emotions and her celebration of the joy and resilience of friendship, The Two Week Wait is Sarah Rayner at her best.", "title": "The Two Week Wait", "url": "http://www.goodreads.com/book/show/15793222-the-two-week-wait", "average": 3.62, "cover": "https://images.gr-assets.com/books/1344318185l/15793222.jpg", "reviews": 236, "authors": [{"url": "https://www.goodreads.com/author/show/1021011.Sarah_Rayner", "name": "Sarah Rayner"}], "type": ["Womens Fiction", "Family", "Fiction", "Adult Fiction", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/15793222-the-two-week-wait", "http://www.goodreads.com/book/show/13084436-the-two-week-wait", "http://www.goodreads.com/book/show/13625084-the-two-week-wait", "http://www.goodreads.com/book/show/7606431-one-moment-one-morning", "http://www.goodreads.com/book/show/17857396-the-other-half", "http://www.goodreads.com/book/show/21055603-another-night-another-day", "http://www.goodreads.com/book/show/23307971-making-friends-with-anxiety", "http://www.goodreads.com/book/show/19286668-getting-even"]}