{"ratings": 222, "userreviews": [{"userName": "Shana Festa", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/9185553-shana-festa", "userReview": "The Tilian Effect doesn’t exactly pick up where The Tilian Virus left off but rather a year into the future. Mike Allard and the gang have escaped the mainland United States by the skin of their teeth and arrived on the island of Cuba, a post-apocalyptic safe haven. In my last review of The Tilian Virus, I made a point to discuss how I wished the author had delved more deeply into the meat of the supporting characters and developed them more. Well, to my delight, Tom Calen does just this in his follow up to the first book.Mike Allard takes a backseat for the majority of the book. Having been injured during the escape from Miami, Allard is now a withdrawn man, post-traumatic stress disorder plagues him as well as survivor’s guilt and he has now stepped into the shadows. This is where the author takes advantage of his supporting cast of characters and brings forth Michelle, Andrew and Erik, Allard’s former students turned post-apocalyptic warriors. Paul, the former park ranger and Allard’s right hand man from the mountain camp. Lisa, service woman in the US Military turned head of security. All these people bring to the table what the last book did not, diversity.Now in Cuba, our survivors are slowly falling into their roles in the new world. The virus has been eradicated on the island and humanity is slowly beginning to rebuild. Everyone has been assigned their own jobs and homes, life seems to be life again as everyone picks up the pieces of a crumbled world and puts them together. Michelle and Andrew are able to have a normal romantic relationship, they get engaged and discuss wedding plans like any other normal couple today would. Lisa and Paul, the stress of survival no longer snapping at their heels, are able to allow themselves to relax and find comfort in a relationship with one another. Unfortunately for Erik, he has slipped into the grasp of alcoholism, and uses drinking as a means of numbing the pains of his mainland experience. Each of our survivors, including Mike, has found their own way of dealing with life after The Tils.With that being said, the book is extremely slow from the get go. I understand the necessary need for the development of these characters, however, the pick-up on the story didn’t occur until about halfway through. It took a lot of focus to get into and a slight bit of rereading to remember what was happening in the first half of the book. But, I pressed on and knew that it would pick up and leave me satisfied.Paul and Lisa, along with their search and rescue team, head back to the mainland to find more survivors. But someone has a secret agenda amongst them. With the unknown traitor in their midst, Paul and his crew also run into a very troubling situation that they may or may not make it out of. Michelle overhears a mysterious conversation in the library about “The Ira Project.” Upon further investigation, Michelle realizes she is in way over her head in discovering the island’s secret atrocities and has unknowingly dragged the rest of her group down with her. And if that’s not bad enough, our old enemy, The Tils, have returned. In the year of sitting pretty on a remote island, have our survivors gone soft? Will they be able to overcome the challenges that await them in The Tilian Effect?Calen’s second book in The Pandemic Sequence is just as entertaining as the first, but you have to force yourself to give it time and be patient with the story build. The mystery he brings to the table in this one though, is an added bonus as well as continuing with the adventures of the mainland. The intricate plotlines flow together smoothly and make for a dangerous climax. The ending of the novel leaves you somber and eager to complete the series. Betrayal and heartache, life and death, longing to find yourself in the ruins of the end of the world; these are all themes touched upon by Calen in The Tilian Effect. However much I wished the pacing would move a bit faster, I’m still excited to read the final installment in The Pandemic Sequence and hope that it returns to its roots in adventure and survival."}, {"userName": "RJ", "userReviewDate": "Dec 16, 2013", "userURL": "http://www.goodreads.com/user/show/4187755-rj", "userReview": "While the story itself is interesting and has merit, the writing seems disjointed or jerky to me. I cannot put my finger on it, but the writing does not flow and hold my attention. I am repeatedly going back to listen again to refresh my memory and feel comfortable with where I was in the story. I've made it this far, I need to find out what happens in book three now."}, {"userName": "Angela Rimmer", "userReviewDate": "Mar 30, 2012", "userURL": "http://www.goodreads.com/user/show/8493028-angela-rimmer", "userReview": "If the first half had been nearly as entertaining as the second, I'd be more inclined to give it three or four star rating. The writing is unpolished at best, lazy at worst. The plot line is suspenseful and entertaining enough to keep you reading though."}, {"userName": "Debra Odom", "userReviewDate": "Feb 23, 2014", "userURL": "http://www.goodreads.com/user/show/5343698-debra-odom", "userReview": "An excellent zombie book!"}, {"userName": "Shiela", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/11075257-shiela", "userReview": "Good follow-up to 'The Tilian Virus' if you are into books about viruses, zombies, and end of days."}, {"userName": "Mary", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/6826469-mary", "userReview": "What a let down....I had to retread the last ten pages to see if I missed anything"}, {"userName": "Mallory", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/24729344-mallory", "userReview": "A solid second book in a (so-far) good series."}, {"userName": "Brian", "userReviewDate": "Apr 26, 2014", "userURL": "http://www.goodreads.com/user/show/7237417-brian", "userReview": "Very interesting 2nd book. It was a great second installment to this series."}, {"userName": "Michelle", "userReviewDate": "Jun 03, 2014", "userURL": "http://www.goodreads.com/user/show/11628371-michelle", "userReview": "Enjoyed that this one picked up a year later following the groups continued journey of staying alive and relying on each other to survive."}], "description": "Solace. Shelter. Safety.For the survivors of the Tilian Virus, they thought their escape would lead them to a new beginning. But the effects of the virus reach far beyond simply infection.A trusted member of the survivors hides a horrible past.While in the wastelands of America, a new threat grows.The bonds of friendship strain and shatter.And the Tils become more deadly than ever.The virus was just the beginning. Now the world must face the Tilian Effect.", "title": "The Tilian Effect\n      \n          (The Pandemic Sequence #2)", "url": "http://www.goodreads.com/book/show/13552115-the-tilian-effect", "average": 4.04, "cover": "https://images.gr-assets.com/books/1393647736l/13552115.jpg", "reviews": 10, "authors": [{"url": "https://www.goodreads.com/author/show/5259612.Tom_Calen", "name": "Tom Calen"}], "type": ["Horror", "Horror", "Science Fiction", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/13552115-the-tilian-effect", "http://www.goodreads.com/book/show/13328442-the-tilian-virus", "http://www.goodreads.com/book/show/15742195-the-tilian-cure", "http://www.goodreads.com/book/show/23874156-sarah-of-the-romani", "http://www.goodreads.com/book/show/25129740-the-tilian-virus", "http://www.goodreads.com/book/show/23214360-torrance"]}