{"ratings": 4654, "userreviews": [{"userName": "Redfox5", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/3816075-redfox5", "userReview": "Back in 1996 my dad brought home a game for our playstation called Resident Evil. At the time I thought it was one of the scariest things I'd ever seen and I watched my dad play the whole game. I even had a go myself but quit after that zombie dog jumps through the window, I threw the playstation controller down and hid behind the door, leaving Jill to die a horrible death. I watched my dad play the others in the series and now I watch my boyfriend play the more recent games. I love the movies, I think they are awesome regardless of what anyone says. So was pretty excited when I saw this book on amazon. It was very nostalgic. I have a pretty good memory for the layout of the mansion. I knew that if they went left they would hit the dinning room with the zombie or if they went right, they would hit the zombie dog coming out of the window....ahhh! They made sure to include the puzzles from the game. The only thing that was different was that more of the characters entered together when I'm pretty sure it was just Jill and Chris. I enjoyed this trip down memory lane though I'm not sure of it's appeal to people who arn't already fans of the franchise."}, {"userName": "Zack", "userReviewDate": "Oct 18, 2007", "userURL": "http://www.goodreads.com/user/show/558049-zack", "userReview": "This book is the first in the series and is based on the top selling video game. Chris Redfield, Barry Burton, Jill Valentine, and Brad Vickers, members of the Alpha S.T.A.R.S ( Special Tactics And Rescue Squad) team in Raccoon City, are dispersed to find the missing Bravo team. On their way out though, Jill is stopped by a man named Trent. He gives her some information and some clues to help her out. Jill doesn't know why he is giving her the information but she takes it just in case. When the team arrives at the Bravo crash site they encounter a horrer beyond imagine. They find refuge in the \"abonded\" Spencer estate. The team splits up to find out what they're up against and to try to find a way out. Will they be able to get out? Or will they die to the horrors that await them in the mansion?This book would fit under the genre of survival horror. This was a very well written book and had very little errors. One of my favorites part of this book was the fact that it changed from the different view points of the characters. One thing I didn't really like though was that it didn't exactly follow the storyline of the games. The language in the book gets grafic at times, but that is what makes it more interesting to read. Near the beginning of the book, when Trent gives Jill the clues and map, it foreshadows that she will encounter puzzles and she will be in a house of some sort. There are many suspensful moments in the book. One is when the Alpha team has to run away from the horrors in the forest. It is a fast paced chase scene and it makes you want to read so that you know who makes it to the mansion and who is killed. Altogther, this was a very well written and because of it I have gone on to read the rest of the series."}, {"userName": "Kati", "userReviewDate": "Sep 02, 2009", "userURL": "http://www.goodreads.com/user/show/198122-kati", "userReview": "Book #1 in the \"Resident Evil\" series. Takes place at the same time as \"Zero Hour\", book #0. Where \"The Umbrella Conspiracy\" is told from the POV of the Alpha Team, \"Zero Hour\" is told from the POV of the Beta Team that crashes its helicopter right at the beginning. I read ZH first - unfortunately. Why? Even though the events should take place simultaneously, there are so many errors, it's not even funny. Rebecca is the main heroine of ZH, the young field medic slash chemist and she kicks major butt, zombies, other monsters, whatever, she survives the self-destruction of the training facility and THEN goes to the Spencer estate - in TUC, she doesn't have a gun, she doesn't recognize the monsters, she ran towards the Spencer estate together with her team right away, so basically, ZH didn't happen. In ZH, Wesker is at the training facility - in TUC, he's the leader of the Alpha Team. And that totally ruined the fun. So, my advice, either read \"Zero Hour\" or \"The Umbrella Conspiracy\", NOT both!Another thing - the beginning was awesome and I was totally hooked, the team was simply great. But soon, it was back to the same old, same old: open a room, find a clue, solve a puzzle, find a key, fight a monster, move on - lather, rinse, repeat ad infinitum. Seriously, dear author, you really do NOT have to copy everything you see happening on your computer screen, scene for scene. It was rather ridiculous after a while. And what's with the \"let's split up\" routine? What a great idea to split up in a house that's built like a booby-trapped maze.I think that this will be the last book in the \"Resident Evil\" series that I'll read. You read one book, you read them all. It's a carbon copy of a rehash of a carbon copy."}, {"userName": "Gwen Guerrero Maciel", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/31884516-gwen-guerrero-maciel", "userReview": "Amo la saga de videojuegos de RE y es por eso que hace años leí las novelas, por fin encontré los tomos en físico y me dispuse a releer este libro. Ha sido gratificante, me vuelve a llevar de la mano a la mansión de spencer y ver los comienzos del brote en Raccon city, sin duda es de mi saga favorita de libros... Los personajes, la ambientación, todo corresponde como es y me es bastante bueno volver a conocer a mis personajes favoritos."}, {"userName": "Joss loves Jace", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/60459323-joss-loves-jace", "userReview": "Very good book and video game I really like."}, {"userName": "César Bustíos", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/19979434-c-sar-bust-os", "userReview": "Muy bueno.\"La Conspiración Umbrella\" es la novelización del primer juego de Resident Evil lanzado en el año 1996 y que, dicho sea de paso, dio origen a la millonaria franquicia de Capcom. Fue uno de mis juegos favoritos para PlayStation 1.Sentí mucha nostalgia al leerlo, recordé las muchas horas que pasé muerto de miedo tratando de terminar el juego (con la luces prendidas y el volumen al mínimo, claro). Perry lo narra de una forma bastante fácil de seguir y que, según recuerdo, termina siendo bastante fiel a la historia original del juego. Los personajes son bastante creíbles. Sin duda, una excelente novelización.Los S.T.A.R.S. de Raccoon City en la Mansión Spencer:"}, {"userName": "Nek0 Neha (BiblioNyan)", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/11405894-nek0-neha-biblionyan", "userReview": "🐍 Wonderfully written; the prose really captures the eerie and creepy atmosphere of the Spencer Mansion quite well, in addition to the fear and dread that all of the characters feel as they discover the secrets hidden away.🐍 Splendidly atmospheric with rich, vivid details.🐍 Violent, bloody, gory, and at times quite disgusting, which I loved.🐍 There are extra scenes and plot twists in the novel that aren't shared in the video game, which adds more intrigue to an already twisted story.🐍 'Tis a tad bit cheesy, particularly where dialogue is concerned, but I honestly feel that it adds to the charm of it all; also, it does take place in very late 1990s.🐍 My only gripe is that it doesn't include Lisa Trevor from the Nintendo GameCube re-make.🐍 Overall, it's a fantastic novelisation of the original video game released for the Playstation.🐍 PLEASE NOTE: I HIGHLY RECOMMEND THAT YOU READ THE UMBRELLA CONSPIRACY BEFORE READING ZERO: HOUR, MORE SO IF YOU'VE NEVER PLAYED ANY OF THE GAMES, AS TO AVOID MAJOR PLOT SPOILERS, AS WELL THE BUILDING OF SUSPENSE!!🐍5 snake bites outta 5!"}, {"userName": "♠ Eze ♠", "userReviewDate": "Aug 06, 2015", "userURL": "http://www.goodreads.com/user/show/36162557-eze", "userReview": "Se sintio mas como una transcripcion del juego que como una novela en si. A cada segundo el punto de vista cambia a otro personaje y con esto nos llena de sus ideas y pensamientos, hasta el punto de ser bastante molesto.Que me llevo a leer este libro? Sera mi pasado como gamer y/o el que nunca terminara este juego de la saga, aunque si unos cuantos otros.No me esperaba la gran cosa, y no me sorprendio ni decepciono. Es basicamente todo lo que ocurre si lo estuvieramos jugando en lugar de leyendo.Las peliculas basada en juegos son malas, los juegos basados en peliculas son malos. Bueno, las novelas basadas en juegos tambien, quien lo diria, no?Todo esto no quiere decir que fuera una mala lectura, para nada. Entretuvo bastante la mayor parte del tiempo. Pero la verdad es que se pueden leer cosas mucho mejores, como tambien se pueden leer peores."}, {"userName": "Erik Castillo", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/63385163-erik-castillo", "userReview": "Despise de leer el libro basado en Resident evil zero, este me decepciono un poco. Creo que el Pero tenia mejor narrativa y otros elementos que te hacia adentrarte mas a la historia. Aquí esta mas calcado del juego y el problema es que en el primer titulo había muchas incoherencias que nunca pudieron corregir. Y aquí están en el libro haciendo contradicción con las otras entregas. Estuvo pasable pero esperaba algo mejor."}, {"userName": "Rosie", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/12456868-rosie", "userReview": "I hate Wesker even more after reading this book. I hate him from head to toe - or shades to boots, in his case - and this is coming from a person who played and complete Resident Evil 5!Before reading this, I'd looked in every nook and cranny or cyberspace to soak up RE info. On my journey, I've been able to watch the RE 1 live action intro cutscene. With that visual image imprinted in my mind, this book was more then easy to see in my head. Not only thanks to the into movie, but by the author getting the right balance of descriptive terms so the reader can paint their own mental pictures but are directed in the right direction.I got this on the 10th May - for my birthday - and I broke my one chapter a day rule very quickly with this book. The fast pace and never ending feel of suspense, adventure and that tingly feel you get while playing the game that feeling where there's always something around that corner, door and so on... Absolutely fantastic from start to end with no lulls, quiet moments or filler of any kind. I literally couldn't put it down. I'm now, sadly done with this book,but I am more ready for the new ones!! But to be honest, I will most certainly reread this in the wait for new material - it's just that good!The characters are more then spot-on, with their descriptions matching each one. I feel enjoyment with the small backgrounds and inserts of the characters whilst all the action is going on, too! Gory creators, floods of emotions, loveable characters - obviously! This book is an absolute must, must read for RE fans! This leaves you wanting more, leaves you wanting to meet with your beloved STARS team and leaves you despising the Cheshire Cat Wesker... and this is once again coming from someone who hasn't played the 'classic' RE games!!DCIPHOENIX"}, {"userName": "Xime García", "userReviewDate": "Nov 06, 2014", "userURL": "http://www.goodreads.com/user/show/25821784-xime-garc-a", "userReview": "Lo único mejor a un grandioso final, era un grandioso final con público\n.Un grupo especial de la policía, llamado S.T.A.R.S. decide acudir de refuerzo a sus compañeros cuando, en un ataque de nervios y adrenalina, su única salida es ocultarse dentro de la Mansión Spencer. Lo que no sabían era que dentro de esa mansión los esperaba la noche más larga de sus vidas... y el traidor que estuvo manipulándolos desde el principio..Nunca jugué al Resident Evil original, aquel que fue lanzado para PS1 con tremendos gráficos para la época, pero que ahora son un montón de polígonos cruzados y mal texturados. Por eso es que, más allá de lo que yo pude conocer de historias posteriores, este libro, basado en ese juego, fue toda una novedad para mí. Para empezar, AMO A WESKER. Su mente fría y calculadora lo hacen uno de los mejores villanos que existen. Te banco, Wesker. Sobretodo porque amo a tu futuro hijo, ok no. Segundo, BARRY ROCKS. No hay personaje que merezca más amor que este grandote barbudo. Tercero, QUIERO A REBECCA DE MEJOR AMIGA pero que no empiece a hablar de esas cosas raras químicas y biológicas de las que ella sabe tanto.Cuarto, NO HUBO BESO ENTRE ESTOS DOS!! Esperaba verlos más juntos, pero la verdad que se pasaron todo el libro separados y perdidos en la maldita mansión. Jill, Chris, quería que se enamoraran en esta historia :( Parece que su amor llega más tarde. Y no desesperen, chicas, que Chris crece y se convierte en esto:\nIban a derrotar ese lugar, y cuando salieran de allí, Umbrella lo iba a pagar caro.\nMi única queja radicaría en que era una novela potencialmente buena para causar miedo... pero no se me movió un pelo. Quizá porque ya conocía la historia. P.D.: QUÉ onda con el tiburón, explíquenmeP.D.2: QUIÉN CARAJOS ES TRENT"}, {"userName": "Andrew Leavitt", "userReviewDate": "Nov 11, 2012", "userURL": "http://www.goodreads.com/user/show/5610518-andrew-leavitt", "userReview": "This is a good book for what it is: an attempt to novelize a video game that, though it has a large amount of action content, is really more of a puzzle game. And Perry does a good job writing around the puzzles. Or as good a job as anyone can do, at least. After all, without leaving at least some of the puzzles in, this book would have been a very short trip through a mansion of zombies and into a science lab. Not much to keep interest without a puzzle aspect. Sure, it works much better in the game, but Perry also comes up with some creative ways around some of the more ridiculous puzzles and simply ignores others.Perry also does a good job juggling the fact that at any given time there are five people in the mansion, and the mansion isn't that big. Chris and Rebecca teaming up helps, as does her conveniently finding a room for Wesker to huddle down in. She avoided the kidnapping plot that the games have to fix some of that, which is good. Simply kidnapping one of the characters would probably have made this book very tedious, as rescuing the kidnapped character in the games is more of a last minute hassle than something fun.I also found the back story Perry adds to the beginning interesting. We get characterization, which the games kind of lack, even on the current generation of platforms, and we get more to the story than just the basic less-than-a-minute explanation the game gives when you start. It was refreshing and, although not cannon to the game series, compelling in its own way.And that is something to keep in mind while reading this book. Perry didn't write these books with the intent of staying solidly within the cannon of the series. In fact, she started writing these books before many of the later games came out. So while this book remains parallel to the game for the most part, it shoots off at sometimes jarring angles.I picked up this book mostly as a casual read because I'm a huge fan of the game series. And as a fan, understanding the drawbacks of the timing for these books and the problems with translating the game to text, I really enjoyed this book. I would recommend it to any fan of the games, though it might not be nearly as interesting to someone who never played them. And ultimately I think this book was good enough fluff reading that I will probably buy the next one at some point too."}, {"userName": "Annmarie Ager", "userReviewDate": "Oct 09, 2011", "userURL": "http://www.goodreads.com/user/show/3326631-annmarie-ager", "userReview": "I would like to say first of all i’m a massive fan of everything about resident evil. I watched the movies and played the games on the computer but i did not know there was a book (i know i’m shocked to). When i finally found there was a book i got it once in my hands I started to read....Book one follows the first computer game (not the movie) I was really glad that it follow the game because when you playing it you did feel that lots was left unseen. The story starts just people are turning up dead the STARS members are finally called in to find out what going on...Is it wild animals or a bunch of crazy serial killers when STARS loss contacted with the first team they go into the wood to find out what’s going on. From there the book takes on this cool creepy feel the team land in the wood by helicopter only to be attacked by strange dogs that seemed to have been skinned and mad into monsters that are hunger and will hunt anything that moves. It’s not long before the team are in a creepy mansion that’s owned by umbrella (which was meant to be closed up and unused big fat lie). Now stuck in this house they must find another safe way out but the house is like a massive puzzle someone in the team is a traitor. Zombies walk the halls but trust me when i say there are a lot worse waiting for them. I simply loved the book and if you are a fan of zombies you will love this book. Its action pack with guns fighting and puzzles you are dying to see what happens next and most of all you get new shocks around every corner. It’s brilliant you also start to like some characters more than others and before long you have fallen into this amazing book and you need to get to the end. I loved everything about the book so I give the book 5 stars"}, {"userName": "Kimberley doruyter", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/23952659-kimberley-doruyter", "userReview": "this had more freaky and weird things in it then the movie and i don't know if i'm happy about that;)"}, {"userName": "Efrain", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/58621383-efrain", "userReview": "The book was very true to the game and was well paced. There was an expectation of the reader understanding why certain things happened, like oddly mentioning a typewriter and at times randomly saying copious amounts of ammo was found (the only way to understand is if you played the games). This aside, I did not rate this book any higher because the book failed to capture any sense of horror. I would venture to guess that fans of the series will enjoy this book more than the average reader."}, {"userName": "Anabella Córdoba", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/63427333-anabella-c-rdoba", "userReview": "3.5 No se me hace nada parecida a las pelis y espero que deje un poco el rollo de la mansión"}, {"userName": "Cate (The Professional Fangirl)", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/2906183-cate-the-professional-fangirl", "userReview": "This is a \nReading Good Books\n review.It’s Halloween month and the zombies are out to get you!Zombie fiction at least. This horror subgenre has experienced a surge in popularity in the recent years. From the countless zombie movies and the hit show The Walking Dead, it became so popular that it has its own shelf at Barnes & Noble, just like vampire fiction.But zombie fiction is far from being a “new” genre. From Mary Shelley (Frankenstein, you know, raising the dead), to HP Lovecraft, to the modern zombie portrayals by George A. Romero, zombies have been scaring people for a very long time. Even the thought of a decaying undead being out to eat your brains is scary enough. The survival horror genre in video games exemplifies that terror.The Resident Evil franchise has a huge following. In fact, if you ask me what is the first thing that enters my mind when I hear the word “zombie”, it’s this game. (Not movie. Please, the live action movie is a joke. Stick with the animated films, Degeneration and Damnation.) Although I prefer Silent Hill more, RE is not far behind. I remember my dad and I playing these games, he was on the controls and I help him solve the puzzles. Through the years, I followed the adventures of Jill Valentine, Chris and Claire Redfield, Leon S. Kennedy, Ada Wong, Barry Burton, Albert Wesker, etc.The Umbrella Conspiracy is the first in a series of video game novelizations. It follows the first game with the STARS team at the Spencer Mansion. In the game, the POVs are split between the Jill scenario and Chris scenario. In the book, the POV switches amongst the characters but it still follows the general storyline of the game. It is very interesting how they managed to get more handgun ammo as they explored the mansion. I also liked how the reading of the random journals and files were portrayed. The story steadily moves forward through the eyes of the characters and it was very easy to follow. I love that the key puzzles were featured although not explained in length. Hey, this is not a walkthough, you know.After reading this, I never thought that the story itself was a bit short. Playing it seems longer with all the puzzles and zombie dodging and shooting, and all that scary stuff. The book was not as scary as the game but it’s nice to read what the characters were thinking of while in that situation. Where was Wesker when Jill and Chris were off solving puzzles? What’s up with Rebecca? But the author started some possible subplots early in the book only to abandon those storylines in the end in favor of game canon.You don’t have to have played the game to appreciate this book. However, it adds to the enjoyment if you are familiar with it. There are little gems included in the book that an RE gamer would like. A “Jill sandwich”, anyone?Rating: 3/5.Recommendation: It’s an easy train read. If you’re familiar with the games, you might like it. If you’re a fan of the games, you’ll love that they included that one line from Barry that made the game awesome."}, {"userName": "Roxane", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/21271799-roxane", "userReview": "Je n'ai jamais joué au premier Resident Evil, sur lequel le jeu est basé. Cependant, j'ai vu tous les films et je vous assure que cela n'a rien à voir. Mais ce livre m'a vraiment beaucoup plu.L'histoire se déroule à Raccoon City, où des meurtres sont commis par des \"tueurs cannibales\", et après deux mois, l'unité d'élite des S.T.A.R.S. est appelée pour se charger de l'enquête. L'équipe Bravo est envoyée survoler la forêt de la ville, mais quelque chose semble s'être produit durant leurs recherches, puisque l’équipe Alpha perd le contact avec les Bravo. L'équipe Alpha va aller les secourir et essayer de trouver ce qui a bien pu se dérouler sur place.Les personnages sont bien entendu les mêmes que dans le jeu. On retrouve donc Chris, Jill, Barry et Wesker.Comme dit plus haut, je n'ai jamais joué au premier jeu, donc je ne connaissais que très peu les différents personnages, à part Chris, que j'ai croisé dans d'autres jeux de la franchise.Il y a un personnage auquel je me suis attachée, il s'agit de Barry Burton, dont j'ai beaucoup aimé l'humour, même si c'est plus visible au début du livre. Mais aussi un peu à cause de ce qui lui arrive au cours de l'histoire et de voir comment il allait gérer cela. Ensuite, peut-être que j'ai été influencée par le film \"Resident Evil Retribution\", dans lequel j'ai découvert le personnage de Barry que j'avais adoré, même si on n'apprend rien sur lui dans ce film, son personnage m'avais beaucoup plu et j'avais beaucoup aimé le choix de l'acteur.Puis, au contraire, je n'ai pas aimé le personnage de Wesker, mais j'ai bien aimé le détester. Je n'expliquerais pas en détail pourquoi c'est un personnage que je n'ai pas aimé, pour ne pas dire trop de choses sur le déroulement du livre. Au départ, je l'aimais bien, puis par la suite, j'ai commencé à moins l'apprécier, au fur et à mesure de ce qu'il faisait.Le rythme du livre est assez rapide, et ne donne pas le temps de s'ennuyer. Cela est dû à la narration à la troisième personne et au changement régulier de point de vue des personnages, ce qui fait que l'on suit chaque personnage tout au long de l'avancement de l'histoire avec en plus quelques petites incursions dans leurs pensées.L'écriture (via la traduction), n'est pas exceptionnelle, mais ça se lit très vite. J'avais beaucoup de mal à reposer le livre.Pour ce qui est de la fidélité avec le jeu et les événements qui s'y déroulent, je laisserais les fans du premier jeu vidéo en parler, puisque je n'y ai pas joué. J'ai préféré lire le livre avant de me lancer dans le remake HD du premier jeu. Donc, lorsque j'aurais terminé d'y jouer, je ferais peut-être un petit article en complément de celui-ci, pour faire une rapide comparaison entre les deux.Finalement, c'est une bonne surprise, étant donné qu'au départ, je ne m'attendais pas à aimer autant ce livre. Les personnages m'ont plu et j'ai aimé les découvrir un peu plus.C'est donc sans surprises que je commence de ce pas la lecture du tome 2."}, {"userName": "Mac Dubista Keso The Bibliobibuli v(=∩_∩=)", "userReviewDate": "Feb 27, 2015", "userURL": "http://www.goodreads.com/user/show/39880206-mac-dubista-keso-the-bibliobibuli-v", "userReview": "One of my favorites!A great telling of the original video game.This book is awesome!! A must for Resident Evil fans! ^_^ +At first I was suspicious of a novelized version of the Resident Evil video game. The game's story line was a little cheesy in the first place.+The Umbrella Conspiracy tells the tale of the original Resident Evil video game. In case your not a fan of the series, Raccoon City has a little, teansy, weansy problem - people go missing for days after venturing into the hills, and when they're found, it isn't a pretty site. Victims....are apparently eaten. Finally, Police Chief Irons decides to send in the cavalry - S.T.A.R.S. (Special Tactics and Rescue Squad). But failure seems to surround the entire mission... Minutes after the Bravo team is launched, a distress signal is received from their helicopter.+Taking matters into his own hands, Albert Wesker, the Alpha team leader, takes his own assembled men into the action. As the story continues on, you slowly begin to learn the personalities/backgrounds of the team members, such as -Jill Valentine - an ex-thief, she is a master of picking locks. (And she is my favorite character here)Chris Redfield - an excellent marksman that seems very attached to his comrades. (my second favorite here, LOL )Barry Burton - a family man, he prefers a Colt .45 in combat.+Fans of the first game will be pleased to find that this book is a near perfect re-telling of the storyline in the first Resident Evil video game.I thought it was simply amazing that Perry managed to tie the crew in so well. Everything is in the game. Whether you play it before or after reading this book, it will still leave a lasting impression.+Perry's storytelling adds nearly the same degree of suspense that the game featured. and her character development of the characters actually makes the reader care about what happens to them; something the game didn't do. Ms.Perry has created a masterpiece! One of a kind riveting story! Reading this is like your in the actual game! Which is super awesome! I'm a BIG fan of the video game itself, from Resident Evil 1, Nemesis to Veronica Virus and so fourth. I guess since 1998? By Play station 1 Capcom!+Yayy!!! I really loved the way Ms. Perry write this book. I feel Nostalgic by reading this. This book handles the action and the plot well, it also describes each persons perspective of the adventure very well. If you've played the game and loved it, this book is a must along with the rest of the series. Highly Recommended! Finally reading the book 2. :)"}, {"userName": "chucklesthescot", "userReviewDate": "Sep 19, 2015", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "A series of brutal murders in the woods around Raccoon City has everyone on edge and the STARS teams are being assembled to go and investigate. Bravo Team go in first but send out a distress call about damage to the helicopter and Alpha are quickly sent to follow. On landing, Alpha find the damaged helo, a missing team, the remains of a man and crazed killer dogs. With the dogs in pursuit, Alpha take refuge in the mysterious mansion which turns out to be a strange maze like structure with zombies and other traps behind the doors.This is part of a series of seven books that are based on the Resident Evil console games following characters like Chris Redfield, Jill Valentine and Rebecca Chambers. I liked the start of the book where the characters are preparing to go on the mission and the following scenes where Alpha land and have to run from the dogs and get into the mansion. However it was after that where I started to struggle with the story. I found it hard to get a mental picture of the mansion in my head because of the strange layout of the place. When we switched between characters I found it impossible to work out where everyone was in relation to each other. Confusing! I think the problem is that I haven't seen or played the ccomputer game so I find it hard to work out what I should be seeing. It got even harder as the book went along when the characters went into the garden area and went on different adventures. There are a lot more things than zombies in this book to be afraid of. There are snakes, spiders, killer plants and a range of mutated monsters as the book progresses. That side of it is entertaining but I found the conspiracy subplot a bit less interesting, though that is just personal taste really. The way the book is written made it hard for me to get into as a zombie read. I think the focus was more on the conspiracy than the actual zombies at times.Overall, this book didn't really do it for me. I much preferred the novels based on the films. The other issue I have is that there is no consistency in the story through these books. In this book, a member of Bravo escapes with a couple of Alpha members. That is how the book ends. In book 7, we are given Bravo's story...which has a totally different ending with no Alpha team involvement. That just doesn't sit right with me at all if these two books cover the same night, same event but have two different conclusions? That seems barmy to me!I did finish the book but I wouldn't want to read the other books to be honest. 2.5 stars."}, {"userName": "Ajeje Brazov", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/70535152-ajeje-brazov", "userReview": "Dal videogioco ad un racconto....per me riuscito abbastanza bene, aiuta a capire molto meglio ciò che si è vissuto col joypad in mano. Il videogioco mitico, il libro bello."}, {"userName": "Sunny Michelle", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/5579904-sunny-michelle", "userReview": "I read this book because of my love for the RE series (particularly Wesker, and it seemed some personality traits that Perry gave Wesker were very out of character) but I would have been better off just watching a \"Let's play RE\" on Youtube. Anyone else who hasn't played the first game (like me) and wanted to read this to find out what happened - don't. This novelization was truly terrible. Perry would be better suited to writing a Wikipedia article instead of a proper novelization. What earned it's 1 star? For me, the gore, the story, the characters. Two of the three didn't originally belong to Perry, but at times the characters were done justice. We have their backgrounds - Air Force, ex-thief, family man, etc, and their personalities are clear. You see different sections of the story through each person's unique spin. That's about all it has going for it. The language the author used was \"telling, not showing\" and it was told in the most unexciting ways. There were repetitive, boring actions and the only things explained in depth were the rooms in the mansion (and the gore) but after the first few rooms, I began skipping those descriptions because, again, it wasn't portrayed as a magnificent place aside from Jill saying, \"Wow, this is magnificent.\" And the thing that gave me near physical pain was when Chris was thinking that it wasn't a game you could redo after hitting the reset button. What the hell was that? Every 13 year old girl that has published anything on fanfiction.net knows NOT to put something that cheesy in the story. That line alone made me lose a considerable amount of respect for the author. Some scenes that should have been suspenseful weren't at all. Wesker admitting he's a spy and threatening Barry's family was very anticlimactic and a complete failure except for the humorous buildup. Everyone's self-flagellation made sense, but got old fast. Once was enough, but that dominated a good 15% of each character's sections and after a certain point, you're just reading the same damn thing you JUST read in the last person's section. Do I regret reading it? No. Not at all. I needed a reminder of what NOT to do when I write."}, {"userName": "Red Heaven", "userReviewDate": "Nov 27, 2011", "userURL": "http://www.goodreads.com/user/show/6676314-red-heaven", "userReview": "I am not a huge Resident Evil fan, having struggled through a third or so of the original game, but I have seen all the movies, and came to this book expecting a fun, exciting novelization of the game. It really didn't pan out that way.The characters are very broadly sketched, and development - if you care about such things - is virtually non-existent. The main plot follows the game too faithfully - you are basically reading a walkthrough of virtually every room. Zombies are dispatched with little fanfare. After a while, this is repetitive and also hard to follow as multiple characters take multiple routes through the mansion and into the basement levels below. They go left, they go right, they open this door, they open that door... I could not even grasp the layout of the grounds from the confusing description that was given.Depressingly, as the creatures get bigger and harder to deal with, the action scenes get weaker. Again, most are dispatched very easily, and unsatisfyingly. The descriptions of these creatures is very basic and not very creative.The book also suffers from a very basic, tepid writing style. It's neat, efficient, but so lackluster that it creates no spark of interest. It's hard to feel anything about what you are reading. I really get the feeling that, whatever her credentials from other writing projects, Perry is not the right author for this kind of book."}, {"userName": "Nicole Sanglay", "userReviewDate": "Oct 16, 2012", "userURL": "http://www.goodreads.com/user/show/5040065-nicole-sanglay", "userReview": "It was nice how it was easy to imagine the game while reading this book. It truly was reminiscent of several Resident Evil games even though there were a few elements added to the story to make it more suitable for fiction.I loved it, but I noticed something that I could still be improved. The suspense scenes where (for me) the characters are supposed to be playing a game of tag with danger did not live up to what I expected. I mean, whenever I expect the scene to be nail-biting because of the suspense, the tension just suddenly evaporates because the writer does not let the reader to be fully ready for what's going to happen. I don't know if I'm making much sense here, but in short, I was hoping that the writer would pull the tension like a rubber band until it cannot be extended anymore, and the rubber band just recoils back to its original shape--that is, the tension just recoils back to the reader. That would definitely be more climactic, especially in the scene where they face the \"final boss.\"Nevertheless, this book got me obsessed with zombies again. It was entertaining. I loved the pacing and the additional backstory that the writer gave to the characters (because most of the characters were also in the games). The characters were also very likable and kind of easy to relate to. I'm so excited to read the next book!"}, {"userName": "Matimate", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/198595-matimate", "userReview": "Welcome to Zombieland of bad literature, where good game was source of game like books packed with action and gore. So how should I begin? There was a special team of tough guys and ladies who went in to the woods,where strange things dwell, things which ate people. They discovered mansion and hell broke loose. S.T.A.R.S were nicely surprised that Umbrella corporation had something more then beauty and health-care products. What did commando know about virology? Nothing, but Umbrella personnel gave them quick zombie like lecture. Knowledge bites and team. This book was intended to be read after book Zero Hour from Resident Evil series. While Zero hour was told from the view of Alpha team, Conspiracy is told from the side of Beta team. Not good, one would say one soup was reheated with so many mistakes, that one could get diarrhea from it. For example Rebecca, the ultimate zombie and monster killer, was behaving like brainwashed and did not recognize those pest she was used to happily slashing in Zero hour. Weskers changed his designation so often that it hurts. Basically it was intended to company the game. I liked the Resident Evil games, but books had to tell."}, {"userName": "Courtney Key", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/35556235-courtney-key", "userReview": "Another fun read in the Resident Evil series. For those who have never played the original game on Playstation 1, this book has a completely different experience play out. In sticking to the first game, Jill, Chris, Rebecca, Barry, and Wesker make their way through the Spencer mansion. Fighting their way through mutant dogs, spiders, snakes, and zombies along with completing ridiculously complicated puzzles, the S.T.A.R.S. team persevere against insurmountable odds. I had a blast from the past just reading this book. It followed the layout so I knew exactly what would befall our wayward heroes at every turn, yet it didn't take away from the experience one bit. For those readers who are new to the series and reading them in order starting with Zero Hour, there are a lot of things that won't match up. This book was written in 1998, six years before Resident Evil: Zero came onto the scene. A lot of the scenes involving Rebecca will have to be taken with a grain of salt. With all that said, I'm sure horror fans and video game fans alike will enjoy this book."}, {"userName": "John Bonilla", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/39425173-john-bonilla", "userReview": "Que final!!! Con un misilazo en el amanecer. Aunque toda la saga acaba así.En una parte si confunde por tanta descripción de la mansión, como que hizo falta un mapa o solo se capta si juegas el juego antes de leer el libro, porque prácticamente es una guía de como pasar los acertijos.Lo que más gracia da es la parte de Wesker, Joputa, se iba a dormir mientras los otros sufriendo ataques de zombies.Hasta estuvo mejor que la novela de S. King., me atrapó mucha más, tal vez por que me gusta más la saga, pero la acción que contiene es muy enajenante.Al menos con la novela complementas lo que se sabe de la historia de Resident Evil, ya que sabes lo que piensan los personas y como chantajean al pobre Burton, sigo diciendo, Joputa de Wesker, ese si era un miserable.También algo que me decepciona algo de la saga es que el jefe final nunca dura mucho aunque sea la mayor amenaza.Lo más gracioso del libro fue cuando entran en la mansión y describen el vestíbulo y mencionan la máquina de escribir, me quede de... y van a guardar la partida??? jajajaja"}, {"userName": "Naomi", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/30720038-naomi", "userReview": "Maratón Guadalupe-Reinas Reto#8: Lee un libro de fantasía o ciencia ficciónCreo que es más terror/ciencia ficción, pero... esta bienLe voy a dar crédito a la autora por adentrarse a narrar una historia cuando no tenía idea sobre el rumbo que tomaría la misma, y he ahí las incoherencias con las partes posteriores.Me agrada que tengamos las historias de Jill y Chris de forma simultanea (en el juego disfrutas de una u otra, obviamente), es triste saber que Chris ya fue declarado el protagonista de la saga por CAPCOM y en este libro se lleva la parte más aburrida de la historia. Las cosas trascendentales para la trama les pasan a Jill y a Barry.No me gusta el Wesker de los libros, sin embargo me gustó como manejó la relación de Rebecca con Chris.En pocas palabras, es entretenida y ya. No te aporta nada nuevo a lo ya visto en los juegos y no es recomendable que te adentres a los libros sin antecedentes ya que para entregas posteriores comenzaras a notar agujeros en la trama."}, {"userName": "Shyma", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/6388122-shyma", "userReview": "This is a story of a group of rescuers will go through shocking incidents to make Jill, Chris and the rest of the Alpha team switch their mission from rescuing their fellow police officers from Bravo Team to a mission of survival. A man named Trent who seem to give them directions at the beginning of the story is still anonymous; it's not known on which side he is. The book is not a typical zombie apocalypse book, it gets more complicated with time and new discoveries in the mansion in Raccoon City, where the story takes place, especially with the fact that there is a traitor among them.The language is easy and helpful for better understanding. Since it is based on a game, the language can be graphical at some points, which is helpful to create an image in the reader's mind as if he/she were playing the game."}, {"userName": "Scott", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/6948799-scott", "userReview": "Its a game I loved playing and this novel based very closely on the video game totally kicks ass. Maybe it’s because I am such a fan anyway and it made me biased but I really enjoyed reading this book. Sort of fills in the blanks and takes the story from a vision of all the characters. Its only short falling is that it is not longer. I felt it started off with a great steady pace looking into the characters a little more taking its time building the creepy suspension but then then rushed over the last part with a feeing that the author has reached the word limit allowed and was cramming it all in. Still it doesn’t take anything away from the story, as a whole you are getting what you expect. In the end if you are reading this it is because you want to read it and I doubt you will be disappointed. Nostalgic creepy suspense horror. Lovely !"}], "description": "Raccoon City: a remote mountain community suddenly besieged by a rash of grisly murders encroaching upon it from the surrounding forest. Bizarre reports start to spread, describing attacks from vicious creatures, some human... some not. Victims are apparently eaten.At the epicenter of these deaths is a dark, secluded mansion belonging to the mysterious Umbrella Corporation. For years umbrella has labored within the mansion, unwatched, ostensibly conducting benign genetic research.Deployed to investigate the strange goings-on is the Special Tactics and Rescue Squad (S.T.A.R.S.), an unusual paramilitary response unit boasting an eclectic assortment of mission specialists: roguish Chris Redfield, former cat burglar Jill Valentine, dead-eye Barry Burton, and the enigmatic team leader, Albert Wesker. Together with the other S.T.A.R.S. operatives, they have a good reason to believe they're ready for anything.But what unfolds as the S.T.A.R.S. penetrate the mansion's long-locked doors is terror beyond their worst nightmares: creatures that defy the laws of life and death—the result of forbidden experiments gone disastrously wrong. Behind it all is a conspiracy so vast in its scope and so insidious in its agenda that the S.T.A.R.S. will be betrayed from within to ensure that the world never learns Umbrella's secret. And if any survive... they may well come to envy those who did not.", "title": "The Umbrella Conspiracy\n      \n          (Resident Evil #1)", "url": "http://www.goodreads.com/book/show/221267.The_Umbrella_Conspiracy", "average": 3.93, "cover": "https://images.gr-assets.com/books/1436735368l/221267.jpg", "reviews": 297, "authors": [{"url": "https://www.goodreads.com/author/show/52051.S_D_Perry", "name": "S.D. Perry"}], "type": ["Horror", "Horror", "Science Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/221267.The_Umbrella_Conspiracy", "http://www.goodreads.com/book/show/25544245-la-conspiraci-n-umbrella", "http://www.goodreads.com/book/show/13642250-resident-evil", "http://www.goodreads.com/book/show/6396205-la-conspiraci-n-umbrella", "http://www.goodreads.com/book/show/23854211-la-conspiration-d-umbrella", "http://www.goodreads.com/book/show/14287960-tyrant-il-distruttore", "http://www.goodreads.com/book/show/90578.City_of_the_Dead", "http://www.goodreads.com/book/show/221269.Caliban_Cove", "http://www.goodreads.com/book/show/870819.Nemesis", "http://www.goodreads.com/book/show/221268.Underworld", "http://www.goodreads.com/book/show/221271.Code", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}