{"ratings": 14236, "userreviews": [{"userName": "Donna {Book Passion for Life}", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/3024878-donna-book-passion-for-life", "userReview": "“Forever,” he said his breath shaky. \"It means we're bonded together forever.\"\nAs you all know, I loved the first book 'The Fallen Star' in this series and I was left wondering if this book 'The Underworld' would be as good. Well, we all know second books in a series tend to.......ermm what's the word I'm looking for.....ah fall short? Now the question you should be asking me is \"Did The Underworld fall short?\" and my answer will be.................HELL NO! It totally rocked! After the massive cliff-hanger in The Fallen Star, Stephan tried to wipe Gemma's memory but for some reason it doesn't work, she doesn't know who to trust or who to believe, all she knows is that she needs to find her mother and she will do anything to get her back. Needing to find out what Stephan's plan is Gemma, Alex & Laylan head on a mission to bring Gemma's mother back from the one place no-one escapes from……..The Underworld. The Underworld was such a quick read for me because I was so interested in the plot; I finished it in a matter of days. If you couldn't tell already I loved this book just as much as the first. From the first page I was instantly drawn back into the world that Jessica has created and I spent most of the book on edge of my seat because you honestly can't even guess where the story is going to go. It’s got twists and turns that leave you breathless, a romance that you will leave you begging for more and loveable characters that will keep you entertained all the way through. One thing I love about this book is the different mix of mythical creatures that are included. Not only are there Vampire, Witches and Fae but you also have Foreseers and the Keepers. I believe I mentioned this in my review for ‘The Fallen Star’ but the Foreseers world is truly amazing. It’s a completely new topic for me and I find myself captivated in their world and I'm intrigued to know more. Not only do the Foreseers amaze me but the general storyline of the book is completely unique and Jessica has definitely got the the gift for creating amazing stories.Our characters are well developed and a complete joy to read about. Gemma is my favourite. With everything she has been through, she strong minded, determined and not afraid to take things head on. Alex is 100% swoon worthy and a total pain in the bum but you can't help love him. He's very stubborn and doesn't show his emotions often but when he does......wow.......yeah like I said......swoon worthy. Now both characters together, I honestly really want to bang there heads together. Sparkles fly when there together and it’s obvious they like each other but the author sure does know how to keep the suspense of their relationship alive in these stories. I was literally sitting on the edge of my seat, praying for something to happen and I can't wait to see what happens next. Overall, this series is fast becoming one of my favourite series. I'm left now dying to know more about the next book in the series. If you haven't read the first book in this series, then I totally recommend it because you are missing out on a great story!!!Thank you to Jessica Sorensen for giving me the opportunity to review this book."}, {"userName": "Michelle's Paranormal Vault of Books", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/8875051-michelle-s-paranormal-vault-of-books", "userReview": "Starts out where the shocking cliffhanger of the The Fallen Star left off. Things have changed drastically. Gemma has now become determined to rescue her mother no matter what. Even going to the Underworld to do it.This book is a great follow-up to the first one. I was on the edge of my seat for the whole book. I didn't get much work done, as I could not stop reading it, and read late into the night. I finished in 2 days as I HAD to find out what was going to happen next. Jessica is a master at creating a very believable yet unique world.One thing I love about this book is the different mix of mythical creatures that are included. Not only are there Vampire, Witches and Fae but you also have Foreseers and the Keepers. So its not the same type you see out there, this whole series is one of a kind really.I fell in love with Alex even more (I know, that sounds ridiculous, but it's true). I loved that it was more obvious that he had true strong feelings for Gemma and at how jealous he would get.I highly recommend this book. I recommend the WHLOE series so far. AMAZING!! Great job Jessica! Jessica Sorensen is one of my favorite authors, be sure to read The Fallen Star first!See my blog for more reviews, and other extras http://concisebookreviewsbymichelle.b..."}, {"userName": "Joy", "userReviewDate": "Oct 11, 2011", "userURL": "http://www.goodreads.com/user/show/3527169-joy", "userReview": "This book continues the story of Gemma, the teenager with the power of a fallen star within her, and her sometimes companions Alex, Aislin, and Laylen as they work to save the world from evil. Unfortunately, many of the problems which plagued the first book continue in this one, specifically the need for a good editor (it was \"your problem\" not \"you're problem\"). There were fewer new concepts in this novel than in the first, and those were mostly extensions of what was revealed then, which left the story moving forward slowly and without any new momentum. Situations happen over and over again, especially \"Gemma going off alone and being kidnapped\" without the characters ever learning from them, and something called the \"Cruciatus Diamond\" shows up which is far too blatant a steal from Harry Potter for my liking. The scenes set in the Underworld had promise, but were left superficial without the depth that they could have had. Overall, I have many of the same conclusions from the first book - a good overall story idea, characters that have promise, a few brilliant ideas, but all ultimately fail due to the amateur writing and poor editing of the books. I think that these three books (third not published as of now) would make an incredibly brilliant novel if combined and edited strongly with an eye to improving the depth of the story."}, {"userName": "Rebecca McKinnon", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/1667189-rebecca-mckinnon", "userReview": "After reading the first book in this series, I decided to go ahead and read the next one. Surprise, surprise, I liked #2 better than #1--which, if you know me, you know that's surprising.I didn't realize just how much I liked this until I got to the end and realized the next one isn't out yet. Yes, I got grumpy really fast.The main character, Gemma, did kind of rub me wrong (but not as much as in the first book). However, even if you have a hard time with her, keep reading! It's so worth your time, even if it's just to get to know Laylen. Yes, I know I very frequently refuse to read books with vampires because I'm tired of them, but Laylen is a fantastic character. I'd love a book about him--could we arrange that, please? In a small way he reminds me of Lupin (the one in Harry Potter, of course). If I can't get a book about him, um, could Gemma please fall in love with him?Until I found myself upset that I couldn't read the next book right away, I would have given this a 4. However, after realizing just how involved in the story I was it had to go higher."}, {"userName": "Nathalie*", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/15545359-nathalie", "userReview": "Good characters good story line lots of adventure.. Just wis I could read faster lol"}, {"userName": "Heather B (Owlnestly Reviews)", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/11679252-heather-b-owlnestly-reviews", "userReview": "Owlnestly Reviewshttp://owlnestlyreviews.blogspot.comI don't normally review series as a whole, or the whole series, but this one I just had to. This author is a genius, literally a genius. One word to sum up my thoughts for this series is: OBSESSED. I read all four of these books in four days, they were that good. At first I thought the series was going to be a bit cheesy, with the end of the world bit and all, but instead I ending up loving it. There were so many new concepts put into play like tattoos for different beings (foreseers, keepers, vampires, witches, immortals, etc.) I found myself overwhelmed at first, but Sorensen explained everything so perfectly that I fell into the world of Gemma. Gemma is one of those characters that grow on you. I found her a tad starnge at first because she said that she lived without emotions for her whole life. I wanted to just say \"Hold up, how is that even possible?\" but I found myself becoming very attached to Gemma and her fate. I did find myself becoming frustrated at her when she just kind of swooned over the jerk that was mean to her in the beginning, but throughout the series she became the kind of heroine that I love to see succeed. I wish that I had as much spunk and bravery that she does by the end of the series. Alex is another character that I found myself loving, despite his jerk able characteristics. I hated when he was a jerk to Gemma, but I understood everything and his actions as the story panned out. Laylen was another character that I wish I knew in real life. He was just a lost soul, but he was such a sweetheart. The story itself is full of twists and turns that will leave you begging for me. I never got bored reading, and that is saying something since I do have a hint of ADD. I blazed through these books, as I am sure you will when you check this series out. I am so overwhelmed with obsession with these books and this author that I even have to use a gif, which I NEVER do. So here you go:"}, {"userName": "MiMi", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/17314538-mimi", "userReview": "So I read the first book. And it was just ok but I decided to see if the series gets any better. Oh Gemma/Jessica SorensenI thought it would get better however it got worse.This is how Gemma was:She trusted the wrong people, yelled at her friends, and complained about her life all the time. I was like:Then Aiden tries desperately to be nice:But noooo Gemma reacts like thisAnd Gemma ultimately decides to go on a selfish quest instead of saving the world. THIS IS JUST THE FIRST TWENTY PAGES IF THE BOOK.I couldn't take it any more. Sorensen had a great concept it was just executed poorly.I did not enjoy this at all."}, {"userName": "Secretly Adorkable Readers", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/1441792-secretly-adorkable-readers", "userReview": "Read from 03/24/13 thru 03/28/13 all 6 books that has been released so far (The Fallen Star Series 1-4) *1 The Fallen Star, *2 The Underworld, *3 The Vision, *4 The Promise and then the continuation or spin off of the fallen star series goes into Fallen Souls *1 The Lost Soul. Then Shatter Promised Series- *1 The Shatter Promised Adult version of the Fallen Star Series where Gemma is 21 and Alex is 23 with a different twist.I started reading this books a few days ago and just kept reading each book one after another and couldnt get enough of this Paranormal series. I read it in order to avoid any chaotic confusion. I cannot wait for the last book of The Lost Soul Series and 2 more books on the Shattered Promise series. I love all the characters which include Gemma, Alex, Laylen, Ainsley, Nicholas, a lot of witches, feys, banshees, black angels, vampires, foreseers, etc. There is so much humor through out plus action, romance, kidnapping, supernatural powers, did I mention each book with a tremendous cliffhanger.....hope you enjoy!!"}, {"userName": "Natasha", "userReviewDate": "Jul 02, 2011", "userURL": "http://www.goodreads.com/user/show/4595308-natasha", "userReview": "The Underworld is the 2nd book in the \"Fallen Star\" series by Jessica Sorensen. I must congratulate Jessica on such a wonderful follow up book for \"The Fallen Star\". I found that I really loved reading \"The Underworld\" and getting to know more about the characters that I fell in love with and loved to hate from the first book.I must say that I was surprised that there was never a dull moment for me while I read \"The Underworld\". Gemma's story was full of action and many twists and turns, that would keep any book reader glued to the pages right from the beginning of the book to the very end of the book. I still found that I disliked Gemma's and Alex's relationship. I have high hopes that maybe Gemma will see Laylen as more than just a friend in the next book. Which I hope to read the next book very soon but as of yet there is no book title for the third installment to the Fallen Star Series but it is set to be released sometime around November 2011. I Give \"The Underworld (Fallen Star #2) by Jessica Sorensen\" 5 Stars and recommend you read this series."}, {"userName": "Kim", "userReviewDate": "Jun 24, 2012", "userURL": "http://www.goodreads.com/user/show/3467154-kim", "userReview": "Luckily I was armed with The Underworld before I finished Fallen Star with it's huge cliffhanger. Once again, the author delivers with more unique action and suspense. For a second installment, I appreciated that there wasn't as much background rehashing as I see with many series books. The negative in that is that you do have to start at the beginning but I never read series books out of order anyway. The author just continues to add on more intrigue to the story. It's interesting because the writing is so simplistic yet the story itself is not at all simple. This is simply good old fashioned storytelling without all of the 'extras' of poetic prose. It's very straightforward and easy to read.I did feel that The Underworld was a little 'messier' than The Fallen Star. There were far more of those DREADED grammatical errors. This was still much better than other Indie ebooks I've read, but I still make a case of it because to me, there shouldn't even BE a case. If you are to put your heart and soul into a work with your name on it, WHY would you hand out anything less than perfect? I can never understand this and yet....The end of The Underworld felt a tiny bit rushed. A LOT went into the final few chapters which I felt could have been extended quite easily.I will be moving on to The Vision at a later time. The end of Underworld didn't have such a high dose of cliffhanger, but I still will definitely want to follow up to get the answers to the rest of the story.As I stated in my review for Fallen Star, this is a great bargain for .99 each! Honestly, I don't think I've ever read anything this enjoyable ever for that kind of $. Well worth it, deserving of a try!"}, {"userName": "Tiana Dalichov", "userReviewDate": "Aug 18, 2012", "userURL": "http://www.goodreads.com/user/show/7215892-tiana-dalichov", "userReview": "I have two words for you guys. Holy. Crap.When I read The Fallen Star, I thought: \"Okay, cool. This is a neat concept and it has tons of potential.\" But to use that potential so well? Wow! The Underworld was an awesome journey that I finished in one day, which only happens when I literally canNOT put a book down. I am falling deeper and deeper in love with Alex and Laylen, and I find them to be such rich, awesome characters. Alex in particular. He's so mysterious, and his relationship with Gemma just keeps getting more and more heated, intense, and complicated. Gosh, I hope they make it! *Girlish squeal*The plot was just as fast-paced as the first one, which I liked. I don't like slow, boring scenes that don't really do much for the plot. But Sorensen's suspense kept me thirsting for more information.As with the first book, Gemma and her stupidity kind of make me angry, but she's a teenager, so it's understandable. She gets herself into tons of situations with Nicholas that could TOTALLY be avoided, but what're ya gonna do, right? *Sigh* A few grammar mistakes here and there, but that doesn't really bother me like it does with some people.Diving into book 3 tonight since I can't wait to find out what happens next! I have been reeled in, Sorensen! Now let's just hope I enjoy the ride :)"}, {"userName": "Emily Steele", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/24452056-emily-steele", "userReview": "The second segment of the Fallen Star series started with a bang. The story begins soon after Gemma supposedly gets her mind erased by Stephan, the main psychotic protagonist. She is left by a series of questions, the main questions being why is she alive and why can she still feel emotions. Gemma must find her mom in order to find out what is going on, but she is unable to trust any of her \"friends\" due to their previous part in Gemma's near demise. However, she must learn to trust again given the fact that she is new everything that goes bump in the night and frankly, she has no idea what she is doing. I do believe that this is a good book for what it was written for which was more along the lines of a few kids taking on the world together rather than a more monster based novel."}, {"userName": "Mahz", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/8659373-mahz", "userReview": "I'm speachless!This book was...I dont know—amazing, brilliant And bloody fantastic!Wow I couldn't get enough of this book—the characters and the plot were impressiveWhen I turned to the last page–my hate for Stephan grew, love for Alex and Gemma grew and I couldnt freaking wait till I read the third book of the fallen star series, the vision:)"}, {"userName": "Sam", "userReviewDate": "Dec 20, 2012", "userURL": "http://www.goodreads.com/user/show/9889840-sam", "userReview": "This book left me frustrated because I can't read the next one. To be honest, that revelation about Alex and Gemma at the end sucked ass."}, {"userName": "Shari", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/5177547-shari", "userReview": "4.5 stars....Where to begin... I was flipping through my kindle recommendations on Amazon and did a little happy dance right there in my office chair when I saw that the 2nd book in the Fallen Star series had been released - Underworld. I thought back to how much I enjoyed Fallen Star and couldn't wait to dive back into the world of Gemma and Alex and find out where their journey would lead. Their story takes off at a run, right where Fallen Star ends...with it's \"O-M-G did he do it?\" cliff-hanger of the mind-wipe attempt on Gemma by Stephan, and it keeps on running through fast paced adventure all the way to another O-M-G ending! Since I only finished the book a few minutes ago and I'm still in that euphoria of a good book, I'll pause here, dance my feet on the floor a little and just say \"AHHHHHHHHHHHHHHHHHHH\" :) I love getting lost in a really good book! And that kiss...right at the end... hold on a second I need another \"ahhhhhhhhhhhhh!!!\" :D A 2nd book in a series always runs the risk of repetition or lack of excitement, but Underworld held neither. Aside from mentally grumbling over how little time Gemma and Alex actually spend together (and esp not bickering when they were together) I think I enjoyed this book even more than the first. Getting to know Laylen better was a treat in itself...but now I'm hopelessly torn between Alex, who is delicious and destined for Gemma with so much history, electricity and connection between them; and adorable, sweet Laylen who clearly has fallen in love with her. But, I'll get over the fact that a possible love triangle has been introduced simply because I adore both prospects. There were a few moments where Gemma was discovering bits and pieces of her past that had me completely absorbed into her (new found) emotions. Ms Sorenson certainly has a gift at writing emotion so clear that the reader feels every moment as the character experiences it. So much so that when I read the part of her and Alex together just before Stephan detaches her soul and takes her away, I got a little misty eyed at the innocence of two sweet little friends so deeply attached to one another. *sigh* such a sweet moment and it gives you so much perspective into why Alex is the way he is. His life hasn't been a bed of roses either. So, while I'd love to gush about every morsel of goodness this book has to provide, I can't share much more with out divulging too many spoilers and too much goodness that is for you, dear reader, to enjoy. I'll leave it here saying that this book is an excellent sequel to Fallen. It will whisk you away to a world that is magical, mystical with a hint of comforting familiarity. It's loveable characters and exciting, fast paced storyline will drop you deep into it's world and keep the pages turning."}, {"userName": "Carrie (Bears Read Too)", "userReviewDate": "Sep 02, 2011", "userURL": "http://www.goodreads.com/user/show/5824840-carrie-bears-read-too", "userReview": "I LOVE THIS SERIES! There are a few minor things that I could pick on but I'm not going to because I just love this story so much that it renders them pointless. The good out weighs the bad by a mile. My favourite character is not Gemma, which may surprise some... well the some who like her. I like her okay and considering what she's going through she's doing pretty well in my opinion, but still my favourite character is Alex. He's dark and mysterious and as much as he doesn't show it, he's vulnerable too. I like the whole package. I like Laylen too but not as much as Alex.I do wish that we would see more of Aislin. Maybe in book 3. I think she can be a great secondary character if we could see more of her and what she's all about and more of what she can do.I cannot wait for book 3.I gotta say one more thing about the author. I've seen some reviews about her being an inexperienced author or other comments to that affect but I personally think that she really knows how to bring the \"interest\" factor. It's very hard for me to not read the next chapter. Her pacing I find fantastic and the plotting is just so good and the end of each chapter is so cliffy that you just have to turn that next page. I read a lot at night before I go to sleep and lights out these past few days while reading these two books was getting later and later. So for me... she really knows what she's doing. I think she's great and these books are great. I repeat... I cannot wait for book 3. November cannot come fast enough."}, {"userName": "Kristi", "userReviewDate": "May 20, 2014", "userURL": "http://www.goodreads.com/user/show/9365834-kristi", "userReview": "I really enjoyed this book!!! This is the 2nd book to The Fallen Star series. It explained alot more than the 1st one did. This story was very well written. It also became so intense at times I had to keep reading. Gemma overcomes so much with learning everything she did. Alex learns a few things as well. Which is kinda jaw dropping because my mind was like SERIOUSLY did that just happen. Laylen and Aislin learn something which Aislin deals with it alot better than Laylen. Then by the end they each learn more. Im like going crazy over here just trying to finish it. The cliffhanger was like jawdropping as well for me. I was wanting more by the end. I eventually said CRAP they cant end it like that. Yet she did and I need to start the 3rd book next. The underworld seems like a creepy place to be. Very torturous. Although I imagined it like Ursula's place as the Queen from The Little Mermaid. It describes it almost perfectly and kinda worked. This book gets mysterious vibe. Although it was kinda whiny at times. I liked it though. It was very enjoyable. I LOVED IT."}, {"userName": "Sara", "userReviewDate": "Sep 15, 2012", "userURL": "http://www.goodreads.com/user/show/6710971-sara", "userReview": "Gemma learns that her mom has been trapped in the Underworld since she was 4. She wants to save her with the help of Alex, Laylen and a Faerie/Foreseer Nicholas. Nicholas is a trickster and causes her trouble. As a Foreseer, Gemma should be undergoing her trainning in the City of Crystal. But Alex hasn’t let her s go since he needs to protect her. Alex breaks a rule and gets sent to the City of Crystal to pay his debt by getting his energy drained from him. While he’s there, Gemma is getting trained by Nicholas to control her visions through a crystal ball to get into the Underworld and save her mom. Nicholas never wanted to take her there and leaves with the Ira ball. Laylen helps Gemma get visions without a crystal ball, using new emotions. Gemma and Laylen save Alex and go on the run. Gemma and Alex go into the Underworld and save Gemma’s mom. Her mom holds many secrets about Stephan’s evil scheme. Nicholas captures Gemma while she’s looking for Laylen because he ran away. Stephan wants to keep her secluded from everyone else to keep the star’s power strong."}, {"userName": "Lorelie", "userReviewDate": "Oct 17, 2013", "userURL": "http://www.goodreads.com/user/show/12573250-lorelie", "userReview": "When I finished reading the first book of these series \n I was a little disappointed because there were points that I just don't understand the character. But being the kind of person who wants to finish every book she started I had no other choice but to read the next one. And I had to admit that this book was better than the first one. In this book, the author had introduced all the characters more better and she made it really exciting.  With Laylen and Alex,I am soooooooo falling inlove with them right now. Laylen and Gemma's relationship are getting even deeper than before. While with Alex their relationship has even gotten more mysterious. And seriously, I really have noooo idea YET if I'm on Team Laylen or Team Alex. Overall I find this book fascinating. I REALLY recommend this for all teens out there:))))"}, {"userName": "Cassandra", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/4439303-cassandra", "userReview": "Full, non-spoiler review courtesy at Book & Movie Dimension a BlogStarts out where the shocking cliffhanger of the Fallen Star left off. Things have changed drastically. Gemma has now become determined to rescue her mother no matter what. All while she comes around to trying to understand her emotions better. Alex too is trying to come to grips with how he feels for Gemma, if any. New truths are revealed of the mysterious Fallen Star's origins which can save the world or end it. Another very captivating volume in The Fallen Star Series."}, {"userName": "S C", "userReviewDate": "Sep 02, 2011", "userURL": "http://www.goodreads.com/user/show/6063068-s-c", "userReview": "Just reading the first two chapters I think I came across the word 'heck' about 50 times, sometimes twice in the same sentence! What is this author's obsession with the word 'heck'?! After tolerating it through the first book, I couldn't face the horrendous grammar and spelling mistakes, as well as the nonsensical use of the word 'heck', so I skipped through to the end and read the last few chapters. After reading the last few chapters, I have to say I'm glad I didn't put myself through reading the entire thing. Won't be picking up number three!"}, {"userName": "Alexa ", "userReviewDate": "Feb 23, 2012", "userURL": "http://www.goodreads.com/user/show/6998755-alexa", "userReview": "I loved it!!!!! love Alex i like the cover"}, {"userName": "Christina", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/8125136-christina", "userReview": "A lot has been explained, or made more clear. No heat, and I don't know that it needs it at this point. Just like book one, it ends, without any closure. Waiting for next in series.."}, {"userName": "Menna Alashker", "userReviewDate": "Mar 09, 2012", "userURL": "http://www.goodreads.com/user/show/7398418-menna-alashker", "userReview": "I fell in love with the first book in this series. The Fallen Star. It was simply breath-taking. I loved every single, freaking moment of the darn thing. I stayed up all night reading it until my eyes were bulging out of my skull. I looked horrible but it was worth it and I didn't even regret looking like crap.Then, I started reading The Underworld and fell for it hard. Every word that was written in both books contained a lot of emotions and it made my heart flutter especially when Alex was speaking. Well, most of the times. When he wasn't trying to be a cold-hearted jerk. Even then I felt like I wanted to jump in the book and slap him out of his concealment. But, sadly I couldn't.So, my emotions were either high and giddy or dark and gloomy. Sometimes, provoked and very, very angry. I was never bored while reading this.So then, Gemma. Gemma. First of all, I really, really like her name. I don’t why, I just do and honestly it fits her. Violet eyes, fallen star and all. It also suits her personality and don’t even ask me why. It just does. I mean, I don’t even know what it means. *Make mental not to look it up later*So, anyway, Gemma unlike any other heroines in the books out there, she’s actually one that I like. Don’t get me wrong, It’s not like I hate every single heroine I read about but sometimes, I just can’t help it. A lot of the heroines are either bitches or ….stupid? But here, I liked Gemma. She’s so different and fun and I enjoy reading her Point of View. She’s so determined, opinionated, stubborn, semi-brave and always does things her way. In both books, The Fallen Star and The Underworld, she has done nothing but surprise me and fell me with admiration. I think she was a surprise to everyone including the characters and even herself. She’s not just that but she also attracts a heck lot of trouble and always lands in deep shit that complicates and twists her life more.But the thing with Gemma is that she has uncontrollable trust issues. Let me just tell you, she has HUGE trust issues. Let’s take Alex, for example. She never, ever trusts him and always gives him a hard time about it. Now, I’m not saying she has to fully trust him or anything. All I’m saying is that she should be a little more sensible about it. Sure, he wasn’t being completely honest with her and yeah, maybe he’s a jerk sometimes and does need to be slapped but still! It was kind of provoking.Two events, I didn’t like were: when Alex had to pay for his broken promise and the second was Gemma’s reunion with her mother. When Alex left to pay the debt for his broken promise, Gemma wasn’t all that worked up about it. Sure, when he left she said that she was feeling lonely and stuff and even asked Laylen about what was going to happen to Alex but that was that. She didn’t fret about it or kept chanting questions about him like she asks about every freaking single thing. (That isn’t bad, not really) To me, it looked like she didn’t care all that much. It seemed as if she had erased him from her memory. Then, there’s the thing with her mother. Wasn’t the reunion between them supposed to be more……..intense? There was no hugging, no tears, no anything. Her mother just blacked out and Gemma cried by her side the whole night. (That kind of counts for something…..) Then, when they woke up, she was like ‘Are you okay?’. Seriously? What kind of reunion was that? I had hoped for more. In fact, I had hoped for a lot more. It didn’t happen though. I was a little disappointed but, oh, well. The good thing is that Gemma and her mother are united, right?Right…I think.Moving on. Nicholas. I have no fricking clue why that guy just keeps popping up everywhere. It was as creepy as ever. Heck, I wanted to punch the guy so hard, his teeth would fall out. (Yes, yes, I realize I was being a little violent while I was reading this book. Slapping and punching are really not my thing. I just acted with tons of emotions that were hard to suppress. For quite a while, I kept turning the idea of me having a fallen star’s power floating around in my body and it’s just exploding or something. That’s how much the book affected me.) Anyway, I thought Nicholas wouldn’t show up in this book but boy was I wrong. That also surprised me.It seems as if Jessica Sorensen always has something new and shocking in stock. This is actually kind of comforting, knowing that you wouldn’t predict the events or predicting them and then being proved wrong. Anyway, back to The Underworld. In this book Gemma goes to save her mother from the Underworld. Her adventure with Alex down there wasn’t long and didn’t eat up all of the events in the book but they were very interesting. Intriguing. In this book a lot of secrets were revealed and I think that’s what made it very interesting. Well that and the characters.My favorite character so far is Laylen. He kind of goes loco in this one but still my favorite character. You see, I’m totally crushing on the guy. Not just because he’s a vampire or anything (okay, maybe a little). But I just love every single detail about him. Like how he plays with his lip ring when he’s worried or when he’s concentrating on something. It’s way too cute. He’s also so honest, sincere, charming and just so light hearted even though, technically he doesn’t have a heart. Not what you would normally find in a vampire. He’s also so lonely, that it breaks my heart. He’s too good to be lonely and unaccompanied. And he’s had a rough, painful life. I really, really wish he would find someone that could be his match and it would be helpful if that someone actually lives in his world. I don’t think it would work out between him and me. Him being in another, nonexistent, world and all. I would like my date to be alive with blood and flesh. But wait, if Laylen was alive and not just a nonexistent guy on paper, he wouldn’t have blood and flesh……right? Still, too bad. That’s about it. If you by some miracle survived and read all of this, I recommend the Underworld vastly for those who started this series and for some reason hesitated and didn’t start the second book. And for those who didn’t even read the Fallen Star, you’ve missed out tons.So, a quote? I think, yes.“You remember theword we said when we pressed our hands together,right?”I nodded. “Forem. But what does it mean?”“Forever,” he said, his breath shaky. “It means we’rebonded together forever.”"}, {"userName": "Nikita Singh", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/28906467-nikita-singh", "userReview": "Okay so.... Somehow I'd managed to read (skim) through the first book but... oh who am I kidding! This book is so frustrating. It's a makes-me-wanna-poke-my-eyes-with-pins frustrating. The heroin is so freaking annoying! I hate it when the main character is always the damsel in distress, always whining, always going goo-goo eyes at guys...ugh! Utterly revolting! There were countless grammar and spelling mistakes. I mean c'mon! At some point I just couldn't go on.The plot has so much potential but.... just not my thing. Again... I wanna slap the heroin a million times for her stupid, useless attraction to some guy who she clearly can't trust a hundred percent. So not continuing. Read at your own risk."}, {"userName": "Clare", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/53483998-clare", "userReview": "I didn't like this book as much as Fallen Star, but a whole lot of things happened. You learn more about the cast of characters in this book. Even though I only really care about like 1 of them. Gemma REALLY annoyed me in this book with her constant whining and bratty behaviour. She's basically Clary Fray at this point. (Side note, I hate Clary Fray)"}, {"userName": "Gigi", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/6919519-gigi", "userReview": "Amazing Audiobook."}, {"userName": "Pamela", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/11063239-pamela", "userReview": "I still don't quite understand the point of this series, but will keep reading to find out more about Alex & Laylen."}, {"userName": "Lara", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/37467845-lara", "userReview": "Is it my version or does this series have serious grammar mistakes? I feel like some hardcore proofreading and editing would've done wonders."}, {"userName": "Tanya Rose", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/6384728-tanya-rose", "userReview": "*****SPOILERS AHEAD, READ WITH CAUTION*****So, deep breath. Yesterday I finished the Fallen Star Series by Jessica Sorensen. *Insert stars and glitter and magic!*Not taking into account any editing, literary, or any other “normal” review tactics (I’ll talk about that later) the books were freaking awesome! It follows Gemma, 18 years old, and Alex, who I believe is 20-22 years old (don’t quote me), through an epic battle against Alex’s father, Stephan, and this guy who is like the king of evil and rules over all of the Death Walkers who are these creepy creatures who breathe cold air and freeze over everything in their path.So Gemma is a normal human being, but here is the twist, a star fell to Earth once upon a time and the magic folk back then transferred the energy of the star into a human being… guess who? So Gemma has this star inside of her and the star has one purpose, to either begin or end the 12/22/12 apocalypse. The only way to keep the stars power from dying out was to “detach” Gemma’s soul; so she has no emotions whatsoever, until she meets Alex for the first time. When she’s around him she gets this prickly sensation every time she experiences a new emotion, it’s kind of strange, but you get used to it.So, if the apocalypse starts, Stephan wins and Death Walkers will run the Earth and freeze everything over and everyone dies. If it ends before it can begin, the world will be saved, but the star will die which we find out means the person holding the star must die along with it.Here’s the kicker… Alex, the boy she has this strange electricity with, the only one she seems to ever have emotions around, the boy she’s pretty sure she is in love with has the other half of the star inside of him. Dun dun dun… But no one knows this until pretty much the end of the last book. It was a really great twist! I sure wasn’t expecting it!It’s full of mythical creatures, faeries, forseers, vampires, and keepers (who “keep” them all in line and “keep” the humans safe I gather) and it was a very fast and interesting series; I think I read book three in literally under two hours. They are all written so no waiting around to see what happens next. I would give it four stars for awesomeness.Now, as for all of the technical mojojojo. The writing was ok, there were some errors with editing especially with dialogue. However, I literally yelled at the book because the tenses, especially in the first book, were all over the freaking place!!! First, Gemma’s talking to you like everything already went down, then she’s in the moment, then she goes back to talking to you like a voice over. SO FRUSTRATING!!! It mellowed out the more the story developed, but OMG it was really awful in the beginning, so much so that I almost put the book down because I couldn’t stand it. Once I got into the other books I was so hooked on the story line that I either didn’t notice, it was fixed, or I didn’t care.So for technical purposes, sad to say this book is only getting two stars for lack of awesomeness."}], "description": "**New Cover, Same Edition** Gemma thought her mind was gone, but she was wrong. And now she is left trying to figure out the truth to what Stephan is planning to do with her and the star, before it's too late. But finding out the truth is hard, especially since Gemma doesn't know who she can trust. There may be only one person who Gemma can turn to for answers, but that means having to go to the one place no one wants to go-The Underworld.", "title": "The Underworld\n      \n          (Fallen Star #2)", "url": "http://www.goodreads.com/book/show/11714997-the-underworld", "average": 4.12, "cover": "https://images.gr-assets.com/books/1417703488l/11714997.jpg", "reviews": 478, "authors": [{"url": "https://www.goodreads.com/author/show/4601855.Jessica_Sorensen", "name": "Jessica Sorensen"}], "type": ["Fantasy", "Fantasy", "Young Adult", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/11714997-the-underworld", "http://www.goodreads.com/book/show/12222468-the-underworld", "http://www.goodreads.com/book/show/17985837-the-underworld", "http://www.goodreads.com/book/show/16113791-the-coincidence-of-callie-kayden", "http://www.goodreads.com/book/show/15717876-the-secret-of-ella-and-micha", "http://www.goodreads.com/book/show/16718083-the-redemption-of-callie-kayden", "http://www.goodreads.com/book/show/16055475-the-forever-of-ella-and-micha", "http://www.goodreads.com/book/show/11051889-the-fallen-star"]}