{"ratings": 382, "userreviews": [{"userName": "Ashley - The Bookish Brunette", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/4407857-ashley---the-bookish-brunette", "userReview": "The Vengeance of the Vampire Bride was a MUCH lighter read than it's predecessor, but just as amazing and gorgeously written! Glynis still totally rocked my face off! Frater easily and instantly transports me back into a world of gothic beauty and haunting memories.Glynis has completely submerged herself into the role of Countess Dracula, and I loved her total take-charge attitude. She even titles her journal entries as Countess Dracula, instead of Lady Glynis Wright as she did in the first book!Her loneliness and despair hits me like I'm experiencing it myself, rather through a character... Without the companionship of her vampire sisters (who are at 'home' at the castle in Transylvania), combined with the loss of her family... her isolation taunts her.Preparing to return to Buda, the Fallen Angel Astir has sent her his most trusted servant, Adem, to warn Glynis of the vicious vampire attacks currently occurring in Buda and that it's no longer safe for her to go there. She's stuck in Bistrita and Glynis decides to search for her lost sister Erzsebet (Vlad's first wife, damned to an immortal life in captivity for disobedience), with Adem in tow on their first search, they end up in a bloody battle with ghouls looking for fresh blood! *shivers*After only barely escaping the ghouls, Adem then decides to teach Glynis to defend herself properly in the face of danger. Their training is quite hilarious... especially when she rips her dress!The news is brought that it is safe for them to return to Buda and Glynis is thrilled beyond measure. Only their house in Buda had been burned down since their last visit and she must stay with *ahem* Vlad's mistress... The dreadfully, horrid Baroness.Vlad has relentlessly haunted her dreams, or rather nightmares, since she left the Transylvanian castle- horrifically assaulting her and threatening her and those important to her... She is lulled into a false sense of security after having the ring Vlad gave her cursed, so now he can no longer come to her in her sleep... but the same is not true of those around her.There are forces at work beyond her already slim knowledge of the vampire world and a war of sorts rages between the vampires in Buda, right under Glynis' nose. Astir has told her to behave as a mortal Countess would and all will be fine... That works great- until it DOESN'T. Astir comes to her in warning and prophesy, \"All I see around you is death.\"~AstirNow, to tell you anymore, would be to rob you of the amazing unraveling of this tale AND the secrets of the first book if you haven't read it... But what happens will shock you! Forbidden love, vampire rulers, bloody battles... and Vlad.There are several secondary characters in this book that completely blew me away. Percy, an Englishman and a very close ally in the end. Laura probably ended up being my favorite and most surprising of the characters in this book! Magda, oh how I LOOOOVE her and her 'Do what I say, and don't ask questions' attitude. Astir... AMAZING, that is all I can say...The Vengeance of the Vampire Bride is a MUST read for any Rhiannon Frater fan! This book is an awesome sequel to The Tale of the Vampire Bride, and I can't wait for the next one! The ending completely took my breathe away! I was dying!!"}, {"userName": "Sofia Galvez", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/5420503-sofia-galvez", "userReview": "Glynis kicks butt! Love her. I enjoyed reading this book and thought it was a great followup from the 1st book. You get to see Glynis become her own woman and grow to become a powerful vampire. *possible spoiler -I do hope there is more to the story cause I doubt Vlad would give up. He is just evil and I feel he would seek his revenge."}, {"userName": "Kristin", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/3369070-kristin", "userReview": "4.5/5After the intense ride of The Tale Of The Vampire Bride, it was a welcome relief to relax (a little) as Lady Glynis embraces her role as Countess Dracula and begins to unfurl her plans to exact revenge on all those that made her life, um, HELL in the first book. And even though this second book in the Vampire Bride series is a tad bit lighter, I could not walk away from this one for longer than maybe a pee-break or two. I was seriously camped out on the couch with snacks and drink surrounding me for the duration.Where the first book focused on Glynis, Vlad and the brides, Vengeance takes off and adds some really fantastic characters. I’m actually amazed that Ms. Frater could add so many characters to a story and not one of them got lost in the story nor made the story feel overwhelmed and without plot. Each and every character had a role in the story. Some I wanted to see more than others (Ahem, Ignatius!) Some less than others (oh, Katya, what are we going to do with you?) And some just left me wondering what they’re going to do next and why are they there (Percy?). My favorites? It would have to be Adem and Magda, with Laura coming up a close third.Next, I absolutely love where Frater has taken her Vampire Bride world in this sequel. Instead of having to spend her time introducing her world to the reader, Ms. Frater takes the opportunity to use all her characters to build up a new “supernatural” world for Glynis to assimilate into. While we learn about this new world with Glynis, Glynis struggles with her identity and figuring out who she can trust. If that wasn’t enough, she still has to enact her plans for revenge and get her love, Ignatius, back into her life. And because Glynis knows very little about vampire law or protocol, she’s going to make mistakes along the way, which only ups the excitement. Add in the cranky fallen angel Astir and the brother/sister House of Gavril and Frater works her writing magic up to the astonishing ending that had me gasping (seriously, I was gasping!) for more!Notice I’ve said nothing about the plot? No spoilers here, sorry!You’re probably wondering why I only gave Vengeance a 4.5 instead of 5. Well, there was a bit of a lull (for me anyways) about a quarter of the way in that lasted for maybe a chapter that, frankly, surprised me that it was even there. Frater is such a succinct, well worded, fluent writer that I didn’t expect to have a point in the story where I actually thought, “Hey, Glynis! Get off your butt, stop over thinking and do something!!”. Yes, I do talk to characters regularly. But only if the book wraps me up and takes me away to the world inside. Obviously, Ms. Frater was able to transport me back to Buda in 1820. Rhiannon Frater is that talented of an author and I suggest you read anything of hers you can get your hands on, including the Vampire Bride series. As for the next book in the Vampire Bride series, you’re going to have to wait until 2013 for The Lament of the Vampire Bride (Vampire Bride #3)."}, {"userName": "Amanda Croley", "userReviewDate": "Sep 24, 2011", "userURL": "http://www.goodreads.com/user/show/2721716-amanda-croley", "userReview": "Lady Glynis Wright, aka Countess Dracula is determined to seek vengeance on those who betrayed her, and her family to Dracula. Forced to become one of his brides, and changed against her will, she only desires to be free. Free to live as her own person, make her own choices, and love who she wants to love. Frater is a talented writer, and I have enjoyed reading about her characters. There are no sparkling, romantic vampires here. Other than her lover Ignatious, most are cruel, power hungry, creatures. There are several new character additions, now that Glynis is no longer trapped in Vlad's castle. Laura, Sir Stephan's daughter, becomes a very good friend of Glynis, and she has an interesting role to play. Katya, the annoying vampire junkie. Magda, the faithful servant. Adem, her guard given to her by the fallen angel Astir. Vengeance of the Vampire Bride is not nearly as dark as the first book in the series, but I enjoyed it, and look forward to the next. ****************************spoilers**********************************Glynis attacks Vlad to prevent him from killing Cjeana, stakes him, and drinks him dry. She leaves him alive, but as an empty husk. After escaping the castle she leaves for Buda to find Ignatious. Csilla, Vlad's mortal mistress, takes in Glynis at what she thinks is Vlad's request. She fears he is still angry with her, and wants to stay in his favor so that she can become one of his brides. Gladyis convinces her that the way to win Vlad's loyalty, is by proving her loyalty to Glynis. Csilla signs over all of her wealth to Glynis in the event that she dies, thinking that she will be immortal. Cjeana escapes the castle, hunts down Glynis, and tries to kill her for her betrayal. Ilinca & Gavin are the new rulers of Buda, and she interferes in the confrontation. They decide after a hearing that Glynis has the right to create her own vampire house, free of Vlad. House of Wright includes Laura, Ignatious, Katya, Adem, & Magda. At the end of the book Glynis has a dream that Vlad is walking in sunlight across her gardens, picks a rose and leaves it next to her bed where she is sleeping. She wakes to the sound of the door closing, and runs to the hall to see Vlad leaving the house during the day."}, {"userName": "Lori", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/1460100-lori", "userReview": "To quote Lady Glynis \"It was beautiful and terrible, wondrous and horrific, healing and painful.\"This book is a much lighter read than the first book. Many things make it so. Glynis is her own person and living on her own. Vlad has been incapacitated throughout most of the book. Glynis is happy, but her happiness is not complete. She cannot be with the one that she loves the most. I LOVE Glynis. She is by far the best female lead that Rhiannon has ever written. She is Jenni (ATWD) and Maria (BASTION) and so much more. She is strong, independent, kick ass, and a lady. Despite her vampire exsitence she maintains her virtue (well mostly). She grows so much in this book. Without a man behind her she finds her own footing and despite everyone handling her with kid gloves manages to fuck up her life and fix her own fuck ups. Astir s/he is amazing. I literally could not figure this fallen angel out. S/he plays games for seemingly no reason other than her own amusement. It's quite frustrating. Two new characters are introduced in this book. They add so much depth to Glynis's story. Laura, the daughter of slimy Stephen and Percy. Both are taken with Glynis and she is taken with them. At times I wondered if Percy had shady reasons for befriending Glynis. He seemed to be hiding something throughout the book. I was not surprised by Lauras revelation but was pleased with it. Rhiannon is someone that embraces all types of people in her life and her work. She shows her characters and fans compassion. I will not say more than that. I don't want to spoil the fun. The first book was a dark and beautiful ride that I loved. This ride was pure joy. It kept me guessing. I absorbed this book today. Every chance I got I was reading. It is yet another cannot put down book by Rhiannon Frater. I highly recommend this series. http://contagiousreads.blogspot.com"}, {"userName": "Liz", "userReviewDate": "Sep 26, 2015", "userURL": "http://www.goodreads.com/user/show/23068367-liz", "userReview": "The second book slightly differs from the first one. Sure, there is still some gothic horror, but we meet new characters and the struggles have a slightly different focus.It is interesting to read about Glynis, because from the beginning of the first book to the end of the second one she changes a lot... she matures, her attitude is still the same and feisty but due to circumstances she is forced to \"grow up\" and think before acting.This series is nothing without Vlad Dracula's presence in the story... yes, he brings confusing destruction and powerful events with him, but I still feel he is an absolute necessity to the story!I enjoyed the book thoroughly and I enjoyed it even more when Vlad is re-introduced. He can creep you out and make a proper horror story... A fight in between right and wrong, a struggle of powers and attitudes. Well written. Am looking forward to the third book!"}, {"userName": "Stephaine", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/5496049-stephaine", "userReview": "Loved it :) brought you back to when vampires were mysterious and scary instead of sparkly and tragic. I was late to work because I sat in the parking lot trying to hurry up and finish before I had to clock in . I hope there is a part 3 I was so drawn into the Countess and her new life I want to know more."}, {"userName": "VampireNovelFan", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/4897902-vampirenovelfan", "userReview": "Vengeance of the Vampire Bride (Vampire Bride #2)- Revenge may be a dish best served cold…\nBut when it comes to this novel, the story suffers for it. I wasn't too surprised that Rhiannon Frater's Vengeance of the Vampire Bride was really slow compared to its predecessor, The Tale of the Vampire Bride, but I was hoping that some of the momentum would carry over; that just didn't happen unfortunately.Glynis is adjusting to her new undead life as Countess Dracula, plotting and planning revenge against those who literally led her family to slaughter, all the while trying to find her way back to her true love. But the presence of her vampire maker and husband Dracula isn't making things so simple. Though she's got superhuman powers of the undead, it's going to take more brain than brawn to exact her revenge exactly how she sees fit.While it had its moments, the book was an overall let down for me. It started out fairly promising, but then it hit a brick wall of boring and it took a while to climb over it. To be quite honest, I didn't crack open these books to read about how she plans to kill these people as opposed to actually doing the deed. Instead we're forced to suffer through countless dinner parties she attends involving uninteresting human side characters that receive significant screen time. There's not enough development of Glynis's actual powers steadily throughout the book. There's more whining about how she wishes Dracula could have taught her something as opposed to her actually doing something.It's just impossible to go from an imposing, horrifying, complex, and enigmatic character such as Dracula to the mere humans he's manipulated and threatened, while still producing a book that's remotely as compelling, pulse-pounding, and unpredictable---everything that encompasses the first novel.In the end it was all bark, and not a lot of bite. In a vampire story, bite is practically mandatory. By the end of the novel I felt as if the next installment should be an improvement. I do hope the series continues because it has potential to become a favorite of mine. I just hope it's not too little too late.*Review also posted to Amazon."}, {"userName": "Mary", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/8243269-mary", "userReview": "The Vengeance of the Vampire Bride is the 2nd installment in the Vampire Bride series. Typically, 2nd books can be a let down. Not this time - Rhiannon delivered an even stronger story. Glynis drained Vlad and received his powers at the end of the first book. She banished him to his coffin and left the brides with him. Her new powers allowed her to hide the castle from others. She fled to Buda to try to begin a new life on her own. I read an interview with the author several months ago and was shocked when she mentioned that the title wasn't referring to Glynis' vengeance but that of another bride. I had assumed that Glynis would take her revenge on those that had helped Vlad entrap her and kill her family. Yes, she did still crave this vengeance but there are others out there as well with thoughts of revenge.This book was tightly written, emotionally exhausting and a great story of love, hate, friendship and, yes, vengeance. Glynis is starting to grow up and learn to deal with the nuances of living in the real world. Not everything is black and white. Each of us have good and evil within us but you have to decide who you want to be. Adem, a new addition as Glynis' bodyguard, became one of my favorite characters. I hope we see more of him in the next installment. Laura and Katya - we will see. Not sure they will end well. And, finally, Ignatius really grew on me. I can see what Glynis is so attracted to - his loyalty and love. 5/5 stars. Waiting impatiently for the next in the series."}, {"userName": "Book Bite Reviews", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/6904179-book-bite-reviews", "userReview": "Lady Glynis Wright sought revenge for her families slaughter at the hands of Vlad Dracula but the plan was never revealed as to how she was going to do that save for killing those who betrayed her and her family. When she arrived the the Palace of Lady Dosza she was welcome and was safe there. At the same time, she was given warnings not to do anything rash and to lay low for awhile until further notice. The reason being there was a Vampire War happening between two Houses: The House of Bataar and The House of Ilcana and her brother. This lasted for months and a lot had happened to the Countess of Dracula. She acquired a new progeny Laura and she waited a long time to be reunited with her lover Ignatius who was in Vienna with his Mistress who happened to be The Ruler of Vampires even though there was no such hierarchy in vampire law, still she was the One all vampires honored. Even count Dracula and Ignatius were this womans progeny, yet she is still a mystery. Anyway, all the Countess ever wanted was to be free from Vlad Dracula and his enslavement and she became Lady Glynis Wright of her own House in the end, and what an ending it was! I really enjoyed this story even when it seemed to drag on but I'm glad I finished reading it because it was amazing, and I look forward to another enstallment which Rhianna hopes to give us sometime in 2012? I will definitely be waiting for the 3rd installment.Yours TrulyJB"}, {"userName": "Micky Stew", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/17787091-micky-stew", "userReview": "Words fail me as I try to write this review because nothing I say would be able to convey the magnitude of how phenomenal this book is. Rhiannon has taken what we loathe, fear and admire in vampires and created Vlad. While at the same time, she has taken what we love and admire and created Lady Glynis, a strong, passionate woman who is a force to be reckoned with.In an era where vampires are weak and watered down, Vengeance of the Vampire Bride gives us a world of creatures who are not only ferocious, terrifying, dangerous and cruel, but they are also loving, funny, beautiful and fiercely loyal beings. It is filled with action, suspense, romance and everything that makes a book great. My only disappointment is that Part 3 is not finished and I do not know how long I will have to wait.This is truly the best vampire book I have EVER read (next to the first in this series). If I could give it 10 stars I would. All others will be compared to Rhiannon Frater's Vampire Bride series."}, {"userName": "Deanna", "userReviewDate": "Sep 21, 2011", "userURL": "http://www.goodreads.com/user/show/5816463-deanna", "userReview": "All I can say is WOW once again, she left me speechless and drooling for book 3. This is a MUST READ SERIES! Rhiannon Frater has done it again. The Bookish Brunette review said it all, I agree with all of the above and could not have said it better myself. Rhiannon Frater once again shows us what a 5 star novel is with eloquent explicable ease that obviously comes so natural to her in her writing ability of this brilliant series. I truly believe that this series will be a future Dracula classic series. She is in my top 5 favorite Arthur's. Happy Reading Cheers!! DeAnna SacredmOOn1"}, {"userName": "Felicia A", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/1739957-felicia-a", "userReview": "YAYYYYYY! Another editing project is now a published book!The long awaited sequel to The Tale of the Vampire Bride, chock full of REAL, non-sparkly vampires continues the saga of Lady Glynis Wright as she comes into her own.Definitely read The Tale of the Vampire Bride first if you haven't, so you can get the full and complete effect of this amazing tale.NOW AVAILABLE"}, {"userName": "Alina", "userReviewDate": "Nov 22, 2014", "userURL": "http://www.goodreads.com/user/show/31927139-alina", "userReview": "awesome book, if you like the old fashioned Vampire, go for it!"}, {"userName": "Stacy Kirkpatrick-Marlton", "userReviewDate": "Aug 08, 2012", "userURL": "http://www.goodreads.com/user/show/8973566-stacy-kirkpatrick-marlton", "userReview": "Once again I was enthralled by countess Dracula I can not wait until the 3rd book next year"}, {"userName": "Gin", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/5015470-gin", "userReview": "4.5 Stars"}, {"userName": "Rita Barbosa", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/7723712-rita-barbosa", "userReview": "Loved it !!!Can't wait to read the next!!"}, {"userName": "Bruna Bellini", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/4890368-bruna-bellini", "userReview": "I really liked the first book.This one, started nice, too... and it was a much more lighter reading than the first book!We have lots of others characters, here but some, can't really catch me, like Laura.I think her devotion is too forced! I don't know!Laura for the love for Glynis, kill all her parents without any remorse, so they can live well! I know that her parents were cruel having a big hand on Glynis and also her family's fate. But for Laura, they were good parents. So, for me, that part on the story, didn't make too sense for me. But, the thing that REALLY didn't make sense to me, was that the Count Dracula had class with Lucifer to learn black magic... wow! That was REALLY too much! Ok, as Dracula has those classes with Lucifer, so, how come he was scared of the others vampires from Buda and also couldn't surpass the power of his own mistress, to be able to break her bidding him to his castle?!And in the end of this book, this didn't matter! Well, which is great!Anyway, the conclusion of this book, was really good! The events that happened in the end was unexpected! I can't deny that the author, is really good and very creative.I'm looking forward to read the next book, and have more of Dracula! He is an evil, wild thing.. but he makes the reading even more interesting!"}, {"userName": "Siren", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/16252847-siren", "userReview": "[It was great watching Glynis come into her own, despite her not perceiving the growth while struggling with the challenges. I hope the author delves more into the subject of her receiving more formal knowledge and training of vampiric powers. It's not often I find myself vacillating between which team I'm rooting for. I'm all for the sweet love that Ignatius offers our heroine, but at the same time I really hope the author doesn't devise a terrible ending for Dracula. I feel like he and Glynis are well matched. Perhaps it is the blood bond they share, but for all his despicable actions I'd like to imagine there's a way to achieve a happy ever after, if not for now, in the resolution. Who am I kidding, #Team Dracula lol (hide spoiler)]"}, {"userName": "Jill", "userReviewDate": "Nov 01, 2015", "userURL": "http://www.goodreads.com/user/show/4695392-jill", "userReview": "I absolutely love this story. The first book in the series was fantastic and this is equally as good. It picks up right where the first book left off. I was completely invested in each character and was on the edge of my seat waiting to see what would happen many times through out the story. Glynis is such a strong and amazing lady. You can't help but fall in love with her. One of my most favorite components of this story is that you just never really know about Dracula. Sure, he is undoubtedly evil to the core but there seems to be another side to him that is very hidden. It is intriguing. Without giving anything away, the ending of this book was phenomenal and has left me very excited for the 3rd book's release!!!!"}, {"userName": "Lorre", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/6349980-lorre", "userReview": "Loved it!!!Being more or less free from Vlad Dracul, Glynis has grown into an even stronger women in this book, a woman that is standing on her own 2 feet for the first time in her young life and who is carving her way in the human and vampire world.She is still headstrong and impulsive but luckily she has some good friends around her to temper her a bit and help her make the right decisions. I love the new family she has created for herself and I was crying so hard when some of them went through horrible things.I'm so glad I waited to start reading this trilogy till all 3 books were out cause I would have been so irritated not to be able to dive into the 3rd book after reading this one. Can't wait to see how the story ends!"}, {"userName": "Maura", "userReviewDate": "Feb 16, 2012", "userURL": "http://www.goodreads.com/user/show/6998165-maura", "userReview": "Glynis is maturing as a vampire and no longer needs to stomp her foot (like a pony). She only stomped her foot a handful of times in this installment. That was a good thing because every time she did it in the previous book, my attention would halt, and was like, would you stop!This second book flows around so many interesting turns giving each peripheral character many ways to reveal themselves. Great story, and I wonder where Glynis will end up next. London? The present day at a mall near you? lol Who knows! Can't wait to find out though!"}, {"userName": "Art Lueder", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/16303033-art-lueder", "userReview": "Excellent Gothic Horror Well written gothic horror that continues the story of Lady Glynis who had been forcibly turned by Count Vlad Dracula. At the end of book one she had impaled him and taken his full power leaving him in torpor entombed with his other brides. Claiming the title of Countess Dracula she returns to Budah to visit vengeance to the people who gave her over to Dracula. A novice in vampire political games she establishes herself but is plagued by dreams as Vlad proves he is not down for the count. (Groan that was bad even for me"}, {"userName": "beepbop", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/14066474-beepbop", "userReview": "3.5Most of the time I felt like I was dragging my feet, forced to complete the book. I love the first book so I had high hopes for this one sad to say, I didn't. I found it boring a times and I just wanted to get over with it. Maybe because Ignatius and Vlad were hardly in it. When Vlad actually came out, it was towards the end of the book. And I really enjoyed the last 25% of this book! Now I can't wait for the next one :D! What a great cliffhanger!! GAHHHH"}, {"userName": "Heather", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/5881010-heather", "userReview": "All I can say is wow!!!!!!The author has written a sexy and exciting book. I didn't want to put it down. Its not as dark as the first book. One thing I love is how you feel the emotions of the characters.....you feel as if you are there.I can't wait until book three is released.A must read tor vampire fans."}, {"userName": "Jessy ", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/5286389-jessy", "userReview": "Although it didn't rapture me as much as the first book did. I still found this book full of wonderful characters and it was well written although it could have been edited better I'm still glad I read it and look forward to the next one!"}, {"userName": "Nicole Hadaway", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/2799492-nicole-hadaway", "userReview": "The writing is flawless -- a perfect mix of period and modern understandings. Lady Glynis is a complex character, bravery mixed with emotional folly. Of course you hope she succeeds, but she doesn't always do as you'd expect. The end is amazing. I love how characters hold their own!"}, {"userName": "bunn3hh4x", "userReviewDate": "Aug 01, 2014", "userURL": "http://www.goodreads.com/user/show/19811423-bunn3hh4x", "userReview": "Just wow. The fact that the book says the next one might be out in 2012 and the website saying 2013 and now winter of 2015 is mind numbing. That is another year and some change away to wait and see what happens after such an ending!!!!Only dislike was all the foot stomping between both books."}, {"userName": "Chelsina Kong", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/13597570-chelsina-kong", "userReview": "I think I prefer the 1st book better than this. Never the less, everything came together and happened just the way it should be. Glynis had her revenge. The ending was lovely. Was hoping there could be more of Vlad in the story. Cant wait for the 3rd book. With more of Vlad in it :-)"}, {"userName": "Frankie", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/7804279-frankie", "userReview": "The best vampire books I have read! I really hope there will be a 3rd to follow!"}], "description": "In THE TALE OF THE VAMPIRE BRIDE, Lady Glynis suffered great horrors at the hands of her evil vampire master, Count Vlad Dracula, and vowed she would one day escape him. In THE VENGEANCE OF THE VAMPIRE BRIDE, Glynis learns to embrace the title of Countess Dracula as she sets into motion her plans to seek revenge on those who betrayed Glynis and her family to Dracula and to reunite with the man she loves. Despite her ambitions, it soon becomes quite apparent that her life continues to be overshadowed by the ominous presence of Vlad Dracula. Set in the 1820s against the lush gothic backdrop of Buda, Hungary...", "title": "The Vengeance of the Vampire Bride\n      \n          (The Vampire Bride Dark Rebirth #2)", "url": "https://www.goodreads.com/book/show/12700685-the-vengeance-of-the-vampire-bride", "average": 4.4, "cover": "https://images.gr-assets.com/books/1391726812l/12700685.jpg", "reviews": 42, "authors": [{"url": "https://www.goodreads.com/author/show/2310121.Rhiannon_Frater", "name": "Rhiannon Frater"}], "type": ["Paranormal", "Horror", "Fantasy", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/12700685-the-vengeance-of-the-vampire-bride", "http://www.goodreads.com/book/show/11554317-the-vengeance-of-the-vampire-bride", "http://www.goodreads.com/book/show/21591629-the-vengeance-of-the-vampire-bride", "http://www.goodreads.com/book/show/9648068-the-first-days", "http://www.goodreads.com/book/show/6350211-fighting-to-survive", "http://www.goodreads.com/book/show/6718719-siege", "http://www.goodreads.com/book/show/12295280-as-the-world-dies", "http://www.goodreads.com/book/show/13581917-the-last-bastion-of-the-living"]}