{"ratings": 344164, "userreviews": [{"userName": "Patrick", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/922495-patrick", "userReview": "It feels odd to mark this book as anything less than five stars. It was a huge part of my childhood.What's more, this book is part of the reason I'm a decent public speaker these days. I joined forensics because this was the book that was being used for extemporaneous reading. (I didn't even know what forensics was when I started, just that I liked the book.)And there are things I like here. Good things. It's a fun adventure story. There are cool settings. Action. Tension. The different nature of the islands is cool. There's mystery. Magic. Wonder. The character of Reepicheep alone boosts this book by a full star. The character of Eustace is better than I remember him being, too. It's nice to see a kid who is a total dick learn that there's consequences to his actions, then have a redemption arc in a kid's book. But reading this book to my little boy made me confront a lot of the problems in the book. There are slavers in the early chapters, which is something I didn't remember. And a topic I wasn't sure I wanted to introduce to my kid at the age of 6. There's a fair chunk of sexism too. Little things scattered throughout the books. Not terrible considering when it was written. But still nothing I want soaking into my kid's psyche. The best example of this is Ramandu's daughter. Caspian meets her, and it becomes obvious that they're going to get married. Let's just pass lightly over the fact that she's effectively being treated like a prize for him completing his quest and jump right into the fact that SHE DOESN'T HAVE A NAME! She's referred to as \"Ramandu's daughter\" through the entire book despite the fact that she has a larger part in the book. That's fucked up, y'all. There's narrative issues too. The children rarely solve their own problems. Several times they're confronted by bad situations or make bad choices but then instead of having to deal with the consequences or figure out solutions, Aslan shows up and is all ಠ_ಠ. Then, under the weight of his disappointed dad eyes and they're filled with shame and realize they should stop being dicks. That's not good storytelling. That's some deus ex leo bullshit. It's a good book, and I'm fond of it. But it's not perfect, and its flaws are large enough that they bear some serious consideration before you put it in front of your kids."}, {"userName": "Miranda Reads", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "There was a boy called Eustace Clarence Scrubb, and he almost deserved it.\nMy absolute favorite quote in the entire book.In the latest installment, Lucy, Edmund and their cousin (Eustace) were having a bit of a tiff when they were suddenly pulled into a ship painting. (Apparently, you can get to Narnia just about any which way.)They land on Prince King Caspian's ship, where we meet almost an entirely new cast of characters setting sail to find the seven lost lords of Narnia. \n“Do you mean to say,\" asked Caspian, \"that you three come from a round world (round like a ball) and you've never told me! It's really too bad for you. Because we have fairy-tales in which there are round worlds and I have always loved them … Have you ever been to the parts where people walk about upside-down?\" \nAlong the way, they have oodles and oodles of adventures - anywhere from exploring mysteriously magical islands to Eustace accidentally turning into a dragon.\nAdventures are never fun while you're having them.\nI love how we (as always) get to experience C. S. Lewis's sage wisdom through his little asides throughout the book. \nOne of the most cowardly things ordinary people do is to shut their eyes to facts.\n The only true gripe I have about this series is Reepicheep. It could just be the way the mouse-warrior was portrayed in the audiobook, but I swear I was about one step away from throwing him overboard.Audiobook CommentsI will murder Reepicheep with my bare hands if he says one more word. Other than that - David Jacobi was a fabulous reader!"}, {"userName": "P ", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/25327841-p", "userReview": "“Adventures are never fun while you're having them.” \nThe pace of this book was kind of slow for me, I spent seven days for the first half of this book. Then when the adventure comes, everything just gets better and better. I enjoyed how The Voyage of the Dawn Treader has The Lion, the Witch, and the Wardrobe vibes, even though it reminded me of some parts of Pirates of the Caribbean. \n“One of the most cowardly things ordinary people do is to shut their eyes to facts.” \nThe ideas were flowing, especially the mysterious feelings that got me chilled when the children are on the ship sailing to rescue and discover something they haven't seen before. That's just amazing considering this book was written before CGI has been well-developed. I can't imagine how Lewis created such imaginative images in his head and made people see it clearly.The ending was a bit sad, though. This is the time for the last goodbye, and I knew even if there should be more, but it's enough in the story for the children to grow up and keep in their mind that this is the farewell.All in all, the chronicles of Narnia is worth reading when I have nothing to read. It makes my head spin (in a good way) and it keeps me want to go back and be a kid again.\n“Courage, dear heart.” \nhttps://goo.gl/wQ7bbm"}, {"userName": "Dannii Elle", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/44487975-dannii-elle", "userReview": "This is my fourth journey into the fantastical lands of Narnia, as I have chosen to read the series in chronological rather than publication order.This started rather poignantly for me, as the story opens with two of the Pevensie siblings returning to Narnia, with their cousin Eustace in tow. Without the elder Pevensie children I initially felt like some of the earlier allure was lost for me, as it acted as a reminder that we all reach an age where we grow up and magic refuses to become a possibility. I quickly forgot my reservations and was once again swept away by the wonderment and awe this series inspires, however.The children find themselves thrown from this world into the ocean that borders the Narnian lands. The nearby ship, the Dawn Voyager, quickly hoists them on board and the children are happily reunited with characters from the previous book, King Caspian and Reepicheep the talking (and quarrelsome) mouse. The crew are venturing into the perilous unknown seas with the ambition of discovering more about their world and ending their journey by hopefully venturing into Aslan's country.I adored getting to explore more of this fantastical world. It added an element of adventure and highlighted Lewis' spectacular world-building artistry. This seemed to read almost like a series of connected short stories, as each island they landed on had a tale relating to it that ended as the crew disembarked.As with every other story in this series, there was a moralistic edge to the plot that served as a reminder of good behaviour for its young readership. This rather preachy element is one that doesn't fit well with its contemporary readers, in my opinion, and, whilst not ruining my enjoyment of the series, isn't a factor a particularly appreciate."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 28, 2009", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Voyage of the Dawn Treader (Chronicles of Narnia, #3), C.S. Lewis The Voyage of the Dawn Treader is a high fantasy novel for children by C. S. Lewis, published by Geoffrey Bles in 1952. The Voyage features a second return to the Narnia world, about three years later in Narnia and one year later in England, by Edmund and Lucy Pevensie, the younger two of the four English children featured in the first two books. Prince Caspian is now King Caspian X. He leads a sea voyage to the eastern end of the world, which the English siblings and their cousin Eustace Scrubb magically join soon after his ship Dawn Treader sets sail.تاریخ نخستین خوانش: سال 2002 میلادیعنوان: ماجراهای نارنیا 3: کشتی سپیده پیما؛ نویسنده: کلاویو استیپلز لوئیس 1898 - 1963 ؛ مترجم: امید اقتداری زاده سال 1330 هجری خورشیدی؛ منوچهر کریم زاده زاده سال 1328 هجری خورشیدی، تهران؛ کتابهای کیمیا تهران خیابان ولی عصر، بالاتر از میدان ونک، شماره 1337؛ فکر میکنم، بیشتر ماها هریک سرزمین خصوصی و پنهان برای خود داریم، سرزمین تخیل و رویا، اما به نظر حقیقی هم هست. هر وقت خواستیم، میتوانیم سری به سرزمین رویاهای خود بزنیم. در این لحظه هاست که میگوئیم، آخی. ا. شربیانی"}, {"userName": "Mariel", "userReviewDate": "Nov 29, 2007", "userURL": "http://www.goodreads.com/user/show/647547-mariel", "userReview": "I knew that the new film version of The Voyage of the Dawn Treader was going to be bad. I did not know that it was going to be that retarded that I'd question my faith in my own taste. (Not that I don't like retarded stuff. But boring too? Ouch.) Was the book that bad? I don't remember all of it. It's been years since I've read it. Lauren, you're never picking the movie ever again.A video game version of the movie would be better than the movie. At least it would be more difficult! What the fuck was up with the swords? Was that ALL there was to it? I seem to remember there was more... \"Hey, there's the lord's sword. Pick it up.\" There were all these old lords with ZZ Top beards and no one bust out into \"She's got legs\"? I guess they forgot how to use them when they were asleep for that long. I seem to remember there was more to the lords than that. I seem to remember that Caspian learned more than a trite \"Be your own man\" message relating to his hero worship of the dad he didn't know (the movie seems to forget that he didn't know his dad). There was more than gripping the flaccid swords of old men and daddy never touched me as a child. Wasn't there?The looks thing? What the? Lucy didn't perform a spell to look \"beautiful\" like Susan (I'm enough of a girl that I thought \"Well, she's not THAT pretty...\"). She used it to eavesdrop. She found out that her friend said something she didn't mean about her behind her back. Because she did that, they would never be friends the same way again. What Lucy really learned was that people are pissy bitches and one bad mood isn't them all the time. Girls can insult your ugly sweater and still really (sometimes secretly) admire you. I know that Eustace becoming a dragon and the process of becoming \"himself\" again was more. I loved that in the book it wasn't some pansy \"Be nice\" message. Eustace was a jerk because he was afraid of everything, afraid to think for himself. In the movie he learns to be what the \"cool kids\" want instead of just not being afraid to change. What the? Boo! The \"be yourself\" message about Lucy and Caspian did not mesh with the \"be like everybody else\" message they inflicted on the audience about poor Eustace. (The kid who played Eustace was the only good actor in the film. Lucy is an embarrassment. Also inappropriate! She did that wide-eyed wonder grin when her cousin was stuck as a dragon! What idiots let that one go by? They made their heroine look like a bitch.)Okay, they made a lot of mistakes in the pretty bad Prince Caspian film. He shouldn't have been old. It was nothing to meet him again later on in his life if he's still a young man. The stupid Susan romance? Who cares when he meats (Freudian slip) the star chick if they are pissed he forgets about Susan? I hated that movie. It was pre-school LOTR films battle scenes. They got all wrong what were the good parts of the book.I know that Edmund admits to being a shit for his first Narnia visit. This is not mentioned in the film. I liked that about Edmund in the book.Nothing new here: I always loathed Reepicheep. He's the little thing that runs his big mouth so no one will underestimate him. If he was really that good he wouldn't have to run his mouth. He's also the biggest mouth peice for Aslan-mania.The \"Bad stuff happens have faith anyway\" stuff. I remember that The Last Battle is the most overtly religious book in the series and I managed to ignore the rest in the other books. They upped the ante? Am I a harder sell?I don't like this. I feel more or less the same person as before. I'll still read the kids and ya books that recognize the parts of you that you can carry on with you. Not the bad taste for silly melodrama parts but the \"That happened and I can't pretend it didn't\" experiences. Narnia was such a good part of my life. The Lion, the Witch and the Wardrobe was the first book I really remember reading. I don't want it to be the bad part that I only pretended was good to get by.P.s. I don't wanna be all Comic Book Guy, but it annoyed the effing hell out of me that Eustace's mom announces in the end that \"Jill Pole is here to see you!\" Jill wasn't his friend before! Eustace didn't have friends. So annoying.Oh yeah! I forgot to say what I thought about writing here while watching that dumb ass movie. They really wasted a golden chance. C.S. Lewis made digs about the loss of freedoms for kids, school systems that babied kids and at the same time allowed fucked up shit to go on so they wouldn't \"Stifle\" anybody. Kids today have no freedom. Parents will call the cops on each other if they run around outside and play. Yet here was Edmund and Lucy having to be shut-in after they had lived it up as free-thinking adults in Narnia. Instead? They waste it all by bamming audiences on the head about doing what Aslan wants. That doesn't mesh with the good parts of the Narnia series that I remembered it to have.EDIT- Lauren will be pissed at me for not mentioning the glow in the dark \"eevel\" green mist. What the hell was that? I don't remember that. They should just let me write these things. The BBC tv movies back in the day combined Voyage and Prince. Probably because the actual plots were so thin. That's why they should let me do it. I'd have made the whole thing a dragon eating its own skin off movie. Prince Caspian would have been a refugee movie.Lauren really hated the actor who played the magician. You know they are a nobody if they weren't in Harry Potter (some exceptions allowed for LOTR actors)."}, {"userName": "Laz", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/22313662-laz", "userReview": "Having read the first book back in Christmas and feeling confused about the reading order I'll say that this was a very enjoyable and easy to read children's book. I'm still struggling to find out who the reading order of Narnia is. I've seen that this is either the 2nd or the 5th book but then again I've seen it being named the 3rd book. I'm just going to read it however I want and hope it'll all be fine. At least, I don't there was any missing detail from the book, so that must be a good thing.As to why I gave this 3 stars is because I found it less adventurous than the first one, I felt this one was a bit rushed and yes that's the way children's books usually are but it was a bit too much for me. I loved the characters, although some of the characters of the first book were missing, but we had a new one on the children side, and several new ones on the world of Narnia.A journey in the sea on a ship named Dawn Treader. C. S. Lewis is a masterful author, very laconic but at the same time his words are utterly descriptive. The thing with children's books is that they always make me feel nostalgic and give me this feeling we all had as children, I feel carefree."}, {"userName": "Sophia Triad", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/44642860-sophia-triad", "userReview": "Time for a Christmassy reread :)Review later"}, {"userName": "Calista", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/16731747-calista", "userReview": "I read this as a child. The end of this book with it's end of the earth myth expanded my mind back then. I really enjoyed Reepicheep. He was unexpected. The two older children- Peter and Susan were not in this one and I thought that was sad, but it still works out. This is a good series and a quick read."}, {"userName": "Rebekah Rodda", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/4123340-rebekah-rodda", "userReview": "Such a rich fantasy adventure full of unforgettable episodes - a boy-dragon, a Midas pool, invisible enemies, little Sea people, a fearless mouse, an enchanted table, the island where dreams come true and more. And above all Aslan. Truly a pleasure to read to my young children.The most unforgettable scene in this (and so worth remembering) is when Lucy magically overhears her friend gossiping about her and how that irrevocably changes their relationship - a thought-provoking reminder of the effects of gossip."}, {"userName": "Elaina", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/45468451-elaina", "userReview": "[Okay, so at the end of this book Aslan said that Lucy and Edmund wouldn't come back to Narnia..I was so sad at first, but I'm pretty sure I heard they would come back in the last book?? I'm confused lol but it's ok...I guess I'll just find out after I read them XD (hide spoiler)]"}, {"userName": "Kellyn Roth", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/52072956-kellyn-roth", "userReview": "My BFF thinks this book is boring ... but I disagree. I really love it. All of the little islands they visit hold an amazing story. I just can't believe the movie wrecked this beautiful adventure so!~Kellyn Roth, Reveries Reviews"}, {"userName": "Daniel", "userReviewDate": "Jul 31, 2009", "userURL": "http://www.goodreads.com/user/show/4695-daniel", "userReview": "The strongest of the three \"Chronicles of Narnia\" books I've read so far, \"The Voyage of the Dawn Treader\" opens with a wonderful first line: \"There was a boy called Eustace Clarence Scrubb, and he almost deserved it.\" Eustace, a cousin to the four Pevensie children, who the first two books focused on, is the designated asshole in this entry, taking up the mantle carried by Edmund in \"The Lion, the Witch and the Wardrobe\" and Susan in \"Prince Caspian.\"I've complained about this trope in my other reviews, but I don't have as much of a problem with it this time around because Eustace is so wonderfully bitchy. With the way he talks about his cousins Edmund and Lucy, as well as the Narnians on board the Dawn Treader, particularly in his diary entries, Eustace comes across as a younger, slightly less gay Noel Coward. It's actually a bit of a loss for us, the readers, when he's eventually reformed, just as Edmund and Susan were in the earlier books, and stops being deliciously catty was a result.Most of \"Voyage\" is comprised of a series of set pieces that demonstrate what a lively imagination C.S. Lewis had: the kidnapping by slave traders, Eustace's transformation into a dragon and back into a boy, the pool that turns whatever touches it to gold, the sea people, and the edge of the world. This is both \"Voyage\"'s strength and its weakness: the scenes are inventive, but the overall story is not terribly cohesive. Rather than threading the pieces together artfully, Lewis tells more of a this-happened-then-that-happened story.The writing, especially the dialogue, remains strong, and is even a bit better than in the first two books. (There's a funny line early on in the book when the then-bitchy Eustace disappears and Reepicheep, who's none too fond of him, immediately vows to avenge his murder -- apparently hoping he were, in fact, murdered.)OK, on to \"The Silver Chair.\""}, {"userName": "Ashley *Hufflepuff Kitten*", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/29787548-ashley-hufflepuff-kitten", "userReview": "The ending felt extremely abrupt after the rest of the story. I'm hoping hoping hoping we see Reepicheep again. I love that Mouse. Derek Jacobi's narration was good although I much prefer Eddie Izzard's Reepicheep vocal to a Mickey Mouse derivative; Reep is NOT Mickey."}, {"userName": "Crispitina30", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/51450907-crispitina30", "userReview": "Este libro se convertirá en uno de los más especiales de mi vida, y por una razón muy concreta.Ayer día 17 de agosto se produjo un atentado terrorista en Barcelona, la ciudad donde nací y donde resido desde siempre. Esta mañana me he levantado muy desanimada, triste y pensando en todo lo ocurrido. En las personas que han perdido injustamente la vida, personas que tenían sus sueños, propósitos y gente que las quería. Yo ayer estuve a punto de acercarme por esa zona, había quedado con un amigo precisamente una hora después de que se produjera el atentado. Afortunadamente, no coincidí ni en la hora ni en el sitio y volví a casa diez minutos después de haber salido por la puerta. Desde entonces, todo lo que he hecho ha sido mirar la televisión, leer artículos y preguntar a mis allegados si están bien y, a su vez, confirmar que yo lo estoy.Hoy, un día después, necesitaba olvidarme un rato de tanta desgracia y barbarie. Así que he apagado la televisión, he cogido este libro y he leído las cien páginas que me faltaban para terminarlo. Era justo la aventura que necesitaba. He desconectado prácticamente por completo y la magia de Narnia ha logrado transportarme y evadirme a un mundo único, hermoso y que supera cualquier peligro que se interponga en la paz. La maldad tiene mucho poder en el mundo, pero… ojalá algún día todo esto termine. Ojalá se dejen de lado el odio, la violencia y los asesinatos gratuitos. Ojalá nuestro mundo se pareciera un poco más a Narnia. Y sí, sé que esta reseña dista mucho de ser objetiva, pero hoy no puedo escribir ni pensar de otra manera. Espero que lo comprendáis.No más terrorismo. No más muerte. No más.Gracias, sir Lewis, por proporcionarme una vía de escape cuando más lo necesitaba."}, {"userName": "Carmen de la Rosa", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/28935449-carmen-de-la-rosa", "userReview": "Esto comenzó de manera bastante conmovedora para mí, ya que la historia comienza con solo dos de los hermanos Pevensie que regresan a Narnia y con su primo Eustace (por accidente). Sin los niños mayores Pevensie al principio sentí un poco que el encanto de la infancia se iba, ya que es como un recordatorio de que todos alcanzamos una edad en la que crecemos y la magia se niega a convertirse en una posibilidad. Pero rápidamente olvidé mis reservas y una vez más quedé arrastrada por la admiración y asombro que inspira esta serie, sin embargo.Adoro explorar cada vez más de este mundo fantástico. Ya que se agrega un elemento de aventura y destacó el espectacular arte artístico de construcción de Lewis. Es que leer una serie de cuentos cortos conectados, ya que cada isla en la que aterrizaron tenía una historia relacionada que terminó cuando la tripulación desembarcó, es realmente fantástico.Una aventura de fantasía tan rica y llena de episodios inolvidables: un niño dragón, un grupo de Midas, enemigos invisibles, gente del mar pequeña, un ratón intrépido, una mesa encantada, la isla donde los sueños se hacen realidad y más. Y sobre todo Aslan. Verdaderamente es un placer leer a mis niños pequeños Pevensie."}, {"userName": "Frogy (Ivana)", "userReviewDate": "Feb 06, 2016", "userURL": "http://www.goodreads.com/user/show/12397626-frogy-ivana", "userReview": "Moram da priznam da me je Ripičip baš nervirao, ali su mi zato Smotavci ili Smotopadi sjajni :)"}, {"userName": "Neda", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/9984116-neda", "userReview": "خیلی بهتر از جلد قبل بود.. ماجراها عالی بودن و پیش می رفتم به ویژه اولهای کتاب. اما یه چیزی رو چندان دوست نداشتم اونم اینه که دوست داشتم سرزمین اسلان رو بیشتر توضیح بده و یا یه جوریهایی بیشتر خود اسلان هم باشه توش.. خب اما این مانع این نمیشه که 5 تا ستاره رو بهش ندم.. :) بسی لذت بردم.. ^-^"}, {"userName": "Victoria Hansen", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/34354125-victoria-hansen", "userReview": "REVIEW COMING SOON."}, {"userName": "Deborah Markus", "userReviewDate": "Nov 03, 2013", "userURL": "http://www.goodreads.com/user/show/954028-deborah-markus", "userReview": "I loved this book, both as a child and again as an adult, because it takes me on the kind of adventure I'd love but know I can never have: a long, long sail (cool) into magic lands (über cool). It's also sprinkled with wonderful, memorable quotes and moments. I loved the bit where Lucy is looking down into the water and sees the mermaid, who looks up just in time to see Lucy looking at her. They can't speak and they're separated almost before they can lock eyes, but it's a moment neither of them will forget. I had a non-boat, non-mermaid related moment like that when I was a child. Perhaps we all have.I also love when Drinian gets very angry when Reepicheep puts himself in danger. \"All this didn't mean that Drinian really disliked Reepicheep. On the contrary he liked him very much and was therefore frightened about him, and being frightened put him in a bad temper -- just as your mother is much angrier with you for running out into the road in front of a car than a stranger would be.\" I didn't agree with this passage from the chapter \"The Dark Island,\" and I remember that puzzling me very much. Lewis is usually so spot-on when it comes to emotional truth, it seemed odd that he'd fluff something major -- something important to a child, anyway, and bad dreams are very significant to young people. I always felt, and still feel, that my whole day is darkened when I have a bad dream just before waking in the morning. But here's Lewis' beautifully written, wholly opposite take on that:And just as there are moments when simply to lie in bed and see the daylight pouring through your window and to hear the cheerful voice of an early postman or milkman down below and to realise that it was only a dream: it wasn't real, is so heavenly that it was very nearly worth having the nightmare in order to have the joy of waking, so they all felt when they came out of the dark.It just occurred to me that this may be part of Lewis' Christian apologia. It's an analogy of life here in \"the shadowlands,\" which may be dark and difficult; but ultimately the pain we suffer will make the release from it that much sweeter. I don't agree with any aspect of this take on human suffering, but it's a lovely passage anyway.Speaking of things I don't agree with in this book: As an adult reader, I found it deeply amusing to play \"Let's Count How Often Lewis Backs The Wrong Horse, Historically Speaking, in The Voyage of the Dawn Treader.\" The story starts off with a memorable introduction to Eustace Clarence Scrubb, a boy so nasty that he almost deserves such a name. (The first line of this book really ought to win some sort of award, as should Lewis' ability to create perfect names, which rivals Dickens'.) And what's so horrible about this boy? He's been brought up by terrible, awful, no good very bad parents:They were vegetarians, non-smokers and teetotallers and wore a special kind of underclothes.Okay, I have no idea what the underwear is in reference to, but the rest is pretty hilarious. Imagine! People who don't eat meat or drink or smoke! The fiends! And these wretches are being allowed to rear a child!Lewis is merciless to Eustace, who is admittedly a nasty piece of work (at least at the beginning of the book). When Eustace is flung into Narnia along with Lucy and Edmund, he is terrified and violently ill -- not exactly surprising, considering that he's tossed with no warning into the ocean and then hauled onto a very small ship. The sailors promptly offer this child of about 12 years some wine to make him feel better. Let me just stop right here and crack up at the idea of a writer trying to pull a stunt like that today -- at least if the writer were making fun of the kid for being such a hopeless prig, he'd actually say no to alcohol. At the age of 12! What a loser! This sounds like exactly the kind of situation contemporary authors would use to demonstrate the horrors of bullying and peer pressure-induced teenage alcoholism; but Lewis clearly thinks the kid should man up, already, and take the booze. Which doesn't exactly explain why Lucy, who is just as young and thoroughly female, enjoys the cup of hot wine offered to her. I'm not sure what does explain that. But I do find this paean to way-underage drinking entertaining, if only because I haven't noticed anyone else noticing it.Eustace gets worse, though. He insists that boys and girls are all just people, and ought to be treated as such. It would be one thing if Caspian were giving up his quarters (the best on the ship) and bunking with his sailors because Lucy is royalty. But of course it's because she's a lady. What a loser Eustace is for thinking she's first and foremost a kid. And as a former kid myself, let me say that I'd have been thrilled to be offered a hammock to sleep in, as Edmund and Eustace were. I can have a bed at home. If I'm in Narnia, give me adventure. But then I've never been sufficiently ladylike.Lewis seems to think that girls and women are china dolls: they should be treated with great care lest they break, and rejected if they're anything less than exquisitely beautiful. Who wants to make room on the shelf for a homely china doll? Prince Caspian, that paragon of virtue, rejects the idea of marrying a king's daughter because she \"squints, and has freckles.\" That's all we hear about her. That's reason enough for Caspian to hurry off on his next sea voyage. Speaking of Lewis' habit of hanging on with both hands (and several of his toes) to the good old days when girls were ladies and kids smoked and drank: we know the Dawn Treader has arrived at a dreadful place when we learn that the Lone Islands are governed by, well, a governor. No wonder it's rife with corruption. Fortunately, nothing ever goes wrong when people are ruled by aristocrats; so Caspian announces, \"I think we have had enough of governors,\" and hands the rule of the Lone Islands over to a Duke. And they all lived happily ever after, in a place where smoking and drinking never shortens or damages your life.Lewis also introduces us in this novel to the Calormenes. \"The Calormenes have dark faces and long beards. They wear flowing robes and orange-coloured turbans, and they are a wise, wealthy, courteous, cruel and ancient people.\" They also talk like people straight out of The Great Big Book Of Middle Eastern Stereotypes, a theme (?) Lewis will expand on later in The Horse and His Boy. So. What have we learned here? Yes to smoking, drinking, meat-eating primogeniture, aristocracy vs. elected officials, girls being treated as \"ladies\" from the moment they're born, and female beauty as a prerequisite to marital happiness; no to foreigners, feminism, and \"up-to-date and advanced people.\" I think that covers everything!Truly, I did love this book. Like all the Narnia novels (well, six of them), it's strong enough to survive its own faults, especially if you approach it with a sense of humor. Just don't let your kids read it. And if you do, don't blame me if they tell everyone what a lousy parent you are for not rearing them on wine and cigars."}, {"userName": "Manny", "userReviewDate": "Dec 05, 2008", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "The new movie version? Well, I fell asleep halfway through, so I can't swear that I remember all of this correctly. I think that they went off in a boat to find the evil green mist that was kidnapping people in City of Lost Children.Then, um, Lucy was tempted to become a vampire but thought better of it after a conversation with Aslan, and after that there was a fight between Godzillaand the Dark Overlord from Howard the Duck.At the end, Puss in Boots from Shrek fell off the end of the world. Or maybe it was a mouse with a sword and not a cat. Anyway, it was sad and I cried. That's pretty much it.I admit it doesn't quite make sense when I write it down. Maybe I should see it again."}, {"userName": "Olivier Delaye", "userReviewDate": "Jun 09, 2012", "userURL": "http://www.goodreads.com/user/show/9854601-olivier-delaye", "userReview": "I was listening to this the other day walking down the streets of Paris when it became apparent to me that The Voyage of the Dawn Treader is not only an amazing Fantasy story but also proof that even the most obnoxious and seemingly irredeemable people can still be saved and reminded of what life is all about: love, tolerance, friendship, faith, understanding, and of course adventure and discoveries. Under its veneer of simplicity, this book is all that and more. Much more. The Narnia Chronicles are timeless perfection. Nothing more, nothing less.OLIVIER DELAYE, author of the SEBASTEN OF ATLANTIS series"}, {"userName": "Shannon (leaninglights)", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/10961933-shannon-leaninglights", "userReview": "I love this book. It drags a tiny bit in the middle but goodness, that ending is breathtaking. I sobbed of course! Lol this one is tied for my favorite with Magicians Nephew. Now onto the final two books which I never read as a kid! Ahh"}, {"userName": "Natalie", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/47265779-natalie", "userReview": "Still isn't my favorite Narnia book, but I liked it so much better this time around. :) Narnia is just...no words describe it well enough. <3"}, {"userName": "Katie Ziegler (Life Between Words)", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/17825291-katie-ziegler-life-between-words", "userReview": "Loved. The Eustace transformation scene is just the BEST. Pretty much any scene with Aslan."}, {"userName": "Claire", "userReviewDate": "Mar 19, 2007", "userURL": "http://www.goodreads.com/user/show/31973-claire", "userReview": "This book has what I would say is definitely one of the World's Top Five Best Opening Lines: \"There was a boy named Eustace Clarence Scrubbs, and he almost deserved it.\" Eustace is an awesomely bitchy character who gets satisfyingly smacked down a couple of times by Ultimate Children's Fiction Dreamboat Prince Caspian. Lucy and Edmund feature prominently, as well as an AWESOME character, Reepicheep the valiant warrior mouse. I freakin' LOVE Reepicheep. This was always my favorite of the Narnia books mostly by virtue of the fact that the whole thing takes place on a ship, and as a kid I had a major boat fixation. But as an adult, it's cool to see how the book explores some interesting theological ground in the journey these characters take as they sail towards the end of the world. You don't have to have read the whole series to enjoy this book, but you probably should read \"The Lion, the Witch and the Wardrobe\" (Book 1) and \"Prince Caspian\" (Book 2) for a lot of it to make sense."}, {"userName": "Selene Matheson ", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/22492662-selene-matheson", "userReview": "Book Five in my Box Set"}, {"userName": "Kat Kennedy", "userReviewDate": "Feb 13, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "There are few books that I've read that I love more than this book. However, if I had to choose a movie adaptation to punch in the face - it would be this one."}, {"userName": "Madeline", "userReviewDate": "Jul 22, 2009", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "My favorite Narnia book so far. Lucy, Edmund, and their cousin (\"called Eustace Clarence Stubb, and he almost deserved it\") get accidentally transported onto King Caspian's ship, which is starting a journey to the eastern sea. The book is mostly just little episodes where they visit different islands, all of which are very different and very interesting. As I drew closer to the end of the book, I was fully prepared to give it five stars. BUT THEN came the ending. Specifically, one thing Aslan told Lucy and Edmund. Brace for impact. Okay Lewis. I put up with the allegory, the symbolism, your oh-so-subtle hints that these wonderful stories are actually just Christian propaganda. I tolerated it, because you kept it to the sidelines and didn’t let the allegory overwhelm the cool stories with all the magic and swords and stuff. But then you had to ruin it. Just when I’d finished a fun book about a sea voyage with almost none of your usual blatant symbolism, you dropped the bomb:\"'You are too old, children,' said Aslan, 'and you must begin to come close to your own world now.''It isn't Narnia, you know,' sobbed Lucy. 'It's you. We shan't meet you there. And how can we live, never meeting you?''But you shall meet me, dear one,' said Aslan. 'Are - are you there too, Sir?' said Edmund.'I am,' said Aslan. 'But there I have another name. You must learn to know me by that name. This was the very reason why you were brought to Narnia, that knowing me here for a little, you may know me better there.'\"Let me get this straight. All that amazing, magical stuff with the White Witch, the Christmas gifts, the swords and archery, Caspian, Tumnus, becoming kings and queens, Calormen, the sea voyage, REEPICHEEP… All of it was just. So the kids. Could learn. To love. Jesus.Lewis, you manipulative SON of a BITCH."}, {"userName": "Karina", "userReviewDate": "Jan 19, 2015", "userURL": "http://www.goodreads.com/user/show/8933844-karina", "userReview": "My favorite in the series so far!"}], "description": "Lucy and Edmund, with their dreadful cousin Eustace, get magically pulled into a painting of a ship at sea. That ship is the Dawn Treader, and on board is Caspian, King of Narnia. He and his companions, including Reepicheep, the valiant warrior mouse, are searching for seven lost lords of Narnia, and their voyage will take them to the edge of the world. Their adventures include being captured by slave traders, a much-too-close encounter with a dragon, and visits to many enchanted islands, including the place where dreams come true.This edition follows the original numbering scheme. More recent publishers have re-numbered the volumes so that the books are ordered chronologically. This was reportedly the author's preference. Other editions number this book as #5.Please respect the title as printed.", "title": "The Voyage of the Dawn Treader\n      \n          (The Chronicles of Narnia (Publication Order) #3)", "url": "http://www.goodreads.com/book/show/140225.The_Voyage_of_the_Dawn_Treader", "average": 4.09, "cover": "https://images.gr-assets.com/books/1343185059l/140225.jpg", "reviews": 5064, "authors": [{"url": "https://www.goodreads.com/author/show/1069006.C_S_Lewis", "name": "C.S. Lewis"}, {"url": "https://www.goodreads.com/author/show/25523.Pauline_Baynes", "name": "Pauline Baynes"}], "type": ["Classics", "Young Adult", "Childrens", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/140225.The_Voyage_of_the_Dawn_Treader", "http://www.goodreads.com/book/show/18132.The_Voyage_of_the_Dawn_Treader_", "http://www.goodreads.com/book/show/7806771-the-voyage-of-the-dawn-treader", "http://www.goodreads.com/book/show/8861291-the-voyage-of-the-dawn-treader", "http://www.goodreads.com/book/show/7060910", "http://www.goodreads.com/book/show/25385255-the-voyage-of-the-dawn-treader", "http://www.goodreads.com/book/show/444329.The_Voyage_of_the_Dawn_Treader", "http://www.goodreads.com/book/show/624216.La_traves_a_del_Viajero_del_Alba", "http://www.goodreads.com/book/show/17902991-la-traves-a-del-viajero-del-alba", "http://www.goodreads.com/book/show/12105223-putovanje-namernika-zore", "http://www.goodreads.com/book/show/28976477-5", "http://www.goodreads.com/book/show/65646.The_Voyage_of_the_Dawn_Treader", "http://www.goodreads.com/book/show/140227.The_Voyage_of_the_Dawn_Treader", "http://www.goodreads.com/book/show/506233.The_Voyage_of_the_Dawn_Treader", "http://www.goodreads.com/book/show/100915.The_Lion_the_Witch_and_the_Wardrobe", "http://www.goodreads.com/book/show/11127.The_Chronicles_of_Narnia", "http://www.goodreads.com/book/show/65605.The_Magician_s_Nephew", "http://www.goodreads.com/book/show/121749.Prince_Caspian", "http://www.goodreads.com/book/show/11138.Mere_Christianity"]}