{"ratings": 165, "userreviews": [{"userName": "mark monday", "userReviewDate": "Oct 21, 2013", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "Run!this is The Wide Game: on Senior Ditch Day, seniors at the local Harmony, Indiana high school race each other through a cornfield to a quarry. the rules are simple: put some money in; if you or your group spot anyone during the game then you must trade personal items and then team up; first individual or group to the quarry wins all of the money. simple! it becomes not so simple when an accident forces eight students to slowly travel back together through the cornfield carrying the accident victim. night falls and it becomes apparent to the little group that there are things lurking in the cornfield on this special evening, shapes in the corn and figures in the fog, things that whisper in your mind, things that want to play with you, things that stalk and hunt and kill. or force you to kill.Run!there is a lot that I found to be surprisingly and personally enjoyable in this one. the senior class in question is class of 1988. so was I! they listen to songs like Oh Yeah by Yello. so did I! our protagonist wants to direct thrillers when he grows up. so did I! the neighboring South Bend, Indiana is considered a Big City, heh. I lived in South Bend!the book has some problems. there is at times a cringe-inducing and rather amateurish clumsiness to the writing. supporting characters who are flattened into caricature. a character who is eliminated by a murder of crows (nice one) just disappears from the story. where's that body?but none of that matters during the book's lengthy central portion, it's pièce de résistance: the increasingly ominous then terrifying nighttime journey through the cornfield by our band of protagonists. all the problems with the prose fall away during the middle of the book; the story had its hooks into me and wouldn't let go until the end. West creates a wonderfully spooky and menacing atmosphere, indulges in some over-the-top gore, and even plays a couple narrative tricks on the reader to ratchet up the suspense and horror. it all worked perfectly during these chapters. I was absorbed and frightened. if you like to be scared, I highly recommend the central part of The Wide Game. it's awesome and would make a great horror flick.some spoilers in the next paragraph but I will try to keep it ambiguousI have to make mention of a repulsively fundamentalist twist in the book. it made me so furious that I nearly deleted the book from my e-reader. teens who commit suicide suffer in hell forever? emphasis on suffer, emphasis on forever? teens who have been terrorized, abused and mentally tortured, made genuinely unstable? they are condemned to suffer in hell forever, really? I don't hate a lot of things (outside of, say, genocide or child molestation or rape), I try to keep an open mind about context and personal perspective. but I think I can honestly say that I don't just loathe that particular point of view's cruelty, I loathe any person who genuinely thinks that way. I think it is an evil perspective. I hope this is not the author's actual viewpoint but the religious framing within the novel makes me suspect otherwise. when I come across such a loathsome, unempathetic, cruel way of looking at life and the afterlife, when I have the misfortune of meeting someone who actually thinks this way... I only want to do one thing.Run!"}, {"userName": "Renae", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/6587017-renae", "userReview": "This book was absolutely awesome! I can definitely say after reading this book that I'm more afraid of corn fields than ever before. Which really sucks if you live in Indiana! I really feel that Mike West pulled out all the stops with this book, I truly had a hard time putting it down. If I HAD to put the book aside for a few minutes, I was always anxious to get back to see what was going on. It is something I will read more than once and anytime I want to jump start my heart. Hats off to Mike West for a masterpiece. If you like/love horror, this is a MUST read!!"}, {"userName": "Michael West", "userReviewDate": "Jan 25, 2010", "userURL": "http://www.goodreads.com/user/show/3156527-michael-west", "userReview": "All versions out of print except ISBN Number 978-1-937929-18-3 The Wide Game the way it was meant to be!"}, {"userName": "Sheila", "userReviewDate": "Jul 31, 2014", "userURL": "http://www.goodreads.com/user/show/2039269-sheila", "userReview": "There’s something seriously scary about the Wide Game, and nearly everyone who’s played will carry the scars. But they won’t talk about it. And now Paul’s back in Harmony, Indiana, for a school reunion where he just might have to face up to what was. Meanwhile the reader follows his memories of that Wide Game played before graduation, and wonders at the cost.The Wide Game is classic horror, with teenagers separating in the dark when you know they ought to stay together, with something scary in the cornfield, and with romantic leads just desperate to survive. But survival isn’t everything, and there are gaps in the gruesome details where nobody knows just who or what is setting the rules for the game. And then there’s death. And then there’s the school reunion.The Wide Game is told in separate parts which tie past and present together and lead inexorably, but secretly, to final scary conclusions where a church, once scorned, just might play its own part in healing... because some things just can’t be earned after all. I enjoyed the whole story, but I truly loved the ending; that touch of thought-provoking mystery that raises a tale above its genre and makes it something special.Disclosure: I was given a free ecopy during the author’s blog tour. I’m just sorry it took me so long to get around to reading it."}, {"userName": "Nicholas", "userReviewDate": "Apr 29, 2013", "userURL": "http://www.goodreads.com/user/show/1063040-nicholas", "userReview": "Harmony, Indiana is a small town overrun by endless fields of corn, young people languishing in the stereotypical boredom inescapable with small town living, and yes, legends of nightmare coupled with an underlying history of mystery, bloodshed, and horror. Paul Rice grew up in this town, spent his high school years fraternizing with his circle of friends, aspiring to direct B-grade horror films, and falling in love with classmate Deidra. At a time when graduation is only days away, Paul and Deidra's relationship had blossomed into a bond the likes of which could almost be found in romantic fairy tales. And then came time for the class of 1988 to ditch class and undertake the coming-of-age ritual played out by the graduating classes of numerous years before them.....the time to play the Wide Game. The Wide Game is virtually a race where the object of all participants is to journey from the edge of a vast cornfield to a large clearing where a small man-made lake and good partying await --- a race that could take hours, considering the ground they have to cover and how one could easily get lost, considering also a certain strategy involving keeping quiet and stealing a belonging of anyone else playing the game that they encounter in the corn. Oh......and then there's also the matter of an ancient tribal Indian presence which inevitably screws with the graduates' minds, invoking psychedelic visions, unspeakable mayhem and the grisly murders of Wide Game players, one by one. Michael West proves himself to be a masterful storyteller, flawless in building momentum, and his skills in characterization match or even often surpass some of the most successful writers in the business. This is a first-rate novel, well edited and no holds barred. My jaw dropped, quite literally, at more than a handful of turning points in the story that I just didn't see coming, and I oftentimes couldn't put the book down. I know that's a pretty cliché phrase, but coming from me......well, that sort of intense preoccupation just doesn't occur too often. This is a work of first-rate terror and suspense, and for the seasoned reader sports a refreshingly original story methodology as a means to scare the wits out of you. This is his first novel, and I'll be watching the career of Michael West with sincere interest in his works to come. And I'll never look at corn fields the same way again."}, {"userName": "Monster", "userReviewDate": "May 22, 2011", "userURL": "http://www.goodreads.com/user/show/778752-monster", "userReview": "The Wide Game starts off with Paul Rice and his wife arriving at his mother’s house back in his old hometown. This visit isn’t just for family fun, however: it’s also the day of his high school reunion. Feeling nostalgic, his mother pulls out his old high school yearbooks, which trigger horrible memories from his senior year where his class played a game out in the cornfields of Indiana known as “The Wide Game”. This wasn’t any kind of game, though, as many of his fellow students ended up dead.Written mostly as an extended flashback, The Wide Game takes the reader through the terrible night that Paul Rice, his girlfriend Deidra, and numerous other friends played The Wide Game their senior year. Running around in a cornfield during the middle of the night is spooky enough, but when you add in all of the “surprises” that await the students throughout the night, well… it can get to be terrifying! West has created a creepy tale with enough twists and turns to keep any reader sucked into the story, and still questioning what happened when arriving at the end. As an added bonus, there are ‘80s trivia factoids sprinkled throughout to readers (at least those of that era) to get in that nostalgic mood along with the cast. I would recommend The Wide Game to all fans of horror as it is the kind of story you’d want to pull out on a dark, rainy night… especially if reading by flashlight out in the middle of a cornfield.Contains: Language, Violence, Mild Gore, SexReview by Rhonda Wilson"}, {"userName": "Nikki", "userReviewDate": "Mar 18, 2010", "userURL": "http://www.goodreads.com/user/show/3455783-nikki", "userReview": "Awesome horror book! Scary, good plot, great characters. 80's trivia galore. This is my favorite book from Michael West (although all his work is amazing). I grew up in the 80's and he really brings it back to life. It's so terrifically scary, there are parts I could barely stand to read!! West makes you feel so close to the characters that there's even a bit of sadness when the 'bad guys' go down. The plot never skips a beat, the love story is beautiful and realistic, and the manifestations of evil makes you wonder how West sleeps at night with this stuff in his head! Stephen King needs to read this book. ;O)"}, {"userName": "Kimberly", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/17371689-kimberly", "userReview": "Harmony, Indiana: This was technically the first book Michael West based in this town besieged by otherworldly influences. I read the three novels out of order, but that did nothing to take away from the plot of any. Each novel is a stand alone, and each will have you eagerly searching out more stories from Harmony. The Wide Game takes place in the 80's, in a cornfield ruled by unseen energies. When these elements decide to play, there isn't anywhere that's safe....Recommended!"}, {"userName": "Rhonda", "userReviewDate": "Feb 20, 2011", "userURL": "http://www.goodreads.com/user/show/1197659-rhonda", "userReview": "Review to follow once posted at MonsterLibrarian. Will re-post blog at that time."}, {"userName": "Matt", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/23304845-matt", "userReview": "Picked this book up after seeing it on one of the Goodreads lists and seeing the high reviews.The first 275 pages focus on character development and interactions between several pairings of characters with little plot development. The characters themselves appeared to be archetypes from the same 80's popular culture that serves as the stories main setting. As in the popular 80's classic movie The Breakfast Club, you have the jock Danny, the Nerd Mick, the misunderstood bad boy Skip, and the popular girl Nancy. The main characters Paul and Deidra are generic interpretations of inseparable young love. The next portion of the book quickly runs these characters through a classic B horror movie gauntlet. Probably the most fun to be had in the novel is in this middle section which reads like a teen slasher flick. Finally the last section of the book seemed to show the most promise as a telling of the after effects and tying up loose ends, however this seemed to be hurried and served more as an epilogue offering a minor twist to the story.The whole book seemed to be building to something that never came. The books use of flashback, dream sequences, and character fantasies make the book at times feel like you are getting a vague impression of what is actually going on and there will be a clarifying moment. By the end you realize what you've read was pretty straight forward with no tricks. The mythology is a little mixed, originating from (spoilers) an evil Native American figurehead who required fights to the death to benefit the land where cornfields now sit. In the current time period of the novel this has somehow translated to a mix of mind control and demonic harassment of anyone coming on the land forcing them to kill. Other than the one minor twist noted above, there is no master plan being implemented through a crazed central character as may be inferred by the prologue. Generally what you see is what you get in the novel. The resolution of the book also includes the protagonist coming to grips with the events through his talk with a priest. This part felt a little \"preachy\" and is likely why I also saw this book on a Goodreads list labeled something to the effect of \"stories with strong Faith based characters\". To me it felt a little heavy and out of place.In general though the book kept me reading and as others have said, there are some fun 80's references and throwbacks to the past. Generally you should be reading this for some brief fun and not to expect a lot of twists and turns or overly complex plot. I would also like to add some commentary here that may be slightly unrelated to the review of The Wide Game. This book, like horror movies, may appeal to the viewer through its visceral experiences. In this regard I believe the sex scenes are a continuation of this experience and are not excessive or \"tacked on\" (as at least one other review has noted). These limited scenes are actually somewhat necessary to show the building of the main relationship in the story. These scenes do not come close to anything like a Harlequin romance. I find it a little disturbing that so many novels now are negatively critiqued for any sexual depictions, a fact I noticed as I read several other book reviews last night. This book had some very graphic kill scenes. I would hope these would startle the average conscious more than a rather tame telling of an experience the majority of the human race goes through. Are the sex scenes strictly necessary? Probably not. I would however argue that the majority of experiences in a fiction novel are not necessary but are there for the reader to enjoy, to add background to the characters, or show the reader someone else's interpretation of events. In this regard I believe the scenes are appropriate and well delivered."}, {"userName": "Jeri", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/19203293-jeri", "userReview": "I read this book because it met the criteria for my monthly Book Club - something supernatural. I didn’t want to read vampires or Stephen King. I was actually looking at a Stephen King book on Amazon and this book was in the “other customers who looked at this book bought...”. I looked at this one and got it. It started out great. People returning to the town of Harmony for a 10 year high school reunion. Then they talked about this high school annual Senior year tradition the Wide Game. Then Flashback to high school! The book remained in the flashback time for most of the rest of the book. The author did a good job of character development for most of the characters. The story was about an ancient spirit “the Corn God” and horrible wicked things he caused to happen when you play the game. The Wide Game was never well explained, nor was the name explained. In short Seniors paid $5 to play. Whoever hiked through the miles of corn stalks to a quarry won all the money that had been paid, about $1,000 total. There were other rules about stealing things from other players that entitled them to share the prize, but again, not well explained. The author tried to build suspense by talking about things that happened in previous years. Everything starts to happen once darkness falls, of course. There were student cliques that played a part. Bullies. The football star. The head blonde cheerleader. The film geek and his girlfriend who were the main characters and a cast of others. The demon worked it’s evil by playing on the individual’s fears, hallucinations, scary crows, fog, confusion. There were deaths, murders, lots of running and getting separated. Horrible things that these kids would carry with them after they graduated. Then we are back at the Reunion. The two main characters were boyfriend/girlfriend. Smart, good looking, nice people. Then when they see one another the girl wants to get back together because they share a secret! The secret is completely out of character for either one. It has been forgotten totally but suddenly, there it is. Then there is a scene in a Catholic Church dealing with forgiveness and redemption. Then suddenly more hastily thrown in plot twists that don’t fit with anything. I think this is one of the worst, most disjointed and stupid books I ever read. I looked up the author and found he wrote two sequels to this book! Astounding! What this book doesn’t need is more! I understand this is the first book he wrote. It sucks. I truly hope he got better. Parts of the book were okay but most was absolutely terrible."}, {"userName": "Kaisersoze", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/22517400-kaisersoze", "userReview": "[ but otherwise, said threat pretty much does nothing in the present day, making for a wholly unsatisfying end to the story. (hide spoiler)]"}, {"userName": "William Bentrim", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/2760991-william-bentrim", "userReview": "Once again the small town of Harmony Indiana turns out to be less than harmonious. More demented souls seem to reside in this small, corn fed town than any major metropolis. What is up with all the corn fed fear? A high school tradition of questionable merit melds into a game with bloody consequences.A group of high school students are studied as characters. They are fleshed out so the reader can develop a sense of empathy. Then bad things start to happen. Michael West surely has a strange turn of mind. I’m guessing that he, like Stephen King, has the heart of a small boy and he too, keeps it in his top desk drawer. After plowing through the mayhem you discover that you aren’t done yet. Mr. West likes to flip things around just when you think you have everything figured out. Robby Miller of the Spook House is here, younger and not yet jaded. I have read and reviewed Spook House , Poseidon’s Children and Cinema of Shadows all by Michael West. He has carved a niche into the face of evil, leaving his readers looking over their shoulders and listening to the wind in the corn.I’ve stated before I don’t read a lot of horror stories but I really the way Michael West renders them.And yes, all puns were intended regardless of whether it is the lowest form of humor. I enjoyed the book."}, {"userName": "Robin Blankenship", "userReviewDate": "Oct 05, 2013", "userURL": "http://www.goodreads.com/user/show/3396537-robin-blankenship", "userReview": "Michael West is hands down in my top three Horror writers. Michael West, Richard Matheson and Clive Barker are my top three favorites in no particular order because I just can not decide. Michael West's stories are not only amazingly creepy, scary stories they are also deeply woven intricate plots with well flushed out characters. Michael West is one of the best storytellers I have ever read. The Wide Game from start to finish had me on the edge of my seat. It never lagged, it was never slowed, it was just one twist and turn barreling to the end. I absolutely loved The Wide Game. I loved the details when the story flashes back to the 80s. This book was not just written it was crafted. It was smart, witty, funny and scary. Perfection all rolled in to one horror novel. I highly recommend this to everyone. But be warned it is not for the faint of heart and Thanks to Michael West I get creeped out driving by cornfields now. :)"}, {"userName": "lina", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/1217072-lina", "userReview": "Ok I did like this book but I wish that kept religion out of it...Paul one of the lead actors complain too much...it got a four our of because I hated the fact that Paul ended up murdering three people and then went to a Catholic father to get his sins washed...in my opinion I want to read horror not a chapter about GoD and forgiveness...oh and I don't like animal cruelty..the part where they explained about a kitten in a microwave was not right...I can handle torture and mayhem but I can't handle animal cruelty and rape or molestation of children...but I wad glad the other two was not not in this story...But I love the Idea of the story...lost love and mayhem and sacrifice...but that all I'm saying...enjoy it like I did"}, {"userName": "Ira Gansler", "userReviewDate": "Nov 26, 2013", "userURL": "http://www.goodreads.com/user/show/26029824-ira-gansler", "userReview": "You will finish this book, put it down, and (had you read this before any of the other Harmony, Indiana titles come out) hope that Michael West is not done with Harmony, Indiana. This book was the perfectly paced horror novel. We are provided with a couple of key characters that we really get to know and follow although we may learn along the way that we don't know some of them as well as we thought we did. A corn field has not been this scary since Stephen King's Children of the Corn. Pick it up, but be prepared to pick up the other Harmony, Indiana titles, because you will not be satisfied at stopping here!"}, {"userName": "Kathryn", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/4236323-kathryn", "userReview": "Wow is all I can say about The Wide Game, Michael West delivers a creepy and suspenseful story. All of the characters in the story felt like real people. I also liked the use of Native American mythology in it, each book in the Harmony, Indiana has a different mythology to it but still felt like the same universe that I enjoyed very much. This story had a little bit of a whodunnit and I didn't expect the twist towards the end. I hope there's a 4th book in the Harmony, Indiana series."}, {"userName": "Keith Pyeatt", "userReviewDate": "Sep 20, 2011", "userURL": "http://www.goodreads.com/user/show/2413179-keith-pyeatt", "userReview": "I enjoyed reading the novel. The writing was clean and kept me in the story. I loved all the atmosphere of the corn field and the old building. The characters were my favorite part, all well developed and distinct. They grew and changed and kept me guessing but never made me question their actions. I stayed interested throughout, never had the impulse to skim, but didn't get lost because of gimmicks to keep the pace fast without adding anything to the story. Good read."}, {"userName": "Michael West", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/3156527-michael-west", "userReview": "My first novel, and your introduction to the small town of Harmony, Indiana. Available for the first time in hardcover and eBook formats. Enjoy!"}, {"userName": "Elisa ", "userReviewDate": "Sep 26, 2013", "userURL": "http://www.goodreads.com/user/show/5133558-elisa", "userReview": "This book freaked me out. Review to follow"}, {"userName": "Carla", "userReviewDate": "Dec 13, 2013", "userURL": "http://www.goodreads.com/user/show/26582643-carla", "userReview": "great book"}, {"userName": "Michael Smith", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/8418702-michael-smith", "userReview": "http://mikesfilmtalk.com/2013/03/19/t..."}, {"userName": "Sheri White", "userReviewDate": "Feb 14, 2011", "userURL": "http://www.goodreads.com/user/show/3884085-sheri-white", "userReview": "Review to come soon at Xomba Horror."}, {"userName": "Jill Franklin", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/56837703-jill-franklin", "userReview": "Horror is by far my fave genre and has been since childhood. When done well, it's challenging to say the least. It takes a special talent to skillfully bring to life plots and situations that are not suppose to exist. To bend reality, push the limitations without crossing over the line of cheesiness.It goes without saying that King is the master at this, while it may become repetitious that the this is mentioned if this genre is so much as hinted at.......can you really talk about horror and not mention King? I started reading King at 12 yrs old, have been reading horror since and there are only a handful of writers in this genre who do not simply pale in comparison. Michael West is in that elite handful. I thoroughly enjoyed all of the books in this series.The books do not piggyback one another , they are completely separate stories, independent of one another. So, while they can certainly be enjoyed as stand alone books, I would highly recommend reading all 3 to get the full picture of the supernatural haven that is Harmony Indiana.There is one character, Robby, that is at the heart of all 3 stories and others that consistently pop up and are mentioned throughout. This, along with Wests writing style and great story telling abilities, give you a sense of small town familiarity and bring to life, the town, community, the fear and the terror that takes place there.I look forward to more books by West :)"}, {"userName": "Ross", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/7255759-ross", "userReview": "Great book from Michael West. The Wide Game meshes some evil dead and children of the corn vibes together for a great atmosphere (the story is not anything like the above mentioned titles however). West's story is set in the 80's for the most part and has you feeling like your watching an old slasher, but with a way better story. Not to mention he throws quite a few twists in there that I genuinly didn't see coming at all. This is a perfect starting point for his Harmony, Indiana series and I'm proud to say I live in Indy and this book makes me think twice about stepping into any cornfields..."}, {"userName": "Anton Cancre", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/18588716-anton-cancre", "userReview": "As a basic bit of horror slaughter fun, The Wide Game does all that it promises. We’re given teens in peril, fighting and screwing among themselves before becoming the inevitable meat for the beast. Then we get the continued infighting and a whole lot of terror as they begin to realize the full stakes of their situation. Giant crow attacks, murder, temptation and blood, blood, blood. For the most part, the pace is smooth, even if the transition from adult to youth back to adult does slow down the story a bit. It makes for a quick, enjoyable read.However, the characters present a bit of a problem here. We aren’t given much more than cardboard cutouts. They walk. They talk. They do stuff. But I just didn’t feel like they were whole beings. I couldn’t form any type of emotional bond to them. That’s a big deal to me, especially when it comes to whether or not I’d bother reading a book again in the future. I think it is partially due to splitting the POV so many times, but just as much due to glossing over their internal lives. I think I could have been much more invested than I ended up being.Also, I’m not too hot on how the Miami gods and religion are portrayed. It is established that the Game was started by the old tribes, as a part of their deal with Mondamin, the corn god, that granted them fertile crops. But, as the cover art makes abundantly clear, thar be demons in them rows, laddie. While no direct correlation is spelled out, it is hard to ignore the implication the Miami Indians were demon worshipers. While that may fall in with some traditional religious teachings, it doesn’t sit well with me.On the other hand, I do appreciate how West deals with the idea of sin and forgiveness. Especially in how they relate to guilt. How redemption does not necessarily remove guilt and certainly does not wash away the past. I found this approach quite interesting.If you’re just in it for a quick good time, you’ll fair well here. You may even find some interesting wrinkles to add to your next theological argument. I didn’t find the heart to the characters that I was looking for and found some parts of the central conceit problematic."}, {"userName": "Crista L Lagace", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/41984916-crista-l-lagace", "userReview": "WowI honestly can't remember the last time I read books that made me feel like they were perfectly written. Perfect characterization, perfectly telling, perfect thrills, and perfect ending. Michael West has a reader for life."}, {"userName": "David", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/8253489-david", "userReview": "Fast read. Surprised by the amount of sex in the book. Wimpy ending though. Could have been much more sinister."}, {"userName": "WendyB", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/12087691-wendyb", "userReview": "I liked this book. It read like a campy low budget '80s movie... not that that is a bad thing. :-)I wish it didn't have the tacked on sex scenes. They added nothing to the story."}], "description": "On the advice of his wife, Paul Rice is making plans to attend his 10th year High School reunion. Returning to his boyhood home of Harmony, Indiana, he finds that he is still haunted by memories of that time–memories of Deidra, his first love, and memories of the Wide Game. It was ten years ago that Paul and his friends watched their day of fun become a race for their lives, a fight for their very souls.Now, as he meets the survivors of that day once more, Paul makes a chilling discovery: the incomprehensible forces that toyed with them have yet to finish playing their own game.", "title": "The Wide Game\n      \n          (Harmony, Indiana #1)", "url": "http://www.goodreads.com/book/show/18160656-the-wide-game", "average": 3.99, "cover": "https://images.gr-assets.com/books/1372905605l/18160656.jpg", "reviews": 29, "authors": [{"url": "https://www.goodreads.com/author/show/5130924.Michael_West", "name": "Michael  West"}], "type": ["Horror", "Mystery", "Suspense", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/18160656-the-wide-game", "http://www.goodreads.com/book/show/6345416-the-wide-game", "http://www.goodreads.com/book/show/10972687-the-wide-game", "http://www.goodreads.com/book/show/20508946-the-wide-game", "http://www.goodreads.com/book/show/10563088-the-wide-game", "http://www.goodreads.com/book/show/13062645-poseidon-s-children", "http://www.goodreads.com/book/show/12292002-cinema-of-shadows", "http://www.goodreads.com/book/show/16074582-spook-house", "http://www.goodreads.com/book/show/17455456-vampires-don-t-sparkle", "http://www.goodreads.com/book/show/17560038-hades-disciples", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}