{"ratings": 74070, "userreviews": [{"userName": "Kat O'Keeffe", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/4672379-kat-o-keeffe", "userReview": "[Come on, Arin! You question the emperor's generous deal, but you never theorize that Kestrel's engagement is a part of that deal? You say you know her, you can read her--put it together, man! If this misunderstanding gets dragged out, it's gonna drive me crazy. (hide spoiler)]"}, {"userName": "Steph Sinclair", "userReviewDate": "Mar 07, 2013", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "A year ago when I first heard about The Winner's Curse, it was during the Fierce Reads tour where I had an opportunity to interview a few MacKids authors, including Marie Rutkoski. It was a lot of fun and remains one of my favorite interviews I'd ever conducted. I really enjoyed The Shadow Society, Marie's YA debut novel, and loved her writing style, so I knew I'd be more than eager to check out any of her future works. I asked what she and the other authors where working on and she mentioned The Winner's Curse, which I mistakenly called in my mind \"The Winter's Curse.\" When she explained the premise, I was instantly intrigued. Later, when Kat and I were offered the opportunity to be early readers, we were both honored and delighted but, admittedly, hesitant. A novel exploring a relationship between slave and master can only go one of two ways: really awful or amazingly well. And for us, there's always that fear of disliking a book written by an author you like personally.Our fears were unnecessary.I remember it being well after midnight when Kat texted me saying she had finished the book. In one sitting. The same day we received it. She immediately demanded that I finish so we could gush. Gush? That was all the incentive I needed to carve out a few hours of the next day for reading. Me, being the slow reader that I am, sat reading all day and into the night. When I finished, it was late, my house was quiet and I was alone on my couch. It was the perfect opportunity to have a good cry. Kat and I FaceTimed and chatted about our favorite parts, swooned over Arin, admired Kestrel's tenacity and wit, discussed the intricately woven theme of Bite and Sting, fangirled over Marie's prose and cried together over the heartbreaking ending because parting from this book and characters was such sweet sorrow.We knew this book was special so we did what any self-professed book nerd would do when they read an amazing book: We leveled up to Book Pushers and, as Gillian from Writer of Wrongs would say, started flinging this book at any and all of our blogger friends' faces. Many of them have loved it just as much as we did and have reviewed it to the point where I'm not sure what else I could say about it. So here I am, a year later, after reading The Winner's Curse twice and listening to the audiobook. Anyone who's chatted with me over the years would know that I don't re-read books at all. I don't have the time or usually the inclination, but I made time for this one because it really did a number on the feels, yo.I'm going to give you five reasons why you should read this book and even consider giving the audio a chance.1. The narrator, Justine EyreOne word, guys: BOSS. The accent that she did was fantastic. It really put me in the rich setting of the Valorian society. My reality faded away as I listened to her describe the clothing, the buildings and the people. She has this gritty quality to her voice, that perhaps may turn some off, but for me it was perfect. It held so much emotion, especially when she did the dialog for Arin. When he talked to Kestrel, I could feel his heart breaking, his sorrow, his regrets, his resolve wavering. And when she did Kestrel, I could feel her resolve, her uncertainty, her sadness, her wavering loyalty between Arin and her people.I was really, really surprised with it because I'm picky when it comes to narrators. Everyone knows a narrator can make or break an audiobook, and for me, Justine Eyre enhanced a novel I already loved. In fact, I come out feeling like I loved the audio slightly more than the print. 2. Arin & Kestrel's relationshipThis isn't your usual romance. Theirs is a complex love that doesn't blossom overnight -- yay, no instalove! -- but it also sneaks up on you in a way. You get a sense that they have grown fond or used to each other, but you don't know if or when it's ever going to manifest into something else until it does. The problem comes with the issue of slavery. While they have these feelings for each other, the question remains on if it's real if the other doesn't have the true freedom to choose. Can you really love your master? They both know that a relationship between them won't be true unless they are both equal. Unfortunately for them, neither of their societies don't see them as such.What I really loved about the book was that even though at the heart of the story it's a romance, neither Arin or Kestrel allows their relationship to dominate their common sense. In the midst of their feelings, there's a war and it is a very real threat. Both have high stakes in this game of love and war: family members, friends, loyalty to one's country. It's complicated. It's not so easy for them to run away from their responsibilities to be with each other, and that's what makes their relationship so fascinating and complex. There's no right or wrong answer and, as a reader, it makes it more unpredictable. 3. The SettingI love how The Winner's Curse feels both Fantasy and Historical at the same time. The women wear gowns equipped with daggers, are allowed to fight in the army and have influence. The society lives for lavish balls, duels, high social gatherings and gossip. They are in no way technologically advanced since they rely on lanterns and horse or boat travel. It's one of those books where I'm not exactly sure what genre it would fall under. Let's shelve it on the Awesome Shelf, shall we? Because that's essentially what it is and that's the only thing that matters to me.If you've read other reviews that mention the world building a little lacking, it's true. However, this did not bother me and I think it's less apparent with the audio version. I got such a great feel for the culture, that didn't get a sense that I was missing anything. It seems to me, based on how The Winner's Curse ended, that that'll be elaborated more in books 2 and 3. So I'm not too worried in that respect. There's was enough going on without having the geographical locations of all cities thrown into the mix. 4. KestrelKestrel isn't your usual heroine. She's not a Katniss or a Rose or even a Tris because she's not a fighter. That's not to say she is weak by any means, but she's different. She, instead, is one of the smartest heroines I've read about. What she lacks in fighting skills, she more than makes up with her mind. She is sharp and even her father, a high official in the army, notices her tactical mind. He urges her to enlist and use her talents to help her country. However, Kestrel doesn't have any interest in joining the army and is faced with marrying, another choice she dreads making.One of my favorite scenes with Kestrel involves a duel that she wins not by strength, but with strategy. She's cunning and the type of character you'd want in a game of chess. Or if the zombie apocalypse came, Kestrel would be the one to come up with the plan to get to the safe house. She might not do you any good protection wise, but the plan would be solid.She's also fiercely determined. Kestrel knew her limitations, but still, she didn't let that stop her from her goal. She would find unique ways around her problems that didn't require brute strength or violence. 5. The Pier Scene The first half of the novel may read slow to some, but then you hit the climax and everything from then on is pretty fast paced. It's where Arin and Kestrel's feelings for one another truly shine through despite the problems that arise. The tables turn and Kestrel finally understands Arin better, and because of what Arin went through for years, he doesn't want the same for her. And the feels, the feels, the feels!The Pier Scene, and even the one before when Arin sings to Kestrel, was easily my favorite scene in the book. I don't even think there is much dialogue at that part, but wow. When Arin looks at Kestrel with that longing and she him with want, but resolve. It really emphasized how complex things were for them and it was so hard for me to read. I wanted one thing, but NHFHDJDBJFBFLFKDMGVDJBHJJVH!!!!!Man, spoilers, I tell ya. I can say no more! But by the end it was like my soul was hurting from the emotional turmoil. Marie, why did you make me feel these things? It's no secret I loved this book, guys. I'm not sure what else to say but: THIS BOOK, READ IT.Enter over at my blog to win the audiobook of The Winner's Curse, donated by Marie Rutkoski!============================PRE-REVIEW: So amazing! This book had everything I wanted. It's much too early to put a review up, but trust me, YOU WANT THIS. It had some of this:With a little of this:And romance between two of the best characters that made me go:And then my feels all went and 'sploded all over the place and made me feel something like this: And with that ending just smothered in perfection, I'm not ashamed to admit some of this happened after I realized I'd have to wait until 2015 for the sequel:Basically, I'll be re-reading this book soon and that's pretty much the highest praise I can give it.=============Disclaimers: I received an ARC of this book from the publisher for review. I also received the audiobook for review. However, I ended up purchasing the audiobook with my hard-earned cash money, so there's that. No monies or favors were exchanged for my review and high praise. I loved it all by my lonesome. More reviews and other fantastical things at Cuddlebuggery"}, {"userName": "Emily May", "userReviewDate": "Jan 10, 2014", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "There comes, on occasion, those moments in the lives of readers when they find themselves putting a book down, pausing, looking around at all the glowing reviews and five star ratings, and asking themselves the question... \ndid I read the same book?\n\n\nWhen it comes to language, dialogue and general storytelling of small events in The Winner's Curse, it's obvious that you are in the hands of a competent writer with a talent for description and a nicely-spun phrase. But this book is so... tame. Way too tame for my tastes. So much of the novel is in dire need of an injection of badassery or action or tension that goes beyond the romance. I wanted an interesting fantasy, but instead I got a dragged out tale of the forbidden romance that blooms between a Valori General's daughter and a Herrani slave.I will admit that the book starts to pick up in the last third (approx) but even that was way too little and far too late for me. I noted the page when my interest piqued slightly for the first time - page 103 - because before that I'd been treated to sitting rooms, parlor games, and polite pleasantries. Honestly, I would have put this book aside by page 50 if I hadn't been spurred on by all the positive reactions from other people. There's a whole lot of swanning about doing nothing. There's balls with pretty dresses and high society gossip. A whole lot of:And a lot of passages where Kestrel and Arin study each other's faces in great detail: \nArin knew this: her gaze would measure him, and he would sense a shift of perception within her. Her opinion of him would change as daylight changed, growing or losing shadow. Subtle. Almost indiscernible. She would see him differently, though he wouldn’t know in what way. He wouldn’t know what it meant. This had happened, again and again, since he had come here.\nThe story starts several years after the Valorians have conquered the Herrani people. Herranis are now prisoners and slaves of their conquerors. The main character - Kestrel - finds herself at a slave auction one day and makes a rather spontaneous purchase of a male Herrani slave called Arin. What begins as a master/slave relationship between two people who are foes by birth, gradually turns into friendship, trust and love. But Arin is not all he first seems and carries a dark secret that could threaten not just their relationship, but the whole empire. \nIt is, essentially, a romance.\n Which could be exactly what you are looking for. In which case, I'd say step right up and grab this book as soon as you can. But I found it disappointing as a fantasy. While there are some references to past wars and other parts of the land where the book is set, the world-building remains disappointingly vague. There is very little reason to call this book \"fantasy\"; it could just as easily be labelled a \"dystopia\", as it reminds me of many I've read that were romance stories hiding in the dystopian section. I would recommend The Winner's Curse to fans of Shadow & Bone and/or Throne of Glass. Those books that are light on the fantasy and heavy on the romance. This book is set up nicely for a sequel that should be equally dramatic in the romancing department. Who knows? Perhaps it will be like the sequel to Throne of Glass and appeal to me a lot more. I will be keeping an eye out for the reviews of the second book. All I ask for is this: a little less conversation, a little more action. Please."}, {"userName": "Navessa", "userReviewDate": "Feb 04, 2014", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "*WARNING: SPOILERS*Very seldom do I give only a single star to books that I've read from cover to cover. Usually I reserve such a low rating for ones with such abominable writing, such shallow, one-dimensional characters, such poorly constructed plots, that I can't bear to finish them. The writing in this is good. Sure, it's not the kind of prose that sweeps the reader up and transports them fully within the pages, but it gets the job done. The characters are not one-dimensional. In fact, throughout the first half of the book, I found myself pleasantly surprised by the slow revelations of their depths. The plot is there too; star crossed lovers, a power-hungry empire, a slave rebellion. What's not to like? As you can no doubt tell by glancing at the length of this review, a lot. Consider this a one-star of protest. I take issue with the main theme in this book, slavery, and how poorly it was handled.Let me give you some background so that you might understand how negatively this impacted me. My father, at heart, is a historian. He knows more about the local history of the area I grew up in than any other person alive. This is not a boast, it is a simple fact. He's spent the last twenty years gobbling up every firsthand account of the Algonquian tribes and the horrors visited on them that he can find. He knows the names of the fur trappers that used to trade with them, of the soldiers that massacred them, of the Jesuit priest who doffed his robes and donned a set of hides as he fought alongside them. He knows the lives and deaths of countless European settlers. He's spoken to their descendants. He owns their cast-iron cookware. He's rowed thirteen miles up the nearly impassable river they lived on in an exact replica of the type of small boat that (irregularly) delivered the goods their lives depended upon. Why? To see what it was like. Yeah, I grew up with that…From an early age, he impressed upon me that the only way to truly learn about history was to ignore everything my schoolbooks taught me, and instead read firsthand accounts and piece together what happened for myself, instead of blindly believing the glorified tales of the victors. When I was in middle school, we studied the Civil War, and my father pressed a thick, threadbare, vellum-wrapped book in my hands entitled Twenty-Two Years a Slave, Forty Years a Free Man by Austin Steward. It was the first of the many auto-biographies I read written by former slaves and abolitionists. I will never forget what I found within their pages. And because of that, I will never be able to turn a blind eye when this subject is poorly handled. Kestrel, the female lead in this book, is the daughter of a general who conquered a people for his empire. Not because said people were threatening theirs, not because they posed some danger to the world at large, but because of greed. The Herrani had what the empire wanted, and so they took it, slaughtering, raping and enslaving the populace along the way. These atrocities are barely mentioned. One of the few accounts we're given is a vague reference to the male lead's sister being raped, because, and I quote, she was \"too beautiful for her own good\". I'm not even going to touch that one, because it would turn this review into a goddamn thesis paper. In the beginning of the book, we're led to believe that Kestrel is different from her conquering father. We find her at a slave market, with a friend who shrugs off the auction they're about to witness. We're given this tidbit, \"…the girl's shrug reminded Kestrel that there were certain things they couldn't discuss.\" In context, you're led to believe that this is because they don't see eye to eye on slavery. She proves this to be true, by buying a slave. Oh wait, no, that doesn't prove that she's different, does it? In fact, it implies she's of the same mindset; that it's okay to BUY AND SELL HUMAN BEINGS AS IF THEY ARE CATTLE. *deep breath*But there's still a chance that she bought him with good intentions. That she plans to immediately free him. Har. Nope, she bought him because, \"The stony set of the slave's shoulders reminded her of herself...\"Yuuuup. You see, Kestrel is a self-centered asshole. She also doesn't give a single fuck that her father helped to subjugate an entire race of people. She doesn't give a single fuck that they wait on her hand and foot, and that she doesn't even know how to light a goddamn fire on her own. Sure, every now and then she feels a pang of some undefined feeling radiating from the vestigial part of her brain where emotions like sympathy, empathy, and HUMAN FUCKING DECENCY emanate from, but she's able to brush them off and ignore them. Don't believe me? How about this gem, where the slave she bought informs her that the room they're sitting in isn't being used how it was meant to be, \"I know,\" he said, \"because of this room's position in your suite, the cream color of the walls, and the paintings of swans. This was where a Herrani lady would pen her letters or write journal entries. It's a private room. I shouldn't be allowed inside.\" \"Well,\" said Kestrel, uncomfortable, \"it is no longer what it was.\"What a sociopathic remark. What a callous slap in the face. It no longer is what it was because she took it for her own and enslaved those who once lived within it. This is one of over a dozen examples I could have used here, by the way.I'm sure that someone will argue with me that Kestrel is different, because she freed a slave. Yes, she freed a single slave, Enai. This woman took up the mantel of caretaker when Kestrel's mother died, and stepped in to fill her absence. Let's not forget that Enai didn't have a choice in the matter, because SHE WAS A SLAVE. Want to know what happened to Enai's family during the invasion? Want to know if she had a husband? Children? Grandchildren? Can't tell you, because Kestrel, the selfish asshole, never bothered asking. Oh, but she loves Enai. And according to Kestrel, Enai loves her. Because apparently there's such a thing as consensual love when one of the people is being/has been systematically subjugated by the other. How can you be free to love if you're not FREE?And I have to point out the glaringly obvious here; Enai is filling the role of \"the magical person\". The exact skin color of the Herrani is never really defined within this book, but we're given to believe that they are the opposites of the Valorians who rule over them, dark-skinned where they are white, dark-haired where they are fair. If Enai were further described as black, she would be the definition of \"the magical negro\". It was Touré who said \"Magical negroes exist so that the knowledge and spirit that comes from blackness can enlighten or redeem whites who are lost or broken.\" Enai is only included in the story in two capacities, when Kestrel is broken or lost, and when Enai dies. She later (ONE MIGHT SAY MAGICALLY) appears to Kestrel in a dream during a crucial part of the story, when Kestrel most needs bolstering, and provides her with a tale from the Herrani people that gives Kestrel the strength she so desperately needs to carry on. She is nothing but a stereotype, an overused plot device that needs to die a horrific death. She's included in the story to give reason to Kestrel's implied difference from her peers. Because apparently you need a close bond with a slave to understand HOW FUCKING WRONG IT IS. *deep breath*Every single other slave except for Enai and Arin, the man Kestrel bought at the auction, remains faceless and nameless. So don't try to tell me that this chick is different, not when I'm forced to bear witness to scenes like this one: \"You asked me to be honest with you. Do you think I have been?\"She remembered his harsh words during the storm. \"Yes.\"\"Can I not ask the same thing of you?\"The answer was no, no slave could ask anything of her.\"Let's talk about those slaves, shall we? Why is it, when slavery is one of the main themes of this book, that the brutality of it is only hinted at? Why do we only see the scar-covered torso of Arin, and don't hear the tales of how he earned them? Why do we only hear vague whispers of punishments but never see them carried through?This book skirts everything that could be considered unsavory. It makes a mockery of the barbarous degradation, the soul-crushing dehumanization that these people face on a daily basis. Instead, every single Valorian you meet is basically a stand-up character when it comes to slaves. You never see a Valorian lift a hand to one. You never even see them threaten one.And I have a theory about why. If you saw the Valorians for what they were, you would hate them, and that would take away from the climax of this book. You see, the slaves revolt, and this book paints them as the bad guys because it's told from Kestrel's point of view. This is the point where I get really, REALLY angry. It's not enough that the atrocities they face on a daily basis are glossed over. It's not enough that they are the ones who have had their culture annihilated, a large chunk of their populace murdered, a large chunk of their female populace raped, and that those with the misfortune of living are now enslaved, but you want to paint them as the villains for RISING UP AGAINST THEIR OPPRESSORS? No, fuck no. This is where the book completely lost me. Up until this point, I had held out a small glimmer that Kestrel might have a revelation, that when she was captured and forced to do a single degrading act, she would understand what the Herrani had faced on a daily basis. She does not. Instead, she labels the man forcing her to *gasp* wash his feet as a monster. And she vows vengeance. With ZERO grasp of the irony.That's right. How dare he. Doesn't he know his place? Why doesn't he just be a good little slave and go back to washing HER feet. Near the 85% mark, something astonishing happens; in a single sentence, she finally regrets slavery. Yup. For no reason. She doesn’t have a revelation, she doesn't learn a goddamn thing, just thinks, \"It didn't matter that Arin's cause was just, or that Kestrel now allowed herself to see that.\"And then she moves the fuck on. Because even though she's \"allowed herself\" to see that slavery is a Bad Thing, she's not going to do a goddamn thing to help, because she could never fight her own father. In fact, she plans to escape and alert the Valorian army (which is away slaughtering and subjugating another people). Oh, and yeah, she knows that this will lead to the wholesale genocide of the Herrani, but thems the brakes.Fuck you, Kestrel. Seriously, I hope you slowly burn to death in the second book. FYI, she never, not once, voices aloud that slavery is bad. That her father is bad. That the empire is an evil, power-hungry demon sucking the life from (what's left of) the free world. I could literally write another two thousand words about my issues with how this was handled, but as I've already written two thousand words, I'll spare you from that. You're welcome. Just be warned that if you come on this review trolling me, I took a LOT of notes and highlighted entire passages to back up the arguments I make here. In short, this book is nothing but a typical YA love story. It is completely lacking in any depth beyond that. And this, ladies and gentlemen, is why I almost never read YA anymore, because while yes, I know this is \"just fiction\", I can't seem to turn my brain off enough to accept that fact.Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Regan", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "ooooooh this was gooooood"}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "Actual rating: 3.5\n“A kestrel is a hunting hawk.”“Yes. The perfect name for a warrior girl.”“Well.” His smile was slight, but it was there. “I suppose neither of us is the person we were believed we would become.”\nThe second half of this book was exceedingly better than the first. The first was plagued with a rather weak, insipid heroine, an asshat of a \"slave\" who, seriously, did not act like a fucking slave at all, more like the king of a castle. I disagree with slavery (no shit...like anyone in their right mind would ever admit to agreeing with slavery), but the point is that within a book, the role is there to be played, and the so-called slave in this book was more in control than any slave I have ever imagined.Furthermore, the first half of the book was plagued with feeeeeelings and a girl who---instead of wanting to be a fucking bad-ass soldier like her father hoped---merely aspires to...play the piano.Womp womp womp.To add further to the insults, there is a clichéd as all hell love triangle between a \"brute,\" a dark, brooding, wild slave, and a handsome, blond-haired, affable young nobleman.-________-The Summary: Kestrel is the pampered daughter of a general in the Valorian army. She holds a prestigious position in society---not very long ago, the Valorian army conquered the Herrani. The Herrani are now slaves, and their Valorian overlords have overtaken their country, their homes, and enslaved their people.Kestrel is 17, she doesn't have a lot of options in life. At 20, citizens are either forced to marry or enlist in the military. Kestrel wants neither.\n“But when you are faced with only two choices— the military or marriage—don’t you wonder if there is a third, or a fourth, or more, even, than that?”\nShe has a talent for music, she wants to play the piano...but it is a shameful talent, because music is not an option for a well-born young lady. Only slaves play music.\nIf the Herrani hadn’t prized music so highly before the war, that, too, might have changed things. But in the eyes of Valorian society, music was a pleasure to be taken, not made, and it didn’t occur to many that the making and the taking could be the same.\nOne day, Kestrel is dragged to a slave auction. A young \"brute\" of a slave caught her eyes.His name is Smith. The auctioneer wants him to sing, to put on an exhibition. He doesn't.Kestrel wants him, she feels inexplicably drawn to him. She bids an astonishingly high sum for Smith.\nKestrel drew in a shaky breath. Her bones felt watery. What had she done?The pointy-chinned woman snickered. “Looks like someone’s suffering the Winner’s Curse. The Winner’s Curse is when you come out on top of the bid, but only by paying a steep price.”\nSmith is a smith, or rather, a blacksmith. His real name is Arin.After her purchase, Kestrel tries to forget about him, but she can't. Amidst the high society gatherings, amidst her suitors, among them, is the earnest, handsome Ronan. Ronan is her best friend's brother. He has long held her in his regard.\nShouldn’t she care? Didn’t she welcome Ronan’s attention?\nShe doesn't. It is Arin who holds her thoughts.Unbeknownst to Kestrel, Arin has his own secrets and plans, and which might cost Kestrel's life.The fate of two nations are at stake.The Setting & Plot: This is your typical high fantasy, and it is very well done. I have no complaints as to the world building whatsoever.There is no info-dumping, and everything made sense. The two nations and how one came to enslave the other are well explained. I love the minor details, like the fact that music is looked down by the conquering Valorians because it was valued by the country which they defeated.I absolutely loved the political plot. The second half of the book was amazing, and it saved this book. The first half of the plot plodded on, cluttered with Kestrel's indecisiveness, Arin's prickly behavior, peppered with balls and sneaking music sessions and shopping and suitors. There were very minor but definite clues as to what would transpire in the second half of the book, everything was very subtly done.There are mysterious deaths, hints of unrest, duels...minor nuances that led up to the tremendous and shocking events of the second half.Kestrel: She took a really fucking long time to grow on me. There are some characters whom I absolutely adore and admire from the very beginning: Kestrel is not one of them. She is initially...not so much weak as indecisive. She's the sort of typical teenaged girl in that she's not sure of what she wants in life, except that she doesn't want to be what her father expects her to be. Which is a soldier.Initially, Kestrel appears spineless. I have to confess I looked down on her for choosing to want to play music over that of a bad-ass soldier girl.\n\"...she had no natural talent for fighting.\"\nNot only that, her skill is in being a military strategist. Kestrel has a brilliant mind for strategy. She chooses not to exercise it. She flaunts society's rules instead of helping her nation establish its dominance.\n“Imagine how the empire would benefit if you truly worked with me,” he said, “and used that talent to secure its territories, instead of pulling apart the logic of customs that order our society.”“Our customs are lies.” Kestrel’s fingers clenched the fragile stem of her glass.\nShe is indecisive about everything. She doesn't want to get married. She doesn't want a career. Kestrel is the sort of girl who just wants to float along in life doing whatever she fucking pleases, without consequence.She is weak, even when it comes to being a mistress in her own home. I like that she is gentle with her slaves, but there is a line between kind discipline, and cruelty, and Kestrel doesn't seem to be able to distinguish where that line lies. Kestrel constantly lets Arin, her SLAVE, talk back to her in front of her friends, in front of her peers.\n“What did you say?” Arin whispered in Valorian. He was staring at Jess. “Of course you have no gods. You have no souls.”\nShe doesn't do anything about his rudeness, his VERY PUBLIC rudeness.She allows Arin to walk all over her, while he is his slave. She gives him the ability to bargain for his cooperation. She allows her own reputation to be sullied because it was rumored that they were lovers. She receives mocking letters because she cannot put these horrible, shameful rumors to rest:\nDo you think you are the first? it read. The only Valorian to take a slave to her bed? Poor fool!Let me tell you the rules.Do not be so obvious.\nKestrel puts herself in danger for him, she puts herself up to a DUEL, risking her own life for a slave when all he would have gotten are lashes in punishment. She gives no thoughts to her father, to the fact that she is his only surviving relative, his heir. All she thinks about is saving fucking Arin's skin.\nHis hands fell away. “You, too. What a stupid thing for you to do. Why did you do that? Why would you do such a stupid thing?”“You might not think of me as your friend,” Kestrel told Arin, “but I think of you as mine.”\nBold words. It doesn't change the fact that her decision was was fucking stupid.To my relief, in the second half of the book, Kestrel grew. She develops a spine. She learns to listen to herself. She learns to stand up for herself. She learns that it is wisest not to entirely trust someone.Arin: An asshat, but thankfully, one that also grew on me. Arin has his own incentive, his own plans. My problem with Arin is that he's transparent as fuck. Arin wouldn't know subtlety it if bit him in the ass.A slave is not supposed to talk back to his mistress. A slave has no rights to demand anything of his mistress. A slave with a plot should blend in, instead of sticking out. A slave with a higher purpose shouldn't do fucking stupid things like get caught stealing a book, in doing so, risking his own fucking life.\n“He has stolen something.”There must be some mistake. Arin was intelligent, far too canny to do something so dangerous. He must know what happened to Herrani thieves.\nNope, no mistake. He did something incredibly stupid that risks his entire mission for the love of a sentimental fucking book.I did eventually grow to like Arin. It is a hard life, and Arin has had to suffer a lot for his mission. I understand his anger, I understand his frustration, and I do admire him. It has been a hard life for Arin. He has been enslaved since childhood, and I truly felt for his fate.\n\"Swallow your pride.”“Maybe that’s not as easy for me as it is for you.”He wheeled on her. “It’s not easy for me,” he said through his teeth. “You know that it’s not. What do you think I have had to swallow, these past ten years? What do you think I have had to do to survive?”\nThe Romance: Bleh. Bleeeeeeeeeh. I really wish there wasn't a love triangle. Especially when I sympathized so much with \"the other guy.\" The really, really nice other guy about whom Kestrel can't be bothered to give a fuck. Ronan ;_;\nShe tried to push away thoughts of Arin on the auction block, of the look in his eyes when he asked where his honor was, of him swearing at her guards in his tongue. She held Ronan more tightly, pressing her cheek against his chest.\nThinking about someone else when you're in another guy's arms. DAMN YOU, KESTREL.I liked the fact that there was no insta-love. I liked the fact that Arin and Kestrel's relationship took time to develop, but it felt like Arin found his way into Kestrel's heart too fast, too soon.\nWhy didn’t he come to her?She could make him. If she sent an order, he would obey.But she didn’t want his obedience. She wanted him to want to see her.\nI liked the fact that they are both willing to admit their faults, and I like the fact that they communicate. The romance in this book was adequate, and much more believable than in most YA fiction.Overall: A good book, with a considerable amount of depth in world building, plot, and characters.Quotes taken from an uncorrected proof subject to change in the final edition."}, {"userName": "Sana", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/26402455-sana", "userReview": "This book is fucking awesome. I'm literally speechless and blown away by how enjoyable and gripping this book was. I am so fucking shook, I can't even begin to describe how fucking amazing this book was. The Winner's Curse was a book I thought was about ballrooms, kings and queens and it was a book was not expecting to love at all. I never read the blurb of a book. I literally just dive into it blind and take and see how it goes for me. So I was so surprised when I found out this was about politics, (I knew this had slaves in it, but I had no clue about the country's enslavement and stuff), war, FUCKING HEARTBREAKING ROMANCE, forbidden love, strong heroine, politics, and Arin. A lovely Arin. Not gonna lie, the beginning was a struggle. It took me about 70 pages to get into and really start enjoying what was going on. Once Kestrel bought Arin, things got 200% more interesting. ○Politics was a huge surprise. I usually don't like politics and all that stuff because it's boring for me??? But in this book, though there wasn't much of it, the political aspect was super interesting and fun and I found myself wanting to read more about it and enjoying it very much. The military strategies, the whole issue about the war between the Herrani's and Valorian's was super fucking cool and I loved it. ○Kestrel is one of the most strong female characters ever and I love this girl so much. Don't worry she's not a \"I'm not like other girls\" and she's not overly badass and does not hate dresses. She's strong, loving, caring, clever, brave, sweet, respectful, selfless, and determined. She is perfectly okay with wearing dresses. She fights. She's very clever and uses strategy to win. There was this one part where she won a duel by being clever, not physically strong. ○Arin was a character that annoyed me in the beginning. He was so rude and such a dickhead, but considering he was sold off and his people were enslaved, I kind of understood. But Kestrel was nice to him and he was just a dick?? However, as the romance developed, he became sweeter and loving and akjslskdalkdj I'M SWOONING. This was intriguing, gripping, political, with swoon worthy characters, a likeable MC and engaging plot. ○The romance is A+. I love Arin and Kestrel. They are perfect. I love them. Perfect. Goodbye.Initial reaction:kahdkabzlabxjdbzoebxigeisveodbdoabxoxbsidbzidvdovdaohdiwgeeegowhrodbrosbxkxbdoefdgisvdkfhsoabsksvdidbduhrvdkxejodhdsusksnnxksjdbddhjznddbdhdhbdnxjsbsisgeisbakabdskvdvisabowueyrxicnldhsnqkGdjshsnsidgekdnxkgdiwhdosjsajhsehjaehdhidhdwjbdkshawidhfkxbshsisksnvxxvsjsjbduddjensushsjkxbsnskxhdnxkxjsbskxjdbdjdjwoeufjmddlkxvsjskdbdksndhudwkbddibdsinaznidejdbdjwkbdksnxkzdjdndnndnxnddhbzdjkebsjdisdbsisbxkdbsodbsobdskdbsobdkzsnsohrsohdixbdizvxbwohawoyewoqgfwoeuoqpaknxxbbxznkzgdbxjfhskavsoqgworuupeknavzxhkcbjkdiwiduskbskxidosndjdowhwoqpeybfkzmsosuekqoqigdbxkxidgsvzkfuwopqlabdaishskbdkabsoavsosywowpqoegeiwpqjegowbzlzoqbdkzlahsksjffsafkwowueyrnclzkwdmxldnkeuwowysghope you all enjoyed my review !!!!!! :)i literally cant even form proper words, im THAT shook yalls."}, {"userName": "Wendy Darling", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "4.5 stars Love love love love love. If you're a fan of Leigh Bardugo's Grisha trilogy or Diana Peterfreund's For Darkness Shows the Stars series, you need to get your hands on this one ASAP. It has the feel of a historical fantasy without slotting neatly into either category, as well as a pensive mood and very romantic story.Full review on the blog, with a few quotes to give you a feel for the writing: http://www.themidnightgarden.net/2014...And we're giving away an amazing prize package (book! eyeshadow! bookmarks! stickers!): http://www.themidnightgarden.net/2014...I was doubtful of the early raves, but I ended up loving The Winner's Curse. I know it's only January, but there's no doubt in my mind that this book is going to make my favorites list for the year."}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "Reviewed by: Rabid ReadsFantasy is one of my favorite genres, and it has been since I was old enough to make my own bedtime story requests. My appreciation has grown and evolved as I have likewise grown and evolved, and as an adult, I’ll pretty much take it however I can it, be it Dark, Epic, High, YA Fantasy, or otherwise. These days, however, I mostly stick to YA Fantasy b/c the books don’t typically come in a series of 12(ish), 1000(ish) page books, and are therefore less of a commitment.SO any time a new YA Fantasy series starts getting major buzz, my ears perk up. Then I read early reviews, prequels, and five chapter previews while the anticipation builds (and builds). And then on the release day, I wake up, turn on my Kindle, check out of the real world, and start devouring. Sometimes the book lives up to the hype, and sometimes it doesn’t, but until THE WINNER'S CURSE by Marie Rutkoski, they were all what they were advertised to be—Fantasy.Encyclopedia Britannica Online defines Fantasy Literature as:Imaginative fiction dependent for effect on strangeness of setting (such as other worlds or times) and of characters (such as supernatural or unnatural beings). Examples include William Shakespeare’s A Midsummer Night’s Dream, Jonathan Swift’s Gulliver’s Travels, J.R.R. Tolkien’s The Lord of the Rings, and T.H. White’s The Once and Future King. Science fiction can be seen as a form of fantasy, but the terms are not interchangeable, as science fiction usually is set in the future and is based on some aspect of science or technology, while fantasy is set in an imaginary world and features the magic of mythical beings. (Emphasis mine)THE WINNER'S CURSE had exactly one-half of those features—the imaginary world/other times part. It was completely devoid of the magic or fantastical aspect, and I'm sorry, but a cool map does not a fantasy make.That’s not to say I didn’t like it. That’s actually the (other) frustrating part. I didn’t want to like it. I wanted to be filled with righteous indignation at the misrepresentation of fantasy. But that would be misleading, and as we’ve all been told over and over again two wrongs do not make a right.SO. Aside from the mislabeling (which is, admittedly, a BIG deal), I have very few complaints. The front-half was a bit slow, both plot-wise and in the budding relationship between Kestrel and Arin (our MCs), but the latter-half was very well-paced, and let’s be honest—if Kestrel and Arin’s relationship had developed quickly, there would have been derision of the insta-love variety.I’ve also seen a lot of complaints about Kestrel that accuse her of being a spineless ninny, and while I understand how that conclusion might be reached, I respectfully disagree. Kestrel, while acknowledged to be only a mediocre fighter, is a master strategist, and like any master strategist, she plays to her strengths. Whether that entails manipulating someone into her desired outcome when a direct path would be spurned based on her role in society as a non-military female, or blackmailing an opponent she has neither the strength nor skill to beat into throwing a duel, Kestrel never backs down.The premise:Kestrel is the daughter of the General of a warmongering people, the Valorians<——can you guess which traits might be highly esteemed by this culture? Hmmm?? The Valorians, over the past decade or so have swept over the lands, obliterating anything they could not enslave. The Herrani are one such enslaved people who, prior to their way of life being destroyed, were a peaceful culture that highly valued education and artistic pursuits.That may sound arbitrary, but it’s actually the first of several reversals of the expected roles that Kestrel and Arin are supposed to play: Kestrel, raised to join the army and further the empire, is a day-dreaming, pianist, while Arin, a Herrani, (who becomes aquainted with Kestrel when she PURCHASES him at a SLAVE AUCTION) is raised to be a scholar and musician, but displays uncommon military aptitude.Once Arin joins Kestrel’s household, they begin to form a relationship (against both their better judgement and their desires). Kestrel is intrigued by Arin’s obvious intelligence (not to mention his slave-labor sculpted shoulders), and Arin is flummoxed by a Valorian who not only seems to genuinely care about her Herrani nurse, but who isn’t jonesing to kill or subjugate something.Stuff happens and the first installment of this trilogy concludes on a positively devastating note. Truly. It was a gut punch. One that leaves you with absolutely no idea how Rutkoski will engineer a HEA from all the havoc she’s wrecked. Don’t say I didn’t warn you . . .THE WINNER'S CURSE by Marie Rutkoski is the promising start of her new (half) fantasy trilogy. Star-crossed lovers are popular for a reason, and Rutkoski takes this ageless story and makes it new. So new that perhaps I don’t mind the absence of magic and mythical beings after all."}, {"userName": "Nadhira Satria", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/45365270-nadhira-satria", "userReview": "Hello, I'm in the worst slump I've had this year and the only book I can read is this god given masterpiece. Yes, I'm reading this for the ninth time. Yes, I'm obsessed. Yes, I need helpHow do you even make a review of your favorite book in the world? You. just. fucking. don'tMy soul is crushed and broken on the floor. bye I need to smoke a pack of cig and cry like a baby. adios."}, {"userName": "Maureen", "userReviewDate": "Aug 21, 2015", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "This may not be a SOLID 5 stars, more like a 4.8, but it's SO CLOSE.MY HEART IS BREAKING INTO A MILLION LITTLE PIECES.I had heard great things about this book, but not from a ton of people so it wasn't overhyped for me. I didn't really know anything going in and I think that was for the best.Kestral and Arin are phenomenal characters and the story is really fantastic. It really shines in the second half when things are set in motion and we've got POLITICS and the like. GAH just SO GOOD. I can't handle it! GAHHHHDNCLEBEBZS"}, {"userName": "Clau R.", "userReviewDate": "Dec 12, 2014", "userURL": "http://www.goodreads.com/user/show/13061577-clau-r", "userReview": "Al inicio pensé que no me iba a gustar, pero ahora sé que quiero leer el siguiente libro. YA. Review to come."}, {"userName": "Warda", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "Rereading this for the third time felt so good! This is seriously such an underrated series. I adore the characters, the world, writing and the series just keeps getting better from here on out. ———————————IMPROMPTU MIDNIGHT REREAD DECISION WITH Nani! 💛Our fan-girling got the best of us and now we’ll be reunited with Kestrel and Arin AND WE’RE HYPE! 😭😭———————————"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "That ending! What are Kestrel and Arin going to do now? I guess I will find out in the other books. Kestrel is a Valorian and a very high ranked one as her father is a general. Years ago the Valorian army defeated the Herrani people and turned them into slaves. Why? Because they wanted to and that's what jerks do. These poor people had to live as slaves in their own town and even in some of their own homes. RUDE! Anyway, Kestrel was out gambling one day (she's pretty good at it) and her and her best friend, Jess end up at the slave market. Kestrel ends up buying a slave because of reasons and a lot of it was a set up for, reasons. <--- I love saying that in my book reviews. Arin is an amazing blacksmith and he's working or Kestrel's household and there is something brewing there. Arin and Kestrel become friends, slowly but surely. Kestrel plays the piano beautifully. BUT, her father wants her to go into the military. They have a rule that Valorians have to get married or join the military by age 21. RUDE! I mean good grief, these people don't have the lives they want, even though they are jerks for making slaves and killing people. Then other things happen and there is a big war brewing, plots being made, etc . . . .I loved Kestrel, Arin, Jess and Enai. ♥Kestrel wasn't a bad@ass, she even admitted she couldn't fight even though her father had her taking lessons for years. She just wanted to play her music and be left alone. But she was very smart and asked her father to let her started talking strategies and politics with him. If she's not bad@ssed on the fighting ground at least she has a brain to think up things better than these men. <-- Sorry boys. Anyhoo, all of this helps her in the end but uggggggg, why? I don't like that ending and I hope she can get out of it but she's trying to keep everyone alive. We shall see.MY BLOG: Melissa Martin's Reading ListBLOGLOVIN: My Bloglovin"}, {"userName": "Ben Alderson", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/15850647-ben-alderson", "userReview": "really did not get into this at all. :( I love the cover and formatting but the characters I found very distant"}, {"userName": "Jasmine", "userReviewDate": "Jun 05, 2016", "userURL": "http://www.goodreads.com/user/show/21803154-jasmine", "userReview": "“Kestrel thought about how this might be what hurt the most.That they had used something she loved against her.\"\n\nMaybe I shouldn't judge someone or something by my first impression on them, but I can't help myself. So it's official that Marie Rutkoski becomes one of my top favorite authors and The Winner's Curse my top favorite books of all time. I can't stop admiring how wonderful her writing style and how incredibly well-written this story is. She tells the story in a pretty easy yet powerful way--short, concise descriptions, no redundant narrations, and every conversation among the characters is simple and clear--she doesn't beat around the bush and what impresses me most is that she still manages to make us emotional.Kestrel is an ultra-clever girl with a small frame. She’s an impressive strategist and wins her battles with her brain instead of the physical strength. She knows how to use a secret or scandal against her opponents and at the same time, stealthily creeps into others' minds so that they’ll believe what she wants them to believe. Then, the people will easily become pieces in the game she's determined to win in the end.Arin is a slave who defies orders and dares to stare into Kestrel's eyes head on with his own beautiful grey ones. He's contemplating his next move all the time and so is she. He's setting different tiles at Bite and Sting and she, too, is willing to play the game until the end. \nI know she's going to purchase him at a much higher price at the auction. What I don't know is that it happens so quickly in the beginning.\n\nThen she reminded herself bitterly that this was what curiosity had bought her: fifty keystones for a singer who refused to sing, a friend who wasn’t her friend, someone who was hers and yet would never be hers.\n\nI know she's going to have feelings for him but it'll break her heart eventually. What I don't know is that the disappointment is so strong that when it hits me, my heart aches badly.\n\nWhy didn’t he come to her?She could make him. If she sent an order, he would obey.But she didn’t want his obedience. She wanted him to want to see her.Kestrel flinched at this thought and the pain it brought with it.She knew that even if everyone believed the wrong thing of her, they were also too close to being right.\n\nI also know that she will never be his friend. What I don't know is that he will change his mind.\n\n“You might not think of me as your friend,” Kestrel told Arin, “but I think of you as mine.”...“But am I your enemy?” Arin crossed the space between them. Softly, he repeated, “Am I?”…“You’re not mine,” Arin said.\nThe Winner's Curse overwhelms me with its never-ending brilliance and vigor, and all the fascinating plans carefully calculated by those characters. Although the story itself reminds me of many other YA stories, there's nothing entirely similar in particular that I can point out. That's another thumbs-up for this trilogy. One last thing I really, really love about the book is that neither Kestrel nor Arin is avoiding each other or pushing the other away. I mean, lots of dystopian romances have the pattern of main character A pushes main character B away throughout the book and B finds something special in A later and then A forgives B and they live happily ever after. It's so NOT the case in this book! The romance is slow-paced because both of them are baiting their own traps and play their own games. I feel like entering their mind game when I read the first chapter and they leave me with a heart-wrenching cliffhanger. The biggest difference is that Kestrel and Arin talk. They communicate and share their thoughts despite the fact that one is the captor and the other prisoner. Regardlessly, a part of them work together as a team, whereas a part of them secretly plot out the rest to make the other pay. All in all, their interaction is the most precious thing in this novel and I cherish those moments wholeheartedly. \n“Open your hands, Little Fists,” said Arin. “Open your eyes. I haven’t stolen his love for you. Look.” It was true that in the course of their conversation, Javelin had turned away from Arin, disappointed by the empty pocket. The horse nosed Kestrel’s shoulder. “See?” Arin said. “He knows the difference between an easy mark and his mistress.”\nLastly, here's a playlist I think it fits the atmosphere in this story so much.1)Alan Walker-Sing Me To Sleep\"Wait a second let me catch my breathRemind me of how it feels to hear your voiceYour lips are moving; I can't hear a thingLiving life as if we had a choiceAnywhere, anytime, I will do anything for you\"2)Natasha Thomas-Let Me Show You The Way\"Are you gonna be there when I need someone And will I be always just the only one I don't wanna have just another heartbreak So tell me is your love true or a fake in the game of the heart You know I know that you are mine\"3)Kodaline-The One\"When we are together you make me feel like my mind is free And my dreams are reachable You know I never ever believed in love or believed one day That you would come along\"To sum up, I love this book very much so I HIGHLY RECOMMEND it to everyone!"}, {"userName": "Beth", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/44125660-beth", "userReview": "The Winner's Curse is when you come out on top of the bid, but only by paying a steep price.Where do I even begin with this review? This. I did not expect this.Honestly, this was never ending, to say it's not the biggest book in the world SO much happens! There were parts where I was like how is this even happening?! The building of the storyline was so well done, and forever had me guessing what was coming next. Not only that, but we saw different difficulties coming in to play and how not everything can happen.My heart broke so many time for Kestrel and Arin, it's so hard to explain. I had such conflicting views about both of these characters, but overall I'm so happy with how they grew.\"In the dark. You... you look like an open flame\" - ArinWe have Kestrel, she admits she's not the best fighter but doesn't want to show this as a weakness. We do however see how intelligent she is! I love all of her strategic moves and how she thinks of the little things no one else would. I just enjoyed seeing a character be true to themselves and knowing what there strengths and weakness's are rather than be something that they're not. I'm really looking forward to seeing how she progresses in the next books! \"You might not think of me as your friend,but I think of you as mine.\" - KestrelNow we have Arin out of everyone in this book, I honestly didn't know where he stood, he had me questioning things over and over again and that's what I think I liked so much about him. There are so many unanswered questions I want to know more!\"My soul is yours. You know that it is.\" - ArinWhat I liked?- The book was just effortless, it flowed so well, it was easy to read, the chapters were short and well paced, something was continuously happening, just what I like in a book!- The world building for this was really interesting!- I enjoy the whole \"Star-Crossed Lovers\" type thing. (Yes I am rooting for them)What I didn't like?- How to word this... we got glimpses of side characters, but they literally meant nothing! I don't know how to explain this. I love that the focus is on Arin and Kestrel, I really do. However we didn't see a lot of other characters, a prime example of this is Cheat. I wanted to know so much more about his character, but really what did we know/find out about him?- There are so many open ended questions, will we find out what they actually mean orrrrr?!Overall I honestly really enjoyed this book, if I didn't already have the second book I would be weeping at that ending, how can it leave us there wanting to find out what happens next?! Luckily for me I have the next book! YAY!She would bring the hounds of the empire howling down on this cityThe Winner's Curse - 4 StarsThe Winner's Crime - 4 StarsThe Winner's Kiss - 4 Stars"}, {"userName": "Maram", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/36873117-maram", "userReview": "wooAAHHHHHH. that ENDING. i'm still SOBBING.I bought the entire series last summer knowing NOTHING lol I don't really know what got into me that day but I'm so glad that it was a blind purchase because I loved this book so much!!!! I was hooked from the first chapter and nothing ever felt slow to me :') The political aspect of this book and the plot's emphasis on using strategies to get what you want was quiet refreshing to read about. I also didn't mind the fact that this book didn't focus on world-building as the story's setting can eerily be relatable to what our world has/is going through x) THE CHARACTERS:- our main female lead, Kestrel, was one that I found meh in the beginning but grew to quickly love her. She is fierce without being conceited and all-round lovely, hella nice human being that deserves all the love in the world. - our main male lead, Arin, was fdhhdfjkf from beginning to end. He also deserves all the love in this world. MY POOR BABY KEEPS GETTING PUSHED DOWN AND I ADMIRE HIM FOR STAYING STRONG. the shipping was:I'm so nervous for the sequel because WHAT'S GOING TO HAPPEN TO MY BABIES AND THEIR HOMES. SO FAR, IT DOESN'T SEEM LIKE IT'S GOING TO END NICELY sooooo??? :)))"}, {"userName": "Jennifer Armentrout", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/4533977-jennifer-armentrout", "userReview": "AHHHHHHHH. All the feels. Seriously"}, {"userName": "April (Aprilius Maximus)", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/20658145-april-aprilius-maximus", "userReview": "Felt a slight disconnect with the main character, but otherwise I loved it!"}, {"userName": "Mitch", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/8170554-mitch", "userReview": "Why do I feel like I just read something out of the Spartacus fanfiction reject pile?To be perfectly honest, I thought I'd seen the very bottom of bad young adult historical fantasy. Not gonna name names, but even among such esteemed company, The Winner's Curse is a new low. However you want to measure it, plot, setting, character development, Marie Rutkoski's latest book fundamentally fails at being anything other than bland, shallow, cliched, and predictable. Maybe I'm being spoiled by fond memories of Melina Marchetta, Kristin Cashore, and Maria V. Snyder, but I really expected more from this book, and all I got out of it was the biting anticipation of finishing a train wreck I just couldn't look away from. I'm surprised no one has mentioned this yet, but my first reaction? - what a a blatant knockoff of Spartacus, and not a good one at that. You have your Roman er Valorian Empire and all the backstory predictably associated with that. You have your supposedly charismatic slave leader Arin (never mind he has the personality of a dull block of wood) who not surprisingly is revealed to be a ringleader of a planned slave rebellion not too many chapters in. The rest, as anyone who's seen one of the many incarnations of Spartacus can attest to (I'm partial to the Starz version myself), is much murder, mayhem, violence, and killing of Romans Valorians, only in this case, everything's sanitized and not much of it makes any sense (I'll get back to that in a moment). Unfortunately, while Rutkoski borrows just enough of Roman culture, history, and trappings to make it obvious, the lore, mythos, world building, whatever you want to call it, behind this world is bad, like really bad. The setting's not really well developed, with enough name dropping (congratulations Dacians, you're now the Dacrans!) that we're not dealing with a blank canvas here but beyond that there's no richness or flavor that makes me go, hmm, Rutkoski really gets the Romans (see, e.g., anything by Elizabeth Bear for comparison's sake). Normally, that's not a fatal flaw, but in this case, we have slaves who I would literally forget were slaves based on their behavior and how they're treated if Rutkoski hadn't kept reminding me (I'm not saying an author has to go all in like Steve McQueen in 12 Years a Slave, but when slavery is such a crucial part of your book, it's borderline insulting to both your audience and history to portray them like well off servants for the most part) and a second half that relies so much on political intrigue that it completely fails at making sense because Rutkoski doesn't take the time to explain the why, especially given how contrary it is to everything that's happened in the preceding chapters (the last few chapters were complete WTFs to me). Which leads me to my next complaint - the real problem isn't the boring, borrowed, shallow backstory, it's that none of the characters behave in character (actually, I'm being pretty generous calling these cardboard cutouts 'characters' and assuming they're intended to have a character, but I probably shouldn't go there). Kestrel, for example, is written both as a vapid society girl and a supposed military genius, and now I'm not saying a kickass heroine can't also be a little vain, but her two halves do not gel. She's supposed to be torn by her feeling for Arin and her loyalties to the Valorians, but if so, Rutkoski does a poor job of it, because all I see is a lovestruck girl who doesn't give two shits about her country except as an obligatory aside, and all that does is make me question every choice she ends up making - like, why does she do this? How does that make any sense? And it goes without saying she, heck the entire book, would've been much more interesting had Rutkoski developed Kestrel as the kind of character who's uncomfortable living in a slaveholding society despite that world being the only one she knows, but that part of the book is so glossed over there's no tension there and makes the eventual role reversal when Arin's rebellion breaks out all the more ridiculous. And that's not even mentioning the complete fail of all the supporting characters - young adult as a genre is usually good at delivering the best (girl) friend, the best (guy) friend, and the jackass suitor tropes, but these? You're kidding, right? Critically, this is a book without real villains, the whole premise relies on the shades of gray of humans, Valorians, accepting the inhumanity of slavery and the consequences of that acceptance when the slaves overthrow their masters, but such a book really needs exceptional, nuanced characters to work and none of Rutkoski's stepped up to the plate and made me want to care about what was going on.So what's left? A plot that left me wondering, is everyone in this book really that dumb? Seriously, I don't know how else to explain Arin plotting rebellion under everyone's noses and nobody, including Kestrel who's supposed to be incredibly perceptive, noticing anything. I guess given all the other fail, asking for a clandestine, suspenseful conspiracy is a little too much, but this is the worst kind of handholding where everything that happens is viewed through the lens of (and supposed to fuel) the growing angst of these two star-crossed lovers. Eh. Otherwise, there's no twists, no turns, no complex characters, no exploration of a relationship between a girl and the slave she bought besides the tritest of batting eyelashes, and no resolutions except those that are clearly of the 'because the author said so' variety; it's all meaningless pining, generic action sequences, some nonsense leading to the kind of ending I can't explain except to say, gee, how does this even work except to make the sequel even more angsty and gut wrenching? - I could go on and on about how the actual story feels like a hollow, dumbed down shell of a premise, a complete letdown of what I thought the teasers promised, but like I said, after the first five chapters I was steeling myself for the train wreck to come and yet despite my morbid curiosity and sense of schadenfreude keeping me going I was still unprepared for how unexpectedly devoid of emotion, genuinely awful, and completely tangential to the premise this thing degenerates into.Frankly, I'm not exactly sure what the appeal of this book is. In terms of borrowing from Roman history and culture, in terms of building characters separated by slavery, in terms of delivering a plot that logically goes from point A to point B without devolving into a hot mess, The Winner's Curse completely misses the mark on all fronts."}, {"userName": "Marie", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/66287119-marie", "userReview": "So I finished this book a few days ago now, and can I just say, I don't remember the last time a book hit me so hard. This was a book I wanted to give my full attention to and couldn't wait to review. I'll try to grow this review into my trademark ranty sort soon, but for now, this will have to do.IT'S ALL MY EMOTIONS WILL LET ME DO.So here we have it. Reasons to Read The Winner's Curse Because Emotional Death is Fun:• The author's name is Marie. Clearly a name of legend *cough cough* so you know. She must be magical. Just like me. ✨ (Sparkles to prove my magicalness, obviously.)• There's a PIANO PLAYING MAIN CHARACTER. Do you hear me roaring??? I wish we had more musical characters and HERE WE HAVE HER. She's also super cunning and strategic and kind to boot. Like I want to be this girl??• We are blessed with a slowly developed romance and it made me all kinds of happy.• THERE'S A SUPER FABULOUSLY WRITTEN ROMANESQUE WORLD THAT HONESTLY HAD SOME OF THE BEST WORLDBUILDING I'VE READ FOR A LONG WHILE & IT MIGHT HAVE STOLEN MY BREATH AWAY ALONG WITH MY UNCAPITALIZED LETTERS. SO THERE'S THAT.• This was also a book that made me stop what I was doing and read for hours on end. I don't remember the last time a book has soaked up my attention so completely and I could hardly bear to put the book down. Unless it was to stare at it.Because I mean WHO WOULDN'T IT'S STINKING GORGEOUS.• I actually cared about the characters. Like they're my family. Don't mess with them or I WILL THROW MY BOOKS AT YOU AND POTENTIALLY MAIM YOU. You have been warned.• I'm obsessed. It's official.Please let me know if that list wasn't good enough. I'd be happy to scream more reasons at you in the comments."}, {"userName": "Whitney Atkinson", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "2.5 starsI cannot put my finger on what didn't work in this book. The writing was enjoyable, but something about the plot or characters or I don't even know what just lost me. I wasn't necessarily bored, I just didn't care. It may have been because I listened to this on audio, but I could not connect to the story. The characters were meh, the plot was meh, and most of the book was just war plotting, which was so confusing because we got barely any backstory about the different kingdoms or whatever the two opposing sides were. I will not be continuing this series."}, {"userName": "Beatriz", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/46560610-beatriz", "userReview": "Precioso! Una narrativa que juega con los sentimientos de los personajes (y de los lectores) hasta el punto en que un suspiro, una mirada o un simple encuentro estremecen hasta el alma y ruegas por encontrarlos en la siguiente página. Una historia muy dura, que me ha hecho sufrir como pocos libros lo han logrado, no tan sólo por lo imposible de la relación de los personajes principales, sino por la triste realidad de un pueblo sometido.La trama nos sitúa en la imaginaria península de Herrán, que diez años antes fuera invadida por el imperio de Valoria, y que ahora utiliza a los herraníes como esclavos de los nuevos habitantes de la península, los valorianos.En ese entorno comienza la relación ama-esclavo entre Kestrel y Arin, cuyos sentimientos comienzan a cambiar de forma tan pausada que ni ellos mismos se dan cuenta y, cuando lo hacen, intentan negar esas emociones que les es cada vez más difícil ocultar. Me llamó mucho la atención como la autora imprimió en estos personajes y en su forma de actuar las propias características de sus orígenes: la sensibilidad de Arin, propia de un pueblo de gran riqueza cultural y artística, y la mente estratega de Kestrel, propia de un pueblo guerrero que vive para conquistar.El estilo de Marie Rutkoski es muy cuidado, utiliza una prosa muy rica, que envuelve de tal forma que es imposible parar de leer incluso en las partes en que los niveles de tensión bajan un poco. Sin duda continuaré esta trilogía que, más que una historia de amor, nos cuenta de dos personas tratando de hacer lo correcto en la más adversa de las situaciones."}, {"userName": "Ishmeen", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/24369685-ishmeen", "userReview": "“Isn’t that what stories do, make real things fake, and fake things real?”   THIS WAS SO GOOD OMG I LOVE KESTREL?? AND ARIN?? AND OH BOY MY HEART IS TORN 💔  Regret not picking this book up ages ago, it was just so damn intriguing y'all I'm not really into politics much but  Kestrel is literally a queen  gosh she has definitely become one of my favourites in just one book. Can't wait to see where this story will lead and the extent to which it will wreck my heart 🙂-A certain  someone  who loves tim tams and Dorian's phantom hands a bit too much forced me to read this so here I am 🤗"}, {"userName": "Kat Kennedy", "userReviewDate": "Mar 13, 2013", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "I can't wait to review and share the absolute amazeballs that is this book!Steph and I still sit on FaceTime and gush about a couple of the scenes over and over again."}, {"userName": "Riley", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/23179211-riley", "userReview": "Wow this book exceeded my expectations! I am blown away. I loved Kestrel and Arin. I loved the strong political aspect of the book as well as the connection with music between the characters. Best book I've read so far this year"}, {"userName": "Joshua Gabriel (조수아)", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/8832758-joshua-gabriel", "userReview": "She reminded herself bitterly that this was what curiosity had bought her: fifty keystones for a singer who refused to sing, a friend who wasn't her friend, some one who was hers and yet would never be hers.The Winner's Curse is now one of my favorite books. I've been meaning to read it ever since Marie Rutkoski accepted my impulsive friend request. Har-har. And now that I've devoured her book, I'm so happy she indulged my audacity. I'm normally a polygamist reader, but I just cannot let any other book get in the way of me continuing this potentially emotional trilogy.With the exception of its setting, The Winner's Curse is not fantastical. It actually gave me a lot of YA contemporary feels. However, this is not your typical love story. To be more precise, Kestrel and Arin thankfully did not suffer from instalove. Otherwise, I would have given this book two stars. :pThe best thing I liked about The Winner's Curse was its emphasis on political drama. In light of their very different backgrounds (i.e. as the colonizer and the colonized), these two characters were forbidden to form any sort of meaningful connection. Throughout the novel, their happiness was dampened by the threat of war, death, and social disgrace. In light of these complications, Kestrel and Arin became very cunning and skeptical, even towards each other. This gave their relationship a competitive aspect, which I definitely enjoyed. Overall, the political intrigue in this book made the plot and characters very compelling.I cannot write this review without praising the author's writing style. Personally, I can only describe it as the perfect balance between prose and poetry. I loved the narrative and dialogues because they were written in a musical way that often tugged at my heartstrings. As an aspiring novelist, I would love to be mentored by Marie Rutkoski.I'm honestly having a hard time pointing out the weak points of this book. I did not give it five stars just because Arin sometimes got on my nerves. I was particularly annoyed every time he said mean things to Kestrel. I sympathized with his oppressed status in society, but I could not help but flinch at his insensitivity.In conclusion, The Winner's Curse gave me an emotional and memorable reading experience. I've always been a fan of political and worthwhile drama, so I had no trouble getting into the story. I can hardly wait to read the supposedly heart-pounding sequel."}, {"userName": "Jeff", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/68159473-jeff", "userReview": "This book was an amazing read!!!!!! Ahem, if I may add, quite different from the last two books.......This book had a strong, mature female character. And ya see, people who actually know what they're doing besides living off ramen noodles when they grow up are MY MODELS.Cause honestly, screw grades. Screw school. Screw old teachers who smell like a dusty closet.I PLAN TO READ AND EAT JUNK FOOD FOR THE REST OF MY LIFE. But anyways, Kestrel, (the MC and my teacher when I grow up ;) is a pristine, wealthy lady.And OBVIOUSLY, there's gonna be some hot, dude with a tortured soul that appears in her life.Duh.........So off they go, facing troubles and all that stuff young teens do  while i'm sitting here, snacking on potato chipsJust.......WHY CAN'T THAT BE ME???!!! i'm gonna be single potato forever.....The Winners Curse was a brilliant book, you should definitely try it out!!! :pHave fun reading, y'all. ;)"}, {"userName": "❄️Nani❄️", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/68538597-nani", "userReview": "Let the emotional obliteration begin!Buddy re reading with My kindred spirit 😻"}], "description": "Winning what you want may cost you everything you love... As a general’s daughter in a vast empire that revels in war and enslaves those it conquers, seventeen-year-old Kestrel has two choices: she can join the military or get married. But Kestrel has other intentions. One day, she is startled to find a kindred spirit in a young slave up for auction. Arin’s eyes seem to defy everything and everyone. Following her instinct, Kestrel buys him—with unexpected consequences. It’s not long before she has to hide her growing love for Arin. But he, too, has a secret, and Kestrel quickly learns that the price she paid for a fellow human is much higher than she ever could have imagined. Set in a richly imagined new world, The Winner’s Curse by Marie Rutkoski is a story of deadly games where everything is at stake, and the gamble is whether you will keep your head or lose your heart.", "title": "The Winner's Curse\n      \n          (The Winner's Trilogy #1)", "url": "http://www.goodreads.com/book/show/16069030-the-winner-s-curse", "average": 4.02, "cover": "https://images.gr-assets.com/books/1377023523l/16069030.jpg", "reviews": 10624, "authors": [{"url": "https://www.goodreads.com/author/show/1238111.Marie_Rutkoski", "name": "Marie Rutkoski"}], "type": ["Fantasy", "Young Adult", "Romance", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/16069030-the-winner-s-curse", "http://www.goodreads.com/book/show/17756559-the-winner-s-curse", "http://www.goodreads.com/book/show/19415228-the-winner-s-curse", "http://www.goodreads.com/book/show/20947360-the-winner-s-curse", "http://www.goodreads.com/book/show/25913122-la-maldici-n-del-ganador", "http://www.goodreads.com/book/show/21469136-the-winner-s-curse", "http://www.goodreads.com/book/show/20443207-the-winner-s-crime", "http://www.goodreads.com/book/show/20443235-the-winner-s-kiss", "http://www.goodreads.com/book/show/2850734-the-cabinet-of-wonders", "http://www.goodreads.com/book/show/10356760-the-shadow-society", "http://www.goodreads.com/book/show/20345368-bridge-of-snow"]}