{"ratings": 214, "userreviews": [{"userName": "Teresa", "userReviewDate": "Jan 10, 2013", "userURL": "http://www.goodreads.com/user/show/575185-teresa", "userReview": "I read a lot of post-apocalyptic books, and generally find little variation in the stories themselves. Sure, the details are different- from the precipitating events to the daily struggles- but for the most part they're all about what it takes to survive the downfall of society.Obviously, I enjoy these types of stories, or else I wouldn't keep reading them. But, aside from a few examples I can think of, I don't get too invested in the stories because they're usually over in a few hundred pages. I think that's why I'm digging this series- it goes beyond the immediate aftermath and paints a more complete picture of the long-term consequences, both physical and mental. I care about these characters, their struggles and their victories, however large or small. I like that the good guys aren't always good and the bad guys aren't always bad. There are a lot of shades of gray, and that's just...human. I imagine that writing a series like this is a huge undertaking, and it's not perfect, but to me it has been more profound and immersive than the everyday zombie fare."}, {"userName": "Jett Cat", "userReviewDate": "Mar 20, 2013", "userURL": "http://www.goodreads.com/user/show/18277934-jett-cat", "userReview": "Loved it, burned through seriesStumbled accross this blog style story of zombie survival and was hooked! This account has it all! Zombies, survival, fights, questioning of morality. I suppose what makes this series stand out is 1) the zombies evolve (so not for hard core zombie traditionalists) 2) the descriptions of the adaptations the survivors have to make to be safe and to eat 3)the personalized feel of all posters (self doubt, disagreements with eachother over structure of the compound, dealing with outsiders, learning to fight) 4) several groups that are well described including the mauraders, and bad guys in later booksThese are just some of the things I really. It is a really immersive story, on occasion you want to rush to the compound/Haven and help them survive the next problem. The characters are just normal people in crazy circumstances, attempting to do the right thing and occasionaly failing miserably. But they persevere, and I keep reading."}, {"userName": "Jo Cochrane", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/23915917-jo-cochrane", "userReview": "So I was so into this series that this is the 1st book I actually paid money for! (the first 3 came as a free deal!)But I was so involved with the author, the story and the characters that I just couldn't not continue to read!The story just gets better portraying the last of the human race as survivors, surviving the best they can for good and bad! The heros aren't always heroic and the villains aren't always nasty! Great writing in a genre that has become a little bit stale! And yes.....I have paid for the entire series now!"}, {"userName": "Lucas Darathy", "userReviewDate": "Aug 08, 2015", "userURL": "http://www.goodreads.com/user/show/27597430-lucas-darathy", "userReview": "It was okay. Similarly to the second book, I feel like this one dragged too much. I still want to read the next one, but I don't necessarily feel all that motivated. I guess this book could've been better, I almost gave it a two."}, {"userName": "Katherine", "userReviewDate": "Mar 29, 2013", "userURL": "http://www.goodreads.com/user/show/18115915-katherine", "userReview": "Love all the books in the series so far, i just can't get enough of it, and i can't wait for the next book. :DIt's really existing and I just love that the book was made as a blog styled."}, {"userName": "Rebecca Trotter", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/13741340-rebecca-trotter", "userReview": "Was Treesong a member of the council that was thrown out?"}], "description": "In the latter half of the second year after The Fall, mankind is beginning to grow once again. The survivors in Frankfort, Kentucky have battled the undead, thrown off attacks from human oppressors, and finally managed to achieve something like peace. Keeping the tenuous alliances and friendships with other distant settlements strong has become vitally important. Though many colonies of living people have been created from the ashes of civilization, the land between is deadly. In this volume, travel along dangerous roads to new locations, meet others who have made their stand against the end of the world. See an America destroyed by chaos, but populated with a people defiant in the face of the end of all they knew.", "title": "The Wild Country\n      \n          (Living with the Dead #4)", "url": "https://www.goodreads.com/book/show/13633166-the-wild-country", "average": 4.07, "cover": "https://images.gr-assets.com/books/1344184132l/13633166.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/4288406.Joshua_Guess", "name": "Joshua Guess"}], "type": ["Horror", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/13633166-the-wild-country", "http://www.goodreads.com/book/show/18045372-victim-zero", "http://www.goodreads.com/book/show/19481917-dead-will-rise", "http://www.goodreads.com/book/show/23264174-war-of-the-living", "http://www.goodreads.com/book/show/9644276-with-spring-comes-the-fall", "http://www.goodreads.com/book/show/13186630-the-hungry-land"]}