{"ratings": 1515, "userreviews": [{"userName": "Stacey is Sassy", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/12062194-stacey-is-sassy", "userReview": "DNF at 51%I don't know how the hell I ended up with a clean book on my Kindle (shock and horror) but I thought I'd give it a try. Besides the fact they just slammed the door in my face (yawn) I'm definitely not feeling it. No passion, too much hesitancy and he's about to go running scared. Cutting my losses and moving on.No rating as I did not finish."}, {"userName": "Reyes", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/7115767-reyes", "userReview": "There is a scene in which the MC comes back from a wedding with the love interest and they get into her house and she kicks off her shoes, then they argue, they make up, they make out, then she kicks her shoes off again to lay in a sofa with him, they make out some more, and finally she gets up from the sofa to undress sexily and ends up wearing only her panties and her shoes. I think that says enough 👍🏼🙈"}, {"userName": "Bette Hansen", "userReviewDate": "Aug 27, 2016", "userURL": "http://www.goodreads.com/user/show/11333561-bette-hansen", "userReview": "Loved this story!! It seems that everyone Tricia Patterson knows is getting married. Dreading the upcoming summer wedding season with 6 invites already in hand, Tricia and her best friend Sean agree to attend all of them as a couple. That should help keep everyone from giving them the \"so sad you're still single\" looks! That plan goes up in smoke when Sean is involved in an accident that leaves him hospitalized and out of the country. Luckily for Tricia, Sean's brother Ryan agrees to stand in for Sean for all the weddings. These two spending time together could lead to some really interesting times!!This is a fantastic relaxing read that you don't want to miss. I highly recommend it."}, {"userName": "Mila Rossi", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/32099534-mila-rossi", "userReview": "Great premise, but a little disappointed with the development of the story. Also, wished I knew beforehand that this was clean. The fade-to-black moments were such a bummer. I liked the heroine and thought she made a lot of sense throughout the story. The other characters, not so much. Her best guy friend sounded very much like a girl friend to me, and young to boot. I also was a bit iffy about the romance between the hero/heroine. I knew they'd hook up, but why was a mystery. They didn't seem particularly interested in each other before the hookup. Overall an okay read."}, {"userName": "DJ Sakata", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/18344018-dj-sakata", "userReview": "Favorite Quote:I just need some time… I’m not sure when it stops being what I need and starts being cowardly.My Review:Tricia and Sean had been best friends since high school, and when their circle of friends all seemed to be getting married and planning their weddings (six in one summer), the two unmarried friends established a pact to attend the wedding together and pretend to be a couple to fend off the inevitable matchmaking. But Sean couldn’t make it and asked his older brother to step in and take his place as her date for the summer. Things got steamy, but what happens when the wedding season is over, neither one is good at communicating their feelings. The Wedding Season was a quick and easy to follow read, a nice diversion for a lazy afternoon, and has a sweet ending, of course, all Samantha Chase stories do."}, {"userName": "Stephanie", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/9958229-stephanie", "userReview": "This was a quick, ok read. I liked the relationship between Ryan and Tricia, but the \"fake relationship\" aspect of it was very, very short and that kind of frustrated me because it was the main reason I decided to read this one. Ryan's mother drove me insane and I wasn't a big fan of Ryan's brother (and Tricia's best friend) Sean. If you're looking for a quick read with lots of romance then you might enjoy this."}, {"userName": "Karen **Mess**", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/7016906-karen-mess", "userReview": "Bad point: I had to read a wedding theme book for a paranormal book club. Good point: This book was free on Kindle.Bad point: Bad, bad, bad book.Good point: The book was 200 pages. Suffering was relatively short."}, {"userName": "BJ", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/25197075-bj", "userReview": "It had a good plot, nice characters and I liked the author's writing style. I also liked the 2 lead characters but felt the pacing wasn't quite right. I didn't feel as if I understood the H's motivation, we knew he was an insular guy, a workaholic but his story just fell rushed. The h was more fleshed out, and a very likeable person. It was a nice easy read."}, {"userName": "Amy", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/14373119-amy", "userReview": "Ryan and Tricia have known each other for years but little did they know how fate would intervene. This is a sweet love story with some spice and angst to it."}, {"userName": "Maria", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/4723611-maria", "userReview": "Free from Amazon Kindle 30/04/2017"}, {"userName": "Elzhraa Elrayess", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/8047609-elzhraa-elrayess", "userReview": "I wanted a quick fun read, but this was kind of boring, and nothing happens except what is written in the synopsis."}, {"userName": "Janis", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/10061914-janis", "userReview": "What a funny and romantic bookI loved Ryan and Trish love story and Sean too. Highly recommend. This book is a easy read. I finished it quickly."}, {"userName": "Pam ", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/41841114-pam", "userReview": "It seems like everyone Tricia knows is getting married. She's tired of going solo & receiving \"poor Tricia\" looks. Her friend Sean is invited to the same weddings & is tired of everyone wanting to fix him up with their relatives. Sean comes up with the bright idea of them pretending to be a couple & attending the weddings together. You know what they say about best laid plans! Due to circumstances beyond his control, Sean is unable to come home for the summer so he sends his older brother, Ryan. Ms. Chase hits her readers with a story that they all can relate to. \"Always a bridesmaid, never a bride.\" This concept, along with the all-to-common fix ups, is something that the readers can relate to & draws them into the story. The unexpected attraction between Ryan & Tricia and Ryan's confusion as to Tricia & Sean's relationship adds tension & interest. While this is a novella & by nature shorter in length, I was able to form connections with the characters that kept me interested in how the story turns out. Another great story by a terrific author!"}, {"userName": "Michele A.", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/13585241-michele-a", "userReview": "Tricia and Ryan have known each other for years, but not very well. Ryan is 4 years old than his brother Sean and his best friend, Tricia. When Sean is unable to attend all of the weddings both Tricia and he agreed to attend during the summer season, he convinces Ryan to step in his place. Ryan and Tricia are attracted to each other. As they get to know each other they find themselves more and more drawn to one another. They even alternate weekends to spend time together during a lull in the weddings they are scheduled to attend. Tricia and Ryan both get suspicious that Sean made a comment about the possibility of the two of them becoming a couple and maybe their wedding would be the following season. When suspicions are confirmed, Ryan reacts badly and Tricia is left reeling from the whole thing. Ryan realizes that he overreacted and tries to win Tricia back. His mother was pretty meddling this whole book but was keeping some big secrets from her family. When it all comes out and every secret is revealed all of them begin healing. The ending was nice and seemed to set up the next book in this series."}, {"userName": "Maree Repa", "userReviewDate": "Apr 28, 2016", "userURL": "http://www.goodreads.com/user/show/7415923-maree-repa", "userReview": "Soon after meeting Tricia Patterson, her parents broke up, no longer living together. So no both Tricia and her Mother moved and settled in Long Island. When starting. School she met Sean Patterson. They were both lucky as they both lived close by. And with time both become best buddies.Now looking forward of 15 years poor Tricia is still single. She wasn't happy about it as being invited to so many wedding she would want a partner. Luckily she had known Sean was also invited he agreed to go with her. Knowing Sean wasn't available as he wasn't in America his older brother was there able to go along with her.This was such an amazing romance. I couldn't put it down once . Thank you Samantha Chase I just loved it so much!!!!* I recommend this book to all of my friends!!"}, {"userName": "Heather andrews", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/7787656-heather-andrews", "userReview": "Sometimes Ryan just needs to use actions instead of words, “because... this.” He lowered his head and claimed her lips with his. Ryan was kissing her. Really kissing her.\" I liked that Ryan could admit when he had a problem especially when his hands can't stay off his woman, “Sweetheart, where you’re concerned, I definitely don’t have patience...\" I really liked this book."}, {"userName": "Ray", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/55949265-ray", "userReview": "Oh dear lord.The first thought I had when I read the synopsis of this book was \"lol this is ridiculous\" But it was 4 am and I couldn't sleep so naturally, I went for it.And guess what? It really was bloody ridiculous.So basically this book is about this girl Tricia who around 28? 30? 75? (I have no damned clue) and who's still single, and since summer is approaching, she gets a gazillion wedding invitations, she doesn't wanna go there solo because people would start pitying her and crap (Yeah because getting married is the ultimate goal in life and if you can't do that by 27 it's game over for you *cue eyeroll*). Then, her best friend, Sean, says that they should go together and pretend to be a couple.Anywaaaaaaaaaays, before the wedding season starts Sean gets hurt and whatnot and can't even go back to the states for the meantime so he sends his older brother Ryan so sub for him.One thing leads to another and \nyou guessed it right\n Ryan and Tricia sleep together.Oh and the cherry on top? Ryan says that he liked her even before, even though about ten pages ago he did say that he only saw her for about 3 minutes every once in a while, and didn't know the first thing about her, but we're just gonna overlook that since he's hot and it's better to make him seem like the hopeless romantic type.At one of those weddings, and before Ryan and Tricia could DTR, they Skype with Sean, and he asks them -his brother and best friend that he knows damn well are pretending for the sake of the public eye- when their wedding was?I was like, wow real smooth Sean.Then he went on and said that if he's not getting a wedding date, then the least he could get was see them kiss; which by the way Ryan complied with.After that wedding and a lot of sex, it's morning and Ryan is getting all worked up about something. He then decides to go visit his mother and surprise surprise, Sean is there.Turns out the little shit was home for some while now and was enjoying playing matchmaker, and his mom was in on it too.Naturally, Ryan is pissed off, and naturally he lets it out on Tricia and hurts her.A week later he's back to apologize and while she's rejecting him, they get a call from a hospital saying his mom got a heart attack, which turns out to be an anxiety attack because her boyfriend -that no one even knew existed- proposed.Can you imagine that scene though? The guy is on one knee asking her to spend the rest of her life with him and the next thing you know she's on the ground heaving for air XDDDI'm sorry but that's hilarious.Then they go back to their hotel room and they kiss and make up and everything is all rainbows and butterflies.THEN, we have an epilogue with Ryan and Tricia and his mom n her boyfriend preparing for their weddings AND planning to set Sean up with Tricia's cousin, even though both Ryan and Tricia were pissed off when that happened to them.The freaking end. I'm not even sure what I disliked the most about this book; the flat characters, the pointless plot, or the cliche-ness of it all but by the time I got to the end I was frustrated at myself for reading yet another Kobo freebie after saying I was done with them.\nHonorable mentions to: \n- How \"manly\" Ryan is and how perfect he is and all, because it can't be a book without mentioning that.- How Tricia has \"blossomed\" into a gorgeous woman that caught Ryan's eyes after being a small child. I hate to break it to you buddy but that's called growing up and believe it or not, everyone goes through it.I am seriously more than done with these kinda books, they're all the same thing wrapped up in different paper; and what's inside isn't even that good."}, {"userName": "Debbie Hanson", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/12294330-debbie-hanson", "userReview": "The Wedding Season Samantha Chase 4 sweet stars.Sometimes in life all you need is a sweet easy read and The Wedding Season was just that. A sweet, quick, fast glowing read that kept me interested without weighing you down with mass drama. Samantha is good with her wedding stories, and this was no exception. Worth every one of thosev4 stars.When Tricia Patterson moved with her mother to yet another new school, her anxiety was huge. It is never easy walking into a new school, finding new friends and creating a new life, but when Tricia meets Sean Peterson in her 1st class, the pair become inseparable. Fast forwarding to the end of school, and lives with jobs, the still best friends fund themselves elbow deep in wedding invitations. Both still very single, they make the perfect plan to be a couple at each wedding, together they will take on the wedding season, Tricia will just have to wait a few weeks for Sean to return home. But their perfect plans get shot to pieces when Sean is seriously injured in a severe storm. Now his brother, Brian is there to help keep Tricia grounded. Finally getting word that Sean is injured but safe, he talks Brian into stepping into the partner role with Tricia. No particularly happy with the scenario, he sucks it up and spends numerous weekends in his childhood home with a woman who he discovers his feelings aren’t platonic. Touches and dances create a frisson of chemistry neither can deny or ignore.A set up, turns very real when feelings come into play. Giving into those feelings will change everything for Tricia Patterson and Steph, Brian and Sean Peterson. She has played a huge role in their lives and now she finds herself loving what she has with Brian, but shocked and betrayed at the hands of her best friend. Will angry words, and fear ruin what the pair have become, or will Brian realise that young Tricia is now the woman he loves before losing her forever?"}, {"userName": "Annette", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/9938625-annette", "userReview": "As a child, Tricia's family moved many times. When she was in high school, she and her mother moved to a new town in Long Island. At her new school, she met Sean and he became her best friend. It is now 10 years later, and Sean is still her best friend. He is working overseas but plans to be home for the summer. They make a pact to attend six weddings of their friends. That will protect both of them from well meaning friends who want to fix them up with someone “special”. Sean's sense of humor and charm convinces Tricia that it will be fun to fool everyone. They are best friends but they are not romantically involved. Shortly before Sean is expected home, he is injured in a severe storm. With all his broken bones, it will be quite some time before he is able to come home. So, as a substitute, Sean asks his older brother Ryan to be his stand in for the six weddings. Tricia and Ryan know one another, but not very well. To please Sean, they both agree to the new plan.Tricia and Ryan are attracted to one another and things move quickly from there.This is a romance with a small amount of family angst thrown in.Ryan and Tricia are well developed characters. The reader also gets to know something of Sean and his personality. The action is quick moving with little or no wasted words.I enjoyed this quick read, but I would have liked a little more development. Ms Chase has created a quick read with a happy ending for everyone."}, {"userName": "Marjorie", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/69984773-marjorie", "userReview": "Single and relatively happy about it Speech Pathologist (who knew that was a job!) Tricia is dreading the summer. Three wedding invitations already on the mantle and another three have just arrived, just what she needed. Still, her best friend Sean will be back by then and they have made a pact to attend as a couple so that they can both avoid the matchmaking and pitying looks from their loved up friends. It all goes awry when Sean suffers an accident just days before returning home to the States. Luckily for Tricia his older brother, Ryan, steps in to the breach and becomes her plus one - will this lead to true love for both of them?It doesn't sound too bad when you distill it down like that. Unfortunately the execution of both the plot and the characters left me feeling distinctly underwhelmed. I was so glad this was a short tale as I don't think I could have got much further than he 200 pages it purports to be on my eReader. There is no real story arc and it all becomes a bit this happens and then they kiss and then this happens and they become far more intimate, then we have a misunderstanding and they break up but awww they love each other so it doesn't stick. The characters are pretty flimsy so you don't really care about whether or not Tricia will get it together with Ryan, there isn't really any suspense as to whether it is Sean that she really loves.Quick and easy read that passes the time on a commute or when reading time is limited and you have one eye on the clock the whole time. Other than that I really wouldn't bother."}, {"userName": "Roz Curney-Sherod", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/16047694-roz-curney-sherod", "userReview": "\"The Wedding Season\" is part of the series \"Enchanted Bridal\" and the Prequel. I have to admit, I read the first two books out of order without realizing this was a series. There's no problem with that because they can be read as standalones except when you're reading the epilogue. This installment focuses on our heroine Tricia Patterson and our hero Ryan Peterson. Tricia is best friends with Sean, (Ryan's younger brother) since high school. The Plot: Tricia and Sean have six (6) weddings to attend this summer and don't want the pity or matchmaking of their friends but have to attend all. Sean and Trish hatch a plan to pretend they are dating in order to get thru the wedding season but Sean is hurt overseas and asks his brother Ryan to take his place. The romance happened fairly quickly but was covered up by the fact that Ryan and Trish have known each other for as long as her and Sean have been BFF's. I enjoyed this story, it had some erotic moments but didn't go overboard and give us full details each time it happened. The details were more about how this couple eased into getting to know each other and slowly falling in love, I liked both characters. I even liked the secondary characters especially the Mother, \"Steph' even though she's a little self-centered. This book is a good beach read and will keep you engaged in the story, an easy read and give you a good feeling at the end."}, {"userName": "Donna Smith", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/28926367-donna-smith", "userReview": "Matchmaking at its bestTrish and Sean have been friends ever since she walked into a new high school and had the pleasure of sitting down next to him. They have a unique bond that screams best friend. When they both start getting a ton of wedding invitations, they plan to go as each others dates. That way they aren't getting fixed up by anyone with good intentions. When Sean gets hurt at an overseas job, he can't go to any of them. Rather than let Trish get sent to the wolves, he sends in his older brother Ryan instead. Ryan can be antisocial so they are really doing each other a favor. Trish gets a date for all the weddings (and for people to leave her alone) and Ryan gets to work on his social skills outside of work. I really loved these characters. They have such a history together but don't really know each other. This is a best friends brother romance and I loved the twist on that theme."}, {"userName": "Sm", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/25493119-sm", "userReview": "[ she moves into her BFF's mom's house? she doesn't change anything about the place? her BFF goes around helping people around the world? her BFF and his mom set her up with his brother? and not just set-up, but shrouded in unnecessary lies set-up? I mean, even if he was back, he could've convinced her to go to the weddings and he could've guilted his brother into still accompanying her. plus, it seemed a little ridiculous that Ryan, a grown man, and Trish, a grown woman, would've gotten that upset over something kinda trivial and done with the best intentions  (hide spoiler)]"}, {"userName": "Sue", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/915334-sue", "userReview": "I really enjoyed this sweet story about friends to lovers Ryan and Tricia. Tricia has been best friends with Sean since she moved to the area and wedding season is upon them. In order to avoid their well meaning friends who keep trying to connect them to others so they can also have their happily ever after, they come up with a plan to be \"together\" for all of the weddings they feel they must attend. However, unexpected circumstances throw their plan out the window but Sean has a plan to still protect Tricia during this trying wedding season. Enter Ryan, Sean's older brother. He absolutely doesn't want to go to these events but for Sean he will. Never did either of them expect they might actually fall for each other."}, {"userName": "Lisa", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/74111835-lisa", "userReview": "Feel filled, fun, sexy readThe Wedding Season is a fun, feisty, steamy read that also manages to be full of feels. I was sucked in to this story as soon as I read the prologue, which is actually a true prologue and not just an excerpt from the book.Ryan and Tricia have some pretty serious chemistry going on. Combine that with quirky meddling family, a little family drama, as well as well developed characters and you have a book that is hard to put down.I loved the way Tricia and Ryan's story developed and unfolded. The heat between them is intense and made for some pretty steamy weekend visits with each other. The feels and warm fuzzies that result make this a book I have no problem recommending."}, {"userName": "Melissa", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/5210578-melissa", "userReview": "Can you imagine having 6 weddings to go to as a single woman?  You would be expected to catch the Bride's bouquet.  You would get the \"when are you next?\"  I would had done what Tricia did- have a pretend boyfriend.Tricia is the best friend of Sean, but he was in a bad accident and can not be her date for all these weddings.  Sean asks his brother, Ryan, to step in for him as a favor to him.This is the kind of book I would want to read at the beside or a pool.  Romantic.  Written well.  Great characters that are real.  I laughed, cried, and a lot more.☆☆☆☆☆I give this book 5 out of 5 stars.Recommend this book? Yes! Author? Yes!Read more from this author? Yes!Happy Reading!Melissa"}, {"userName": "June", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/9873203-june", "userReview": "Tricia and Sean have been best friends for years and had plans to attend a multitude of weddings. They were to attend as a couple to chase off the matchmakers who do nothing but try to set them up with someones cousin or such. Unfortunately, Sean can't make it, so he sends his brother Ryan to help out. Ryan was already gone from home when Tricia moved to town so she doesn't know him very well. But that is about to change. Ryan likes Tricia but is afraid to step on toes if Sean has a thing for her. Things are going to get complicated. Throw in a few lies, a handful of surprises, and some intense moments when they are alone. Clean language, but there were sexual situations. Not explicit though. Pretty typical Samantha Chase."}, {"userName": "pamela d bryant", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/27730634-pamela-d-bryant", "userReview": "Alright!I chose this rating because this is an alright book. The characters were very different. I like the idea of a young man's brother Brian and his mother. Trying to get him and his best friend together. And it turned out his best friend , she was interested in Sean she was just a little afraid to show it when she was younger. And I was saying that Ryan got hurt on his job. But anyway everything turned out alright. The boys mom made her a companion. Sean found his ladylove. And Ryan finally agreed to work with his brother."}, {"userName": "MJ", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/8341098-mj", "userReview": "Woops, hadn't realised I've already read a couple of this authors books and hated them! If I had, I probably would have skipped it. Anyway, this one wasn't too bad. Cute idea, and I liked the characters for the most part (which after having a look at my other reviews is a HUGE deal!). The h is a little weakish for my personal pref, (I like kickass chicks ;), and the story is fairly top level and brushes over a lot of scenes rather than really getting into them, but it still works. It's an easy clean read."}, {"userName": "Linda", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/21737889-linda", "userReview": "Samantha Chase's novella, The Wedding Season, is a fun romantic story. Tricia Patterson has been invited to six weddings throughout the summer season. Her long time best friend, Sean, had planned on being her date until he was injured and unable to go. Sean's older brother, Ryan, fills in and serves as her fake boyfriend. After spending time together, Tricia and Ryan don't have to pretend to be a couple anymore. This is an enjoyable one sitting read! I look forward to reading the Enchanted Bridal series of books."}], "description": "There were three guarantees in Tricia Patterson's life: 1. Her friendship with Sean Peterson was rock solid 2. She had a career that she absolutely adored 3. This summer was going to be the death of her With the proverbial \"Always a Bridesmaid and Never a Bride\" becoming her new mantra, Tricia didn't know how she was going to survive this year's round of weddings. Six of them this summer alone! In an attempt to ward off the pity-party, her best friend Sean gives her the perfect solution to help her get through - he'll pretend to be her boyfriend. While not certain that was going to be of any help, Tricia's knows it also won't hurt. When circumstances beyond Sean's control keep him from coming home to Tricia's aid, he sends his brother Ryan in his place. Four years older than his brother and his best friend, Ryan isn't sure why these weddings are such a big deal. He's also not sure of what the exact nature is of this relationship between Sean and Tricia. And that's becoming a big problem because the more time he spends with Tricia, the more he realizes that she's the one he wants to plan a wedding with.*This is a 40,000 word stand-alone novella*", "title": "The Wedding Season\n      \n          (Enchanted Bridal #1)", "url": "http://www.goodreads.com/book/show/25793507-the-wedding-season", "average": 3.82, "cover": "https://images.gr-assets.com/books/1438619559l/25793507.jpg", "reviews": 135, "authors": [{"url": "https://www.goodreads.com/author/show/1250276.Samantha_Chase", "name": "Samantha Chase"}], "type": ["Romance", "Romance", "Contemporary", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25793507-the-wedding-season", "http://www.goodreads.com/book/show/40236416-the-wedding-season", "http://www.goodreads.com/book/show/17887034-wait-for-me", "http://www.goodreads.com/book/show/18052392-trust-in-me", "http://www.goodreads.com/book/show/18340090-stay-with-me", "http://www.goodreads.com/book/show/31311466-stranded", "http://www.goodreads.com/book/show/16193897-the-christmas-cottage"]}