{"ratings": 17427, "userreviews": [{"userName": "ياسمين ثابت", "userReviewDate": "Feb 12, 2014", "userURL": "http://www.goodreads.com/user/show/9696310", "userReview": "تصميمي لغلاف الرواية:لماذا لا تدرس مثل هذه الرواية في مناهجنا؟لماذا لا يضعونها بدلا من القصص التافهة التي يحشون عقولنا بها؟احب ان اضع هذه الرواية في عين كل واحد عنده من الوقاحة مايكفي ليفتح فمه ويقول الفلسطنيين باعوا ارضهم لليهود...الفلسطنيين شعب لا يستحق....احب احطها في عينه واقوله اتكسف على دمك وانسانيتك ورجولتك....اقراها عشان تعرف اننا احنا كعرب كمسلمين كلنا...بلا استثناء...شاركنا في هذه المهزلة اللا انسانية بضعفنا واستكانتنا وخوفنا على مصالحنا وانفسنا...شاركنا في ألم ملايين وقتل ملايين...كم اشعر بالخزياحب ان اضع هذه الرواية في عين كل من تسول له نفسه ان يصور اسرائيل كحليف استراتيجي ويصور الشعب الفلسطيني ارهابي ....اقرأوا هذه الرواية لتخجلوا من انفسكم بل لتبصقوا عليها.بعد المقدمة الغاضبة المتألمة دي ارجع اهدى شوية واتكلم عن الرواية الملحمية:في 460 صفحة....تحكي رضوى عاشور...عن رقية وحياتها من طفولتها في قرية الطنطورية اي من 1948 وحتى صارت جدة .....تلك الفتاة التي...لسة ادري ما ان كانت سعيدة الحظ ام تعيسة....التي بدأت حياتها برؤية ابيها واخوتها مقتولين مكومين جثثهم فوق بعض في مذبحة قريتها الطنطورية....مرت بكل انواع المذابح صبرا وشاتيلا وغيرها...مرورا بالقصف والحرب الاهلية بلبنان لأنها هربت وتزوجت وانجبت وعاشت هناكمرورا بازمة الفلسطنيين في لبنانمرورا بكل الحروب اللي تتخيلها ولا تتخيلها والقصف والمذابح وخسارة المعارف الواحد تلو الآخركيف يعيش الانسان وهو يشعر ان من يعاشرهم قد يفقدهم في اي لحظة تحت اي قصف مثل ما يخاف الكاتب وهو يضع اوراقه امام الريح؟لا يمككني ان اتخيل للحظة كيف يكون مثل هذا الشعور...نحن هنا لا نتحدث عن فقدان شخص نحبه ولا فقدان وطن ولا فقدان انسانية ولا فقدان هوية فقط....نحن نتحدث عن فقدان الحياة...كاملة..ونحن وياللاسف احياءاكثر مشهد حاضر في هذه الرواية واكثر مشهد لمسني هو....حين بدأت المذبحة في القرية هربت جميع الاسر من بيوتهم وياللعجب اغلقوها بالمفاتيح!...واخذوا معهم مفاتيحهم....وقامت كل سيدة بوضع مفتاح دارها في سلسلة تعلقها في رقبتها ولا تفارقها حتى وهي تستحم!...فعلت هذا والدة رقية بطلة الرواية حتى ماتتثم ارتدته رقية من بعدهاثم يأتي مشهد النهاية لتضعه في رقبة حفيدها رقية الصغيرة!لديهم امل عجيب انهم سيعودون الى ديارهم ويجدون المفتاح يصلح لفتح باب الدار!!!المستغرب اني انا نفسي طوال قرائتي للرواية كنت انتظر ان تعود وتفتح باب دارها بالمفتاح المعلق برقبتها...لسة ادري اهي سذاجة مني وانا اعلم اساسا بحقيقة ما حصل....ام انه اندماج تام بالحكاية....لذا صممت الغلاف ليكون بهذا الشكل.اكثر الشخصيات التي احببتها هو زوجها امين ....ربما كان رسم شخصية هذا الرجل هو الاكثر اتقانا على الاطلاق في الرواية....هالتني جدا نهايتهلكني افتقدت شعورا ما شعرته في رواية ثلاثية غرناطةتعاطف وحب تام للابطال بلا استثناء وشعور كامل بهم.....واعتقد ان السبب في هذه الرواية ان الاحداث التاريخية لكثرتها ورغبة رضوى عاشور في تصوريها ونقلها كاملة جعلها رواية اخبارية مركزة على الاحداث اكثر منها شخوص الرواية ومشاعرهم.....حقا لا تكفي 500 ولا ححتى 10000 صفحة لتصف كل حدث على حدى في هذه الروايةوده مادخلنيش كاملة في الحالة وفي بعض الاحداث تمنيت لو انها لم تذكرها لانها بدت مكررة....مهما قرأت مهما تأثرت مهما اندمجت....مهما تخيلت او حاولت حتى....لن يصل لعمق مثل هذه الفجيعة وهذه المأساة...كيف يعيش كل فلسطيني ويولد وفي صدره هذه الفجائع متراكمة؟! حقا لست ادري...لا استطيع ان اتخيلفلسطين جرح وسيظل ينزف- ياطنطوريِّـة بحرك عجـايب .. ياريت ينوبنـيمن الحبّ نايب تحدِفني موجـةعلى صدر موجـة و البحر هوجـةو الصّيـد مطايب.أغسـل هدومي و انشر همومـيعلى شمسه طالعةو أنِا فيها دايـب! *"}, {"userName": "ALEF Bookstores", "userReviewDate": "Aug 22, 2010", "userURL": "http://www.goodreads.com/user/show/3455434-alef-bookstores", "userReview": "Eman Elesely رواية الطنطورية لرضوى عاشورليست رواية رائعة فقط بل شهادة على تاريخ ملئ بالمأسى والمعاناةتاريخ اناس ماتوا ألف مرة ولكن الحياة بداخلهم إنتصرت بالرغم من كل شئ...الحياة..هي البطل الحقيقي في رواية الطنطوريةمن الصفحة الأولى تحملك رضوى عاشور إلى أرض لم تطأها قدميك ولا تملك ذلك هى أرض الطنطورة فى فلسطين المحتلة وتروى بلسان رقية بطلة الرواية البالغة من العمر 13 عاما حينهاتحكي تفاصيل الحياة اليومية على أرض امنه لاتعرف ولا تتخيل ما ينتظرها تحكي حكاية شجر اللوز و شجر الزيتون تحكي عن البحر ورائحته وتحكي عن الجيران وعن الخالة والعم والخال وام جميل زوجة الخال ثم تأخذك فجاة وبإنسيابية إلى قلب النكبة فترى نفسك وأنت تللم أشياءك وتودع أرضك ودارك تتركه وكل ما تحمله معك هو ( نصية جبنة )تخطو فوق المأسى فتركض ركضا لتهرب لحياة جديدة مختلفة وصعبة ولكنها جديدة وحياةتمر بك فوق ستون عاما من معاناة الشعب الفلسطيني فتشعر وكأنك كنت هناك .. أعود فأقرأ مرة أخرى لا أصدق أنى مررت بكل تلك الكوارث بكل هذه البساطة كما هي طبيعة الحياةأرى أن الهزيمة هي الموت الحقيقي وربما كان الموت حياةرواية الطنطورية هى تخليد لحكاية أرض لا زالت تسأل عن أصحابها"}, {"userName": "Walid Elalfy", "userReviewDate": "Feb 04, 2011", "userURL": "http://www.goodreads.com/user/show/4841871-walid-elalfy", "userReview": "ظللت عمرى اردد اكاذيب تسربت الى من مجالس الاقرباء ومن كلام الناس وقصاصات الصحف ان الفلسطنيين هم من باعوا ارضهم وهم من تسببوا فى مأساتهم وهم من سوف يرفضوا العوده اذا جاءت وللاسف كنت من المرددين لتلك الاكاذيب . جاءت رضوى عاشور لتلطمنا على وجوهنا لنقف ونتذكر يوميات المأساه من عام 36 وحتى يومنا هذا . لم تكن رضوى عاشور رحيمه بنا ونحن نقرأ عن الانتكاسات تلو الاخرى وما بين حرب وحرب والا وهناك مجزره . ان تحمل فى عنقك مفتاح قديم ثقيل صدىء مربوط فى حبل وعندما ينقطع تستبدل بحبل جديد حول عنقك على امل العوده , وكأنه صك الرق لحريتك وانك مطالب بحمل تلك الامانه وان قل وتلاشى الامل ! من اين استمدت كل نساء فلسطين لتلك القوه والتى ينىء بها اعتى الرجال ؟ كيف لرقيه الطنطوريه ان تحمل مأساتها لوحدها وتظل بهذا الثبات ؟ كيف لطفله ان تتحمل رائحه الموت التى لم تختفى يوم فى حياتها ..صفحات مليئه بالحقيقه المأساه لم تحمل البهجه على الاطلاق الا فى مشهد فرح حسن وفاطمه ولكنها حملت لنا الامل بوجود ناجى العلى الجديد وحمل رقيه الطفله الرضيعه لمفتاح بيت طنطوره .. رضوى عاشور كانت شاهده على الانتكاسه فى 48 وشاهده على مجازر مستمره يتخللها هزائم دائمه وخذلان متواصل ومقبره جماعيه تحولت الى ملعب لكره السله !!"}, {"userName": "نبال قندس", "userReviewDate": "Feb 26, 2013", "userURL": "http://www.goodreads.com/user/show/7751712", "userReview": "أتسائل بعد قراءة هذه التحفة الفنيةأيعقل أن رضوى مصرية ؟ تبدو كأنها فلسطينية وكأنها عاشت كل لحظة من اللحظات قبل أن تكتب هذا العمل الأبداعي"}, {"userName": "بثينة العيسى", "userReviewDate": "May 15, 2011", "userURL": "http://www.goodreads.com/user/show/2849038", "userReview": "رضوى جادة فيما تكتب، وهي من ذلك الصنف النادر الذي يزاوج بين الكتابة الجمالية والمشروع المعرفي، تتقصى الحقائق وتنخرط فيها وجدانياً وتتجرد لتكتب. أحببتها في أطياف وثلاثية غرناطة ولكنها في الطنطورية \"غير\" رضوى تكن احتراما عميقا جدا لقارئها فلا تقدم له عمل أقل من ناضج. أحبها"}, {"userName": "Muhammad Nusair", "userReviewDate": "Jun 07, 2012", "userURL": "http://www.goodreads.com/user/show/8451753-muhammad-nusair", "userReview": "أقول دائماً أن الفرق بين النكبة والنكسة باء وسين .. بباء النكبة باعوا الوطن وبسين النكسة سرقوا الوطن .. وبعد أن قرأت الطنطورية وعشت معهم في الطنطورة وصيدا وبيروت قبل وبعد الحرب وأبو ظبي والإسكندرية, أدركت أن ما بين النكبة والنكسة أعمق بكثير من باء وسين .. بين النكبة والنكسة أمل وانكسار ودموع وأشواق ومفتاح بيت عتيق مُعلق بحبل حول عنق ختياريّة تنتظر العودة لتجد كل شئ كما تركته, تنكات الزيتون ودجاجاتها التي ترمح في صحن الدار وفرن تلتهب نيرانه شوقاً للعجين وبحر الطنطورة وسمر الرجال ونقاشهم في دار المختار .. بين النكبة والنكسة حياة وموت وبيوت تشتاق لأصحابها ربما أكثر مما يشتاقون إليها"}, {"userName": "لونا", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/6500234", "userReview": "كم أحسست بالخجل وأنا أقرأها، وكأن الرواية تعاتبني لأنني تناسيت فلسطين. فلسطين التي منذ الصراعات بين فتح وحماس جعلتني أشعر بالغضب على كل فلسطيني يتبعهم وتناسى من هو العدو الحقيقي وسخَّف القضية .. .. وكأنها تتذكرني أن هناك أناس كثيرين مثل رقية وعائلتها ليس لهم علاقة بهذا الصراع والقضية الحقيقة مازالت حيَّة في قلوبهم ويوماً ما ستعود الأرض بِهمَّتِهم وصدق نيتهم رائعة الرواية بكل المقاييس، وأنا من الأشخاص الذين إن أحبو رواية أتمنى أن \"لا\" أراها على شاشة السينما أو التلفزيون، ولكني في هذه الرواية أتمنى من كل قلبي رؤيتها يوما ما تتحول إلى فيلم سينمائي .... أنصح الجميع بقرأتها"}, {"userName": "Ahmed Hoza", "userReviewDate": "May 13, 2012", "userURL": "http://www.goodreads.com/user/show/8701745-ahmed-hoza", "userReview": "!هذه الرواية ستغيركفي صفحاتها الأولى تغرسك الرواية في عمق القرية الفلسطينية وبين أهلها... تضمك أم بسيطة إلى صدرها، وتكاد أيدي الأطفال تمسك بيديك حين يلعبون بين الصفحات... تتذوق طعام أهل القرية، وتشاركهم حفل زواج.... تتذوق رائحة البحر، وألوان الأشجار وعبير البرتقال والياسمين والزهور البرية التي تملأ البر والجزر الصغيرة المتناثرة أمام ساحل القرية، تشهد تتابع الفصول وتفتح زهور اللوز والتين والتفاح... وتشهد أول الثمرات... ثم تأخذ الكاتبة بيدك وتقود خطواتك حول القرية وبين طرقها لتصبح خبيراً بجغرافية ذاكرة الوطن الذي سيُسلب منك بعد صفحات قليلة....ء!أنهيت الرواية ولم أشبع منها بعدأكره حقاً حين تنتهي الكتب والروايات وأنا في أوج استغراقي واستمتاعي بها...رقيةالطنطورية، بطلتنا وراوية الحكاية، سلبت أرضها منها في ليلة المجزرة... فقدت والدها واخويها الاثنين الذكور... وأكثر من مائتين من الرجال الذين قضوا نحبهم إما أثناء القاتل، أو تم إعدامهم بعد أسرهم..... هربت رقيّة مع من تبقى من اهلها إلى الخليل فعمّان فصيدا فبيروت فأبو ظبي فالاسكندريّة، فبوابة فاطمة في الجنوب اللبناني... حيث يدور المشهد الاخيرورقية امرأة حقيقية للغاية... انفعالاتها، وحديثها... وكتابتها ومشاعرها كلها حقيقية للغاية... اسلوب رضوى عاشور جاء جذلاً بسيطاً بعيداً كل البعد عن التكلف، عظيماً في بساطته... قوياً في تأثيره. رضوى لا تعطيك تأكيدًا على أهميّتك أنت فحسب، بل تؤكّد على أهميّة المادة المقروءة كذلك، يستحيل أن تقرأ لها منشكحًا، تقرأ وأنت منشد، متجهِّز في أيّ لحظة للغناء وإنشاد المووايل الفلسطينية الشعبية... تدخلك إلى قلب البيت الفلسطيني، ترى وتسمع وتتعايش... لتعلم كيف يعيش من يموتون على الفضائيات، وماذا يفعلون حين لا تصورهم عدسات الصحفين ولا تنقل التقارير الصحفية أخبارهم.... تعلمك كيف ولماذا يكون الفلسطيني، كيف يعيش في المنفى، كيف يكون عاملاً في الخليج... كيف يسب الدين في وسط الشارع وكيف يصلي التراويح في رمضان.... كيف يحب أولاده وزوجته... كيف يولد ويعيش ويبتسم في وجه الموت والحياة..هذه الرواية غيرتني حقاًجعلتني أبصر جزئاً منسياً، الجميع يتحدث عن الضفة وغزة، ولا أحد يتحدث عن اللاجئين، مع أنهم أصل الحكايةكيف تنتهي الرواية؟ رضوى لا تنحاز إلى إتفاقايات السلام، ولا ترسم خارطة للطريق.... رضوى تغني، وشخصياتها تغني، وفتى من <<عين الحلوة>> اسمه ناجي، يرسم المشهد بالقلم الرصاص والفحم.... يرسم طفلة رضيعة تقلدها جدتها مفتاح الدار، بعد أن يحملها والدها من فوق السلك الشائك... يرسم حشوداً تغني على جانبي البلاد.تنحاز رضوى للانتصار، للمقاومة، للفرح... وللأرز المتناثر فوق جباه الفدائين، وتنحاز رضوى إلى الإنسان الفلسطيني الحر ، وكذا تفعل رقية.... أما الرواية فتنحاز، لكنها لا تنتهي!!ء"}, {"userName": "عبدالعزيز المحيني", "userReviewDate": "Nov 17, 2015", "userURL": "http://www.goodreads.com/user/show/48461767", "userReview": "فلترقد روحك بسلام يا رضوى.. يا صاحبة الطنطورية.. .. أفضل رواية كتبت بالعربية.. أفضل رواية للعذاب العربي.. للخيانات العربية.. للصراع العربي العربي..آه من الألم في هذه الرواية... وآهات أكثر من العروبة.بلغتها الرفيعة ترسم الدكتورة رضوى شكل سكين الجرح الفلسطيني ولوعة الدم النازف منه، تقنيات سردية عالية المستوى، أسلوب أدبي جاذب، شخصيات واضحة وطبيعية،وقادرة على أن تثير في القارئ المشاعر المبتغاة من الحدث. توصية كبيرة."}, {"userName": "إبراهيم   عادل ", "userReviewDate": "Dec 04, 2010", "userURL": "http://www.goodreads.com/user/show/1908391", "userReview": "لم أكن أريد لهذه الرواية أن تنتهي!  ولا أعلم كيف تم هذا أيضًا ... كنت سعيدًا بوجود \"رقية\" قريبًا منَّا في الإسكندرية، أراقبها وهي تعتني ب\"جنينتها\" الصغيرة، تسقي هذه وتضيف سمادًا لتلك، وتراقب ابنتها حبيبتي \"مريم\" وهذ تدرس وتـلبلد لأمهـا،  ما الذي حملهم فجأة إلى جنوب لبنان، لماذا عادوا إلى هناك؟! وكيف انسحب الجيش الإسرائيلي من أجل رقية خصيصًا ليبعهم عني هكذا فجأة !  مرت \"رقية\" على القاهرة كـ \"طيف\" ... ومكثت في أبو ظبي أيامًا . وهاهي تعود مرة أخرى إلى صيدا، مع ناجي!  ـــــــــــــــــــــــــــــــــــــــــرواية رااائعة بـحق، جعلتني أعيش مع \"رقية\" وعائلتها يومًا بيوم ومكانًا بمكان! . لا أعرف كيف أعبِّر لرضوى عاشور عن امتناني بهذا العمل الرائع الراقي، ولكن هكذا هي دائمًا . تلهو مع الألم والأمل والفرح والحزن  لتصوِّر لنـا تفاصيل الحيـاة . شكرًا لرضوى عـاشور على كل هذه الروعة  ... .. وشكرًا لصديقتي رضوى داود ، أيضًا  ـــــــــــــــــــــــــــــــــــ استعدتها مرة أخرى بعد 15 يومًا  واستمتعت مرة أخرى . وانتهت المهمة  وكتبت عنها ما نشرته مجلة الرواية هنـــا http://www.alrewaia.com/show.php?p=po..."}, {"userName": "Ahmed Ibrahim", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/35008106-ahmed-ibrahim", "userReview": "بعد فتره طويلة انتهت الطنطورية :/ نعم كنت اتفنن فى عدم انهائها ! وفى النهايه سألت نفسىهل انتهت ؟ نعم انتهت الروايه ولكن الطنطورة ما زالت قائمه , انتهت الروايه وما زالت فلسطين قائمه , انتهت الروايه وما زال التخاذل العربى مع فلسطين قائم نعم لم اكن اعرف ما هى الطنطورة ولم اسمع عنها كما غيرها من بلاد فلسطين لكنى سحرت بها احببت هذه البلد جداً“ يا طنطوريةبحرك عجايب..ياريت ينوبنىمن الحب نايب..تحدفنى موجة ..على صدر موجة...والبحر هوجةوالصيد مطايب.أغسل هدومىوأنشر همومىعلى شمسه طالعةوانا فيها دايب\"\"يا طنطوريةيا حيفاويةعلى سن باسمعلى ضحكةهالهالبحر شباكومشربيه ...وانت الأميرةع الدنيا طاله.قصيده لعم احمد فؤاد نجم - رحمه الله مع بعض تعديلات قامت بها رضوى  تعلقت بالطنطورية ( رقية ) . المرأه الذى شهدت كل المآسِ من احتلال فلسطين وسقوط الطنطورة ومذبحه الطنطورة اللتى فقدت فيها ابيها واخويها . -----------مذبحه الطنطورة ------ احتلت القرية بعد عدة ساعات من مقاومة أهالي البلدة لقوات الاحتلال الإسرائيلي, وفي ساعات الصباح الباكر كانت القرية كلها قد سقطت في يد جيش الاحتلال، وانهمك الجنود الإسرائيليون لعدة ساعات في مطاردة دموية شرسة لرجال بالغين بهدف قتلهم. في البداية أطلقوا النار عليهم في كل مكان صادفوهم فيه في البيوت في الساحات وحتى في الشوارع. وبعد ذلك أخذوا يطلقون النار بصورة مركزة في مقبرة القرية. وقد خلفت المذبحة أكثر من 90 قتيلا دفنوا في حفرة كبيرة وفي المقبرة التي دفنت فيها جثث القتلى من أهالي القرية في قبر جماعي, أقيمت لاحقا ساحة لوقوف السيارات كمرفق لشاطئ \"دور\" على البحر المتوسط جنوبي حيفا. ---------------------------- رجال المقاومه الفلسطينيه وجهودهم وفدائيتهم فى سبيل وطنهم من 48 الى يومنا هذا رقية اللتى هجرت ارضها كما هو حال اغلبية الفلسطنيين وتغربوا فى الاردن ولبنان وسوريا ومصر والدول العربيه الاخرىلا يحتاج الأمر لكثير من الجهد لإثبات أن اللاجئين الفلسطينيين أتعس اللاجئين في العالم على مر التاريخ، ولكن رضوى وضحت ان اللاجئين الفلسطينيين في لبنان هم أتعس اللاجئين الفلسطينيين حظاهل تعرب مذبحه صبرا وشاتيلا ؟  مذبحة نفذت في مخيمي صبرا وشاتيلا لللاجئين الفلسطينيين 1982هل تعرف من قام بها ؟  حزب الكتائب اللبناني وجيش لبنان الجنوبي والجيش الإسرائيليهل تعرف كم عدد القتلى ؟ حاول ان تقدر ؟ تتراوح التقديرات بين 750 و3500 قتيل من الرجال والأطفال والنساء والشيوخ المدنيين العزل من السلاح أغلبيتهم من الفلسطينيين ولكن من بينهم لبنانيين أيضاوفقدت رقيه زوجها فى هذه المذبحه ايضاً -------------- تسرد رضوى واقع عاصرته فلسطين والفلسطينيين بالطبع الشخصيات تخيليه كما ذكرت  نجحت فى رسم شخصياتها واسلوب اكثر من رائع احب جداً والسؤال الاخير هل تستطيع ان تقول ان رضوى مصريه وليست فلسطينيه كم انتى رائعه يا رضوى - رحمك الله وتذكر دائماً \" لا وحشة فى قبر رضوى \""}, {"userName": "Mohammed-Makram", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/15385951-mohammed-makram", "userReview": "الوجع الفلسطيني متجسدا في كل حرف من حروف الرواية   سلك شائك و حشد من بشر على جانبيه. تتصدر الرسمة امرأة بثوب فلاحي ترفع ذراعيها عاليا. تحمل طفلة في الأقمطة على وشك أن تحملها لشاب في الجانب المقابل من السلك يرفع يديه باتجاه الطفلة. على صدر الطفلة مفتاح كبير عتيق يغطي ثلثي جسمها. الخلق على جانبي السلك كلهم طوال. خطوط فارعة تميل خفيفا على كل جانب في اتجاه الجانب الأخر كأنها تلتقي في تعريشة توشك أن تكون قوسا."}, {"userName": "Sally Meshref", "userReviewDate": "Dec 15, 2010", "userURL": "http://www.goodreads.com/user/show/2915160-sally-meshref", "userReview": "الكتاب لاحد دلوقتى جميل جدا \"\"بس حزين شوية وكئيب والحالة مش ناقصة دا كان رائى فى الاول بس بعد كدا الحياة اتغيرت معايا خالص الكتاب دا من الكتب  \"life changing books\"  مستحيل انك تفضل زى ما انت بعد الكتاب دا مستحيل تبقى رؤيتك و احساسك بالاحداث بتاريخك بنفس الطريقة كل حاجه بتتغيروعلى فكره مش كئيب اوى ولا حاجه او زى ما قالت البطلة اتعودنا"}, {"userName": "Ali AlShewail", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/28419440-ali-alshewail", "userReview": "\" فيتأكَّدُ لي مع كلّ صباح أن فى هذه الحياة -رغم كل شيء- ما يستحق الحياة \" اتجهُ جنوبًا على الطريق من المنصورة إلى الزقازيق -مدينتي- , أنهيتُ الطنطورية للمرة الثانية , وفَّيتُ بوعد الذي قطعته لرُقيَّة -بعد قُرابة عامين- أن أعود قألقاها مرةً أخرى . \" يا طنطوريةبحرك عجايب..ياريت ينوبنىمن الحب نايب..تحدفنى موجة ..على صدر موجة...والبحر هوجةوالصيد مطايب.أغسل هدومىوأنشر همومىعلى شمسه طالعةوانا فيها دايب\"\"يا طنطوريةيا حيفاويةعلى سن باسمعلى ضحكةهالهالبحر شباكومشربيه ...وانت الأميرةع الدنيا طاله. \" ما أبدع مشهد الختام ! , كم دمعة ترقرقت من العين عندما وقعتْ على سطوره ؟ , المسافرُ إلى جانبي نظر إليَّ و حسبني جُننتُ , شابٌ في منتصف عقده الثالث يبكي على الطريق ! , وماذا لو بكيتُ ؟ , وهل لدموع المشتاق رادعٍ أو مبررٍ ؟ , هي تفور في القلب و تنهمر من العين بلا سابق انذار ! . \" ألمس المفتاح ارفع الحبل عن رقبتى .اضعه حول رقبة الصغيرة .أُقبِّل جبينها .أُعطيها للرجل الطويل فيعيدها عبر السلك إلى حسن فتاخذها أمها منه . قلتُ بصوت عال :مفتاح دارنا يا حسن .هديتي إلى رُقيَّة الصغيرة \" رضوى , السيدة , خير يد نسوية خطَّت بقلم الأدب الروائي العربي , رضوى , الأستاذة الجامعية التي مازال طلابُها يضعون على مكتبها وردة يوميًا , رضوى , التي سكبت روحها في قلمها و خطتّها على الورق , نجحت في إبداع رائعة من روائع الأدب العربي قاطبةً و عامود من أعمدة أدب المقاومة خاصةً , رضوى , التي وإنْ فاتتها فلسطينية الجنسية بحكم المولد لم يفُتها فلسطينية الهوى و العشق بحكم الإختيار , و كم لأرض الزيتون من عُشاق! ! . \" هنا تتعثر الجملة ويرتبك الكلام لأنني لا أعرف كيف يمكن تلخيص ما عشناه في تلك السنوات . لا أعرف طريقة لنقل المعنى وأتساءل ما جدوى الدخول في التفاصيل . وليست التفاصيل تفاصيل . كل تفصيلة حكاية مئات البشر وربما الآلاف \" تصفُ السيدة حياة القرية الفلسطينية الوادعة في مرحلة ما قبل الإحتلال و تقاليد الفلسطين و فطرتهم , أفراحهم , أحزانهم , أعراسهم , الجاهة , علاقة الرحم , علاقة الجيرة , قرية دافئة حميمية إفتقدناها في عالم اليوم الرمادي . \" قولوا لإمُّه تِفْرَح وتتهنّا ترُشّ الوسايِد بالعُطُر و الحِنّا والفَرْح إلنا والعرسان تتهنّاوالدار داري والبيوت بيوتيواحنا خطبنا يا عدِّوي موتي \" ثم الإحتلال و المجازر , المقاومة و الصمود , القتل و التهجير , التكاتف و الدفاع , ثم الشتات في أرض الله و البلدان . \" هل يمكن حكاية ما جرى في هذه الصفحات المعدودة؟ كيف يحتمل كتاب صغير أو كبير آلاف الجثث. قدر الدم. كم الأنقاض. الفزع. ركضُنا طلبا للحياة ونحن نتمنى الموت. \" رُقيَّة التي صارت صديقة لا كأيِّ صديقة , شخصية خيالية نعم , لكنها من الروح بمكانٍ مصون , رقية الطفلة , ثم المُهجَّرَة , ثم الزوجة , و الأم , و الجدة , رُقيَّة التي أَسَرَتْنَا و حكت لنا حكايتها و حكاية الطنطورة و فلسطين و صيدا و بيروت و لبنان . \" أتساءل: ما الذي تفعله امرأة تشعر انها بالصدفة، بالصدفة المحضة، بقيت على قيد الحياة؟ كيف تسلك في الدنيا إن كان وجودها، كل السنين و الشهور و الأيام و اللحظات الحلوة و المرة التي عاشتها، فضلَة حركة عشوائية لقدر غريب؟ كيف تسلك في الدنيا؟ \" ثم اجتياح لبنان الجنوبي , المجازر , الخيانات , القصف , الملاجئ , المخيمات , و عندما يصير الإنسان و دمه و حياته مجرد رقم . \" تعلمك الحرب أشياء كثيرة. أولها أن تُرهف السمع و تنتبه لتقدر الجهة التي يأتي منها إطلاق النيران، كأنما صار جسمك أذنًا كبيرة فيها بوصلة تحدد الجهة المعينة بين الجهات الأربع، أو الخمس، لأن السماء غدت جهة يأتيك منها أيضا الهلاك. \" ثم مسك الختام و مشهد اللُقيا على الحدود , و ناجي الصغير , و لوحاته , و رقية الصغيرة , و مفتاح الدار .  باقون ما بقي الزعتر و الزيتون  , ولو بأسلاك شائكة و احتلال , باقون , ولو هجَّروا ولو جزَّروا ولو غدروا و زوروا , ولكل ذهابٍ إياب و لكل روحةٍ غدوة و عودة . \" أغلب نساء المخيم يحملن مفاتيح دورهن تماماً كما كانت تفعل أمي. البعض كان يريه لي وهو يحكي عن القرية التي جاء منها. وأحياناً كنت ألمح طرف الحبل الذي يحيط بالرقبة وإن لم أر المفتاح, وأحياناً لا ألمحه ولا تشير إليه السيدة ولكنني أعرف أنه هناك, تحت الثوب. \"  \" رسوم ناجي العلي تُعرّفنا بأنفسنا .وعندما نعرف نستطيع .ربما لذلك اغتالوه ! \" لم و لن ننسى .. \" الذاكرة لا تقتُل . تؤلم ألمًا لا يُطاق , ربّما . ولكننا إذ نطيقه تتحوّل من دوامات تسحبنا إلى قاع الغرق إلى بحر نسبح فيه . نقطع المسافات . نحكمه و نُملي إرادتنا عليه . \" الله المُستعان .تمت ٢٥ فبراير ٢٠١٧ م"}, {"userName": "د.حنان فاروق", "userReviewDate": "Sep 02, 2010", "userURL": "http://www.goodreads.com/user/show/2056235", "userReview": "للمرة الثانية أجد نفسي علامة استفهام كبرى وأنا أقرأ لرضوى عاشور..صحيح أني قرأت لها عدة أعمال أحببتها إلا أن ثلاثية غرناطة والطنطورية لم يكونا عملين عاديين..مازلت أتعجب من الكيفية التي تتلبس بها شخصياتها بتلك الطريقة..وأنت تقرأ لا تعرف إن كنت أمام باحثة دؤوب أم إنسان يكتب سيرته الذاتية بمنتهى الصدق(رغم أن العملين المذكورين ليسا أبداً سيرة ذاتية) أم روائية تعرف جيداً طيف تقودك من مكان إلى مكان في زمنها الخاص جداً..حقيقة مازلت لا أفهم كيف تستطيع أن تفعل ذلك بمنتهى الإقناع وبمنتهى الصدق ..رقية الطنطورية تأخذك من الكلمة الأولى للحرف الأخير من يد مشاعرك وفكرك لتوصلك إليها..إلى حياتها..إلى مشاعرها..إلى أمومتها..إلى عقلها وجنونها ولحظات قوتها وضعفها..رقية الطنطورية ليست امرأة..لكنها فلسطين,,كل فلسطين.."}, {"userName": "آية", "userReviewDate": "Jun 10, 2010", "userURL": "http://www.goodreads.com/user/show/3188691", "userReview": "كنت أظن أني أحب فلسطين الطنطورية اثبت لىّ أني كنت احبها قولاً فقط ~ رضوى قادرة على مداعبة مشاعرك فتذوب عشقًا اكثر بفلسطين و اهلها"}, {"userName": "Mohamed El-Attar", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/7032083-mohamed-el-attar", "userReview": ".انتهت الحكاية !!؟معقول تنتهى بتلك السرعة !!؟أي عالم هذا الذي أخذتنا إليه رضوى عاشوركيف نعيش مغيبين عن ذلك العار والذل والخزي فى تاريخنا العربىكيف نرضى أصلاً أن نعيش ؟؟ ، ولدينا أمة بأكملها مطرودة خارج بلادهاأمة بأكملها تعيش في مخيمات غير آدميةأمة بأكملها تعرضت لمجازر دموية ، لا يسترد فيها كرامتنا بالسلام على الإطلاقأمة بأكلمها أغتصبت نسائها وشردت ويتمت أطفالها ، وترملت نسائهاأمة شريدة مشتتة فى جميع أنحاء العالم ، لا تريد أي شئ من الحياة غير العودة لأرضهاكل أم فلسطينية تحمل على صدرها مفتاح كبير لدارها فى فلسطينولكن الدار هدمتوالوطن تبخروالعرب تخاذلواوالدم هان على النخوة العربيةوما بقى شيئاً غير بضع شعاراتوأمة كاملة تعيش مشتتة لها حلم واهم فى العودة إلى دار قد هدمت ، وأرض إغتصبتياللمأســــاه :(ويالرضوى عاشورتسجل تاريخ الغربة الفلسطينية ، بحروف من نورتنسج شخصيات عميقة وأصيلة من المجتمع الفلسطينى المشتتلتحكي عن مجازر دموية ارتكبتها قوات الإحتلال الغاشمة وهي تطردها من أراضيهاتحكي عن مخيمات غير آدمية يتعرضون فيها للقصف الإسرائيلى جوا ، والإعتداء اللبنانى برا .. حصار من ست جهات وليست أربعأي حياة تعاش بهذا الشكل .. أي حياة ممكن تطاق فى هذه الغربة المستمرةفأنت مطرود من بلدك ودارك ، وكل مدينة تذهب إليها ، لا يحسنوا فيها استقبالك .. ثم يأتى الإعلام العربى الكاذب ، لحكام عرب مدنسين وخونةويروجون أن الفلسطينيين قد باعوا أراضيهم ثكلتكم أمهاتكم .. يا تجار العرض والأرض والذمة والنخوةأنتم من بعتوا الأرض بخنوعكم ، وبعتوها بتهاونكم ، وبعتوها بإتفاقياتكم المشينة التى هدرت كرامتنا وحقنا ، وضيعت الدم والتارفلا رحمة الله عليكم من مات فيكم أو عاش ومد يده إليهم بسلامرواية الطنطورية من أروع الروايات التى قرأتها فى حياتىرواية أدخلتنى عالم لن أخرج منه غير ملم بجميع تفاصيله وهاناته ، بل وسأكتب عنه يوماً مارواية الطنطورية بها كم من المشاعر الرقيقة جدا ، والحزينة جداً ، والفرحة جداًمن الجميل ان تتعرف على العالم الفلسطينى كيف كان فى 48 ثم بعد ذلك فى مخيماته وفى بلاد الله فى شتاتهمن الجميل ان تعرف عاداته وتقاليده ، وأهمية الأشياء عندهالأرض أهم الأشياء عند الفلسطنيينشجر البرتقال واللوز والزيتونأكلهم الذي يتميزون به ، كيف يتفاخرون به ، ويهادون بعض بهوالأهم لماذا هم كثيروا العدد فى أسرهم الصغيرة ، فتجد الفرد لديه خمسة أبناء على الأقلان كنت تريد ان تقرأ عن التغريبة الفلسطينية من 48 إلى الآنفرواية الطنطورية أهم المراجع التى ممكن أن تلجئ إليهاخمسة نجوم قليلة جداً على هذه الرواية."}, {"userName": "Zanna", "userReviewDate": "Jan 08, 2015", "userURL": "http://www.goodreads.com/user/show/22591633-zanna", "userReview": "This narrative opens with a gloriously ambiguous, searingly romantic image that heralds a lyrical portrait of life in the narrator's idyllic home town on the Palestinian coast. The seeds of a story are sown and I joyfully anticipate a woman-centred tale of love, tradition and modernity set in this paradise and told in the voice of a poet. By whetting our appetite for this tale, by showing that it would be worth the telling as well as worth the living, Ashour imparts bitter anguish and loss when that future is torn away by the Nakba. That the witness and victim whose eyes we peer through on the Catastrophe is a fourteen year old girl allows the full emotional impact of destroyed hopes to crash into my heart, while the more gruesome facts, the historical facts, that the people of the town were turned out of their houses by soldiers who stole valuables, lined men up and slaughtered them, are numbly reported, too impossibly horrific to be conveyed by adjectives.I found the realism of Ruqayya's narrative breathtaking, and caught myself constantly forgetting that it is fiction. Part of what gives it the fire of truth is the reality of the events that shape it, never as a backdrop, but as hubs and spokes of relationships and hooks and poles of the warp and weft of daily life where Ashour maintains her foci. Realism is also created through Ruqqaya's patchy, selective recall, which so exactly resembles geniune memoir. However, this apparently simple, though brilliantly deployed and effective device, is counterpointed and complicated by stylistic and structural complexity.For example, without warning, only a few pages into the novel, we are with Ruqayya as a grandmother, telling stories and describing an annual gathering, in a lucid, conversational style distinct from the sonorous, charged sections of recall. In this scene, she also abruptly answers several of the broad questions about her own future that the initial scenes, particularly the funny and touching recollection of her mother's fears, had set me wondering about. Narrative convention led me to expect a measured, ponderous unfolding of these plot points; but this is not allowed to happen, the plot is severed by the occupation like lives and limbs. In my opinion, the power of this work is that Ashour refuses the occupation - she insistently draws us (not uncritically) back to life, to the gendered spaces of domesticity, to an inner world of contemplation. There is a passage of description of the sun setting over the sea in Tantoura at the start of the novel that is extraordinarily gorgeous and original, where Ruqayya reads and paints the landscape full of ambivalence, creating a shimmering, fragmentary surface that reflects the agitation of the novel's timeline and subject, but also itself forms a break in the flow of the plot as dictated by the violent agenda of an occupying force. This fiercely beautiful interlude underlines the endurance of nature and Palestinians' relationships with the land. The text itself, like the reiteration of memory, is an act of resistance. Indeed, telling the 'female' perspective is resistance, since the social domain embodies and reproduces that which is worth fighting for in the right of return. I was reminded of this video of Rafeef Ziadeh speaking her poem 'we teach life, sir'Presenting her novel as a memoir unwillingly written by an intelligent but not highly educated woman whose violently exiled life contains, alongside unspeakable suffering and grief, many joys and countless acts of love, care, friendship, generosity, Ashour blazingly illuminates the will to endure and live above and beyond the misery of waiting, above and beyond survival. She questions the emotional truth of Homer's account of Penelope waiting for Odysseus - nobody, she declares, would undo the work of social reproduction painstakingly woven. The fruits of her own labours are dazzling; she somehow raises three brilliant, idiosyncratic sons and then a daughter who startles her constantly with her intelligence and maturity. I could not hold back my tears at the close of this vivid portrait of a life that cannot be occupied by hatred and death, that is outlined in love and defiant hope like a glittering constellation, lighting the way home."}, {"userName": "طَيْف", "userReviewDate": "May 30, 2012", "userURL": "http://www.goodreads.com/user/show/7810481", "userReview": "بتّ منحازة لرضوى عاشور...لأنها منحازة بكل قوتها لنا كقرّاء...تحترم عقولنا...وتولينا اهتمامها...تشبع المادة التاريخية بحثا وتنقيبا...وتنقل ما حُفر في الذاكرة وتناسيناه مع تقادم الأيام ليصبح واقعا معاشا وإن كان بين سطور رواية.رحلة تقودنا فيها رضوى عبر نصف قرن من نكبة عام 1948 حتى عام 2000، مزجت فيها بين شخصياتها المتخيلة وعددا من الشخصيات التاريخية في سياق نصها الأدبي بصورة لم تخل بالسرد الروائي...ولم تنتقص من قيمة الحقائق التاريخية..رغم أن(الحكاية صعبة. لا تُحكى. متشعبة. ثقيلة. كم حرب تتحمل حكاية واحدة؟ كم مجزرة؟ ثم كيف أربط الأشياء الصغيرة على أهميتها بأهوال عشناها جميعاً)كما تقول رضوى.والمرأة الفلسطينية حاضرة بقوة من خلال شخصية رقية...هي بامتياز حكاية المرأة الفلسطينية بكل هشاشة التهجير وقوة الوجود...ومع ذلك لم تهمل الملامح الإنسانية لكل شخوص الرواية عبر ثلاثة أجيال من أسرة رقية.تبدأ روضة روايتها من أجواء قرية الطنطورة وعلى لسان رقية... واصفةً جمال حياة القرية...اللعب بماء البحر ورماله...الطفولة بكل براءتها...مقبرة من رمل مجللة بالضحك وشيطنة الصغار...بئر سكّر...مجلس العرسان...الزغاريد والأهازيج وحلقات الدبكة...العتابا والأوف...مشاهد الحياة المبهجة...والطبيعة القروية الخلابة...لندرك بعدها حجم الخسارة الفادحة(ينوّر اللوز..يسرق قلوبنا ثمّ يزيد، يتملكها بثمره الهشّ المراوغ، لاذعٌ وسُكّر!)ولما ابتدأت مشاهد الاحتلال تتوالى...تغيرت الهموم والاهتمامات(بعد أسبوعين سقطت حيفا، لم ينتبه أحد حتى نحن الصبايا والأولاد، أنّ اللوز اخضّرَ على الشجر.)سقوط حيفا...استشهاد عبدالقادر الحسيني...مجزرة دير ياسين...سقوط صفد...سقوط يافا...سقوط عكا...استبسال الرجال في الطنطورية واستماتتهم في حماية البلد...تفاصيل الترحيل...إغلاق البيوت وحمل مفاتيحها على أمل العودة...ورؤية آثار المجزرة بكل بشاعتها...والدها وأخويها مع القتلى...أمسى البكاء مبتذلا، لأن الدموع صارت تستحي من نفسهاتختزن رقية رائحة غريبة تختلط برائحة البحر والزنبق الأبيض...وتختزن اللحظة لتتوقف عندها وإن استمرت الحياةتروي رضوى بعد ذلك قصة وطن من خلال الحكايات اليومية للمهجرين في لبنان في ظل تصاعد الأحداث...وجرائم الاحتلال في فلسطين...قتل تدمير تهجير...والفلسطيني وحياته بينهما...كل ذلك مضافا إليه كما هائلا من الذكريات...الحكايات التي تروى ثم تعادتسرد أحداثهم اليومية من طبخ واهتمام بالأبناء ومشاحنات الحماة وكنتها وبنبون أم علي...أتراحهم وأفراحهم...بلغة تتداخل فيها الكثير من المفردات العامية...حتى تظنها عاشت بينهم وكانت واحدة منهمورقية خلال تلك الأحداث تكابد للتمسك بالذكريات والتفاصيل...حتى لا تضيع القضية في وجدانها...رغم طمس ملامح قريتها على الأرض... كأن من ذهبوا أورثوها حكايتهم لتعمر الأرض باسمهم واسم حكايتهم.ولأن (الذاكرة لا تقتل . تؤلم الماً لا يطاق ، ربما . و لكننا إذ نطيقه تتحول من دوامات تسحبنا من قاع الغرق إلى بحر نسبح فيه . نقطع المسافات . نحكمه و نملي إرادتنا عليه.)تروي رقية ما استطاعت من حكايتها...وتمرر مفتاح الدار لحفيدتها عبر السلك الشائك...ليستمر النضال حتى العودة...حلمها الذي نحتاج ويحتاج جيل اليوم لامتلاكه بكل تلك القوة.المحطات التي استوقفتني في الرواية أكثر مما ذكرت...والاقتباسات الجميلة العميقة التي دونتها منها كثيرة...وكلماتي تلك شرارة لتشجعك على قراءتها واكتشاف الجمال فيها."}, {"userName": "Ahmed", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/11260920-ahmed", "userReview": "رغم أنه بحكم العادة تهفوا قلوبنا الى فلسطين وكل ما يخصها حتى فى مجال الأدب لكن نادرا ما تجد عمل بجودة هذا العملفقد استخدمت رضوى عاشور اللغه البسيطه القويه لتوصل لنا فكرتها واستخدمت حسها الأدبى العالى لتؤثر فينا. وأعتقد انه عانت شخصيا من المأساة لمعاناة زوجها هو الآخر منها. فقد فرقت بينهما هذه المأساة كثيرا لتطبع الطبعه الذاتيه فى العملفى المجمل لا تملك إلا أن تشكر رضوى عاشور من قلبك على الأدب الراقى الذى تقدمه"}, {"userName": "Mohammed", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/6823144-mohammed", "userReview": "الطنطورية، عين غزال، الصفورية... قرى فلسطينيةغسان كنفاني، أنيس صايغ، ناجي العلي... أعلام فلسطينيةالدلعونا، اﻷوف، الميجنا... أهازيج فلسطينيةالشتات، اللجوء، الترحيل... هموم فلسطينيةالعرب، المسلمون، العالم.... أضاعوا القضية الفلسطينيةالطنطورية رواية مكتملة الأركان، بجدارة أدت الدور المناط بمثيلاتها: التوثيق التاريخي في إطار أدبي مشوق. بكفاءة تولت رضوى عاشور الموازنة بين العاطفية والواقعية فلم تعكف على سرد وقائع تاريخية دقيقة مع إغفال العاطفة، كديدن الأستاذ القدير صنع الله إبراهيم، ولم تسرف الصفحات في النواح دون طرح عقلاني.أعترف أنني امتعضت في بداية الرواية من السرعة الخاطفة لسير الأحداث دون إيراد تفاصيل مثيرة أو خلق لوحات ذهنية ترسخ في الذاكرة، إلا أن هرولة السرد تباطأت نوعا بعد وصول بطلة الرواية إلى صيدا. أخيرا، تزخر \"الطنطورية\" بالعديد من أبجديات الصراع الفلسطيني-الإسرائيلي، لذا أنصح من يزمع قراءتها ترك فاصل زمني بينها وبين أي عمل يتمحور حول الشأن الفلسطيني."}, {"userName": "رحاب", "userReviewDate": "May 18, 2010", "userURL": "http://www.goodreads.com/user/show/1752097", "userReview": "من زمان لم أسهر للفجر لأنتهي من رواية. الطنطورية تسحبك إلى عالمها.. فلا تدري بنفسك إلا وأنت في منتصفها، فتتمهل في القراءة حتى لا تنتهي بسرعة، وتحاول أن تتركها ليوم فتحيط بك الشخصيات وتظل تفكر فيهم طوال اليومرواية بديعة كالعادة للدكتورة رضوى عاشور.. وبطلة الرواية رقية من الشخصيات التي لن أنسها أبدا"}, {"userName": "Sherif Metwaly", "userReviewDate": "Sep 08, 2014", "userURL": "http://www.goodreads.com/user/show/24529830-sherif-metwaly", "userReview": "!!!انتهت الرحلة فور انتهائى منها ابتسمت ابتسامة غريبة ... لا اعلم سببها ولا مغزاها نظرت الى جوانب غرفتى ..... نظرت الى السقف ..استغرقت بضع ثوانى لأدرك أنى فى غرفتى ..جالساً على الكرسى أمام المكتب  لا أدرى أيضا لماذا ؟!يمكن بسبب النهاية؟ !يمكن بسبب حبى لرُقية واحساسى أنها امى ؟!يمكن لأنى شعرت انى كنت مسافراً عبر الزمان ورجعت مكانى فور انتهائى من الرواية ؟لا اعلم كل ماأعلمه اننى عشت الرواية بكل تفاصيلها حزنت لمفاجعها وفرحت فى افراحها سافرت مع كل من بالرواية وفى النهاية عدت لوحدى هذه الرواية كُتبت لكى تعيش بداخلها لا لتقرأها فقط رحمة الله عليك يارضوى طِبتِ وطاب مَثواكِ ."}, {"userName": "Hussam H Aql", "userReviewDate": "Sep 20, 2015", "userURL": "http://www.goodreads.com/user/show/47055673-hussam-h-aql", "userReview": "هذه الرواية تحكي كل شيء؛ تعرّي الحقائق إلى حدٍ لا يحتمل، قد تبكي -وجعاً- حتى تخبرك رضوى عاشور في النهاية أن البكاء أمسى مبتذلاً، ولا مجالالمدح بها ذم. قرأتها منذ سنة ولا أزال أذكر رقية والبحر ومفتاح دارهم؛ معها ضحكت وبكيت.. وعشت مشاهد كثيرة لن تنسىشكرا رضوى عاشور، رحمكِ الله، وجزاك عن هذا خيراً.أفضل ما قرأت\"أَلَا إِنَّ نَصْرَ اللَّهِ قَرِيبٌ\".صدق الله العظيم"}, {"userName": "Sohaib Ibn hossain", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/54039967-sohaib-ibn-hossain", "userReview": "رواية تتحدث عن نكبة فلسطين و الشعب الفلسطيني ...إستمتعت بقرأتها 😍"}, {"userName": "Malsam  - ملسم", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/5957984-malsam--", "userReview": "لم اقرأ رواية من قبل تتملكني كمّا الطّنطُوريَّة ! تلك التي كنتُ ارتشف منها القليل صباح كل يوم وامنع نفسي من المواصلة لتستمر أكثر، لأعيشها أكثر ويعز الآن علي فراقها ... فهي قصة أجدادي التي لا زلتُ أعيشها .. في هذه الأيام كثيرًا ما استحضرتني أرواح جداتي واجدادي (رحمهم الله جميعًا )، واختلطت علي الروايات جميعها، وإن اختلفت في بعض تفاصيلها وفي اسماء المدن ولكنها كانت قريبة جدًا جدًا، النكبة والهجرة والمعاناة هي هي.. أبدعت رضوى في نقل التفاصيل الفلسطينية الصغيرة في المأكل والملبس والحديث والعادات والأغاني التي زادت من عذوبة النص وجماله الأدبي (لوهلة ظننتُ أن رقية هي رضوى حتى مع تأثرها بجنسيتها المصرية) ... ولا زلتُ مندهشة كيف استطاعت رضوى أن تروي لنا حكاية هي شخصيًا لم تعشها ! صراحة قرأتُ عنها قبل أن اقرأها، وكانت مراجعات جيدة جدًا ومُحفزة، ولكني لم اجد في مراجعات الآخرين ما وجدته حين قرأتها .. فلم تآلمني النكبة وأحداثها ولا اجتياح ال78 وما بعده الاجتياح الأكبر في ال82 في لبنان، بالرغم من أنها جميعها مُفجعة وموحشة ومؤلمة، وكما قالت رضوى \"إن الحكاية صعبة. لا تُحكى، متشعبة، ثقيلة. كم حرب تتحمل حكاية واحدة؟ كم مجزرة؟ ثم كيف أربط الاشياء الصغيرة على أهميتها بأهوال عشناها جميعًا\"، ولكني ارتبطت أكثر بالتفاصيل الصغيرة، مثلا في طريق الهجرة، في الصور، في الذكريات ... تؤلمني أيضًا محاولة تأطيرها ووضع الرواية في قوالب المراجع التاريخية والجغرافية لفلسطين، ولربما مقارنتها بكتب التاريخ والوثائق، فمع كل ما حملته من معلومات موثقة واسماء لشخصيات واحداث حقيقية فما يهم حقًا - برأي - هي القصة الإنسانية - قصة العائلة الفلسطينية التي عاشت النكبة وما بعدها، قُتل منها من قتل وهُجر من هُجر وإن لم تكن \" رقية\" حقيقية فهي روت قصص حقيقية عاشتها جداتي وهن حقيقيات بلا ادنى شك ! أخيرًا من اللفتات المميزة في الكتاب كانت القائمة ببعض الكلمات والعبارات الواردة بالدارجة الفلسطينية.أتكون هي الغربة تلك التي جعلتني اشعر بكل ذاك الحنين، وانا اشتم رائحة \"الملوخية\" المفضلة لدي واتذوق شيئا من طعم \"المسخن\" و\"المقلوبة\" أو أنه بحر يافا وحيفا الذي يدغدغني .ختامًا هي الرواية التي جعلتني ابكي"}, {"userName": "Lio", "userReviewDate": "Jul 25, 2010", "userURL": "http://www.goodreads.com/user/show/2558756-lio", "userReview": "لا أصدق .. أنهيت قراءتها في أقل من يوم .. لا أبالغ إن قلت أني لا أملك تعليقاً .. الحمد لله على نعمة رضوى عاشور !"}, {"userName": "فهيمة محمود", "userReviewDate": "Jun 01, 2013", "userURL": "http://www.goodreads.com/user/show/6038635", "userReview": "أن تستفزك كلمات ووصف كاتب في رواية ما !لتجد نفسك مُجبراً على كتابةترغب في سرد الأحداث مرة أخرىتتمنى لو كُنت أنت صاحب تلك الرواية أو بطلهاتُريد إعادة خلقها وتشكليها في كلمات تشبه كلمات الكاتبمسخ .. بالنسبه لما أحدثه النص الأول فيك من شرخ!!غصة ومرارة تصل فيك إلى اللهاةلا تستطع بلعها أو طردهـا ..مشاعر متناقضة ! عيش مرة أخرى داخل أركان .. جدران المأساةأنتَ داخل أوراق الرواية ..تهرب من قذيفة فـ تلطمك رصاصة صمت وسلبية وظلم وقهرتُحاول الخروج فـ تمسك بك الاحداث عازمة على عدم ترككتَنتهي فتجد الصفحة الأخيرة محفز آخر للبداية من جديدحقيقي رائعة"}, {"userName": "فـــــــدوى", "userReviewDate": "Jun 09, 2010", "userURL": "http://www.goodreads.com/user/show/3138080", "userReview": "أنها خيوط الحنين مضفره مع الآلم ...الطنطوريه /رقيه ...راويه وشاهده علي عصر غني ...ملئ بالفواجع والكوارث ...صحراء قاحله من الأحزان رطبتها أحيانا ندي الايام السعيده ...تسرد رقيه حكايه شعب أنتزع منه وطنا ...هجر وشرد .....نكل به وتعرض لكافه أنواع المهانه ...رغم أنها وببساطه لا تروي سوي قصتها هي ...تتذوق مع صفحات تلك الروايه مراره الخديعه و ظلم ذوي القربي ..."}, {"userName": "محمد العدوي", "userReviewDate": "Sep 29, 2010", "userURL": "http://www.goodreads.com/user/show/2758078", "userReview": "أرصن .. وأرحب من السطور الأولى للرواية شعرت أنني لن أنصرف عنها .. الصورة الواضحة الرصينة ، ولعلها الموسيقى الموزونة في السرد هو ما تكامل ليلقي في نفسي هذا الإحساس . بعد ذلك كانت كل الصور المتتابعة لها نفس النسبة والوزن .. لا شطط ولا ( كلاكيع ) تجعلك تتوقف . حتى ولو فكرت أن تقرأ النص بصوت مرتفع فسيكون وقعه جميلا عليك .. وهذه قليلا مما لا تجده بسهولة .. لم تفاجئني كثيرا المذابح التي فيها فأنا أعرفها واحدة واحدة .. في ثلاثية غرناطة لم أستطع أن أكملها خشية الألم الذي أحسسته فيها .. هنا لم أخش الألم .. كان سرد رضوى من الانس بما يكفي ليجعلك تمر على كل تلك الأحداث وخلف كل ألم مداواة .. وسعة ... كانت صحبة جميلة من الطنطورية .."}], "description": "Palestine. For most of us, the word brings to mind a series of confused images and disjointed associations-massacres, refugee camps, UN resolutions, settlements, terrorist attacks, war, occupation, checkered kouffiyehs and suicide bombers, a seemingly endless cycle of death and destruction. This novel does not shy away from such painful images, but it is first and foremost a powerful human story, following the life of a young girl from her days in the village of al-Tantoura in Palestine up to the dawn of the new century. We participate in events as they unfold, seeing them through the uneducated but sharply intelligent mind of Ruqayya, as she tries to make sense of all that has happened to her and her family. With her, we live her love of her land and of her people; we feel the repeated pain of loss, of diaspora and of cross-generational misunderstanding; and above all, we come to know her indomitable human spirit. As we read we discover that we have become part of Ruqayya's family, and her voice will remain with us long after we have closed the book.", "title": "The Woman from Tantoura", "url": "https://www.goodreads.com/book/show/17678418.The_Woman_from_Tantoura", "average": 4.31, "cover": "https://images.gr-assets.com/books/1367226412l/17678418.jpg", "reviews": 3257, "authors": [{"url": "https://www.goodreads.com/author/show/1424397.Radwa_Ashour", "name": "Radwa Ashour"}, {"url": "https://www.goodreads.com/author/show/3485924.Kay_Heikkinen", "name": "Kay Heikkinen"}], "type": ["Novels"], "outlinks": ["http://www.goodreads.com/book/show/17678418-the-woman-from-tantoura", "http://www.goodreads.com/book/show/8239301", "http://www.goodreads.com/book/show/12453972", "http://www.goodreads.com/book/show/13575970", "http://www.goodreads.com/book/show/18682187", "http://www.goodreads.com/book/show/3438000", "http://www.goodreads.com/book/show/5781174", "http://www.goodreads.com/book/show/18295750", "http://www.goodreads.com/book/show/5598805", "http://www.goodreads.com/book/show/5598518"]}