{"ratings": 78, "userreviews": [{"userName": "Sharon", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/5394360-sharon", "userReview": "The book up for review is “The Writer’s Tune-Up Manual” by Craig A. HartThis book is designed to help you with your writing. It is divided into appropriate sections.-Character-POV-Dialogue-Description and Setting-PlotEach section you get practice exercises which are really just fun to do. It helps you work on the material that was just presented. It does not matter where you are in your writing career, this book really is for all who are seriously trying to improve their skillsAs a fellow author I tend to collect books on writing and any aspect of the craft. I truly enjoyed this book. It had quotes spread through the book that were just perfect for the topic at hand. We all need practice and every bit helps. But the exercise that were located in this book got you thinking, maybe out of the box for some of us. It got you to write and that is major kudos.The thing I enjoyed the most about it was how it was written. The author truly meant this book to be used as a tool but not meant to be stressful but just enjoyable. I recommend highly that you pick up a copy. Even if you just pick up a tip or two, that is gold. The style and format are quite pleasing in how it is presented to us."}, {"userName": "Pamela D", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/13187394-pamela-d", "userReview": "This review copy was generously donated by the author.The Writer's Tune-Up Manual is a collection of 35 writing exercises to help jump start your writing. The exercises focus on one of five areas: character, POV, dialogue, description and setting, and plot. The exercises are varied and will help you think about each of the above five areas in lots of different ways. Please keep in mind that this book is a collection of exercises and is fairly short. If you don't know how to string words together, this is not the book for you. If you want to try your hand at writing or writer's block is setting in and you need a kick in the rear, this book might be a good fit.I have not written for fun, since I was in high school; however, I have never stopped thinking that it might be fun to try my hand at writing. These exercises seem to be the perfect starting place for me. The idea of writing a book or even a novelette seems overwhelming, but I think I could write 500 words on a subject. Who knows, maybe this is the jump start that I need to start a novelette. Hmmm, NaNoWriMo (National Novel Writing Month) is only a few months away..."}, {"userName": "Caroline Åsgård", "userReviewDate": "Apr 20, 2014", "userURL": "http://www.goodreads.com/user/show/19812841-caroline-sg-rd", "userReview": "I read the 47-page excerpt of this book.I have read one type of book like this, which was ''Reading a Writer's Mind: Exploring Short Fiction - First Thought to Finished Story'' by Linda Acaster.The first part of this book is about characters. You are presented with several exercises, about archetypes, description, things out of character, fears, perfection and so on. You are told what is normal to do, what you should and should not do, and then you get to exercise on that topic.I think this book would be great for all writers, both new and experienced! Challenge yourself, analyze your writing and your characters, and improve!And Craig A. Hart really hits me as an intelligent, down to earth writer."}, {"userName": "Donna", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/10283129-donna", "userReview": "Fantastic and easy to follow fun manual for writers at all levels. This book offers you many activities focusing on the main points of writing, covering Characters, point of view, Dialogue, description and setting also plot and separated in sections. From the first page I was hooked and couldn't wait to start the activities. They were easy to follow but I could challenge myself if I wanted to. I felt that I wanted to have a go at each activity. I have read similar books in the past and this I found was the one that suited me the most. I found it fun to pick one activity from each section and then experiment fitting them together."}, {"userName": "Lucas", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/7268671-lucas", "userReview": "This book is FILLED with great ideas to brush the cobwebs off my notebook and get me writing again. Not only have I already started to use the exercises, but I've also started to incorporate them into my classroom (I teach 5th grade) without making a big deal about teaching a writing lesson. Only time will tell but I think my writing and the writing of my students will be improved by the end of the year because of Mr. Hart's book."}, {"userName": "Michele Seigfried", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/16795853-michele-seigfried", "userReview": "This book is a manual to assist writers in honing their skills. I would recommend this for any writer - whether you are an aspiring writer, recently published or a pro. The exercises in this book are thought-provoking and bring out your creative side. Have writer's block? This may be just what you need to bring you out of your slump! Develop better characters and plots by working out these exercises. I think this will help me improve my skills for my next novel!"}, {"userName": "Pretty Mccullers", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/24136091-pretty-mccullers", "userReview": "Sometimes you need to do writing exercises in order to perfect the skill."}, {"userName": "Misty", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/8218393-misty", "userReview": "This is a handy and very portable how-to that has something for writers at every level of expertise. Even those with lots of experience will appreciate Hart's concise, funny guidance through basics such as point of view, when & how to use description, and why to avoid cliches like the plague, offered in short, concise explanations prefacing a short exercise to put the knowledge to the text. For the more advanced, exercises toward the end about how to manage the intricacies of plot, build suspense, add tension, and manage reveals will be good refreshers and add a few insights. And all types of writers can benefit from the bonus material at the end that help you get to know your characters better--a surefire way to deepen your writing in ways that will engage readers. I recommend this for new writers, teachers, workshops, and writing groups of all kinds - a quick, to-the-point primer by a writer who knows his stuff."}, {"userName": "Charles", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/7481677-charles", "userReview": "Could be usefulThis is not a how-to book. This is more of a what-to-do book. As in, what to do when you get stuck or lost. The exercises will be good to get blood flowing and the words flowing if you are still new to this game called \"writing\"."}, {"userName": "Norma", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/10246944-norma", "userReview": "ConciseDidn't give me much information I didn't already know/use but it's written in a concise way that doesn't make the reader feel bogged down."}, {"userName": "Shawn", "userReviewDate": "Aug 12, 2013", "userURL": "http://www.goodreads.com/user/show/21376467-shawn", "userReview": "These writing prompts are overwhelming for me as a beginning writer. I not far enough along for these prompts to be useful. Maybe if a person has already been working on a story and has been developing their characters and/or plot, then this book would help them to fully flush it out into a complete work. Since the cover actually states, \"Exercises that will scrape the rust off your writing,\" I should have realized that one has to first have some writing to scrape the rust off of. Oh well. Maybe I'll come back to it on my shelf when I'm a more seasoned writer, but for me right now it's jumping the gun.I received this book free through the Goodreads Firstreads program (Thank you!)."}, {"userName": "Holli", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/37554808-holli", "userReview": "The car references at the beginning were a little dippy and put me off some. It's cute, but writers aren't cars (i.e., machines) and being a writer myself I didn't entirely appreciate the joke. I also expected a lot more from this book than a bunch of writing exercises. I expected a little more actual advice on how to improve my writing to go along with the writing prompts. What it has is okay, but a little disappointing at the same time. I do like the quotes included before each exercise though. They are well-chosen and quite good."}, {"userName": "Elizabeth Houseman", "userReviewDate": "Aug 24, 2016", "userURL": "http://www.goodreads.com/user/show/48765979-elizabeth-houseman", "userReview": "Hart's book is filled with quick writing exercises (almost all coming to approx. 100-500 words in length) that teach the building blocks of the craft. I appreciate what he has to say and the fact that he covered so much about the craft of writing in such a small book. I'd definitely recommend this book to anyone wanting a quick but thorough guide to learning the basics of writing."}, {"userName": "Eddie Jong", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/19690516-eddie-jong", "userReview": "An author's writing style evolves over time, and hopefully becomes better as more works see the light.This book has definitely helped me hone my craft and become a better writer. It is one of those books that you work through over a long period, and, once you're done, put it away only to read again in a year or so."}, {"userName": "Dyah Ayu Nurinda Shabrina", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/14816335-dyah-ayu-nurinda-shabrina", "userReview": "This book is good for newbie writer. But i think, it has difficult word for people with average english. But, overall this book awesome"}], "description": "One thing every writer wants is the opportunity to improve their craft, to hone their skills, and create the most dazzling prose possible. The Writer’s Tune-up Manual is just what you need. Maybe you’ve been away from the game for a while, struggle with a certain aspect of writing, or perhaps you just want to put your skills up on the rack and give them a good tuning. Filled with 35 targeted exercises and inspirational quotes from established writers, The Writer’s Tune-up Manual will help you do all these things by expanding your writing savvy in five specific areas: Character Development, Dialogue, Point of View, Description and Setting, and Plot. The exercises in The Writer’s Tune-up Manual are more than just writing prompts; you can find those anywhere. No, The Manual gives you a real opportunity to flex your literary muscles by laying out detailed, often difficult assignments. Nobody said that becoming the best writer you can would be easy, so roll up your sleeves, flex your fingers, and get ready to take your writing to a whole new level!", "title": "The Writer's Tune-up Manual: 35 Exercises That Will Scrape the Rust Off Your Writing", "url": "https://www.goodreads.com/book/show/18171311-the-writer-s-tune-up-manual", "average": 3.97, "cover": "https://images.gr-assets.com/books/1373340887l/18171311.jpg", "reviews": 15, "authors": [{"url": "https://www.goodreads.com/author/show/726854.Craig_A_Hart", "name": "Craig A. Hart"}], "type": ["Language", "Nonfiction", "Reference"], "outlinks": ["http://www.goodreads.com/book/show/18171311-the-writer-s-tune-up-manual", "http://www.goodreads.com/book/show/29068274-the-writer-s-tune-up-manual", "http://www.goodreads.com/book/show/18857771-the-writer-s-tune-up-manual", "http://www.goodreads.com/book/show/32615132-serenity", "http://www.goodreads.com/book/show/33838542-serenity-stalked", "http://www.goodreads.com/book/show/34851044-serenity-avenged", "http://www.goodreads.com/book/show/35574826-serenity-submerged", "http://www.goodreads.com/book/show/12568594-passing-through"]}