{"ratings": 2122, "userreviews": [{"userName": "Bookdragon Sean ", "userReviewDate": "Jun 19, 2016", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "I wouldn’t want to be a medieval wife Well I don’t want to be any sort of wife, but that’s beside the point! What I’m trying to say is that medieval womanhood wasn’t a good form. This wife was forced to marry at twelve years of age, twelve years of age, and since then has married five times; thus, she considers herself somewhat of an authority on marriage. And who can argue, she clearly has more experience than most:Middle-English Version \"Experience, though noon auctoriteeWere in this world, were right ynogh to meTo speke of wo that is in mariage;For, lordynges, sith I twelf yeer was of age,—Y-thonked be God, that is eterne on lyve!Housbondes at chirchė dore I have had fyve;For I so oftė have y-wedded bee;And alle were worthy men in hir degree.\"Modernised Translation\"Experience, though no authorityWere in this world, were good enough for me,To speak of woe that is in all marriage;For, masters, since I was twelve years of age,Thanks be to God who is forever alive,Of husbands at church door have I had five;For men so many times have married me;And all were worthy men in their degree.\"Her experience becomes her weapon; her sexual potency becomes a means for control. But, she has also been subjected to endless sermons of scripture and churchly didacticism, so she tries to use it to her advantage. And in this Chaucer provides a critique of the church. Almost everything the wife utters about religion is completely false: it is what she has been told by conniving churchman who wish to wield their authority for personal advantage. They twist the words of their bible to form their own patriarchal creed. They are the worse kind of churchman because they exploit their power and position of trust. So when the wife innocently repeats such babble, it’s rather humorous. She becomes a pseudo-feminist as she refutes her society, but, ultimately, she continues to contribute to it. Admittedly, she doesn’t have much choice. She is a rather singular voice after all. She conforms to the idea of what the church saw as debased and immoral. Rather ironic isn’t it? What she needed to do was become something more potent, and really show the churchmen how manipulative they can be. This is a good piece of literature, I always enjoy reading Chaucer; however, this edition has modernised the language. It has provided a translation. So, in reality, it doesn’t actually feel like Chaucer any more at all. For me this is a bad move, I like to read Chaucer in its original form with all its old spellings and archaic language even if it is difficult in places to follow. That’s part of the experience. I used an original quote at the start to demonstrate this. I don’t recommend this edition at all. At the very least, try an edition that has both versions. An original one you can read and a modern one for point of reference. Penguin Little Black Classic- 28The Little Black Classic Collection by penguin looks like it contains lots of hidden gems. I couldn’t help it; they looked so good that I went and bought them all. I shall post a short review after reading each one. No doubt it will take me several months to get through all of them! Hopefully I will find some classic authors, from across the ages, that I may not have come across had I not bought this collection."}, {"userName": "Traveller", "userReviewDate": "Aug 22, 2011", "userURL": "http://www.goodreads.com/user/show/3145526-traveller", "userReview": "I really liked the essays dealing with the content of the text, but Mr Beidler himself is rather pedantic for me, rambling on and on about the authenticity of this copy and that copy of the various manuscripts that still exist of this text. He seems to be really a hard-core hardcore Chaucer super specialist, giving background on the debates around the origins of the various manuscripts.I see this edition is not linked to other editions of Chaucer's The Wife of Bath's Prologue and Tale, so I'm going to add that review in here as well. Apologies to those of my friends who have already read it in the past, but this Case Studies in Contemporary Criticism is actually a very good series.*** Since there has been such a spate of reviews on Goodreads recently, attending to texts that contain the depiction of female masochistic tendencies, I decided to go all the way and go way back to the first text we know of in English that contains this, being Geoffrey Chaucer's Wife of Bath's prologue and tale.Both the tale and prologue depicts violence visited upon women, and in the prologue, it is initially even welcomed by the woman, for love of the man inflicting the violence; but just like Ana in 50 Shades of Grey, Alison decided eventually that she didn't like it, and decided to reform her attractive, sexy fifth husband Janken into more couth ways.Arriving at a definite stance on how to interpret the message or the character of Chaucer's Wife of Bath, is not an easy task. The Wife of Bath is probably one of the characters that there seems to be least agreement upon, in the entirety of English literature, or such has been my own experience when reading scholarly interpretation upon scholarly interpretation, in order to try and clear my own confusion as to exactly what it is that the Wife herself is saying, and moreover, what Chaucer is generally saying with his creation of the Wife and her Tale.I have come to the conclusion that the Wife of Bath is at the same time an expression of anti-feminism, and to a smaller extent of pro-feminism, each in different aspects and contexts.I was taken aback, when I read the Wife's Prologue originally, by the apparent (to me) misogyny in this work. It is quite easy to see the misogynist voice Chaucer is speaking with. In the Prologue to the tale, Chaucer seems to be mocking and satirizing a bossy, nagging wife - the kind of wife that most men dread and would find hard to handle.Comments upon her from scholars seem varied; some praise her as the first feminist, though many feminists see past that and also see a male voice making a hateful parody of the female gender, and of wives in particular, but they also note and comment quite strongly upon the theme of violence weaved into this tale.Chaucer does not paint a pretty picture of the Wife in her Prologue. She is shown as a liar and a cheat who does not hesitate to openly admit that she prostituted her body to her first four husbands for material gain, and used all manner of deceitful devices to achieve \"mastery\" over them. From The Wife of Bath’s Prologue : (as translated) \"Deceit, weeping, and spinning, God doth giveTo women kindly, while that they may live. *naturallyAnd thus of one thing I may vaunte me,At th' end I had the better in each degree,By sleight, or force, or by some manner thing\" (Just as a side note, it is interesting to note the use of the word \"spinning\" whereas Alisoun's occupation is that of a weaver.) The latter quotation is just one example of the kind of self-revilement that goes on right through the Wife's own description of her relationships with her first four husbands, often extending the negative attributes of the Wife to the female gender in general. To make matters worse, the wife openly admits that she did not love these four husbands, and often feigned lust just to gain more of an advantage over them.The Wife as the product of a male construct is never more apparent than in her repeated mention of her own genitals. Over and over she mentions her own genitals (thereby objectifying the female as an object whose sole function is the sexual gratification of males) and how her husbands praised this part of her body. She also mentions how she could have sold it, (her vulva), but kept it for her husband instead (in the sense of a bargaining piece), which does seem to me to have strong overtones of suggesting that wives are little more than prostitutes.What eyleth yow to grucche thus and grone?\tIs it for ye wolde have my queynte allone?\tWy, taak it al! lo, have it every deel! The playful tone of most of the passages in the prologue, in which the wife tends to contradict herself at times, suggests to me that they were written as entertainment largely for males, who in those times (The Canterbury Tales were thought to have been written around the 1380's) dominated the literate world. This alone, would in my view be enough to establish a claim of this text being misogynist, albeit as a product, to a large extent, of the milieu that Chaucer found himself in. However, one of the contexts in which I feel it is useful to view the Wife of Bath, is the phenomenon of Chaucer's criticism of the Catholic Church, that pervades the Canterbury tales.From a historical background, the Black Death had not only opened the way for a stronger Bourgeoisie class, and for a stronger base in medieval society for property rights for women, (which was helped along by the fact that many males were absent/died during the Crusades) but it also weakened the grip of the Catholic Church, which was further weakened by the Western Schism, and which scenario set the stage for the Church Reformation which took place a bit later on in the course of history.During the fourteenth century (Chaucer was born in 1343), the Catholic church was still very powerful, and many clergy abused their position of psychological power in order to gain temporal power, wealth, and it would seem, sexual/sensual gratification as well.Chaucer seems to have been well aware of the various types of corruption that members of the Catholic institution was guilty of, from hypocrisy to avarice, to all sorts of clandestine sexual practices, which Chaucer hints at when describing the Friar, one of the Canterbury Pilgrims.When, at the beginning of the Wife's tale, mention is made that:\"Wommen may go saufly up and doun.In every bussh or under every treeTher is noon oother incubus but he,  (referring to \"holy\" friairs)And he ne wol doon hem but dishonour\",  one wonders if Chaucer is referring to the kind of sexual misconduct apparently practiced by the clergy in the 1300's- 1400's that Amanda Hopkins mentions in her article: \"Sex, the State and the Church in the Middle Ages: An Overview\".According to a footnote in the above-mentioned article, \"The evidence of medieval authors, Boccaccio and Chaucer among them, suggests that celibacy was not universally practiced by the clergy. In an examination of legal records from the Paris area in the fourteenth and fifteenth centuries, Kathryn Gravdal finds evidence of gang rape:\"These collective rapes seem to have been youthful sprees. Patterns in the records indicate, however, that when young clerics eventually became priests and rectors, they continued to practice sexual abuse and these constituted the second largest group of rapists brought to trial in the Cerisy court. … This finding corresponds to the figures Hanawalt and Carter have established for the clergy in thirteenth- and fourteenth-century England, where clerics constituted the largest group to stand trial for rape in the secular courts. The power and prestige of their office may have led them to commit sexual abuses with a certain regularity\" The implication of the above-mentioned research, that Chaucer might have been hinting at actual rapes being perpetrated by the clergy, seems so shocking to me, that I find it understandable that the allusion to \"gang-rape by the clergy\" in these passages was probably never entertained by critics like Louise O. Fradenburg, who assumes that the substitution of incubi by friars is merely a demystification, and Luarie Finke, who sees in it symbolism of changes to the economic structure of the medieval world.The sexual activity of the clergy is especially ironic in view of the strong stance the Church officially took against the expression of any sexuality, whether hetero- or homosexual.We jest in today's modern age about conservatives who decree that sexual intercourse is only admissible when it is vaginal heterosexual intercourse between married partners, in the missionary position, in the dark, and preferable partly clothed; but absolutely no joking: - this is exactly what the Medieval Catholic Church decreed. Any deviance from the above-mentioned, was punishable by having to do 'penances'; even, for instance, for the 'sin' of married heterosexual intercourse with the woman on top, or intercourse with the wife facing away from the husband.The Pardoner who is one of the pilgrims in the Canterbury Tales, was one of the people who could gather money from the populace in order to gain pardons for such terrible crimes as, for instance, having intercourse in 'inadmissible' positions, or the even more unforgivable sin of actually enjoying it.In view of the above and other hints throughout the rest of the Canterbury Tales, I think that a lot of what the wife says, is actually a parody of some of the negative attitudes the Catholic church held about women and marriage, and was just an additional but more subtle way in which Chaucer was criticizing the Catholicism of the day, along with his more obvious digs at the Pardoner, Summoner, Friar and Prioress who take part in the Canterbury pilgrimage.So if one looks at it in this way, one sees tempered, to some extent, what seems at first to be a blatant misogynist stance by Chaucer, and one cannot help wondering if he is not perhaps showing up how extreme (and rather silly and unpractical) the anti-feminism of the Church is, by parodying their stance, (via what the husband's say) and then having the Wife reply with rhetoric that she borrows either from the Bible or from common sense.To go along with my anti-feminist impression, there is, in addition, also the aspect of male/female violence in both the Prologue and the Tale, especially male upon female violence and the apparent suggestion in the prologue, that all women are inherently masochists, and the underlying misogynism that the latter implies.In The Wife of Bath’s Prologue Alison introduces her fifth husband thus:(I'm quoting a Librarius.com translation) And now of my fifth husband will I tell. 510\tGod grant his soul may never get to Hell! \tAnd yet he was to me most brutal, too; \tMy ribs yet feel as they were black and blue, \tAnd ever shall, until my dying day. \tBut in our bed he was so fresh and gay, 515\tAnd therewithal he could so well impose, \tWhat time he wanted use of my belle chose, \tThat though he'd beaten me on every bone, \tHe could re-win my love, and that full soon. \tI guess I loved him best of all, for he 520\tGave of his love most sparingly to me. \tWe women have, if I am not to lie, \tIn this love matter, a quaint fantasy; \tLook out a thing we may not lightly have, \tAnd after that we'll cry all day and crave. 525\tForbid a thing, and that thing covet we; These passages seem to suggest that Alison forgave Janken for beating her, and even liked him visiting violence upon her, or at least felt excited by it, and that the violence and his withholding love from her, made her crave his love even more. I personally agree to a large extent with Hansen about these passages; that does certainly seem to be what these specific passages are saying.The passages describing the imaginary bloody dream that Alisoun uses to draw Jankyn's attention with, to me also has disturbing sadomasochistic violent overtones, but since these passages are included in the Ellesmere manuscript, but not the Hengwrt manuscript, and there is therefore doubt that Chaucer himself wrote the passages, I will not include these passages regarding the dream in my discussion.This theme of violence is continued in Alison's tale, in which an Arthurian knight rapes a maiden upon first sight, despite her avid protestations.The female condonement and acceptance of this behavior is carried through in how the queen and female courtiers want the knight spared.From The Wife of Bath’s Prologue :\"Paraventure, swich was the statut tho -But that the queene and othere ladyes moSo longe preyeden the kyng of grace,Til he his lyf hym graunted in the place,And yaf hym to the queene al at hir wille,\"So, once again, females are accepting of male violence. However, the message in the Wife's Prologue soon becomes a contradictory one. At the end of the tale,\t\"But atte laste, with muchel care and wo,\tWe fille acorded by us selven two.\tHe yaf me al the bridel in myn hond,820\tTo han the governance of hous and lond,\tAnd of his tonge, and of his hond also,\tAnd made hym brenne his book anon right tho.\tAnd whan that I hadde geten unto me\tBy maistrie, al the soveraynetee,825\tAnd that he seyde, 'Myn owene trewe wyf,\tDo as thee lust the terme of al thy lif,\tKeepe thyn honour, and keep eek myn estaat,' -\tAfter that day we hadden never debaat.\tGod help me so, I was to hym as kinde830\tAs any wif from Denmark unto Ynde,\tAnd also trewe, and so was he to me. \" Take note, that the Wife responds positively to the fact that this man now gave her \" soveraynetee\". She becomes kind to him in return, just as the old woman in the Wife's tale becomes beautiful, young and obedient, the moment that he lets her choose, that he gives her \"maistrie\".This is a rather confusing message if one takes into account that the Wife's first 4 husbands did not rule her in the first place, but she treated them very badly indeed. What then would be the difference between the first 4 husbands and Jankin and the Knight?I am able to discern three differences:1. The first four husbands did not have the wherewithall to \"rule\" Alison, even if they wanted to. She ruled then in any case, by: \"sleighte, or force, or by som maner thing,\"2. Both Jankin and the Knight forced dominance over women by dint of physical violence,and3.Both Jankin and the Knight, in the end voluntarily gave \"maistrie\" to their wives, and through that act, gained their wive's obedience.The dominance aspect puzzled me at first. Why would the Wife want 'mastery' or dominance, when it would be so much better just to ask for equality?Then I remembered that the Wife is not a real woman after all, but a \"puppet\" in the hands of a male, of Geoffrey Chaucer. Equality is more of a female concept while dominance is more of a male concept. Another aspect of the theme of dominance, might also be seen in context of the kind of feudal society that Chaucer found himself in. Although the absolute power of the aristocracy was waning, monarchy was still very much the order of the day; - there was only one (secular) 'boss' (the king) in the country, and he (theoretically) had absolute power.So perhaps part of the answer lies with the fact that from Chaucer's point of view, only one person can rule in a marriage, just as only one sovereign can rule a nation. (Never mind the fact that one might question whether it was really the temporal sovereign or the \"Spiritual\" sovereign (- the Pope, or Church) that ruled). Perhaps it is the very power play between Church and State of the time that Chaucer lived in that made dominance such an important thing to have. The Greeks and Romans of antiquity might have understood how to share power, but the sharing of power is not a very familiar concept in the Europe that Chaucer lived in.On a further point, I started to find this \"give over power in order to have power\" concept in the message that the Wife gives, a bit less puzzling when I read the introduction to the Nevill Coghill translation of the Canterbury tales. From the introduction by Nevill Coghill:\"It could be debated whether love could ever have a place in marriage; the typical \tsituation in which a 'courtly lover' found himself was to be plunged in a secret, and illicit, and even an adulterous passion for some seemingly unattainable and pedestalized lady. Before his mistress a lover was prostrate, wounded to death by her beauty, killed by her disdain, obliged to an illimitable constancy, marked out for dangerous service. A smile from her was in theory a gracious reward for twenty years of painful adoration. All Chaucer's heroes regard love when it comes upon them as the most beautiful of absolute disasters, and agony as much desired as bemoaned, ever to be pursued, never to be betrayed. ...This was not in theory the attitude of a husband to his wife. It was for a husband to command, for a wife to obey. The changes that can be rung on these antithesis are to be seen throughout the Canterbury Tales.\" This is the only kind of \"maistrie\", of \" soveraynetee\" or \"government\" that to me personally, would make sense in the final words of the wife, when she says: \"And eek I praye Jhesu shorte hir lyvesThat noght wol be governed by hir wyves.\" However, I am a female, thinking with a female mind, and whether that is what Chaucer had meant the Wife's intention to be, I do not know.I have already demonstrated at length what I find to be the antifeminist aspects of the Wife of Bath's Prologue and Tale, namely the negative ways in which Alisoun portrays herself (a materialistic, power-hungry, nasty, nagging, cheating liar), and also in how readily females accept male-upon-female violence in the text of both the prologue and the tale of the Wife of Bath.However, there are aspects of the Wife's Prologue and Tale that temper this misogyny. As I demonstrated, it is highly probable that a lot of the criticism that Alisoun and her husbands direct against women, are actually opinions expressed by the Catholic Church, who had a very strong censure against the expression of sexuality.So to me, part of Chaucer's \"pro-feminism\" lies in how he seems to point out how non-sensical and unpractical many of the Church's teaching regarding sexuality, women and marriage was.As confusing as Chaucer's point of view regarding female masochism might be for the \"moral of the story\", it is true, that in both the wife's prologue and in her tale, male violence is tempered, the male 'learns' not to visit violence upon women, and the females in the text do seem to rejoice in this cessation of violence.I do not, like some feminists suggest, see the reward the knight gets at the end of the story, as being a reward for his violence. I see the reward he gets, in fact, as a reward for the cessation of violence.Chaucer seems to encourage the code of chivalry which to me is a good thing, inasmuch as it decries violence against women.It seems to me that here Chaucer is trying to say that males can get what they want, being 'female submissiveness and obedience' rather by dint of 'gentleness and nobility' than by force and violence, which is ignoble, and likely to cause a backlash to boot.Even though female obedience is still the desired outcome of Chaucer's patriarchal world-view, perhaps it is infinitely better to have an obedience that is obtained through courtly love and romantic ideals, or through deference or even basic respect and gentility, than through force and violence."}, {"userName": "Traveller", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/3145526-traveller", "userReview": "Since there has been such a spate of reviews on Goodreads recently, attending to texts that contain the depiction of female masochistic tendencies, I decided to go all the way and go way back to the first text we know of in English that contains this, being Geoffrey Chaucer's Wife of Bath's prologue and tale.Both the tale and prologue depicts violence visited upon women, and in the prologue, it is initially even welcomed by the woman, for love of the man inflicting the violence; but just like Ana in 50 Shades of Grey, Alison decided eventually that she didn't like it, and decided to reform her attractive, sexy fifth husband Janken into more couth ways.Arriving at a definite stance on how to interpret the message or the character of Chaucer's Wife of Bath, is not an easy task. The Wife of Bath is probably one of the characters that there seems to be least agreement upon, in the entirety of English literature, or such has been my own experience when reading scholarly interpretation upon scholarly interpretation, in order to try and clear my own confusion as to exactly what it is that the Wife herself is saying, and moreover, what Chaucer is generally saying with his creation of the Wife and her Tale.I have come to the conclusion that the Wife of Bath is at the same time an expression of anti-feminism, and to a smaller extent of pro-feminism, each in different aspects and contexts.I was taken aback, when I read the Wife's Prologue originally, by the apparent (to me) anti-feminism in this piece. It is quite easy to see the anti-feminist voice Chaucer is speaking with. In the Prologue to the tale, Chaucer seems to be mocking and satirizing a bossy, nagging wife - the kind of wife that most men dread and would find hard to handle.Comments upon her from scholars seem varied; some praise her as the first feminist, though many feminists see past that and also see a male voice making a hateful parody of the female gender, and of wives in particular, but they also note and comment quite strongly upon the theme of violence weaved into this tale.Chaucer does not paint a pretty picture of the Wife in her Prologue. She is shown as a liar and a cheat who does not hesitate to openly admit that she prostituted her body to her first four husbands for material gain, and used all manner of deceitful devices to achieve \"mastery\" over them. From The Wife of Bath’s Prologue : (as translated) \"Deceit, weeping, and spinning, God doth giveTo women kindly, while that they may live. *naturallyAnd thus of one thing I may vaunte me,At th' end I had the better in each degree,By sleight, or force, or by some manner thing\" (Just as a side note, it is interesting to note the use of the word \"spinning\" whereas Alisoun's occupation is that of a weaver.) The latter quotation is just one example of the kind of self-revilement that goes on right through the Wife's own description of her relationships with her first four husbands, often extending the negative attributes of the Wife to the female gender in general. To make matters worse, the wife openly admits that she did not love these four husbands, and often feigned lust just to gain more of an advantage over them.The Wife as the product of a male construct is never more apparent than in her repeated mention of her own genitals. Over and over she mentions her own genitals (thereby objectifying the female as an object whose sole function is the sexual gratification of males) and how her husbands praised this part of her body. She also mentions how she could have sold it, (her vulva), but kept it for her husband instead (in the sense of a bargaining piece), which does seem to me to have strong overtones of suggesting that wives are little more than prostitutes.What eyleth yow to grucche thus and grone?\tIs it for ye wolde have my queynte allone?\tWy, taak it al! lo, have it every deel! The playful tone of most of the passages in the prologue, in which the wife tends to contradict herself at times, suggests to me that they were written as entertainment largely for males, who in those times (The Canterbury Tales were thought to have been written around the 1380's) dominated the literate world. This alone, would in my view be enough to establish a claim of this text being anti-feminist, albeit as a product, to a large extent, of the milieu that Chaucer found himself in. However, one of the contexts in which I feel it is useful to view the Wife of Bath, is the phenomenon of Chaucer's criticism of the Catholic Church, that pervades the Canterbury tales.From a historical background, the Black Death had not only opened the way for a stronger Bourgeoisie class, and for a stronger base in medieval society for property rights for women, (which was helped along by the fact that many males were absent/died during the Crusades) but it also weakened the grip of the Catholic Church, which was further weakened by the Western Schism, and which scenario set the stage for the Church Reformation which took place a bit later on in the course of history.During the fourteenth century (Chaucer was born in 1343), the Catholic church was still very powerful, and many clergy abused their position of psychological power in order to gain temporal power, wealth, and it would seem, sexual/sensual gratification as well.Chaucer seems to have been well aware of the various types of corruption that members of the Catholic institution was guilty of, from hypocrisy to avarice, to all sorts of clandestine sexual practices, which Chaucer hints at when describing the Friar, one of the Canterbury Pilgrims.When, at the beginning of the Wife's tale, mention is made that:\"Wommen may go saufly up and doun.In every bussh or under every treeTher is noon oother incubus but he,  (referring to \"holy\" friairs)And he ne wol doon hem but dishonour\",  one wonders if Chaucer is referring to the kind of sexual misconduct apparently practiced by the clergy in the 1300's- 1400's that Amanda Hopkins mentions in her article: Sex, the State and the Church in the Middle Ages: An Overview.According to a footnote in the abovementioned article, \"The evidence of medieval authors, Boccaccio and Chaucer among them, suggests that celibacy was not universally practised by the clergy. In an examination of legal records from the Paris area in the fourteenth and fifteenth centuries, Kathryn Gravdal finds evidence of gang rape: ‘These collective rapes seem to have been youthful sprees. Patterns in the records indicate, however, that when young clerics eventually became priests and rectors, they continued to practice sexual abuse and these constituted the second largest group of rapists brought to trial in the Cerisy court. … This finding corresponds to the figures Hanawalt and Carter have established for the clergy in thirteenth- and fourteenth-century England, where clerics constituted the largest group to stand trial for rape in the secular courts. The power and prestige of their office may have led them to commit sexual abuses with a certain regularity’ The implication of the above-mentioned research, that Chaucer might have been hinting at actual rapes being perpetrated by the clergy, seems so shocking to me, that I find it understandable that the allusion to \"gang-rape by the clergy\" in these passages was probably never entertained by critics like Louise O. Fradenburg, who assumes that the substitution of incubi by friars is merely a demystification, and Luarie Finke, who sees in it symbolism of changes to the economic structure of the medieval world.The sexual activity of the clergy is especially ironic in view of the strong stance the Church officially took against the expression of any sexuality, whether hetero- or homosexual.We jest in today's modern age about conservatives who decree that sexual intercourse is only admissible when it is vaginal heterosexual intercourse between married partners, in the missionary position, in the dark, and preferable partly clothed; but absolutely no joking: - this is exactly what the Medieval Catholic Church decreed. Any deviance from the abovementioned, was punishable by having to do \"penances\"; even, for instance, for the 'sin' of married heterosexual intercourse with the woman on top, or intercourse with the wife facing away from the husband.The Pardoner who is one of the pilgrims in the Canterbury Tales, was one of the people who could gather money from the populace in order to gain pardons for such terrible crimes as, for instance, having intercourse in 'inadmissible' positions, or the even more unforgivable sin of actually enjoying it.In view of the above and other hints throughout the rest of the Canterbury Tales, I think that a lot of what the wife says, is actually a parody of some of the negative attitudes the Catholic church held about women and marriage, and was just an additional but more subtle way in which Chaucer was criticizing the Catholicism of the day, along with his more obvious digs at the Pardoner, Summoner, Friar and Prioress who take part in the Canterbury pilgrimage.So if one looks at it in this way, one sees tempered, to some extent, what seems at first to be a blatant anti-feminist stance by Chaucer, and one cannot help wondering if he is not perhaps showing up how extreme (and rather silly and unpractical) the antifeminism of the Church is, by parodying their stance, (via what the husband's say) and then having the Wife reply with rhetoric that she borrows either from the Bible or from common sense.To go along with my anti-feminist impression, there is, in addition, also the aspect of male/female violence in both the Prologue and the Tale, especially male upon female violence and the apparent suggestion in the prologue, that all women are inherently masochists, and the underlying misogynism that the latter implies.In The Wife of Bath’s Prologue Alison introduces her fifth husband thus:(I'm quoting a Librarius.com translation) And now of my fifth husband will I tell. 510\tGod grant his soul may never get to Hell! \tAnd yet he was to me most brutal, too; \tMy ribs yet feel as they were black and blue, \tAnd ever shall, until my dying day. \tBut in our bed he was so fresh and gay, 515\tAnd therewithal he could so well impose, \tWhat time he wanted use of my belle chose, \tThat though he'd beaten me on every bone, \tHe could re-win my love, and that full soon. \tI guess I loved him best of all, for he 520\tGave of his love most sparingly to me. \tWe women have, if I am not to lie, \tIn this love matter, a quaint fantasy; \tLook out a thing we may not lightly have, \tAnd after that we'll cry all day and crave. 525\tForbid a thing, and that thing covet we; These passages seem to suggest that Alison forgave Janken for beating her, and even liked him visiting violence upon her, or at least felt excited by it, and that the violence and his withholding love from her, made her crave his love even more. I personally agree to a large extent with Hansen about these passages; that does certainly seem to be what these specific passages are saying.The passages describing the imaginary bloody dream that Alisoun uses to draw Jankyn's attention with, to me also has disturbing sadomasochistic violent overtones, but since these passages are included in the Ellesmere manuscript, but not the Hengwrt manuscript, and there is therefore doubt that Chaucer himself wrote the passages, I will not include these passages regarding the dream in my discussion.This theme of violence is continued in Alison's tale, in which an Arthurian knight rapes a maiden upon first sight, despite her avid protestations.The female condonement and acceptance of this behaviour is carried through in how the queen and female courtiers want the knight spared :From The Wife of Bath’s Prologue :\"Paraventure, swich was the statut tho -But that the queene and othere ladyes moSo longe preyeden the kyng of grace,Til he his lyf hym graunted in the place,And yaf hym to the queene al at hir wille,\"So, once again, females are accepting of male violence. However, the message in the Wife's Prologue soon becomes a contradictory one. At the end of the tale,\t\"But atte laste, with muchel care and wo,\tWe fille acorded by us selven two.\tHe yaf me al the bridel in myn hond,820\tTo han the governance of hous and lond,\tAnd of his tonge, and of his hond also,\tAnd made hym brenne his book anon right tho.\tAnd whan that I hadde geten unto me\tBy maistrie, al the soveraynetee,825\tAnd that he seyde, 'Myn owene trewe wyf,\tDo as thee lust the terme of al thy lif,\tKeepe thyn honour, and keep eek myn estaat,' -\tAfter that day we hadden never debaat.\tGod help me so, I was to hym as kinde830\tAs any wif from Denmark unto Ynde,\tAnd also trewe, and so was he to me. \" Take note, that the Wife responds positively to the fact that this man now gave her \" soveraynetee\". She becomes kind to him in return, just as the old woman in the Wife's tale becomes beautiful, young and obedient, the moment that he lets her choose, that he gives her \"maistrie\".This is a rather confusing message if one takes into account that the Wife's first 4 husbands did not rule her in the first place, but she treated them very badly indeed. What then would be the difference between the first 4 husbands and Jankin and the Knight?I am able to discern three differences:1. The first four husbands did not have the wherewithall to \"rule\" Alison, even if they wanted to. She ruled then in any case, by: \"sleighte, or force, or by som maner thing,\"2. Both Jankin and the Knight, forced dominance over women by dint of physical violence,and3.Both Jankin and the Knight, in the end voluntarily gave \"maistrie\" to their wives, and through that act, gained their wive's obedience.The dominance aspect puzzled me at first. Why would the Wife want 'mastery' or dominance, when it would be so much better just to ask for equality?Then I remembered that the Wife is not a real woman after all, but a \"puppet\" in the hands of a male, of Geoffrey Chaucer. Equality is more of a female concept while dominance is more of a male concept. Another aspect of the theme of dominance, might also be seen in context of the kind of feudal society that Chaucer found himself in. Although the absolute power of the aristocracy was waning, monarchy was still very much the order of the day; - there was only one (secular) 'boss'(the king) in the country, and he (theoretically) had absolute power.So perhaps part of the answer lies with the fact that from Chaucer's point of view, only one person can rule in a marriage, just as only one sovereign can rule a nation. (Nevermind the fact that one might question whether it was really the temporal sovereign or the \"Spiritual\" sovereign (- the Pope, or Church) that ruled). Perhaps it is the very power play between Church and State of the time that Chaucer lived in that made dominance such an important thing to have. The Greeks and Romans of antiquity might have understood how to share power, but the sharing of power is not a very familiar concept in the Europe that Chaucer lived in.On a further point, I started to find this \"give over power in order to have power\" concept in the message that the Wife gives, a bit less puzzling when I read the introduction to the Nevill Coghill translation of the Canterbury tales. From the introduction by Nevill Coghill:\"It could be debated whether love could ever have a place in marriage; the typical \tsituation in which a 'courtly lover' found himself was to be plunged in a secret, and illicit, and even an adulterous passion for some seemingly unattainable and \tpedestalized lady. Before his mistress a lover was prostrate, wounded to death by \ther beauty, killed by her disdain, obliged to an illimitable constancy, marked out for \tdangerous service. A smile from her was in theory a gracious reward for twenty years of painful adoration. All Chaucer's heroes regard love when it comes upon \tthem as the most beautiful of absolute disasters, and agony as much desired as bemoaned, ever to be pursued, never to be betrayed. ...This was not in theory the attitude of a husband to his wife. It was for a husband to command, for a wife to obey. The changes that can be rung on these antithesis are to be seen throughout the \tCanterbury Tales.\" This is the only kind of \"maistrie\", of \" soveraynetee\" or \"government\" that to me personally, would make sense in the final words of the wife, when she says: \"And eek I praye Jhesu shorte hir lyvesThat noght wol be governed by hir wyves.\" However, I am a female, thinking with a female mind, and whether that is what Chaucer had meant the Wife's intention to be, I do not know.I have already demonstrated at length what I find to be the antifeminist aspects of the Wife of Bath's Prologue and Tale, namely the negative ways in which Alisoun portrays herself (a materialistic, power-hungry, nasty, nagging, cheating liar), and also in how readily females accept male-upon-female violence in the text of both the prologue and the tale of the Wife of Bath.However, there are aspects of the Wife's Prologue and Tale that temper this ant-feminism. As I demonstrated, it is highly probable that a lot of the criticism that Alisoun and her husbands direct against women, are actually opinions expressed by the Catholic Church, who had a very strong censure against the expression of sexuality.So to me, part of Chaucer's \"pro-feminism\" lies in how he seems to point out how non-sensical and unpractical many of the Church's teaching regarding sexuality, women and marriage was.As confusing as Chaucer's point of view regarding female masochism might be for the \"moral of the story\", it is true, that in both the wife's prologue and in her tale, male violence is tempered, the male 'learns' not to visit violence upon women, and the females in the text do seem to rejoice in this cessation of violence.I do not, like some feminists suggest, see the reward the knight gets at the end of the story, as being a reward for his violence. I see the reward he gets, in fact, as a reward for the cessation of violence.Chaucer seems to encourage the code of chivalry which to me is a good thing, inasmuch as it decries violence against women.It seems to me that here Chaucer is trying to say that males can get what they want, being \"female submissiveness and obedience\" rather by dint of 'gentleness and nobility' than by force and violence, which is ignoble, and likely to cause a backlash to boot.Even though female obedience is still the desired outcome of Chaucer's patriarchal world-view, perhaps it is infinitely better to have an obedience that is obtained through courtly love and romantic ideals, or through deference or even basic respect and \"gentility\", than through force and violence."}, {"userName": "Joey Woolfardis", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/4639825-joey-woolfardis", "userReview": "Geoffrey Chaucer was an English 14th Century diplomat and philosopher amongst other things, though is best known for being a Poet and writing the Canterbury Tales. The Canterbury Tales were written during the 100 years war and tell of a group of pilgrims on they way to Canterbury Cathedral to visit the shrine of Thomas Beckett, with the prize being a free meal at an inn. \"You say it's torture to endure her prideAnd melancholy airs, and more besides. And if she had a pretty face, old traitor, You say she's game for any fornicator.\"Each Pilgrim has their own prologue and tale, and this one belongs to the Wife of Bath. This Little Black Classic is different to the usual Chaucer books in that this one has been translated to modern-day English, making it the perfect starting point for anyone who is looking to read some Chaucer but doesn't either known where to start or has been put off by the Middle-English language. \"True poverty can find a song to sing. Juvenal says a pleasant little thing:\"The poor can dance and sing in the reliefOf having nothing that will tempt a thief.\"The Wife of Bath's Prologue, as all the pilgrim's prologue do, contains information about the Pilgrim themselves at first, giving you a taste of their countenance and backstory. Then their tale is told, which in this case is an Arthurian tale of a misogynistic knight who, in exchange for his life, must find out what women truly desire. It is a tale that could have been written in this day and age, and it reminds us just how mediaeval our gender equality and ideals really are in some respects. Relevant, though it shouldn't be.Blog | Instagram | Twitter | Pinterest | Shop | Etsy"}, {"userName": "Peter", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/43011227-peter", "userReview": "Now I remember why I do not like poetry, at school my poetry was considered to be good.Why don't I like it? The teacher would say when you can write like Chaucer then you have mastered the art. Really! His writing is just cheap rhyming from 8 year olds. Whilst the story is interesting his ability is lacking, give the children a chance, there are far better poets in schools than him.YES we were made to read this in school and we, even to this day cannot see what is special. This man killed some childrens imaginations.Chaucer writes by the pantameter;I can rip the pages by the millimeter"}, {"userName": "Chris", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "Dear Authors of certain books,Before you write that book with thinly disguised rape between the two leads, I really think you should read this.Honesty.Thank you."}, {"userName": "Kathryn", "userReviewDate": "May 29, 2012", "userURL": "http://www.goodreads.com/user/show/2847361-kathryn", "userReview": "The wife of Bath is so outrageous in her views its hilarious. there is being a feminist and then there is The Wife of Bath, she takes manipulating men to a whole other level."}, {"userName": "Marjolein", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/5289598-marjolein", "userReview": "Read all my reviews on http://urlphantomhive.booklikes.com We didn't read this in class. Of course, we talked about the Canterbury Tales but actually reading it, no. That's why I was pleased to see it as a part of the Little Black Classics, giving me the opportunity to read a small part without necessary the feeling that I should read it all.The story surprised me in a positive way. Both the Prologue and the actual Tale were far more interesting than anticipated. I'd thought it would be drier and The Wife felt rather modern (as far as I can judge in my limited knowledge of medieval woman).Reading a story all in rhyme however, remains slightly difficult for me and it was rather distracting at times. What I didn't really like was the fact that it was a modernized translation of the text, which made it impossible to judge what the original set. It would have been nice to be able to compare the two.Little Black Classic 28"}, {"userName": "Vaishali", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/13209822-vaishali", "userReview": "Not an entertainer like The Miller's Tale, unless you dig chicks who manipulate men and then blame a male-dominated society. Interesting to see how long this has been happening:) Another example of how Chaucer - a celebrated polymath - understands the masses' mindset and crafts tales still debated today. For a true medieval heroine, meet Christina of Hertfordshire :https://www.youtube.com/watch?v=nsA9U...."}, {"userName": "Ana Rînceanu", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/28781546-ana-r-nceanu", "userReview": "[ When the old hag him what he would prefer—an old ugly hag who is loyal, true and humble or a beautiful woman about whom he would always have doubts concerning her faithfulness, the Knight responds by saying that the choice is hers and she turns magically into a pretty and obedient wife. He just gave her the answer she wanted because he lost nothing by pleasing his wife a.e. making her believe he trusted her judgement. (hide spoiler)]"}, {"userName": "Ceej47", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/17945640-ceej47", "userReview": "First Chaucer I have read I am ashamed to say and I was surprised to find I enjoyed this - may even encourage me to read more of the Canterbury Tales"}, {"userName": "Billierosie Billierosie", "userReviewDate": "Jul 21, 2012", "userURL": "http://www.goodreads.com/user/show/9129065-billierosie-billierosie", "userReview": "She’s the archetypal Dominatrix, and she was created over seven hundred years ago in the fourteenth century by Geoffrey Chaucer. She’s the “Wife of Bath,” and she knew a thing or two about making men behave themselves. Usually, I look to the Greek myths, when I’m searching around for an archetype. Certainly, the myths have their share of strong women, women who really were downright superior to men. The terrifying Medusa, who could turn men, and anyone else for that matter, into stone. Athene threw her weight about a bit and Circe simply turned men into swine -- while Medea took revenge to its absolute bloody limit, by killing the kids. The Bible too, has its share of strong women, some of them quite terrifying. Delilah, Esther, Jezebel. And the quietly strong ones, Ruth and Mary.But as far as I can see, there is no woman before Alyson, the Wife of Bath, who made training the men in her life into an art form.I think that Chaucer was the first writer to create characters as real people. By the end of Alyson’s tyrannical diatribe, where she challenges men in general, and God and the Bible in particular, well, we could argue with her, or cheer her on.The Wife’s appearance is startling. In his introduction to the Wife’s prologue, James Winny tells us;“In her brazen red stockings, her vast hat and wimple, she conforms with the standards of medieval life; noisy, assertive and robust. Her ruddy complexion, her deafness and her widely spaced teeth give her an emphatic personality such as few of the pilgrims can rival…she bursts upon the pilgrimage with the unexpectedness of a bomb, to introduce herself and a group of three connected tales.”Alyson, the Wife of Bath, is de rigueur for the fourteenth century. These days, she would be dressed in black leather, cracking a whip and wearing killer heels. She’d probably be wearing sharply spiked spurs and have a pair of handcuffs jangling from her studded leather belt, which she wears cinched in tight at the waist.She should have a government health warning tattooed on her wide forehead.“Warning to men. Consort with the Wife of Bath at your own risk!"}, {"userName": "Lea", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/24500926-lea", "userReview": "I liked it but since the language was modernized I'd like to read some original Chaucer. I remember hating reading him in school but maybe I was just having a bad week then. I'd be curious to see if I'd like it now. This version was certainly entertaining."}, {"userName": "Phil", "userReviewDate": "Mar 03, 2012", "userURL": "http://www.goodreads.com/user/show/5915778-phil", "userReview": "Continuing my reading of the Canterbury Tales in sections, we come to Fragment III, which contains the prologue and tales for The Wife of Bath, The Friar and The Summoner. Of course the Wife is the star of this section ... in fact, she's probably the star of the whole collection, so vividly is she brought to life. This is a woman who plays life by men's rules - she wants sex, she wants money, she wants control over her own destiny. In Chaucer's day, men could have all these, but women were either saints or whores ... but normally just baby-bearing drudges whose feelings weren't taken into consideration. Marriage -even for the lower classes - wasn't for love, it was either for necessity (due to impending baby) or for financial / social gain. Even as late as Charles II, many centuries later, it was considered acceptable for the King to stock his household with mistresses, such as Nell Gwynne, but heaven forfend that his Queen, Catherine, installed a lover.But the Wife of Bath takes the challenge. Married five times - first time at the age of just 12 - she takes glee in telling us how she made her husbands' lives a misery, through nagging, withholding sex, false accusations and other such games. As her first four husbands were old, wealthy men, she builds up quite a portfolio. She goes into detail of how she makes the men satisfy her lustful cravings (until they cried waylawey) ... and makes no bones about how poor at it they usually were. Then was her fifth husband ... a young man, she married for love (or lust), who she had her eye on even before her fourth husband died. But once married, he berates her with tales of viscious evil wives from a book - until exasperated she tears out a page of the book and punches him in the face ... he then whacks her in the ear and knocks her out, but ... lucky her ... he's so apologetic that he became the perfect dutiful husband. The wife is also very intelligent and in her arguing around religious texts is easily the match of any priests and philosophers who try to convince her that a) she should only have married once and the other 4 weren't her husbands and b) that she should remain chaste and virginal .... but she loves sex far too much for that.After the Wife, the others are a little anticlimactic - the Friar and the Summoner get into a quarrel and proceed to tell a story about each others' profession: the Friar's about a Summoner who makes a pact with the devil and taken to hell, and the Summoner, infuriated and blustering, tells how Friars are so awful that in Hell they live in Satan's arse, then follows a low-brow story about a Friar when trying to embezle money from an old sick man is persuaded to feel in the bed for a gift .. and the old man farts on his hand and tells him to share it between all his colleagues back at the Friarage.They were a bawdy lot in the 14th Century."}, {"userName": "Mahima", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/35841298-mahima", "userReview": "Will write a review once I've read a few essays on this."}, {"userName": "Jule", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/36549340-jule", "userReview": "When you see the publication date of 1372, you would expect literature dry as dust. In rhymes. And language none understands. Well, bless “translators” who put works like this into more modern words. Because as it turns out, they are actually quite enjoyable. This one in particular reaches Shakespearean levels of sass and clever word play. I am pretty sure I did not catch all the sexual innuendo, either. But it is humorous and quick to read, the melody of the rhymes is very easy to follow. The biggest surprise was the content, though: that much feminism and female independence and empowerment is a book that a lot of modern writers and politicians could take a leaf out of. Very entertaining and surprisingly modern, overall."}, {"userName": "Akanksha Chattopadhyay", "userReviewDate": "Aug 19, 2016", "userURL": "http://www.goodreads.com/user/show/24817681-akanksha-chattopadhyay", "userReview": "1.5 would have been ideal, and I decided to round up rather than round below, perhaps because it's great Chaucer. I am not moving on with too many positive feelings from reading this.I don't particularly endorse (perhaps verging on neutrality) the concept of womanhood that Chaucer portrays. The bravery of the text, however, is striking, i.e, for 1300-something.I'd need to go through more critical matter before being able to cement an opinion. Hence, this review may very well change in times to come."}, {"userName": "Liz Janet", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/5114433-liz-janet", "userReview": "A better selection could have been picked, but this one was not as bad as expected. \"Those husbands that I had,Three of them were good and two were bad.The three that I call \"good\"were rich and old.\" Luckily, this was not dry poetry, Chaucer is always good on delivering beautifully dripping prose."}, {"userName": "Noelia Alonso", "userReviewDate": "Dec 14, 2015", "userURL": "http://www.goodreads.com/user/show/23824717-noelia-alonso", "userReview": "Chaucer was one of the very first authors I had to read when I started English Studies at Uni and I highly enjoyed him. The Wife of Bath was a re-read for me and it was as good as the first time I read it, maybe even better."}, {"userName": "Connie", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/6075540-connie", "userReview": "Subbing today so I had to read \"The Wyf of Bath\" aloud to students. And naturally I felt obliged to reciteThe Prologue to Canterbury Tales in Middle English for them. Hadn't had much occasion to use that bit of knowledge in a while!"}, {"userName": "Nora Yahya", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/3487265-nora-yahya", "userReview": "'Those husbands that I had,Three of them were good and two were bad.The three that I call \"good\"were rich and old.'I studied about him in college and I wanted to read some of his work, It's entertaining and fun, though I didn't understand it all.\""}, {"userName": "C.B. Cook", "userReviewDate": "Feb 16, 2016", "userURL": "http://www.goodreads.com/user/show/41747361-c-b-cook", "userReview": "Definitely not my favorite, but a little better content-wise than The Miller's Tale."}, {"userName": "Chloe", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/60168101-chloe", "userReview": "Review to come.Rating - 1/5★"}, {"userName": "Kevin J.J. Carpenter", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/31890347-kevin-j-j-carpenter", "userReview": "Was this medieval feminism? I feel like this was medieval feminism. A bloody good read is what it was."}, {"userName": "Prema Arasu", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/36189170-prema-arasu", "userReview": "The Wife of Bath's tale and her prologue are some of the best parts of The Canterbury Tales. The prologue describes the character of Alison and her marriages and is much longer than the tale she tells.I've looked into critical perspectives having done a short presentation on the Prologue, and I may do a research essay as there is such a wide range of readings, from one end of the feminist spectrum to the other. Alison is a \"satirical deconstruction of the fourteenth century female\", she is \"not to be trusted\", she is \"a subversion of patriarchal expectation\".The Wife's character and her attitudes towards marriage subvert the medieval tradition of courtly love. She speaks freely of her five marriages and enjoyment of sex during a period in which women were expected to be unapproachable, demure and altogether unattainable - at least for a little while during the courtship. In Chaucer's time the church was highly opposed to women remarrying, however, the wife has no shame in her five husbands and willingness to wed again."}, {"userName": "Vipula Sharma", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/7013877-vipula-sharma", "userReview": "A bold and daring book. With a very strong female character. Alison is a true feminist of that time. I loved this book especially the prologue. And the notion of women yearning for freedom is so apt. A marvelous book."}, {"userName": "Ellen", "userReviewDate": "Jul 20, 2016", "userURL": "http://www.goodreads.com/user/show/30730656-ellen", "userReview": "Snarky, tongue -in -cheek, incredibly modern tale."}, {"userName": "Devon", "userReviewDate": "Jul 15, 2012", "userURL": "http://www.goodreads.com/user/show/814746-devon", "userReview": "The Wife of Bath is a boss."}, {"userName": "Andreea", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/22596862-andreea", "userReview": "I'm really surprised I liked this, I don't usually like books that I have to read for school/college but this was a pleasant surprise. And it doesn't hurt that it's a really short story."}, {"userName": "R.L.", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/46340789-r-l", "userReview": "Κριτική στα Ελληνικά πιο κάτω...I am a bit embarrassed to admit that been Greek, \"Canterbury Tales\" was nothing more than a name I was stumping upon here and there during the years, without realizing what exactly is its significance for English literature. This little book was a good excuse to familiarize my self with Canterbury Tales and wet my appetite to read the whole thing someday. \"The Wife of Bath\" is translated from Middle to contemporary English and this made things easier for me who I'm not a fluent English-speaker in its modern form, let alone on its older versions.I was pleasantly surprised by the theme of this story and the topics it touched. Talking about sex and how to deceive your husbands in order to make them your pets or how Jesus or Paul never spoke of virginity and such things, or how David and Solomon were polygamous, so what's the commotion about been married five times, seem quite a risky subject for the late 14th century. Then of course I read some stuff about the historical conditions at the time and understood why Geoffrey Chaucer might have been so daring.I'm not very much into poetry or texts in verses, but I like to try something from this genre occasionally and this one was an easy and pleasant read. A very poignant, satirical and funny narrative for sure! Λοιπόν τελικά αυτή η σειρά από τις εκδόσεις Penguin αποδεικνύεται πολύ χρήσιμη. Συνεχώς ανακαλύπτω καινούρια πράγματα και συγγραφείς. Ορισμένα βιβλία (όπως αυτό εδώ) είναι πολύ αποσπασματικά βέβαια, για παράδειγμα πόσο νόημα έχει να διαβάσει κανείς μόνο μία ραψωδία της Οδύσσειας του Ομήρου; Κι όμως, αν δεν έχει ξανακούσει ποτέ για τον Όμηρο ή αν κάτι είχε ακουστά αλλά ποτέ δεν είχε έρθει σε επαφή με το έργο του, μπορεί έστω μια ραψωδία να αποτελέσει έναυσμα να αναζητήσει ολόκληρο το έργο. Έτσι κι εδώ, το The Wife of Bath είναι ένα πολύ μικρό μέρος των Canterbury Tales, αλλά μου κέντρισε την περιέργεια να διαβάσω ολόκληρο το έργο κάποια στιγμή. Το κείμενο είναι γραμμένο με τρομερό μπρίο και χιούμορ και πολύ τολμηρό για την εποχή του. Βεβαίως αναζήτησα περισσότερες πληροφορίες για το ιστορικό πλαίσιο εκείνης της εποχής στην Βρετανία, το οποίο δικαιολογεί την θεματολογία του ως ένα βαθμό.Ενδιαφέρον βιβλιαράκι, διαβάστε το ακόμα κι αν δεν είστε πολύ της ποίησης..."}], "description": "Adopted at more than 1,000 colleges and universities, Bedford/St. Martin's innovative Case Studies in Contemporary Criticism series has introduced more than a quarter of a million students to literary theory and earned enthusiastic praise nationwide. Along with an authoritative text of a major literary work, each volume presents critical essays, selected or prepared especially for students, that approach the work from several contemporary critical perspectives, such as gender criticism and cultural studies. Each essay is accompanied by an introduction (with bibliography) to the history, principles, and practice of its critical perspective. Every volume also surveys the biographical, historical, and critical contexts of the literary work and concludes with a glossary of critical terms. New editions reprint cultural documents that contextualize the literary works and feature essays that show how critical perspectives can be combined.", "title": "The Wife of Bath", "url": "http://www.goodreads.com/book/show/963617.The_Wife_of_Bath", "average": 3.58, "cover": "https://images.gr-assets.com/books/1315792980l/963617.jpg", "reviews": 125, "authors": [{"url": "https://www.goodreads.com/author/show/1838.Geoffrey_Chaucer", "name": "Geoffrey Chaucer"}, {"url": "https://www.goodreads.com/author/show/50404.Peter_G_Beidler", "name": "Peter G. Beidler"}], "type": ["Classics", "Poetry", "Academic", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/963617.The_Wife_of_Bath", "http://www.goodreads.com/book/show/24874339-the-wife-of-bath", "http://www.goodreads.com/book/show/1021734.The_Wife_of_Bath_s_Prologue_and_Tale", "http://www.goodreads.com/book/show/490869.The_Wife_of_Bath_s_Prologue_and_Tale", "http://www.goodreads.com/book/show/26059224-the-wife-of-bath", "http://www.goodreads.com/book/show/2696.The_Canterbury_Tales", "http://www.goodreads.com/book/show/2711.The_Riverside_Chaucer", "http://www.goodreads.com/book/show/820905.Troilus_and_Criseyde", "http://www.goodreads.com/book/show/142033.Chanticleer_and_the_Fox", "http://www.goodreads.com/book/show/37782.The_Canterbury_Tales", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}