{"ratings": 163, "userreviews": [{"userName": "Toni Allen", "userReviewDate": "Nov 13, 2012", "userURL": "http://www.goodreads.com/user/show/14245119-toni-allen", "userReview": "When people hear the name Winston Graham they immediately think Poldark. Well, he also wrote other, exceptionally good books.The walking Stick is one of my all time favourites. It's a slim volume so I have to be careful not to give too much of the plot away. The story revolves around a young woman who uses a walking stick. As the story unfolds we discover that her withered leg is due to having been ill as a child with polio and she now hates confined spaces because she spent so much time in an iron lung. This in itself might make us pity her, but when we witness her having breakfast at home with her two stuffy parents and discover that they are both doctors...suddenly we realise that she's an embarassment to them; and that her disability is as crippling to them as to her.Into her restricted, solitary life, appears a young man. He flirts, she falls in love, something she never thought possible. After all, who would find a cripple attractive?Written in 1967 the book is set against the fast paced life of the swinging sixities with all of its seedy undercurrants. The reader is immediately transported to the hub of 60s life and shown the stark contrast beween the parents' properness and the laid back beetnik culture; a freer way of living that beguiles an unhappy young woman into falling in love with a man who may not be all he claims to be."}, {"userName": "LemonLinda", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/1541888-lemonlinda", "userReview": "Winston Graham writes this mystery/thriller almost as a social commentary on English society. It is written in the 1960s and the main character is handicapped as a polio survivor. She is one of three daughters in a somewhat unemotional family of all doctors, but she rejected the preferred family career path and works instead at a Christie's type auction house. So she has daily access to priceless antiques, beautiful jewels, etc. Enter a young man that she meets at a party at her sister's house who immediately is attracted to her and no matter many times she ignores him or rejects him, he continues his pursuit. And so the question arises as to why he will not take no for an answer. His determination for a relationship is seemingly beyond the norm and why would that be? Is it simply because it was love at first sight, is he one of those who has a fetish for a handicap or is it because of her connection to the auction house. It turns out that he comes from quite a different economic and social background and has a connection to a shady element. So questions arise. Will he win her favor? If so, where will that lead them? And how will she extricate herself from their influence? This is a great mystery where things don't necessarily turn out as expected. It is a quick and easy read, but one that makes you think over and beyond."}, {"userName": "Laura", "userReviewDate": "Feb 21, 2011", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "Sometimes I woke in the middle of the night and said, you fool, you twisted little beast; and the man beside me was asleep, a heavy young man, solid limbed, white limbed, gentle handed, kind mouthed; so I said, well, the it is, you traded love for integrity....And what is integrity? Can you feel it, can you taste it, as you can feel and taste love?To whom anyway did I fundamentally owe any loyalty except to Leigh? And I would turn over and try to hold his hand, as if that were the only thing in a world that didn't seem to have a lot of certainty any more."}, {"userName": "David Linzee", "userReviewDate": "Dec 04, 2015", "userURL": "http://www.goodreads.com/user/show/49718184-david-linzee", "userReview": "This is one of those rare suspense novels that manages to be compelling reading without a murder...without any physical violence at all. (There's plenty of emotional violence.) It's a tale of psychological suspense that brings to mind Henry James, especially \"Washington Square\" in the richness and ambiguity of the characters and their motives. It has also, by now, acquired interest as a portrait of London just before it began to swing. If you only know Graham from the Poldark novels or their TV adaptations, this can serve as an introduction to his fine suspense novels."}, {"userName": "Naomi", "userReviewDate": "Mar 09, 2012", "userURL": "http://www.goodreads.com/user/show/1148175-naomi", "userReview": "Deborah Dainton has built a very quiet life for herself being a trusted and highly skilled employee of an auction house. When she is swept off her feet by Leigh Hartly, she cannot understand why he would fall in love with someone that has had polio and limps noticely. She uses a cane to walk and relies on it to fend off people that might ask her unwanted questions. Her love for Leigh leads her down a path that endangers everything she has lived for. Set in England."}, {"userName": "Sonia Gomes", "userReviewDate": "Dec 20, 2009", "userURL": "http://www.goodreads.com/user/show/1948955-sonia-gomes", "userReview": "Debra Dainton, has polio, but with the aid of a cane is able to manage very well, although attractive has a limited social life, as she is self conscious about her disability. Her job appraising precious chinaware for Whittington Auction House, brings her into contact with bohemian artist Leigh Hartly and slowly falls in love with him. This boyfriend uses her to rob the auction house.Although betrayed, lost and sad, Debra proves to be gutsy and honest."}, {"userName": "June", "userReviewDate": "Feb 08, 2008", "userURL": "http://www.goodreads.com/user/show/683959-june", "userReview": "A surprising novel. Reminded me quite a bit of Marnie. Story of a disabled young woman who finds herself caught up in a life of crime. Except, Deborah didn't even realize that she was becoming a criminal. Hard to put down once started."}, {"userName": "Teryl", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/3125513-teryl", "userReview": "A real favourite, the movie was good too."}, {"userName": "CLM", "userReviewDate": "Mar 01, 2008", "userURL": "http://www.goodreads.com/user/show/206027-clm", "userReview": "Suspenseful and heartbreaking; hard to put down."}, {"userName": "Mrs Vajragupta Hayes", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/67842917-mrs-vajragupta-hayes", "userReview": "Other than the Poldark series, I'd not read any others by Graham. I was partly attracted to the title as I'm a disabled woman who grew up in the 1960s. Like some of the other reviewers, I felt frustrated that Deborah was so gullible. However, I also recognised that disability was viewed in a very different way compared to today. Although she is beautiful and intelligent, her confidence is very superficial because of her withered leg and Leigh gets behind her defences as she falls in love with him. What I found interesting was that although early on I guessed what was going to happen, the story was still gripping. I wasn't quite so convinced by her behaviour at the height of the drama!! (I shan't give any more away). A thoroughly good read."}, {"userName": "Helena", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/34195481-helena", "userReview": "Una sorpresa que enconté en una librería de usados tirada, literalmente, en el piso que no dejo que la suelte en todos estos días. Adictiva, inteligente y sensible por partes iguales. Por momentos me hace acordar a Muriel Spark."}, {"userName": "Ginny Thurston", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/37326596-ginny-thurston", "userReview": "Suspenseful in a very Hitchcockian way...in fact this author wrote Marnie which was made into a Hitchcock movie. I felt like the narrator was too sad and gullible, and the ending left way too many questions unanswered for me...."}, {"userName": "Carol Eshaghy", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/1814717-carol-eshaghy", "userReview": "This book was recommended to me years ago, but I just picked it up because it was by the author of Poldark. It's the story of a girl who walks with a limp due to polio. She meets a charasmatic young man who flatters her and sucks her into a life against all her principles."}, {"userName": "Valine", "userReviewDate": "Apr 17, 2008", "userURL": "http://www.goodreads.com/user/show/554828-valine", "userReview": "bought this at the goodwill. started reading and became frustrated with the main character because she is a sucker due to her handicapp. I finished it because I wanted to know what happened at the end. Was kind of left hanging. I will probably give it back to the goodwill."}, {"userName": "Lili", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/8673854-lili", "userReview": "A different type of novel from Graham Winston, but an enjoyable read."}, {"userName": "Holly Weiss", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/3455463-holly-weiss", "userReview": "Polio and Winston Graham? Can't pass this one up."}, {"userName": "Chandrasekharan.KS", "userReviewDate": "Oct 30, 2015", "userURL": "http://www.goodreads.com/user/show/48412239-chandrasekharan-ks", "userReview": "page turner, brings out the strong character of the protagonist."}], "description": "A standalone by the author of the Poldark series about a solitary woman who unexpectedly finds herself involved with an intriguing man from a completely different background", "title": "The Walking Stick", "url": "http://www.goodreads.com/book/show/374975.The_Walking_Stick", "average": 3.89, "cover": "https://images.gr-assets.com/books/1353969865l/374975.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/5179.Winston_Graham", "name": "Winston Graham"}], "type": ["Fiction", "Mystery", "Thriller", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/374975.The_Walking_Stick", "http://www.goodreads.com/book/show/7537674-the-walking-stick", "http://www.goodreads.com/book/show/7641498-the-walking-stick", "http://www.goodreads.com/book/show/21043680-the-walking-stick", "http://www.goodreads.com/book/show/25365667-ross-poldark", "http://www.goodreads.com/book/show/1396760.Warleggan", "http://www.goodreads.com/book/show/25365683-demelza", "http://www.goodreads.com/book/show/194637.The_Black_Moon", "http://www.goodreads.com/book/show/194633.The_Four_Swans"]}