{"ratings": 9, "userreviews": [{"userName": "Owlseyes", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/6132231-owlseyes", "userReview": "Really, in what emotional stage is he now?He said \"he\" would never win the election, rather \"she\" would win. It turns out \"he\" won on the 8th of November 2016. So, he lost, so did \"she\".https://mobile.nytimes.com/2018/05/30..."}, {"userName": "Stephanie ", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/24855503-stephanie", "userReview": "Obama-bestuur beschreven als een man alleen in de arena wijst naar een stier uit het zicht met uit de lucht beschuldigingen dat het boek nauwkeurig beschrijft met verschillende educatieve intuïties, dipolaticly en van politieke neutraliteit. wanneer het in contexten wordt geplaatst, is het een em-ingenieursmodel van domino's in gang gezet met de administratie en nauwelijks geëffectueerd met de machtsverschuiving in het huis. Buitenlandse communicatie werd overgelaten aan de kunstenaars en het boek beschreef de versterking van presidentiële bezoeken met 15 landen in de eerste 16 maanden van de Trump-administratie. Belangrijke feiten bij het bouwen van paden voor toekomstige Facebook-elektriciteitscentrales. Alternatieve brandstofbronnen voor de toekomst houden rekening met kryptocurries waarbij een universele uitwisseling met nulinflatie van vitaal belang is. Apple werd gebagatelliseerd in het boek, maar ik verwacht een grote factor te zijn in deze overgang. Als een herhaald kenmerk van de Obama-administratie duidelijk is geweest, is het aanvankelijk niet gelukt om opnieuw te beginnen, na drie reboots van wetgevende macht aan dit initiatief zal Trumps heavy hand zoals altijd blijven uitbreiden voor verdere middelen die geen prioriteit geven aan petroleum, maar eerder staal en ijzer. De tijd zal het leren. #vier sterren"}, {"userName": "Pedro Pinheiro", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/6536847-pedro-pinheiro", "userReview": "An interesting and fluid read. The book covers the entire Obama's candidature and terms in office, dwelling especially on foreign policy. The narrative is coloured with personal stories and the author evolution on the job. Highly recommended for people that might be critical of Obama's foreign interventions (or lack thereof). As they say, everything is more complicated than it seems and this books shows that with excellent writing and storytelling."}], "description": "For nearly 10 years, Ben Rhodes saw almost everything that happened at the center of the Obama Administration--first as a speechwriter, then as Deputy National Security Advisor, and finally as a multi-purpose aide and close collaborator, starting every morning with Barack Obama in the Presidential Daily Briefing. Now, he tells the full story of his partnership--and, ultimately, friendship--with a man who also happened to be an historic President of the United States.Ben Rhodes was not your normal presidential confidante and this is not your normal White House memoir. This is a rare look inside the most consequential, tense, and poignant moments of the Obama presidency, rendered in vivid, novelistic detail from someone who was a writer before he was a staffer: waiting out the bin Laden raid in the Situation Room; starting every morning with Barack Obama in the Presidential Daily Briefing; responding to the Arab Spring; reaching a nuclear agreement with Iran; leading secret negotiations with the Cuban government to normalize relations; confronting the resurgence of nationalism and nativism that culminated in the election of Donald Trump.Rhodes pulls the curtain back on what it was like to be there--from the early days of the Obama campaign, to the final hours of the presidency, standing next to Obama and reading a hand-written copy of the Gettysburg Address. It is a story populated by characters like Susan Rice, Samantha Power, Hillary Clinton, Bob Gates, and--above all--Barack Obama, who come to life on the page in moments of great urgency and disarming intimacy.", "title": "The World as It Is: A Memoir of the Obama White House", "url": "http://www.goodreads.com/book/show/38525517-the-world-as-it-is", "average": 4.56, "cover": "https://images.gr-assets.com/books/1519353668l/38525517.jpg", "reviews": 3, "authors": [{"url": "https://www.goodreads.com/author/show/17739233.Ben_Rhodes", "name": "Ben  Rhodes"}, {"url": "https://www.goodreads.com/author/show/17739233.Ben_Rhodes", "name": "Ben  Rhodes"}], "type": ["Politics", "Nonfiction", "History", "Autobiography", "North American Hi..."], "outlinks": ["http://www.goodreads.com/book/show/38525517-the-world-as-it-is", "http://www.goodreads.com/book/show/39342186-the-world-as-it-is", "http://www.goodreads.com/book/show/38458392-the-world-as-it-is", "http://www.goodreads.com/book/show/38511622-the-world-as-it-is", "http://www.goodreads.com/book/show/271448.Without_Precedent", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}