{"ratings": 34996, "userreviews": [{"userName": "Emily May", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "[my old favourite being \"One, two, Freddie's coming for you; three, four, better lock your door...\" (hide spoiler)]"}, {"userName": "Victoria Schwab", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/1695365-victoria-schwab", "userReview": "ETA: I just did my final, final read-through of this book, and I have to say, it was a messy road, and a long revision, but I am really freaking proud of the result. ETA: IT HAS A COVER!! Sin City PLUS Romeo and Juliet MINUS romance PLUS monsters.This is the strangest book I've ever written. I love it. It's the story of two teens in a broken world, where violent acts breed actual monsters. Some are shadows with teeth that feed on flesh and bone. Some are corpses that feed on blood. And some can pass for human. Those feed on souls. It's the story of Kate Harker, the only daughter of a crime boss, and August Flynn, the son of a man trying to hold his city together. She's a human who wants to be a monster, and he's a monster who wishes he were human.It's dark, and violent, and existential, and the whole thing was inspired by a line from VICIOUS: \"Plenty of humans were monstrous, and plenty of monsters knew how to play at being human.\" 8.3.15: EDITED TO ADD: And the official title is...THIS SAVAGE SONG. Why song?Remember when I said that August was a monster? He’s not just any kind of monster, but one of only three soul-eaters in the city. And these rare creatures (he wouldn’t like that word) use music to bring the souls of their prey to surface. But it’s more than that. This book isn’t a solo. It’s a duet. A song played by two very different teens trying to survive a very broken world. There are moments of discord, and a few of harmony, and through it all, they have to keep the melody alive."}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "Oct 02, 2014", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "*Full video review can be found here: https://youtu.be/v8lOwIbJZtUI went into this knowing I would love it, but I'm leaving it loving it even more than I expected to. I'm constantly impressed by Schwab's ability to create such unique stories. The two main characters had such a fantastic dynamic & I loved seeing their interactions. The story itself left me wanting more & I'm sososo happy that we get another book with August & Kate. (Also I really want August & Kate to meet up with Mackenzie & Wesley. ;D)"}, {"userName": "Regan", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "ugh so good."}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "For a book with such an epic setting, this one is quite generic. The setting is pretty awesome, I mean, imagine a post-apocalyptic world where monsters roam free.\n“Corsai, Corsai, tooth and claw,Shadow and bone will eat you raw.Malchai, Malchai, sharp and sly,Smile and bite and drink you dry.”“Sunai, Sunai, eyes like coal,Sing you a song and steal your soul.”\nHell, one of our protagonists is a monster himself. But outside of the setting itself, I found this book emotionless and just...rather dull.First, the main character. Kate Flynn. Insert cookie-cutter-YA-bad-ass-chick here. Me, I would call her a bitch. There is a difference between a strong, fierce female character, and one who is a rebellious jerk just for the sake of being one. I disliked her from the first page, as she ruthlessly set fire to a school run by nuns for the grand, noble reason of \"I don't want to be here.\"\nThe night Kate Harker decided to burn down the school chapel, she wasn’t angry or drunk. She was desperate.Burning down the church was really a last resort; she’d already broken a girl’s nose, smoked in the dormitories, cheated on her first exam, and verbally harassed three of the nuns.\nYeah. No. I want a character with inner strength. I don't want a character who does whatever the fuck she wants just to get her own way.The male character isn't all that great either. He's one of those emo, martyred, tortured souls that one seems to find sooooooooooo wonderful and so poetic *sigh* and love so much when one is 12 years old. Then one grows up and realize that hearing your partner whine about how his life sucks all the time is stupid and depressing as fuck. Honestly, I felt like both of the characters had no personality at all. A well-written character rises from the paper, make me feel connected to them, make me feeeeeeeeeeeel things (JON SNOW!!!!!!!!!). These characters are just flat.The storytelling was not to my tastes. I have not read Schwab's books before. I tried reading the acclaimed The Archive and gave up within the first chapters a few years ago. Now I remember why. There is nothing wrong with her writing. It is quite good, in fact, it just doesn't tell a story that interested me. It's not the type of narrative and storytelling that pulled me in. I can only explain this as a matter of book chemistry, and her style of writing did not mesh with me."}, {"userName": "C.G. Drews", "userReviewDate": "Oct 02, 2014", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "REREAD: JUNE 2017Because one must reread the most beautiful and dark and deliciously gorgeously written and most painful books of ever because THAT'S THE BOOKWORM LIFE. No no I'm not that deranged puddle of feels on the floor. That's...someone else.Least to say, this was even better the second time. I am a ball of appreciation for how dark and bloody this book is. And the gorgeous cinnamon perfection that is August, who I still relate to so much. I'm in such thorough appreciation for all his sensory overload scenes because #so #well #written. I just love him and Kate to death. NOW EXCUSE ME WHILE I GO READ THE SEQUEL (which is finnnnnally mine) AND PROBABLY CONTINUE TO SPIRAL INTO DEEP DARK LOVE FOR SCHWAB'S WORK.Monsters are my favourite.(Shh it's normal I swear.)\nORIGINAL REVIEW: MARCH 2016.\nThis book was MONSTROUSLY pleasing. (Get it?!? Because it's about monsters...so monstrously?!? Okaaaaay I'll stop now.) I'm beginning to think VE Scwab can do no wrong. Although I confess I think her adult books (A Darker Shade of Magic and Vicious) were actually better. BUT THIS WAS STILL SO SO SUFFOCATINGLY GOOD. Where do I even begin?! *screams*First of all: it's about monsters. I loooove monsters. I LOVE 'EM. It's set in this sort of Gotham inspired world, where two forces are waring against each other, and monsters are eating everyone in between. It's mostly human vs monster, but also a fair bit of human vs human. And, naturally, I loved the comparison of the humans being more monsterish than the actual monsters. Gah, I just love that kind of story, okay?!But I will fully confess: I found the first 20% really confusing. That is not good. I actually had to stop reading and go read the blurb and only THEN did the world-building start to make sense. #disappointed And, while we're discussing failings:  the story really had VERY little plot. Mostly monsters running around wishing they weren't monster and humans running around being emphatically monstrous. They're trying to avoid wars/stay alive/prove themselves worthy to family... But I honestly expected WAY more, plot-wise.OKAY BUT ENOUGH OF THE NEGATIVES. BACK TO WHAT I FREAKING ADORED. Let's talk about the entirely amazing phenomenon that is VE Schwab's writing. Omggg. Can it get anymore divine?!? She has this intensely flawless way of sucking me into the story. I can honestly LOSE TIME reading this writing. And the characters leap off the page, so complex and dimensional and tragic. *suffocates with love* Plus, one thing I was REALLY fond of in this book was the representation of sensory overload. OKAY IT WASN'T REALLY THAT. But, as a person who suffers with sensory overload, when August's monster-melt-downs were described I related so much I wanted to cry. August cringed; the overhead lights were too bright, the scraping of chairs too sharp. Everything was heightened, like the volume on his life was turned up but not in an exciting way. Noises were too loud and smells too strong and pain -- which he did feel -- too sharp. But worse than the senses were the emotions. Agitation and anger burned under his skin and in his head. Every comment and every thought felt like a spark on dry wood.If you've ever wondered what it's like to live with sensory overload that happens all. the. freaking. time...THAT. THAT IS IT. DESCRIBED SO EFFORTLESSLY I WANT TO JUST THANK THE BOOKISH HEAVENS THAT IS THIS BOOK.Also the characters were perfect little beasts. I say that with much love, of course. We have two alternate narrators: Kate (a beastly nasty girl who is daughter of a crime-lord and a human) and August (who is a soul-eating monster and adopted-son of the rebels to the crime-lord). August ends up sort of \"spying\" on Kate at her school and then they get thrown into a run-for-your-life adventure. • KATE: She was so snarky and bitter and CRUEL but in a really forced way?! Not forced written...forced as in she wanted to be evil but it wasn't really her. IT WAS SO TRAGIC AND SAD. She was awful in order to impress her awful dad. I did love her. • AUGUST: Omggg, but I loved him more. This is partially because of the sensory-thing. But August is a monster who wishes he wasn't. AND I LOVE THAT KIND OF TROPE. <3 Also he is entirely adorable and sweet and plays violin and I just want to HUG HIM basically. He was tragically beautiful and marvellous and... okay 'scuse me. I am raving. But not even sorry. (But there is...surprisingly...no romance. August and Kate do not ONCE have romantic thoughts towards each other. I am so so SO FREAKING ASTONISHED AND HAPPY. A story of unlikely/forbidden friendship!? HUZZAH.)I'm ever so PLEASED with this book. It was violent and gritty and full of blood. I'm still slightly disappointed in the simplicity of the plot and the ending was wildly open!?!? Not a cliffhanger, but a very very veeery curious call-for-a-sequel. I loved it and I connected to the characters and I had like 9 whole emotions while reading it. A solidly fantastic story I will happily eeeep over eternally.\nMonsters, monsters, big and small,they're gonna come and eat you all..."}, {"userName": "Emma Giordano", "userReviewDate": "Apr 08, 2016", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "I LOVED THIS BOOK. It was totally different from anything I've read before! The world was structured in a very unique way, and both main characters were so likable that reading this book was a pleasure. It was a story that captured me right from the start and held my attention all the way to the end. I went into this novel thinking it would be a clear cut romance, but was surprised to find that signs of it were virtually non-existant! If it develops into a love story in the future, I would be OVER THE MOON but it was really refreshing to read a book that wasn't built off of a love story. The final few moments of this book were INSANITY, completely unexpected and left me with so many questions for how book two is going to follow up on where things left off. I would recommend this book to ANYONE with a love for fantasy, monsters, dystopian-ish post war settings, strong characters, unique government structure, and a thrilling tale!"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "My July 2016 Owlcrate Box Book! Woot!**MILD SPOILERS**I totally loved this book! The idea of the different monsters were really cool. I'm not sure I understand all of it but this is what I understood about the monsters: 1. Malchai - Drink blood but are not vampires. Formed/Form from murders. 2. Corsai - Feed on flesh and bone. Formed/form from violent acts3. Sunai - Feed on sinner souls (killers etc.). Formed/form from major catastrophes (bombs etc.). Kate Harker is the daughter of Callum Harker. He controls some of the monsters and he's pretty evil. An event in his life sent him right over the edge. Or maybe he was already on that edge. Kate tries to be evil like her father. She does some some evil things but she's really good deep down inside. August Flynn is a sunai and his father (that took him in) is Henry Flynn. He is a good guy trying to keep the bad monsters and people at bay. And trying to keep a peace treaty among said monsters. August also has a brother Leo and sister Ilsa that live with Henry. I loved both characters of August and Kate. August is a sweet person that doesn't want to be a monster, but to me he is a good kind of monster. Taking the souls of those that do horrible things isn't so bad. Kate is just a bad @ss and gets stuff done. And contrary to what she ever thought, she becomes a monsters friend instead of his enemy. Together August and Kate have to fight some enemies that are trying to cause a war. People and things die, things are reborn. I thought it was a really cool concept in this new world. I enjoyed learning about the monsters. The story line was awesome and that ending! What is coming next? I need to know! Overall the book was awesome, but that's my opinion =) Enjoy Happy Dance for the next book! I need you soon =)MY BLOG: Melissa Martin's Reading List"}, {"userName": "Chelsea Humphrey", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "Man, I feel like I've really knocked it out of the park lately with some fantastic YA reads! I've been trying to balance out my reading schedule with fun reads, alongside ones for review on the blog, and I think this is helping repel the \"burnout syndrome\". I have no earthly idea why this has been sitting on my physical and digital shelves for so long; I kept meaning to pick it up, but then I would remember the sequel wasn't coming out until the twelfth of never, and other books were shiny or more pressing, and alas, I would reach for a proper book that was more along the lines of required reading. FINALLY! I'm so glad I decided enough was enough; I guess my subconscious was on to something though, since now I don't have to wait long for that gorgeous sequel. Best cover art ever, right?I love how creative the idea behind this plot is. Monsters being created from our transgressions; there's just something so poetic and disturbing about it. Victoria Schwab was able to create a high fantasy visual to give us thought into just how our actions, good and bad, can have a ripple effect on the world around us. I found myself easily getting lost in the world of Verity; of course the author, being the writing queen she is, was able to slowly immerse us into this dystopian world without using the dreaded info dump. During the first 100 pages, we are left in the dark about many of the going ons, and we are slowly filled in, which gave me all the tinglies in my suspense-loving bones. I connected immediately with August; while it took awhile to warm up to Kate I found myself very protective over her as we followed alongside the journey. And wow! That ending! What a perfect segue into the final entry. I could have definitely enjoyed this being a full fledged trilogy but I won't be greedy and am grateful for what I can get. :) If you have been living under a rock such as I the past year, please do yourself a favor and pick this one up asap. We can be all caught up and fangirl (or boy) over the next book together as us bookworm creatures do."}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "4.5*I really really enjoyed this! I loved the world, the characters, and basically just everything about it. I'll do a video review soon!"}, {"userName": "Kaylin (The Re-Read Queen)", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/47627265-kaylin-the-re-read-queen", "userReview": "5 Stars\n“Monsters, monsters, big and small,\"They're gonna come and eat you all.\nSo, I totally wasn’t expecting to love this so much?? I’ve read Schwab’s A Darker Shade of Magic series, and then everything I’d seen suggested this wasn’t as good. But I enjoyed it so much more?? (Sacrilege! I know. I know.)Something about this dark, egregious atmosphere  clawed it’s way into my cold, dead heart. Taking place in an alternate US where the states reconstructed after Vietnam, the story had the potential to feel like so many other YA dystopias. But this transcends so much of the cluttered drama? The idea that violence breeds more violence in the form of monstrous creatures is so much more mature and philosophical than “society wants me to be the same!!1! BUt we are all different!!” (And yes. I’m aware I just said monsters were mature. )This book could so easily have spouted a ‘violence is bad. Don’t do it’ it message-- instead this is filled with morally ambiguous characters. Sweet, sensitive August literally has to eat souls to survive and despite his penchant for humanity-- he’s not part of it. But in a world where humans are happy to slaughter each other… should he really be striving for humanity anyway? Instead of a simple misplaced-paranormal creature element, this raises much deeper ethical questions. And there isn’t a simple right answer. It’s not an easy \"I’ll feed off animals and be a good vampire\"  solution, but a struggle for him to find something he can live with. Now let me tell y’all about my girl Kate. My aesthetic is blondes with switchblades. The complete antithesis to August, her father leads the North City with no tolerance for weakness. Kate is so desperate to find her place in her father’s city and feel at home, that she’s been systematically trying to get rid of her own humanity. (Homegirl doesn't seem to realize her quest to belong probably counts as being human.) She’s not a good person, but she is relatable. It’s hard to support all of her actions, but her development felt organic and I just loved her. In addition to a setting I loved and characters I loved-- I loved this plot.Once again, this had the potential to fall back on tropes but instead subverts them and remains unpredictable. Without spoiling, Kate notices August’s weird behavior and trusts her instincts. Please give me more YA heroines who don’t shrug off sketchy behavior. But also, there’s no romance. It would have been so easy for Schwab to go that road, but their individual stories and friendship are enough. I understand the complaints however, and completely acknowledge that parts of this are gimmicky. For instance, August’s tally-mark tattoos appear each day he doesn't go \"dark.\" It seemed counterproductive of everything the Sunai are?? Aren’t they supposed to want to go dark?? Why would their bodies be like “good job here’s your sticker for the day” when they don’t? Honestly, I'd have preferred August keeping track of the days himself.But the gimmicks were few and completely overshadowed by all the brilliant things? Including Queen Schwab’s mastery with words. It’s just perfect? How does she do it??Overall:RIP Kaylin 1997-2017"}, {"userName": "Rose", "userReviewDate": "Jun 29, 2016", "userURL": "http://www.goodreads.com/user/show/36179502-rose", "userReview": "\"It began with a bang.\"HOOOLY SHIIIIT. I'M NOT OKAY IN THE SLIGHTEST. V.E HAS DONE IT AGAIN, EVERYONE. \n\n\n\n\nHow am I supposed to put all these emotions into one tiny little review? It's just not possible. There are too many good things to say about This Savage Song. The beautifully complex characters that are August and Kate, a storyline unlike anything I've read, and most of all: Victoria's writing. She creates a wonderful atmosphere, a story that just flows effortlessly, and VFHJSKL I just can't explain. BASICALLY: Victoria Schwab writes in ways that I could only wish to. Anyway, full review to come! And the book's out today, and I highly recommend getting your hands on it! It's dark, with moments of humor and completely unpredictable. Basically, unlike anything I've ever read. I DON'T GET HOW SHE DOES IT. \n\n“You’re not your father.”Kate tensed imperceptibly at that, then managed to draw her mouth into a small, cruel smile. “Can I tell you a secret?”“Of course,” said Rachel.Kate leaned in and brought her lips to the girl’s ear. “I’m much worse.”"}, {"userName": "Ryan", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/56788355-ryan", "userReview": "Excuse me while I go buy every Victoria Schwab book in existence."}, {"userName": "Mary ~Ravager of Tomes~", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/1452829-mary-ravager-of-tomes", "userReview": "Actual Rating: 2.5 StarsYa know...It pains me on a personal level to give a book with such a stunning cover such a low rating, but I cannot deny my problems with it no matter how much I love V.E. Schwab's book covers or her writing.This book has such an intriguing premise.Imagine this:Monsters manifesting into existence as a result of sin. A city literally divided between two leaders, both with their own ideas about how to protect their citizens. Kate, desperately trying to prove her savagery and be the devil her father always wanted her to be. August, a Sunai monster, hopelessly clinging to his wish to be human.And on top of this badass premise, no fucking love story.But for all of those unique elements, this book could not be saved from it's own mediocrity. When I read Vicious, it really set Schwab apart for me. That story is captivating with dynamic and believable characters.But with This Savage Song and A Darker Shade of Magic, I feel as though something is preventing me from getting on board. I appreciate what Schwab sets out to do here. Kate is a cutthroat, stubborn & impulsive. August is quiet and contemplative, a lover of music. These two seem amazing on paper, but for some reason I remain unconvinced.I adore their ambitions. It sounds great to have a female lead yearning to be a proper villain. It sounds excellent to have a male lead who is vulnerable and searching for his humanity.But somewhere in the process of breathing life into these characters, Schwab missed the mark.No matter how much I wanted to care about these characters, I didn't. I couldn't. They didn't feel real. Even with Schwab's amazing talent for weaving words together I cannot in all good conscience tell you that this book will blow you away.The writing is to die for. Schwab's style is gorgeous and fluid in a way that only a master of writing can achieve. However, the story, the characterization, and unfortunately even the world building will leave you feeling like something crucial is missing.I don't know that I'll be continuing on with this series. There were a handful of excellent moments, but whether or not they are enough to salvage my interest will have to wait until June.This review and other reviews of mine can be found on Book Nest!"}, {"userName": "Korrina  (OwlCrate)", "userReviewDate": "Sep 16, 2015", "userURL": "http://www.goodreads.com/user/show/37437502-korrina-owlcrate", "userReview": "Although my Booktubeathon wasn't as successful as I had hoped, I'm still so glad I took part, and that I caused me to reread TSS. The first time I read it I kind of rushed through it, and this time I got to really take my time and enjoy it fully. I love Kate and August so much, and I love this dark and sinister world. Really excited to read Our Dark Duet very soon!"}, {"userName": "Kainat 《HUFFLEPUFF & PROUD》", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/14717996-kainat-hufflepuff-proud", "userReview": "I freaking love the title of this book!3.5 STARS\n\"I am Sunai. I am holly fire. And if i have to burnthe world to cleanse it, so help me, i will.\"\nJust want to put it out there, my favorite character wasn't Kate, or August, IT WAS LEO! But i'm not going to talk about the plot or the characters. It's better if you find out yourself. This was a decent read. As always, i enjoyed Victoria's writing, but something was missing. It just wasn't as epic as her other books. I still applaud you, Schwab, for coming up with yet another unique and astonishing story. It's not easy these days. I feel like most books i read have that same old plot, cliche characters, especially in YA. It also could be challenging for an author to write multiple books that aren't similar. Victoria Schwab writes 'em like a pro! Though This Savage Song was just okay, i am super excited about Our Dark Duet. I saw this more like a prequel. Shit is about to go down. That ending gave me the chills. Can't wait. I've been watching her interviews lately, there is a chance i might be in love with that woman."}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "man fuck this Victoria all I wanted was like. a buddy cop movie with Kate and August. and you give me five hundred pages of stress?? no💕it's been two years since I bought this [yes, it's the book that's been on my shelf the second longest] and I am finally reading it and I am definitely not going to fail because I'm 60 pages in and I loooooooove it."}, {"userName": "Kai", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "\"It was a cycle of whimpers and bangs, gruesome beginnings and bloody ends.\"I've read The Archived and  The Unbound. I've read  Vicious and The Near Witch, I've read A Darker Shade of Magic and A Gathering of Shadows.I've read every YA and Adult Fantasy novel Victoria Schwab has written, and compared to all of them, This Savage Song fell flat.I love Victoria Schwab. Her writing is stunning, her stories unique, her characters intriguing. This Savage Song had all of this, but much less than her previous works.Plot:This is such a promising story, such an exciting dystopian setting. Monsters and songs, action and thrill. Thing is, I expected a little more. I'm not exactly disappointed, but there's room for more suspense and adventure.I welcomed \"Romeo and Juliet minus romance\" with open arms. It's great that the stereotypical male plus female protagonists didn't fall in love for once. I don't need romance...but I can't lie that it makes things a little more exciting. Now I'm not sure if one or both of the main characters are asexual, aromantic, pansexual or something completely different. All of them would be great. But a little love in the sequel would spice things up nicely.The story was also slightly predictable, the writing adding to its predictability. Sometimes a little repetitive, I often expected what was coming next and foresaw several smaller and bigger details.Characters:Fan of August, not a fan of Kate. While he seems like a sensitive and relatable character, she seems unnecessarily cruel and cold. I'm not exactly sure if Kate is 16 or 18 but she sure is smart enough to differentiate between establishing respect and downright bullying. However big her daddy issues, it's just not cool.Overall I felt like most characters weren't as real and refined as usual. Both of them lacked somewhat in character depth in my opinion.In a nutshell: Great work, but lacking in finesse in several aspects. It just couldn't live up to Schwab's previous works.Find more of my books on Instagram"}, {"userName": "Simona Bartolotta", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/5312173-simona-bartolotta", "userReview": "[they are generated by great amounts of negativity, from lumps of nasty emotions (hide spoiler)]"}, {"userName": "Larry H", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'm between 4.5 and 5 stars, but heck, I'll round up!So when I finished devouring this book last night before I went to bed, I tried to think of the best way to sum up my feelings. Sometimes when I'm at a loss for words I turn to those more articulate than I am, so:\n\n\nAh, thanks, Oprah!It is a time in the (hopefully very) distant future. At one point, monsters tried to take control of a city. It led to massive destruction, but ultimately a truce was reached which divided the city. One half is run by Harker, a ruthless man whose ambition and lust for power are nearly as dangerous as the monsters he allows to roam free, so he can then charge the city's residents for his protection from them. The other half of the city is run by the more noble-minded Flynn, who wants to keep his residents safe by controlling the monsters, not harnessing them as pawns in a shakedown.Neither side has complete support, as the truce seems to be weakening. Harker's daughter, Kate, who has gotten herself expelled from her sixth boarding school in five years, has returned home, much to her father's chagrin. She wants to prove that she is just as ruthless as her father, and wants him to finally let her stay with him, and take her under his wing. But she must battle not only her father's ambition and his memories of her late mother, but also the monster he has trained as his second in command.When Kate is sent to another school in town, Flynn and his followers jump at the chance to get someone close to her, to watch for signs the truce may be breaking. Flynn's youngest son, August, who wants simply to be kind, to live a good life, is pressed into service. The thing is, August is a monster, the rarest of the three breeds, who can steal a person's soul by playing his violin. He needs to hide his secret from everyone in school, especially Kate, but for the first time in his life, he feels as if he belongs, he starts to make friends, and he is fascinated by Kate's intelligence—until she figures out what he really is.When an attempt on Kate's life sends them both fleeing, they must make a truce of their own. August wants only to protect Kate, and Kate wants to live, although she isn't sure if capturing August could be the prize she needs to cement her relationship with her father. As they seek freedom and safety, they still long for the comfort of their families, even as they realize their families may not provide the safe haven they thought. They must fight not only the enemies they expect but enemies they don't, and they face the toughest battle of all—the enemies within themselves.Right off the bat, I'll say that obviously this isn't a book for everyone. If you don't like this type of fantasy story, Victoria Schwab's storytelling, no matter how strong a spell she casts, probably won't lure you in. But don't rule it out because you think it's going to be all \nTwilight\n-y (a new adjective), because the monsters in this book don't have the Cullenesque shimmer, and more importantly, one of the best things that Schwab does in this book is keep the lovesickness and most of the angstiness out. That makes \nThis Savage Song\n a much stronger story instead of some YA-ish soap opera.I love authors who can take you into another world and immerse you so fully. That's a credit to Schwab's incredible creativity and the imagery she uses. There is a vividness to the pictures she paints, and I'd love to see this made into a movie to see just how closely what I saw in my mind's eye while reading this book hews to the film adaptation. Is it a little overly dramatic at times? Sure. A little predictable? Of course. But it doesn't matter, because the characters she has created fascinated me, flaws and all.When you add to your stress level at work by taking a longer lunch than you should so you can keep reading, you know you've found a good book. (Lucky I'm the boss!) When you find yourself taking your glasses off during the NCAA championship so you can race through the remainder of the story before bed, you know you've found a good book. This was tremendously entertaining and well-done, and I'll be all over the sequel when it comes out this summer! See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Warda", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "[4.5] REREAD! HOW DID I FORGET THAT ENDING?! MY MEMORY IS THE SHITTEST, I SWEAR! Straight onto Our Dark Duet, though my soul is in agony! August better be getting that redemption he deserves. If Schwab pulls a Holland on him, I'm gonna lose my mind. Hate-mail is what I'll be writing...  Initial review:[4.5] That ending!! I. Need. More!!!As per usual, I always have the best time reading one of V.E. Schwab's books. This is the fourth book I've read by her and it did not disappoint. She constantly delivers when it comes to her flawless, entrancing and almost graceful-like writing style, the complex, but lovable characters and the unique plot. I don't know why I'm not giving it a 5 stars. I think I can't help but unconsciously compare it to Vicious or the Shades of Magic trilogy — unreasonable, I know — which were perfection for me. Having said that though, I can't as of now, point out a fault or a flaw in this book either. It borders between urban fantasy and dystopia, it was action packed and fast paced, neither was I bored at any point. The world-building was solid as were the characterisation. I just wish it was longer as it left me wanting for more. More pages and more detail, but it makes me ridiculously excited for the next book and to find out what's in store. I want to be surrounded by those characters and be in that world again."}, {"userName": "Sana", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/26402455-sana", "userReview": "2.5 stars.this savage song is a book i was really excited to start because of all the hype surrounding it. it was apparently badass and had a cool idea of monsters, humans and evil. what i got was?? much less terrifying and made me laugh out loud because what the fuck, these whiny monsters were supposed to be scary??? it's like that ghost gif where you're waiting for that creepy jump scare but what you get is a guy with a white sheet on him, going around saying \"booo.\"here are some pros:-i loved how Schwab has non existent romance in her books. the relationship between August and Kate is well done. the way they develop from enemies to friends (not lovers) is also an amazing trope and should be used more often in books. -the writing is beautifully done and easy to read. while there was a hell of a slow and boring plot, the writing made it all easier and i legit flew through this book. the words just flow through you making the book a bit bearable. -ummmm, that's about it??cons:-so, where the fuck is the world building. it seriously lacks that. -Kate was a character i didn't like at all. y'all this bitch pissed me off. i felt like Schwab just goes over the top to make her female characters extremely badass. (first it was Lila with her annoying reckless behavior and now Kate.) ok so, being badass doesn't mean you threaten/hurt innocent people. that doesn't make you fucking badass but fucking psychotic and go find help??? thanks. while i admit burning down the chapel was cool, it was unnecessary??? why would you even fucking do that though, what if people got hurt?? oh but Kate Harker wouldn't give a fuck because she's badass like that, oh yeah! right, go fuck yourself. i'm sorry but her behavior pissed me off, like yo you need an ass whooping. ohhh not to mention her constant saying of \"i'm Kate Harker\" \"i'm Harker's daughter\" \"people fear my father\" \"i'm much worse than my father\"OK SCHWAB I GET IT, I CAN'T BE AS \"BADASS\" AND AS COOL AS HER, no need to shove how great she is down my throat every five pages??? please. thanks. so, overall, Kate Harker's a piece of shit. -i also didn't really like August that much. i don't really hate his character, but i don't particularly like him either. i don't know he comes off as like a dead zombie to me and i couldn't really care for him. -the plot. what the fuckit was so slowand boringnothing happensliterally nothing exciting happened until the last couple of chapter which left me so fucking bored and uninterested in the entire story. the idea of it was really cool, but executed poorly. Buddy read with daddy and mr. Thicc."}, {"userName": "Ben Alderson", "userReviewDate": "Sep 01, 2016", "userURL": "http://www.goodreads.com/user/show/15850647-ben-alderson", "userReview": "Very good book! Not my favourite Schwab novel but one of the tops!Loved the writing style and characters. Victoria really knows how to weave amazing and deep characters!"}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "Buddy-read with the ever amazing Hufflepuff, Chelsea (click to read her review)3.5/4 stars. So. This Savage Song. Rarely a novel created so many divergent reactions in my feed. If the fact that opinions differ doesn't strike me as unusual - suffice it to take a look at most romance novels' pages to see radically different ratings - it still contributed to my confusion before reading because mixing most of them would lead to a hell of an oxymoron. The world-building is fantastic and original, but generic. The characters are well-rounded and complex, but rather dull and one-dimensional. It was unputdownable. It was so fucking boring.It lacked romance. Thanks god there's no romance. I very much enjoyed reading all these interesting and well-thought reviews - and I am not being ironic - yet my questions started piling up with increasing speed : so, what? Would This Savage Song be the first novel from Victoria Schwab that would leave me indifferent? Should I lower my expectations? Would I like, would I like, would I like? But then I thought : Anna, these reviews aren't about you. Such a tiny thing, this. So easily forgotten. As much as we start noticing similarities between our tastes and particular reviewers' over the years, their reviews are never, ever, about ourselves. How could they? I guess that's why it baffles me so much when I see people leaving hmm, let's say, tactless comments on reviews they don't agree with. Sure, sometimes we can't change the facts. Does the MC cheat? Is there consent? (because yes, I'm one of these people who think that there's nothing grey or \"blurred\" about consent) But most of the words written in a review are opinions and are linked to so many factors : the number of books read in that genre, the personal tastes, the current mood, etc, etc. We can organize our reviews all we want, use bullet points or dialectical reasoning, who cares, it doesn't change a thing (or ramble before even talking about the book itself, I know, I know, the irony isn't left on me). In the end, sometimes our opinion will only revolve around the chemistry we share with a particular author and her work. This is where I stand when Victoria Schwab is concerned. Does that mean that I will love every one of her books? Hell no. I only liked Vicious, and This Savage Song awoke the same kind of contradictory feelings in me : ✔ As usual with Victoria Schwab's novels, I was fascinated by the concept and the writing managed (without forcing, it seems) to tug at my heartstrings at the most random moments. ✘ ✔ The pacing didn't suit me during the first 50%, my read was interspersed by at least 10 minutes of rest every few chapters, but once the second half started, the story captivated me so much that I forgot everything that wasn't August (yes. I am playing favorites) - it started with a whimper, ended with a bang? How fitting. ✔ Verity's monsters were as disturbing as engrossing to read about, and the darkness lurking enveloped me completely. \n\"Be careful, parents told their children, be good, or the Corsai will come, but the truth was the Corsai didn't care if you were careful or good. They swam in darkness and fed on fear, their bodies sick, distended shapes that looked human only if you caught them out of the corner of your eye.\"\n✘ The somewhat dystopian settings made me think that really, I'm not sure we need to read about a umpteenth version of the decaying United States. I'd rather go somewhere else next time. Really. Please think about it.✘ ✔ I would say that the characters are pretty generic and trope-ish, because this is what my mind was screaming at first, but I cannot dismiss the fact that they made me care and snort and bite my nails and feel. They left me craving for more. Perhaps Victoria Schwab used an old mold to craft her characters, it doesn't change the fact that they genuinely interested me and that I, for one, enjoyed their dynamics a lot. Also, I really have a thing for male leads who sob and whisper. I KNOW. THIS IS RIDICULOUS. But THIS IS WHO I AM. It only works in books, though. Weird how attraction works, ha. In real life I would probably say something along the lines of, [frowns] why the hell are you whispering?! Because of course. Kill Mood Is Me. \n\"This was the opposite of peace. He felt alive – so alive – but tarnished, his sense screaming and his head a tangle of dark thoughts and feelings and power, and he was drowning and shivering and burning alive.\"\n► My review, it seems, is everything but helpful. This being said, given the huge fanbase Victoria Schwab has - which she deserves, as far as I'm concerned - I know that my review will hardly change anything in your decision. Read it, don't read it. One thing is sure : your review will be unique and genuinely interesting to me. For more of my reviews, please visit:"}, {"userName": "Dana Kenedy (Dana and the Books)", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/372001-dana-kenedy-dana-and-the-books", "userReview": "Time for another giveaway! Win a signed copy of This Savage Song!And the winner has been emailed! If you entered, please check the email you entered with"}, {"userName": "Misstdennis", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/41744660-misstdennis", "userReview": "500/5 stars“He wasn't made of flesh and bone, or starlight.He was made of darkness.”My word, what a whirlwind those last 11 hours were.Seriously, I read this in less than one day. With a few stop and starts obviously, a girls gotta eat.AND HOLY SHIT IT WAS SO BEAUTIFUL!Ever since I read A Darker Shade of Magic, I've tried hard not to compare it to her other books, but this was just on a whole new level. Something I cannot compare it to because that was just something else.JESUS, TAKE THE WHEEL BECAUSE I'M LOSING MY SHITI really don't even know where to begin with writing a semi-good review for this...I feel like no matter what I say, it will not do it's justice for how great this book is.If you are like me and left it this long to read it, please pick this up.It's set in such a cool dystopian, fantasy setting, and normally its something I no longer gravitate towards as but this was so different and exciting.Please know that this is my opinion, and you may think that it's completely false and bonkers, but I couldn't help but shake the feeling that this was like if Divergent and City of Bones loved each other very, very much and they had a baby... The result will be the resemblance of This Savage Song with musical aspects to it.“Sing you a song and steal your soul.”From start to finish I was completely hooked on the story and I could not put this down if my life depended on it. It was so fast-paced and was just a whirlwind of adventures and monsters. I know I pretty much say this in all my reviews for her, but the way V.E. Schwab pulls you in with her style of writing and original stories never ceases to amaze me.Without a doubt she sits pretty high up in my tree of favourite authors. Not to mention that killer of a final chapter! Excuse me? What are you doing? that's my heart you're breaking.ALL HAIL TO QUEEN SCHWAB I loved both of the male and female protagonist, Kate & August, like a lot. I also just wanted to wrap them in a ball of cotton wool for protection and tell them that everything will be okay.So I swear on my small black heart that if anything happens to them. I will rage quit and never read a Schwab book again.Okay, that was a lie but you get the idea.Now to get my paws on Our Dark Duet."}, {"userName": "maymay❀", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "“It's a monster's world.”Idk how to write a review for this book. (s) my schwab and 21 pilats heart is overwhelmed to see thisSchwab has proved herself to me time and time again. I’m legitimately so trash for her that if she published her shopping list, I would just //become// Incoherent Scream and bounce around shoving it in the faces of strangers. I know, it doesn’t sound very healthy. AUGUST FLYNN IS MY PRECIOUS LITTLE EMO BABY I WOULD DIE FOR HIM DON’T FRICKEN TOUCH METhis book had a lot of things I //didn’t// expect to like mainly vampires but damn man, Schwab knows how to USE those tropes !!Also there was no romance which was WHOA for a YA book but also incredibly refreshing but you know what, my shipper heart doesn’t EFFING CARE BC I STILL SHIPPED AND IM READY TO DIE FOR THESE KIDSI’m kinda in love with the trope of forbidden love so :) :) :) this better happen Schwab :) :) this better fricken happen :) :) :)(s) We’ll do a quick list of Thoughts:-\tIsla is an angel-\tSo is August-\tLeo can choke-\t@ Henry and Emily FRICKEN ADOPT ME-\tKate’s dad can choke-\tKate is a walking cliché but she’s kinda won me over-\tI want Schwab’s quotes to be printed on a shirt so I can walk around and everyone will know my true form-\tIf august gets hurt in book 2 im gonna fricken sue-\tHas he not suffered enough in book 1???????The only reason this isn’t 5 stars is bc it lagged in the beginning and it was kinda tropey but im still trash take your judgment away from meAnywaysThat’s allI just want to start the next book “It was a cruel trick of the universe, thought August, that he only felt human after doing something monstrous.”4 stars!!~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nFake buddy read\n with Emilyim here so i can complete my title of Schwab Trash™ and wear it like a badge of honour"}, {"userName": "Candace Robinson", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/33995641-candace-robinson", "userReview": "I was hesitant to read this one because I could not finish A Darker Shade of Magic, but I loved this one! August and Kate constantly have inner battles with themselves of not wanting to be a certain way.\"One moment I didn't exist and the next I did, and I spend every day scared I'll just stop being again, and every time I slip, every time I go dark, it's harder to come back. It's all I can do to stay where I am. Who I am.\"Loved the bond that developed between August and Kate. The monster stuff was really cool, but I am also a big fan of monsters! Full review on my blog https://literarydust.wordpress.com/20..."}, {"userName": "Taneika", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/5591031-taneika", "userReview": "3.5 starsThis book was absolutely unputdownable and I found myself flying through 100+ pages in what felt like ten minutes (it was obviously longer though!)I loved the characters A LOTThe premise was unique but not anything special??? Idk if that makes sense. It was definitely easy to read and very enjoyable but also not mind blowing like I was expecting??Overall a great, fast read though!"}, {"userName": "Chelsea ❤Peril Please❤ ", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/8422853-chelsea-peril-please", "userReview": "“I read somewhere,” said Kate, “that people are made of stardust.”He dragged his eyes from the sky. “Really?”“Maybe that’s what you’re made of. Just like us.”And despite everything, August smiled.\n\nI think it’s extremely safe to say that I am absolutely obsessed with Victoria Schwab. It’s not just the characters. It’s not simply her worlds. It’s not the action and peril and ridiculously vivid scenes of utter devastation. No, it’s not just any single one of those things: It’s all of those things. \nHe closed his eyes, seeking peace, but as soon as the silence settled it was broken, the distant stutter of gunfire echoing against his skull as it always did-the sound invading every quiet moment.It began with a bang.\n\nWhether every story by this author is for you or not, one can’t argue that every single thing I mentioned above isn’t always in the stories. Even if you might have hated this story (Ooooh those mixed reviews), you have to admit that it still had all the things that make Schwab’s books as excellent as they are. You aren’t ever just simply an observer in her books-No, never an observer. You are a player. You are wholly immersed and interwoven in these characters’ minds and twisted into their intricate web of thoughts, plans, diabolical ways of being. You aren’t someone who is standing in the corner-You are fighting right alongside them. \nIt was a cycle of whimpers and bangs, gruesome beginnings and bloody ends.\n\nThis story, like Every. Single. Other. Book of Schwab’s, was so masterfully executed that you didn’t need something to be happening on every single page-Because, let me tell ya, every single page was building up and thickening the plot into something you can’t even comprehend yet. To say I knew what was going to happen would be a lie. I picked this book up without the faintest idea of where this story was going to go, or even, really, what this story was about! Isn’t that the best thing about our favorite authors, though? You don’t need a plot….you just need to know the book even exists. \n“You’re not your father.”Kate tensed imperceptibly at that, then managed to draw her mouth into a small, cruel smile. “Can I tell you a secret?”“Of course,” said Rachel.Kate leaned in and brought her lips to the girl’s ear. “I’m much worse.”\nAnd that’s the case here. I remembered vaguely that it was about monsters….but what’s so funny is that I thought it meant monstrous humans when, in fact, it truly meant monsters. So, you see, I went in kind of blind here. And I wasn’t even sure this was going to work for me, if I’m being honest. I really liked our two main characters, Kate and August (my Auggyyyyyyy), but I wasn’t sure the story was going to be enough for me.\n\nSunai, Sunai, eyes like coal, Sing you a song and steal your soul.\n\n\nI'm not particularly picky when it comes to stories (cough okay okay I'm a little picky about my books...), they just have to have action and romance and characters I can love and maybe some peril and...?? Okay. Moving on. This didn't have romance. And it certainly didn't have a ton of action at the beginning-That I can remember, anyway. So I was a bit nervous. I had no clue what this story was going to offer me.\nSomeone pulls a trigger, sets off a bomb, drives a bus full of tourists off a bridge, and what’s left in the wake isn’t just shell casings, wreckage, bodies. There’s something else. Something bad. An aftermath. A recoil. A reaction to all that anger and pain and death. \n\nBut then something amazing began to happen....August began to become, I don't know, more human. Let me explain-I LOVED both he and Kate right from the start-I had no doubts that I was going to like these guys-My problem stemmed from where their lives and stories were going. I've never been one to love a beginning that isn't epic when I'm not sure about a story and have heard mixed things about what I'm ultimately reading towards. So when I began to get deeper into August's mind and see how sad and lonely and unsure of his existence he was...I began to, ahem, feel some things.\n\nSuddenly normal felt so far away. It was a cruel trick of the universe, thought August, that he felt human only after doing something monstrous. Which made him wonder if that brief glimpse of humanity was really just an illusion, an echo of the life he’d taken. An impostor sensation. \nNow, okay, hey now-I am NOT an easy sell. I'M NOT. Yes, I love boys most in books and, yes, I care more about them than any other character in existence, but that's in ROMANCE. Romantic fantasy, sci-fi, WHATEVER. These obsessive feelings stem from the guy pining for the girl AND all the standard wounded boy traits. So no-I am NOT an easy sell...especially when there isn't any romance to speak of.August didn't want to be a monster-one day he just simply came to be in the middle of a disaster and that's where his life began. This bothers him every single day and causes him grief he can barely stand-he just wants to play his violin and finish a song...and he doesn't want to pull the souls of anyone to do so.\n“I am not a…”But his throat closed up. The words got stuck.I am not a monster, that’s what he wanted to say, but he couldn’t. He hadn’t found a way to make it true.\nAugust has a gift, though it's the mark of him being a monster and why people are terrified of him, and he uses it (after being trained by his family that brought him in) to get rid of the corrupt in the city. But then there are those times when the hunger becomes too much, when he aches to be more human and not the monster everyone says he is. He waits and fights it and he drags out each day without consuming a soul...desperately hoping this time he'll be able to fight that internal hunger. But, after days of struggling, the pull becomes too much...and then he goes dark. And when he goes dark...no one is safe. \n\nYou’re okay, you’re okay, you’re okay.\n\n\nSo you see, I got addicted. *shrugs* sue me. For every mark that got etched upon his skin, signaling that he hadn’t fallen in that many days, my interest grew to an insurmountable typhoon of feels, controlling my every waking thought. So simple, yet so deeply interesting. And I think the best part is that I wasn’t expecting to like August so much. If I’m being real, I guess I just figured it would be another excellent book with a couple of great characters. I never truly thought that I would fall so hard for him or Kate. And, on top of loving these guys so much, the story, again, so simple, just takes you on a journey that you know isn’t the end-it’s only the beginning. \nWhat I mean by that is, I feel like this book didn’t cover weeks or months…just days. And maybe I’m off a little on that (it’s been a bit since I finished) but my point remains the same: This may not have had a million things happen, but it set up a story that can go so many different directions I don’t even know what to expect. I guess I’m just a little leery boasting that soooomuchhappenedomgsogood and then one of my friends who trusts me finishes and is like…that’s it???? I take my recommendations seriously, and I take boasting authors and their work even more seriously…so when I push that an author’s work is forever perfect-that’s saying something. \nI love, above everything else, the utter destruction or falling apart of the male lead. Sick as it sounds-Yes, I’m aware that I sound like a very sick individual right now…you are all judging me. And you are right to do so….I really am just that sick of a creature because I LOVE TORTURED MALE LEADS SORRY NOT SORRY-male leads who are perfect just don’t do it for me. They used to years ago, but now I crave something a little more destructive and messy. And, sad as it is (brilliant, sorry I think it’s fucking brilliant), Schwab creates the best of the best when it comes to intricately layered males with imperfections. So when August…well…when things start to crumble…I loved this story even more. \n\n\"Kate,” he said with a sob. “I can’t keep going toward the edge-don’t let me fall.” His breath hitched. “I can’t I can’t do it again I can’t go dark again I’m holding on to every little piece and if I let go I can’t get them back I don’t want to disappear-“\n\nAnd Kate. I don’t know that she was anything special, but for some reason I adored her. I loved her tenacity. I loved her fierceness. I loved how vicious and epic and cruel and calculated and how savage she was. I LOVED HER. And, even more than that, I loved them together. Two lost souls who find each other, protect each other, take care of each other….I just, my heart. My heart aches for them. I love them apart…but even more so when they’re partners.\n“That pendant may protect you from the monsters, but it won’t protect you from me.”\nThe writing, which I shouldn’t even have to mention again since everyone knows I adore this author, is superb. It makes me feel as if I am outside my body looking in, floating above my it, euphoric, giddy, restless, wanting to SCREAM ABOUT IT FROM A MOUNTAIN. From the minute I open up a book by her, I am entranced as if Kaa the snake is singing me a deadly lullaby. I am a loyal fan. Addicted for life. A slave to her writing….and there is literally nothing by her I wouldn’t read. \nSo, as you can see, I really think I could keep going. I could talk about the world and the darkness and the curfews and the monsters and the other monsters and the medals and their journey and their friendship and their banter (always with the banter, good old Schwab)….but I can’t make this a million miles long. I won’t. It’s too special of a book and I’m starting to just repeat myself and that’s just stupid. So…I’ll leave you with this: This book is unlike anything by her you’ve read before, so don’t go in expecting what you know to be the norm. She went outside the box. She created a dark world with dark ends and gruesome ways to die. She made you wonder what’s to come. She made you cringe when you met someone new or wondered who to trust. She made you question everything. She made monsters scary. She made monsters real….And I am so in love with her for it. For more of my reviews, please visit:\n\n \n \n \n \n***************Ahhh okay, guys. I do NOT know how she does it. I really don't. I really liked this book-I DID. But when you can take a book that I'm reading while camping (shoot me, really) and turn it into something I ache for, cherish, crave...that's the mark of a true author.And of course, of course, it's one of my most favorite authors ever-VICTORIA SCHWAB. Seriously-guys, she creates these boys that literally ALWAYS take my breath away. I didn't understand the importance of that until about a year or two ago (been reading my whole life) and now it's a mark of only the best, for me. And, hello, Schwab creates boys that are unforgettable, heart-breaking, broken....and I just can never get enough of this author-Or the boys she creates.Once again, mind blown by probably one of my top three favorite authors of all time. I love you Victoria, maker of strong female leads that aren't annoying as fuck and boys that make me want to weep and hug them for the rest of their lives, I really do. RTC. Most definitely."}], "description": "There’s no such thing as safe in a city at war, a city overrun with monsters. In this dark urban fantasy from author Victoria Schwab, a young woman and a young man must choose whether to become heroes or villains—and friends or enemies—with the future of their home at stake. The first of two books.Kate Harker and August Flynn are the heirs to a divided city—a city where the violence has begun to breed actual monsters. All Kate wants is to be as ruthless as her father, who lets the monsters roam free and makes the humans pay for his protection. All August wants is to be human, as good-hearted as his own father, to play a bigger role in protecting the innocent—but he’s one of the monsters. One who can steal a soul with a simple strain of music. When the chance arises to keep an eye on Kate, who’s just been kicked out of her sixth boarding school and returned home, August jumps at it. But Kate discovers August’s secret, and after a failed assassination attempt the pair must flee for their lives.", "title": "This Savage Song\n      \n          (Monsters of Verity #1)", "url": "https://www.goodreads.com/book/show/23299512-this-savage-song", "average": 4.13, "cover": "https://images.gr-assets.com/books/1445529989l/23299512.jpg", "reviews": 7052, "authors": [{"url": "https://www.goodreads.com/author/show/3099544.Victoria_Schwab", "name": "Victoria Schwab"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/23299512-this-savage-song", "http://www.goodreads.com/book/show/26074170-this-savage-song", "http://www.goodreads.com/book/show/26104278-this-savage-song", "http://www.goodreads.com/book/show/28696452-this-savage-song", "http://www.goodreads.com/book/show/10929432-the-archived", "http://www.goodreads.com/book/show/32075662-our-dark-duet", "http://www.goodreads.com/book/show/13638131-the-unbound", "http://www.goodreads.com/book/show/6931344-the-near-witch", "http://www.goodreads.com/book/show/23475666-leave-the-window-open", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}