{"ratings": 7995, "userreviews": [{"userName": "Wafa'a", "userReviewDate": "Apr 06, 2016", "userURL": "http://www.goodreads.com/user/show/5475442-wafa-a", "userReview": "مصابي جليل، والعزاء جميلوظني بأن الله سوف يديلجراح وأسر، واشتياق، وغربة.... كنت أعلم وأنا أقرأ أول صفحاتها بأني ساقرأ رواية عظيمة وأشهد ألماً عظيماّ... ،، كيف لإنسان أن يصمد أمام تلك العتمة وتلك القسوة وتلك المعاناة طيلة ثمانية عشر عاماً في حفرة معتمة مع رفاقه وضعوا فيها جميعاً لكي يدفنًوا أحياءً ، كيف استطاع أن يصمد وهو يري رفاقه يتساقطون واحداً تلو الاخر ويشهد موتهم أمام عينيه ،، كيف استطاع أن يرتقي فوق عذاباته الجسدية و يحافظ على إيمانه وسلامة عقله طوال تلك الفترة ، إنه أمر مدهش بلا شك ..أسلوب أدبي مميز وسرد مذهل ووصف دقيق لعذابات ومعاناة السجين عزيز بنبين في معتقل تازمامارت الأسود ... أول قراءة لي في ادب السجون .. حقاً رواية باهرة و عظيمة و فوق الوصف .."}, {"userName": "ايمان", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/8168485", "userReview": "يقول بابلو نيرودا \"عندما يفكر السجين بالنور فهل هو ذاته الذي يضيء\"فيجيبه الطاهر بن جلون بلى تلك هي العتمة الباهرة..رواية ترصد ثمانية عشر سنة من عمر عزيز بنبين صاحب زنزانة رقم 13 من جناح ب من سجن تازمامارت حيث يقضي عقوبته بعد محاولة انقلاب فاشلة على الحسن الثاني,شهادة حية صاغها الطاهر بن جلون أدبيا فخرجت الحكمة من رحم الصمت و العتمة التي تزيد مع ضيق الجدران لا يخففها سوى الصوت الذي لعب دورا حيويا في التخفيف عن السجناء صوت الحكايا التي تذكرها عزيز و أخرى تخيلها محاولا ترك باب الأمل مفتوحا لزملائه هذا الأمل الذي جلد أكثر من مرة مع وفاة أحد السجناء و دفنه بطريقة لا تقل بشاعة عن الموت ذاته..الرواية على خلاف شهادات غيره من السجناء في كتب أخرى اعتمدت على الجانب الأسري لعزيز بين والد متهور بنعم بالرفاهية في قصور الذين خطفوا ودمروا انسانية ابنه و أم مثابرة فعلت المستحيل لتربية ابنائها في غياب زوجها..عشنا مع عزيز في مناجاة ساحرة أقرب الى التصوف ساعدته على التحليق عاليا بعيدا عن جدران السجن و لو للحظات جددت نشاطه حتى اقترب من النرفانا ينزل احيانا الى الواقع ليكمل حكايته معبقة بروائح سكنتنا طيلة القراءة ووترت أعصابنا لم نرتح منها الا بالسراح.. من اصل ثلاثة عشر سجين خرج اربعة فقط منهم البطل عزيز اربعة نجد المرزوقي في كتابه يصفهم بقايا رجال غطتهم شعورهم يمشون على أربع من هول ما رأوه و عاشوه مدثرين بقذارتهم.افظع شيء عاشه قاطنوا تازمامارت و ربما تكون حالة اي سجين سياسي تلك الغربة الاجتماعية و العائلية التي تجبرهم على العودة الى ذكريات السجن بتفاصيلها فيعيشون الالم مرتين..لا حول ولا قوة الا باللهملاحظة : لمن لم يقرأ العتمة الباهرة بعد لو كنت تبحث عن تفاصيل عن الحياة في تازمامارت لن تجدها في هذه الرواية عليك بشهادات حقيقية كالمرزوقي في كتابه الزنزانة 10 و الرايس في كتابه جحيم تازمامارت وغيرهما..قراءة ممتعة"}, {"userName": "Rinda Elwakil ", "userReviewDate": "Mar 21, 2014", "userURL": "http://www.goodreads.com/user/show/13856367-rinda-elwakil", "userReview": "و لكن هناك أشياء عديدة بالعالم لا نعرف عنها شيئاً يا صغيرة..أشياء فظيعة، لا يكفي إخفاء رؤوسنا في الوسادات أو إغماض أعيننا و لا التظاهر بأنها غير موجودة لجعلها تزول.رواية كابوسية..أكثر ما يؤذيك فيها معرفة أنها حقيقية..أنها شهادة إنسان مثلي و مثلك اعتُقل لأنه عارض نظامه الحاكم..و هناك تري بعينك و تسمع بأذنك أهوال حفرة الجحيم تلك المُسماه \"تزممارت\"..من مرض لا يُعالج إلي طعام غير آدمي إلي العقارب التي ينشرها مأمور المعتقل عمداً في الحفرة كي يتخلص من بعض المعتلقين..عن انتظار رفاق السجن لموت أحدهم لأن تلك المناسبة الوحيدة التي يرون فيها السماء..عندما يخرجون لدفن ميت جديد منهم..عن القبور المحفورة بعددهم سلفاً و نظرهم إليها في ذعر كل مرة..عن بطل القصة الذي يجد الرفاق عنده ونساً لأنه كان قارئاً في يوم ما، فيحاول أن يتذكر ما قرأ و يقصه عليهم..و عندما مل يوماً و تعب و غادر، عاد ليجد أحدهم قد مات..مات لأنه فقد آخر ما كان يربطه بخياله..عن العصفور البائس الذي هبط عليهم يوماً و التفوا عليه ليحملوه بالرسائل لكل من يتذكرون..عن شحذ البطل لخياله لأنه الشئ الوحيد الذي لا سيطرة لهم عليه، لأنه لو فقده لهلك..عن زميلهم الجديد..عن دموعي لمعرفتي بأن تلك أحداث حقيقية و ليست من خيال راوٍ.. لاداع لأن تحكي لي، إني أعلم مقدار مايستطيعه البشر إذا قرروا أن يؤذوا بشراآخرين. \"والدة أحد المعتقلين\" ..كان الأذي عظيم المقدار للدرجة التي جعلت البطل عاجز عن التعرف علي نفسه بعد خروجه من المعتقل مرة أخري، لأنه بالفعل كان شخصاً آخر. شهادة أحمد المرزوقي، أحد سجناء تزممارت:https://www.youtube.com/watch?v=_ioJx...الطاهر بن جلون كاتب قدير شديد الاهتمام بالتفاصيل، سأحب أن اقرأ له أعمال أخري و إن كنت أتمني لو لم تكن بتلك الكابوسية :)"}, {"userName": "Ahmed Oraby", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/8711518-ahmed-oraby", "userReview": "انتقامي الوحيد، أن أروي ما حدث"}, {"userName": "طَيْف", "userReviewDate": "May 17, 2012", "userURL": "http://www.goodreads.com/user/show/7810481", "userReview": "لما بدأت قراءتها أمسكت قلما وورقة لأكتب منها بعض الاقتباساتنسيت قلمي وورقتي ونفسي...وغرقت بين حروفهالم يعد يهمني تلك المقتطفاتحواسي كلها قيدتها الحروفأقرأ...أتأمل...أتفكر...وأحيا الألم في أعلى درجاتهتدور أحداث الرواية في سجون المغرب بعد كارثة انقلاب فاشل راح ضحيتها أبرياء لم يكونوا أصلاً يعرفون أنهم في طريقهم لانقلاب..لم يحظوا بفرصة توديع أهل أو إنهاء التزامات.. وربما خرج أحدهم من بيته عجلاً دون قبلة يطبعها على رأس أبويه.. ولم يعد !أو عاد كهلاً ينوء بثقل سنون عجاف!!وصف سليم السجن...(في الواقع كان القبرُ زنزانةً يبلغ طولها ثلاثة أمتار وعرضها مترا ً ونصف المتر أما سقفها فوطيءٌ جدا ً يتراوح ارتفاعه بين مئة وخمسين ومائة وستين سنتمتراً )(للأسف، حين رفعوا العصابة عن عيني لم أرَ سوى العتمة.ظننت أني فقدت البصر،لقد وضعنا في سجن مؤبد شيّد لكي يبقى،إلى الأبد، غارقا في الظلمات)وتحدث لنا عن معادلته التي يحاول من خلالها التشبث بالحياة...بأن يتخلى عن جسده ويعيش داخل روحة في هذه الزنزانة.(كان الأمر شاقاً كان دُربةً عتهاً لا بُد منه, اختبار ينبغي اجتيازه بأي ثمن أن تكون هناك من دون أن تكون . أن يُغلق المرءُ حواسه ويُسلّطها في اتجاه آخر ويمنحها حياة أُخرى )ووصف السجناء من حوله...ذكر أسماءهم...وما تميز به كل منهم...وتفاصيل موتهم المرعبة... كان هُناك البنادول , الساعة هو الذي يخبرهم بوقتها هو الذي يقول لهم : التاريخ , الوقت , الزمان , واليوم ! وكان هُناك الأستاذ , قارئ جليل يُحفظ القرآن الكريم يتلو على مسامعهم بعضاً من الآيات الكريمة... وهُناك عشّار المتحدث النّهم الصاخب على الكُل ذا الطابع المزاجي العصبي ...وكان هو الحكواتي الذي يروي قصصا تشبث ببقاياها في ذاكرته... وروى لنا تفاصيل قضائهم لأوقاتهم...وسائل تسليتهم...أحاديثهم مع أنفسهمعلاقتهم بالحيوانات التي مرت بهم...و التي لم تسلم من المعاناة...وكأن الأرض بكل ما فيها تآمرت على الحياة بكل أشكالها في تزمامارتالتفاصيل الصغيرة التي كثيرا وكثيرا جدا ما نهمل ذكرها وتذكرها .... تصبح هي الحدث الرئيسي في حياتهم...و نقلنا معه لعالم أحلامه وتخيلاته وذكرياته...يحلم لكي نهرب من الواقع...رياضة ذهنية فكرية ليبتعد عن المأساة...و يتخفف من الزمن و الذاكرة و الجور...ويخمد ذكرياته إن لاحت له بكل ما أوتي من قوة.أراحني جدا حديثه الروحاني وإيمانه العميق...ويقينه بالله...واعتصامه به وقت محنته...وحرصه على نقاء قلبه من كل حقد...(أعطني القدرة على أن أنسى،أن أستنكر، أن أرفض الرد على الحقد بالحقد.اجعلني في مكان آخر،أعني على التخلي عن هذا التعلق الذي يعيقني، أعني على أن أخرج،لطفا،من جسدي هذا الذي ما عاد يشبه جسدا، بل رزمة عظام مشوهة)وتعجبت من احتفاظه بالأمل...رغم موت أغلب السجناء...فقد ظل الأمل يحدوه بالنجاةوعجبي الأكبر كان من وحشية الإنسان ضد أخيه الإنسان...لما يتحلل من كل مشاعر الإنسانيةاكتملت في الرواية كل عناصر النجوم الخمس...راوِ ...وكاتب...ومترجم"}, {"userName": "Fotooh Jarkas", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/5245958-fotooh-jarkas", "userReview": "تحديث 2018للاطلاع على تفاصيل أوفى حول سجن تزمامارت ، و انقلاب الصخيرات الذي كان سببا في إنشائه، يسلط أحمد المرزوقي -أحد الضباط المتورطين في الانقلاب الفاشل و الناجين من قبور تزمامارت -في حواره مع أحمد منصور ، يسلط الضوء بأسلوب الحكواتي خفيف الظل ، على تفاصيل الانقلاب و شيء من معاناته وأصدقائه في تلك السنوات العجافالرابط: https://www.youtube.com/playlist?list...المراجعة : 19.07.2012حكمت المحكمة على المتهم ( بالموت مدى الحياة )..ليس حكما مستحيلا في محكمة عسكرية و مع حاكم عربي بدرجة امتياز .هكذا إذاً ، قرر ملك المغرب أن يحقق معجزته الجديدة و ينفذ ما دُعي يوما بالمستحيل .. هكذا قام بنفي ضباط وعساكر تورطوا في انقلاب عسكري فاشل إلى القبور ، قبور تزمامارت.تنأى هذه الرواية بنفسها عن أدب السجون التقليدي ، وتعبر به إلى أفق مبدع يفوق إبداع الملوك العرب في تقسيط الموت على سكان السجون.فيها ستبتعد عن ثنائية السجون التقليدية ( الجلاد و الضحية )،إذ لا صور للتعذيب الجسدي أو الإهانات و السلوكيات الدنيئة التي ترتكب عادة بحق السجناء ، بل نجد أن طبيعة المكان قد تكفلت بكل ذلك ، و كَفَت السجان مؤونة الإهانة و الإساءة و التصدي لأنفاس و زفرات المحكومين .بعيدا عن تشخيص و وصف المواجهة بين الظالم والمظلوم ، يروح الكاتب إلى ثنائية جوهرية ،وهي ( المادة و الروح )..والمادة هنا لا تقتصر على معطيات السجن فحسب، لكنها تمتد بصورة أعمق إلى الجسد وآلامه التي اكتسبها بتقادم سنيّ الإهمال .هذه الثنائية تجسدت من خلال سليم -بطل الرواية- الذي عاش حالة تجاذب دائمة بين الأرض و السماء ، بين سجنه وجسده وآلامه التي تنال منه ، وبين روحه التي لا تنفك تحلق عاليا إلى فضاءات أوسع.و كلما حاول أن يعبر بروحه حدود المكان ، عنّفه الألم مذكرا إياه أن لا مكان للروح بين أنصاف الميتين ، بيد أن العتمة التي سكنت المكان لم تصل قلبه ، بل أفاض هو من نور روحه على قساوة السجن و وحشته.. هاجر إلى روحه بداية و من ثم هاجر معها ليكسب الرهان بما يشبه المعجزة .وبينما يخيل للقارئ أن هذا الصراع المضني هو أمر محتوم قدّرته ظروف السجن الاستثنائية تلك على كل السجناء ،تُبرز شخصية عشار النقيض من ذلك ، فالسجن لم يُقعد عشار الجسد وحسب ، بل أقعده روحه ، فغدا كجدران السجن وعتمته لا يقل شأنا عنها في الإزعاج والتضييق على نفسه أولا، ومن ثم على السجناء الآخرين . هذه الرواية هي قصة التفاضل الأبدي مع الذات ...قصة الخيارات التي تلازم البشر ، ولا تغادرهم حتى في حضرة الموت المؤجل ..نعم هناك عتمة ، لكن النور هو قرار نتخذه نحن بملء أرواحنا ، قد نعالجه بفتور المتشككين ، وقد نأخذه بإيمان عميق حدّ الإبهار . عتمة... لكنها والله باهرة !"}, {"userName": "Nojood Alsudairi", "userReviewDate": "Dec 01, 2009", "userURL": "http://www.goodreads.com/user/show/580165-nojood-alsudairi", "userReview": "مذكرات أحد المعتقلين السياسيين كما استوحاها الكاتب من أحدهمملهمة جداكيف يمكن لرحلة واحدة أن تقضي على حياتك دون أن يكون لك أي علم بما يحدثكيف لثمان عشرة عاما من السجن أن تؤثر في البعض فيعمل العقل بينما تفقد البعض عقولهم ولا تؤثر في آخرين على الإطلاق؟كيف تقضي سنوات العزلة على كل المشاعر حتى الحقد؟كيف لرمز واحد \"الحجر الأسود\" أن يختزل كل الرموز الإيمانية في عقل البطل؟أنهيت الكتاب لأغرق في تأملاتيأعجبني اختزال كل مشاعر الرفض من الابن لأبيه في قوله: \"هل ذهبت لأقتل الملك أم لأقتل أبي؟\"على العكس من كتاب \"الخبز الحافي\" الذي لم يتوان عن كيل كل أنواع الشتائم لأبيهالروائح في هذا الكتاب أزعجتني أيضا ولكنها زادت من قدر التعاطف عندي مع المعتقللا أظن بأني سأكتفي بقراءته مرة واحدة لجمال اللغة ورقي الأسلوب"}, {"userName": "Mohamed Al", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/2837640-mohamed-al", "userReview": "رواية توثق -أدبيًا- شهادة أحد سجناء معتقل تزمامارات الرهيب، ذلك القبر، الحفرة، الثقب الأسود الذي ابتلع أرواح عشرات الأبرياء الذين اتّهموا بتنفيذ محاولة انقلاب الصّخيرات على ملك المغرب الحسن الثاني في عام 1971الرواية رغم فوزها بجائزة دبلن للأدب \"إمباك\" العالمية سنة 2004، إلا أنّها تعرضت لسيل من الانتقادات شنّه -عليه- الناجون من معتقل تازمامارت ، والذين قاموا بدورهم بتوثيق تجاربهم/معاناتهم في كتب أخرى، إذ أنهم رفضوا وبشدة أن يستثمر بن جلّون الذي يعيش على مقاهي الشانزليزيه في فرنسا معاناتهم لأغراضه الشخصية ، خصوصًا أنه كان يعلم طيلة هذه السنوات بوجودهم في تازمامارت ولم يتحدث للعالم عنهم آنذاك. في المقابل، دافع بن جلون عن نفسه مدعيًا بأنّه هو أيضاً كان رازحاً مثل أي مواطن مغربي آخر تحت مقصلة الخوف والقمع، ولم يكن بوسعه المجازفة بالانقطاع عن بلده إلى الأبد إن هو أصدر كتابه مبكراً ، قبل أن تتيح له سياسة الانفتاح الإعلامي وحرية التعبير ذلكبعيداً عن الإنتقادات اللاذعة التي تعرضت لها الرواية، إلا أنها نجحت في تصوير أوجاع المساجين في ذلك المعتقل الرهيب بطريقة بارعة لا يجيدها إلا بن جلّون ذاتهأنصح من قرأ الرواية، أو يفكر في قراءتها، أن يشاهد حلقات برنامج \"شاهد على العصر\" التي استضافت فيها قناة الجزيرة أحمد المرزوقي أحد الناجين/العائدين من ذلك الجحيم، وفيها يروي سيرته -وسيرة رفاقه- منذ الإنقلاب العسكري ومحاكمتهم وإلقاءهم في السّجون .. وحتّى لحظة نجاتهم!"}, {"userName": "Ahmed", "userReviewDate": "Aug 31, 2016", "userURL": "http://www.goodreads.com/user/show/11260920-ahmed", "userReview": "أي شيطان تقمص بن جلون ليقدم لنا ذلك النص الأدبي الملعون،الألم بكل تفاصيله والبراعة الأدبية منقطعة النظير ليقدم لنا عمل من أفضل ما قُدم في أدب السجون على الاطلاق."}, {"userName": "SÕÛHĀÏB | صُهَيْبُ", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/53867108-s-h-b", "userReview": "\"إذا أردتَ أن تتذوَق صِدق المعاناة، وتتذوّق طعمَ الحياة الآخَر، فرجاءً لا تقرأ رواية عن الحبّ السرمديّ، ولكِن إقرأ في أدبِ السجون\"(الرواية لقصة حقيقية)"}, {"userName": "امتياز", "userReviewDate": "Jul 21, 2012", "userURL": "http://www.goodreads.com/user/show/5593749", "userReview": "لا اذكر بالضبط من الذي رشح لي قراءة هذه الرواية ، إلا أني قمت بتحميل نسختها الالكترونية وأرجئت قراءتها حتى أفرغ من الكتب التي تزدحم على رف \" الكتب المقروءة حالياً \".ذات يوم بينما كنت مستغرقة في قراءة رواية \" فرج \" لرضوى عاشور ، مرت عليا كلمة \" تزمامارت \" وهو اسم معتقل مغربي ، مورست ضد قاطنيه أبشع صور التعذيب الجسدي والنفسي ، وبقيت تلك الكلمة عالقة في بالي لفترة طويلة ، ولم أتصور أن هناك من كتب عن ذلك المعتقل البشع ، وأن تلك الرواية التي أرجئت قراءتها ما هي إلا رواية لأحد معتقلي ذاك السجن!أثناء قراءتي لكتاب \" خمس دقائق وحسب \" لهبة الدباغ ، سارع بعض الأصدقاء بطرح نماذج أخرى وكتب شبيهة بهذا الكتاب منها: \" القوقعة \" للسوري مصطفى خليفة و\" تلك العتمة الباهرة \" للمغربي الطاهر بن جلون ، فتذكرت على الفور أن تلك الرواية موجودة بحوزتي ، وقررت البدء بها لأرى النموذج المغربي في الاعتقال والتعذيب.وقد هالني ما قرأت ، كيف يُساق ضباط وجنود إلى انقلاب عسكري وهم لا يعرفون شيئا ، بل يعتقدون بأنهم في إحدى المناورات العسكرية الدورية ، هذا ما حدث بالضبط أثناء المحاولة الفاشلة لاغتيال العاهل المغربي الحسن الثاني في منطقة الصخيرات عام 1971م.بعد أن تم اعتقال كل من شارك بالانقلاب ، قامت السلطات بإعدام كبار الضباط الذين قادوا الانقلاب ، أما صغار الضباط والجنود ، فقد تم الحكم عليهم بالسجن لمدة عشر سنوات في سجن القنيطرة ولكن سرعان ما تم نقلهم إلى معتقل تزمامارت عام 1972 م ، ليموتوا هناك ألف مرة في اليوم الواحد قبل أن يحصلوا على العفو الملكي في عهد العاهل المغربي الجديد محمد السادس عام 1991م.كان عددهم 58 معتقلاً وبعد ثمانية عشر عاماً خرج من ذاك المعتقل 28 أسيراً بعد وفاة 30 آخرين!إنه الجحيم نفسه .. يروي الكاتب الطاهر \" والذي هوجم فيما بعد لصمته الطويل قبل كتابة تلك الرواية التي تفضح المأساة التي مورست بحق هؤلاء\" ، يروي كيف مات 30 أسيراً .. ورغم أن الأسباب قد تعددت وأن الموت واحد .. إلا أن موت كل شخص منهم كانت صدمة وفاجعة مختلفة عن أختها ، فمنهم من مات بسبب الإمساك وأخر بسبب الإسهال ، وهناك من مات بعد أن أكلته الصراصير ، ومن مات مسموماً ببيوض الصراصير أو ملدوغاً من عقرب ، ومنهم من مات بعد أن قام بشنق نفسه أو من قام برطم رأسه في الجدار ، ومنهم من أصابه الجنون الذي أدى إلى موته فيما بعد ، والكثير من القصص المخيفة والمرعبة في ذلك القبر أو الحفرة التي وضع كل شخص فيها ، بحيث لا يدخلها النور أبداً ولا يستطيع المُعتقل أن يقف معتدل الظهر مما سبب لهم ضعفاً وآلاماً مبرحة في الظهر وفي المفاصل .. ثمانية عشر عاماً ، تخيل معي ، ثمانية عشر عاماً داخل قبر وأنت مازلت في عداد الأحياء ، أي ظلم وأي جبروت هذا الذي يدفع بإنسان ليقوم بتلك الأفعال الشاذة تجاه إنسان أخر لمجرد أنه أخطأ – مهما كان ذلك الخطأ – هل يستحق أن يعاقب بذلك العقاب ؟!لطالما سألت نفسي هذا السؤال بعد انتهائي من قراءة تلك الرواية ، وصدق الكاتب حين قال على لسان والدة بطل الرواية \" سليم \" : \" إني أعرف مقدار ما يستطيعه البشر إذا قرروا أن يؤذوا بشرًا آخرين\".رواية مرعبة ومخيفة بحق ولكنها جديرة بالقراءة ، وأخيراً .. تذكر أيها الإنسان إذا ما دعتك قدرتك على ظلم الناس ، فتذكر قدرة الله عليك."}, {"userName": "Mohammed", "userReviewDate": "Dec 20, 2015", "userURL": "http://www.goodreads.com/user/show/6823144-mohammed", "userReview": "\" أعلم مقدارمايستطيعه البشر إذا قرروا أن يؤذوا بشرا آخرين\"الأمل هو أنجع الأدوية وأشد الأنظمة الدفاعية فعالية. هو النور الذي ينبثق من رحم العتمة، والحياة التي تشع في بدن السقيم. إن كان لهذه الرواية رسالة فرسالتها هي التمسك بالأمل مهما تداعت الخطوب واحلولك الأفق.(تلك العتمة الباهرة) هي رواية أدب سجون مكتملة الأركان. فهي تصف تفاصيل حياة المعتقل بعزلتها وعذاباتها. كما أنها تغوص في أعماق شخصيات المساجين -والسجانين أحيانا- وتكشف مافيها من مواطن قوة وضعف وغرابة. أضف إلى ذلك تسلط الضوء على أساليب مختلف الشخصيات في التعاطي مع تلك الحياة القاسية وتأرجحهم بين اليأس والتفاؤل، السخرية والندب، الإيمان والنكران...الخ. يصور النص أيضا المنعطفات الحرجة في تعامل اولئك البؤساء مع بعضهم البعض فتريك صنوف الوفاء والجحود، التضامن والأنانية.إذا كانت هذه قواسم مشتركة بين روايات أدب السجون فمالذي يميز هذه؟ أولا اللغة -لغة المؤلف والمترجم- راقية، شعرية ومرهفة. هناك أيضا الظروف الفريدة من حيث عدم تحديد مدة المحكومية وبشاعة الظروف المعيشية إلى جانب العزلة التامة عن العالم الخارجي. هناك أيضا الجانب الصوفي والرياضة الروحانية التي يمارسها بطل الرواية والتي قد تلهم القارئ بشكل أو بآخر.الجدير بالذكر أن الرواية كتبت بالفرنسية عن حياة السجين عزيز بنبين وتم ترجمتها إلى العربية ببراعة على يد الاستاذ بسام حجار، وقد حازت على جائزة إمباك الأدبية. طبقا لبعض المراجع، يعد هذا الكتاب أول اقتراب للمؤلف من الساحة السياسية المغربية، وبالتالي اعتبر نقطة سوداء في سجله الذي كان ناصع البياض لدى أجهزة الأمن المغربية."}, {"userName": "أحمد أبازيد Ahmad Abazed", "userReviewDate": "Aug 30, 2012", "userURL": "http://www.goodreads.com/user/show/2717148-ahmad-abazed", "userReview": "صفحةٌ أخرى قاتمةٌ من كتاب الوحل الذي غمرنا عقوداً .... صفحةٌ أخرى تعرّي كلّ ما كان يضجّ سخفاً من الصمت عن وجع الإنسان و انتهاك الوجود ....و مهما حصل , على هذا كلّه أن يسجّل و يُنقل و ينتشر في الكتب .... ولكن عليه أن ينقطع تماماً عن الحدوث !"}, {"userName": "علي الماجد", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/23958010", "userReview": "هذة الرواية تصف اوجاع و انات و زفرات التعذيب و الاذلال في السجون . رواية مبهرة اضاف لها المؤلف جوه الخاص فتجعلك تشكر نعمة الشمس التي تسلخ ظهرك وصف دقيق و معاناة حقيقية ولعمري ان المعتقل يتمنى الموت ليرتاح و يتخلص من أمل الحياة لأن الامل يؤلمه.رغم ان احداث الرواية في زنزانة لا ترى الضوء لكن بها الكثير من الشخوص المشعة بالأمل و احياناً بالظلم مثل الاب الاناني القوي الحافظة و التي اكتنز الالاف من القصائد لاجل الملك لكنه ترك عائلة تحت وطئة الفقر الى عائلة اخرى. المصير الشنيع قد ابتلع اصدقائة واحد تلو الاخر بلدغة عقرب او بجنون او انتحار او امساك و تحجر امعاء و الكثير الكثيرمدهش كيف كان البطل يسليهم بالحكايا و القصص و الافلام التي شاهدها و كانت لهم النور في العتمةكيف وصل المعتقلين لحالة انتقامهم بالكلام من بعضهم بعضو السجان المعذب الذي كان يسرق طعامهم و كيف قابلهم بالترحيب بعد ان اطلق سراحهماختياره للحجر الاسود بالكعبة اساس لسلامة عقله رائع فوق الوصفلقائهم باليمامة و تكفيلها بنقل الرسائل مشهد مؤلم و كيف اضحت اليمامة حرية رسولهم لسماء العالم من الروايات التي لم استطع اكملها بنفس واحد بل اخترت الاستراحة من شدة الالم التي بها و الا انهرت بكاءااصابتني بحالة من الكأبة و اظهرت جبروت و ظلم الانسان لاخيهوصلت الى قرار ،اي كانت فعلة الشخص و ان اذنب خلق الله . فالعقاب الرادع له هو الاعدام بدلا من قتله كل يوم فهذا انسب لنا كبشر"}, {"userName": "..Effat..", "userReviewDate": "Feb 23, 2010", "userURL": "http://www.goodreads.com/user/show/3322110-effat", "userReview": "رائع لحد الألمكنت أحاول جاهدة ألا أعايش نفس الشعور إلا أنني أجد نفسي تلقائيا وبدون وعي مني أنغمس في تلك الإحساسات الأليمة!هل يعقل أن يكون غاية طلبك ومنتهى أحلامك هو أن تموتورغم ذلك لايحقق طلبكهل نستطيع التحليق بأرواحنا وفصلها عن ذواتنا في الوقت الذي نكون فيه بأمس الحاجة لتك الروح لتضمد جراح الجسد المعذب  !من الصعب أن تصبح إنسانًا بلا مشاعر في اعتقادي أن التعذيب الأكبر هو أن تتمسك طوال عمرك ببصيص من \"الأمل\" ثم تفاجأ بأنها كانت أكبر كذبه كذبتها في حياتك وعلى من؟ على أغلى شخص وهو \"نفسك حينها يتحول الأمل إلى ألموماكنت تعده ليكون لك قوة وثباتا فلا يزيدك إلا ضعفا وانكسارا.أعتبر هذا الكتاب من الأشياء التي ستعينني على مواجهة الأزمات بصبر وثبات شكرا د.نجود. أعتقد أنني أحتاج للاحتفاظ بنسخه منه"}, {"userName": "مصطفي سليمان", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/1963230", "userReview": "\" وماالموت الا راحة لا اتمناها لك \"اعتقد ان الجملة دي كانت بترن ف ودن من شيدو حفرة جحيم زي ديرواية مقبضة بكل ما تحمله الكلمةمكتوب علي يد شاعر مرهف المشاعرمنقولة عن شهادة حقيقةبمعني مختصركارثةالرواية مش طويلة علشان اخد وقت فيها ولكني خدت وقت طويل لاني فعلاكنت بغالب نفسي اني اكملهانفس شعوري معشرفالوصف المجسم والبسيط والواضح للتعذيب النفسي والجسدي والمعنوي وكل شئمحاولة انقلاب علي الملك اللي نفذوها حتي لم يعرفوا دا وكانوا فاكرين انهم بيقتلوا اعداء الوطن وانهم بيحموا الملك , او انها مناوراة بالسلاح الحيملك مين؟مش فارقه فعلاملك مصر ملك المغرباصحاب الفخامة والكراسي الملعونة كلهم سواءكلهم مؤاخرتهم متعاصه دم وارواحهم ملعقة بدعوات مظلومين كثيرةانا مش مع المحاولة ولا بدافع عنها قال يعني لو كانت نجحت المحاولة وكانت البلد عسكرية دا كان هيبقي افضلملعون ابو الاتنين انا بتكلم علي فكرة العقابغلطوا تمامينالوا العقابلكن ان احبس ناس 18 سنة في حفرة اسلط عليهم عقارب واقسم انهم ميشفوش النورواحد يموت من الامساكوالاخر يموت من اكله بويضات الصراصير لانه كان فاكره عيشواخر يموت علشان الغرغينا ف جسده بدات من ذراعه انتهي بان الحشرات كلها اعتبرته وليمة الكفرة في اشد اوقاتهم وقت بداية ظهور الاسلامكانوا الطف واشد عذوبة من هذانتغني بالاخلاق وبالمكارم واننا مهد الحضاراتاحب افكر المواطنين الشرفاء من المحيط للخليجان يوم البعث والحساب هيجي والقنوات المحلية والجرائد القوميةلن تشفع للاحدانا اسف لجلهي بالقضية ديف طبعا انجازات الملكوخطوبته كانت اهم للعالممن حفنة من البشر ملقون ف حفرة فالجحيماسف لغبائئ ان هناك بعض العدل ف قلوب الحكامواقصد هنا كل الحكامكلهم يتكلمون عن مؤامرة خارجيةوهم العن و اضل سبيلاالانبياء كلهم بعثوا من عندنا من اجل نشر السلام والرحمة والعدلوتوحيد الله الرب فوحدنهم علي كراسيهم وعلي عروشهماضحك بشدة كل ما بتذكر حديث سيدنا عمر\" لو تعثرت بغلة في بغداد لسؤلت عليها \"علشان ممهدش ليها الطريق ليهمش ارمي ناس واتركهم للعفن بينما انا اصلي واصوم خير امة اخرجت للناس لم يكن يقصد به الرسولكلام نظري ايها السادةكان يقصد بها الفعل والعمل لو ابنته سرقت لقطع يديهامش كرم اولاده واعطاهم البلادمش قتل شعبه بسم الملكوالبلدوالدولةملعونين نحن بدماء هولاء بدماء الشهداءبدعوات المظلومينوللحكام والملوك والامراء والعسكر والمواطنين الشرفاءاحب ان اقول لكم\" وما الموت الا راحة لا اتمناها لكم \""}, {"userName": "mai ahmd", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/7154074-mai-ahmd", "userReview": "كنتُ قد جهزتُ نفسي قبل أن ابدأ في عتمة تزممارت فبعد ما قرأته في كتاب السجين 10 وكتاب الرايس تذكرة إلى الجحيم أصبحت قراءة هذا الكتاب أخف وطأة تميز ت هذه الرواية بأسلوبها البليغ في وصف شدة أهوال السجن ومعاناة المسجونين غير أن الطاهر بن جلون صنع سجناء مختلفين نوعا ما عمن قرأت شهاداتهم أظنه دمج بعض القصص كما إن شخصيات بعض المساجين لا تشبه الشخصيات التي قرأت عنها في القصص الحقيقية لقد أطلق بن جلون مستندا على قصة أحد السجناء لخياله العنان على الرغم من القيمة الأدبية لهذا النص إلا إن الكتابين السابقين أثرا بي أكثر مما فعلت عتمته الباهرة ربما لأنها كتبت من معاناة حقيقية كما إن قصة الحمامة التي ذكرها بن جلون كانت أكثر صدقا في كتاب المرزوقي على إن لغة الكاتب وأسلوبه الأدبي يفوز بلاشك"}, {"userName": "Nawal Al-Qussyer", "userReviewDate": "May 27, 2010", "userURL": "http://www.goodreads.com/user/show/2352995-nawal-al-qussyer", "userReview": "تقول ام المعتقل: لاداعي لأن تحكي لي. إني أعلم مقدار مايستطيعه البشر إذا قرروا أن يؤذوا بشرا آخرين.فعلا.. الحين عرفت ايش قدرة البشر حتى لو كانوا من نفس الجنس ونفس الدين.. قدرتهم ع الايذاء خارقة اعوذ بالله. اللي تلقوه في المعتقل شيء فوق رخصة الاذية البشرية.. شي يسلب انسانيه الانسان ويحوله الى وحش.الحمد لله انك يارب انت ربي! هذي الرواية هي مستوحاة من شهادة احد المعتقلين الناجين من معتقل تزمامارت.. حكى عن الايام بالسجن هناك.. ال ١٨ سنة في المعتقل علي الرغم انو الحكم كان ٥ سنوات فقط.. عن الظلمه اللي الفوها.. عن الاكل الشحيح اللي يعطيهم اقل طاقة ممكن يعيشون فيها.. كانوا يتقصدون انهم يعيشون باقل طاقة عشان يذوقون العذاب صح وعشان يتجرعون الموت البطيء الغير رحيم! اعوذ بالله من هالفئة من البشر.. اعوذ بك منهم يالله.. يارب لاتسلطهم علينا ولا على احبابنا ولا على المسلمينانا للحين مصدومة من اللي ورا هالمعتقل!تقريبا كنت متألمة جدا لمن كنت اقرا في بداية الكتب قبل ماينجو من المعتقل.. كنت اقرا و اوقف لاني مب قادرة اتحمل الشعور واسأل نفسي كيف هم تحملوا؟بس الشي اللي قلب موازين الكتاب عندي واخترت اعطيه اربع نجون واخترت اني اوصي الناس فيههو الجزء الاخير من الكتاب، الجزء اللي بعد الاعتقال.. الحياة بعد الموتلمن يطلع بعد ١٨ سنة وهو مايعرف شكل وجهه ومايعرف كيف الحياة صارت ومايعرف وجوه اهلهولمن يشوف اخته مايعرفها..ولمن يتعود ع النوم متحدب.. ولمن يشيخ جلده بدل المره مرتين.. ولمن يحتاج لعلاج نفساني..ولمن يحس ان الحياة تساقطت منه يوم ورا يومولمن الشباب كله راح في ظلام. ولمن انولد من جديد بس متأخر كثير !وقتلني شعور انه كان يقتصد في كل شي بعد خروجه لانه مو متعود الحياة السهلة والمرفههماكان يستوعب صنابير المويه وكان يحدق فيها فترة طويله!اخ !هذا الكتاب يخليك تحس بالنعم اللي نحسها بسيطة واخذناها كشيء مفترض، او we took it for grantedهذي الرواية تصور لك مدى وحشية الانسان لمن يطغى على قلبه وعقله كل معني من وجوده.. وكل معني من خلقه..تصور لك قد ايش الانسان مرعب لمن يمتلك سلطة بدون اي نوايا خيره! قد ايش الملك يحول اللي نفسه ضعيفة الى آله تنتج انواع من التعذيب والوحشيهفيه شي لامسني بالرواية حسيت قدرة الله في حلق الانسان فوق التصور.. شي عجيب فعلا.. وهي القدرة ع التكيف.مثل السجين اللي كان يحسب اليوم والتاريخ والوقت بدون اي تقويم او اي ساعةكيف صنعوا ابرة..كيف اخذوا حديدة المكنسة وخلوها مقص للشعر!واشياء كثيرة حصلت وقاوموها تثبت لك بطريقة ما قد ايش ربي خلقنا في احسن صورة وكيفية !..احب اقول شكرا للغة الرواية.. جدا جدا مو مصطنعة.. جدا مو محشوة بكلمات مثل \"ثمة\" و\"غراب ينعق\":]:]:].وشكرا للمترجم اللي وصل الشعور باحسن ترجمة ممكن اتخيلها!دعيت للمعتقلين في صلاتي العشاء .. الله يعوضهم عن حياتهم خير بالجنة،، والله يغفر للي ماتوا منهم والله يشملهم برحمته اللي شلمت كل شي..والله يعوض الناجي منهم في الدنيا والاخرة. خير كبيروالله يتكفل بكل من كان ورا هالعذاب الوحشي!بقى شي اخير اقوله:؛حرام هالرواية ماتصير فلم :]من اول ماقرأت اول صفحة على طول تخيلت الفلم وحتى حددت التون خخخخخخخخوفيه صوت راوي عميييق يوصل للمشاهد .. ويبدا الفلم بمشهد متصور من فوق على اراضي المغرب والتصوير الييييموصوت الراوي وهو يقول:لطالما فتشت عن الحجر الاسود الذي يطهر،،،،،، الخزي افتار ونمبر ٢٣ يعني :]اوصي بقراءة هالرواية بشدة! شيء جميل تقرا روايه بشعور قوي وماهي قصة حب او فراق! انقرفنا من هالقصص"}, {"userName": "Hussain Hamadi", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/22979218-hussain-hamadi", "userReview": "مراجعة وتقييم كتاب 📘.اسم الكتاب: تلك العتمة الباهرةاسم الكاتب: الطاهر بن جلون اسم المترجم: بسام حجازعدد صفحات الكتاب :254 صفحة دار النشر : المركز الثقافي العربي نوع الكتاب : أدب السجون / واقعية تقييم الكتاب في صفحة Goodreads : (4.27) نوع القراءة : الكتروني 📖..📌 ملخص الرواية:-...الحياة والموت هل يجتمعان معا!! هل يمكن ان تعيش ميتا؟! او ان تموت وانت على قيد الحياة ؟! كيف تكون الحياة في حفرة!!.رواية تتناول جانب من حياة احد مساجين (تزامامارت) والذي ادخل فيها عدد من المساجين (٢٣) سجين اثر الانقلاب على الملك الحسن الثاني والذي حدث في عام ١٩٧١م ليتبدا قصة غريبة من نوعها قاسية في تفاصيلها متعبة نفسيا لقارئها بأحداثها التي تواصلت على مدى ١٨ عاما .. نكتشفها من بطل الرواية وننتقل معه عبر عتمتها ما بين الماضي والحاضر لحياته.. فماذا حصل له بعد كل تلك السنوات؟! وماذا تغير فيه ؟! وكيف؟! كل ذلك اتركه للقارىء لكي يكتشفه من خلال قراءته لهذه القصة.. 📌 أسلوب الكتابة :-...👈🏻 اعتمد الكاتب اسلوب السرد المنفرد في أغلبية الرواية (بين البطل ونفسه) مع قليل من الحوارات التي تحدث معه..👈🏻 حملت القصة توصيف مركز للحالة النفسية للبطل داخل المعتقل والاحداث التي تجري معه وتذبذبه بين الإيمان والشرك..👈🏻 اسلوب الترجمة كان ممتاز وأمين في نقل تفاصيل الاحداث ومشاعر البطل..☀️ القصة قاسية جدا .. وايضاً تحتاج الى صبر اثناء قراءتها .. قد تمل في بداية صفحاتها ولكن ما ان تصل الى حد كبير منها ستجد تلك الحالة من الضجر تتحول لفصول تجاه ما ستصل اليه الاحداث..🖊 التقييم :-..📝 أعطيت الرواية 3.5 /5 ✨ لأ انكر الضجر الذي انتابني في بدايتها وأحسست بثقل متابعتها ولكن معرفة النهاية كانت السبب وراء اكمالها. .📌اشترك بقناتي مع كتاب لتشاهد المزيد من المراجعات للكتب والروايات 😊..#مراجعة_وتقييم#تلك_العتمة_الباهرة#الطاهر_بن_جلون#كتب_مترجمة #اقرا_معنا #محبين_القراءة #اقرا #مكتبتي #قراءات_٢٠١٧ #قناة_مع_كتاب"}, {"userName": "أبو يوسف ", "userReviewDate": "Mar 15, 2012", "userURL": "http://www.goodreads.com/user/show/5760785", "userReview": "ما زاد قرائتي لهذه الرواية تشويقاً هو مشاهدتي لبرنامج قناة الجزيرة الشهير \"شاهد على العصر\" مع أحمد المرزوقي وهو ضابط عسكري مغربي وجد نفسه مع كافة منتسبي مدرسة أهرومو متورطا في محاولة انقلابية كان يقودها قائد المدرسة آنذاك الكولونيل أمحمد أعبابو ضد ملك المغرب الحسن الثاني ، وبعد فشل المحاولة ومقتل كثير من المشاركين فيها حوكم المرزوقي عسكريا مع الناجين من زملائه وحكم عليه بالسجن مدة خمس سنوات ولكنه قضى عشرين عاما، حيث رُحّل بعد عامين مع كثير من زملائه من السجن العسكري إلى معتقل تزمامارت الرهيب ليقضي فيه 18 عاما من العذابات والأهوال والفظائع.أسلوب المرزوقي بليغ وراقي جدا بلغة عربية فصحى ويساعدك على فهم الكثير من التفاصيل والشخصيات في الرواية لأنه عاصر السجين نفسه الذي نقلت عنه رواية العتمة الباهرة في سجت تزمامارت ....http://youtu.be/1-MhOJIZeNY"}, {"userName": "Islam Salem", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/36808434-islam-salem", "userReview": "ايه ده ؟ ... ايه اللي انا قرأته ده؟ ... ده بجد ؟ هو ممكن إنسان يعمل كده في أخوه الإنسان عشان خاطر كرسي زائل ، كرسي لا يسمن و لا يغني من جوع ، ايه كمية الألم و السواد دي ؟ ايه كمية التعذيب دي ؟ واحد يتسجن ظلم و يتعذب هو و أصحابه في غرفة تحت الأرض في سجن تزمامارت الشهير لمدة ١٨ سنة . أتسجن هو و ٢٣ زميل و فضلوا يموتوا من التعذيب و سوء التغذية و الرعاية الصحية لحد ما تبقى ٤ أفراد فقط ، صراحة مش لاقي حاجة أكتبها تعبر عن اللي أنا قرأته ده ، كتاب مؤلم بدرجة غير مسبوقة كتاب يحسسك إن أنت عايش في ماسورة مجاري كبيرة أسمها الشرق الأوسط حيث لا يوجد مسطلح أسمه كرامة الإنسان حيث ينتشر الذل و القمع حيث ينتشر الجهل و التخلف ( المتعمد من الحكام ) من أجل تغييب الشعوب . كتاب لا أنصح بيه لكل إنسان حساس سريع التأثر ، كان الله في عون الشعوب العربية و المسلمة اللي ربنا أبتلاها بحكامها ، قولوا آمين."}, {"userName": "Sarah ~", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/9446828-sarah", "userReview": "لا يمكنني أن أفهم أبدًا كيف يمكن أن يكون البشر بهذه القسوة ..."}, {"userName": "aljouharah altheeyb", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/3405534-aljouharah-altheeyb", "userReview": "أنهيتُ قراءة الرواية اليوم … لا أعرف بماذا يجب أن أقول عنها، جميله ؟ جيده ؟ ألا تبدو صفاتي موغلة في القسوة لمعاناة سُجناء تزمامارت ؟حسناً قاسيه ؟ مؤلمة ومتعبة للأعصاب ؟ .. قرأت روايات تصف عذابات أقل ولم أستطع أن أنهي الصفحة قرفاً أو ضعفاً .. بل بالعكس كانت رغم كل العذابات تسير الكلمات برزانة وهدوء .. من الصعب وصف تُحفة فنيه، في كُل من التحمل والأمل الباهر للظلمة، و في الكلمات الأدبية السهلة الرقراقة لتحمل لنا ألماً طُي في ماضي من عاشروه .. مدتني هذه الرواية بالكثير من الإلهام، بأن عذاباتنا الدنيويه مُجرد إبتلائات وإمتحانات مُقسمة قد يعاني غيرنا الجزء الأصعب فيها، أن البشر ليسوا مجرد كومة تراب مُتعفنة إذا تركوا وحدهم .. أنهم أكبر من ذلك، وأعمق بكثير .. البشر ليسوا مايلبسون أو يأكلون .. إنهم أرواح تعيش دواخلها قبل أن تولد للعلن .. رواية جميله، مُذهلة، تمدك بأسى ماض دون أن تشعرك به حقاً، تخبرك أنه لا بأس، رغم كل تلك العذابات التي بدت أبدية .. لا بأس، رغم كل الآلم الجسدية والأوجاع التي تفشل أنظمتنا العصبية الصغيرة في تحملها .. أنه لا بأس ( فإن الله معنا ) .. لا بأس ( فالله لا يضيع أجر الصابرين ) .. أستحي أن أتشكى بعد أن قرأت هذه الرواية .."}, {"userName": "Odai Al-Saeed", "userReviewDate": "Nov 24, 2008", "userURL": "http://www.goodreads.com/user/show/1741426-odai-al-saeed", "userReview": "ك أن تتخيل كم من الظلم يعانيه شعبنا العربي .لقد نصب حكامنا أنفسهم الهة يعذبون ويحاسبون.كم أحزنتني تلك الرواية الواقعية لرجل قضى حدود العشرون عاما تحت أنقاض العذاب والفجعيعة التي يصبح فيها الموت أقصى أماني الانسان ولا يجده."}, {"userName": "Mariel", "userReviewDate": "May 06, 2012", "userURL": "http://www.goodreads.com/user/show/647547-mariel", "userReview": "The tree stump tells himself that he doesn't miss the height. He doesn't miss the owl that perches on his limb to let him know when it is light. No flowers, no birds or bees and hell no there aren't any roots. There's a wizened face squinting into the camera. The voice isn't used to the accompanying noise of the flowers, birds and bees. It falters in its over growth throat and it starts to say... What's this female voice speaking over it? Is that what the guy on the tv who has been in a cave in a forgotten part of hell all of this time some place in the world that always has news but is rarely breaking news is saying in between heart break and it doesn't have to be that way break your own heart? Political prisoner account via Tahar Ben Jelloun. Long ago news in the early 1990s of secret holes to bury alive for decades past sentence brought to you by lock and throw away the key. Satellite for the tree stumps. Underground radio for the starving roots. Translation into English from the French by Linda Coverdale. Kill a tree for paper that sometimes I wasn't sure it wasn't above magazine human interest some place in the world that's always human interest and never could be enough. I don't know who was who. I'm aware of some controversy surrounding the legitimacy of Jelloun using the real guy, Aziz Binebine, for his novel. I didn't know about this until after I read the book, though. My wonderings now feel like second thoughts.Kill your memory. Hope leads to despair in some anti-Yoda message of survival in the crawl space. Growing hair and nails belie the claims of no past. I don't know if it was Jelloun or the unknown man who claimed to have survived his eighteen years freezing in a grave by the mental will power of not thinking at all. I don't know if it was the Coverdale cover chick. It wasn't true. A man who would tell the story of Bunel's film The Exterminating Angel as if it was real and then apologize to the filmmaker at the end for setting it in his country did not out last the garbage disposal void by putting nothing in it. The dungeon was like the souk on auction day. Everybody was talking to that poor dove as if she were capable of delivering each message. I could hardly reproach my companions when I had been the one who started it all. Now a current madness was flowing through the prison. Frenzy, cacophony, incomprehensible words, absurd images. The dove was no longer a bird but a person come to harvest messages from every side. The next morning, as soon as the door opened, I set her free. She whirled around in fright until a guard caught her and shooed her toward the exit. We missed her. We thought of her with a smile, realizing how truly miserable we were.This prisoner is not a free spirit but contained in a vessel he turned into some kind of prison movie version of Noah's Ark, or whatever some Koran story is that I don't know. I'm not biblical either. I only know these animals philosophically. The rat from Cry Baby and the bird from Birdman of Alcatraz. Follow me to safety... Oh wait, I'm treacherous and the hope led you straight to some motherfucking guard with a hard on for those worse off than he is. The bird flies where you can't and you only fly if you can imagine where it is going. The corpse spread out christ like on the dirt prophesies the rain is coming in his head. I have displayed so many of my anxieties on goodreads that I'm probably becoming (er) like Haverchuck from Freaks and Geeks when he was oblivious to his mocking classmates as he listed off his laundry list of deathly allergies to his cute French teacher. Yeah, I'm claustrophobic. I didn't feel claustrophobic while reading This Blinding Absence of Light. Other books set underground I would feel as if I could not breathe. The entrapment here came from trying to tell who was who. How would you tell the age rings on your tree that's a baby in terms of time and other older than dirt trees but young if you spent all of your time staring at it for it to grow tall enough to see some light? Tie around the tree whatever ribbon they are using these days to mourn the death of love of country and no hope.While I'm on Haverchuck from Freaks and Geeks... There's a scene in one episode that I hold up to be my banner of the most bittersweet lonely happy that I know. Haverchuck ritualistically prepares for himself alone grilled cheese sandwiches to eat while he watches tv. The sound is down and you can't hear whatever it is that Larry Sanders is saying that makes the kid laugh so damned hard and without holding back. The smile and free laughter he has tore at my heart. When I watch the clip again it doesn't make me feel the way it does when I think of it in my memory to be my banner of that kind of waiting until you get home at the end of the day to be that happy by yourself. It's still good but the smile (no disparagement of Haverchuck either. I freaking love that kid).... it could be seen no matter where I was, in my head. That's what I felt about this prisoner's memories. He tries to reclaim every book he ever had with only his brain for access to the priceless library. Storming the castle gates to follow orders in a past that can't get spontaneous no matter how many times you do it again. People saying how dare you dream about me! I didn't give you permission! Kill his father who says \"Yes, master\" to the king and \"Kids? who?\" to them, if he ever talked to them. The jealous fellow inmate who would wake him up from any good dream he ever had. I kinda think that how did he survive is writer bullshit. I think it was the thinking and the painful trying not to think about shit (that I know all too well) that was the thing. Rattling in the hollow and amputated reaching. You know, the exact opposite of what the book sometimes tries to pass off. Not that it was the annoying as fuck shit ('Light' is like the anti-Janusz Bardach) Man is Wolf to Man about hope and blah blah blame the victims who can't be happy all the time that had so sickened me last year. I knew I'd like the book despite my initial misgivings about the translator's kind of magazine style (I don't believe this guy didn't live exactly where he could. Jelloun is also a poet) because he had this acceptance about giving up that someone who couldn't see for the dark and could see for fear of ever being that dark would have. I liked it a lot despite those this is how I did it times. Impotence against the government that did that to them and blinking in the light if it is time to stop thinking about things you can't change. I really like it when people tell you things like they want to know you and not for some agenda. The best thing about 'Light', to my mind, is that it didn't read like some look at me memoirist agenda thing but if you could see some place on the map and get closer and closer and then in the ear and then in the brain and then pace back and forth in there. It makes me sad if Jelloun did exploit Aziz Binebine. I wonder what he would say if he was talking to you himself and had things he wanted to say. Maybe he wouldn't have written humorously about a fellow inmate dying from constipation. Maybe he didn't feel guilty that they prayed for the deaths of the others for the funeral lights in a I know what we did was wrong way but it was the only way we could get sunlight way but in the way if you were always adjusting to the sunlight after being in a dark room for too long way. Well, he wrote a letter to a writer anyway so he wanted to talk about it. That says something about not leaving the alone corner of the mind. I will just sit in the dark with my muttering suspicions!Then again, I was thinking about tree stumps long before The Stranger and living in the tree is brought up. The getting used to what you can see... Somebody reached me.(It's weird that I have been reading books in a row about living this way and totally not on purpose...)"}, {"userName": "Nour  Mohamed", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/65411049-nour-mohamed", "userReview": "يا الله ! مرعبة وراءعة"}, {"userName": "Aya Hassan", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/2192422-aya-hassan", "userReview": "احلى حاجه فى الروايه دى ان الكاتب وعلى عكس كل كتب أدب السجون اللى قريتها مش بيتكلم عن تعذيب جسدى ،كل وصفه كان عن التعذيب المعنوي ومحاولات القتل الميتكره اللى اتعرضولها  بالملل وبالاهمال وباليأس ،مفيش اقسى من ان الانسان يعيش تجربه دفن فى حفره مظلمه لمده عشرين سنه بلا أمل فى نجاه روايه مرعبه نفسيا إقتباسات منها https://www.facebook.com/media/set/?s..."}, {"userName": "Batool", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/3311567-batool", "userReview": "هل تعرف الشعور حين تُنهي كتابًا وأنت مُنهك وحزين ومُتعب .ويُزعجك ضوء النهار ؟هذا ماشعرته بالضبط بعد نهاية الرواية !"}, {"userName": "لونا", "userReviewDate": "Oct 15, 2011", "userURL": "http://www.goodreads.com/user/show/6500234", "userReview": "8/5/2012I'm speechless  ................................تحديث بتاريخ 24\\3\\2012 ... بعد الخروج من الصدمةالعنوان \"تلك العتمة الباهرة\" عنوان غريب فكيف للعتمة أن تكون باهرة؟ ... رواية مقتبسة عن قصة حقيقة \" بِتَصَرُّف\" تحكي رحلة 58 سجين بعد محاولتي الانقلاب الفاشلتين على ملك المغرب الحسن الثاني ...نجح بن جلون في نقل مقدار التعاسة والبؤس الذي عاناه المعتقلون بقلمه الروائي، نقل لنا المعاناة باحترافية كبيرة جداً ... تفاعلت مع الرواية كثيراً، صُدمت، بكيت، اكتئبت وأصابني نوع من الهوس اسمه \"القراءة عن تزمامارت\" واكتشفت بعد عدة قراءات أن بن جلون لطَّف الأحداث واختصرها بعد 18 عاماً من العتمة التي أبهرت عيون المساجين نجا من هذا الجحيم 28 سجين فقط، وأُلقيا بهم في الحياة \"بعفو ملكي\" ... خرج من نجا منهم وبقيت أنا أسيرة تزمامارت"}, {"userName": "ميقات الراجحي", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/2799876", "userReview": "من روائع أدب السجون بها الكثير من الحزن والوجع والألم والظلم الذي لابد وأن تشعر به بين صفحات هذه الرواية. عن سجن تزمامارت في المغرب والمحاولة الفاشلة التي قام بها بعض الضباط للقيام بإنقلاب وإطاحة الحكومة لكنها قد فشلتو والرواية لا تعالج فشل الإنقلاب بقدر معالجة الظلم في الذي وقع في السجن والتعذيب.القراءة الأولى (2008م) : العمل جميل ويأسرك رغم سوداوديته إلا أنك لن تترك الرواية إلا بد أن تنهيها في يوم وربما يومين. دموية الأحداث كانت أكثر عمقًا من أحداث رواية منيف (شرق المتوسط) هكذا كنت اقارن بين العملين عند قراءتي لهما – وهذا مما لن أفعله مرة أخرى لإيماني بوحدة كل نص – كانت التفاصيل وما يعانيه السجناء شيءٌ قاسٍ ووجدته تجاوز حتى فعل الحيوان ولكن هذه الطاعة العمياء للحاكم.تشعرك الرواية بالكثير من الخوف حتي من المرور من أقسام الشرطة ومن الخوض في نقد سياسات دولتك. تشعرك بمدى صغر حجمك أمام السلطة. تسلبك الكثير من الطمأنينة. عندما أنهيتها شعرت بالسعادة أنني أنهيت هذا الكابوس وعرفت أن في داخلي إنسان مايزال يمتلك مشاعر لابأس بها.++++القراءة الثانية (2016) : لتلك العتمة الباهرة وهي العمل الوحيد لـ(الطاهر بنجلّون) الذي أعيد قراءته وليس تقليلًا في أعماله الأخرى ولا تمجيدًا في هذا العمل لكنه أدب السجون هو من يستهويني أكثر برواياته وسيره الذاتية لمن أتيح له فرصة الخروج والكتابة عنه.مابين القراءة الأولى والثاني (8) سنوات مازلت أرى العمل جميل. لكنني لن أفاضل بينه وبين (شرق المتوسط) رغم أنني عدلت وأتضح لي ميلي لعمل منيف. بدأت أشعر في القراءة الجديدة أن الأحداث التي يتناول (الطاهر) قليلة جدًا، ولهذا كان يطيل في الوصف ويخرج من فضاء – الحفر – السجن إلى الحديث عن والدته وعن البيئة الصوفية التي عاشها في طفولته معها عندما كان يزور الصوفيون السبعة، وكذلك شعرت في القراءة الثانية – دون النظر أنني قرأت العمل من قبل – أن من يقرأ العمل قد يستنتج بعض الأحداث وكأنه على دراية بما سيحدث لتشابه الكثير من تفاصيل الأحداث خصوصًا كيف يزور الموت السجناء واحدًا تلو الآخر، والتطور الطبيعي لردات فعله والدته تجاه والده، وقد يتوقع القارئ ماذا ستكون ردة فعل (الملك) على والد السجين وغيرها من الأحداث.ترجمة (المركز الثقافي العربي) قوية جدًا ومترجمها صاحب لغة من طراز فريد رغم إدراجه لكلمات غرقة في القدم وتحتاج قاموس عند البعض للبحث عن معناها حتي على الأقل يستقيم فهم الجملة مثل : ( نظراتٍ أَسِغَةٍ / نقاط اعتلام / أزقمه / أُلطِّفَ جُلجلتي.... الخ) وليس اللغة القوية عيبًا لكن إستخدام المهجور من الكلمات في الزمن الحالي يعاب حتى على الشعراء – يُنفّر القارئ – وهي كلمات قليلة ربما وجد المترجم فيها الترجمة الأكثر قربًا للنص الفرنسي.فوق كل ذلك مايزال العمل حتى بعد القراءة الثانية التي تجعلني أستكشف النص أكثر من قبل هو عمل سيبقى من أبرز ((الروايات المترجمة)) التي تتحدث عن السجونو وهو نص رائع حصل على تعاطفنا ليس لتكنيك الرواية ولا لتقنيات السرد فهو عادي جدًا في هذه المسألة ولكن لموضوعها الإنساني.++++كنت قد وجدت التقييم (5 *) قي القراءة الأولى وفي الثانية أعتمد كتقييم نهائي (4 * ) رغم إيماني بأن الحديث أو الكتاب أفضل من تعداد الأنجم الذي أراه قاسيًا أحيانًا.. هذا فقط.هذا الفديو شاهدت من خلاله بعض الأحداث المباشرة من أرض الواقع في ذلك الزمن ربما تشاهدون هنا بعض نزلاء الحفرة https://www.youtube.com/watch?v=x6Lu_..."}], "description": "An immediate and critically acclaimed bestseller in France, This Blinding Absence of Light is the latest work by internationally renowned author Tahar Ben Jelloun, the first North African winner of the Prix Goncourt and winner of the Prix Mahgreb. Crafting real life events into narrative fiction, Ben Jelloun reveals the horrific story of the desert concentration camps in which King Hassan II of Morocco held his political enemies in underground cells with no light and only enough food and water to keep them lingering on the edge of death. Working closely with one of the survivors, Ben Jelloun narrates the story in the simplest of language and delivers a shocking novel that explores both the limitlessness of inhumanity and the impossible endurance of the human will.", "title": "This Blinding Absence of Light", "url": "http://www.goodreads.com/book/show/175147.This_Blinding_Absence_of_Light", "average": 4.27, "cover": "https://images.gr-assets.com/books/1309287508l/175147.jpg", "reviews": 1724, "authors": [{"url": "https://www.goodreads.com/author/show/5716305.Tahar_Ben_Jelloun", "name": "Tahar Ben Jelloun"}, {"url": "https://www.goodreads.com/author/show/648360.Linda_Coverdale", "name": "Linda Coverdale"}], "type": ["Novels", "Northern Africa", "Fiction", "Cultural", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/175147.This_Blinding_Absence_of_Light", "http://www.goodreads.com/book/show/3127736", "http://www.goodreads.com/book/show/25972160", "http://www.goodreads.com/book/show/7375409", "http://www.goodreads.com/book/show/175176.The_Sand_Child", "http://www.goodreads.com/book/show/387147.Le_racisme_expliqu_ma_fille", "http://www.goodreads.com/book/show/5975578", "http://www.goodreads.com/book/show/568156.L_enfant_de_sable_La_nuit_sacr_e"]}