{"ratings": 17600, "userreviews": [{"userName": "Ruzz", "userReviewDate": "Aug 15, 2008", "userURL": "http://www.goodreads.com/user/show/916030-ruzz", "userReview": "I found Three Day Road when a notoriously late friend was more than an hour late to meet me and I had time to browse a local bookstore. I didn't pick the book up that day, but i noted it. Later, while near the bookstore I went back in and grabbed it. The idea of the book crossed a number of vectors of interest for me. War history (wait, don't stop reading yet), snipers (please, keep reading), and early 20th century Natives. I expected it to at least titillate my love of snipers, and war and the romantic ideal of Canada's native people. What happened in fact is I was reminded that the medium of the novel is meant for many things, but of all those things, first is and always will be story-telling. There are always messages, and lessons, and commentary in all human thought, and likely all stories. But its so easy to become consumed by the desire to share an ideal, an idea, a view of the world--we lose sight of the greater need.That greater need is to be captivated, carried, led into another world entirely. To be entertained and touched. To be free of our reality and it's annoyances, stresses and even sometimes joys. And, in very rare cases, we need to find a safe place to feel more fully than the concrete world might permit. And it is through great story-telling we are reminded how we can love characters in books. Be stirred and impassioned by simple words. be felt fully human-confusingly-through our emotional range and capacity to feel. This book while not the benchmark upon which to measure storytelling, was still strong enough to remind me of this need. It's the first book I can recall in some time where I could turn off my analytical mind and just go with the characters. perhaps the last was A Fine Balance. Even if you care nothing for war history, snipers, or native idealism you should read this book for its great characters and ability to bring you somewhere else for 400 pages."}, {"userName": "Matthew Quann", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/22699228-matthew-quann", "userReview": "A novel that begins at the end, and ends with a beginning. Three Day Road is a stunning debut from one of Canada’s foremost writers, Joseph Boyden. When Xavier Bird returns from WWI addicted to morphine and wounded, his aunt Niska embarks with him on a three-day journey towards their home in the Northern Ontario bush. As Niska paddles along towards their home, the reader slides seamlessly between Xavier’s remembrances of his time at war and Niska’s account of Xavier as a boy. Central to the novel is the uncertain fate of Xavier’s childhood friend and fellow soldier, Elijah Whiskeyjack. As Xavier and Niska make their way closer to their home, so too does a stunning revelation about Elijah and Xavier’s acts creep closer.\tFrom its opening chapter, Three Day Road sets itself up as a book that would put me through the wringer. The novel’s descriptive passages are evocative and powerful. As Elijah and Xavier traipse through the mud, muck, and murder of various WWI killing-fields, I could vividly imagine their struggles and the horrific scope of the world in which they were forced to survive. This is sharply contrasted with the expressive and majestic way in which Boyden paints the wild of Northern Ontario. As alluded to earlier, scenes in which Xavier shoots morphine in the canoe allow for him to slip seamlessly back to the past. The experience was much the same for me as there are never any hiccups as the novel shifts between alternate stories. \tThe book also resonates with authenticity: the aboriginal themes, thoughts, and practices ring true and never feel forced. Indeed, the three Cree leads are strong, fully developed and interesting characters whose cultural experiences deeply influence their world-view. Elijah and Xavier both fall victim to the torrid world of residential schools, and are enticed up by the promise of glory and adventure that the war will provide. As Niska details her own life, we also see how government has smothered her culture as she clings on to her way of life. Cree mythology also plays a central part in the structure of the novel and the Bird family legacy returns time and again to drive home a powerful theme. \tThere is so much contained in this novel that it is impossible to do it justice in a 500-word review. The story swept me away, and though it does read slowly, it never felt as if I was putting in work to finish. Xavier’s childhood innocence, his devolution in Europe, and his attempted rehabilitation by his aunt are all told in tandem to make for a staggeringly ambitious first novel. The writing is rich and illustrative, the story neatly tucked into place at its conclusion, and the characters are all compelling. Though a challenging read in content, writing, and emotion, Three Day Road is essential reading for those in Canada and beyond."}, {"userName": "Warwick", "userReviewDate": "Apr 15, 2015", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "This seemed like a serendipitous discovery when I stumbled on it in an Ontario bookshop last week. Not literally stumbled – although, come to think of it, there were several piles of books on the floor there which gave browsing something of a parkour flavour. But I had negotiated those hazards successfully. No, I meant stumbled on in the metaphorical sense that I found it by chance. Anyway, can we move on? I have a review to write.So yes, I hadn't heard of Boyden before, but clearly he's something of a literary darling north of the 49th parallel (in Canada – less sure about Kazakhstan) and this novel, his first, begins with what seems to be an entire chapter's worth of adulatory press cuttings to whet your appetite for what follows. Apparently every critic and literary prize in Canada welcomed this one with open arms and legs. By the time you have crawled out of Roman numerals and made it to the start of the story at page 1, you have been primed to be disappointed by anything less than a new Ulysses written on the Stone Tablets of Sinai, with jokes by the ghost of Lenny Bruce.It is easy to see why critics got excited about it. This story of two Cree boys from northern Ontario who become snipers in the First World War shines a light on an aspect of 1914–18 that most readers will know little about, and it does so in the uncomplicated, present-tense, flashback-heavy style that is so wildly popular these days.Sure enough, there was a lot here I responded to and that filled a gap untouched by my other First World War reading. It is inspired in part by the real-life Ojibwe sniper Francis Pegahmagabow, the most lethal sniper of the war and one of Canada's most decorated (who, as ‘Peggy’, hovers just off-stage at several points in the novel). But the scenes of chaos and misery from the Western Front are never allowed to take over, and they are always interspersed with chapters describing Elijah and Xavier's Cree childhood and family, juxtapositions that offer the reader a range of unusual and productive comparisons that can be made at his or her leisure. This cross-cutting between industrialised slaughter in Europe and the very different ritualised violence of ‘native’ communities reminded me of what Pat Barker attempted with Melanesian islanders in The Ghost Road, though here the conceit is built much more fundamentally into the book's structure.This is one of those books that goes for full-on immersive storytelling: it is all about spending plenty of time with these characters, seeing the trenches and the carnage of Ypres and Passchendaele through their eyes, learning, through Xavier's medicine-woman aunt, about how the boys ended up in this place so far away from home.Perhaps the overriding motif is the windigo, that figure of Algonquian mythology associated with cannibalism and insanity. Just as First Nations communities sometimes suffered outbreaks of internal violence that saw people turning in desperation to eating human flesh, so too (we are encouraged to consider) have developed nations in 1914 begun to cannibalise their own population through what seems to be nothing other than collective madness.I realized then that sadness was at the heart of the windigo, a sadness so pure that it shrivelled the human heart and let something else grow in its place. To know that you have desecrated the ones you love, that you have done something so damning out of a greed for life that you have been exiled from your people forever is a hard meal to swallow, much harder to swallow than that first bite of human flesh.Much as I enjoyed the story and the general idea, I must admit there was something about the prose style that stopped me from ever loving this book the way I'm sure many others will love it. The prose isn't bad – it just doesn't display much intelligence or wit; there's a kind of flat, undemonstrative quality to it that, perhaps, is appropriate given its narrators but that left me slightly cold. I couldn't shake off a vague sense of Creative Writing courses, reinforced not only by the present-tense narration but by the alternating narrators in different chapters, and the metaphors that tried, I thought, a little too hard to show off their cultural background (‘His skin is the colour of cedar ash in the setting sun’). There is also a certain amount of ‘magic Indian’ stuff going on – a face-value acceptance of some of the Cree mythology and ritual – that sits very uneasily with me.Still, this is a book I'd recommend. If you want to know more about Canada's involvement in the war, and First Nations participation in particular, it's a brilliant introduction – and you'd have to be a hard-hearted reader indeed to resist the melodrama of violence and insanity that Boyden skilfully builds up for his climax."}, {"userName": "Whitney Atkinson", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "edit: it’s been about a month since i’ve read this and i’m increasing my rating to 5 stars. the plot of this book and the main character’s thoughts have just stuck with me so much, and after finishing an 8 page paper about this book it just made me fully comprehend how genius it all flows together. highly recommend.4.5 Stars.My war literature professor is just out here trying to make me cry, huh? This book was beautiful. It's gruesome and explicit, and at times highly uncomfortable, but it's not just a book about raw killing with no message. The main character has such a fleshed out backstory and inner conflict and I was rooting for him throughout the entire book and just had so much empathy for him even though we're two completely different ethnicities and I've never had to be in a war. I'm usually not a fan of a book being told through flashbacks, but this integrated it nicely and kept me interested enough in knowing what was going on in the past so that they end up where they are. It's a tragic book, but I totally guessed the ending. The reason I took off half a star is because I think I wanted more finality in the ending, and there's still a few things I have questions about that went under-explained. Also, there were so many different flashbacks that sometimes the locations and experiences got muddled since all the trenches were very similar. Also, almost every character in this that I liked died, so it's fINE."}, {"userName": "Malcolm", "userReviewDate": "Feb 11, 2008", "userURL": "http://www.goodreads.com/user/show/783966-malcolm", "userReview": "Book Review: Three Day Road Joseph Boyden Viking Canada Penguin 2005 ISBN 0-670-06362-2\tOnce in a long while one reads a book that you cannot put down and the overall beauty of it leaves one gasping. Three Day Road, is such a book. It tells the story of Two Cree young men who find themselves in WW I fighting in the trenches of France as snipers using their hunting and shooting skills they learned in the bush growing up near James Bay.\tThe story begins with the protagonist, Xavier Bird, has returned from the war minus his leg and addicted to morphine. Aunt Niska, Xavier’s only living relative has paddled five days against the river current to bring him home. Niska is a Cree woman who has lived in traditional ways alone in the bush much of her life except for a brief stay in a residential school as a child. The story takes place during their three day return to James Bay. Flashbacks to the battlefields of France, vividly told, and to each of their childhoods occur during times when Xavier is asleep, or drugged by the morphine that controls the phantom pain in his leg. We learn Xavier is on borrowed time as his morphine cache is nearly gone. The title Three Day Road has a truly layered meaning in the story.\tWe learn a lot about the traditional native way of life as well as the isolation natives must endure in the world of the wemistikoshiw (the Cree word for white man). We gain a certain insight into a residential school where Cree children are taken from their homes and fat Nuns abuse little boys and punish them severely if they speak in native tongues. \tThe historically accurate description of life in the trenches in France is excellent – on par with the likes of Pierre Berton’s Vimy.\tBoyden’s descriptive and narrative skill is terrific and a lot is included in the books 350 pages. The book is a Writers Trust Award winner and one can easily see why. I give it five stars (but would give six if I could) Malcolm Watts BA MSW Novelist Reflections from Shadow www.authorsden.com/malcolmwatts"}, {"userName": "Howard", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/32041201-howard", "userReview": "The gold standard for novels about combat in World War I has always been All Quiet on the Western Front by Erich Maria Remarque, first published in 1929. I first read it many years ago and have since re-read it a couple of times.There are a number of fabulous goodreads reviews of this classic novel, reviews by Ted, Kemper, Larry Bassett, and Diane Barnes. If you haven't read the book, you should read these reviews and then you may want to. But I also wish to express my gratitude to several goodreads friends, who, through their outstanding reviews, led me to two WWI novels of which I was not aware.Fear: A Novel of World War I by Gabriel Chevalier was originally published in 1930. It was the fascinating reviews of Mike and Sue that led me to a book that I was not aware of, but should have been. It deserves to have the kind of recognition and praise that is accorded All Quiet on the Western Front. It is that good.And so is Three Day Road by Joseph Boyden, published in 2005. Thanks to the great (I'm running out of superlatives) reviews of this book by Michael and Tony. I might not have found it otherwise.The interesting thing for me about the three books is that the authors are writing from three perspectives in that the first is German, the second is French, and the third is Canadian. And yet, the stories they tell about young men from three different nations fighting in the trenches in France are almost interchangeable.The leadership, civilian and military, might have differed in the three countries, but the soldiers who did the fighting were much more alike than they differed.There is a moral there."}, {"userName": "Bonnie", "userReviewDate": "Aug 14, 2008", "userURL": "http://www.goodreads.com/user/show/1424859-bonnie", "userReview": "5 starsI'm not sure I've read any other books inspired by the First World War, but I am sure Joseph's story is different than anything else ever written. Agreed, I was slow to get TO it (heard him read first chapter in Whistler 2007), and to really get into it, but oh -- when I did, I couldn't turn the pages fast enough!I read this, for the most part, on the beach while vacationing in Mexico. I couldn't help but react out loud: his battle scenes, e.g., are so vivid, chilling. But saying that simplifies what is really a gripping, epic tale; storytelling at its best.It won the 2005 McNally Robinson Aboriginal Book of the Year; was shortlisted for the Governor General's Literary Award, and went on to become a #1 National Bestseller.I don't want to spoil the story, so I will simply say:\"highly recommended\". But, if you plan to read Through Black Spruce (Winner of the ScotiaGiller Prize), hold off, and read this book first. \"You'll be glad you did.\" :)"}, {"userName": "Maxwell", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "I'm a huge fan of Boyden's work. I was really impressed by  The Orenda and  Through Black Spruce, and loved his stories in  Born with a Tooth. When I finally got around to his debut novel, I think it proved to be a bit underwhelming.Stylistically, Boyden is as strong as ever in this one; his writing is sharp, observant, and transportive. The ways in which he weaves together both Niska and Xavier's stories is excellent. And the tension that builds throughout between Elijah and Xavier is palpable. I thought all the elements where there for a fantastic story, but it just didn't quite reach its full potential. Maybe it's one of those 'it's not you, it's me' stories? Admittedly I'm not the biggest fan of WWI narratives. I thought many of the battle sequences and depictions of the European frontlines were redundant and did little to move the story forward. I was most fascinated hearing about Xavier's childhood and Niska's recollection of the boys' friendship.Nonetheless, I love Boyden's ability to write from multiple perspectives—as he does in most of his books—and create vivid settings. If only it hadn't dragged so much in the middle this would've been a better book for me."}, {"userName": "Connie", "userReviewDate": "Dec 29, 2012", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "Xavier Bird struggles on crutches as he descends from the train in northern Canada in 1919. He is in terrible pain and addicted to morphine since a war injury resulted in the amputation of his leg. The relentless horror in the trenches of the Western Front have also taken their toll emotionally. His aunt Niska, an Oji-Cree medicine woman, takes Kavier home in a three day journey in her canoe.The Canadian government had a forced residential education program, attempting to eradicate the First Nation's culture, but Niska had escaped into the bush as a teenager. She later rescued her nephew Xavier, and his friend Elijah from the harsh environment of the school. They were taught the skills of tracking and hunting game, and both became skilled marksmen. The two young men volunteered for service in the Canadian Army, mostly because Elijah had a taste for adventure. Their skill with rifles is soon recognized, and they become an expert sniper and scout team. The taking of lives has a different cumulative effect on each of the two friends. While one becomes repelled by the bloodshed, the other turns into an obsessive killer.The First Nation has a long tradition of storytelling. As Niska paddles her canoe, she tells Xavier stories from her youth to distract him from his pain. In flashbacks, Xavier relives the years on the Western Front in morphine-induced memories. Xavier's supply of morphine is running low. Will Niska be able to heal her troubled, broken nephew?The Canadian Second Division fought bravely in Flanders, the Nord-Pas-de-Calais, and the Somme. Joseph Boyden has melded history, First Nation culture, and good storytelling to create an absorbing tale. The author's family background is part Ojibwa, and includes military men. Boyden's World War I story pulled me down into the trenches, and into the sniper's nest. I'm looking forward to the next two books in the trilogy."}, {"userName": "VictoriaNickers", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/18761799-victorianickers", "userReview": "This is a phenomenal and haunting book. Loved the story despite most of it being set in the WWI. Maybe because it not the traditional stories told of WWI. The characters are deep and complex. So powerfully written that it makes you stop and wonder what hell is going on with society. It's like a stab to the heart. It will make you very uncomfortable. The story follows Xavier Bird, a young First Nations Canadian, journey through leaving the bush, enlisting in and serving as a sniper in WWI, then through his the healing process of not only his body but his mind and spirit by returning to his home in the bush. It also of his aunt, Niska, who as been able to evade the assimilation into residential schools and the destruction of her traditional knowledge and spared the young Xavier Bird from the same.It's very Canadiana. Joseph Boyden has an amazing ability of being able to share stories of Native First Nation Canadians experiences in a honest and true form. The school children of North America, and particularly of Canada, should be reading this in their English classes."}, {"userName": "Jennifer (aka EM)", "userReviewDate": "Nov 18, 2011", "userURL": "http://www.goodreads.com/user/show/1393336-jennifer-aka-em", "userReview": "This is two of my favourite reads: a \"futility-of-war\" novel by a Native Canadian writer, and with a unique Native Canadian angle.Xavier and Elijah are Ojibwe-Cree from \"the North Country\" (which in this case means James Bay area) who sign up for WW I, and - because of their hunting prowess - make for excellent warriors. Niska - X's auntie - welcomes a deeply changed X home, and does what she can to help X cope with all he has seen, suffered and lost.The novel is about killing and healing and incredible, profound, spirit-driven love. Of the boys for each other; of Niska for her would-be sons, and for X in particular. Love and bonds that are forged in one kind of trauma and tested in another kind of hell. Of a way of life that is lost to all kinds of wemistikishiw slaughter and madness; of transition between one way of life and another, physical, cultural, spiritual.Though I am not a masochist, both types of novels - the war novel, the Native Canadian novel - cause great pain and therefore they often feel cathartic, cleansing in some way. But more: like an atonement for my privileged whiteness and the luck of the draw time and place-wise. This idea of privilege - and how it factors into reading choices - is an interesting one to me these days (as I look at my bookshelves stacked to the brim with female authors; goodreads having made me more acutely aware of gender aspects of writing and reading). Boyden, with his sensitivity; his writing that contains such depth of raw emotion; his male-femaleness/female-maleness (as Woolf would say) - has pride of place next to Erdrich, Thomas King and Richard Wagamese; and novels like Marlantes' Matterhorn, Vonnegut's Slaughterhouse Five, Findley's The Wars and Wright's Meditations In Green."}, {"userName": "Michael", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "I love Erdrich's blurb for the book: \"a devastatingly truthful work of fiction, and a masterful account of hell and healing. This is a grave, grand, and passionate book.\" This is the story of a three-day canoe journey home for Cree Indian Xavier Bird, who arrives by train in northern Ontario severely damaged from his experience as an infantry soldier in World War 1. He has lost a leg and is addicted to morphine. He is accompanied by his only family member, his aunt Niska, a medicine woman who raised him in remote bush after liberating him at age 5 from a residential school. A pervasive mystery for Niska is the fate of Xavier's friend and effective brother Elijah, whom she helped raise from an older age and went off to war with Xavier. The narrative skillfully alternates between Xavier's upbringing and his experience in war with Elijah, where they became snipers in the trench warfare in France and Belgium. The account of the common foot soldier's perspective on the fighting is to me on a par with \"All Quiet on the Western Front\". At the same time, the novel provides a timeless fresh vision of alienation associated the human failure of 20th century civilization through the lens of Native American culture. The transformation of his friend Elijah into an amoral killing machine epitomizes the corruption, insanity, and evils of the whole enterprise, which represents a big challenge for Niska to help Xavier recover from."}, {"userName": "Chrissie", "userReviewDate": "Apr 20, 2009", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "[ The Cree matatosowin ritual is not a solution I can wrap my head around. It is too simplistic! (hide spoiler)]"}, {"userName": "Aubrey", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "7/16/17 edit: after Boyden's revelation of his extremely shaky claim to indigenous roots, take this review with a bag of salt. ---I've spent increasing amounts of time wondering what the ratio of literature to propaganda masquerading as such is in regards to the stacks upon my shelves. Books in the vein of The Guest and Almanac of the Dead and Novel Without a Name make such considerations necessary, and the anything goes approach the reading community largely plays with dehumanized portrayals makes cutting out the questionable middleperson all the easier. Sure, it's harder to find that all too common Other written by their own flesh and blood, but I've been at it so long that reading without that ball and chain of paranoia has become the relief I first aspired to. Sure, all this is going to make my eventual professorial career in English that much more aggravating, but at least I can live with myself a little more.By now, I'd hope there were a plethora of books out there breaking the back of glorification of war. Not enough, judging by the mindless \"Support the troops!\" advertisement in my military industrial complex of a country, but every so often there's a work like this that does double, triple, however many arms of the imperialistic octopus duty. Here's this country called Canada that starves and beats and childhood traumatizes its indigenous populations (one of these so called residential schools had an electric chair for the kiddies), and off some of them go to war. If that weren't enough, intertwined with it is the staggered story of a woman of strength, culture, and the morality born of deprivation that is one of the strongest shapers of difference between the creeds and ethical codes of myriad communities. The results are harsh the world over, and one must take a good look at the human sacrifice one is accustomed to in their own plain of things before even considering analyzing those of others. In this, judging the relative merits by who is currently sitting pretty would be a poor choice indeed.I'm sure someone's tried to slap the \"magical realism\" label on this once or twice due to the beliefs the narrative accredits via constant and rewarded usage. What limits this in the initial stages is how comprehensive the descriptions are in describing bodily woes that most works, even the war ones, pass on by as either negligible troubles or glossed over truths. As for the non-Christian beliefs, my atheist sensibilities have politely glided through enough theological references and plot devices that those not doing the same with this work come off more as rude than anything else. The Islamophobic fuckwads calling themselves New Atheists are bad enough.In short, this book is brutal, brutal, brutal. Read it if you want a real sense of what makes the world go round.\n\"I hunt for sustenance,\" I say.\"And so do I,\" Elijah answers."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "I'm so glad I discovered Joseph Boyden. He is one of the most gifted writers working today. THREE DAY ROAD is one of the top 10 books that I've ever read. Boyden just blew me away with his prose and characters. I am still in awe of this novel."}, {"userName": "Nogol", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/55357702-nogol", "userReview": "آرامش و یکنواختی تپش رنگ های این شفق شبیه ضربان محکم قلب پدرم است. او در تمام طول زندگی در کنارم بوده و هرگز مرا رها نکرده است. سال ها طول کشیده تا این موضوع را بفهمم. او در آسمان شب است.* این حقیقت که تنها مشکلم با کتاب، علائم سجاوندیشه نشونه ی خوبیه ولی مشکل‌ اعصاب خرد کنی بود :/ *واقعی و زنده بودن تصاویر تکون دهنده است. آدم گاهی خشکش میزنه توی توصیفات. ازون کتاباییه که توصیفاتش از صحنه های جنگ و غیره، کمک شایانی به ناخودآگاهت واسه کارگردانی شفاف ترین و واضح ترین کابوس هات میکنه. از این بهترم میشه؟ کابوسم میبینی اقلا با کیفیت باشه :) درهم آمیختن زندگی و آیین سرخپوستی با جنگ و شباهت ها در عین تضادهای شدیدش‌فوق العاده است. من همیشه عاشق سرخپوست ها بودم"}, {"userName": "Rosana", "userReviewDate": "Jan 06, 2008", "userURL": "http://www.goodreads.com/user/show/748860-rosana", "userReview": "I love this book. It is definitely in the pack of books I would carry with me from a burning building. I read it 2 years ago or so, and recently browsed through it again for a book club discussion. I feel surprised with myself that a book with so many graphic descriptions of battles and death does not however make me put it on the list of books never to reread. For all the sadness and destruction it describes, still it does not leave me downhearted. I guess I see the characters' struggles as an illustration of the strength of the human spirit, and specifically the strength of the aboriginal community. There are so many layers in this book - aboriginal integration - or not - and its sad consequences; friendship; war; madness - and each one is handled by the author with extreme skill. The language is beautiful, the characters well developed, the research into WWII remarkable. I look forward to reading more books by Boyden and cannot recommend this book enough."}, {"userName": "Doug", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/14987742-doug", "userReview": "\"I'm gonna lay down my sword and shieldDown by the riversideI ain't gonna study war no more\"Three Day Road is presented as the intertwined narratives of two Cree Indians: Xavier Bird (a soldier returning from the battlefields of WWI) and his aunt Niska (a fierce Medicine Woman). Dipping in and out between the past and the present as they paddle homeward in a canoe, their sad stories have a floating quality that matches the river environment and the healing properties of water. Boyden's writing is strong and I probably would have rated this higher had I not read The Orenda first, but I think the subject matter is even more interesting in that later novel.3.5 stars"}, {"userName": "Friederike Knabe", "userReviewDate": "Nov 24, 2008", "userURL": "http://www.goodreads.com/user/show/1746401-friederike-knabe", "userReview": "Linking Cree hunting stories with World War I frontline accounts would seem an odd undertaking, to say the least. The wild Canadian North with its harsh yet beautiful landscape and tough living conditions for those surviving off the land is a far cry - physically and spiritually - from the trenches and the killing fields of Ypres and the Somme. Yet, Boyden has successfully merged these seemingly disparate themes through his telling of the life stories of the three protagonists: Xavier, Elijah and Niska. The two young friends, looking for adventure, joined the war effort while Niska carries on her life as the last Oji-Cree medicine woman. The story is told from different perspectives, moving backwards and forwards in time. The outcome is an engrossing narrative that interweaves the disturbing description of WWI horrors in the trenches with the rich and multifaceted recollections of the protagonists' lives and their emotions and experiences of the past.\"Taking the Three Day Road\", the traditional Cree reference to dying, takes on new meaning here, both literally and spiritually. The journey home in Niska's canoe through the lush forests and on the winding river provides the backdrop to her efforts to bring one of the friends home, physically and mentally deeply wounded. Her personal recollections and stories of their past lives are set against the nightmarish dreaming of the returning soldier. Will Niska be able to soothe the mind, will the medicine be strong enough to heal him from the agony of war?The two young Cree started out with eagerness to fight in the war, having honed their tracking and shooting skills in the bush killing animals for food and ceremony. Their very different characters emerge clearly as they leave the familiar territory. As they began their journey, their friendship helped them to complement each others strength to get through numerous challenges, such as the language barrier, their inexperience in urban and barrack life, the discrimination facing them. As their talent as trackers and snipers are increasingly recognized by their superiors, despite their prejudice against Indians, the two are sent on increasingly daring missions. Their reputation grows as they take out more enemy snipers than anybody else. Xavier and Elijah respond very differently to the pressure and violence. One hates his role on the killing fields and is retreating into himself, the other is thriving on the experience and the attention he garners. Their friendship is seriously tested and the tension between them reaches breaking point. How can they salvage the friendship that they had? How can they survive in the hell of the trenches? How do they cope with loosing their comrades and being wounded themselves? Will they be able to reconcile the upbringing on the land, guided by Niska, with the brutality of their war experiences?Boyden is an outstanding story teller and his skill of creating realistic and lively personalities is admirable. This not only applies to the three protagonists, but also to several of their comrades and their superiors. Boyden establishes a wide-ranging portrait of the people and the extreme conditions they were exposed to during this war. It is evident that that author undertook extensive research into the intricate details of WWI war fare. It can easily stand among the best of its kind. The author adds additional depth through Niska's story, connecting the reader intimately to Cree culture and mythology. Niska's voice stays with you for a long time. Despite the topic, this is a beautifully written, memorable book.I read this book in 2006, but never posted a review on GR. So here it is."}, {"userName": "Toni", "userReviewDate": "Nov 28, 2011", "userURL": "http://www.goodreads.com/user/show/1521940-toni", "userReview": "I learned much from this book. I learned about trench warfare, the primary method of fighting in World War One. I learned about the Native American bush Indians of Canada and the hardships and racism that they survived. I learned that the white americans admired their hunting and tracking skills and transformed these individuals from hunters of animals into hunters of men during the war and the toll on their spirit that this transformation wrought.I learned that every war through history has created a new drug addiction for its survivors.How unfortunate that we never seem to learn. I learned that there was nothing GREAT about the Great War. After reading about the Great War and its atrocities, how did we ever permit the Second World War to occur and only 20 years later. This is a brutal and heartrending account and not for the faint-hearted yet there are glimpses of man's humanity.How do you survive a war,the necessity of killing, the sights and sounds ,the inequalities, etc etc and retain your humanity and retain your spirituality ? Did Xavier? Did Elijah?"}, {"userName": "Catherine", "userReviewDate": "Apr 03, 2009", "userURL": "http://www.goodreads.com/user/show/1392534-catherine", "userReview": "This is an exceptional book, although harrowing - I'm not sure I could say I enjoyed it; my feeling is closer to respect, and admiration, for what the author achieved.Three Day Road is the story of two young Cree men who volunteer for service in WWI. Only one returns - Xavier - and the novel follows his progress as he travels back downriver, with his aunt, to his home. He's broken, physically and mentally, by the war, is addicted to morphine, and as he slips back into the past and relates the story of his war, we also learn of his aunt's history - she tells her stories to keep him rooted in the Cree world, so that he can make it back from the dark places he visited in Europe.What's exceptional about this book - above and beyond the writing - is WWI seen through the eyes of a Cree man. Proportionally, more Native men signed up for service in WWI than any other racial or ethnic group, yet their very different perspective on what was going on is rarely explored in novels or non-fiction works. Here, Xavier pulls us into a radically different understanding of the war - a place where his skills, obtained on the hunt, are in high demand, but his identity as Indian is derided; a place where his friend perhaps becomes windigo under the pressure of war; a place where it seems that the western God must be a warrior, not a man in league with forgiveness, for why else would soldiers call out his name as they rush to kill others? There's a wonderful opposition set up through his experiences and his aunt's memories. While the Canadian authorities believe the Cree who - like his aunt and her mother - choose to live in the bush are violent, uncivilized, savage creatures, they're the ones to whom those words apply in war.Disturbing and haunting, this is a great book. But I'd recommend reading it daylight, if you read it at all."}, {"userName": "Julie Christine", "userReviewDate": "Oct 28, 2010", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "Xavier Bird, a young Ojibwa from the Moose Cree tribe in northern Ontario, returns to Canada from the Europe's Western Front in the summer of 1919. He is alone, in unimaginable pain from an amputated leg, addicted to morphine, and dying from a spirit broken by the nightmare of war. Carrying him home in her dugout canoe is his aunt Niska, an elderly medicine woman who has lived on her own in the bush since escaping a Catholic boarding school in her teens. Through a twisting, dreamlike journey of words and images we follow Xavier and Niska on a three-day river trail home. The journey takes us through the years of these characters' lives. To distract Xavier from his pain and to quell her own anxiety over his addiction and the emotional wounds that she cannot heal, Niska recounts her childhood as European settlers closed in on her tribe's ancestral territories. She reveals how she survived and thrived on her own, fell in love with a French trapper, learned to use her healing and divining powers, and how she saved Xavier from subjugation at the hands, whips and rum of the white settlers. Xavier crossed the Atlantic as a Canadian Army private with his best friend, Elijah Weesageechak (\"Whiskeyjack\" to non-Cree speakers). Elijah had spent his early years at a Catholic boarding school and is fluent in English, but ignorant of his tribe's hunting, tracking and survival skills. He is reclaimed by the Cree forest and comes of age with Niska and Xavier. Xavier is a patient teacher and Elijah a crack student. By the time the young men arrive in Europe, their marksmanship skills are renowned. They are selected to train with an elite group of snipers. Xavier is soon overshadowed by Elijah's charisma and ego but the two remain a team during their nearly two years on the battlefields of France and Belgium. Why Xavier returns to his homeland alone becomes the thread of tension that reverberates keenly to the final pages. This is a beautifully written yet brutal novel. Each modern war has its unique horrors. Three Day Road mires the reader in the muck of World War I trench warfare as bodies pile in corners, lice pulse in clothing seams, and toes rot black with trench foot. Boyden spares no detail of hand-to-hand combat, of the blood-lust that becomes the sole means of emotional survival for some soldiers, of the ache for the relief of morphine. The devastation is so relentless, you understand any soldier's break with reason, you feel their uncontrollable rage and their sense of hopelessness as they accept that each moment may be their last. It is Boyden's storytelling ability and his skills in pacing and tension that keep the gore from overwhelming the narrative. The characters who ripple through bring life and dimension to the battlefields, farmland, forest and hearths of Europe and Canada. This is historical fiction at its finest: a scholar's command of factual detail balanced by a storyteller's heart and passion. Niska provides us with historical context, telling the story of northern First Nations in the early part of the 20th century. Xavier's story is eternal lesson that nothing good comes of war, a lesson we seemed destined to repeat and fail at least once each generation.I'm glad I waited a few more days to compile my Best Reads of 2011 list. Three Day Road will surely appear in the top ten."}, {"userName": "Brad", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/1022982-brad", "userReview": "I am wemistikoshiw, so I don't and won't pretend to understand what it is to be Oji-Cree -- nor any other nation for that matter. I pass no judgment on their beliefs, their lives, their experiences, their ways, but I do feel the great of weight personal disgust and guilt all wemistikoshiw should feel for the genocide of their peoples and cultures our ancestors began, which we carry on every day. I've been the lover of a Cree woman, a woman I still love and always will, but I have no illusions that my love for her makes me any less wemistikoshiw, any less culpable for what has been done to the proud nations she sprang from. The most I can ever hope to attain is empathy, an incomplete understanding, and a heart willing to hear Indigenous stories coupled with a resolve to do what I can when I can.  Joseph Boyden's Three Day Road is, I think, an Indigenous story gifted to we wemistikoshiw (at least in part).As Boyden spoke through Niska and Xavier and Elijah, and as the voices of Niska and Xavier made Boyden fade away, I began to hear whispers of \"let me tell you this wemistikoshiw\" and \"have you thought of this wemistikoshiw\" and \"don't ignore this wemistikoshiw\" because what I was being told, what the whispers were speaking of, were things too important to be ignored.Yes there is a terrifying and even sometimes thrilling tale of trench warfare in World War I in the foreground of Three Day Road, but there is so much more being told to us. It is telling us about the end of a way of life. I may think it was a beautiful way of life, others may think it was backwards, still others may think it was \"heathen,\" but what really matters is that it was a way; it was valuable; it deserved better. It is a story of how that way was ended, of the ways colonization tore down, took away, raped, brainwashed, manipulated, murdered or slowly eroded through attrition. It is the effects and affects of colonization and how there is no post-colonial period for Indigenous North Americans. There is only colonization. Niska and Xavier are whispering these things to the wemistikoshiw because we need to hear them and do more than hear them. We need to take them into our everyday lives. To look in the mirror at our own wemistikoshiw visages and see all of those whispers written there.Three Day Road is rich with meaning, bursting into the mud like the largest shells Fritz could throw at the lines, and I doubt that the multiple readings I am sure to give this novel will ever allow me to tap into them all. And maybe, perhaps, this first reaction that I've written here is the best and most important meaning I will ever take away from Three Day Road -- maybe knowing that I am wemistikoshiw, knowing and recognizing that, is exactly what the story needed me to know."}, {"userName": "Martha☀", "userReviewDate": "Jan 29, 2015", "userURL": "http://www.goodreads.com/user/show/4834343-martha", "userReview": "Xavier Bird of the Cree Nation grew up in a world of peace and solitude, hunting moose and grouse along the edge of Hudson's Bay in Northern Ontario in the early 1900s. Answering the call of The Great War, he and his closest friend, Elijah, head into the big city to enlist in the Canadian Army. As a Cree-speaking native, he is excluded from the camaraderie of his platoon and shunned for his cultural heritage, lack of English and quiet nature. As a gifted sniper, the atrocities that he witnesses throughout the battles of St Eloi, The Somme and Vimy Ridge deeply affect him and his outlook on life's purpose. Drawing strength from his heritage and his aunt Niska's teachings, he is able to see past the war. But these same experiences destroy his friend Elijah, who becomes addicted to morphine and falls into madness while surrounded by death. Xavier can do nothing but stand by and watch as Elijah descends into a living hell.At the end of WW1, Xavier finds himself badly injured in hospital, declared a hero and sent back home to the Canadian north. His sole relative, aunt Niska, meets his train and paddles him back up the river to their secluded home. Over these three days of travel, his aunt reminisces about her own life as well as Xavier and Elijah's youth and tries to convince Xavier to choose life. Boyden tells an amazing story. The chapters are interwoven between Niska's memories and Xavier's war experiences allowing us to see the connection they have while separated. I was able to feel the pull of Xavier's heritage while he ventured in this foreign world. It is fascinating to learn that Francis Pegamagabow -an Ojibwa sniper in WW1 - was the real life inspiration for this book. I can't wait to read more of Boyden's books."}, {"userName": "Jim", "userReviewDate": "Jan 17, 2008", "userURL": "http://www.goodreads.com/user/show/439937-jim", "userReview": "Outstanding novel. Probably one of the most enjoyable novels I have read concerning World War 1, that also provides a lot of insight into life in pre-war Canada for its Native population, in this case particularly the Cree. I really enjoyed the gradual reveal, alternating between the two narrators, of the friendship between two boys, the relationship between aunt and nephew. The treatment of Natives in Canada was not much better than what they received in the United States, with similar racism and paternalism. I think this is the first book I can remember that honors Native contributions to the Canadian forces in Europe (although I am sure they exist). One can also follow the unraveling of a good soldier maddened by his participation as a sniper and scout, the sacrifice of soldiers in this horrible war. I really enjoyed this and recommend it."}, {"userName": "Farzane", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/7966994-farzane", "userReview": "تا حالا کتابای زیادی خوندم که جنگ رو تقبیح کردند. کتابایی مثل در جبهه غرب خبری نیست یا عقرب روی پله های راه آهن اندیمشک که چهره ی کریه جنگ رو به بهترین شکل ممکن به تصویر کشیده بودند. اما نشون دادن جزئیات جنگ رو تا زمانی که جاده ی سه روزه رو نخونده بودم توی هیچ کتابی ندیده بودم. طوری که چند بار دچار حالت تهوع شدم و دستم رو جلوی دهنم گرفتم. بویدن نویسنده ی بسیار تواناییه که چهره ی واقعی جنگ رو نشون میده. جنگی که باعث از بین رفتن معصومیت در خیلی از آدمها میشه. ای کاش به جای پخش کردن کتاب \" دا \" توی سازمانها و ادارات مختلف این کتاب رو به مردم میدادند. فراموش کردم بنویسم این کتاب به فارسی ترجمه شده. جاده ی سه روزه / جوزف بویدن / محمد جوادی / انتشارات مروارید / چاپ اول 1389 / 384 صفحه. البته کتاب به چاپ دومم رسیده"}, {"userName": "Lorina Stephens", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/1585377-lorina-stephens", "userReview": "An astonishing novel. An even more astonishing first novel. There can be no disputing Joseph Boyden is not only an accomplished story-teller, but a significant Canadian voice in the 21st century.Three Day Road, drawn from real people and real history, is an impeccably researched, and skilfully wrought tale of two Cree soldiers who fight in the nightmare of WWI. It is a story about the terror of residential schools, the descent into madness, and the arduous journey back to peace of mind and body.A singularly great novel and great read. Highly recommended."}, {"userName": "Barbara", "userReviewDate": "Oct 11, 2013", "userURL": "http://www.goodreads.com/user/show/2439621-barbara", "userReview": "UH-mazing.Still reeling from the emotional whirlwind of the last couple of chapters. Wow.Loved that I learned about new aspects of WWI (new to me, that is) and Native Canadian culture. I was actually told to read Through Black Spruce before I stumbled on this one--JB's first novel--and I'm so glad that I did.Literature at its finest! Take a bow Mr. Boyden."}, {"userName": "Ian", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/31384949-ian", "userReview": "The time setting is 1919, and at a train station in Northern Ontario a Native Canadian woman, Niska, meets her nephew, Xavier Bird, on his return from active service in WWI. Xavier returns from the war a broken man in every sense. One leg has been amputated below the knee, he is addicted to morphine, and he is suffering from severe post traumatic stress. The two make a three day canoe journey back to Niska's camp, and during the journey the story of Xavier's wartime experiences is told in flashback style, interspersed with the story of Niska's life and Xavier's pre-war childhood. The novel's central relationship is between Xavier and his childhood friend Elijah Whiskeyjack, who is also his comrade in the trenches, but who undergoes a progressive brutalisation as the war itself progresses.The author has written another novel \"Through Black Spruce\", featuring Xavier's children and grandchildren, which I had previously read and which I thought was excellent. That gave me high expectations of \"Three Day Road\" which I would have to say were not fully realised. There are plenty of plus points. The quality of writing is good, and the novel has a strong culture clash theme as well as the inherent pathos of a WWI setting. In some ways it also challenged my own sense of morality, and it is no bad thing when a novel gets you thinking in that way. At the same time, I never found myself emotionally engaged with either the main characters or the plot as a whole. It probably didn't help that from early chapters I started to anticipate the broad outline of the plot, and it did turn out much as I had thought. For me, the plot also incorporated too much magic and mysticism. I have no overriding objections to including those kind of elements in a novel, but in this one too much was resolved simply by the summoning or exorcism of spirits, a plot device I found very unconvincing.Glancing at the other reviews, my view seems to be a minority one, and most other people have rated this much more highly. I can only say what my honest reaction was."}, {"userName": "Shirley Schwartz", "userReviewDate": "Sep 24, 2010", "userURL": "http://www.goodreads.com/user/show/4278399-shirley-schwartz", "userReview": "This book is so powerful and gripping and so very real that it is difficult to read it. Boyden takes us right into the French and Belgian trenches during the First World War. We are there and we experience the fear and the agony of this terrible war. The story is really about two young Indian boys who are friends and who enlist and go to the War together. The war changes these young Canadian boys. One (Elijah) becomes a warrior and goes hunting at night. The more Germans that he kills the darker his personality gets. The other one (Xavier) always has idolized his young friend, but cannot stand to see how this terrible war has changed him. We also have the viewpoint of Xavier's old aunt who is a traditional native medicine woman who stays at home in the woods of Northern Ontario but keeps up with her precious Nephew over in Europe through visions. She is the thread that weaves this powerful tale together. The descriptions of the battles and of \"going over the top\" are hard to forget. I really can't say enough good things about this book. It is truly exceptional. Yes it is difficult at times to keep reading because the war scenes are so devastating and so real, but I am so glad that I read this book."}], "description": "It is 1919, and Niska, the last Oji-Cree woman to live off the land, has received word that one of the two boys she saw off to the Great War has returned. Xavier Bird, her sole living relation, is gravely wounded and addicted to morphine. As Niska slowly paddles her canoe on the three-day journey to bring Xavier home, travelling through the stark but stunning landscape of Northern Ontario, their respective stories emerge—stories of Niska’s life among her kin and of Xavier’s horrifying experiences in the killing fields of Ypres and the Somme.", "title": "Three Day Road", "url": "http://www.goodreads.com/book/show/823411.Three_Day_Road", "average": 4.31, "cover": "https://images.gr-assets.com/books/1327905456l/823411.jpg", "reviews": 1471, "authors": [{"url": "https://www.goodreads.com/author/show/88550.Joseph_Boyden", "name": "Joseph Boyden"}], "type": ["Fiction", "Cultural", "War", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/823411.Three_Day_Road", "http://www.goodreads.com/book/show/3011111-three-day-road", "http://www.goodreads.com/book/show/666867.Three_Day_Road", "http://www.goodreads.com/book/show/1195395.Three_Day_Road", "http://www.goodreads.com/book/show/1542683.Three_Day_Road", "http://www.goodreads.com/book/show/2236145.Three_Day_Road", "http://www.goodreads.com/book/show/30964359", "http://www.goodreads.com/book/show/17661831-the-orenda", "http://www.goodreads.com/book/show/3479967-through-black-spruce", "http://www.goodreads.com/book/show/30079906-wenjack", "http://www.goodreads.com/book/show/4578640-born-with-a-tooth", "http://www.goodreads.com/book/show/7979263-louis-riel-and-gabriel-dumont"]}