{"ratings": 3863, "userreviews": [{"userName": "Robin Ryan", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/18184070-robin-ryan", "userReview": "This is the first book I have read by this author. I read it for a book club at my church. I wish I could say that I liked it, but this ended up being the typical stereotype of a Christian book (which makes me very sad to say). The storyline was very predictable and the character development was lacking. I found the writing flat and non-inspiring. There were several unrealistic scenes that made me wonder how anyone could buy into this story. For instance, there was a scene where the heroine of the story was swimming in the ocean and was attacked by an unknown diver who tried to drown her. After miraculously saving herself, with the help of a dog, she finds herself reflecting on the incidence on the beach. Her love interest happens along in the company of the town sheriff and she decides not to report the incident to either one of them. I'm sorry - but that would have to be the single most terrifying event of a life and to not mention it and furthermore, to not act like anything was wrong at all seemed absolutely impossible to me. That was just once instance. Relationships evolved quickly and yet seemed to have no depth or character to them. There were a couple of things that happened in the story that had no correlation or meaning to what was going on and just caused me to say \"huh?\" There did not seem to be any intellectual content in this book, in my opinion. This book is the first in a series but I have no intention of reading any subsequent books. The storyline had possibility - I liked that the heroine was a restorer of historical buildings and the first chapter set up the mystery storyline very quickly. I just think it could have been fleshed out much better and more realistically."}, {"userName": "Aerykah", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/5920961-aerykah", "userReview": "*This is a re-read.*Though it didn't quite make it to my favorites list, I still really enjoyed it. It's a good story & kept my attention. I give it 4 1/2 stars. The narrator left a little to be desired, though..."}, {"userName": "Sarita", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/37168935-sarita", "userReview": "I let a few years pass after reading the Rock Harbor and Aloha Reef series from Colleen Coble, and don't know why because her suspense stories is filled with mystery, plot twisters and characters with depth.This was another wonderful romantic suspense from Colleen and recommended to fans of this genre.The way Libby dealt with finding out her dad only passed recently, she has a half brother and sister and about her inheritance, reflected her reliance on God and finding strength in him, especially showing grace to her siblings even though their attitude towards her were harsh and they were acting like spoiled brats.Alec was a strong dependable male character who quickly won my heart. I enjoyed seeing how he interacted with the people from Hope Beach, his nephew and Libby.I loved that Bree and Samson from the Rock Harbor series made an important appearance in this story.I loved the themes of showing graces and forgiveness towards others.I was also kept in the dark about what was going on and who kidnapped Nicole. My suspicions were wrong and I loved being wrong in a suspense book even more than being right.The only thing which was a bit annoying was the constant thinking of Libby about wanting to keep the Inn but not having the financial means to do and the offer of sale to be so much money. But this did not take away from my overall enjoyment of this story."}, {"userName": "Ruth Hill", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/2299424-ruth-hill", "userReview": "I have to admit that this was a difficult read for me. I was only aware of Colleen Coble's historical romances, and this was the first time I ever have come in contact with a more contemporary romance from this author. I have to admit that the first portion of this book was rather slow for me. I actually did not think I would like it very much at all. But as I got into the book more, the author drew me into the story. The mystery became quite intriguing, and I found myself not wanting to put the book down. I cared about the characters, and I wanted to know if everything worked out all right. I found myself often on the edge of my seat.I began to see the things that I know in love in this author's works. I found romance, history, and a strong faith in God. God is real in this story, and you see His hand at every turn. Bad things happen, but somehow it all works together for good. It either brings people running back to God or else people turn their backs on Him. Everyone has to make the decision about what they must do with God. I did enjoy the portions that the author inserted concerning the history of this sleepy island. Being a lover of historical fiction, I am so glad to have found this in a contemporary romance. I don't know if I would have enjoyed it as much without this!This is truly a well-crafted story. Do not let the slow story keep you from pressing on. In the end, all will make sense. You will appreciate every detail the author gives you. And it is, of course, a bonus that there is no profanity or sex scenes! Justice is served, and all is explained in the end. And I bet you won't figure everything out!If you have a day or two to set aside for a riveting read that will keep you guessing at every turn, this is definitely the book for you. You won't regret picking up this book!I was sent a copy of this book in exchange for my honest review. I was not financially compensated, and all opinions are 100 percent mine."}, {"userName": "Bonnie", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/31230559-bonnie", "userReview": "I love beach settings. I love mystery and suspense. I love stories of best friends. I love reading about people running an Inn or Bed and Breakfast. And this story has it all! The characters were fun and interesting to read about and I always love stories that involve, for example, her seeing through a video chat, her best friend being kidnapped. It tells me I'm in for a fun read! I recommend any of Colleen Coble's books, as she is a favorite author of mine, and she never fails to produce a good, entertaining story!"}, {"userName": "Laura", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/1603322-laura", "userReview": "Growing up, Libby believed her father had died when she was five. A restorer of historical buildings, Libby and her best friend Nicole go to check out the inn her father, who died recently, left her much to the surprise of her new found brother and sister. While there, Nicole is kidnapped while Libby watches online helpless. Libby becomes the prime suspect in her friend's disappearance.Colleen Coble is a master of writing romantic suspense novels that focus on character development . While this book was good, it's not memorable. I liked the characters, but they don't stand out. My favorite character was Alec, Libby's love interest who has taken in his nephew. He is strong and resilient, two traits every book's hero should have.While the premise of the book holds promise, much of the plot was the same thing over and over. Looking for Nicole. Arguing with her brother and sister. I think the plot would have benefited from one or two more things happening because the plot is interesting and has some twists and turns that caught me by surprised. I just was kinda bored between twists. Although it's definitely not Coble's best, it's a nice rainy day read. Fans of Christian suspense will enjoy this book.I received this book in exchange for my review. My thoughts and opinions are my own."}, {"userName": "Alyssa", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/995669-alyssa", "userReview": "This was just terrible. I'm sad I spent .99 on it. Yet another example of a decent plot done poorly. Though the characters changed throughout the novel their motivations seemed superficial and the \"crisis of faith\" issues seemed shoehorned into the novel. I'm not sure how to put my finger on everything that was an issue for me in this book. The premise was good. A historical restoration expert is left an dilapidated inn on one of the outer banks islands by her long lost father which she thought was dead. A coast guard hottie helps her unravel the mystery. Interesting premise right? Along the way we meet her long lost siblings and aunt and uncover other mysteries. Again, all of this could have been good. But I was left feeling like the characters were flat and that faith and goodness was the deus ex machine of solving the mystery and creating relationships. Maybe it was because of the way the motivations were described that they just seemed to work out too easily (and this is for a romance novel, yes I understand that they should be judged by different standards).I've already spent too much time on this review than the novel was worth. In other words, don't waste your time. Also, I wish amazon would label \"Christian\" themed novels. I got over that phase in high school."}, {"userName": "Denise", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/2953994-denise", "userReview": "I would give this book 2 and a half stars if I could. The story was quite creative, mysterious disappearances, secret families, a nice hard working hero. However, most of it is too farfetched -- they talk about cell phones and using the internet but introduce a loving father who loses track of his daughter who was living only a few hours away and owns a small business -- not very likely! A Coast guard officer who never gets reassigned or leaves his home town, again this baffles me! Some of the mystery is never really resolved (the rope around the ankle of the step mother?). I also felt the Christian message gets a bit too preachy and could be toned down a bit."}, {"userName": "Nola", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/16941805-nola", "userReview": "I've read about 15 of Colleen's novels and really enjoyed them, especially the Rock Harbor series and the Aloha Reef series. However, a couple of the more recent storylines haven't grabbed me as much. It's not that they're not well written, but the characters and settings weren't to my taste. When I was just a few chapters into Tidewater Inn, I felt like I'd \"come home\" because it had the feel of some of those earlier novels. Suspenseful opening, appealing characters, great settings, a blossoming romance that you care about. The exploration of faith issues was also interesting as Libby had to keep asking herself \"what would Jesus do\" in the midst of trying circumstances. I had to laugh when Bree and Samson from Rock Harbor suddenly popped up in the middle of the book and helped solve the crime. No wonder it felt like those earlier novels!There were a couple of places where I felt credibility was stretched. For example, the sheriff continued to act in an immature manner (to my way of thinking) long after he should have accepted Libby's story and I couldn't believe Zac would still fail to act immediately after learning the identity of the woman on the island. A couple of the perpetrators were known early on in the book as we were privy to their discussions. However, the revelation of the person who had made the attempts on Libby's life came as a bit of a surprise. I felt there needed to be a couple more clues along the way. That let the ending down a little for me.Having said that though, it was an enjoyable read overall. As this is the first in a new series, I'm already wondering which character will be the focus of Book 2 and I intend to stay tuned. If you haven't read one of Colleen's books before, this is a good taster, though still not quite as good as the Rock Harbor and Aloha Reef books."}, {"userName": "Hannah", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "I started the audiobook, and the narrator drove me nuts. But I liked the story in spite of that, so I finished the rest of the tale with a library paperback. It's a good mystery, even though I didn't like the local police deciding that it must be the outsider, Libby, who's at fault, instead of hunting for full evidence before deciding. I loved the part of how Libby learns to build a relationship with her newly-discovered family and realizes that, no matter their attitude, she is to love them well anyway."}, {"userName": "Shash", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/6372553-shash", "userReview": "This book started fast! The mystery began in the first chapter, shocking me and drawing me in. I continued to enjoy the book from there! I'm looking forward to reading the rest of the series!"}, {"userName": "Aerykah", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/5920961-aerykah", "userReview": "Though it didn't quite make it to my favorites list, I still really enjoyed it. It's a good story & kept my attention. I give it 4 1/2 stars."}, {"userName": "Sarah Coller", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/43856473-sarah-coller", "userReview": "Wellll....this wasn't really my cup of tea. I did like the mystery element and didn't have it figured out when it was revealed, so that was good.  There were a lot of plot holes, questions and things that were too good to be true. For instance, the MC is a real estate renovator who wants nothing to do with \"the money side of things\" but she can hack into a beach camera in seconds? When seconds before, she didn't even know where it was located?? Why did it take like a week for anyone to question how the kidnappers knew where Nicole was supposed to be meeting Vanessa? In fact, now that I think about it, did that question ever actually get answered? This is not rocket science or a \"plot twist\"...just a big shiny DUH. Nothing is really mentioned about questioning Vanessa about the disappearance. I thought it was weird that they allowed the old man to pack his gun before heading to get medical help. I doubt he'd be able to actually possess a gun in any kind of medical establishment. The absolutely biggest DUH is---four days into the disappearance, Vanessa suggests someone contact the media and everyone thinks, \"hey! Great idea!\" WHAT???!!! Ugh. UGH. Yeah, or we could have done that like, I don't know, right when a woman was kidnapped in front of witnesses??? In fact, the whole premise of this book is too ironic to be true. Libby and Nicole happen to be interested in a property on the very island her previously-unknown-to-her family lives on---oh, and then she just happens to have inherited everything? I don't know...maybe I just missed like EVERYTHING about this story, or maybe it's ... just... not my cup of tea."}, {"userName": "Elaine Nickolan", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/40351802-elaine-nickolan", "userReview": "A pleasure to read a good old fashioned \"who done it\" story. Enjoyed this story from start to finish. This story kept me up reading just one more page. This story is about a woman who witnesses a crime and at the same time is being introduced to a whole family she never knew she had. A father that she was told had died when she was 5 actually was alive and living life with a new family. What Libbey discovers when she gets to Hope Island is that there was so much she never knew. She is desparate to find her friend and deal with her new found inheritance and all the drama that goes with it. Meanwhile someone doesn't want her there and she needs to find out who before its too late. With the help of Alec she tries to uncover all the family and island secrets before its too late. Loved the ending and I am looking forward to the next offering by this author."}, {"userName": "Erin L", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/3217959-erin-l", "userReview": "With a series title of \"Hope Beach,\" I should have been expecting the heavy Christian influence in this book. This isn't a bad thing and didn't affect the quality of the writing, but it's not the kind of book I would normally choose.I did find the characters to be interesting and the mystery and romantic elements carried well through the plot to make this an enjoyable read overall. Colleen Coble has written a lot of books and her skill shines through giving readers and evenly paced read that doesn't turn into a slog through the middle.Definitely recommend this one if you are looking for a Christian romantic suspense."}, {"userName": "Nicole", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/7166048-nicole", "userReview": "I enjoyed this book and look forward to reading more of this series and this author. The writing is not extraodinary and the plot is simplistic, however, I liked it."}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Aug 10, 2012", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "Libby Holladay and her partner Nicole Ingram work together at a business called Hollsday Renovations. They work to convince owners to dramatically increase the value of their historic properties by entrusting them to Libby's expertise.When Libby receives a phone call from Nicole telling her that her father, Ray Mitchell has left her some prime real estate worth millions in his will. In fact the entire west side of the island and the Tidewater Inn now belongs to her. The Tidewater Inn is only accessible by boat and it's right along the ocean. More than thrilled to get the chance to see the possibilities, Libby asks Nicole to set her up via a webcam to see the property she's about to inherit but Nicole also tells her that she has a half brother, Brent and half sister, Vanessa they she never knew about until today. Thinking she had no remaining family left, Libby is thrilled with the idea she might get a chance to know her brother and sister. In fact Nicole tells Libby that she will get Vanessa on the webcam when they meet at the lighthouse ruins where Vanessa is scheduled to show her around. Then she can see her before they actually met.However when Libby pulls up the web cam link on her laptop she see's Nicole confronted by two men who inject her with a needle, and attempt to carry her off. As Libby attempts to call 911, she tries to record the video link but it goes dark before she can save anything. Using all her computer skills, she accidentally deletes the link from the computer. Now she has no proof to show the police. What will happen to Nicole and just why were these men after her? As she races to the Outer Banks to find Nicole, the mystery is about to intensify!In the latest novel by Colleen Coble, Tidewater Inn is the first in the Hope Beach series, and immediately engages the readers adrenaline in this heart pounding suspense novel with a twist of intrigue and romance. When Libby arrives in the Outer Banks she is the first the police suspect in Nicole's disappearance and while they launch an investigation to prove her guilt, Libby has to launch her own search to find Nicole before she winds up dead. She enlists the help of Alec Bourne, Chief Petty Officer for the Coast Guard in her search along with trying to deal with her new found family who aren't please to learn that they are sharing their inheritance with a sister they never knew. This book is guaranteed to keep your interest at an all time high as the suspense grows as the tidewaters continue to rise!I received Tidewater Inn by Colleen Coble compliments of Litfuse Publicity for my honest review and have to say there hasn't been one book that I've read by Colleen Coble that wasn't a winner in my opinion. This is a great series I can see developing because the cast of characters from Libby's new found family, to her warm and loving Aunt Pearl are guaranteed to make you want to keep coming back for more. I rate this one a 5 out of 5 stars and was up in the wee hours of the morning because I started reading it so late, I thought I would be able to put it down, but I couldn't! Sleep deprivation has never felt to good and so worth it too! I highly recommend this one if you love a bit of mystery with some intrigue, suspense and romance with the ocean as your backdrop!"}, {"userName": "Lisa Johnson", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/7092311-lisa-johnson", "userReview": "Title: Tidewater InnAuthor: Colleen CoblePages: 302Year: 2012Publisher: Thomas NelsonNote: I received a complimentary copy for an honest review of this book. The opinions shared in this review are solely my responsibility. Other reviews can be read at http://seekingwithallyurheart.blogspo... . Also follow me on Twitter @lcjohnson1988\tAnother winning series begins with Tidewater Inn from author Colleen Coble. There is something in this book for just about everyone…romance, suspense, mystery, history. The characters are developed in detail and are easily related to. Their emotions seem genuine and don’t feel put on.\tThe story begins with the main character, Libby, finding out that her father, whom she thought had died when she was five years old, just died a month ago. In his will, he left her an inn on the Outer Banks at a place called Hope Beach. She also has two step siblings she knows nothing about. Then, she witnesses her business partner and best friend being kidnapped while watching on a web cam. Libby is hours away and all she can do is watch as her friend is dragged off by two men after they jab a needle in her arm. Libby phones 911, and the action keeps rolling from there. This is all in chapter one!\tLibby arrives in town to find her best friend and also to claim her inheritance. Her step siblings are very unhappy they aren’t getting the inn. They are very unwelcoming to Libby. She also meets Alec, who is in the Coast Guard. He volunteers to help Libby find her friend. Their relationship soon grows to be more than friends. They both are Christians and want to do as the Lord wills. On top of all this, Libby is trying to decide whether or not to sell the inn and is trying to work through her feelings of rejection from her father and her step siblings. Libby has always wanted to be a part of a loving family. Will she ever be part of one? Can these siblings get past their own feelings of anger, surprise, and hurt?\tAlec loves the small town where he lives and doesn’t want the inn to be sold as the buyer plans to build a resort and bring in a lot of tourists. Alec also has just taken custody of his teenage nephew whose parents were recently killed in a plane crash. Alec has a lot on his plate to deal with…his rebellious nephew, his budding relationship with Libby, helping find Libby’s best friend while silently thinking she is already dead. The town sheriff suspects Libby as the culprit for the kidnapping and murder of her friend. Alec wonders if she could be guilty. If not Libby, then who is guilty? Where is Libby’s friend’s body? What secrets are people hiding? \tAll-in-all, the writing and plot flow very well and make for a great novel! I recommend this to add to your “keeper” list. It is so nice to read about a romance that puts God first. I can hardly wait for the next novel in the series which comes out next summer. Get this great story and a comfy spot because once you start reading it, you won’t be able to put it down!\tMy rating is 4.5 stars."}, {"userName": "Mj", "userReviewDate": "Oct 21, 2013", "userURL": "http://www.goodreads.com/user/show/5706631-mj", "userReview": "Tidewater Inn was a book club selection and I found it to be a quick and enjoyable read. A romantic mystery is the best way to describe it. The characters are interesting and the setting terrific. The story takes place on an inhabited but as yet commercially undeveloped coastal island in the Outer Banks (barrier islands primarily off the coast of North Carolina.)The principal character Libby rejuvenates old buildings and is checking out a potential restoration job on Hope Island when her partner Nicole goes missing. Libby is initially considered a suspect and she stays on the island longer than planned to clear her name and but primarily to find Nicole, never wavering in her belief that Nicole is still alive despite the odds. Libby gets help with her search from numerous town folk, including Alec, a full-time fisherman and part-time coast guard. Libby and Alec are the romance. Looking for Nicole is the mystery, plus there are a number of other surprises in Coble’s plot.The flow was good and the story kept my interest. I particularly enjoyed the descriptions of the island and ocean venue and the camaraderie of the people on the island. I thought Coble did a good job of painting a picture of what living on a small coastal island must be like and how when nature plays such a dominant role in the environment, it brings neighbours together to help each other out.Tidewater is a Christian based book and while I appreciate books that are rooted in beliefs, whatever faiths they might be, I found the book to be a bit too in your face about born again Christianity. I’ll try to explain. When meeting new people in person I enjoy finding out more about them but I don’t necessarily want our entire exchange to be centred on our religious beliefs. I felt this book was a bit too over the top on the subject - a bit preachy and almost like it was trying to convert readers. There were lots of actions in the book that displayed the characters as people of faith, so I really didn’t see the need for verbalizing it repeatedly. I did get that Coble was showing that one’s faith should be at the centre of one’s life and of everything one does. Nonetheless, I found the overdone born again Christianity to be detracting. It is clear that many readers enjoy Coble’s writing style and content as she has quite a loyal following. For me it was an enjoyable 3 star read."}, {"userName": "Virginia Campbell", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/2333268-virginia-campbell", "userReview": "Colleen Coble is one of my favorite authors, and I am excited that she has begun a new book series called \"Hope Beach\". The series is set in the Outer Banks, and the author uses her eye for detail to make the natural beauty of the location as vivid as possible, adding great flavor and texture to the story line. A history lover, restorer, and rescuer of fading architectural gems, Libby Holladay runs her own business, Holladay Renovations. Libby is an archaeological historian who works in historic preservation with her best friend and partner, Nicole Ingram. While on a scouting expedition for a new business project in Hope Beach in the Outer Banks, Nicole discovers that Libby has inherited an old inn, a gift from a father whom Libby though to be long-dead. Nicole also informs Libby that she has a sister and brother from her father's second marriage. Libby plans to join her partner and investigate her unexpected legacy. However, while speaking with Nicole via webcam and making plans to meet, Libby watches in horror as Nicole is drugged and kidnapped. Desperate to find help for her friend, Libby frantically contacts the authorities and heads toward Hope Beach. When she arrives in Hope Beach, Libby meets Coast Guard Chief Alec Bourne, who is part of the team of local authorities searching for Nicole. Alec is also dealing with the sudden responsibility of the care of his nephew, Zach. Alec's older brother, Zach's father, was killed along with his wife in a plane crash, and at first Zach was in the care of his grandparents. When he proved to be more than his grandparents could handle, his uncle Alec became his guardian. As the search for Nicole continues, an attraction grows between Libby and Alec. Libby's newly found brother and sister are not pleased with her inheritance, and other mysteries soon come to light. Throughout the story line are woven the themes of greed, generosity, selfishness, and selflessness. Underlying all of the characters' thoughts and actions is the struggle for personal redemption: live immorally in the moment, or accept true faith and find eternal life. \"Tidewater Inn\" is a thoughtful, enjoyable romantic suspense read. The second book in the series, \"Rosemary Cottage\", will once again bring reader to the community of Hope Beach and the shores of the Outer Banks. Review Copy Gratis Thomas Nelson Books"}, {"userName": "Patricia Kemp Blackmon", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/5314062-patricia-kemp-blackmon", "userReview": "Libby has a passion for historical restoration. Her partner is onsite of a potential restoration on Hope Island. Libby is two hours away from Hope Island as she is talking to her partner Nicole. Nicole is not only her partner she is her best friend since childhood. Nicole tells her that Libby has inherited the Tidewater Inn on Hope Island from her deceased father whom she thought had died when she was five years old, but come to find out he just passed away recently. Not only that she has a half-sister and half-brother. This was unreal for Libby to imagine. Then withing minutes of talking to Nicole she witnesses on a webcam her friend being kidnapped.Could things get anymore complicated for Libby. She heads for Hope Island as soon as she reports to the police of her friends kidnapping. When she finally arrives at the island she talks to the local police, then asshe is making her way to Tidewater Inn she meets a handsome Coast Guard Lieutenant. She finds herself very attracted to him. But she has too many things to deal with besides an attraction to a man.As the investigation in her friends kidnapping get's under way she becomes a suspect. This woman has so much on her plate I don't know how she keeps her sanity. She has the best help anyone could hope for and that is faith and trust in God to give her strength. Even though her new siblings do not trust her or care to have anything to do with her, there are others that do care and she can depend on them to believe in her and to pray for her and her missing friend.She falls in love with Tidewater Inn and sees so much potential in her new home if she only had the money to complete a restoration on the place. But as it stands she might have to put it up for sale.This author has always been able to pull me into her books. She has done so in this book also. This book is suspenseful, heart wrenching, inspirational and romantic. Although I did think it was a little unbelievable about the circumstances of her friend Nicole it was still an amazing read.I highly recommend this book.I rate this book a 5 out of 5.DisclosureI received a copy of this book from Litfuse/Thomas Nelson for review. I was in no way compensated for this review. It is my own opinion."}, {"userName": "Megan", "userReviewDate": "Jul 23, 2012", "userURL": "http://www.goodreads.com/user/show/5372197-megan", "userReview": "Tidewater Inn started off great, with a kidnapping in the first chapter! The story had some very intriguing parts: the kidnapping (of course), a long kept secret that changes Libby's life forever (not saying what it is, but it was very surprising J), Hope Island itself (it sounds SO beautiful), and the sparks between Libby and Alec, the Coast Guard lieutenant.However, almost as soon as Libby got to Hope Island, some parts of the story began to be a bit repetitive. One example of this: Libby would say she would love to keep the inn, but she doesn't know how she could afford the upkeep - I lost count of how many times this was said, but it was a lot! I found this to be very unusual for this author's books - I don't remember her other books doing that, but I did read them quite a long time ago, so maybe they did?Besides the repetitiveness, the story kept me interested throughout almost the whole book, but the ending was a bit sudden. I am hoping that in the next book, Rosemary Cottage, there will be more about Libby.To fans of Colleen's Rock Harbor series, I want to let you know that Bree and Samson make an appearance in this novel. I loved being able to reunite with Bree - it has been awhile. I completely enjoyed her parts in the story.I have to say the cover kind of annoys me. It's beautiful and everything, but I hate when covers don't match the story. In the book, the inn is a Georgian mansion with over 2,000 sq. ft of decks and balconies alone! Yet the cover shows a house that looks very much like a Victorian and doesn't seem anywhere near the size of the house in the story, which sounds huge as it has 15 bedroom suites - if I am remembering correctly. The cover not matching doesn't hurt the story, it is just a pet peeve of mine and so this doesn't affect my rating.Overall, while this is not one of my favorite books by Colleen, it was still enjoyable. If you love romantic books with suspenseful aspects to it, you will probably like this book more than I did.***I received a complimentary copy of this book to review. I was asked to give my honest opinion of the book - which I have done.***"}, {"userName": "Renee", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/2965894-renee", "userReview": "When one's looking for a romance be it contemporary or historical with just a touch of suspense and mystery Colleen Coble is a must read author. From the first Heartsong Presents novel that I read by Ms. Coble years ago to her latest book, Tidewater Inn, I've been nothing but impressed by her work. As a reader who loves the beach I was so glad to see a story set in the Outer Banks that had all the other elements I love besides a great setting - romance, great characters, architecture and history.Following Libby Holladay from the moment she receives the shock of her life concerning her deceased father, an unexpected inheritance as well as the violent kidnapping of her best friend and business partner, Nicole, Tidewater Inn is a story of love and family as well as greed and envy. Libby is unsure of what to do about any of the problems that she's faced with and must clear her name of any wrongdoing in the disappearance of her friend all the while trying to figure out just how the handsome Coast Guard lieutenant Alec fits into her new life.From the first chapter you know you're in for a superbly entertaining story. I have to admit that I thought I had the whole mystery concerning Nicole and her kidnappers figured out so I was somewhat shocked when the real criminal surfaced at the end of the book. I did not see that coming in the least and hopefully you won't either if you decide to read this book. It's a real treat to be surprised in a world of \"predictable\" suspense. The romantic aspects of the story are pretty predictable but as one who's been reading romance since grade school it takes A LOT to surprise me. Tidewater Inn is definitely a good start to a new series and I'm very much looking forward to reading Rosemary Cottage (Hope Beach, Book 2) in 2013.~ My Rating: 4 out of 5 stars ~*I received a complimentary copy of this book for review from the publisher. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission's 16 CFR, Part 255.*"}, {"userName": "Taylor Hoffman", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/9178104-taylor-hoffman", "userReview": "Tidewater Inn (The Hope Beach Series) by Colleen Coble tells the story of Libby, a struggling historical building restorer who watches the kindaping of her business partner and friend Nicole on a Hope Island Beach from a video cam. Libby rushes to Hope Island to attempt to find Nicole and while there, discovers that her ties to the island run deep.Why I Chose This Book:I am a sucker for plots set among the sea and that involve the military as I am a military spouse myself. I am also a sucker for small town histories. When I read that this novel takes place on an island and involved a small sea town and a coastie, I had to read it.My Thoughts:The plot of this novel moves along wonderfully quick and the characters are well developed. The main character, Libby, seems like she could be a real friend that you have known for a while. I appreciated that the author depicted the main male character as a good man because he is loving, respectful, and sacrificial but at the same time, a strong, likable character. The mystery was good, even though the author gives the reader a few clues right off the bat, I ended the book feeling somewhat surprised and relieved. I look forward to reading about what happens to the characters in the next book of the series.Some of the language used to describe the character’s love life seemed outdated and out-of-place. The main characters are in their thirties, yet one character refers to wanting to “neck” with the other in a movie theater. I found this reference outdated and just a little bit strange since this isn’t a romance novel. The author also repeatedly used the same exclamatory phrases, like “lit up” or something to that effect, but put them in multiple people’s mouths. These are small issues, but they distracted me from the flow of the book. The romance between the two main characters would have been fine without the forced and outdated language.The Numbers:Overall Rating: 3Character development: 4Writing Quality: 3Plot: 4Fluidity: 3Originality: 3Genre: Contemporary Christian Fiction"}, {"userName": "Tamara Tilley", "userReviewDate": "Nov 29, 2014", "userURL": "http://www.goodreads.com/user/show/1383724-tamara-tilley", "userReview": "TIDEWATER INN had a unique storyline with plenty of suspense and romance.Libby Holladay and her partner Nicole renovate and save buildings with historical value. It’s Libby’s true passion in life. Well, Libby’s life has just turned upside down. Thinking her father died when she was young, Libby has just found out his death was more recent and that he left her an inheritance in the form of an old seaside house. She’s also just learned she has a half brother and sister that want nothing to do with her, and her business partner, Nicole, has been kidnapped before her eyes. Feeling overwhelmed by all that is going on around her, she also learns she is the sheriff’s main suspect in Nicole’s disappearance. Finding Nicole is Libby’s top priority even though her own life is being threatened. Though Coast Guard Lieutenant, Alec Bourne, makes it clear he’s suspicious of Libby, he’s the only one that seems willing to help her find Nicole. What follows is a race against time to find Nicole and her kidnappers, before they find Libby.I really enjoyed TIDEWATER INN. Though I read the three books that comprise the Hope Beach series out of order, it did not lessen my enjoyment of the story or the characters of Libby and Alex. The pace was fast-moving, and I was surprised by not only who the culprit was that was trying to silence Libby, but some of the discoveries Libby made as well. Alec was a stand-up guy who was honest with Libby about his suspicions, but soon saw that Libby was genuinely kind and carry, and would never intentionally hurt someone. Libby couldn’t help but be drawn to Alec’s protective manner but tried to keep her feelings under wraps. Libby’s need to gain her brother and sister’s approval was admirable considering how poorly they treated her.Out of the three books in the series, I think TIDEWATER INN was my favorite. A good read with good characters."}, {"userName": "Kay Defreese", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/3050019-kay-defreese", "userReview": "Libby thought she was all alone in the world. Both her parents were deceased. Her mother had died a year before and her father has died when she was five; at least that was what was told by her mother. All this changed when she got a call from Nicole, her business partner. While on a business trip Nicole had discovered that Libby’s father had actually died only a month before and that he had left Libby the Tidewater Inn in his will. Tidewater Inn was a beautiful historic building that was badly in near of repair. Libby also learned that her father had remarried and that she had two half siblings. Nicole had hooked up a cam camera so Libby could see everything and also see her half sister but before her eyes she witnessed that Nicole was abducted by two strange men. Alarmed she immediately took a trip to Hope Island to try to find her friend and business partner and to also find out about the will and her father. The local authorities did not believe her that her friend was abducted. They thought she had something to do with Nicole going missing and nothing would convince them otherwise. While there she met Alec who worked for the coast guard and he eventually believed her. She also met her siblings who were very hostile to her in the beginning, particularly the sister. I really liked the has the mystery was solved in the story. Really like it that some favorite characters from the Rock Harbor series were brought in to help solved the mystery. It was so good to see Bree and her famous search and rescue dog Samson back in action. I also liked how Libby had to answer to the Holy Spirit on the right thing to do concerning her siblings. Her head told her one thing but the Holy Spirit told her another. The theme was WWJD.(What would Jesus do).Looking forward to reading more books in this series. I hope the next one focuses on Vanessa, the sister.Thanks to Netgalley and Thomas Nelson books for providing me with this ebook to review."}, {"userName": "Laura", "userReviewDate": "Aug 02, 2012", "userURL": "http://www.goodreads.com/user/show/2521894-laura", "userReview": "Title: TIDEWATER INNAuthor: Colleen CoblePublisher: Thomas NelsonJuly 2012ISBN: 978-1595547811Genre: Inspirational/romantic suspenseLibby Holladay is a restorer and she and her friend Nicole are negotiating to purchase a building on the Outer Banks of Hope Island. But when Nicole arrives to work out the deals of the sale, she is stunned to discover that the attorney on the island is looking for Libby—her father has died and left her a historic inn. A father she thought had died when she was five.But that’s not all the surprises. Libby also learns that she also has a brother and a sister she never knew existed. And they aren’t at all happy to find out that Libby exists—or that she inherited the inn. Nicole goes missing and the local sheriff believes Libby is the top suspect, believing she killed her best friend and business partner. Libby tries to prove her innocence but they keep finding incriminating evidence against her. With the help of a local Coast Guard lieutenant, Libby sets out to find her friend—and hopefully the person behind the kidnapping. Libby’s dream come true has become a nightmare. Will she lose everything?TIDEWATER INN is a contemporary romantic suspense set on Hope Island, but I’m not entirely sure what state it is. Someplace that gets frequent hurricanes. It started slow, but by the end of the first chapter my interest was piqued and I couldn’t put the book down, reading when I should’ve been working. I thoroughly enjoyed TIDEWATER INN and can’t wait to read the next book in this series, coming in July 2013. I love Ms. Coble’s contemporaries—and it was nice to have an unexpected appearance of Bree Matthews and her search dog in this book. Totally loved it. Discussion questions included. $13.99. 302 pages."}, {"userName": "Wall-to-wall books - wendy", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/2281076-wall-to-wall-books---wendy", "userReview": "This was a good solid suspense/mystery.It did keep my interest and it started out with a bang definitely getting my attention. But my attention went downhill from there until half way through when it started to pick back up for me. Don't get me wrong - I did not dislike this book - I did give it 3.5 not bad. But I don't really think it was my type of book to begin with. I love Colleen Coble! This was my 6th book by her! But I loved all the other ones so much better. They were all Historical Fiction.The Good -  It started out very exciting! I loved the scenes with Nicole (while she was kidnapped). It did get better half way through There were a lot of twists, and I never guessed \"who done it\". Would make a great movie. It had a good ending.The Bad - I felt really disconnected with the characters. I liked them, I just never really felt close to them. Everything was very repetitive, a lot of the lines were said over and over. I hated the \"poor me\" I'm innocent, nobody will believe me attitude from Libby. I know that Vanessa was suppose to be a Brat, and she was, but she was also only suppose to be one year younger than Libby and she seemed like a 16 yr. old not the 20 something that she was.THE ALL-IN-ALL -All in all this was not a bad book, it was interesting enough to keep me reading. I guess I am just not into mysteries that much. I am so sure that other people will enjoy this a whole lot more than I did!I will not give up on Colleen Coble - I will just stick to her His/Fic books :-)This is a very clean Christian/Fiction/Mystery book, OK for any age or gender."}, {"userName": "Melanie", "userReviewDate": "Feb 06, 2012", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "Review on Amazon: http://www.amazon.com/review/R3RA3VIX...Review on my blog: http://christianbookshelfreviews.blog...I've read a lot of Colleen Coble's books and she is a favorite author of mine. Although Tidewater Inn isn't my favorite of hers (that would be Abomination), I did still like it and found it to be an enjoyable read.Something I particularly loved was how Bree, her family, and search & rescue dog, Samson, showed up in Tidewater Inn and played an important role in the story! I'm so glad Colleen brought back these characters and I hope they will be in some of her future novels as well.I didn't care for how the story seemed to repeat things often and, at times, seemed inconsistent. I liked the characters and my favorite was probably Alec or Libby (I'm excluding Bree and her family because, of course, they are favorites). There were quite a few times I was surprised by things in Tidewater Inn - which I really liked.Overall, I enjoyed Tidewater Inn and look forward to reading book two in the Hope Beach series when it releases. If you enjoy mystery novels with some sweet romance, then I think you might enjoy Tidewater Inn as well. Good read!*I received a complimentary eBook copy of the book for my review. I was not required to give a positive review, only my honest opinion - which I've done. All thoughts and opinions expressed are my own.*"}, {"userName": "Lynne Young", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/5015573-lynne-young", "userReview": "What an amazing book! Every time I see a new book by Colleem Coble I can't wait to read it because I know it will be filled with emotion, lots of twists and turns, and an element of faith. Tidewater Inn did all of that and more.What would it be like to watch your business partner be abducted via webcam and not be able to do anything about it? What would it be like to find out the father you thought was long dead had recently died and not only left you an Inn but siblings you knew nothing about? Well, that is all on the plate of Libby Holladay, part owner of Holladay Renovations. And of course you have to add in the very handsome Chief Petty Officer of the Coast Guard Alec Bourne who agrees to help Libby find her missing business partner.The twists and turns this book takes are pleasantly unexpected and at one point I found myself gasping because the story went to an unexpected place - or two. This is a story of truth, faith, redemption, forgiveness and love, not just for another person or persons but for a place so beautiful you can't help but want to call it home.This book is a must read for anyone who loves adventure, old architecture, mystery and just a good old fashioned love story. Ms. Coble has done an amazing job of bringing this area to life and helping the reader to \"see\" what the characters are seeing. I cannot wait for the next book in the \"Hope Beach\" series."}], "description": "\"Welcome to Hope Beach\"\"Where the sea breeze is fresh, sun sparkles on sand . . . and trouble appears with the force of a hurricane. \"Inheriting a beautiful old hotel on the seaward shore of Hope Island could be a dream come true for Libby. The inn cries out for her restorer's talent and love of history. She's delighted to learn of family she never knew she had. And the handsome Coast Guard lieutenant she's met there on the island could definitely be the man of her dreams.But Libby soon realizes that only way she can afford the upkeep on the inn is to sell it to developers who are stalking the island. The father who willed her the inn has died before she could meet him, and her newfound brothers and sisters are convinced she's there to steal their birthright. Worst of all, her best friend and business partner has been kidnapped before her eyes, Libby's under suspicion for the crime, and her handsome lieutenant clearly doubts her innocence.Libby's dream-come-true is becoming a nightmare. Can she find her friend and establish her innocence? Must she sell Tidewater Inn and lose her family again? Or can she find a home for her heart on the beautiful shores of Hope Island", "title": "Tidewater Inn\n      \n          (Hope Beach #1)", "url": "https://www.goodreads.com/book/show/16442448-tidewater-inn", "average": 3.88, "cover": "https://images.gr-assets.com/books/1356172534l/16442448.jpg", "reviews": 446, "authors": [{"url": "https://www.goodreads.com/author/show/33227.Colleen_Coble", "name": "Colleen Coble"}], "type": ["Christian Fiction", "Mystery", "Romance", "Fiction", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/16442448-tidewater-inn", "http://www.goodreads.com/book/show/13033553-tidewater-inn", "http://www.goodreads.com/book/show/17370339-tidewater-inn", "http://www.goodreads.com/book/show/18190671-tidewater-inn", "http://www.goodreads.com/book/show/6605726-the-lightkeeper-s-daughter", "http://www.goodreads.com/book/show/2896711-lonestar-sanctuary", "http://www.goodreads.com/book/show/11942636-blue-moon-promise", "http://www.goodreads.com/book/show/15869688-without-a-trace", "http://www.goodreads.com/book/show/22572148-the-inn-at-ocean-s-edge"]}