{"ratings": 219, "userreviews": [{"userName": "Cheri", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "Born in Wexford, a small town that in Banville’s youth was both more isolated and more of a rural community, Dublin fascinated him, captivating him in his youth. The annual trips, by train, for him and his family, fell around the date of his birthday, and their purpose centered around Christmas shopping, Christmas lights and a chance to be a part of something bigger, grander. In the 1950’s, I expect that the memories of the differences from his everyday life would be even more remarkable, the draw of Dublin even more enchanting. \n”Dublin, of course, was the opposite of ordinary. Dublin was for me what Moscow was for Irina in Chekov’s \nThree Sisters, a place of magical promise towards which my starved young soul endlessly yearned.”\n”That the city itself, the real Dublin, was, in those poverty-stricken 1950s, mostly a grey and graceless place did not mar my dream of it—and I dreamed of it even when I was present in it, so that mundane reality was being constantly transformed before my eyes into his romance; there is no one more romantic than a small boy, as Robert Louis Stevenson knew better than most.”\n\n”When does the past become the past? How much time must elapse before what merely happened begins to give off the mysterious, numinous glow that is the mark of true pastness?”\n\n”Let us say, the present is where we live, while the past is where we dream. Yet if it is a dream, it is substantial, and sustaining. The past buoys us up, a tethered and ever-expanding hot-air balloon.”\nThis is less a memoir of Banville’s life as it is a tribute to his Dublin, his childhood views of the mystery and magical draw of this city, and his views of this city that has seen so much in its time. The transition of the Dublin of the past to the Dublin that helped form him into the man he became, and a glimpse back through those years.How I wish I’d read this before I had gone to Ireland, although I spent too little time in Dublin to recognize all of the places he writes of, there was enough to draw out memories of my time there, in particular his writings on the Iveagh Gardens, near St. Stephen’s Green.\n”I had a sense of the magical timelessness of such places, and of the uses to which we put them. We change, we age, we stay or move away, and in time we end. The park, however, endures. It is a thought, I think, to comfort, if only by a little, the most distressed of hearts.”\nIncluded are some stunning photographs by London-based portrait photographer and film-maker, Paul Joyce. This might seem a strange choice to begin reading Banville, but I think it has given me some insight into the man, and while I have looked forward to reading his books for a while, this has given me added incentive."}, {"userName": "Lewis Weinstein", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/2231715-lewis-weinstein", "userReview": "John Banville is a wonderful writer ... We met him in Key West (and also later in Dublin) and talked with him about writing ... he said something then I try to remember every time I write: make every single word as good as it can be ... every single word ... great advice for any writer The \"pieces\" in this memoir are soft and gentle and often moving ... Banville's description of places he cares about are simply superb."}, {"userName": "Diane S ☔", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Review soon."}, {"userName": "Kathie Harper", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/6821342-kathie-harper", "userReview": "A sentimental journey of sorts or a coming of age story in a city that the author gravitated towards for most of his life? I admit he grabbed me right away as he described his annual birthday trip on December 8, the Feast of the Immaculate Conception, to Dublin from County Wexford where he lived the rest of the year. His child's perspective is authentic right down to the impatience of waiting for his mother and sisters to finish their Christmas shopping while he couldn't wait to get his ice cream. Unfortunately this is a Dublin that has transitioned from a depressing backwater to a city where the charms of the old have blended with the new. Banville laments this change, relishing the reader with the rough and tumble times of an eccentric city. We are treated to neighborhoods where raconteurs and hustlers ruled the day, real people who charmed and regaled. This is not the Dublin that I've come to know, though my knowledge is very spotty I recognize many of the spots he visits with his friend, \"Cicero,\" in his ancient roadster. With any good memoir, this is more about Banville than about Dublin, his sensibilities and his biases. As a reviewer in the Irish Times so adeptly puts it, \"The impression is not so much of a writer haunted by memory as of one choosing to haunt memories of his own past.\" He skill as a master of simile and metaphor is present throughout. One of my favorites is, \"the shop assistants in Clery's, a local department store on O'Connell Street, were brisk and competent in a martyred sort of way, like an order of secular nuns.\" There was often a wee bit of humor like when he recalls a story about one of his friend's encountering one of Belvedere College's retired teacher priests, and in mentioning James Joyce, a former student, the father drolly murmured: \"Ah, yes, Joyce. Not one of our successes.\" There are many gems like this sprinkled throughout. So not so much a travelogue but a tribute to one man's remembrances as the New York Times review is titled, \"An Irish Flaneur Greeting the Past on his Present Wanderings.\" It's well worth the journey."}, {"userName": "Mary Monks hatch", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/21057747-mary-monks-hatch", "userReview": "For one who loves Dublin, every page of this book is total joy. For those not so familiar with the city, it will bring delightful insight into what makes the city so special: the rich history, and the stories that lurk everywhere. Beautifully written by the great John Banville, it exudes affection for the city, as well as informing and entertaining. It is a handsome book, too, beautifully illustrated with superb photographs by Paul Joyce."}, {"userName": "Kathy", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/31175766-kathy", "userReview": "3.5 stars for me, because I was unable to enjoy reading this hardback book published in small font. I use reading glasses and had to add magnifying glass! A book I had so looked forward to became an irritant - so frustrating. Oh well. I am pretty close in age to Banville.Lovely pictures included, charming musings, informative details of Dublin architecture, remembrances from youth with sharp honesty and references including Dublin's writers, actors, artists.Detachment appears to be a thing in his life.I admire and even love much of Banville's writing. I liked:\"The process of growing up is, sadly, a process of turning the mysterious into the mundane. We cease to be amazed by things--the sky, the turning of the seasons, love, other people--only because we have grown accustomed to them.\" \"Can the old man be the same being as the child he once was?\"His childhood memories of going from his Wexford home to Dublin for birthday/Christmas shopping were quite brilliant and moving.His tribute to his aunt he lived with in Dublin who died whilst he was enjoying Mykonos as a young man would.His appreciation of the history of Dublin as amplified by a friend.--and much more, but now I must bathe my poor eyes. Alfred A Knopf - I should write a letter to you!"}, {"userName": "Iva", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/758187-iva", "userReview": "Although I wasn't charmed by Banville's novel, The Sea, I found this memoir very pleasing. His personal experience of Dublin is informed by his love of the city and his knowledge of its past. Excellent photos enhance the reading experience and are essential for those who haven't spent time there. For those who know the city, Banville's memoir will bring back memories. A lovely book."}, {"userName": "Alan", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/1386077-alan", "userReview": "The author (whose novels I have never read) gives a literary and historical walking tour -memoir of Dublin. Since Dublin is porbalby my favorite city in the world, I loved the trip."}, {"userName": "Amy", "userReviewDate": "Jan 01, 2017", "userURL": "http://www.goodreads.com/user/show/4751778-amy", "userReview": "I really enjoyed this book! Labelled as a memoir, I was expecting to read about Banville'S life but I was pleasantly surprised to discover I was being led around Dublin by Banville and his friend Cicero. I enjoyed walking the streets of my hometown with different eyes and learning more about the city itself. The photographs are also beautiful and evocative. Unfortunately the appendixes and pages of image credits and references lulled me into thinking there was more left of the book than there actually was, meaning I was not prepared for my journey to be cut unexpectedly short. Then again, perhaps that's how Banville may have liked it."}, {"userName": "George Siehl", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/32852828-george-siehl", "userReview": "A newspaper review of Time Pieces highlighted the description of Dublin's brickwork buildings, which I had been taken with on my visit there, and some of the humor included, another certain lure. Author Banville, writer of the Dublin based Benjamin Black crime novels was unknown to me. Nonetheless he proved a charming and informative guide to Dublin in this book.Banville introduces us to people, famous or noteworthy; to places of interest, and to some of the history that haunts the city. His people include many literary names readers may recognize, such as Graham Greene, Seamus Heaney, W. B. Yeats, and J. P. Donleavy (author of The Ginger Man), some people he knew or who figured in Dublin's literary scene. As a man of a certain respected age, he heeds the cry of the days of the Black Death, \"Bring out your dead!\" He treats those whom he brings forth with love and respect for their talent, their wit, or both.His discussion of places in the lovely city are highlighted by outstanding photographs by Paul Joyce. Most of these are black and white and some few are vividly in color. The places he takes us include the pubs where he spent much time with his literary friends, the neighborhoods where he and other remembered authors and journalists lived, particularly Baggotonia, and the cinemas and parks that marked his younger days of romance and disappointment in love. \"I held her hand. I was wasting my time, she said, wasting my time; and yet she smiled, and allowed her hand to rest in mine. It is out of such moments, commonplace yet plangent, that the past, the longed-for-past, assembles itself.\"His spots of history include those associated with the unhappy union with England in 1800, and the bloody ending of that union after World War I. Others include the ill-fated canals that were the hope for industrial development that never came; homes that were built for the well-to-do that were eventually hacked into rental rooms for the poor; the remnants of the IRA blasted Nelson Pillar; a maternity hospital for poor women; the Botanical Garden and its impressive Great Palm House, a towering glass dome built in 1884; and, of course, the brickwork. He writes of the \"special and unique qualities\" of Georgian Dublin. Adding, \"the colours range from rosy pink through cadmiun yellow and yellow ochre to a chalky-textured madder, and burnt sienna...\" The \"hues alter subtly with each passing hour... and when it rains, ah, when it rains the bricks gleam and glitter like the flanks of a galloping racehorse.\" He is a writer who deftly turns a phrase, which makes for an enjoyable read.His commentary on Dublin's parks is insightful: \"We have been accustomed to them for so long that we forget what a remarkable invention park and pleasure gardens are. Although they are as old as antiquity...parks are the quintessential public manifestation of the Enlightenment and its values.\"The humor is sprinkled throughout the narrative. My favorite follows his walking down the street, \"when the cover of the manhole flew open as I was about to step on it. A head in a hard hat popped up and the fellow stared at me. Without missing a beat, he put on a wild look and asked urgently, 'Is the war over?' Every trade has it's comedians.\"As he leads the tour, he is, by turns, introspective, sometimes regretful, and often nostalgic. His account of a boy experiencing the many changes and excitements of the teen years will be familiar to many readers who may be former teenage boys, or the parents of same. Many shout-outs of films, books, and more people punctuate this pleasant account. It would have been a better book with a Dublin city map showing some of the many points he paints. Nonetheless, a fine book."}, {"userName": "Gary Moreau", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/41901229-gary-moreau", "userReview": "One of the great philosophical questions through the ages has been the nature and substance of time. In the very first chapter, “About Time”, Banville poses the question, “When does the past become the past?” It provides, in many ways, the rhetorical theme that unifies what is otherwise part memoir, part guidebook, part picture book, and part social and geo-political commentary.As a result, there is a lot of timely reflection: “The process of growing up is, sadly, a process of turning the mysterious into the mundane.” It even infiltrates the description, as in, “…cups of tea the colour of tree trunks sunk for centuries in swamp-water.” Banville takes us on a magical journey through his life and Dublin both, providing just enough detail to make it informative, but not so much that it ever bogs down. Throughout the journey, moreover, you are sure to have a smile on your face. At one point, he asks, “Do I imagine it, or am I right in thinking that the English can never quite take the Irish seriously? When I am over there I have the impression that everyone I speak to is just about managing to keep a straight face.” I am not English, but I know I read the whole book on the brink of a good chuckle.The writing itself is very witty and very accessible. When comparing the statues of Paris and Ireland, for example, he notes, “In Ireland we tend to erect tremendous plinths and set upon them tiny figurines, our aspirations to gloire seeming to falter at an ascending rate. In Paris, however, those vast stone figures confront us imperiously, overwhelming in their scale, their grandeur, their vividness.” There are plenty of colorful references to other Irish writers and poets. He refers, for example, to Irish poet Patrick Kavanagh as a “crusty old codger,” but without a trace of disrespect. And he notes about Joyce: “For me, as a writer in the making, the fact was that Joyce had seized upon the city [Dublin] for his own literary purposes and in doing so had used it up, as surely as Kafka did with the letter K, and consequently the place was of no use to me as a backdrop for my fiction.” And while there’s a whiff of adolescent naughty here and there, although it hardly qualifies as even that by today’s standards, there’s not a single expletive in the whole book. The prose is crisp and sharp but never in your face.All told, it’s a delightful stroll through both time and Dublin, although I suspect the author would dislike the “delightful” part. His prose is more creative but straight on. Not quite bare knuckle, if you will, but definitely written with a mischievous twinkle in the eye.It’s a quick read and you won’t find a better way to spend an afternoon. So while it’s not transformative in the way we normally use that word, it will transform your day and that deserves a 5 in my book."}, {"userName": "Danny Daley", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/37175639-danny-daley", "userReview": "It must be said that this book is very short on information about Banville himself. This is not necessarily a bad thing. For all of the respect Banville has earned around the world as a top form literary writer, his reputation in Dublin is more mixed, mostly because many Dubliners find him to be a bit too aware of his stellar reputation. I once bought a copy of a new Banville novel in Hodges Figgis, the legendary Dublin bookstore, and an employee said to me, \"Oh you just missed him, he was in here some 15 minutes ago.\" When I showed some regret at my poor timing, she said, \"You're not missing much, he isn't very interesting.\" I'd still love to run into the man. To counter his reputation for egoism, Banville, to his credit, has admitted in interviews the very same, that he isn't much of an interesting person, so aside from some minor details about places he's lived, and an amalgam character called Stephanie that represents his early love life, most of what we get here is solely centered on Dublin, rather than Banville himself.All the better. I moved to Dublin a few years ago, and like Banville, it has become my adopted home, and the place on earth I adore more than any other. So, these 200 pages were a delight to read, as Banville simply details interesting facts about the city, and tries to reveal it to the reader through his own eyes and interests. The book can be uneven at points, but on the whole I found it to be a charming and easy read."}, {"userName": "Wanda Boker", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/59542675-wanda-boker", "userReview": "I wish I'd liked this book more. A love letter to the city of Dublin, written by an Irish novelist...what better preparation for an enthusiastic tourist's first visit to Dublin? To be fair, Banville has many good stories, amusing anecdotes and historical insights to share, and A Dublin Memoir would be more appreciated by a reader who knew Dublin, who had read John Banville's novels perhaps, someone who would have a bit of context for understanding why walking along that particular canal, descending those steps, or sitting in that pub, is so worth discussion. But, something else struck the wrong cord with this memoir, which is a way of looking back on one's mistakes in a 'what a cad I was....oh, well\" way that only comes naturally I think for an aging, white, privileged man. Banville reflects on his life to write this book and he seems to just then realize that he could have been more loving towards his parents when he was an adolescent, that he could have been more considerate towards the aunt who shared her apartment with him during his first years in Dublin, that he could have been more fair to his sister, who carried the burden of family responsibilities that were actually his to carry. All of this is done with an irritatingly casual shrug, almost a 'sucked to be you' arrogance, that didn't sit well with this reader."}, {"userName": "Andres Eguiguren", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/17259665-andres-eguiguren", "userReview": "Time Pieces is part memoir, part tour guide by Irish novelist John Banville. It might be of most interest to those familiar with Dublin and interested in Irish history, architecture, and literature. However, if like me, you have not read any or much of Banville's work (only the first 25 pages or so of Booker Prize-winning The Sea, in my case) or haven't been to Dublin in ages (1993!), there is much to keep the casual reader interested. I'm a sucker for memoirs as a genre in any case, and you couldn't ask for a better guide that Banville and his aptly-named friend Cicero. Banville's musings are complimented by Paul Joyce's photographs, with the author particularly interested in Georgian Dublin and the Baggotonia neighborhood. Throughout, there are numerous examples of fine Irish wit. For example, he writes of a lunch with Sean Mac Reamoinn, who nearing the end of his life quipped \"I'm like the Census, broken down by age, sex and religion.\" On another occasion, he \"had risen regretfully to leave while there were drinks still on the table, saying 'Well, I'm off home now to put my feet up in front of a roaring wife'.\" A lovely book, preferably to be enjoyed slowly with no more than a chapter a day."}, {"userName": "Linda", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/865798-linda", "userReview": "I completely enjoyed this personal exploration of a city I too came to love after two weeks there 30+ years ago. Banville is a master of literary fiction and his experiences as a child and young adult combined with mature meetings with fellow writers, Dublin historians and guides, and knowledge of past giants such as Joyce and Yeats, all with sly asides, self-deprecation, and sardonic humor were a reading delight. I especially enjoyed his tale of his first \"true love\" and the awful truth about the \"kind of a cousin\" that would always be hanging about her house when he visited. One of the better stories of hapless young unrequited love. A story that included the description of the Iveigh Garden, a semi-derelict haunt behind Newman House, where we spent a few hours. Yes, his description brought back memories. And how could I have forgotten the Irish Foreign Ministry right along that same street and the Concert Hall where we caught our city bus most afternoons! I feel I've been fortunate indeed to have met a couple of the authors he briefly mentions, and to have read this book that enlarges my limited experience of such a place."}, {"userName": "Eb Mcdermott", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/3116924-eb-mcdermott", "userReview": "How to describe? A perfect travel guide for Dublin on your second or third visit when you want to wander into unusual places and imagine all the history underfoot. A memoir of some brief romances and early years when life was full of promise and you didn't notice how gray Dublin was. Insight into some of the catholic patriarchs that ruled with an iron fist. Some poets and writers that wrote heartwrenchingly about Ireland. And then John Banville - sometimes crude and coarse and annoying and sometimes describing a drink or a lunch with Seamus Heaney or some wonderfully literate personage and you wish you'd been there. I love the size and heft of the book - it could fit in your bag easily but is not a throwaway pocketbook. I wonder if his book about Prague is as enjoyable?I read the Library copy and had to return it. I imagine if I took a copy with me to a Dublin the margins would be filled with notes and addresses and perhaps a pressed flower and ticket stub would be in the very back pages."}, {"userName": "Seán Rafferty", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/29251479-se-n-rafferty", "userReview": "'Time Pieces' is like going for a stroll in Dublin with a crusty, erudite and highly entertaining tour guide. Although from Wexford, Banville's love for Dublin shines through. It is full of wonderful snippets of social history pertaining to Dublin of the 50's, 60's and 70's. Unsentimental, he dispels myths but it is still essentially a middle-class reflection on his Dublin.Banville is as you would expect from such a great writer, is really interesting on memory and truth and how it shapes our reality and art. And of course there's the wonderful prose. Banville is incapable of writing a bum sentence. It is truly a pleasure to read. His brief description of Pierrepoint is majestic and very funny (p163-4) and he deserves a novel to himself (and perhaps he has in 'The Book of Evidence'?). The book it should be noted is a beautiful object. Hardback with gorgeous photographs by Paul Joyce, it is a book for holding and admiring and definitely not for kindle or ebook."}, {"userName": "Marilyn Shea", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/43701122-marilyn-shea", "userReview": "I hope that, if you were to read this memoir, you would find it in a hard cover version because the book itself, the weight of it, the sturdy pages and wonderful photographs, will remind you why actual books that you can hold in your hands are essential. This memoir, a tour of the author's beloved city of Dublin is slow and written at a walking pace. The author takes the time to trace the history of the buildings and the people who shaped Dublin throughout the centuries. He adds memories of events in his own life that took place in certain locations. His descriptions of his own memories include so much detail and he recalls not only the things that happened but attaches to them vivid sensory recollections--the brilliance of a color or the scent of something in the air."}, {"userName": "Jamie Barringer (Ravenmount)", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/5877880-jamie-barringer-ravenmount", "userReview": "This is an excellent memoir, with nice photos and anecdotes, and lovely writing. I liked how Banville situated his story within the context of other writers from his part of Ireland, drawing in the current events that helped shape his story without turning his book into just another history of Ireland (not that I dislike histories of Ireland). It is also fun sometimes to see how good novelists tell their own personal stories. I have not read any of his novels yet, but if he writes as well in fiction as in autobiography, I am looking forward to starting in on one of his novels soon (one of the few in our public library; for some reason our city library hardly has any of Banville's books in its collection, aside from this rather new memoir)."}, {"userName": "Josh", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/45668880-josh", "userReview": "Banville's \"Time Pieces\" is a quiet reflection on place and time--melding memoir and Dublin history in an extended personal essay that is both philosophical and intimate. Ultimately, I didn't connect much with Banville's voice in this book, which I think is more a matter of personal taste than anything, because Banville's skill as a writer is clear. But despite the fact that much of the book did not captivate me, the writing is interspersed with passages that leap of the page, capturing human insights in beautiful, resonant prose.Paired with vivid photographs of Dublin, the book is an interesting experience that balances between the grounded and the universal."}, {"userName": "Yooperprof", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/848544-yooperprof", "userReview": "John Banville's Dublin.I wish there'd been a map.This is the kind of travel memory book that probably wouldn't mean as much to those who have not spent any time in the place under consideration. But I have fortunately spent a little time in Dublin over the last few years, wandering its cobbled streets and squares, drinking in its paneled pubs and coffee shops, and getting wet in its restorative rains. I've also enjoyed reading about contemporary Dublin in the crime fictions of Tana French and Benjamin Black (Banville's alter ego). So that background greatly enriched my reading of \"Time Pieces.\""}, {"userName": "Marks54", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/5109654-marks54", "userReview": "I read Banville’s novel, “The Sea” and loved it, especially his thoughts on time. The book is billed as a memoir but is more of an odd reflection of his experiences in Dublin, the recollections of the Dublin literary scene, and a travel book about the sights and sounds of historical Dublin. We recently visited Dublin and wished that we had such a guide to help us away from the tourist tracks. I will be sure to reread this before I visit Dublin again. He is a superb writer who makes a travel narrative seems like quite a story. The book is supplemented with lots of nice photos of the places he visits. This was a very enjoyable read."}, {"userName": "Don Shiffrin", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/5739757-don-shiffrin", "userReview": "Banville's travels through Dublin neighborhoods trigger memories. Banville's writing and observations bring to life a city I've never been to and its characters. His memories of a young woman he loved unrequitedly and some other people of his past are richly rendered, some captured in but a paragraph or two; he wonders where they might be now, and if he Googled them to find out he doesn't ruin his reminiscences or the way he's presented them with anything he may or may not have learned on the internet."}, {"userName": "Robert B", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/2075717-robert-b", "userReview": "I have mixed feelings about this memoir of Banville’s time in Dublin. On the one hand, the writing is extremely good and very clever – just unpack the multiple meanings of the title, for example. On the other hand, there is nothing particularly gripping about his descriptions of various landmarks in the city and their connections with episodes in his life. Paul Joyce’s photos add little to the narrative, I’m afraid, and seem like random shots of some random place. For fans of Banville more than fans of Dublin."}, {"userName": "Kate Klassa", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/45558213-kate-klassa", "userReview": "Having never been to Dublin before nor ever having read any of Banville's novels, I wasn't sure what to expect with this one. I thought -- and was correct in thinking -- it would be a series of short histories of various places of note in Dublin, but I wasn't expecting the wonderfully related personal history of Banville's experience with the city. Beginning in Banville's youth, when he would visit every year on his birthday, and carrying on until adulthood, \"Time Pieces\" tells of Dublin as it was and how it was imagined to be. It's well worth reading at a slow, thoughtful pace."}, {"userName": "Shelley Rose", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/6001904-shelley-rose", "userReview": "I must visit Dublin now. Banville, my favorite living literary fiction author, writes eloquently of the city, his haunts, and his memories of these places. It's the best kind of travelogue/memoir - giving the reader a sense of Banville's remembrances of this literary bastion, interspersed with thoughtful historical glosses and footnotes. Reading this memoir gave me a vivid sense of place as well as an alternative view of frequent themes of Banville's fiction - time and memory. A worthwhile read."}, {"userName": "Peter P.", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/66293106-peter-p", "userReview": "This was a gift in so many ways. First of all, Banville's writing is beautiful. He wastes no words and seems to select the perfect one for every sentence. Secondly, being from Dublin, I simply loved his vignettes of each of the sites visited. And lastly - and I am obviously talking about the hardback version - from the moment you hold the book in your hand and before you even turn a page, the book promises something special. It delivers in spades."}, {"userName": "Don Palmer", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/73957288-don-palmer", "userReview": "Evocative and beautiful book. Poignantly moving to me. I read it based on a wonderful review I thankfully attended to. The book is also handsomely made with a high quality binding, thick pages pleasing to the touch and amply illustrated with excellent photographs. It was fun to learn more about Dublin. This is one for the permanent library. I will be reading more by this author I’ve newly discovered."}, {"userName": "Beth Phillips", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/13209202-beth-phillips", "userReview": "This, I imagine, is Banville at his most relaxed, as he exudes a luscious yet effortless stream of elegant writing and tender reminiscences. My sole caveat: Though the book is filled with memories vividly conveyed and poignant musings on memory and time, I failed to sense a particular passion for the author's beloved city. Still, I can't imagine roaming Dublin, especially literary Dublin, with a more delightful and erudite escort."}, {"userName": "Linda Bogaard", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/4404152-linda-bogaard", "userReview": "Chose because I'm taking a tour of Ireland/N. Ireland in Sept. 2018. Not familiar with this author and don't anticipate reading any of his other books. Language got a bit \"high-falootin'). Was interesting to read about some of the places (buildings, gardens, etc.) in Dublin he told about. Wouldn't necessarily recommend to anyone, even the gals I'm traveling with."}], "description": "From the internationally acclaimed and Man Booker Prize-winning author of The Sea and the Benjamin Black mysteries--a vividly evocative memoir that unfolds around the author's recollections, experience, and imaginings of Dublin.As much about the life of the city as it is about a life lived, sometimes, in the city, John Banville's \"quasi-memoir\" is as layered, emotionally rich, witty, and unexpected as any of his novels. Born and bred in a small town a train ride away from Dublin, Banville saw the city as a place of enchantment when he was a child, a birthday treat, the place where his beloved, eccentric aunt lived. And though, when he came of age and took up residence there, and the city became a frequent backdrop for his dissatisfactions (not playing an identifiable role in his work until the Quirke mystery series, penned as Benjamin Black), it remained in some part of his memory as fascinating as it had been to his seven-year-old self. And as he guides us around the city, delighting in its cultural, architectural, political, and social history, he interweaves the memories that are attached to particular places and moments. The result is both a wonderfully idiosyncratic tour of Dublin, and a tender yet powerful ode to a formative time and place for the artist as a young man.", "title": "Time Pieces: A Dublin Memoir", "url": "http://www.goodreads.com/book/show/36324200-time-pieces", "average": 3.8, "cover": "https://images.gr-assets.com/books/1506693152l/36324200.jpg", "reviews": 63, "authors": [{"url": "https://www.goodreads.com/author/show/91.John_Banville", "name": "John Banville"}], "type": ["Autobiography", "Cultural", "Biography", "Nonfiction", "Biography Memoir"], "outlinks": ["http://www.goodreads.com/book/show/36324200-time-pieces", "http://www.goodreads.com/book/show/32699278-time-pieces", "http://www.goodreads.com/book/show/33135942-time-pieces", "http://www.goodreads.com/book/show/3656.The_Sea", "http://www.goodreads.com/book/show/3659.The_Book_of_Evidence", "http://www.goodreads.com/book/show/163.The_Untouchable", "http://www.goodreads.com/book/show/13414604-ancient-light", "http://www.goodreads.com/book/show/6595136-the-infinities"]}