{"ratings": 628, "userreviews": [{"userName": "Tracey", "userReviewDate": "Jun 20, 2009", "userURL": "http://www.goodreads.com/user/show/841949-tracey", "userReview": "Wow. Just – wow. I really wasn’t sure when I started … but wow – e cosi bello!I’ll never look at tomato sauce the same way again. It was an extraordinary book. It’s a fable about how the tomato came to Europe, and how it overcame the strange, popular prejudice that it was extremely and immediately poisonous, to become inseparable from Italian cuisine. It’s also about a wicked stepfather, the oppression of Jews in early Renaissance Europe, the curing of olives, Christopher Columbus, Catholic missionaries in Africa, sanitation, copulation, and celebration. It’s a romance (not a love story), basically Romeo and Juliet if the lovers had been older and there had been someone sensible in Fair Verona. Everything in the story has meaning and significance: a donkey’s bray, a shaft of sunlight, a drop of holy water. The story is earthy – sometimes downright crude – as well as golden, rapturous, euphoric – and yes, rhapsodic. It is both sprawling and intimate, with a good-sized cast of characters who do not come across as “characters”; these are people, wildly individual and altogether real. Some might find the rhyming dialogue cloying, or indeed find it no better than annoying. But I find that the couplets to my inner ear became as natural and simple as, dare I say, Shakespeare. (I was tempted to write an entire review in rhyme, but it would take forever; I just don’t have the time.) Read this book. But first make sure your pantry is well stocked with good olive oil, good bread, eggplant (try the Good Padre’s idea in Chapter 3 – it’s wonderful), fresh herbs – and tomatoes. Definitely tomatoes. Lots of them."}, {"userName": "Kim", "userReviewDate": "May 08, 2011", "userURL": "http://www.goodreads.com/user/show/4542979-kim", "userReview": "This is a most unusual novel. Set in 15th century Tuscany, it's a tale of love, lust, food and life. It features broad and bawdy comedy, poignant drama, rhyming dialogue (said to be in imitation of the peasant dialect of the place and time), random Italian words and phrases, commedia dell'arte elements, authorial asides, sensual descriptions of the joys of eating a tomato and creative explanations for the origin of foods such as tomato sauce and pizza. I've noted that the book polarises opinion. Goodreads reviewers seem to either love it or hate it. I fall into the former camp. Although I thought the narrative dragged just a little bit in the middle (although that could have been because of my mood and not because of the writing), there was lots in Schell's writing to make me smile and enough in the plot to make me want to know how it turned out. The descriptions of food were a definite plus, although for reasons which I won't go into here, I may never look at a vat of homemade tomato sauce in quite the same way again!While I found the novel a very enjoyable read, I can understand why it doesn't have universal appeal. I don't think it's possible to predict which readers will like the book, so I won't take on the responsibility of recommending it. Readers will know whether they are going to like it by the end of the first chapter. For my part, I'm glad I read a GR friend's enthusiastic review, because otherwise this novel would never have come my way. (Thanks Tracey!)"}, {"userName": "Judy", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "Adam Schell has cooked up a gourmet treat to delight all the readers' senses. His recipe includes bushels of charm, wit and cleverness mixed with a delicious plot and saucy personalities. Take above ingredients and wrap them in Tuscan history, sprinkle with a dash of suspense, season with heartbreak, Christopher Columbus (really!) and failure, then steam all the above in sweet romance for 338 pages and glory in a delectable gourmet treat.Davido and his grandfather are sixteenth century, despised Jewish outcasts of Tuscan society. The avoidance of the Cattolico villagers stems not only from religious bias but Davido's cultivation of love apples, the much-feared tomato. This novel humorously tells a version of the story of how the tomato became a staple, edible ingredient in Italian cooking.I loved reading every page of this book. Hopefully, there will be more books to come from Adam Schell.4.5 stars"}, {"userName": "Janice", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/2513987-janice", "userReview": "I don't know what category to place this book. It doesn't seem to fit any mold, unless it's tomato aspic. It made me think of The Princess Bride and even Shakespear's comedies (not that I've read a lot of Shakespear).This fable is a fun romp through Tuscany when the tomato (or love apple) was introduced to Italy. The story of the star crossed lovers is told in a lyrical poetic style and vividly brings all the characters to life while praising the virtues of the tomato. You may even find a recipe or two in there. I chose this book for a challenge. The book was to be written by an author who shares one of your names. I hadn't heard of this book before my search led me to Adam Schell. I picked it solely because he shares my last name. Schell seems to be an unlikely name for an author so I just had to read it. I'm so glad I did! I hope he writes more in the same style. It's so refreshing to read something like this."}, {"userName": "Vince Robertson", "userReviewDate": "Oct 09, 2009", "userURL": "http://www.goodreads.com/user/show/2824175-vince-robertson", "userReview": "I fear for Adam Schell: it isn't going to be easy for him to write another book as good as this one. This one is very, very good - marvelous, in fact.It takes a little effort to enter the world of this novel, accustom oneself to the idiom in which it is written, and enter the flow of the narrative. Some of the descriptions repeat in a Homeric way which is both enthralling and sometimes frustrating. My usual diet is Lee Child, Robert B. Parker and John Connolly, more action and dialogue, but this story of love between a young Jewish man and a young Catholic woman, he devoted to the land and tomatoes, she to the land and olives (and grapes), is gripping without shoot-outs or fist fights, once you're oriented.And, anyway, there is intrigue, sex which is stirring but not pornographic (because Davido and Mari are in love), a villain, a hero, and a host of eccentrics and ordinary men and women who rise heroically to the occasion. The presence at a critical moment of the Grand Duke and his troop of guards is entirely plausible because he's been in the village for weeks, though in the guise of a peasant.The whole story, made up of many stories, is plausible and magical simultaneously. I loved it."}, {"userName": "Denae", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/4763195-denae", "userReview": "I kept hoping it would get better. For a short time it seemed as though it would. Then we got to the donkey dicks. This book came highly recommended to me. It presents a fantastic example of how two people with generally similar tastes can diverge drastically.I found myself struggling with the writing from the very beginning. It was verbose and reminiscent of a student who has not yet learned which adjectives are descriptive and which merely distract. The plot felt disjointed. The author, for no reason apparent to me, repeatedly diverged from the telling of the story into explanations of how another author wrote that people should write when telling a story. It distracted.The stereotype of the noble, overly-emotional peasants of a village in beautiful Tuscany has been flogged until it is beyond dead and falling apart. So has that of the nobleman who goes among said peasants and learns important life lessons. This book does nothing to improve or add to that already overcrowded field.The descriptions of the food really were amazing. I wish the rest of the book had lived up to them."}, {"userName": "David Schmelkes", "userReviewDate": "Dec 29, 2010", "userURL": "http://www.goodreads.com/user/show/4720981-david-schmelkes", "userReview": "Fabulous! Wonderful! Amid the slew of dreary American fiction, obsessed with dysfunctional families, addiction and vampires (YUCK!), I cannot tell you how delighted I was by this utterly original and refreshing novel. I have long loved works of historical fiction, but, truth be told, I often find them a bit dry, but not this one. Tomato Rhapsody had the literary chops and substance that I hope for in good literature, but oh my, an exuberant humor leaped from the page. Yes, it took me a few chapters to adjust to the structure and style – a bit like an elaborate summertime meal with friends that demands your attention and patience – but once my ear caught the rhythm (literally, as much of the dialog takes place in a wonderful rhyme, reminiscent but easier than Shakespeare), the story literally pitched me into a magic world of food and sex and love and villainy, tomatoes, olives, Tuscany, donkeys (who would have thought!) and wonder like few books I have ever read. My highest praise for Mr. Schell. I cannot wait to read what next springs forth from his mind."}, {"userName": "Amanda", "userReviewDate": "Jun 26, 2009", "userURL": "http://www.goodreads.com/user/show/128673-amanda", "userReview": "I usually read more modern interpretations of Italian life and food (Frances Mayes, John Berendt), so Tomato Rhapsody did require a mental step back in time. Once I jumped back into this world before pasta sauce, it was easy to fall in love with the Tuscan village and it's interesting cast of characters. I was completely pulled into their daily life of market days and traditions like the testosterone and wine-fueled donkey race. The characters are easy to love or hate, and Schell's descriptive words bring to life the Cheese Maker, the Good Padre, and the young lovers. From a foodie standpoint this book includes some interesting and mouth-watering history such as Mari's experiments with olives and Davido's accidental creation of the first pane pizea. Just reading about Davido's naps among the tomato plants drove me to my garden to soak in the scent of the leaves. Though this book is centered around a love story, it's guaranteed to make you hungry as well.One thing I really loved was the author's intermingling of Italian words and phrases with English. Other writers feel the need to translate or explain each word, but Schell gives the reader more credit by assuming they can figure it out. It should be mentioned that this book contains a good amount of crude language and \"bawdy humor\" as the back cover notes. This might deter some, but I thought it added to the ironic comedy and irreverent feel of the story.Overall I really enjoyed this book. The writing style can be hard to get used to during the first chapter or two, but it pays off as the story moves to the villagers' poetic speeches and endearing traditions. Schell has many genius one-liners, and I found myself reading parts out loud to my husband because they were too good to keep quiet. When you read this book just make sure to have some tomatoes nearby; by the time you finish the story you'll want to make some bruschetta."}, {"userName": "Amanda", "userReviewDate": "Jul 14, 2011", "userURL": "http://www.goodreads.com/user/show/5793497-amanda", "userReview": "This is a terrible book. The only reason I finished reading it was because I had nothing else with me to read on a long bus ride. The author is an obvious snob who tries to show off how awesome he is through his writing, instead of actually writing a good story. He goes into needless side diatribes about the history of food, the amazingness of this recipe, and various theories on story-telling, and oh look! His story is obeying those rules perfectly! Not to mention the unnecessary and random use of Italian, predominantly used when it comes to words usually considered \"dirty\" in English. For instance, he says \"cazzone\" instead of \"penis.\" Then there's the fact that he's decided the peasants will speak in rhyme, mainly so he can show off his rhyming abilities. Yet the reader knows the characters are supposedly speaking in Italian, whereas the rhymes are in English! This maybe could be forgiven if he didn't insist on throwing around actual Italian all the time.Finally, and what really seals the deal for this being a terrible book, we have the main storyline. Star-crossed lovers Mari, a Catholic, and Davido, a Jew. Even in the very last chapter, I had zero feelings for either of them. I felt I barely knew them. If anything, I felt that Davido is a coward, and Mari deserved better.Don't waste your time reading this book. There are far better books about Italy out there, such as Under the Tuscan Sun."}, {"userName": "Denise", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/11876162-denise", "userReview": "Well, I'm a sucker for Italy, historical fiction, and cooking, and the \"forbidden fruit\" angle is cute, but the fact that the characters are supposed to be speaking in rhyme and the lines don't scan is so maddening that it distracts and detracts from the story."}, {"userName": "Suanne Laqueur", "userReviewDate": "Oct 31, 2014", "userURL": "http://www.goodreads.com/user/show/10273177-suanne-laqueur", "userReview": "I love love LOVE this book. That is all."}, {"userName": "Lori", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/3001665-lori", "userReview": "3.5 stars! This was a fun book that captures your heart and stomach!!"}, {"userName": "Kiera Healy", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/15289348-kiera-healy", "userReview": "So sometimes when I'm commuting, I have to hold my kindle close to my chest to make sure no one can glance over my shoulder and see what I'm reading. I had to with Tomato Rhapsody. About halfway through this frivolous light read, the most objectionable sentence in modern literature rears its head.\"One could not simply masturbate a donkey.\"Be warned: this novel contains a LOT of donkey penises. Like, personally, one donkey penis is too many. But donkey cocks are responsible for a couple of major scenes in Tomato Rhapsody. I guess it'll appeal to a certain niche.Generally, this is a light and fluffy read in the style of a Shakespearean comedy. At its heart is the story of the love between a Jewish boy and a Catholic girl in 16th century Tuscany. The love isn't very believable, but then again, neither is Shakespeare's. Meanwhile, the boy's grandfather is responsible for bringing the first tomatoes to Italy, and everyone fears eating them in case they have some devious Hebrew magic involved. And there's an undercover count and his long-lost cousin, and a mysterious new priest, and a village idiot who's being abused by the evil olive oil shop owner, and a few randomly thrown-in recipes, and of course, a whole mess of donkey penises (not sure what the collective noun for donkey penises is).Some words appear in Italian, but that's just for flavour. A lot of those words are \"cock\". The villagers are rimaticos, which means they speak in rhyme. I found that a little tiresome, because it's jarring when it happens and jarring when it stops, and sometimes there's meter and sometimes there isn't and...well, it got messy for me.To be honest, I wasn't really enraptured by Tomato Rhapsody. The characters aren't very likeable or believable, so I wasn't invested in any of them. The story is, for the most part, quite charmingly told, but it's slight, and you know it's going to culminate in a big happy ending. It took me a while to get through, simply because I was never truly excited about reading on. It's not bad, it's just not quite good enough at what it does."}, {"userName": "Signora ", "userReviewDate": "Sep 10, 2009", "userURL": "http://www.goodreads.com/user/show/778740-signora", "userReview": "I just finished reading a delightful new book: \"Tomato Rhapsody\" by Adam Schell. It is quite unique...part fable, part history, part Shakespearean opera, part comedy, part romance. It is a work of fiction and is set in Tuscany in the 16th century. The plot is built on the historical information regarding the introduction of the tomato to Italy by the Spanish who brought it from the New World. In this particular case, the Spanish was a Spanish Jew who survived the Inquisition in Spain by traveling with Columbus on a later trip to the New World and ending up in Italy with the tomato, the \"Pomo di Amore\".The story reads like a fable with a third party narrator keeping you apprised of what is going on from behind the scenes. What I found most interesting were the historical tidbits that the author worked into the story...things I did not know about peasantry in the 16th century...most significantly, the use of the language: \"Etruscanato Antiquato...(which the author claims is) an early-Italian dialect that evolved in Tuscany in the centuries after the ancient Etruscan were conquered by Rome. It is largely a rhyming idiom. Linguists and anthropologists theorized that rhyming language developed as a means to facilitate memorization before the emergence and widespread understanding of the written language.\" So in the novel, much of the dialogue is written in this rhyming format and has a Shakespearean feel to it. Italian words and phrases are used throughout and the bawdy humor is fantastic! The ability to understand the Italian idioms made my enjoyment more pronounced! The cast of characters are bigger than life and I was quickly drawn in to the various personalities and stereotypes. You will recognize them!"}, {"userName": "Scott", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/11108173-scott", "userReview": "Adam Schell's comic novel, \"Tomato Rhapsody,\" is an original paean to the Shakespearean comedy - the entire novel sings with the same gusto as Kenneth Branagh's film adaptation of \"Much Ado About Nothing.\" The sun-kissed hill-sides of Tuscany is the perfect setting for tales of comic, romantic silliness.Schell's novel revolves around the introduction of the tomato to Europe, but involves much more than that. Starting with a hilarious opening scene involving a braying donkey and its tremendous \"endowment,\" \"TR\" also tells the story of young romantic love. Davido, a young Ebreo farmer, is smitten by the thunderbolt of love when he sees Mari, a gorgeous Catholic olive farmer - and she is equally infatuated with him. But not only is the whole Jewish-Catholic conflict at issue: Davido has done something far more sinister - he wants to sell tomatoes.Or, as the provincial hayseeds believe, the sinister Ebreo wants to poison their community by selling them \"Love Apples,\" as they call tomatoes, which were the fruit Satan used to tempt Eve.Schell keeps this timeless love story alive by creating a dizzying cast of charming characters, from the otherworldly Good Priest to a dastardly villain to the ruler of Tuscany who decides to abandon his throne for a life of anonymous farming. All the Shakespearean tools are here - mistaken identities, murder, set-ups, betrayal, and comic genius. Building to a wonderful scene involving the feast for the Drunken Saint, \"TR\" waxes poetic with the rapture of delicious food and even more-delicious love.This novel is a true delight, and I'd love to see it adapted into a movie. It would be one of the great \"food movies,\" right up there with \"Eat Drink Man Woman\" and \"Like Water for Chocolate.\""}, {"userName": "Bernadine Wilsenach", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/17432320-bernadine-wilsenach", "userReview": "I adore this story for many reasons but three I will share:1. I avoid romances, do not enjoy 'em, so I was glad to learn the difference between a love story and a romance. In a love story, the lovers are kept from one another by their pride or misunderstandings and later realise their love and so it is predisposed to comedy. In a romance, the lovers recognise their love immediately but are separated by religion or society and so it is predisposed to tragedy. 2. I am an avid collector of anecdotes relating to the origins of the adage 'to knock on wood' for good luck. So, I was amused to read that a fresh truffle can be so delightful as to cause the sudden tenting of trousers. Leading Tuscans to believe it originated with ancient truffle hunters who equated good fortune with truffle inspired 'bastone' knocking against wooden tables.3. As a child, I remember my Dad telling me that he grew up eating a lot of tomatoes because he was poor but also because it was all his Dad knew how to cook (my Dad's mum died when he was very young). Whenever my mum was in hospital my Dad would always make us a tomato chutney. When I got married all I could make was tomato chutney. I pour my heart into every batch. So it is with absolutely sincerity that I can tell you that the tomato is, for me, pure rhapsody."}, {"userName": "Bob H", "userReviewDate": "Nov 14, 2012", "userURL": "http://www.goodreads.com/user/show/11254805-bob-h", "userReview": "A rousing and unforgettable fable of how the tomato came to 16th Century Italy, to a Tuscan village in which it complicated the lives of the villagers, Hebrew and Christian, noble and peasant alike. It's bawdy, it's a story of star-crossed lovers, a story that stops here and there for recipes and cultural vignettes -- as if Chaucer and Shakespeare and Julia Child had stopped off in Tuscany to jointly write a parable.And it is a parable, of change coming to a place and time, heralded by the arrival of the new \"pomodoro\" and its resulting sauces. Fictional, perhaps, but it seems timeless, and it is certainly a splendid read.Highest recommendation."}, {"userName": "Heather Miller", "userReviewDate": "May 22, 2011", "userURL": "http://www.goodreads.com/user/show/2659161-heather-miller", "userReview": "This book was absolutely incredible! I would put it in my top ten books of all time. It was that good. It was a beautiful mix of romance, history, fiction, religion, poetry, and humor. I loved how all of the villagers spoke in verse. It was very Shakespearean. I found myself engrossed in the story and wanting to eat Italian food, make love in a vat of tomatoes (I probably shouldn't admit that), and bite into a ripe tomato. I hope Schell keeps writing because I've already recommended this book to so many people and hope to read more of his stuff."}, {"userName": "Nidhi Jakhar", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/48261462-nidhi-jakhar", "userReview": "Loved the book for all the images of delicious tomatoes, olives, red wine, sauces, figs it evoked. I could feel my mouth fill with juices ;) Always a pleasure to read about old Italy n quaint Tuscany in this one..the rhyming too did leave me inspired :)"}, {"userName": "Paul Burger", "userReviewDate": "May 12, 2009", "userURL": "http://www.goodreads.com/user/show/2310324-paul-burger", "userReview": "a fun quick read - interesting, wimsical, a page turner"}, {"userName": "Sherry H", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/4323836-sherry-h", "userReview": "Well!This definitely felt like a fable in its telling - but it's a BAWDY fable.The story revolves around the introduction of the tomato, by Italian Jews, to Italy - or more specifically, to a group of eccentric Catholic townspeople. The townspeople are wary of their  Ebreo neighbors, and warier still of the love apples they offer.It's a story of forbidden fruit and forbidden love, secrets and schemes, a wicked stepfather and a delightful Good Padre, disguises and truths laid bare. Best of all, it's a story of olives and cheese and bread and salt and olive oil and basil and, of course, tomatoes.It focused quite a bit on the impressive cazzone of a particular donkey.I found some of it delightful and some painfully overdone. It was hard to read for long stretches - just too many WORDS. I do love a good, heartwarming, Catholic confession scene, and this one delivered beautifully there. In the end, I'm glad I read it.Anti-bawdy friends, beware."}, {"userName": "Gloria Bernal", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/1066448-gloria-bernal", "userReview": "This is a fable, as the description indicates. That has to be kept in mind, as it is not like anything I've ever read before and I read constantly. One doesn't know what to believe could really be true. The author received his degree in Creative Writing in college, and creative it is. It is the story of how the tomato came to \"be\" in Italy in the 15th century. This was our book club selection of the month or I personally would never have picked it up, and admittedly struggled with the writing style, especially in the first half. I did enjoy the rhyming conversations though, as I am a fan of limericks. By the second half I was more used to it and the odd characters. I did find it a bit crude in some parts, but I did see the humor in many other parts of it, especially toward the end which featured the \"sex\" sauce. You have to read it to know what that means, but in our book club discussion we did openly chuckle when discussing some of the situations we witnessed in this weird novel."}, {"userName": "Geoff Wooldridge", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/34421802-geoff-wooldridge", "userReview": "This is a strangely written tale of medieval Tuscany and the 'almost true' version of the introduction of the humble but ubiquitous tomato into Italian culture.In fact, food plays a prominent role in this bawdy tale of love, lust and forbidden fruit. Olives, cheese, pizzas, truffles and other gastronomic delights (in addition to tomatoes) feature throughout the story and underpin most of the activities of the village characters.The writing is frequently bawdy, not in a crude way, but more in the style of Shakespeare of Chaucer, with frequent references to appendages, genitalia and acts of romance. It is written in a manner that adds to the humour of the tale.Although this was a bit of fun and the story had plenty of enjoyable and colourful moments, I found it to be just a bit too corny, and was put off by the author's tendency to insert various asides directed at the reader to almost explain his story.OK, but not one I would highly recommend."}, {"userName": "Katie", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/62029738-katie", "userReview": "Like all good Italian operas, there is love, loss, sadness and laughter. I will never eat tomato sauce or a pizza again without thinking of the characters in this story. It is a love story, foremost, and the history (in the loosest of terms) of tomatoes in Italy. There is religion involved, as any good Italian folktale has - both Jewish & Catholic. And this is a story written to tell over and over again. If someone, after too much red wine, started to tell me this story - I would sit and listen and be enthralled and waiting for the next tomato to be thrown or olive oil to be spilled. What a fun book.\"And they laughed because those things that all decent people adore - love, justice, olives, tomatoes, and a happy ending - had won the day, and these were things worth laughing over.\""}, {"userName": "Maryann Ns", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/31902532-maryann-ns", "userReview": "The blurb at the top of this page says it well - no hyperbole for once.I loved this book and have been telling others about it. It helps that I have been to Tuscany several times. The spirit of the villagers rings true. This is funny and the word play and language are fantastic as is the framing device of the book on how to write plays. While enjoying a fun read you can learn some things about this time period in Tuscany."}, {"userName": "Lisa", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/74025868-lisa", "userReview": "This is an enchanting fable of how the tomato came to Italy, told with wit, humor, and Shakespeare-like rhymes. I was hooked immediately and drawn in to the 16th century Tuscan village. The peppering of Italian throughout, had me feeling like I could speak the language by the end! There is a love story at the center, but love extends universally through family, friends and religion. I'll definitely read it again!"}, {"userName": "Leanne Van", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/54307195-leanne-van", "userReview": "Eating and reading- my two favourite pastimes rolled into one fantastic romp! Love the style of this story. Gives me a new appreciation for Shakespeare. But this is not your high school required reading of Romeo and Juliette. This has more of a Fried Green Tomatoes flavour. Will recommend this novel to other fellow foody- bookworms for certain!"}, {"userName": "David", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/62700641-david", "userReview": "Pleasantly odd book. Very quirky. Very feel good. It feels like it was written by someone with a cool voice and real talent, but in need of a bit of training, practice, or a better editor. But definitely an enjoyable read."}, {"userName": "Pamoliverio", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/55945715-pamoliverio", "userReview": "The title says it all- A fable of Love, lust & forbidden fruit. Or the tale of the love apple, Tuscany, & laughter. I really enjoyed the story, set in Tuscany in all its glory. Why do I rhyme, just read this sublime and unusual story."}, {"userName": "Anca", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/30701841-anca", "userReview": "Exceptionally beautiful! I am not quite sure why I picked up this book- it proved to be a wonderful surprise. A story about so many things, with so many facets and readable in many keys. A book I thoroughly enjoyed, flowing like heavy honey. An author to keep an eye on."}], "description": "A village in Tuscany is the setting for this joyous debut—a novel that defies all our expectations as it puts a fresh, clever, captivating spin on the age-old tale of forbidden love. Rich in literary delights, filled with spectacular wordplay, and rife with the bawdy humor of Shakespeare’s comedies, Tomato Rhapsody is the almost-true tale of how the tomato came to Italy—at once a brilliantly inventive fable of love, lust, and longing, and a dazzling feast for the imagination.This is a story born from love—a forbidden love—between Davido, an Ebreo tomato farmer, and Mari, a beautiful Catholic girl.…But it’s not only Davido and Mari who have secrets of the heart. Everyone around them yearns for something—from Davido’s grandfather, who tenderly cultivates the tomato plant he stole on his voyages with Columbus, to Mari’s villainous stepfather, whose eye is trained on his stepdaughter’s virginity and his neighbor’s land.Caught in the midst of these passions and machinations is a village full of eccentrics who speak in rhyme, celebrate the Feast of the Drunken Saint, and live a life untouched by the passage of time. The schemes and dreams of these men and women are about to change as what is forbidden becomes too delicious to resist. Tradition, religion, and good taste collide unforgettably in a story about the courage to pursue love and tomato sauce at all costs.", "title": "Tomato Rhapsody: A Fable of Love, Lust & Forbidden Fruit", "url": "https://www.goodreads.com/book/show/6090444-tomato-rhapsody", "average": 3.74, "cover": "https://images.gr-assets.com/books/1320422913l/6090444.jpg", "reviews": 160, "authors": [{"url": "https://www.goodreads.com/author/show/2780038.Adam_Schell", "name": "Adam Schell"}], "type": ["Fiction", "Historical", "Cultural", "Food and Drink", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/6090444-tomato-rhapsody", "http://www.goodreads.com/book/show/6549269-tomato-rhapsody", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}