{"ratings": 516, "userreviews": [{"userName": "Mauoijenn ~ *Mouthy Jenn* ~", "userReviewDate": "Feb 03, 2015", "userURL": "http://www.goodreads.com/user/show/2569271-mauoijenn-mouthy-jenn", "userReview": "We have all heard one in our day, but this book is packed to the brim with some outrageous stories. Are they true, a dream perhaps or just a delusion of a madman. Loved reading these and duscovering many new ones."}, {"userName": "David - proud Gleeman in Branwen's adventuring party", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/10923016-david---proud-gleeman-in-branwen-s-adventuring-party", "userReview": "A great collection of stories that we all heard happened \"to a friend of someone we know\" (funny how none of these accounts are ever first-hand)! Multiple topics are covered, and I was astonished at how many I had once heard being told as being true (for example, a teacher once told the \"vacationer who takes in what she thinks is a stray Chihuahua\" story).The only caveat is that Brunvand's writing style can be a little dry at time, but still, the compelling source material makes this a fun read!"}, {"userName": "Paul", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/10051523-paul", "userReview": "Although this book is more of an intellectual study rather than simply a volume of tall tales, Brunvand’s compilation still makes for an interesting read. These urban legends are tall tales which could have occurred easily within our society. Often, Brunvand tries to get to the bottom of the story by tracing it to its source; although often with little success. It’s obvious that many of the stories have had their facts changed too many times for the entertainment value; and there are some things that you simply wouldn’t do. For instance; if it was your birthday would you really abandon you’re your car to walk several miles home? At the end of the volume; Brunvand also fails to reach a conclusion at the end of the volume, instead decides to list parodies of some of the urban legends that he’s just investigated; illustrating how gullible some people can be. It just goes to show that the truth does not stand in the way of a good story, which makes it too good to be true!"}, {"userName": "Sara", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/32972063-sara", "userReview": "Es un libro que tardé en leer y en el que tenía una idea en mente y me conseguí con algo completamente distinto.Todos conocemos muchas historias que parecen demasiado buenas para ser verdad, otras que son tan absurdas que es raro que alguien las crea y otras que parecen sacadas del día a día. Todas ellas, son consideradas de alguna forma leyendas urbanas, esas que han contado tanto que hay muchas versiones o se remontan a muchísimo tiempo atrás.En este libro, el autor se encargó de seleccionar y clasificar las muchísimas leyendas urbanas que por años ha investigado; teniendo una idea errónea de ellas debido a la película con el mismo título, me conseguí con un libro que es realmente interesante. Contiene una gran cantidad de información de cada leyenda, sus variaciones y que, al ser divididas por capítulos, poseen una genial introducción a cada clasificación dada por el autor.Muchas son más hacia lo cómico que lo escalofriante y muchas muestran que la naturaleza humana influye muchísimo en los casos relatados.Creo que lo que hizo que no disfrutara tanto del libro como quería, fue el hecho de que, al colocar las variantes de una misma leyenda, se volviera algo tedioso y más si le agregas el hecho de que luego se explica detalladamente la investigación, cómo llegaron a conseguirla, etc, etc.Otro punto que fue arma de doble filo, es el estilo de la escritura, el autor al tratar de mantener el estilo de cada tipo de reproducción de las leyendas (e-mails, artículos, folletos, entre otros) y la falta de separación evidente entre las versiones, hace que la lectura sea un poco confusa y que la lectura sea más lenta de lo habitual.Le doy un 3.5/5 y lo recomiendo para aquellos que quieran reír un rato o conocer algunas de las historias que tienen muchos años recorriendo el mundo. Quizá se consigan con que ya conocen alguna..."}, {"userName": "Russell", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/62490030-russell", "userReview": "This book was alright. Some of the urban legends were interesting and some were really eerie. Others seemed repetitive which I realize is an indicator that it’s an urban legend but nonetheless made it dull at times."}, {"userName": "Iophil", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/4543364-iophil", "userReview": "Le leggende metropolitane sono sempre state una mia passione e ogni tanto mi fa piacere riaffrontare questa curiosa dimostrazione della \"malata\" creatività umana. :PIn questo volume, accanto ai grandi classici del genere, troviamo aneddoti meno conosciuti, ma non meno affascinanti. Le storie sono suddivise per argomento e corredate da presentazioni e tentativi di arrivare all'origine di ogni singola leggenda."}, {"userName": "Susanne", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/33044969-susanne", "userReview": "Loads of urban legends and their origin stories. It's like an encyclopedia of urban legends. No one can resist picking up this book and flipping through it. Unfortunately some sections are inappropriate for MS and under so I won't be adding this to the school library."}, {"userName": "Lisa", "userReviewDate": "Dec 26, 2013", "userURL": "http://www.goodreads.com/user/show/1512868-lisa", "userReview": "My introduction to urban legends came early, and at the hands of my auntie. When I was a kid, my brother and I would spend the latter half of the week at our grandparents and, while they did their weekly food shop, we’d be left under the charge of Auntie Lisa, who’d soon have us squealing and our hair standing on end as she told us about The Dead Roommate, the Maniac on the Car Roof, The Call From INSIDE The House, and The Licked Hand (these are the first I remember hearing, along with one about an old woman who comes to the door and you notice she has a missing finger….I can’t remember the rest of the story, but I can remember nearly hitting the ceiling whenever Lisa would get to the end and screech “YOU DID IT!” and lunge for us. Got us Every.Damn.Time.) I’m now looking forward to my own niece and nephew becoming old enough for me to scare the bejeesus out of, and this book should be a good source for me to mine.A compilation of all of the urban legends you’ve heard (plus many more) ranging from the comic to the horrifying, from the old to the new (including all those warnings about gang initiations, petrol stations and checking the back-seat of your car that people are always sharing on Facebook), Brunvand’s writing style is a little irritating at times, especially whenever referring you to the ten thousand other books he’s apparently written on urban legends, but not enough to detract from the legends themselves."}, {"userName": "Monica", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/23898584-monica", "userReview": "Una completísima recopilación, extraídas de cartas recibidas por el autor a través de una columna de periódico, de las más famosas leyendas urbanas como el jinete sin cabeza, la planta con bichos carnívoros, el asesino que está en el asiento de atrás del coche, la autoestopista fantasma..etc y sus diferentes variaciones dependiendo del país de origen.Un buen libro, sin duda, para refrescar aquellas fantásticas a la par que terribles historias que hemos escuchado, y para conocer nuevas.Entre mis favoritas:El cerebro desparramadoLa mascota mexicanaLa mano lamidaEl testamentoEl garfioConductores decapitadosEl asesino del asiento de atrásLa muerte del novioEl cerdo de la carreteraMary sida y harry sidaEl autoestopista desaparecidoPor citar algunas. Todas las historias están separadas por temática como por ejemplo: cuentos clásicos caninos, automanía ( uno de los mejores), aventuras sexuales y su merecido, entre otras.Lo recomiendo a todo el mundo que quiera pasar un rato entretenido y quien sabe, pasar un poco de miedo leyendo unas muy imaginativas historias..reales??"}, {"userName": "Pj", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/10337912-pj", "userReview": "This is perhaps the most comprehensive of Brunvand's work. Although, I wish it were as analytical as some of his others. He writes interesting books about those stories we are all \"sure\" are \"true\" and exposing them as legends. He also does a fantastic job of expaling what makes an Urban Legend an Urban Legend as opposed to just a rumor or a piece of gossip. Brunvand is also careful to explain and explore situations where the legends have truth to and in them (for example, the idea that people posion halloween candy was around long before there was a case invoving tainted candy - and even then the murderer knew the victims and did not act randomly, relying on the legend to cover his tracks). Buy this one as a handy refrence, but read the others (he also rarely doubles back on legends in the others without a reason to do so or without acknowleding that he's done this before and providing refrence points)."}, {"userName": "Andrew", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/800291-andrew", "userReview": "Second only to the Darwin Awards I think urban legends are some of the best and most misquoted stories of exaggeration and impossibility in current oral circulation. Don't get me wrong I am sure we all have a personal story we are adamant is true to the point of blindly arguing their truth if they are questioned BUT you have to admit their sheer impossibility (or in some cases disturbing ease) makes them so appealing. And this book has them all - from pop culture (I have seen them referenced in films and in new broadcasts) to variations told by family members they are the modern Aesop's fables, Baron Munchausen's tall tales and new entries in Edwards Lears book of nonsense - but we can all see their roots in truth and in more than one case I am sure have come close to becoming our own urban legend."}, {"userName": "Richard Martin", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/18786509-richard-martin", "userReview": "In 24 chapters and 539 pages ( thus, \"colossal\"), Jan Brunvand presents a cornucopia of urban legends (UL's). Each chapter starts with an overview of the subject being covered. For clarity, the UL's are in one text font and the background is in another. The background consists of how the UL's were obtained and cites sources. This is not a book to be read in one sitting; I.e., a typical \"bathroom reader.\" To do so would be overwhelming and the book, in my mind, would become tedious. I simply opened the book to a random place and read that chapter. Two or three were adequate for one session."}, {"userName": "Taylor Mullane", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/13174753-taylor-mullane", "userReview": "I loved this folktale book. I could not stop reading all the different stories. They all had endings that just made me laugh or I was lefted amazed.I liked how many different sections this book had. There were sections for all different types of topics, it was fun reading all the types. It is hard for me to say one thing I did not like about this book, but if I could say one thing it would be how large this book was. There was almost too many stories. This book would be useful for a teacher reading folktales to students."}, {"userName": "Rose", "userReviewDate": "Jan 28, 2015", "userURL": "http://www.goodreads.com/user/show/22851642-rose", "userReview": "This is the motherlode of urban legends with each one given a look into its history and the possibility of its being real (surprisingly there are a few). I'm sure you, like me, will find several that you believed. Note that I read the 2014 edition which, although not labeled as updated, in fact has quite a few references to things and reports that were subsequent to the last paperback edition in 2001. I tried to enter the new edition on goodreads website, but site would not allow."}, {"userName": "Maya", "userReviewDate": "Sep 13, 2009", "userURL": "http://www.goodreads.com/user/show/2723427-maya", "userReview": "i havent read all of it but i went through most of the legends it was very interseting to see some new stories and look over the ones i already knew my favourite one is the babysitting one or the one where the guy is in the backseat im not fond of the ones like the alligator in the sewers or the choking doberman or the spiders in the hair i love ones that have more of a creepy atmosphere but ya i really enjoyed most of the stories great buy"}, {"userName": "Lydiajett", "userReviewDate": "Mar 16, 2008", "userURL": "http://www.goodreads.com/user/show/992857-lydiajett", "userReview": "This is great!!! This is a collection of all your favorite Urban Myths - from alligators in the toilet to the crazy guy with the hook for a hand. These are the tales we grew up on. I highly recommend it. Especially to those of you who constantly pass on those emails that are loaded with some of these stories - check it out, you might be surprised just what \"myths\" you have been exposed to."}, {"userName": "Jennifer Daniel", "userReviewDate": "Oct 31, 2008", "userURL": "http://www.goodreads.com/user/show/1650869-jennifer-daniel", "userReview": "I like how the author tried to find the root of many urban legends. He would interview some one who allegedly saw the actual event only to be told it was in fact thier cousin's, neighbor's mail man who they got the story from. It was interesting how old some of these legends were, only having small details tweaked to make them current."}, {"userName": "Chelsea", "userReviewDate": "Jul 22, 2008", "userURL": "http://www.goodreads.com/user/show/603687-chelsea", "userReview": "This book was fun if you like reading about stories that you've totally heard and thought were true because you are a gullible sucker like myself. My only problem with it is that it is huge, so about a third of the way through I started getting a little antsy and just jumped around looking for specific stories. It's a good bathroom book. :)"}, {"userName": "Bunny", "userReviewDate": "Jun 13, 2009", "userURL": "http://www.goodreads.com/user/show/1519823-bunny", "userReview": "Super fun, easy read. Read some Urban Legends I know and love, some I'd never heard, and some that I truly thought were just jokes or classic scary stories, but apparently people actually think they're true? Craziness.Also, all of the earwigs in the brain, spiders in the hair, and cats in the microwave seriously creeped me out.Very good read."}, {"userName": "John", "userReviewDate": "Mar 18, 2011", "userURL": "http://www.goodreads.com/user/show/5146488-john", "userReview": "Hilarious - laughed so hard I almost had an athsma attack! The Hare Drier story is the best urban legend - ever! I realized one of the hoax warnings from this book was used on my school district once. We had a note sent home to our parents about stamps with acid or pcp on them in the form of superheroes and buggs bunny characters. Yup - total hoax."}, {"userName": "Gerardo Lozano", "userReviewDate": "Jan 30, 2016", "userURL": "http://www.goodreads.com/user/show/16215481-gerardo-lozano", "userReview": "El primero del año.Es entretenido como es que algunas leyendas urbanas traspasan fronteras, yo recuerdo la leyenda de la chica que se embadurna de crema de maní y su perro le lame mientras un oculto Ricky Martin la observa horrorizado junto con los espectadores de un programa de cumplir sueños jaja, la escuché cuando estaba en la secundaria. Buen libro."}, {"userName": "Callie", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/14490313-callie", "userReview": "This book has got a ton of stories that you hear at Slumber parties and from a \" friend of a friend\". Some of them are um, questionable but still a great read.Half the stories I actually had thought were true and had happened to people I know!"}, {"userName": "Bill FromPA", "userReviewDate": "Nov 23, 2014", "userURL": "http://www.goodreads.com/user/show/6370216-bill-frompa", "userReview": "Compiled from oral and written sources, with commentary and cartoons, this is a comprehensive compendium of urban legends from the 2nd half of the 20th century. If it happened to your sister's co-worker's friend's cousin, it's probably in this book."}, {"userName": "Pete Williams", "userReviewDate": "Nov 30, 2007", "userURL": "http://www.goodreads.com/user/show/602220-pete-williams", "userReview": "I've had other books that explore the material, but this one has a chance at being a favorite because it doesn't let the editorializing interfere with the stories. They are worded very matter-of-factly (\"This happened... and then this happened.\"). Like it."}, {"userName": "Melanti", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/3034846-melanti", "userReview": "It's surprising ow many of these legends I've already heard through various sources - Snopes.com, The Darwin Awards, Mythbusters, Horror/Ghost story anthologies, etc.There was actually very little that was completely new, and most were just small variations on other tales."}, {"userName": "Lori S.", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/2466314-lori-s", "userReview": "Fun stuff for the most part, though it should be taken in small swaths to both savor and enjoy and to absorb all the myriad ways humans can tell each other the most amazing not quite truths, not quite lies."}, {"userName": "Jenn", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/5704379-jenn", "userReview": "very interesting book. throwback to my childhood obsession with urban legends and all things that go bump in the night."}, {"userName": "Jenna Gall", "userReviewDate": "Sep 12, 2007", "userURL": "http://www.goodreads.com/user/show/375052-jenna-gall", "userReview": "The book was interesting on where the stories came from and how many generations have been telling the same stories to get across a certain moral."}, {"userName": "Kaethe", "userReviewDate": "Jul 09, 2014", "userURL": "http://www.goodreads.com/user/show/1072582-kaethe", "userReview": "Just the thing if you enjoy urban legends. It is really colossal. It's hard to imagine that anything got left out."}, {"userName": "Sue Potter", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/15728738-sue-potter", "userReview": "A fun and funny read. Well worth finding a copy!"}], "description": "A fabulously entertaining book from the ultimate authority on \"urban legends\"--alligators in the sewers; the world's most expensive chocolate chip cookie recipe, etc.--those unbelievable tales that always happen to a \"friend of a friend.\" Illustrations.", "title": "Too Good to Be True: The Colossal Book of Urban Legends", "url": "http://www.goodreads.com/book/show/2015043.Too_Good_to_Be_True", "average": 3.81, "cover": "https://images.gr-assets.com/books/1442458907l/2015043.jpg", "reviews": 48, "authors": [{"url": "https://www.goodreads.com/author/show/23043.Jan_Harold_Brunvand", "name": "Jan Harold Brunvand"}], "type": ["Nonfiction", "Folklore", "Folklore", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/2015043.Too_Good_to_Be_True", "http://www.goodreads.com/book/show/296504.Too_Good_to_Be_True", "http://www.goodreads.com/book/show/10093848-too-good-to-be-true", "http://www.goodreads.com/book/show/296470.El_Fabuloso_Libro_De_Las_Leyendas_Urbanas", "http://www.goodreads.com/book/show/21861081-sar-vero-leggende-metropolitane-di-tutto-il-mondo", "http://www.goodreads.com/book/show/296469.Too_Good_to_Be_True", "http://www.goodreads.com/book/show/1250834.El_Fabuloso_Libro_de_las_Leyendas_Urbanas", "http://www.goodreads.com/book/show/20663735-too-good-to-be-true", "http://www.goodreads.com/book/show/10818003-too-good-to-be-true", "http://www.goodreads.com/book/show/25122159-too-good-to-be-true", "http://www.goodreads.com/book/show/16043014-too-good-to-be-true", "http://www.goodreads.com/book/show/40957.The_Vanishing_Hitchhiker", "http://www.goodreads.com/book/show/296558.Encyclopedia_of_Urban_Legends", "http://www.goodreads.com/book/show/843009.The_Choking_Doberman", "http://www.goodreads.com/book/show/723932.Be_Afraid_Be_Very_Afraid", "http://www.goodreads.com/book/show/843010.Curses_Broiled_Again_"]}