{"ratings": 831, "userreviews": [{"userName": "Kandice", "userReviewDate": "Nov 30, 2009", "userURL": "http://www.goodreads.com/user/show/1396160-kandice", "userReview": "It actually pains me to give this book 3 stars. Seriously. This is a continuation of Carmine Delmonico's crime fighting adventures, or whatever you want to call them. We met Delmonico in On, Off. This one starts with 12 muder/deaths on one day in a relatively small college city. They seem unrelated, but...are they?The plot was vintage McCullough. It started out with a bang, shocking me into realizing this wouldn't be a calm who-dunnit, but the actual turns of phrase fell short of her usual genius. I know she's been very ill, and I want to think that's the problem with this book, at the same time, I didn't feel On, Off really lived up to her name on the front, so maybe it's Delmonico.In a relatively short book she managed to fit in the above mentioned, 12 murders, plus 2 more and a suicide, rape, necrophilia, child neglect, espionage, political intrigue AND glimpses into the private lives of Delmonico and his team. I couldn't help but feel the entire book would have been improved by about 200 pages more. She's not a flowery describer, but she usually eases us into lives. In this one, I felt she tossed a few details around here and there, no build up, no let down, and the end...whimper instead of bang. She did tell us, in Delmonico's voice that's how crime solving generally ends. You investigate, run around, research, stress, find the killer...and then must wait for a trial that's out of your hands. Maybe that's what she was trying to get across, I just wanted more satisfaction.It seems as if she's going to be devoting some time to this series. If so, I am more than willing to wait for the next installment. I'd prefer the wait for a pure McCullough, than another installment with the clumsy feel this one had. All the more disapointing because the plot was first rate. She was capable of the perfect book using the bones of the story we got...alas."}, {"userName": "Ruth", "userReviewDate": "May 16, 2010", "userURL": "http://www.goodreads.com/user/show/1832562-ruth", "userReview": "Alternate title could be Too Many Characters … and I don't really like a one of them thus far.OK. Finished it. Well, I sort of skimmed through the last few pages. Must try and remember to not read anymore McCullough mysteries ~ one of us doesn't satisfy the other."}, {"userName": "Rebecca McNutt", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Too Many Murders was a great book, a murder mystery featuring heavy, thought-provoking topis such as the Cold War and the possibility of a nuclear disaster."}, {"userName": "Gary Branson", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/4689004-gary-branson", "userReview": "I liked the police part of the book, the mystery itself was a bit too much at the beginning with “too many murders.” Delmonico is a great character as are a couple of the side characters. Good conclusion, not as creepy as On, Off. Recommended."}, {"userName": "Lucimar", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/8552472-lucimar", "userReview": "Uma leitura impressionante e perturbadora, sobre os crimes que acontecem na cidadezinha de Holloman (Connecticut) que deixa a policia em polvorosa com os onze crimes, dos quais alguns foram cometidos com barbárie. Carmine e sua equipe lutam para decifrar as causas possíveis destes assassinatos. Porque esta mortes acontecerem numa mesma época, o que estava envolvido nesta incógnita? Que relações tinham essas pessoas em comum. E assim, penetrando no mundo de enredos e mentiras, o detetive tenta de todas formas descobrir o que estava por trás disso e do cabeça do Cornucopia? Apesar da multidão de personagens eram intensos e histórias macabras, a autora com sua mente sinistra conseguiu me prender e ficar imaginando como tudo aquilo se resolveria... E meio a isso, a cada personagem e enigma desvendado a história cresce cada vez mais, tornando incrível e surpreendente.Os diálogos são perfeitos, as ações me envolveram tanto que era como se eu adentrasse na pele de Carmine e ainda tentava imaginar o que se passava por trás de suas divagações. pela forma bonita dele se relacionar com a família. Em tempo: Personagem Delia, me lembrou demais a Pauley Perrette (Abby Sciuto-Especialista Forense de NCIS). E me pego pensando como a mente fabulosa da autora criou personagens sinistros que nos apavoram só em imaginar e que embora fictícios, sabemos que existem mentes tortuosas capaz de fazer essas maldades."}, {"userName": "Chris", "userReviewDate": "Jan 14, 2010", "userURL": "http://www.goodreads.com/user/show/2792520-chris", "userReview": "A murder mystery set in Hartford Connecticut among big business and an elite college in the 1960's. 11 murders in one day, but they are connected along with the Cold War. An intricate story of suspense and espionage.From the first reading of The Thornbirds, I was hooked on Colleen McCullough's work. Then, I discovered her series on Rome. Great historical fiction. But, the setting of this particular story does not jibe with the vocabulary used in the story. It is very British Empire. The main character is too feminine for the masculine role he holds in the story.Not the best of McCullough's work."}, {"userName": "Steph Bader", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/15164426-steph-bader", "userReview": "I really like McCullough's other books - especially the Rome series, but also the Australians. This one is set in the US in the late '60s in an exclusive college in Connecticut (read Yale). The subtext of anti-feminism and in fact the plethora of negative women characters completely overshadowed any interest I had in the plot. The main character detective is a gratuitous chauvinist and the entire work is peppered with anti-male, bra-burning, hysterical, totally negative portayals of strong women. I would give her a pass in the context of the historic times, but the book was written in 2009 so the choice of period and tenor was McCullough's and I found it offensive. I was very disappointed."}, {"userName": "Zoe Jussel", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/5793526-zoe-jussel", "userReview": "A very well written mystery with protagonists you can't help liking and admiring. It was a mystery clear to the finish, but also a deep involvement in relationships. Beautiful writing, intelligent writing and a flair for description and words."}, {"userName": "Deborah Pickstone", "userReviewDate": "Apr 25, 2016", "userURL": "http://www.goodreads.com/user/show/37849334-deborah-pickstone", "userReview": "Despite another rather bizarre plot this second book is a big improvement. I have ordered the third !"}, {"userName": "Michael crage", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/1830596-michael-crage", "userReview": "pretty good book. But a little too complicated with not enough explanation of what was supposedly going on"}, {"userName": "Laura", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/4445018-laura", "userReview": "I ended up liking it more then I thought. It started out slow, but picked up by time and in the end I couldn't put it down."}, {"userName": "Anna", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/80019875-anna", "userReview": "Could I just simply say, 'Wow!' I have discovered Colleen McCullough.The novel is a thoroughly enjoyable read. I didn't realise Too Many Murders is the second instalment in the Carmine Delmonico series until some point in the book, but it works well as a stand alone novel. The language style is fast-paced, intelligent and frank. It doesn't hinder on the gruesome details of murders, but focuses on finding who's done it - and there are plenty of suspects to go about guessing.I also liked that the novel doesn't overwhelm the reader with too many description of places or clothes, etc. Everything in the novel is to the point and every word/sentence is relevant to the plot - I didn't feel like or wanted to skip any paragraphs to keep me going.Everything from the opening line of the novel to the last sentence had me involved and I am very surprised that it hasn't been snatched for a film/TV adaptation. I will be definitely reading the rest of the series and other Colleen McCullough's works. I would recommend."}, {"userName": "Elizabeth", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/3682569-elizabeth", "userReview": "12 murders in one day in a college town of 150,000 is pushing the limits of believable. The methods of murder vary from shootings to poisonings, to death by a bear trap. Is Carmine Delmonico dealing with one murderer, or several? Did one person mastermind all the murders? And does a FBI investigation into espionage going on in a local armaments company have anything to do with the murders? I found it hard to keep all the victims straight, never mind how each died."}, {"userName": "Melissa", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/48591977-melissa", "userReview": "This book was difficult to read. Way too many characters. The middle part of the book was tolerable but did not compensate for the use of words that required a visit to the dictionary. If I could give this book less than 1 star, I would. It has turned me off from this author."}, {"userName": "Emily", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/175658-emily", "userReview": "3 1/2 Stars"}, {"userName": "Becci", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/4565969-becci", "userReview": "And they keep getting better.One thing with Colleen, she doesn't do characters - she does real people... and she does it really well."}, {"userName": "Penny Hoover", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/3465813-penny-hoover", "userReview": "Too much unneeded description--read like wading through a swamp....."}, {"userName": "Claire", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/74287628-claire", "userReview": "Not the best thriller I've ever read but also not the worst as I managed to finish it.Sometimes the storyline can drag on and this makes for difficult reading."}, {"userName": "Akhil Ramankutty", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/5961247-akhil-ramankutty", "userReview": "Hmm, well, I’m not very sure about this book. If you’re an avid reader, I think you may finish it without any regrets. But if you are one of those people, who could bear to read only the best of the best, I would not recommend this to you. Don’t know if it’s me or the author, but the writing’s a bit dull. I’m not saying that the circumstances were mediocre, which, on the contrary, were quite extraordinary if you ask me, but the descriptions of them, were. How else, would a crime-mystery novel be written, you would ask me. Well, I concede, an appropriate style of writing it was, then. There’s humour too, quite a lot after the first half, by which time, I think everything gets quite interesting. There’s a terribly funny incident in the book involving an “I could kiss you” moment. I just shut the book and laughed my lungs out. But the book is seriously censored in all aspects except the language. It’s conservative to the core, in terms of the description of events (to me of course, I don’t know what you’d think). I wish the writer dared to be more adventurous. This book definitely needs more spicing up, yes, of that, I’m sure. My favourite quote would be, “Colloquialisms are wonderful. They prove that English is a living language, always moving on. ”Another possible downfall, I say possible because some of you may see it as a plus point, is that we are not offered much insight into the officer’s thinking process, a consequence of being written in third person, I guess. It does help to build up the mystery, but sometimes, it’s a bit annoying when we’re left thinking ‘where’s he going with this’ or at other times, ‘where did that come from?’ But, on the whole, some things are better left unsaid, I guess.What I love about this book is that out of the blue, from a dreary read (debatable), the author just startles us with a play at our emotions, like the beautiful description of a baby on his father’s lap or the sensual feeling of a wife’s head resting on the arm while driving a car. I had never thought about such things and I’m glad that the author could give me such warm, personal experiences amidst such chaotic events.Truth be said, I’m not much impressed by the mystery, because of the sheer fact that most of the details leading to the conclusion were hidden from us (the nosy readers), thereby not allowing us to have a one on one with the protagonist. And the ones that were exposed gave subtle hints, but pointed fingers everywhere. On that I give points to the author for keeping us thoroughly confused, guessing and re-guessing. It’s a good read, not a great one mind you, but enough to give you three days of sleepless ‘clueing for looks’. Good Luck."}, {"userName": "Bertrand Brasil", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/12110438-bertrand-brasil", "userReview": "Provando mais uma vez ser uma mestre do suspense, Colleen McCullough, autora do best-seller Liga, desliga, volta com Assassinatos Demais, mais um thriller da Série Carmine Delmonico. Conseguirá o capitão solucionar não um, mas doze crimes ocorridos no mesmo dia?A história se passa no ano de 1967 e gira em torno da investigação da equipe do capitão Delmonico para resolver os vários crimes ocorridos em dezoito horas. Qual será a relação entre o assassinato de Dee-Dee Hall, uma prostituta local, e as mortes de uma criança deficiente e sua mãe? Qual será a ligação entre o estudante Evan Pugh e um importante empresário belicista? Além disso, como se os doze assassinatos não fossem o bastante, o oficial se vê frente a frente com o misterioso espião que passa os segredos da empresa de armamentos para os russos. Serão os assassinatos e a espionagem casos distintos ou estarão, de alguma forma, relacionados?Para quem gosta de um bom mistério, o livro será um deleite. Um personagem é assassinado por pancada na cabeça; outro, por envenenamento pelo clássico cianureto; outro, por estupro seguido por estrangulamento, e assim por diante.Assassinatos Demais é um thriller para ser lido na primeira oportunidade. O detetive protagonista é ótimo e perspicaz, com uma esposa apaixonada e inteligente; os subalternos participam ativamente, não sendo apenas apêndices dos protagonistas; a coerência da história é impressionante e o final, surpresa certa.É interessante notar que o livro tem mais de 400 páginas e, sem fazer uso de cenas de ação em excesso, mas com muito diálogo e análise das mentes criminosas, prende o leitor desde a primeira página. Perfeito para quem estava saudoso da leitura de um bom e velho mistério policial.“Você vai precisar de papel e caneta para acompanhar os assassinatos e as vítimas, e o final é eletrizante.” (Kirkus Reviews)“Colleen McCullough é mestre em escrever romances de época e comprova sua habilidade outra vez em Assassinatos Demais. Ela dá vida a seus personagens e retrata habilmente o período da Guerra Fria. Mas seu maior talento se mostra na forma como escreve sua trama, e Assassinatos Demais tem uma história viciante.” (Jay Strafford, Richmond Times-Dispatch)"}, {"userName": "Kim Tong Lim", "userReviewDate": "Feb 19, 2013", "userURL": "http://www.goodreads.com/user/show/17430303-kim-tong-lim", "userReview": "I read the hugely popular The Thorn Birds written by Colleen McCullough back in 1970s. Her name remains in my consciousness when I picked up this crime fiction in 2010. The title Too Many Murders was enticing for a read. I like mysteries and reading for clues in solving crimes.Colleen wasted no time in launching readers with the first murder of a nineteen year old university undergraduate in the first chapter. A vivid description of walking into a trap and the process of death of this student was laid bare for me to feel the chill down my spine.Colleen, a neuro-physiologist, wrote as if readers can take such details of murder. But then wouldn’t people like horror movies even they knew they might have nightmare after watching them? She brought realism to bear by describing the autopsy of the murdered victims.The undergraduate was not the only murder of that day. There were twelve murders on the same day and in the same city. The way each victim died was different and they were so unrelated to one another. Could it be pure coincidence that there were so many murders on the same day? Were these murders related and there was a singular motive behind them?As I read, I moved from one murder to another. I did not know there were so many ways to kill a person, from strychnine-in-the-orange-juice to bear trap and others. It was just too much gory details for one to stomach. Not anyone can take to this fiction and it can affect one with a faint-heart.I could feel the unknowns faced by the chief of detective as he proceeded with investigations. There were so many possible motives for these murders, but which one was closer to the truth? The motive was complex and there could be a link to espionage of leaking military secrets to the Russians. You cannot speed-read this fiction because you may miss the arguments and clues of each murder.All will be revealed only towards the end of the book. It was unexpected and beyond my imagination. However, the book ended with one paragraph that puzzled me. Maybe I should go back and read this book one more time and solve that lingering unknown."}, {"userName": "Sandie", "userReviewDate": "Jan 18, 2010", "userURL": "http://www.goodreads.com/user/show/1331967-sandie", "userReview": "One day, one town, twelve murders. And you thought that Pearl Harbor was the “Day that Will Live in Infamy”. The unusual conglomeration of victims include a child suffering from Downs Syndrome, a prostitute, a pre-med student, the wealthy CEO of a major R&D company, a college dean, a little old lady, three black caterers, etc. All have been dispatched by a range of methods ranging from poison and gunshot to drowning and strangulation to death by bear trap. Are these all singular, unrelated incidents or are they each just one piece of a larger more sinister plan hatched by one cunning mind? Set in 1967, long before the advent of many of the forensic tests we currently take for granted came into being, Police Captain Carmine Delmonico and his crack investigative team of Corey Marshall, Abe Goldberg and Delia Carstairs find themselves facing the huge challenge of connecting the dots to solve the murders. Complicating their investigation even further is the appearance of an FBI agent who reveals that one of the twelve victims is the head a company that works on secret government projects involving the development of defensive weapons and has been infiltrated by an agent of the USSR who has managed compromise company security and appropriate valuable information. (Are we all old enough to remember the Cold War??). The investigation proceeds with the plot becoming more and more thought provoking and convoluted. Who is the killer? Is there more than one? Are the murders and the security breach connected? Is the spy also the killer? There are a plethora of questions to be answered and suspects from which to choose and the reader is invited to join the investigative team and see if they can arrive at the answer before the police do. Although the storyline is truly impracticable it is, nevertheless, an entertaining diversion guaranteed to keep you reading."}, {"userName": "Estefânia Botelho", "userReviewDate": "Feb 03, 2011", "userURL": "http://www.goodreads.com/user/show/1833984-estef-nia-botelho", "userReview": "Razões da escolha do livro: Adorei o primeiro livro policial desta escritora, “Um Passo à Frente”, por isso tinha muita curiosidade em ler este livro.Proveniência: A minha biblioteca. A minha Opinião: “Um dia, uma cidade, doze homicídios…” é esta a premissa do livro que promete ser um grande livro policial (ou não fosse o primeiro livro desta escritora, “Um Passo à Frente”, um dos meus livros preferidos!).Mais uma vez, Delmonico vê-se confrontado com crimes violentos e assistimos ao desenrolar da investigação alternada com a descrição da vida desta e de outras personagens.O número de homicídios (12) ocorridos num único dia prende a atenção do leitor e este coloca a questão: serão crimes isolados ou relacionam-se uns com os outros?Contudo, nem tudo é o que parece e a trama adensa-se quando se descobre mais sobre o passado das vítimas…É um livro interessante, com sentido de humor, com uma forte ênfase dada ao factor psicológico. Todavia, não foi um livro que me cativou como aconteceu com ”Um passo à Frente”. Talvez tivesse grandes expectativas e ,afinal, o livro revelou-se banal!Mas devo referir que a escritora continua a distinguir-se pela mestria na descrição dos espaços e das personagens. O melhor: O sentido de humor, o detective Delmonico, o factor psicológico.O pior: Não ser tão bom como o primeiro livro. A Autora:De origem Australiana, Colleen McCullough começou sua carreira literária com a publicação de \"Tim\", seguido de \"Pássaros Feridos\", um best-seller internacional que bateu todos os recordes.A história de Roma Antiga é retratada de uma forma excepcional ao longo dos seis volumes que compõem a obra \"O Primeiro Homem de Roma\".Colleen McCullough é hoje uma das 100 pessoas designadas como Tesouros Nacionais Vivos da Austrália.Actualmente vive com o marido na Ilha de Norfolk, no Pacífico Sul.A minha classificação: 4 – Interessante.Período de Leitura: De 25 de Julho a 2 de Agosto de 2012."}, {"userName": "Alia Moustafa", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/15478659-alia-moustafa", "userReview": "Yet another McCullough novel feeds my appetite. After three years of reading the first book in the series (On, Off), I have finally proceeded with the rest.Twelve murders in one day! Espionage, spies, USSR and communism! Its 1967 and the good stuff is happening. Its all up to Captain Carmin Delmonico and Holloman PD to unravel these mysteries, while making the sudden mingling of the FBI their advantage.I really liked Too Many Murders, although I admit On, Off was better, in my opinion. But, still, McCullough's focus on detail and the unraveling of events wins over every time. What was really done well and what made me thirsty to read on was the unraveling of events and secrets. McCullough does it professionally in all her writing. The amount of suspense and surprises is unbelievable! I am always at shock and surprised all through out the book. The reader is given the chance to think about what is about to happen next and given the chance to make his/her own speculations. But, we are almost always at awe of what actually happens and what we find out in the end.The plot was well structured and organized, not giving way to any confusions. The ending, though, came as a shock to me. I had thought that Stravinsky was going to runaway and come back, maybe, in another book, but when Captain Delmonico confronts her and gives her a chance to leave without a fuss my doubt were put at rest. But, of course, BAM... That closing sentence caught me off guard.I am definitely eager to read the next book in the series."}, {"userName": "Tracie Stokka", "userReviewDate": "Nov 25, 2014", "userURL": "http://www.goodreads.com/user/show/15958330-tracie-stokka", "userReview": "I find little to object to in Colleen McCullough's police procedural mystery series set in the 1960's Cold War university town of Holloman, CT. CM is an aficionado of the genre, and it shows. Holloman is a pseudonym for New Haven, and Chubbs University is Yale, the school where McCullough taught neurology prior to becoming a best-selling author. As the moniker Chubbs suggests, CM finds her old employer and the politics of exalted academia worthy of good-natured but barbed disdain. As is often the case with me, I read the whole book in a sort of extended sitting over a day or so, and while I couldn't seem to release myself from its grasp, the book's embrace fell well short of seductive. Her love for and broad exposure to the genre and its convoluted plot twists is very apparent.  In fact, it may be what holds the book back. It's almost as though CM pauses as each plot knot unravels in order to give us time to congratulate her cleverness. This phenomena starts in the first chapter where a smarmy Chubb's sophomore is snapped in half by a steel bear trap that he springs in his dorm room closet while grabbing for the satisfying fruits of extortion, $100,000 carefully contained in Saran Wrap. Perhaps her historical fiction set in Ancient Rome is a better read because the author finds the subject more humbling."}, {"userName": "Andre", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/10454979-andre", "userReview": "A questão é que está cada vez mais difícil encontrar livro novo no estilo clássico. E quando isso ocorre, e ainda por cima a publicação é boa, é um deleite. Foi o que aconteceu comigo ao ler Assassinatos Demais, de Colleen McCullough. A história se passa no ano de 1967 e gira em torno da investigação da equipe do capitão Carmine Delmonico para solucionar não um, mas doze crimes ocorridos no mesmo dia. Para quem gosta de um bom mistério, será um banquete. Um é assassinado por pancada na cabeça, outro por envenenamento pelo clássico cianureto, outro por estupro seguido por estrangulamento e assim por diante.A todo momento o leitor tentará apontar um culpado, que logo será substituído por outro. Essa é a grande técnica de um livro policial: deixar o leitor sempre em dúvida do desfecho. Assassinatos Demais é um thriller para ser lido logo. O detetive protagonista é ótimo e perspicaz, com uma esposa apaixonada e inteligente; os subalternos participam ativamente da história, nao sendo apenas apêndices dos protagonistas; a coerência da história é incrível e o final, surpresa certa."}, {"userName": "Juanctoledo", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/8190821-juanctoledo", "userReview": "2do libro de esta autora que me tiene cautivado por esta nueva manera de honrar en el estilo de novela negra y de detectives. Una autora famosa por sus libros de época romántica del estilo Jane Austen, según tengo entendido, que da un giro de 360 con este nuevo detective Delmonico del Depto de Policía de Holloman, NY. Un sagaz sabueso en persecución de mentes turbadas envuelto entre conflictos muy poco usuales en este tipo de novelas. Debo de reconocer que es muy notable la mano de una mujer en las características del personaje principal, y los dramas secundarios que debe de padecer a lo largo de sus historias, punto nada desmeritorio, al contrario, punto a su favor, pues no es el típico defensor del bien envuelto en su mundo sombrío a un pie del suicidio como muchos otros.Muertes Paralelas,marginal título en español, es una telaraña de muertes y pistas que van por todos lados y aparentemente no va a ningún lugar, pero que se resuelve sin ser demasiado forzado, incluso demasiado lógica la menea de resolverlo. Saaaaalvo,..., léanlo!."}, {"userName": "Beeltri", "userReviewDate": "Dec 10, 2012", "userURL": "http://www.goodreads.com/user/show/15353517-beeltri", "userReview": "I came across this book in a library about twelve months ago. The cover got my attention immediatly so I gave it a try and I bought it after having read the first five pages.When I arrived home, I left it in my shelve dedicated to books pending to read. As I had to read some books before, I wasn't able to read it until April and I read it again in August.I really liked the book. It was a mix of everything: anger, jealousy, love, action, mistery, forensic science, different perspective and antique police procedure. It all resulted in Too Many Murders, the second case in where Carmine Delmonico is the detective.It wasn't engaging, but it was interesting. I was able to finish it in more or less three weeks, and I really enjoyed the way Colleen McCullough connected the dots across the novel. It had some interesting characters, Erica Davenport mainly, which allowed the writer to create a final and unexpected turn in the story. I'm definitely reading the book in the future, and I strongly recommend it to crime novels fans."}, {"userName": "Nicola", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/14939181-nicola", "userReview": "I originally read Collen McCullough in connection with her Masters of Rome series. It was quite a leap in time and genre when she switched to a small university town in the USA during the Cold War / McCarthyism period. I picked this up by chance off the library shelves (intrigued by the idea of 12 murders in one day) and realized as I began reading it that I recognised the author and that I had read the first book in this series. It was interesting to read as the time setting not only allowed for a nostalgic time period of spies / espionage but for a different style of detective work before cellphones or the internet (and when much forensic work was still in its infancy). I was fine with the busy plot; it was some of the gender bias that irked me at times although given the novel is written by a woman and a meticulous researcher, I suppose the intention is to be realistic to the time."}, {"userName": "Tess Mertens-Johnson", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/2876749-tess-mertens-johnson", "userReview": "This book is set in 1967, during the beginning of the Women's Movement and the Cold War.Captain Carmine Delmonico is the police chief of a small CT town where 12 murders happen in one day. The first murder found is a student and the murder is especially gruesome, as the victim is not only tortured, but tortured in a way that death happened much later and they lived through most of the pain.As more and more murders are found, more characters and subplots emerge. There is adultery, sexual persuasion issues and too many suspects. Carmine tries to bring it all together, and does in the end, to find the killer.One interesting subplot was Carmine's personal life. He and Desdemona are parents of a five month old child who is yet to be names. For a man in charge of the well being of a city, his inability at home is his Achilles heel that gives his character vulnerability."}], "description": "In her riveting sequel to On, Off, Colleen McCullough, the bestselling author of The Thorn Birds, proves once again that she is a master of suspense.1967. The world teeters on the brink of nuclear holocaust as the Cold War persists.On a beautiful spring day in Holloman, Connecticut, twelve murders have taken place in one day, and chief of detectives Captain Carmine Delmonico is drawn into a gruesome web of secrets and lies.All the murders are different and seem unconnected. Are they dealing with one killer, or many? And as if twelve murders were not enough, Carmine soon finds himself pitted against the mysterious Ulysses, a spy giving local armanents company Cornucopias secrets to the Russians.As the overtaxed police force contends with small-town politics, academic rivalry and corporate greed, the death toll mounts, and Carmine and his team discover that the answers are not what they seem - but then, are they ever?", "title": "Too Many Murders\n      \n          (Carmine Delmonico #2)", "url": "http://www.goodreads.com/book/show/6786313-too-many-murders", "average": 3.43, "cover": "https://images.gr-assets.com/books/1348690792l/6786313.jpg", "reviews": 116, "authors": [{"url": "https://www.goodreads.com/author/show/4917067.Colleen_McCullough", "name": "Colleen McCullough"}], "type": ["Mystery", "Mystery", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/6786313-too-many-murders", "http://www.goodreads.com/book/show/33837178-assassinatos-demais", "http://www.goodreads.com/book/show/11398420-too-many-murders", "http://www.goodreads.com/book/show/7445175-too-many-murders", "http://www.goodreads.com/book/show/9682274-o-dia-de-todos-os-pecados", "http://www.goodreads.com/book/show/9292838-too-many-murders", "http://www.goodreads.com/book/show/3412.The_Thorn_Birds", "http://www.goodreads.com/book/show/480570.The_First_Man_in_Rome", "http://www.goodreads.com/book/show/3424.The_Grass_Crown", "http://www.goodreads.com/book/show/3416.Caesar", "http://www.goodreads.com/book/show/182430.Fortune_s_Favorites"]}