{"ratings": 744, "userreviews": [{"userName": "Nissa | Of Pens and Pages Book Blog", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/41356020-nissa-of-pens-and-pages-book-blog", "userReview": "4 stars!Review at Of Pens and Pages.\nIt made it clear that the woman who jilted him was still the woman of his heart.”\nToo Wilde to Wed was my first Eloisa James read and definitely not the last. I knew I’d love the story the moment I saw the blurb. A second chance romance between one of the most eligible bachelors in England and the woman who jilted him? I am here for it! There’s some great dynamic between the hero and heroine, the heroine and her charges, the hero and his family, and many more.When Miss Diana Belgrave jilts her fiancé Lord Rolan Northbirdge Wilde out of nowhere, North goes off to war to forget her. Two years later, he comes back, a different man than he was before he left, and is surprised to see the very woman who left him living under his roof. To make things more interesting, she is employed as a governess of his sibling and has unwittingly spread rumors about him, giving the ton enough reason to believe North is ‘too wild to wed’.He doesn’t care about his reputation, not really, and he shouldn’t care about Diana living in Lindow Castle. But she left him without reason, and he at least deserves an explanation. After that, he’ll leave her be. Besides, even if he pursues her again, nothing can come out of it. Not with Diana’s reputation in tatters.But when the heart wants what it wants, they can’t really do anything to stop it. This is such a romantic story! It was interesting to see their perspectives of the past and present, and to see what happened to make Diana leave North. I love second chance romances, so this one was a winner. From pretenses and false airs to dropping their facades, it was definitely a treat to watch them find love with each other again.I have to admit Diana frustrated me at times—especially when she did things without thinking of the consequences, but other than that, I liked her enough. She did a selfless act to protect a person she loves, even if it was at her expense. It showed how strong she was and loyal to the people most important to her. Her relationship with her charges Artie and Godfrey was adorable, too! North is wonderful. He made me swoon so much! The war obviously changed him from a dandy to a man who couldn’t care one wit about his appearance, but his feelings for Diana and his love for his family was still there. He’s intense, relentless in his pursuit of Diana, and very much in love with her. I want someone to love me like North loves Diana!The dynamic of the Wilde family was a delight to see, and I’m excited to read the first and third book in the series. This is a standalone, but I would recommend reading the first one first as Too Wilde to Wed makes references to what I can assume happens in the first book. Again, it’s not necessary to read the first book, but hey, it sounds wonderful anyway so read away!Tropes: Second Chance, PeersPOV:Third Person, Female POVStandalone: Yes*ARC received in exchange for an honest review. Blog | Facebook | Twitter | Instagram"}, {"userName": "Carole (Carole's Random Life in Books)", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/5892196-carole-carole-s-random-life-in-books", "userReview": "This review can also be found at Carole's Random Life in Books.I just loved Diana and North! I have been looking forward to reading their story since finishing the first book in the series, Wilde in Love. This book would work perfectly well as a stand alone but the ending of the first book really had me eager to read this second installment. I went into this book with pretty high expectations and they were all surpassed. I really had a fantastic time reading this book.Diana and North were previously betrothed until Diana left without warning. When Diana left, North decided to join the military and went off to war. Diana had reasons for leaving the way she did and has paid a steep price for her decision. When she runs out of options, Diana takes a job as a governess at Lindow Castle with North's family. Things get really interesting when North returns home and learns all of the rumors surrounding his relationship with Diana.I loved the characters in this book. In the first book, we were introduced to the Diana and North that were for show but in this book we finally get to meet their true selves. I liked getting to know the real Diana and North and enjoyed watching both of them really get to know each other. It was interesting to watch them both realize that they really knew very little of each other when they had plans to marry. Diana and North both prove to be strong people who will sacrifice to do what is right. I thought that the chemistry between them was extremely well done.It was really interesting to learn about all of the things that happened that brought both Diana and North to their current life situation. North has fought a war and takes his responsibility as heir very seriously. Diana's story was very interesting and I loved the fact that she was willing to give up so much in order to protect someone she loves. They are both very responsible people who tend to put the needs of others above their own. I had a great time watching them both get their happily ever after.I would recommend this book to fans of historical romance. This was such a smartly written romance filled with character you couldn't help but cheer on. I can't wait to read more of this fantastic series.I received a digital review copy of this book from Avon Books via Edelweiss.Initial ThoughtsI just loved Diana and North. I was really excited to read their story after the way that the previous book ended and it was even better than I had hoped it would be. I liked both of their characters so much more in this book since they finally were acting like themselves instead of playing a part. Their chemistry was off the charts and I liked that they were honest with each other."}, {"userName": "Esther ", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/9345651-esther", "userReview": "ARC provided by Edelweiss and Publisher in exchange for an honest review.I loved the first half of this book/romance. But the second half was disappointing, the heroine evolved into someone different from the first half. The first half was sweet, with chemistry between the two MC. Second half it's like this modern woman took her place. Very sexual and not sure of her feelings for the hero, determined to do her own thing (I love strong woman but she came across as muddled/confused and wishy washy) even though she wasn't sure what her \"own thing\" was. And I have to agree with one reviewer, it was a very explicit and erotic second half of the book. I don't mind hot and sexy, it's just didn't meld/mesh with the first half of the book and characters IMHO. Also the ending seemed rushed and forced for me, thought the epilogue was sweet and satisfying. I'm still digesting the book and my feelings on this love story. I have to say it was a disappointment at this point. Full review closer to publication."}, {"userName": "OLT", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/72135750-olt", "userReview": "Okay, I'll admit that I probably should stop reviewing (actually, stop 'reading') Eloisa James. Everything she writes lately is a 3- or 2-star book for me. It's a nostalgia thing partly. I miss the earlier, cleverer James. Now her books seem to be written for 20-something readers. Hah! I barely remember my 20s. So perhaps I should just shut up and leave the enjoyment of these new stories to the young'uns. But, no, not just yet. I read this one. I'm reviewing it.This is the second in James's new Wilde series. Heaven knows how many there will be because the patriarch duke, now on his third wife (figuratively and literally b/c they keep having babies), has numerous progeny. And the older of his children are adults with friends, so the sky's the limit on how many books could be written.In Book One, about third son Alaric, we learned about the earlier death of first son Horatius, lost in the treacherous bog on the estate. This put second son Roland, aka North, into position as heir to the duchy. At the moment of the first book, his betrothal to Diana was in the works. But things didn't go as planned. She ran off from the engagement party and disappeared. The book ends with a teaser that has us (and North) thinking she had had an out-of-wedlock child prior to meeting North.Well, this book clears up all that and gives North a chance to reboot his courtship of Diana, which had been tone-deaf previously. For example, North had actually fallen, \"coup de foudre\", for Diana from afar at seeing her and hearing her laugh. To woo her he makes himself into something he's not and doesn't show her his true feelings. Bad move on his part but he gets a chance for a do-over now that he's back from his 2-year stint as a British soldier in the American Revolution.And Diana also gets to show North her true self, which she had felt compelled previously to keep hidden away. So it all sounds simple, doesn't it? Well, it should be, except for dithery, dithering Diana. Sorry, but I wasn't excessively fond of her or her actions throughout this and the previous book. Nor was the story here very interesting.This started out rather well. I enjoyed seeing Diana and North reacquainting themselves and their relationship reboot. North is an appealing character, trying to find himself, cope with PTSD from the war, and convince Diana to marry him. There are several touching and romantic moments.But the story quickly becomes tedious. Too much about children, peacocks, and family members. Yes, Godfrey (the little boy believed to be Diana's love child) and Artemesia (North's youngest half-sister) are adorable, but, really, I wasn't interested in reading so very much about them. Give me a really good love story, not a rambling story that, for me, had little cohesion. For example, that barmaid scene towards the end. Oh, please. Ridiculous. A showcase of why I did not like Diana.Well, North loves her. There's an HEA. He deserves it. She lucked into it."}, {"userName": "Becca", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/15807787-becca", "userReview": "After reading the \"excerpt\" on Cosmopolitan's website with the cover reveal, I am done with Eloisa James. The teaser was just a long sex scene. No romance, just sex amped up for contemporary readers with pussy, balls, and cocks galore. I'm not hating here, but that isn't for me. This is a note to myself that I won't be reading her newer work. I draw the line at that level of steam. I read more for the romance and sex scenes are just secondary. It's just my preference. All that said, the covers for this series have been lovely :)"}, {"userName": "Aly is so frigging bored", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/4290492-aly-is-so-frigging-bored", "userReview": "I love Eloisa James. Saying that, I think she has outdone herself with this series. It's fun, funny, the characters are relatable and well rounded, the secondary characters are to die for! Also, I think she played so well with the governess trope."}, {"userName": "Lacey (Booklovers For Life)", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/9303686-lacey-booklovers-for-life", "userReview": "I am in LOVE with the Wildes!!! The first book in the series wasn't a favorite, but Eloisa James has made me fall head over heels for this amazing family. North and Diana's romance was utterly sweet and heartwarming – I love it when a hero has to win the heroine's heart.Review to come!Thanks to the publisher for generously providing me an ARC to review."}, {"userName": "Kimberly", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/3232771-kimberly", "userReview": "4.5 starsIt has been two years since Miss Diana Belgrave jilted Lord Roland Northbridge Wilde, and those two years have changed everything. North went off to fight in the Colonies and has returned whole in body, though not in spirit. And after being tossed out by her mother for breaking her engagement in favor of raising her orphaned nephew, Diana has taken a position as governess to North’s sister in Wilde family household. When North returns to England, the two come face-to-face and the sparks immediately begin to fly. Even though she broke his heart and damaged his reputation, North still wants Diana. And Diana is just realizing she never truly knew the man beneath the elegant mask North had put on to impress her during their engagement. Is it possible for two outcasts who both want different things in life to find their way to a happily ever after together?\nToo Wilde to Wed\n is such a fun book! It’s fun, sensual, and in the Wilde family Eloisa James has created a host of bright, endearing characters who grab your heart and don’t let go.Unlike most of the young women she knows, Diana has never wanted to be raised to the ranks of the upper aristocracy. In fact, she positively panics at the thought. I liked that Diana was unconventional, that she didn’t quite fit into the mold her mother tried to forcibly stuff her in. After falling from society’s good graces, she finally finds her true self. It’s a self that North has never seen. He fell for her when he first heard her laugh (cue me melting when reading this), but he proposed to an elegant creation he only later realizes was not the true Diana. My heart broke for North in the first Wildes of Lindow Castle book, Wilde in Love, as he tried to turn himself into a veritable peacock to attract Diana’s notice. The North in \nToo Wilde to Wed\n is a hardened warrior with no patience for fripperies. This North, the real North, is the man who ultimately captures Diana’s heart and one of my favorite things about this story was watching them talk openly and truly learn one another. Diana and North are clearly made for one another, but it isn’t easy for North to win over Diana. But being in Lindow Castle, away from society’s judgmental eyes, frees them to be honest. The resulting romance is by turns sweet and sexy and I was rooting for these two to find a way to get that perfectly happily ever after.\nToo Wilde to Wed\n is the second book in Ms. James’s Wildes of Lindow Castle series and if you don’t mind some spoilers from the first book it can be read on its own. My favorite thing about this series is the Wilde family as a unit. They’re welcoming, loving, and incredibly funny. I’m so glad North has a bunch of siblings because I don’t think I’ll ever tire of reading about their wild (pun intended) antics. I finished \nToo Wilde to Wed\n a well-satisfied reader and I cannot wait to see what adventures Ms. James has in store for the Wilde family next!Reviewed for Joyfully Reviewed."}, {"userName": "Pj Ausdenmore", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/1202249-pj-ausdenmore", "userReview": "I love this couple. I love the entire Wilde family. In fact, not since Julia Quinn's Bridgertons have I fallen in love with a family so quickly or completely. I've read Diana and North's story twice and already I'm eager to go back to the first page and begin again. I love the humor in this story, the witty banter, the sparks that fly when North and Diana go toe to toe, and the sweetness that flows between them in the quiet moments of the darkest hours of the night. I enjoyed their growth, both individually and as a couple, a process that enabled them to better understand - and accept - one another as well as themselves. I was in their corner, cheering for a happy ending, though I had no idea how James would pull it off. In the end, the solution, so simple, really, and from such an unexpected source, was perfection. Though I'm no fan of roller coasters (the real ones), this book coaster, filled with peaks and valleys, laughter and heartache, love and acceptance, is well worth the ride. If you're in the mood for a feel-good romance that will tickle your funny bone, touch your heart, and, ultimately, wrap you up in a warm, loving hug, look no further than Too Wilde to Wed."}, {"userName": "Tammy", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/8880660-tammy", "userReview": "5 ☆ I love the Wilde’s and this series!!! In Book #2 the story focuses on North and Diana. Their relationship is full of spicy heat behind the scenes while dealing with their previous relationship + broken engagement. Also added to the story is the new addition of a little guy Diana brings back with her to Lindow Castle (where she’s now employed as a governess). It proves to be a REAL scandal for North as he’s perceived to of fathered the child! An all around wonderful fun story, I enjoyed every bit of this delicious book! Looking forward to Book 3 releasing July 31."}, {"userName": "Maida", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/42173344-maida", "userReview": "Four plus. Absolutely delightful. Lots of meaningful conversations between North and Diana clearing up misunderstandings of the past and allowing them to get to know one another better. I love that North fell for Diana because of her laughter. I love that Diana takes care of North as no one else can. I particularly liked the seamless inclusion of the household staff in the story in a way that is natural a la Downton Abbey. Prism, Mabel, even Boodle provide not only comic relief, but also bring realism to this fictional work. As always with EJ’s books, Too Wilde to Wed has a cast of hundreds, all of them with distinct personalities. The kids Artie and Godfrey especially, are adorable. Ms. James is hard on the mothers, though - Mrs. Belgrave and Lady Gray will not win any Mother-of-the-Year awards. This series is turning out to be quite enjoyable. I’m looking forward to Lavinia and Parth’s romance in Born to be Wilde. Note: I requested and received TWTW from Avon through Edelweiss for review purposes."}, {"userName": "Janga", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/1206531-janga", "userReview": "This is even better that the first one, which I loved. Now I just have to wait impatiently for Wilde for You, Parth and Lavinia's story and for Betsy's book, which is book 4. I am wild about this series. :) Full review will be posted nearer pub date.The following review appeared in Romantic Intentions Quarterly -- Issue 1, April 2018.Lord Roland Northbridge Wilde returns from war in the colonies to find himself rivaling his brother Alaric (Wilde in Love) as the subject of scandalous prints. The rumor that North forced his attentions on his fiancée and abandoned her and her bastard child is just the sort of outrageous tale in which the London elite delight. The report that the disgraced Diana Belgrave is now a servant in the Wilde household makes the story more titillating. Diana never intended for anyone to believe that her orphaned nephew was North’s child, but she was only a step away from destitution when North’s aunt offered her the position of governess at Lindow Castle. Diana, a sort of reverse Cinderella, is happier as a servant than she ever was as North’s betrothed. Having found herself, she has no interest in conforming to societal expectations of a future duchess, no matter how tempting she finds the new, more forthcoming North. With James’s trademark wit, sensuality, and engaging characters, Too Wilde to Wed will leave readers rooting for North and Diana to resolve their dilemma and eager for the next Wilde novel."}, {"userName": "amanda", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/131999-amanda", "userReview": "[ARE YOU TRYING TO GIVE YOUR HEROINE A YEAST INFECTION, ELOISA?this is a blancmange:a blangmange is a \"a sweet dessert commonly made with milk or cream and sugar thickened with gelatin, cornstarch or Irish moss (a source of carrageenan), and often flavoured with almonds.\" it's kind of stiff. it's like a milk jello? it's also what the heroine slathers all over her breasts (for the hero to lick off) and either ON OR IN HER NETHER REGIONS, again for the hero to lick off (it was not clear to me from the text, and i'm not entirely sure if i want clarification). really, this is a) not sexy and b) REALLY, A GREAT WAY TO GET A YEAST INFECTION.also, the hero specifically brings this blancmange back to her because it reminds him of \"the sensual wobble\" of her breasts. this was not supposed to be humorous (i don't think? it was actually supposed to be romantic and/or sexy???) at this point i had to put the book down and laugh for about 10 minutes. i just... BLANCMANGE????? SENSUAL WOBBLE??????? what. why. eloisa, please. (hide spoiler)]"}, {"userName": "Sissy's Romance Book Review ", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/1831318-sissy-s-romance-book-review", "userReview": "Too Wilde to Wed by Eloisa James is book Two in The Wildes of Lindow Castle series. This is the story of Lord Roland Northbridge Wilde 'North' and Diana Belgrave. I have read the previous book (and Loved it) but feel this is a standalone book although the previous book did do some set up for this one. North and Diana had been engaged to be married but she made a hasty decision that had her breaking things off with North. North brokenhearted left but now he is back only to learn that his reputation is taking a hit due to those decisions. But the one things that hasn't changed is how they both feel about each other. Will this time be their chance to be together? Really enjoyed this book and the situations that came about with Diana. Can't wait for more from Ms. James!!"}, {"userName": "Lissa", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/5674227-lissa", "userReview": "I needed this!Imagine: Final week of teaching 7th graders. You need to finish packing your room, but a new Eloisa James was delivered to your Kindle. Better believe my responsibilities had to wait! I've been wanting to read this story since the epilogue of Wilde in Love and it did not disappoint. This was the perfect, beginning of summer read: romance, revelations, but no angst or insidious plots. Just two people who need to get their acts together.Thank you, Eloisa- I needed this stress relief more than I knew!"}, {"userName": "Bambi Unbridled", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/3234139-bambi-unbridled", "userReview": "Too Wilde to Wed is the second installment of Eloisa James' Wildes of Lindow Castle series, featuring the very large and entertaining Wilde family. I have read the earlier book, Wilde in Love, but I think you can get by reading this one as a standalone if absolutely necessary (though you will miss some of the backstory). Our hero in this story is Lord Roland Northbridge Wilde (a/k/a North), heir to the dukedom. After being jilted by his fiance and coming to an incorrect assumption, North enlisted in the royal army and went off to fight the Revolutionary War in the Colonies. In the first book, North had turned himself into a ridiculous dandy wearing saffron pantaloons and coats embroidered with cherries, all to gain the attention of a woman. But North has returned from the war and different, and less pretentious man. I really liked him as a hero. He was patient and understanding, and had a touch of vulnerability in dealing with his time in the war. He treated our heroine exceedingly well, but he wasn't the \"nice guy that finishes last.\" North could steam up the sheets and steamroll his way when the situation really warranted it.Our heroine is Miss Diana Belgrave, formerly a diamond of the first water despite her inauspicious grandparentage. We saw her in Wilde in Love wearing ridiculously tall coiffures and dazzling dresses, but not showing much personality. It was quite a surprise that she would jilt a duke, but we learn that she did so in order to care for a child. Diana was quite altruistic, and she has turned a complete 180 degrees personality-wise. She is now outspoken, messy, and displaying her own coppery red tresses and freckles. Unfortunately, she was not at all prepared for a life of self-sufficiency - she can't do math or make change (among other things). She begins the book deceiving a large number of people without thought to the consequences, but I'm happy to report that it didn't last too long as deception is one of my pet peeves in romance. I was a little disappointed in her reluctance when it came to our hero, and wished she would have come to her senses sooner. But you have to admire a girl who gives up a life of comfort to care for someone less fortunate.The relationship between North and Diana was just a little hot and cold. They made great friends and I loved how she helped him cope with the tragedies he experienced. I thought they had great chemistry and it was clear they cared for one another... which is why Diana's reluctance bothered me. I definitely did not predict the outcome that finally solidify the relationship.I continue to like all of the secondary characters. Lady Knowe, the lovable aunt, wasn't as zany in this installment. I feel like she was more of a \"character\" in the previous book. Based on happenings in this story, I feel like we will see Lavinia as the next heroine, and she promises to be entertaining.I recommend this story to fans of Eloisa James, second-chance and historical romance. I voluntarily read and reviewed an advanced copy of this book that I received from the publisher, Avon."}, {"userName": "Michele", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/4851526-michele", "userReview": "See the full review at HarlequinJunkie.comA jilted hero. A flighty but well-meaning heroine. A huge, raucous family. And even a testy peacock (or two…). Eloisa James’ setup for Too Wilde to Wed was as entertaining as it was emotionally involved.Too Wilde to Wed really was a fun read, although I did struggle a bit with some of it. Overall, though, this was as well-plotted out as I would expect from James and of course had some nicely placed references to Shakespeare as well. This was an easy romance to read with lots of intriguing, eccentric characters to chuckle over. And I liked that there was an easy flow to each passage so it was truly a pleasure to see the cast interact and then see where their actions would lead them. Read More"}, {"userName": "Heather", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/11160246-heather", "userReview": "I'm wild about the Wildes! I know. I know. It's probably been said a thousand times, and I know it will be said a million times more, but it's the most perfect way to express how I feel about this marvelous series. I've been wondering since the first book what the heck was going on with North and Diana. Their relationship in the first book felt so awkward and weird, and the anticipation of finding out what happens next nearly killed me. And not to ruin anything, but it was soooo worth the wait. I'm still recovering from the deep swoon that this story left me in. It was adorable. It was hilarious. It was heartbreaking. It was perfect. I adore North and Diana. I loved how comfortable they were with each other in this book. James' ability to flawlessly put body language and witty banter to page made this story feel very real to me. Is it weird that I want to be best friends with Diana and North now?This book was everything. It sucked me in immediately, and by the end of it, I felt like I was embraced by one of the best kind of hugs there is. Do yourself a favor and read it. It was an interesting and very well-written story with a fabulous bunch of characters. I wish I could experience for the first time all over again."}, {"userName": "Erica Chilson", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/4182064-erica-chilson", "userReview": "I received a copy of this title to read and review for Wicked Reads 5 Stars Too Wilde to Wed had a more focused, less chaotic feel than its predecessor, which is why I couldn’t put it down until I reached the end. The Wildes of Lindow Castle has a very large cast, at times becoming overwhelming to keep who is who straight. However, I could see how the novel would be easily read as a standalone, even if I feel it best to start with Wilde in Love.Opening with a short prologue, the reader is given vital information in a way that made it easier to fall into the story and place the events that led up to the current place in the timeline. Women didn’t have many options, seen more as possessions than human beings, whether the possession be to one’s parents or their husband. Diana was a woman trapped, one who ran and for altruistic reasons. Diana’s view of herself and the world are tainted by the mental and emotional abuse she suffered at the hands of her mother, while suffering debilitating grief. North is a man who doesn’t fit into the role of a duke-to-be, having come back from war with a different mindset. He’d fled after being jilted by Diana and came back a more enlightened man. This book could have gone in an uncomfortable direction had North held resentment toward Diana. North is quick to accept apologies, see the error of his own ways, and is easy-going compared to his commanding personality. This made reading more pleasant, as the emotions of it were already darker. To be honest, this novel is filled to the brim with romantic tension, but it’s the numerous conversations that North and Diana share that creates intimacy, which makes their connection feel beyond real. Instead of focusing on every other character, the focus is on North and Diana forming a bond during interactions, while showcasing the youngsters of the cast. My only complaint, the novel seemed to ramble from the midway point to nearly three-quarters, where I feared it would veer in a direction that would create forced angst. Thankfully it didn’t head in that way (if you’re reading this review after reading the book, you’ll understand what I meant by that). Diana’s stubbornness, North’s blindness, it became too much- I’ll use the phrase, ‘beating a dead horse’. Over and over again, on repeat, stalling the novel, to the point I won’t deny skim-reading portions. Other than feeling as if the novel didn’t know how to get from the midway point to the ending, I was thoroughly entertained, enjoying the connection Diana and North had with one another and within the larger cast. The emotions Diana showed felt realistic, tugging at my heartstrings- her feeling of inadequacy, insecurity, and self-consciousness that was placed there by her mother. The youngsters have me holding out hope that when James runs out of this age-group, she will fast-forward into the future and allow their voices to shine. The next book was setup perfectly, doing its job by making me hungry to get my hands on it, especially since I’m a sucker for love-hate/enemies-to-lovers storylines. Highly recommended to historical romance fans, who enjoy a more contemporary take on the genre. While it’s not fade-to-black sexual content, it’s also not salacious. I felt the need to state that after seeing another review. If Eloisa James were Goldilocks, she’d be just right in the between-the-sheets action– tastefully done, plot-driven, and romantic, the passion connects our hero and heroine."}, {"userName": "Stacee", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "After reading and loving the first book in this series, I couldn’t wait to get my hands on North’s story. I loved Diana and North. She’s headstrong and sassy and he’s changed from being stoic to a bit more open. Together they’re adorable and charming with loads of chemistry. I loved seeing his entire family and how supportive they were.Plot wise, it was definitely stronger in the first half of the book. Diana’s constant refusal annoyed me more than North’s asking. I did love their open communication, but things definitely got repetitive. I would have rather had more time of them together at the end. Overall, it was a fun and fluffy read. I loved these two together and I’m insane with excitement at the set up for book 3. **Huge thanks to Avon Books for providing the arc free of charge**"}, {"userName": "Nelle", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/5821611-nelle", "userReview": "So many chuckles, giggles and Aww so sweet moments in this second Wilde novel!! I received an advance copy of this from Edelweiss for an honest review and even though it doesn't publish until MAY, I could NOT resist reading North and Diana's story, right now! I knew from the end of Wilde in Love that Diana has acquired a child. Oh MY!!!This story was SO much better than the first in the series! North may be my new favorite book boyfriend, sigh. The thing is they are just so HONEST with each other from the beginning of their second meetup years later. It's refreshing.And yes as a reviewer noted the \"excerpt\" was very hot. The sexy times in this book were delicious and I felt essential to the development of their feelings and relationship. I want to read it all over again. I'll wait till May though!! :)"}, {"userName": "Luckylovesbooks", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/5241472-luckylovesbooks", "userReview": "Really, really good! Can’t wait for the next book! YASSSSS NORTH ❤️❤️"}, {"userName": "Marcia", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/8823221-marcia", "userReview": "I received a free advanced copy of this book from the publisher. This is my unbiased and voluntary review.The last book, Wilde In Love, ended with a cliff hanger leading to this one. Lord Roland (North)'s fiancee, Diana, mysteriously breaks off her engagement to the future duke and disappears into the night from her engagement party. With her gone, North forms a regiment to fight the colonists in America, but before leaving North eventually tracks her down to a small cottage, but when he hears a cry of a child, his pride overshadows his judgement in making false assumptions, and he rides off.This book begins with Diana living in Lindow Castle, the home of the Wilde's. Destitute, because her mother has disowned her after she rescued her orphaned nephew from a foundling home, North's aunt, Lady Knowe, had invited her to Lindow Castle, but she would only agree if she could work as a governess. Rumors fly that the child is North's. The granddaughter of a wealthy grocer, Diana prefer keeping business rather than the luxurious life of the nobility. When North returns, disheartened because he believes the war is wrong, he also finds Diana in his home. Eventually they confess that when they had been engaged, they had each put on a false front for the other, expecting that is what was wanted. However as they get to know each other, they find they have a lot in common and develop true trust and love. But Diana is just not cut out to be a duchess and North believes he must let her go for her to be happy. We still end with a HEA and another cliff hanger involving Diana's cousin Lavinia.I thoroughly enjoyed reading this book. The author creates the most endearing characters woven into captivating adventures. With 10 children, one supposedly dead (but no body found) and only Aleric's and North's stories told, we can all look forward to a nice long series of fascinating characters and adventures."}, {"userName": "Les Romantiques", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/17327509-les-romantiques", "userReview": "Posted on Les Romantiques - Le forum du siteReviewed by JazzmenReview Copy from the Publisher3,5/5That’s a second tome I was waiting for impatiently after the end full of suspense of the first book Wilde in love, from the “Wildes of Lindow Castle” series.I really enjoyed this book but I’m not sure if I preferred this one or the first one…There was also humor, but a little less than in the first one. This one was a little more dramatic (a word to use with caution, that’s not a tragedy, far from it). Mainly because of the past of the characters: war, lost of loved ones, fact of being disowned by one’s parent, etc.As usual with Eloisa James, the story is very addictive. I read that book in only a few days.Nothing very original but you don’t get bored. Well, usually it’s the bride who is left at the altar, here we’re in the opposite situation, that’s a little bit new. No real secondary intrigue, even if we talk a bit about Lavinia again (the heroine’s best friend from the first volume) and we can guess that she will be the star of the next book. The story stays focused on the main characters and their feelings.Speaking about them, they’re of course very endearing. I still had a preference for North (or Roland… actually I didn’t understand which was his first name… she calls him North but he’s also called lord Roland, but their family name is Wilde… I don’t understand). I really liked his determined lover romantic side that changes from these dark men who pretend they don’t care about love.Diana was a bit annoying with her “I don’t want to be a duchess, blah blah”… Yes, well, I’m biased. If I were her, I’m not sure I would have wanted to be a duchess either but… North, seriously! Frankly, yes, I would have sacrificed for this man, he’s marvelous. Everything proves this to us from the beginning till the end. Diana is still a smart heroine and far from being odious. It’s just I had a hard time understanding her reasons to refuse North. Especially after some time, when they were both obviously in love. The “main” secondary characters in this story were the children: North’s half-sister, Artie, and the little Geoffrey. They bring a touch of humor and lightness around those adults who didn’t had an easy life. Nonetheless, if I understood well, Artie is only 2 years old and if she talks that good either she is a gifted kid, or the author never spoke to a little child… or else I didn’t really understand Artie’s age. That’s a detail but that bothered me during my reading.The sexual tension between the characters is rapidly present. Their conversations are enjoyable to follow but there are no cutting remarks between the two of them, like there was between Alaric and Willa (from the first volume). This is not a relation of force where one seeks to get the upper hand on the other. On the contrary, North wants to seduce Diana who, as for her, wants to get away from him but without success. Clearly, there is a seduction game and a few sex scenes that are well brought in the story line, just like in the first volume.If I keep going with my comparison with the first book, the author makes us understand that we can’t trust what we first see. We have to scratch the upper layers to discover the real person beneath and we can be pleasantly surprised.My conclusion will be the same: a romantic, pretty and sexy story with endearing characters. Once more, I’m waiting for the next book impatiently."}, {"userName": "Austine (NovelKnight)", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/37252203-austine-novelknight", "userReview": "This book was provided by the publisher (via Edelweiss). This does not affect my opinion of the book or the content of my review.After reading Wilde in Love and immediately falling in love with James's writing and story, I couldn't resist reading Too Wilde to Wed early and sharing my thoughts. While I will certainly continue reading books in this series, this one didn't live up to the first book.I felt like I read two different stories. The first half followed the romantic set-up with two people who had an unusual history but really didn't know who the other was (which makes for plenty of awkward and sweet scenes between them). But then the second half of the book was a mess of sex scenes and indecisiveness that really annoyed me.Too Wilde to Wed opens with Diana keeping a big secret from the rest of society about the child she's been raising, a fact that's tarnished the reputation of her former \"beau\" North who's been away. You can see how this could go wrong when he returns, yes? Well, personally, I liked the set-up. I liked learning about Diana's overbearing mother who made her into something Diana certainly was not, that she kept moving forward despite that, and really became her own person. And North did so much to catch her eye but never thought about being himself. All in all, the makings of a cute historical romance of two people finding themselves and each other.What happened in the second half, I honestly don't know. Diana became incapable of making a smart decision and constantly went against everything because she could. I think it was supposed to be some sort of defiance against societal views but it came across as annoying and out of character. North was pretty consistent throughout so at least that worked. There's also a lot more explicit content in the second half. Which I don't mind when it works for the story, but here it didn't at all. They had the chemistry and suddenly it's used as a way for Diana to keep North wrapped around her little finger. If they're together he's not \"pressuring\" her to do anything (and really, he was a well-written male lead considering others in the genre so my frustration centered around Diana).James is a good writer, I've found, from the two books I've read so far, but this book's characters didn't have the same spark and charm the whole way through that I came in expecting. I needed more cohesiveness across the board to buy into this romance and this ship. The ending tied things up nicely even if it didn't sit quite right with me (the pacing was a bit off), but I feel satisfied with how it all ended. In short, an average read and my expectations coming in definitely impacted my views when compared to the first in the series.Find Me on: My Blog || Twitter || Instagram || Bloglovin'"}, {"userName": "Julie", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/17692043-julie", "userReview": "This was okay, but definitely not one of her better stories. There’s humor and entertaining family drama, however I found the romance hot and cold. North stayed relatively consistent with his attraction-even when I couldn’t fathom why-yet Diana come across wishy-washy. She went from a shy virgin I actually liked to an independent thinking seductress I just didn’t care for all that much."}, {"userName": "Laurie", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/23043419-laurie", "userReview": "I am officially obsessed with the Wildes. Eloisa James is weaving a glorious tapestry from book to book and I am anxiously anticipating what comes next with this big and boisterous family. Diana and North’s story has many a moving part, that it almost requires a scorecard. It keeps the reader all the more engaged to see just how these two get to the happiest of ever afters. This a book about before and after, as well as understanding the heart and mind of the one you might love. It’s about getting a full picture and not forcing will. These two grow in ways that make you like them all the more."}, {"userName": "Katie Michaels", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/4669344-katie-michaels", "userReview": "Review to come.*ARC provided by publisher"}, {"userName": "JG", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/9424893-jg", "userReview": "This is the second book in Eloisa James' newest series The Wildes of Lindow Castle and although it can be read as a standalone it definitely helps to read the first book Wilde in Love since, North and Diana's story started there as well.This one starts two years after the first book, North has arrived back from the Revolutionary war in the Americas and Diana has been living in the Wildes residence during the time he was away. Everyone in polite society has apparently painted North as the villain, the rakish duke to be who abandoned his fiancee after he got her with child. This, like his brother before him, was also immortalized in prints that his siblings have also started collecting, mainly to annoy him but mostly since it is untrue. After reading the first book, I have been consumed with curiosity on how North and Diana's own story will play out. I have always felt North's feelings for Diana has always been out there while hers has always been shown to be absent. So to actually know the reason why she ran away was good but what I liked about how To Wilde to Wed unfolds is that both parties feelings have now appeared to have disappeared. So its like a fresh start for them to get to know one another, to opt to be friends rather than affianced. But of course being a romance we get a very sweet developing love story as well as an extremely erotic one. There is both an internal and external conflict that is going on, one has an obvious answer that will drive every reader insane since not one character brings it up. I do understand why though because this two characters are protectors and loyal to a fault so for them this isn't an obvious solution. However, when they are being pushed to choose, they did choose the ones readers will definitely approve of. The series is a family themed one as well and so the appearance of different family members adds a bit of levity into an otherwise sweet and poignant romance. I didn't find it this jarring at all in fact welcomed it as a break from the main story line. All in all, Too Wilde to Wed will definitely make you read until the very last page to finally get North and Diana's romance.*ARC provided*"}, {"userName": "Emily S.", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/925510-emily-s", "userReview": "I mostly liked this, though I got frustrated with Diana through the second half of the book. She morphed into someone pretty well unrecognizable. I couldn’t even chalk it up to character development, because it just felt so OUT of character. On the other hand, I ADORED North. I would have liked to see a little more of him overcoming his demons (I felt like his ‘recovery’ was never really explained well), but for the most part, he was just what I want in a hero."}], "description": "The handsome, rakish heir to a dukedom, Lord Roland Northbridge Wilde—known to his friends as North—left England two years ago, after being jilted by Miss Diana Belgrave. He returns from war to find that he's notorious: polite society has ruled him \"too wild to wed.\"Diana never meant to tarnish North's reputation, or his heart, but in her rush to save a helpless child, there was no time to consider the consequences of working as a governess in Lindow Castle. Now everyone has drawn the worst conclusions about the child's father, and Diana is left with bittersweet regret.When North makes it clear that he still wants her for his own, scandal or no, Diana has to fight to keep from losing her heart to the man whom she still has no intention of marrying.Yet North is returning a hardened warrior—and this is one battle he's determined to win.He wants Diana, and he'll risk everything to call her his own.", "title": "Too Wilde to Wed\n      \n          (The Wildes of Lindow Castle #2)", "url": "http://www.goodreads.com/book/show/35887284-too-wilde-to-wed", "average": 4.04, "cover": "https://images.gr-assets.com/books/1515521512l/35887284.jpg", "reviews": 176, "authors": [{"url": "https://www.goodreads.com/author/show/86778.Eloisa_James", "name": "Eloisa James"}], "type": ["Romance", "Romance", "Historical", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/35887284-too-wilde-to-wed", "http://www.goodreads.com/book/show/36387576-too-wilde-to-wed", "http://www.goodreads.com/book/show/36341200-too-wilde-to-wed", "http://www.goodreads.com/book/show/8449698-when-beauty-tamed-the-beast", "http://www.goodreads.com/book/show/6957682-a-kiss-at-midnight", "http://www.goodreads.com/book/show/11879737-the-ugly-duchess", "http://www.goodreads.com/book/show/12958655-paris-in-love", "http://www.goodreads.com/book/show/6049962-a-duke-of-her-own"]}