{"ratings": 37145, "userreviews": [{"userName": "Sasha Alsberg", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/10915830-sasha-alsberg", "userReview": "Just go read this book.THIS is how a novel should be done. I'll be talking more about it in my January wrap up video because IT WAS JUST SO FANTASTIC!!!!"}, {"userName": "Maria V. Snyder", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/1629797-maria-v-snyder", "userReview": "LOL - Every little star counts! Such shamelessness ;>Okay - so how weird is this?? I have the audio copy of TOP and it's read by Gabra Zackman, who did a fantastic job on my Study books. So I wanted to listen to a couple chapters of TOP to see how Gabra did the voices and pronounced the character names...I'm on Chapter 11! I've gotten sucked into my own book - how weird is that? I'll blame Gabra. She brings the story to life - it's a different experience from reading the book as she's acting it out with the various voices and the sarcasm and I've actually laughed out loud - so strange and fun. She reads Quain with a Scottish accent - not quite what I'd imagined...but I've grown used to it and now I can't hear him any other way :) Flea is perfect, and Kerrick's a bit...off, but I'm not sure how he's supposed to sound. Mom is also perfect and Belen sounds just like Poppa Bear.I'm going to try and make sure Gabra reads all my books from now on! A good reader makes all the difference.I finished a few days ago - I really loved Tohon's voice his was so silky and dangerous. And now I have all their voices in my head as I write TASTE OF DEATH - book 3!"}, {"userName": "Tatiana", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "On the surface, there is nothing wrong with Touch of Power. Avry, a 20-year old magic healer in a world where healers are persecuted and blamed for spreading deadly plague, is a nice character. She is kind, courageous, smart, strong, self-sacrificing, caring, self-sufficient, moral, a quick learner, a good friend (you see where I am going with it?) Avry's adventure is fast-paced, something exciting is constantly happening. There is no instalove. The magical system with 11 kinds of powers (one of which is the healing power) is fairly interesting. The theme of uniting a plague-torn country is... good.The problem is, there is nothing below the surface of this story. There is no depth to it. The characters are simple and flat, their emotions and personalities are superficial, juvenile even. Avry is condemned to death in the first chapter, for being a healer, and her only response to the death sentence is to shrug her shoulders and go to sleep. Her calling is to heal people by taking in their pain and illnesses, and never once does she feel resentful towards this ability, she always welcomes other people's bruises, cuts, whip lashes, infections, fevers. Does she enjoy pain? (No, this is not that sort of book, maybe unfortunately.) There is hardly a moment of contemplation or any complex feeling in this story. Why bother with sappy stuff I guess if there is a new adventure or a game of hide and seek or a knife-throwing practice just around the corner? The world-building is equally thin. It is hard to fully grasp it, especially if you pay attention to the language that is used to describe it. After finishing Touch of Power I have this vague image of a medieval land of 15 Realms, with mages, castles, princes, wooden carts and swords, but then once in a while the author would drop in a \"syringe,\" \"toxins,\" \"virus\" or \"president\". Then there is the familiar dilemma - is this YA/is this adult fic? Avry and her love interest are in their twenties; conflicts, violence and sex are of YA variety; and the writing style is so simple and void of nuance it would better fit a children's book.But what bothers me the most about this novel is the whole concept of healing. Avry can transfer aches and illnesses from sick people into herself. Then she experiences it and heals, faster than a normal person would. However, a lethal disease will kill her, just like any other person. My question is, if Avry can only take away treatable illnesses, why not allow the patients heal on their own? Are her sacrifices truly necessary?It is probably time for me to abandon all hopes of ever reading something written by the author that is as good as Poison Study. I sometimes even think that maybe that book isn't nearly as great as I remember it. I would only recommend Touch of Power to Maria V. Snyder's most dedicated fans and those readers who like books where stuff happens on every page, but who do not expect to grow fond of the characters, swoon at romances or be enchanted by new fantasy worlds and mythologies. Everyone else, try Finnikin of the Rock instead."}, {"userName": "Katerina", "userReviewDate": "Nov 29, 2014", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "It's Maria V. Snyder people. She can do no wrong.\n\n“I can't decide what's worse. Losing family members or not having a family member to lose.”\n\nUnfortunately, that is a question many people had to ask themselves in the Fifteen Realms. A plague killed millions of poor souls, and the healers were the ones to blame, despised and on the run, hunted down and executed. The survivors were in no better condition than the dead, kingdoms and governments collapsed and among the ruins rose those who craved power. Avry of Kazan was the last healer alive who was rescued by a strange team with one goal; heal the prince you loathe or else the king who commands the armies of the walking dead will prevail. While traveling in the woods and snowy mountains, fighting mercenaries and carnivorous plants and infiltrating enemy camps, Avry found an unexpected family and a place in the world, and she was the one to determine the fate of this world, even if it meant giving up her own life.\n\nMagician, heal thyself.\n\nSince Poison Study is one of my favorite books, I already knew that Maria V.Snyder is an extremely talented author. But yet in Touch of Power she didn't fail to amaze me. Her magic system and the world-building are solid and presented in a way you feel like a part of this world. Her writing is rich, with the right amount of detail without tiring the reader, and she handles masterly the element of surprise and the plot twists. I loved her secondary characters, Belen the protective Poppa Bear, Loren and Quain the funny and loyal \"monkeys\" and Flea the former street rat. Avry is a very kind heroine, she knows some of her decisions are risky or foolish but she can't stop herself from helping people. She bears the weight of the world in her shoulders and she has to put aside her personal judgements in order to undestand the dire situations and make up her mind. And of course, there is Kerrick.\n\n“Good to know I made a lasting impression.”“Oh, you made an impression. Like a stone caught in my boot.”\n\nNot the typical gallant prince, Kerrick is actually rude and a cold-hearted bastard. His only goal is to save Ryne, their only chance at succeeding against ruthless Tohon and his devious schemes (God I hate that man!) using any means necessary. There was no insta-love with Avry, mostly sarcasm, fights and banters. Yet he came to trust her, to count on her and eventually to put aside his logic whenever she was concerned. And despite his harsh manners, I fell deeply in love with him. Obviously.If you don't want great characters and great romance and great plot and \ngeneral greatness\n, then don't read the Healer series. But if you do, there is a brand new world full of wonders waiting for you!P.S. Whenever I listen to this song I think of Kerrick!"}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Apr 16, 2012", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "“We’re really surprised you weren’t caught by the locals sooner,” Quain said.“We had a list of healers,” Loren said. “But by the time we learned of their location, they’d been executed. We always heard the same gossip. That they had been caught by doing something stupid.”“Like healing a child,” I said. My obvious weakness.\nThat awkward moment when you love a book despite hating almost everything in it...Book chemistry. It is very, very real, and this book is living proof that it exists. There are so many elements of \"Things Khanh Totally Fucking Hates\" within this book. There is a too-stupid-to-live main character, there is deus ex fucking machina up the yin-yang, there is a motherfucking asshat of a love interest, there is an attempt at a love triangle, there is almost no relationship building (if you thought Valek and Yelena in Poison Study was out of nowhere, wait til you read this book), there is a plot that literally takes you across the entire fucking world with me scratching my head wondering...what the actual fuck is going on.But I can't lie. I enjoyed this book, and I had a lot of fun with it. I don't even know why, I just do. I'm only human, and my brain can't help overlooking basic common sense sometimes.The Summary: Avry of Kazan is on the run for her life.\nThree years on the run. Three years of hiding. Three terrible years full of fear and loneliness. For what? My life? Yes, I live and breathe and exist. Nothing else.\nShe is a wanted woman. There is a bounty of gold on her head. People want her dead. Why? She is a healer. All healers are to be captured and killed for their crimes.Five years ago, a plague spread across the land, devastating the Fifteen Realms. People died in droves. So many died that it cast the realms into chaos. Governments were destroyed. Bands of mercenaries and dictators sprung up in their place. There is litle law and no order in the land. For all this, healers were blamed. Why? Because of one false belief.\n[The people] considered those times a war. A war that had been started by healers, who then spread the deadly disease, and refused to heal it.\nAll the healers, roughly 100 of them, were graduanlly hunted down, killed. Few remain. Among them, Avry, who has been running and hiding for years. Until, thanks to a soft heart, she healed a sick child---and is caught.Avry is sentenced to death. She is resigned to die...until a man comes to rescue her. Kerrick has been searching for her---a healer---for years. His rescue comes at a price. Kerrick needs something from her.\n\"You’re worth more alive than dead.” He paused, knowing he had said the wrong thing. “I meant, I need you to heal someone for me. Once he’s better, you can go back into hiding or do whatever you’d like.”\nThere's just a problem, she can't, and won't heal the person Kerrick wants her to heal, for reasons of her own.\nI raised my voice. “Let me make this perfectly clear. I will not heal Prince Ryne. Nothing you do or say will change my mind.”\nKerrick and his men won't let Avry go that easily. Avry has been on the run, and she hasn't stayed in one place long enough to realize what's happened. She may not like Prince Ryne, but the alternatives to his rule are far worse. Among the aspiring rules who want to take over the Fifteen Kingdom are an cult-like, fanatical queen.\nThe High Priestess, also known as Estrid of Ozero was intolerant of other faiths, and required her subjects to be members of her cultlike religion.\nEven worse than her is an insane, seductive king. Not only is Tohon a despotic dictator.\n\"Tohon is not trying to help the plague survivors. He’s gathering them into an army so he can invade all those towns that have managed to reform. Towns like Jaxton. All so his army can grow. And if his forces encounter anyone who refuses to join, they kill him or her. Tohon is…mentally unstable, and for him to be king of all...would be a living nightmare.\"\nThe magic he wields is terrifying dangerous.\nPressing my hand on freezing cold flesh, I summoned my power. Nothing happened. No magic swelled in my chest. Kerrick’s comment echoed in my mind. I don’t feel them.Horrified, I met the gaze of one of my captors. Death stared back.\nAs much as she hates Ryne, Avry may not have a choice but to help him. Avry and Kerrick are in for a long, dangerous journey. One way or another, Avry is sure to meet her death, because what Kerrick wants her to do will kill her.The Setting:1. The Plague: The only thing that works really well about the setting is the plague and the healing magic.\nThe first stage resembled a stomach bug, and once the person’s stomach and bowels were empty, the symptoms transformed into all-over aches, pains and a high fever, which was stage two. The final stage involved convulsions, delusions and large white blisters on the skin that itched at first, then burned. Many of the victims screamed nonstop in pain during the third stage. They reacted as if they were burning alive.\nI love plagues. I have a soft spot for horrifying illnesses with a high mortality rate. I'm a really, really strange person, therefore, I absolutely loved the way this book described the plague and how it killed.I love the way that the magical healing system worked in this book. Healers are magicians, there are 11 other classes of magic within the Fifteen Realms, and Healers work their magic by absorbing the sick person's illness and taking it into themselves. It works for diseases, sicknesses, as well as injuries.\nI sent my magic into Belen’s wounds, flooding them.Pain stabbed deep into my stomach, blood ran down, soaking my waistband. I made it to the small fire before I collapsed. My muscles felt as if they’d been shredded and I couldn’t breathe. The pain increased as acid leaked from my pierced stomach and burned my flesh.\nHealers do not die because they heal quickly from the injuries and illnesses they absorb into themselves. There is one notable exception to this rule: the plague.2. The Fifteen Realms: It doesn't work for me. It is a generic fantasy setting that has elements that feel oddly out of place. The dialogue feels too modern, it wouldn't be out of place in today's setting, and there are things in the book that feel they don't belong. Like hair dye.\n“The reddish brown sets off your beautiful sea-green eyes better,” Mom said. “But if you choose blond, I’ll give you the dye so you can do your roots.”\nAnd champagne.\n“A slight chance? Let’s break out the champagne.”\nAvry: She is similar to Yelena in her character development, only considerably less sympathetic. For one, she is too soft-hearted, and that makes her often too stupid to live. Avry is a kind woman, it cannot be denied. The only thing is that softness almost killed her.Avry loves children. She hates seeing children sick. She is a healer on the run, she cannot afford to expose herself, but time after time she risks her own life to heal a sick child, knowing that it will expose her and she will have to run away yet again. It is a fault many of her fellow healers took. Avry was rescued from certain death---the other healers weren't so fortunate.\n“Heading generally northwest, and stopping only in the bigger settlements. You’d last about...six, maybe eight weeks before healing a child and taking off.” Loren settled on his bedroll next to the fire.When I thought about it, he was right. A zing of fear traveled up my spine. If I survived this mission, I would have to be extra-vigilant.\nKerrick and his men located her because her pattern of stopping and healing a child was so obvious. Not the brightest move if you wanted to survive.She repeatedly puts herself in danger. She runs away into the forest, not knowing what lurks there. She risks her life and that of her companions for foolish, grandiose missions, like a side trip to save a girl.Heroic, yes. Noble, yes. Smart? No.Avry makes ridiculous, improbable plans that fail...\nHis touch zipped right through me, igniting every single nerve ending. My body responded. Desire flared. I leaned against him and kissed him back.So much for my plan.\nYet she somehow always succeeds in her mission, however unlikely, however stupid the tools.\n“How could I do anything, Tohon? All I have left are these.” I reached into my pocket slowly and withdrew my stones.“What are they?” Sepp asked.“Juggling stones. See?”\nI did like her character development, Avry went from a woman without a purpose, who doesn't really care whether or not she dies.\n“Do you want to be executed?”“Some things are worse than death,” I said.\nTo a person who finds meaning in life, who feels that she has something to contribute, who has power that only she can wield.\n“Belen, I decide who I heal. Me. Not Kerrick. Not you. Not anyone. It’s my decision. The only one I have left.”\nThe Romance:\nWith a strangled cry, Kerrick lost his temper. Belen lunged toward Kerrick and I raised an arm to block Kerrick’s strike, but we were both too slow. Kerrick backhanded me across my cheek. The force of the blow sent me to the ground.\nNo. No. No! Motherfucking douchebag!Maria V. Snyder wrote another series, Poison Study. That series features one of my three book boyfriends, Valek. Kerrick doesn't hold a candle to Valek. Kerrick is not worthy of breathing in the same air.Kerrick is a jerk. The romance, or should I say, bromance, in this book isn't between Avry and Kerrick, it's between Kerrick and Prince Ryne. As far as Kerrick is concerned, the sun rises and sets on Prince Ryne.\n“Because Ryne is a brilliant strategist, and has outsmarted Tohon before.”\nRyne is more important than anyone, more than the fate of his best friend, more than the fates of a girl.\n“In case you haven’t been paying attention, if Ryne is more important to me than Belen’s life, then he’s certainly a higher priority than some girl.”\nSave the Realm? Kerrick has absolute faith in Ryne.\nAn impossible task.”“Ryne will find a way.”“You can’t know that for certain.”“I can.” His gaze burned into mine. “I wouldn’t have spent two years searching for you if I didn’t have utter faith in him.”\nThroughout the book, Avry finds herself thinking of Ryne, dreaming of him, smelling his \"springtime sunshine\" scent. I don't buy it for a moment, because there is zero relationship development between Kerrick and Avry.Kerrick is a jerk, an abusive jerk.\n“No one else has backhanded me, starved me, manacled me to a tree and let me freeze each night. Therefore, I don’t have anyone else to compare you to.”\nHe is arrogant, he is unwavering, he is high-handed. I don't like him one bit, and I can't understand why Avry does.What can I say? I loved this book anyway. Damned book chemistry."}, {"userName": "Kat Kennedy", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "I avoided reading this book for a long time. I’d loved Poison Study but the word on the street was that the rest of the Study series wasn’t great and that Poison Study had been beginners luck. But I was kind of blown away by how much I loved Touch of Power. I simply couldn’t put it down and that flabbergasted me.This is one of those walking fantasy books where the characters spend a LOOOOOOONNNNGGGG TIIIIIIIIiiiimmmmeee goooooooooiiiiiinnnng plaaaaaaaaceeeees. However, there’s also heaps of action, world-building and just a bit of naughty-no-no shenanigans, so keep that in mind too. In fact, it was the perfect blend of walking, kick something’s ass, flirt and walk again to keep me glued to the page like some kind of junkee holding out for their next hit.We’re in this recently plague-ridden world that’s trying to pull itself back together and multiple kingdoms are struggling to reclaim power after many of the old ones have collapsed and fallen. Avry’s trying to live in this world but the problem is that she’s this badass healer and everyone is trying to kill her. Enter Kerrick.He kidnaps her against her will to heal his prince and thus begins our merry adventure. Let’s start with the fact that Avry kicks butt, I love her and I hope that one day I can find a girl just like her to marry and spend the rest of my life with. Kerrick, on the otherhand, can die a fiery death in the Pit of Despair for all I care. Avry was too good for you! Okay, so he eventually became bearable and I eventually stopped plotting his demise. The point is, when you hold all tickets for the Annoying Douche Train then you need to seriously consider riding it all the way to Getthefuckoutsville, dude.But, luckily, there is this cast of characters that I just loved with the passion of a thousand One Direction fans who’ve just read a Harry/That scrawny one fanfic. Belen and Flea particularly were adorable whilst Loren and Quain tended to blend into each other. It was also the bad guy, Tohan, that kind of helped make this book. He was so psychotic – swinging like a pendulum between titillatingly evil and just plain terrifying.The writing was certainly fantastic with rich and vivid descriptions of the countryside and people. It was very well paced, never boring or painful to read. The world building was interesting even if there were a couple of strange oddities to construction of Avry’s abilities and the over all way it ties into the story.But in the end, I was left bereft when this finished. Desirous of the sequel like a widow who just lost her lover. In the end, isn’t that what matters most? Otherwise what are we all here for?This review, and others like it, can be found on my blog,"}, {"userName": "Megs ♥", "userReviewDate": "Dec 29, 2011", "userURL": "http://www.goodreads.com/user/show/5691412-megs", "userReview": "[ The one gripe I had about this book was the way it ended. Throughout the whole book we are constantly reminded that Avry is going die because the plague will kill her when she saves the prince. I don't like that the story was built upon this solely because honestly we all knew this wasn't going to happen. I guess since this was what everything built towards it made the book have zero suspense for me, and kind of a \"I don't care\" feeling about what happens. Every time the author mentioned about Avry dying when she heals the prince I just kept getting really annoyed and rolling my eyes like...really? You're going to keep saying that? Then when the ending finally did come and we actually see what happened I was just like wow, that was lame. (hide spoiler)]"}, {"userName": "Christine Wallflower & Dark Romance Junkie ", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/11641363-christine-wallflower-dark-romance-junkie", "userReview": "Rating Clarification: 3.5 - 4 StarsI know everyone loved The Study series, which I've yet to finish but honestly... I enjoyed Touch of Power a lot more than I did Poison Study. Unlike the depressed and melodramatic atmosphere that I got from Poison Study, Touch of Power was a breath of fresh air. Don't get me wrong the first scene has the heroine listening to the tortured cries of a dying baby and contemplating whether or not she should heal her. But I loved Avry's \"glass is half full\" outlook on life. I've been trying to coin a term for this book because at a glance I would place it under the fantasy heading but personally it felt like I was reading post-apocalyptic (the plague) with zombies (the dead soldiers) against a medieval setting. Does that makes sense?Avry is healer on the run, since the outbreak of the plague and the death of so many, healers are seen as the cause and what's worse it seems as if they decided not to heal any of the plague victims.That's beside the point though because Avry is the last healer. When she's imprisoned after healing a child, things look pretty bad for her until Kerrick and his band of misfit (LOL) save her... for a price. Kerrick expects Avry to heal a dying (plague) Prince Ryen for his trouble and he isn't nice about it.\n\"You really have a low opinion of me, don't you?\"\"No one else has backhanded me, starved me, manacled me to a tree and let me freeze each night. Therefore I don't have anyone else to compare you too.\"\nI loved Kerrick and Avry's banter, I mean Kerrick was pretty mean and down right cruel in the beginning but I have a weakness for these types...But I did have a few issues, the author kind of neglected their relationship, so although it was a slow burn, any real progress between them was closer to end, making it seem rushed in my opinion. Be that as it may the other characters like Belen and Flea were fantastic, I loved how they were with Avry, their camaraderie was cute, I loved how protective they were of her, especially from Kerrick.\n\"No. I hate you. Remember?\" I teased.\"Couldn't possibly forget.\" He grinnerd. \"Just so you know, the feeling is mutual.\"\"Gosh,\" I said with mock horror. \"We actually have something in common.\"Kerrick laughed. \"Let's not let it happen again.\"\nI'll definitely be continuing this series, but like Poison Study I'm not itching to start the second book (Scent of Magic), so I'll be reading something else. But it was a good solid read."}, {"userName": "Ferdy", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/4596358-ferdy", "userReview": "SpoilersI enjoyed Snyder's Study series and I had high expectations for this… suffice to say it didn't deliver. Avry is a healer, she's been running and hiding for three years as anyone found to be a healer is executed, the healers are blamed for starting a plague that killed millions of people. Avry is in prison awaiting execution after it is discovered that she is a healer… she's saved from death by Kerrick and his friends who want her to heal their friend who is dying of the plague. Avry finds out that the friend who needs healing is Prince Ryne, someone who she refuses to heal as she believes that he is responsible for many deaths and is not worth saving. Avry very reluctantly agrees to go with them to where Prince Ryne is hiding as the alternative would be death and Kerrick and his friends Belen, Flea, Loren try to convince Avry that he is worth saving. On their long journey to Prince Ryne..they are encounter enemies, magicians, killer plants and zombies. The world building was mediocre at best. I did like that Avry suffered every time she healed someone. I despised Avry's attitude, she was treated like shit and she just forgave and forgot instantly, she felt guilty and responsible for anyone who was hurt even if they had hurt her or stood by and watched her get hurt, she gave her loyalty too easily… it was unbelievably frustrating. Kerrick her love interest was despicable he slapped her so hard she fell down just because she said she would not heal his friend Prince Ryne, he then goes onto manacle her to tree for weeks at night and only gives her little food and no blanket as further punishment for refusing to heal his friend, he is cold and talks down to her… he only starts treating her better when he realises his tactics to make her co-operate are not working. When he does start to get feelings for her he's not guilty or remorseful about the way he treated her — he just gives a very underwhelming apology and Avry doesn't even mind his past treatment of her!! He's also been grieving for the past 4 years because his ex girlfriend who was the love his life dumped him for someone else… Avry is basically a rebound. He more or less even says at the very end when they're 'in wuv' that he would have rather saved his friend's lives than her's. He's an awful hero and Avry is a crap heroine for getting involved with a man who hit her and then tortured her for weeks… it's a fucked up message to be sending young readers."}, {"userName": "Lissa", "userReviewDate": "Nov 08, 2011", "userURL": "http://www.goodreads.com/user/show/4973484-lissa", "userReview": "[ Only I wasn’t convinced that Avry had fallen in love with him by the end. Sure, Tohon was a much badder man than Kerrick, who was a knight in shining armour compared to the mad king, but I can’t help but remember all the horrible things he did to Avry in the beginning. Unlike Tucker, I don’t believe Kerrick really earned his redemption – and yes, I am being harsh here. I don’t really feel that Avry loved Kerrick – it was obvious from the beginning that he was the romance interest but it’s quite simply that he’s better for her than Tohon, who was her only other option. (hide spoiler)]"}, {"userName": "Caitlin", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/57334157-caitlin", "userReview": "I FINISHED A BOOK FOR THE FIRST TIME IN OVER A WEEK!! Since I was sick I fell into the worst slump ever and had absolutely no motivation to read but thank god this book pulled me out of my slump! It really was just a classic Maria V Snyder book and it was exactly what I needed. I really needed a basic fantasy since I have so many intimidating complex fantasy books waiting to be read that would have put me more in a slump. Thank god for this book, it was great."}, {"userName": "Nicklein Mae", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/6058998-nicklein-mae", "userReview": "This book gave me no chance at all to deal with my physiological needs like a normal human being. I. Couldn't. Put. This. Down.Giving synopsis is not my strong suit so please don't expect one. And I think it's better to read this not knowing much of the premise anyway.Avry is my new favourite heroine. She's brave, stubborn, strong, kindhearted, selfless and has a great sense of humor which I appreciate a lot. I gave her an imaginary standing ovation everytime she stood her ground against Kerrick and refused to blindly follow his orders. I couldn't help but root for her.The romance took a backseat here. Or maybe it's in the trunk because we didn't get to the good parts until the last five chapters. It was a slow burn romance that will make you feel all snuggly and warm inside.The story was very complex. It was magnificently crafted and built with so much precision you couldn't help but wonder if this world really does exist. The lines are blurred now, my friends.The writing was unbelievably gorgeous. It was alluring. You wouldn't find its brief paragraphs lacking of vivid descriptions and pragmatic illustrations. Maria V. Snyder's way of introducing us to the characters were more \"show\" than \"tell\" which I find very appealing. Her ability to tell a story is fantastic, she knows exactly that a great story shows.I am one of those people who get easily annoyed with lengthy explanations of character because where's the fun in that? I want to be the one to discover them. Not to be given on a platter.\"Why ‘Flea’?\"A full-out grin spread across Flea’s face. “’Cause I’m fast and hard to catch.”“Because he’s a pest and hard to squash,” Belen said.“Because he jumps about three feet in the air when you scare him,” Loren added.“Because he’s annoying and makes us itch with impatience,” Quain said.“Thanks, guys. I love you, too.” Flea made exaggerated kissing noises and patted his ass. ~•~•~•~•~•~•~•~•~•~•~•~•\"I taught him too well. Either that or Quain is half eagle.”“A bald eagle?” I quipped.Kerrick smiled a genuine smile. One that reached his eyes. Good thing I was already lying down or I would have fainted in surprise. It faded as he studied me. ~•~•~•~•~•~•~•~•~•~•~•~•He still didn’t trust me. I decided to let him sweat for a bit. “Let’s see. I promised her that Loren and Quain will babysit her granddaughter anytime. That Flea would give her soldiers lessons on how to pick pockets and that Jael can use you for target practice. I offered to keep Jael company for that one.”The others suppressed their grins, but Kerrick failed to find it amusing. “Avry,” he growled. ~•~•~•~•~•~•~•~•~•~•~•~•I am very attached to these characters it's not funny.Definitely a must-read. A solid 5 out of 5 stars."}, {"userName": "Kells Next Read ", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/44081906-kells-next-read", "userReview": "My Rating: 3.5This book was a tiny bit of a let down for me. Having read a few of Maria V. Synder previous works, I was going into this all hype and ready. Seriously...the book started so good, I barely had time to even put an update. I was like:\nAs I got further into the read the storyline began to drag and bored me to death. What saved this read was that I love Ms. Snyder style of writing and I knew if I soilder through I would definitely get to the pot of goal, at the end of the rainbow. The characters ( most of them, Kerrick and Belen ) were great and I can say that I like them and even manage to connect with them at different levels. I just found the storyline too predictable and drawn out at times and I'm also kinda of fed-up with the protagonist being the \"last\" of a particular people and the only hope to save everybody. It literally had me *RollsEyes* and:\nIt should be noted that my displeasure could also be related to the fact, that I ran out of coffee/tea *Screams* and barely could concentrate...who really knows. Whatever the reason, It has in no way affected my better judgement as I will be continuing this trilogy, because as I've mentioned before, I happen to love this authors writing style and she usually hits the bullseye mark for me."}, {"userName": "Catie", "userReviewDate": "Sep 27, 2011", "userURL": "http://www.goodreads.com/user/show/1886642-catie", "userReview": "2 1/2 starsI am and will always be a huge fan of Maria V. Snyder’s first novel, Poison Study. In fact, this is a little bit embarrassing but…I’ve read it three times. And I’m still not tired of it. I’ve also read every single book that she’s published, but nothing has ever reached the level of that first love for me. I like the Glass series, but I don’t love it. The Inside/Out series is a cool sci-fi dystopian departure for her and I like it for that, but again...don’t love it. So when I saw that the initial reviews for this one were positive, I couldn’t have been more excited to read it. Unfortunately, this is another case of “like but don’t love.” Except, I feel like this one is even more of a let-down, because it’s so similar to Poison Study. Avry is sentenced to die, but is “rescued” and asked to perform a job that may also lead to her death. She becomes part of a band of soldiers/men who train her in knife throwing and survival. The love interest is cold and calculating, and dedicated in service to a progressive leader. There’s even a scene where Avry must play hide and seek in the woods and camouflages herself with clay. Avry and Yelena also have a very similar voice, in my opinion.I do love the imaginative magic system; although, the healing is again similar to Poison Study. (Yelena also heals Opal by assuming her injuries.) I really like the history of the plague: how the grief of the populace, fueled by rumor, could turn to hatred of the healers. I love the feuding “boarding school for nobles” graduates. In fact I would say that the world-building is one of my favorite aspects of this book. But there’s not much else here.It’s like reading a version of Poison Study that’s been bleached of all nuance and drained of all emotion. A cold, matter of fact voice worked very well for damaged, solitary, and ruthlessly independent Yelena, but makes absolutely no sense for Avry, who’s a self-sacrificing, altruistic healer. I never felt anything past the very surface of emotion for these characters. I wasn’t affected at all when they triumphed, suffered, died, loved…. The romance is so completely dry. In many ways, this feels like the outline of a book: all the bare bones of story, action, and dialogue are there but little else.Perfect Musical PairingABBA – S.O.S.I still have hope that this author can publish something that will reach me at the same level as Poison Study. But until then, all I have to say is…What ever happened to our love? I wish I understood. It used to be so nice; it used to be so good."}, {"userName": "Elise ✘ a.k.a Ryder's Pet ✘", "userReviewDate": "Nov 10, 2013", "userURL": "http://www.goodreads.com/user/show/13567836-elise-a-k-a-ryder-s-pet", "userReview": "[No. (hide spoiler)]"}, {"userName": "Kogiopsis", "userReviewDate": "Nov 25, 2011", "userURL": "http://www.goodreads.com/user/show/1462364-kogiopsis", "userReview": "I'm definitely coming at this book from a different perspective than a lot of people I know, many of whom have read and loved at the very least Poison Study, and often more of Maria V. Snyder's books. This is my first by her and to be honest, I'm underwhelmed.The concept is by far the strongest part of this book. Fifteen kingdoms, eleven types of magic, a land recovering from a deadly plague - glorious. While I have certain issues with the varieties of magic (they seem to almost-but-not-quite be elemental, and moon/sun magic sounds basically useless), I like that there were so many different types, and that within them there seemed to be some variation in the strength of mages. I also enjoyed that the Fifteen Kingdoms seemed to have a lot of political variation in them, though as other reviewers have pointed out, some of the systems and terms felt anachronistic.I guess that's the primary problem I had with this book: strong concepts, but just not enough explanation to make them fit. Would reading 'president' in a world filled with princes bother me if it had been elaborated upon a lot? Probably not. But when you're already asking me to accept moon and sun magicians, giant flowers that eat people, and some really wonky pacing, well, the background needs to be rock solid and putting a democracy on a continent filled with monarchies doesn't cut it.The other big thing I wanted to mention was pacing. Whee-oo, did I have trouble with the way this book was paced. One page would be a single moment that dragged on far too long, and on the next weeks would skim by. I honestly gave up completely on keeping track of time here, because it was just so erratic and jumpy. Unfortunately, the fact that I had little sense of time also meant that I had little sense of character development.There were a couple of other things that bothered me - use of modern language throughout, some typos which were far worse than I've ever seen in an ARC (including a they're/their confusion), the really strange and rocky development of the romantic relationship between Kerrick and Avry, and a lot of plot points which were never dealt with. I was disappointed that even the main problem of the book wasn't actually resolved at the end, let alone some of the other plot points that had cropped up along the way. To be honest, the book felt too short in a lot of ways - too short to develop its concept properly, too short to wrap up the plot in a tidy fashion, too short to convey the amount of time the characters spent travelling and changing to the readers. Maybe the sequel can fix a lot of these issues, but I won't go out of my way to find it first and see. It's going to take glowing reviews from other people before I return to this series. I will, however, still seek out Poison Study, since Maria V. Snyder has one heck of an imagination.Full disclosure: I recieved a galley copy of this book from the publisher via Netgalley. No external considerations went into this review."}, {"userName": "♛Tash", "userReviewDate": "Aug 11, 2014", "userURL": "http://www.goodreads.com/user/show/5451856-tash", "userReview": "YASSS! I finished it! I really finished it after being tempted to just DNF so many times.I had a terrific experience reading Snyder's Poison Study. I remember the writing smooth and the world building vivid, so I expected the same thing from Touch of Power, but damn, I was so wrong. In this book, I found Snyder's writing a little amateurish. I had to check the publication dates of the Poison Study and Touch of Power to see which novel came first, and I was surprised to see that Poison Study was published 4 years before Touch of Power, so I do not understand the decline in quality of Snyder's writing. Her writing was especially unwieldy when describing landscape, fight scenes and even plans, as if she couldn't be bothered to tell us how Avry got to Tohon or how 2 guys can neutralize 6.Then we have Avry, sweet, kind, pretty, skilled, brave and selfless Avry. What can she do wrong? Nothing and that is my problem with her character. I know she's a healer and that she feels the need to heal everyone sick and is even willing to die for her calling, but shouldn't the human instinct to survive override the sacrifices of her calling? Maybe I am just a selfish little shit and obvs not a heroine, so Avry didn't connect to me at all. Kerrick - I found quite meh. He's a prince and a forest mage, and starts out as a despotic leader of a group in a mission to find a healer but grows softer as the story progresses to the point he says things like \"And you broke through the ice around my heart...\" Yup. Then we have Tohon the all powerful life mage/necromancer, of course, he had to be handsome with a killer smile too, and a Daddy never loved me complex. In the book he tells Avry why he hates Kerrick. I'll skip the specifics, but damn, that was lame, so lame I screamed at my Kindle to grow the fuck up because high school angst should be left in high school! #intensityintensifiesI honestly think that the story will progress in the following books in the series, but, for now, I am done with this series. *fin*"}, {"userName": "Katrin D", "userReviewDate": "Oct 01, 2016", "userURL": "http://www.goodreads.com/user/show/7018363-katrin-d", "userReview": "RTC!"}, {"userName": "Kaitlynne", "userReviewDate": "Mar 01, 2011", "userURL": "http://www.goodreads.com/user/show/3001617-kaitlynne", "userReview": "I have absolutely no doubt that this book is going to be amazing!*After reading it*Yup, I was right. This book exceeded my expectations :)"}, {"userName": "Jen", "userReviewDate": "Sep 17, 2011", "userURL": "http://www.goodreads.com/user/show/3060045-jen", "userReview": "This review is for an ARC kindly given to me by the Amazon Vine UK Review program.Touch of Power is Poison Study good!!! *HUGE CHEER* I haven't enjoyed a book by Maria V Snyder so much in a long time (even though they are usually great); I stayed up reading til all hours and was even late to work because I couldn't put it down! I really hope you agree with me when you get a chance to read it. I would definitely recommend this as required reading for Maria fans ASAP!! I really liked Maria's new heroine, Avry. She is fierce and stubborn, but also kind and brave. I liked her so much more than Opal from the Glass trilogy. She is as engaging as Yelena from Poison Study without being too much like her... both characters share similarities, but they are not one and the same. Avry is a healer, who can take peoples' illnesses from them as a cure, but she must suffer the illness herself. Fortunately she has an advanced speed of healing, or she'd never get anything done! The story picks up in the aftermath of a devastating plague, which the healers guild were unable to cure without dying themselves. As a result, healers are not revered by society, but rather they are hunted drifters. Avry finds herself incarcerated, awaiting death, but then is rescued by a motley crew who want her to heal their leader, Ryne, who lies in suspended animation in a magical coma in a distant land. He has a bad reputation, and he has the plague; healing him would kill Avry. The gang (Kerrick, Belen, Vinn, Quain and Flea) do their best to convince Avry, through any method possible, that she should heal Ryne as they believe he is the only person who can bring all the shreds of their plague-ridden kingdom together and restore order. There are several other potential leaders who disagree though, and they all make a play for Avry to varying success. One develops into a wonderful villain, who just made my skin crawl! (Excellent work Maria!!)Avry travels with the gang for most of the book, and there is a really beautiful camaraderie which grows between them, after some testing times... of course there is a love interest, and the development of that aspect was simply delicious to read. When there was finally some kissing, I was in seventh heaven!! What I really enjoy about Maria's writing, as a whole, is that she creates characters with believable skills. I know she often learns these skills herself, and this time I really enjoyed reading about juggling and knife throwing! Magic is also woven very carefully through the seams of the book; no one is all powerful, but some people have really interesting talents. I also love how rich her characters are; I really feel like I know Avry, Belen, Kerrick, and Flea. I was initially completely baffled by the bizarre mention of the peace and death lilies, giant plants which can consume a man whole, but actually it all made sense in the end, and I am totally gutted that I have to wait for the story to continue!! This has all the makings of a really wonderful fantasy trilogy... now... how long do I have to wait for the next one?!"}, {"userName": "Maggie ☘ (Reader in Wonderland)", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/40477684-maggie-reader-in-wonderland", "userReview": "When I say that I was going into Touch of Power  with astronomical expectations I wouldn't be exaggerating. I hope that the next books will be even better, but this one was great. Enjoyable, captivating read. My only problem was, that I had too much expectations after reading Poison Study series.The first half of this book was rather slow-paced, the characters were constantly walking somewhere through the woods and I was slightly bored at first. But halfway through the book, the story finally picked up and interesting things started to happen! The characters were great. Well, most of them.Avry  was kind and selfless heroine and at first, I expected her to be one of those 'damsels in distress'. But she very much surprised me with her strength, stubbornness and spirit!“Sorry. An overdeveloped nurturing instinct comes with being a healer.”Belen 'Alias: The Poppa Bear' was definitely my favourite character. Big guy with even bigger heart! He was sweet, caring and protective of his little group of friends.“When we reached the door, Belen stepped in the way. 'If any harm—''Comes to her, you’ll rip out my arms. Got it,' Kerrick said.'I’m serious,' Belen said.'I know. Do you really think I’d put her in danger?''Not on purpose, but things happen that are out of your control.'Kerrick gave him a tight smile. 'You mean I'm not omnipotent?''You're not even semi-potent.''Is that even a word?' Kerrick asked.'He probably means you're impotent,' I offered.”Kerrick. When I say that I didn't like him at first, it would be an understatement. When we meet him in the first chapters, he's definitely not likable character. But I had in mind, that he's not supposed to be likable and that there's something behind his behavior. But through this book, you can see very slow character development on his part. And at the end I understood his actions and even started to like him. Maybe he'll impress in the next book!“No. I took this job in self-defense. Quain burns everything. Belen thinks jerky is all we need to survive. Flea's idea of a good meal is something that hasn't been in a garbage can first. And Kerrick poisoned us-”“Not on purpose,” Kerrick said. “The meat looked done.”Loren and Quain 'Alias: The Monkeys' were funny little duo. Sometimes I tend to confuse these two, because they seemed almost the same.“Thinking of learning the assassin arts, Belen?” Loren asked.“Isn’t that a rare flower? Maybe he wants to get into gardening. I hear that’s what older people do when they reach their dotage,” Quain teased.Belen shook his head. “Two brains and not a bit of intelligence between them. Good thing the monkeys are entertaining or I’d have left them back in Ryazan.”Flea lived most of his life in the streets. He's funny and curious boy, but also young survivor wise beyond his age.“Flea stared at us, \"I can't decide what's worse. Losing family members or not having a family member to lose.” And at last the villain of this story - Tohan. Twisted, jealous and psychotic maniac with daddy issues.“Yes. Living things do well under my care.” He gave me a wry smile, acknowledging the irony. “As long as I care about them.” Then he sobered. “People, on the other hand, are not worth caring for.”I kind of liked him and definitely need to know what problems will he cause in the next book - Scent of Magic!"}, {"userName": "Bird", "userReviewDate": "Nov 14, 2011", "userURL": "http://www.goodreads.com/user/show/1614841-bird", "userReview": "[A man who hits a woman in the beginning of the book CANNOT later become that woman's love interest. It just can't happen. Kerrick's behavior is inexcusable, I don't care how Snyder tries to explain it away. He's under stress, he's scared, he didn't mean it, blah, blah. It is NEVER alright for a man to strike a woman, and it certainly shouldn't happen between future lovers. How can I root for a hero who might hurt the heroine the next time he gets \"stressed\"? This is the second time Snyder has written about this type of romance, and I'm tired of it. (Readers of her Glass trilogy will remember that Opal is kidnapped and tortured by Devlin, who, by the end of the third book, has become her lover. But don't worry folks, it's OK because he was under the influence of magical blood at the time. You know, blood he chose to consume in his quest for power.) It really bothers me that Snyder excuses violence toward women so easily. In all honesty, it may cause me to stop reading her novels. (hide spoiler)]"}, {"userName": "Penny", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/7463065-penny", "userReview": "Actual Rating 2.5 starsThis book didn't make me feel. It was entertaining but that's all. There is no real story for most of the book. Many things happen but nothing traps you enough to want to keep reading. I almost din't finish it. Not because I did't like it, but because I wan't interested enough and it seemed as if I wouldn't be missing much if I did. I won't keep reading this series. I am sure the next installments would be pack with action, I just don't trust they would be emotionally engaging enough."}, {"userName": "Felicia", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/666892-felicia", "userReview": "So I enjoyed this book, but didn't LOVE it. Poison Study (by this author) is one of my ALL TIME FAVES so I can't help compare all her other heroines to that one, and no one ever lives up to her 100%. I enjoyed the magic worldbuilding, for some reason I just felt one step ahead of the characters frequently. I didn't 100% feel the attraction between the two main characters either, so maybe that made me a bit less invested. I enjoyed the heroine's POV though, and am interested to see the second in the series. Felt a bit young adult-ish in tone, so it would be good for teen readers."}, {"userName": "Cindy ✩☽ Savage Queen ♔", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/3222333-cindy-savage-queen", "userReview": "Rating, maybe 3.5? The book, as a whole, was a pretty solid read. The world itself was interesting. I enjoyed MOST of the characters and the plot of a bit slow at times but overall steady. I absolutely adored Avery. She is kind, caring, strong, smart, clever, all the things we like to see in a heroine. As a healer, she just wants to help people, even if the world hates her for it. But it had one major flaw for me, the romance.  “The heart is a strange beast and not ruled by logic.”  Ain't that the god damn truth because the romance in this book is certainly the opposite of swoon-worthy. With scenes like this:  With a strangled cry, Kerrick lost his temper. Belen lunged toward Kerick and I raised an arm to block Kerrick's strike, but we were too slow. Kerrick backhanded me across my cheek. The force of the blow sent me to the ground.  \nI knew I would not be on board with our main\"romance\". *Detailed review to Come*"}, {"userName": "Reynita Maharani ★ The Night Reader ★", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/43850323-reynita-maharani-the-night-reader", "userReview": "3 stars rounded down to 3 starsThis book was great and when I read it I enjoyed it so much but I got bored when I began reading chapter 20 although there are something that I didn't like about this book. But I still quite enjoyed it.What I didn't like :With a strangled cry, Kerrick lost his temper. Belen lunged toward Kerick and I raised an arm to block Kerrick's strike, but we were to slow. Kerrick backhanded me across my cheek. The force of the blow sent me to the groundwhen I read that I was so angry and I was like\"WHAT THE HELL!?!?\", because he supposed not to do that because he's a man.men don't hit women so he's not a man at all, he's an abusive man, Ugh!!I'm serious if I was her I would totally punch him, I wouldn't just stay on the ground and watched Belen defended me.- I really love reading books with a cold hearted guy but I really hate reading books with a cold heartless bastard and Kerrick is a cold heartless bastard but sometimes I liked him but most of the time when I read this book I didn't like him because he's too cold and it bothered me so much.- Oh, and Avry she's a nice woman and she loves children so much and she is a soft hearted woman , and sometimes I didn't like her because she couldn't defend herself from Kerrick and it made me angry and I don't like a weak female character and she is a little bit weak but Avry could hide for years and that was pretty amazing.- I love reading books with romance but I didn't get what I wanted from this book, and yes there's romance in this book but I just couldn't make myself loved Kerrick and the action was overload and I love reading books with 50% of romance and 50% of action but this book gave me 90% of action and 10% of romance.What I liked :The story :I quite enjoyed reading this book and the story was good and I awake at 02:00 AM because of this book.This book would be really great if there's more romance between Kerrick and Avry and this book would be really awesome if Kerrick didn't hit a woman too, but I still liked this book because of the story not because of the characters and I pretended that I didn't care about the characters when I read this book and it was so hard because sometimes the characters made me mad.and I think I won't read the second book or the third book because I don't really care about the characters or the ending anymore.I know lots of people love this book but I don't and I'm sorry if my review make you angry and I respect people who love this book because everyone has different opinion about books.ヾ(●⌒∇⌒●)ﾉ"}, {"userName": "Diana Stormblessed", "userReviewDate": "Feb 21, 2012", "userURL": "http://www.goodreads.com/user/show/6780660-diana-stormblessed", "userReview": "The plague has spread wiping out millions of people, and healers are being blamed. Despite the fact that they've been helping people for generations, taking people's symptoms of illnesses and injuries upon themselves to save their fellow townsfolk, they are now being hunted and killed virtually on the spot. Avery has been on the run for over 3 years, but her natural urge to heal overpowers her. She heals a child, and is therefore caught. The night before her execution she's \"rescued\" and subsequently taken prisoner by a band of men who want to use her for their own gains. What follows is the twists and turns of a story where Avery is a powerful political pawn. Which side will she choose, and will she make it out of this alive?I love me a good fantasy. Kings, swords, forests, and magic. What's not to love? The story telling and world building were wonderful. I fully got sucked into the story, if for no other reason than the characters.Avery - A very realistic, every day heroine, you know, outside of the whole magic healing thing. She's caring, but strong, standing up to herself and those who need it. She's smart and logical and not easy to take advantage of. I liked that she didn't start as a superwoman, but that she was taught self defense throughout the book, so that she didn't end up some helpless damsel in distress either.Kerrick - I have to admit, he was not an easy character to love. Kind of an ass, and not in a way I appreciated. I know he had his reasons, but trying to like him strained me.Belan - Poppa Bear. Big, kind, lovable protector. I loved him right from the start.Quinn, Loren, Flea - I'm grouping them together since they're more of secondary characters, but I was a big fan. I would totally love to be captured by them ;-)Ok, dislikes: I didn't love that I felt the story was a little predictable. My mind is sometimes uncontrollable, and though I try not to guess the endings, I often times can't help it. Though there were a ton of twists and turns, I was able to guess at a lot of them too easily for my liking. The book left me with a lot of questions, which I guess is perfect since there's a book 2 coming out next year. Oh, I must add that there's not a ton of romance in the book, so beware for the romantically needing, though there is some. Its more of a romantic tease, and I love me a good tease.I will most definitely be picking up the next one.For more reviews check out http://nightlyreading.wordpress.com/"}, {"userName": "Bonnie", "userReviewDate": "Sep 27, 2011", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "Expected Publication Date: December 20th 2011Touch of Power was kindly provided to me by Netgalley for Harlequin.Interested in more of my reviews? Visit my blog!2.5 starsThe StorylineTouch of Power is a new series by Maria V. Snyder that introduces Avry of Kazan, a Healer who is able to take illnesses away from another and take them as her own. The only illness that she can’t take without expecting to survive is the plague. Unfortunately, people believe that Healers are the reason the plague exists and she is forced to keep her abilities hidden from others. When she’s abducted by a band of rogues and told that they require her help to heal a prince who is sickened with the plague she must decide who’s life is worth more because only one of them will be able to survive.ThoughtsThis is actually the first novel I’ve read by Maria V. Snyder so I’m unable to compare it to her past works. I must say I did enjoy it, although I was hoping for more in the end. Even though this book is marketed to YA, I appreciated the fact that the main character was 20 years old and actually acted her age. Overall there was a major disconnect in the building of the story as a whole for me. I would have loved to see more explanation regarding Avry and maybe some information about her past. It was briefly touched upon but I think it could have been expanded even more. The world that Avry lived in had the potential to be a truly fascinating fantasy world but the author didn’t seem to find it fitting to expand upon that either. The lacking of explanation really made everything really confusing because it seemed like a fantasy world in olden times but there were various modern references that didn’t exactly fit. The author did best with the character development, their relationships, and their interactions. I’m not sure if I’m left with enough interest to continue the series but I’m sure this will become a favorite of die-hard Maria V. Snyder fans. Unfortunately, that just doesn’t include me."}, {"userName": "Shauna", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/6394569-shauna", "userReview": "2.5 starsThis book just didn't do it for me. I was really hoping for another Poison Study, or even another Storm Glass…well, I got neither.There's no depth to Touch of Power, the underdeveloped characters fall flat and the world-building is equally thin. Kerrick, the 'love interest', is a ruthless prick who backhands, starves and exposes our heroine to the elements in the hope that a bit of hypothermia will crush her resolve. Charming. The villain of the piece gave her better consideration than Kerrick did (yes, it's confusing but he experiments on little children so we know who to root for) Even so, I was never really more than mildly disgusted-again, flat. There is potential there though. Maybe with a bit of world-building, a lot of character development and a conveniently placed hole for Kerrick to fall into…Snyder might just have herself a sequel. *fingers crossed*"}, {"userName": "Giovanna", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/23204207-giovanna", "userReview": "Maria V. Snyder has lots of awesome ideas. Too bad she doesn't seem to know how to develop them to express their full potential. Because the potential is always there, but the execution turns out to be at least a bit sloppy more often than not. I started reading her books in an unconvential way, by picking up the trilogy that followed Yelena's. Then I read the first two books about Yelena and, after a year of having it in my kindle, this one. And every single time I end up thinking \"this had much more potential\", because there's always something that displeases me. In Yelena's trilogy I loved pretty much everything...and then Yelena turned into the biggest Mary Sue ever and the politics wasn't explored the way I had hoped. And too little Valek. Opal's trilogy has too much romance in it. It flows well, but there's, like, one different love interest in each book. Touch of Power had lots of potential: a plague that killed most of the kingdoms population, healers hunted like animals because they're believed to have spread it and a prince dying in a coffin, waiting for the last healer's help. Yeah...no.Touch of Power isn't a bad book at all. It flows really well and it's a fast, easy read, but it does have lots of flaws too. - The world-building is really generic. Even after finishing the book I know very little about this world. It's like the author didn't really bother describing the political situation before the plague. I don't know if it was laziness on her part, but apparently since the plague mucked up pretty much everything there's no reason to actually explain what was going on in more than 3 lines.- Wasted potential when it comes to the secondary characters. Avry is kidnapped/rescued by Kerrick and his...\"band\" of men, and ends up warming up to them. Now, this is not a case of stockholm-syndrome, as you might be led to believe from my description, but it brings me to the fact that the personality of most of the members of this gang is never fully developed. In fact, aside from Kerrick and Belen all the others are just there to make jokes and be funny. Which is something I found even in Yelena's series.- The romance...ugh, I'm really conflicted about it. Like, imo Snyder threw away a good opportunity to build a relationship that's completely different from Valek/Yelena. Kerrick and Avry could have been amazing, with all their banter and bickering but...at the beginning Kerrick is a dick. And I mean the kind of dick who bound her to trees not to let her escape and even hit her once. That was a big no for me. And I can't help but feel like Kerrick completely changed after that, so...what? How was that necessary plotwise? I liked the plot in general. I appreciated how the author took facts and beliefs that surrounded the spread of the plague and used them in a fantasy book. The healers' situation is taken from actual history and I did like how it was developed here. And I like some things about the main character. She's a special snowflake all the way, considering her will to be a martyr, but she's not a weakling and she does have guts. I liked that she would decide who she would heal and that she wouldn't heal Prince Ryne if not for a good reason. And she was willing to learn in order to survive. But all in all I didn't love her, didn't even like her that much, in spite of some admirable traits. The banter was in fact funny, but overall this is an average book. Touch of Power is a fast and compelling read. But not much more. In a gif:  #YuzuIsNotImpressed"}], "description": "Laying hands upon the injured and dying, Avry of Kazan assumes their wounds and diseases into herself. But rather than being honoured for her skills, she is hunted. Healers like Avry are accused of spreading the plague that has decimated the Territories, leaving the survivors in a state of chaos.Stressed and tired from hiding, Avry is abducted by a band of rogues who, shockingly, value her gift above the golden bounty offered for her capture. Their leader an enigmatic captor-protector with powers of his own is unequivocal in his demands: Avry must heal a plague-stricken prince, the leader of a campaign against her people.As they traverse the daunting Nine Mountains, beset by mercenaries and magical dangers, Avry must decide who is worth healing and what is worth dying for.", "title": "Touch of Power\n      \n          (Healer #1)", "url": "http://www.goodreads.com/book/show/10445208-touch-of-power", "average": 4.16, "cover": "https://images.gr-assets.com/books/1317629193l/10445208.jpg", "reviews": 3024, "authors": [{"url": "https://www.goodreads.com/author/show/445303.Maria_V_Snyder", "name": "Maria V. Snyder"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/10445208-touch-of-power", "http://www.goodreads.com/book/show/12541330-touch-of-power", "http://www.goodreads.com/book/show/13509158-touch-of-power", "http://www.goodreads.com/book/show/13075323-touch-of-power", "http://www.goodreads.com/book/show/16082686-touch-of-power", "http://www.goodreads.com/book/show/13073578-touch-of-power", "http://www.goodreads.com/book/show/16154900-touch-of-power", "http://www.goodreads.com/book/show/13124584-touch-of-power", "http://www.goodreads.com/book/show/60510.Poison_Study", "http://www.goodreads.com/book/show/46202.Magic_Study", "http://www.goodreads.com/book/show/1966969.Fire_Study", "http://www.goodreads.com/book/show/7059135-inside-out", "http://www.goodreads.com/book/show/6080889-storm-glass", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}