{"ratings": 57, "userreviews": [{"userName": "Elise (TheBookishActress)", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "\"an indigenous Mad Max: Fury Road\" whom else is crying"}, {"userName": "Bradley", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "I think this novel has been a LONG time coming and I'm glad it's here. Now. My only concern is that this UF series came out so late in the whole UF cycle thing. I needed this a decade ago. I needed a full American Indian mythological romp with Coyote and so many fantastic supernatural additions to my reading schedule! Not just fae and vamps and druids and wizards... I needed THIS!That being said, I really liked it. :) Flooding took out most of the world and it was like coming back home to New Mexico, one of the few places to survive the wipeout and the breakdown of society.So here we are... post-apocalyptic breakdown with a tight, tight supernatural native American pantheon coming to life. :) And I love Maggie. :)No spoilers. I will say that the plot is solid as hell and the magic is gorgeous and the action delightful. It's a primo UF that delivers on the fun factor, the mythological factor, and the character factor. :)Definitely looking forward to the whole series."}, {"userName": "Aila", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/25674512-aila", "userReview": "While this is only the first book in a series, I’m confident that Trail of Lightning will debut as a top Urban Fantasy book. The writing is absolutely captivating and my eyes were glued to the pages until 2 am in the morning, when I finally got to that climactic ending. Roanhorse does a fabulous job of creating three-dimensional characters in a refreshing dystopian world where ancient powers have come back after a multitude of natural disasters throughout the globe. I loved seeing the Navajo stories interweaved in the plot and the sneaky machinations of the immortals. Maggie is such a fierce, brutal main character who can be caustic at times, but ultimately triumphant. There’s a slight romance, incredible character development, and overall an introduction to a frightening world in the future where monsters lurk the earth.\n“But it was a narrow road that I walked. I had to be vigilant not to let it grow, not to feed it unnecessarily. Because my fate wasn’t decided yet. I could be a monsterslayer, or I could be a monster.”"}, {"userName": "Nina (Every Word A Doorway)", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/32524334-nina-every-word-a-doorway", "userReview": "Mad Max: Fury Road.Native American cast.Hunt for monsters.I have only 3 words: PLEASE BE GOOD."}, {"userName": "Allyson", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/6110662-allyson", "userReview": "I got this book from the author through a Give Away and I'm so excited! I wanted to sit down and read this is one sitting but life kept getting in the way. This just meant I got to savor every moment of the journey. A lot of people are describing this as a Mad Max Fury Road esque book and I definitely agree but it made me think that this is where the Western Genre should be going. Righteous Women traveling the land striking out against those who would mean to do harm. I think the ultimate description is a Navajo Buffy the Vampire Slayer goes on a Mad Max Fury Road type journey for redemption meeting a few familiar characters along the way. This book is wholly a Navajo book in every little moment and it gave such an incredible depth to the story that took it to the next level. Honestly my only problem is that I have to wait so long for a sequel. Definitely read this book. Definitely buy two copies and give one away."}, {"userName": "Cathy (cathepsut)", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/978552-cathy-cathepsut", "userReview": "This sounds really good! Have a look at this article, where the author answers some questions:https://www.barnesandnoble.com/blog/s...If you want to check out her writing, read this free short story:Welcome to your Authentic Indian Experience, at https://www.apex-magazine.com/welcome..."}, {"userName": "Nadine", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/3759963-nadine", "userReview": "I’m ignorant when it comes to indigenous people and culture (shameful, I know), so I jumped at the opportunity to read a fantasy novel where indigenous culture was the focus. Trail of Lightning is an exciting introduction to an interesting world with a kickass main character.One aspect of the novel that doesn’t work as well as it should is the world building. The world is so deeply entrenched in Navajo legends, myths, and stories that having a basic working knowledge of their history is almost required before reading. Roanhorse doesn’t clearly communicate the legends, myths, and stories that are central to the novel. As a result, there were things that went over my head or didn’t click until several chapters later. This lack of clear world building did negatively affect my enjoyment of the novel since some key plot points were slightly difficult to understand. As with the world building, the magic system in this world is tired to Navajo culture. Clan members are sometimes bestowed with powers. Maggie has the power of death. She’s able to kill effectively and efficiently. Her power almost becomes a burden as she’s forced to rein it in when it’s not needed. Roanhorse accomplishes the magic system flawlessly compared to the world building. The main character, Maggie, is fierce, kickass, and deadly. She reminds me of Katniss in that she’s determined and fiercely independent. Maggie also reminds me a little of Celaena Sardothien in that she’s just as deadly if not more. I could sit here and compare her to almost every poplar YA heroine, but there’s something about Maggie that makes her unique. While most of her YA counterparts that are deadly eventually face a crisis of morality in terms of their killing, Maggie never does. It’s refreshing to read a character in the YA genre that isn’t bogged down by a by the numbers morality arc. Overall, Trail of Lightning is a fantastic introduction to a captivating world full of complex characters. Throughout the novel, I had to put it down to research the Navajo people and culture for clarity and curiosity. Some may see this as a negative, but I see it as a positive. Anytime a novel forces me to see a different perspective or learn about a different culture, the novel has accomplished its job.YA fantasy needs more books like this!**I received an ARC via Netgalley for an honest review."}, {"userName": "Cindy ✩☽ Savage Queen ♔", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/3222333-cindy-savage-queen", "userReview": "I'm not huge on urban fantasy, but I am really looking forward to this one"}, {"userName": "Allison", "userReviewDate": "Sep 25, 2016", "userURL": "http://www.goodreads.com/user/show/16160690-allison", "userReview": "OH MY GODI was fortunate enough to read a super early copy of this and HOLY SHIT."}, {"userName": "Meagan", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/27847867-meagan", "userReview": "This book looks so dope!!!!"}, {"userName": "Teresa", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/51766846-teresa", "userReview": "Don't read very much fantasy at all in adult literature but I picked this book up due to a glowing review from a dear friend...and I LOVED IT!!!I read it in one evening...I couldn't put it down..my only complaint is that I have to wait a whole year to see what happens to Maggie and Kai...how will I survive Rebecca Roanhorse :( While reading it I found myself wishing that I knew Navajo so I could pronounce some of the words...I was so wrapped up in the story that I couldn't pull myself away to look them up...silly I know but Roanhorse sucked me in and didn't let me go until the very last page..and I am still craving more!Thanks to Simon & Schuster for the ARC!"}, {"userName": "Kathy", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/43400753-kathy", "userReview": "Umm...WTF was that ending?"}, {"userName": "Amanda (MetalPhantasmReads)", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/28513633-amanda-metalphantasmreads", "userReview": "Review is now up! Go request this book if you can before it comes out. Don't miss this!https://metalphantasmreads.wordpress...."}, {"userName": "Elena", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/3701038-elena", "userReview": "3.5 stars."}, {"userName": "Ann", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/2562832-ann", "userReview": "I had a hard time getting into this story. I'd read, lay it down and have to re-read again because I couldn't remember what I'd read. I'll probably read it again sometime in the future if I get the next book in the Sixth World series. Part science fiction, part apocalypse ending of the known world. Maggie is a monster hunter who joins with Kai to search for a missing girl. Lots of Native American myths and lore. Blends of witchcraft and old world technology aid or deter their search. Not my usual genre for reading, I'll give it another try at a later date."}, {"userName": "georgia ☽", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/6204446-georgia", "userReview": "mad max, diversity, monsters.me: *is completely sold*"}, {"userName": "Candice", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/5358434-candice", "userReview": "Rebecca Roanhorse's debut novel does not disappoint. Billed as an \"Indigenous Mad Max,\" the book boasts an entirely indigenous cast and follows monster hunter Maggie Hoskie as she teams up with an unconventional medicine man for a post-apocalyptic adventure of gods, tricksters, witches, magic, and Navajo pride. The character of Maggie is strong physically, yet suffers trauma from a previous relationship that shadows her every action (and the plot of the book). I was particularly impressed with how accurately Roanhorse portrays abusive relationships and one's reactions to abuse. Roanhorse carefully considers how emotions lead to thoughts and how thoughts lead to actions - and how those actions have consequences.The secondary cast is strong as well, and I felt for them as much as I did for Maggie. And of course, there's tons of action and adventure and monster killing a la some of my favorite fun TV shows, Supernatural and Buffy the Vampire Slayer.I highly recommend this book to anyone who enjoys Supernatural, Mad Max, and/or Buffy. Plus, I don't think I've ever read a book with an all-indigenous cast, and that was fantastic. I really enjoyed it!"}, {"userName": "Matthew Galloway", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/1872314-matthew-galloway", "userReview": "Very satisfying first entry in a new fantasy series... well, except that I MUST KNOW WHAT HAPPENS NEXT. It definitely takes the story arc to completion -- there's one sort of loose end, but I think it was actually answered. The issue is that I don't want to be done following Kai and Maggie on their adventures and learning more about this future. Luckily, it looks like there are at least two more to come!This was sort of an urban fantasy -- though in same what that Ilona Andrews' Kate Daniels series is. It's the future and cities don't quite work the way they do today... But certain bits are eternal. The dangers and benefits of such come into play as they try to solve a supernatural mystery that heavily uses Native American folklore (specifically, Southwestern). I've read other books that call upon Native American tales, but few have felt this authentic, yet unique.It's an excellent ride with good twists and great characters."}, {"userName": "Kira Schumacher", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/27101127-kira-schumacher", "userReview": "Vielleicht werden's noch fünf Sterne, muss ich sacken lassen, aber wow. This has been a hell of a ride. GOTT. SO VIELE GEFÜHLE. Wie bescheuert, es jetzt gelesen zu haben, wenn ich jetzt so lang auf weitere Teile warten muss. :o"}, {"userName": "Ivy Deluca", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/7751086-ivy-deluca", "userReview": "01/12/18: Haven't read it, but this cover? Stunning. Adding to TBR, stat."}, {"userName": "Coolcurry", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/23079142-coolcurry", "userReview": "Loved it. Full review pending until closer to the release."}, {"userName": "Lila", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/6659789-lila", "userReview": "That \"Mad Max: Fury Road with Navajo cast\" pitch was enough, but look at that cover!Damn, that is a good cover. I love her moccasins."}, {"userName": "Nadine Jones", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/115626-nadine-jones", "userReview": "That is a gorgeous cover."}, {"userName": "Alex Can Read", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/6850230-alex-can-read", "userReview": "This review first appeared on my blog Alex Can Read.Trail of Lightning is the first book in a new Urban Fantasy series by Rebecca Roanhorse, author of the multiple-award-winning short story “Welcome To Your Authentic Indian Experience (TM)”. Trail of Lightning is her debut novel and what a debut it is!Trail of Lightning was absolutely fantastic. Even brand-new to the field Roanhorse’s writing is easily on-par with Urban Fantasy veterans such as Seanan McGuire, Ilona Andrews, Patricia Briggs and Jim Butcher. I can’t help but compare Trail of Lightning to other UF series – and when I do, I’m comparing it to the cream of the crop, because that’s the level of quality here.Roanhorse’s Sixth World is a vivid dystopia, beautifully built and will appeal to fans of the Kate Daniels series. I loved exploring the world of the Dinétah. Set on the Navajo reservation in the Southwest, the community and landscape we’re introduced to is something new. Readers unfamiliar with Navajo customs and beliefs will definitely walk away having learned something new. I know I sure did. I would have liked a pronunciation guide for the many Navajo words Roanhorse uses throughout the book. I have absolutely no idea how to pronounce some of the words with double vowels and accent marks I haven’t encountered before.The main character, Maggie Hoskie (or Maggie Hostile as I began to call her in my head) will feel both familiar and fresh to UF fans. Maggie is a badass with baggage. She’s had a rough road to get where she is, and she’s not happy with her current situation. Things go from mediocre to worse as she follows the trail of monsters to their source. She is just the kind of character that Urban Fantasy fans love to love, but with fresh spins on everything so she doesn’t feel recycled, which is hard to do.There is a LOT of Urban Fantasy out there, and there’s a lot that feels recycled and tropey. Trail of Lightning dodges all of that to stand out from the crowd. I was simultaneously sucked in and blown away by the story. I can’t wait for the second installment, Storm of Locusts in 2019.Trail of Lightning hits shelves June 26, 2018 from Saga Press and should absolutely be on your radar if you’re a fan of UF.Thank you to Saga Press for providing a review copy via NetGalley in exchange for my honest review."}, {"userName": "Suncerae", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/20048724-suncerae", "userReview": "Maggie Hoskie is supernaturally gifted by her clan ancestry to kill monsters in the former Navaho reservation, now a refuge in a post-apocalyptic water world. The Sixth World has begun, and in addition to monsters, gods and heroes of legend walk the land again. Against her better instincts, Maggie reluctantly enlists the aid of Kai Arviso, a medicine-man-in-training to learn about a witchcraft that is creating a new breed of flesh-eating monsters, one of which kidnaps a little girl.Squarely in the YA fantasy genre, Trail of Lightening is a fun and exciting read that will keep you up past your bedtime! Maggie is a hard and mean fighter with trust issues, and her growth is well deserved and satisfying, especially with such good companions as Kai and Tah, and frenemies as Ma'ii (aka Coyote) and Neizghani (her former teacher and a god). I could easily read a book from the perspective of any of these characters.And speaking of Coyote, I am thrilled to see Native American myth teamed up with fantasy. This mashup seems so obvious yet there is deep well of opportunity in the fantasy genre. Most of the magic is in the form of clan powers, super powers that only manifest for a few individuals who experience a traumatic event. Plus there are also mythological monsters and gods. Upon seeing Coyote for the first time, I was nervous about his role and portrayal in the story, but I am very happy with the result.There are a few lines that ground the Native American perspective to modern times (which I love), including the oral stories about elders who lived in residential schools or survived the Long Walk. One of the local gang leaders was one of the original protesters at the Transcontinental Pipeline. And whereas the Navajo reservation may seem like a post-apocalyptic wasteland, the level of poverty rings true for today's standards.Add in some terrifying action, characters you want to cheer on, and a dash of romance, and you'll be reinvigorated with the young adult urban fantasy genre!Thanks to Netgalley and Saga Press for a free copy in exchange for an honest review!readwellreviews.com"}, {"userName": "Alice, as in Wonderland", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/12594253-alice-as-in-wonderland", "userReview": "I don't think it's mentioned enough how underrepresented Native authors are in the literary world, but this year looks to add a few more to the pond, and I couldn't be happier. And in scifi no less!!! Yaaaay!!After the floods of the Big Water, the North American continent is survived by the Dinetah. In this new but old world, the supernatural has returned, bringing immortals and trickster gods and monsters. Maggie is recovering from an It's Complicated relationship with an immortal monster hunter to whom she was an apprentice before she was abruptly left to fend for herself. Sent on a monster hunting mission of her own, she finds traces of a bigger fish - a witch with the power to create the monstrosities. With her is a young, charming, and handsome medicine man named Kai who defies expectations. The book's not particularly subtle about this pairing, but who cares, I love Kai.I will say that this is not a book that had my mind racing and rushing through pages so fast I nearly ripped them, but there's nothing wrong with an absolutely and perfectly solid post-apocalyptic read. It does itself great, and the world building adds the flavor to an already strong novel. After I read the book I kept thinking about the world, and especially how Roanhorse juggles the new-but-old, rebirth of the old world feeling and atmosphere. Details like how sugar and coffee have returned to their status as highly valuable commodities; another thumbtack keeping the pre and post-colonialism comparisons alive. And how Ma'ii presents himself, what he does, what he represents both physically and narratively-... oh, so good. So good.I love Maggie and Kai too - Maggie is one of those characters that I'm not entirely sure that many people would enjoy outside of myself, but I like disaster characters with heart, and Maggie is a swamp of complicated, conflicting feelings that I really liked reading, plus her growth and torment over being on the line of monster and monster hunter. And Kai is fun for the more cavalier disaster character; despite Maggie's slow build, I was charmed by Kai right from the off. This book had so much to say and hits all the notes while also juggling a heavenly plot that feels unstoppable as the lightning."}, {"userName": "Gretchen", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/3433163-gretchen", "userReview": "I loved this! A powerful young woman with a troubled past and a hardened heart, Maggie Hoskie fights monsters both literal and metaphorical, all the while fearing the potential monster inside herself. The writing whizzes along and the plot doesn’t ever quite succumb to its own tropes—a vibrant cast of secondary characters both human and not flesh out the story and give Maggie plenty to worry about besides herself. The magic is really cool, the world feels energetically alive and varied in a way you don’t always see in post-disaster stories. I was so glad to have a story centering Native characters, communities, and contemporary life laid in with a living mythology, thrown into a dystopian-ish scenario. I want to know what happens next!"}, {"userName": "Seth", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/14215064-seth", "userReview": "What a fantastic debut. I felt I was reading something out of the wonderful folklore of the Navajo people. Mingling a heroine that is powerful beyond measure with the troubling all to familiar past of a hero finding their way. Set in a “post-apocalyptic” region of what is a different version of the current Navajo Nation. Where magic and gods are not just stories but hand in hand with every human. Where gifts of clans awaken and give life as well as identity to the characters of this rich tale. It’s a great start to a very fun ride. I look forward to journeying more into the Sixth World."}, {"userName": "Joe Jones", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/4547943-joe-jones", "userReview": "A great start to a new fantasy series that continues the trend of exploring different mythologies and settings. This time we feature Native American myths and folklore set in a dystopian world. Maggie is a great character full of flaws, but also with the heart of real hero if she just can accept who she really is. Perfect for fans of Katherine Arden's Winternight books or S.A. Chakraborty's City of Brass."}, {"userName": "Lisa", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/5937828-lisa", "userReview": "A very good start to a whole new science fiction and fantasy series. This series has both a post apocalyptic feel and fantasy elements. I received a digital arc of this copy through edelweiss and it did not disappoint. Wonderful world building. I would have given it five stars but it had a bit of a slow start to it, and towards the end it started to develop into a very rich tapestry that I cannot wait to visit again."}], "description": "While most of the world has drowned beneath the sudden rising waters of a climate apocalypse, Dinétah (formerly the Navajo reservation) has been reborn. The gods and heroes of legend walk the land, but so do monsters.Maggie Hoskie is a Dinétah monster hunter, a supernaturally gifted killer. When a small town needs help finding a missing girl, Maggie is their last—and best—hope. But what Maggie uncovers about the monster is much larger and more terrifying than anything she could imagine.Maggie reluctantly enlists the aid of Kai Arviso, an unconventional medicine man, and together they travel to the rez to unravel clues from ancient legends, trade favors with tricksters, and battle dark witchcraft in a patchwork world of deteriorating technology.As Maggie discovers the truth behind the disappearances, she will have to confront her past—if she wants to survive.Welcome to the Sixth World.", "title": "Trail of Lightning\n      \n          (The Sixth World #1)", "url": "https://www.goodreads.com/book/show/36373298.Trail_of_Lightning__The_Sixth_World___1_", "average": 4.37, "cover": "https://images.gr-assets.com/books/1515788168l/36373298.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/15862877.Rebecca_Roanhorse", "name": "Rebecca Roanhorse"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/36373298-trail-of-lightning", "http://www.goodreads.com/book/show/37864158-trail-of-lightning", "http://www.goodreads.com/book/show/39119490-welcome-to-your-authentic-indian-experience", "http://www.goodreads.com/book/show/36353103-race-to-the-sun", "http://www.goodreads.com/book/show/37920490-storm-of-locusts", "http://www.goodreads.com/book/show/39694593-untitled", "http://www.goodreads.com/book/show/39694586-between-earth-and-sky", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}