{"ratings": 531, "userreviews": [{"userName": "Anthony", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/4926949-anthony", "userReview": "I really like Hickmans early creator owned work, nightly news and Pax Romana are amazing books, but this was a real chore to get through and not very fulfilling when I finished it.It's done as almost a talking head documentary, with a presenter like character talking to the reader throughout the book, explaining what it is we're reading. And then there's the science, but because it's Hickman it's quazi-weird science fictiony science.If this had focused on the evil plotting monkeys and the people wanting super powers and it going horribly wrong for them, it might have been a better book.But, while there are some good ideas, the overall result isn't great. Took me 4 separate sit downs to read the whole thing. I'd recommend for Hickman completists only (even then I'd try and find a cheap copy)"}, {"userName": "Mario", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/15433891-mario", "userReview": "Very interesting story. The \"documentary\" style added to the opportunities for humor in this sci-fi drama. The art and design, on the other hand, is definitely not up to the level of Hickman's other works. And they are an integral part of his style(just look at \"The Nightly News\" or \"Pax Americana\").As much as I liked it, and I did enjoy the story, this is among the lowest rated of Hickman's amazing body of work, for me. That aside, you should definitely give this one a read if you're into sci-fi, graphic novels, or anything by Jonathan Hickman."}, {"userName": "Thom Dunn", "userReviewDate": "Jun 09, 2014", "userURL": "http://www.goodreads.com/user/show/3715519-thom-dunn", "userReview": "This book uses gorgeous artwork to tell an original story about the rise of Transhumanism as a corporate pissing match, and it embodies everything that is wrong with Jonathan Hickman as a writer.Don't get me wrong, Hickman is incredibly creative and kind of a mad genius — he's just a terrible storyteller. I've come to accept this fact. TRANSHUMAN is told as a \"documentary\" about the rise of the 3 largest Transhumanist corporations, which I guess is a clever conceit, except (1) why make a fictional documentary as a graphic novel? Why not, ya know, write a screenplay? and (2) the nature of those \"60 Minutes\"-style factual reporting documentary is, by nature, a summary, and therefore not a story. The story is told through interviews with a narrator and the people involved in the story, but they are literally just TELLING the reader what happened. It's almost remarkable that a graphic novel — a medium which is visual by nature — could rely so much on telling and not showing, and therefore breaks one of the cardinal rules of fiction writing. Sure, there are some interesting characters, and probably some cool dramatic, personal moments between them — namely, the divorced couple who end up working together on the Transhumanist project despite their mutual hatred for one another, who ultimately backstab each other again — but frankly, it's not very interesting to just see someone tell you that. I want to see it happen, I want to witness their interpersonal relations. If these were a real-life documentary from 50 years from now, and it aired on 60 Minutes or whatever, it would probably be great, because investigative journalism can get away with digging deep and just reciting facts (although I'd argue that most award-winning works of investigative journalism still manage to find a compelling human angle, something for the audience to emotionally engage with that makes them follow the story through to the end). In TRANSHUMAN, we just get a bunch of talking heads telling us what already happened, and a narrator / director to steer us away from any unreliable sources. There is literally nothing compelling or human to pull you through the story.When Hickman first broke out onto the comics scene, I thought he was fantastic, but the truth is, he's good at creating the ILLUSION of good story telling. Everything he writes is done in summary, with a few cool moments in between to make it feel human. A friend of mine summed it up well as citing the difference between \"The Lord of the Rings\" and \"The Silmarillion\" — one is a story about characters that we care about, the other is a play-by-play history book, and Hickman writes the latter. I think Hickman would be better off as an idea man, leaving other people to actually execute these epic stories of his. Because the worlds he creates are always unique and fascinating, full of complex politics and otherworldly visions. But saying \"HERE'S THIS CRAZY WORLD I CREATED AND THERE ARE THESE GUYS AND THEN THESE TWO FOUGHT AND THEN THIS GUY BETRAYED THIS GIRL AND THEN THIS PERSON WON, THE END\" is really not a fun story to read."}, {"userName": "Paul W.", "userReviewDate": "Dec 03, 2012", "userURL": "http://www.goodreads.com/user/show/4692703-paul-w", "userReview": "This was entertaining but a little too wink and nod for me. Hickman tries to mix some humor with an interesting subject, but instead ends up with less of both. He does some X-men analogues and but it doesn't show his usual cleverness and verve. Without any clear heroes or villains, it just seems somewhat flat. It could have and should have been better."}, {"userName": "Rebekka", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/11605144-rebekka", "userReview": "I liked the concept and story idea; however, found it difficult to concentrate and become fully immersed inthe world due to the documentary style story-telling. Felt like I was always on the outside; maybe that's what they wanted. More to come but those are my initial thoughts."}, {"userName": "Trevor Durham", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/8184213-trevor-durham", "userReview": "Ffs Hickman, just write this as a novel. The visuals barely matched and the art did distaste to your already convoluted tale."}, {"userName": "Dave Wenzlick", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/24527275-dave-wenzlick", "userReview": "Just OK."}, {"userName": "Mike", "userReviewDate": "Feb 17, 2012", "userURL": "http://www.goodreads.com/user/show/1776702-mike", "userReview": "This book starts off with a catchy hook: documentary style storytelling, talking to the audience as if they already knew all the salient details of the story about to unfold. It's damned addictive, because Hickman tantalises the reader with hints and tidbits of massive changes to human history that he's deliberately withholding from us.This book also surprised me with something I'm not used to from Hickman: emotional undercurrents and \"dirty\" art. Hickman has an ear for smarm and other passive-aggressive emotional tone, and he's sarcastic and dry enough to bring out some genuine belly laughs from me.And the art is a nice departure for what Hickman allows/directs: Ringuet does the clear cues as well as other Hickman artists, but he also has a more organic and definitely \"spattered\" style in this book's art that lends an extra layer of \"verite\" to the documentary format. The book conveys a virile sense of petty emotions, veering careening jealousies and overall bad behaviours. It's quite an indictment of all those with whom Hickman must've worked in his pre-comics career, because this sure reads like an up-close-and-personal examination of personalities and egos that I sure wouldn't expect to be able to invent out of thin air."}, {"userName": "Anna", "userReviewDate": "Oct 01, 2013", "userURL": "http://www.goodreads.com/user/show/14428846-anna", "userReview": "Issue 1 - Interesting way to write this - in a documentary style. I'm feeling an underlying \"badness\" leaking through the pages that I'm sure will come up eventually.Issue 2 - Losing interest here. All the money talk and business stuff is boring to me. Though I was a bit amused by the We3 reference...Issue 3 - Still rather bored with the business jargon, even to the point where the story itself is getting boring. I don't much care about the monkeys. I care about the genetic enhancement stuff, but that doesn't seem to be permeating the comic as much as I'd like.Issue 4 - The ten years after was pretty boring too. Until the last few pages (although I saw the bit with the narrator coming). Then everything wrapped up pretty nicely. Amazingly, in fact. Interesting idea to think about.Overall - The last few pages stuck out for me more than the rest of the series, since I think most of the story was lost in business and politics. But the idea of the comic was pretty frightening. However, I find it to be interesting that mankind's downfall was merely because of a stationary choice in evolution. I still could see that as evolution/adaptation, even if it isn't transitory. But I understand how this story developed otherwise in relation to nature."}, {"userName": "David Maine", "userReviewDate": "Jun 05, 2011", "userURL": "http://www.goodreads.com/user/show/588387-david-maine", "userReview": "Jonathan Hickman came to my attention three years ago, when he was writing independent comics and publishing them through Image. his debut The Nightly News was fantastic, blending a strong visual/graphic arts sense with a fractured storyline. Transhuman is his follow-up and it's not quite as good. Although entertaining, it's short (four issues, or chapters, as compared to six), and it feels a little thin. It's still entertaining and the art is okay, but it's neither as good as The Nightly News nor Pax Romana, which would come after. Hickman on a bad day is still better than most comic writers at their best, though, so this is worth a look. In recent years he's joined Marvel and gotten pretty silly writing SHIELD and Fantastic Four and so on. I hope he returns to his own original work soon--the man has ideas to burn and it's a shame to see them in the service of the corporate monolith. Just my two cents..."}, {"userName": "James", "userReviewDate": "Jun 30, 2014", "userURL": "http://www.goodreads.com/user/show/1927268-james", "userReview": "An early work by Jonathan Hickman, taking us through a tongue-in-cheek tour of a post-human future. Humanity has been transformed by robotic implants and genetic engineering, and \"Transhuman\" takes on a \"behind-the-music\" journey through the corporate misconduct and mutated super-monkeys it took to get there.It's a decent idea, but the execution doesn't quite work. The story here is too slapdash to serve as a serious exploration of the concept, but there aren't enough laughs for it to serve as a spoof either. (Plenty of the jokes revolve around rape too.) I've enjoyed Hickman's other work, but this seemed pretty mean-spirited without offering much in return, and I was happy to be done with it.The art by JM Ringuet isn't too my taste either--it's sketchy and inky, with lots of heavy lines and ugly faces. This seems like an early effort, and most readers have better options when it comes to Hickman's bibliography."}, {"userName": "Eloisa", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/10219633-eloisa", "userReview": "I loved this.It is part of a series yet each volume has an independent story, so you don't miss out anything background-wise on some characters if you only read one of them, like I did.I love this.You pick it. Open it and start checking out the pages and the first thing that crosses your mind is: \"webdesign\". This comic looks like a website! Indeed, not only the design of the covers of the chapters calls out for the web user in me, but along the story there's little details that keep evoking the web. Very... wiki-like! I friggin' love it.The story is all about transhumanism in a documentary style. It's as if we, the reader, are watching a doc, years past the events of the story. It's not just that, though. What makes me really love it is how it all revolves around genetics, mutations, experiments, human nature, post-humans and... well, see for yourself. Disregard the foreword and pick it up. Read it. :D"}, {"userName": "Artur Coelho", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/3865852-artur-coelho", "userReview": "Esta obra saída da interessante mente de Hickman promete mais do que fornece. Pelo título e temática esperaríamos uma reflexão visceral sobre genética, cibernética e transhumanismo com a acutilância similar à de The Nightly News teve para com a manipulação dos media. Mas Hickman não vai por esse caminho. Constrói um divertido falso documentário sobre capitalismo desenfreado aplicado ao transhumanismo que mistura experiências com genética aumentativa ou cibernética. A crítica aos gigantes da informática é ténue, mas está lá, com aventuras financeiras decalcadas das guerras entre os fundadores das maiores empresas tecnológicas contemporâneas. A história em si faz-nos pensar que culminará nalguma super-humanidade similar aos mundos de fantasia dos comics de super-heróis, mas aponta para outros possíveis beneficiários da extensão artificial das capacidades naturais enquanto os humanos se contentam com simulacros de eternidade."}, {"userName": "Nick", "userReviewDate": "Oct 24, 2015", "userURL": "http://www.goodreads.com/user/show/724379-nick", "userReview": "While I enjoyed most of this book, I couldn't help thinking that it might have been better at several points in the story with stronger editing. In a few cases, Hickman chose cute or snarky over believable, giving it a style halfway between a dark humor mockumentary and a serious cautionary tale. The blend did not always work well, although the ape versions of the X-Men and a nod to the series We3 were both amusing. The discussion of the boundaries of sentience and the morality of bio-enhancement were the strong points of the serious side. Unfortunately, a few scenes were played for shock value, in ways not quite convincing. Mad science at its worst, among other things.Still, the story had its moments, enough that it was worth reading. Be warned, though, that there is a really weird cross-species rape scene, and a pretty offensive follow-up to that part of the story [rape victim reaction, which doesn't show up until later in the book. Ewww...That cost the book a full star.]."}, {"userName": "Jennifer", "userReviewDate": "Mar 25, 2009", "userURL": "http://www.goodreads.com/user/show/2160868-jennifer", "userReview": "I liked the premise of the story but I can't say the book grabbed me. This story is imagining a future, a time when it's easy for people to purchase enhancements that let them live longer, healthier lives, or to purchase cybernetic limbs. The two different approaches to improving humanity had led to corporate warfare, and that's what the story focuses on, the leaders of the various companies responsible for the new technology. It's set up as a documentary, told years after the events in question took place. So there is a very deliberate, procedural nature to the structure which results in dry storytelling. There are a few well-done reveals, but on the whole this isn't an exciting read."}, {"userName": "Nuno Ribeiro", "userReviewDate": "Apr 23, 2016", "userURL": "http://www.goodreads.com/user/show/34442147-nuno-ribeiro", "userReview": "My favorite so far, from Hickman. Less of his paranoid, conspiracy theory atmosphere and a lot of his dark humor. This reminded me of a movie that I watched a couple of years and was never able to remember its title again. (I would forever be grateful if anyone knows the tile). It's a horror mockumentary (fake doc/found footage-esque) movie about an event in a facility where weird experiments had taken place. And we know about what happened documentary style, mixed with the found footage. Does anyone know what that movie is?"}, {"userName": "Joe Young", "userReviewDate": "Nov 12, 2013", "userURL": "http://www.goodreads.com/user/show/37876-joe-young", "userReview": "Jonathan Hickman - WriterJim Ringuet - IllustratorA very interesting story told as a documentary examing the rise, competition and decline of two companies responsible for the development of technology that led humans to the next level of evolution - hence the title \"transhumans.\"Gripping writing and fascinating ideas by Hickman carry this story. The art by Mr. Ringuet is mediocre and rather static. Still, if you're in the mood for a wordy, idea-rich comic this is right up your alley.Recommended for people who like words.4/5"}, {"userName": "Daniel Parks", "userReviewDate": "Feb 16, 2013", "userURL": "http://www.goodreads.com/user/show/5110749-daniel-parks", "userReview": "Genetically engineered super intelligent and super horny chimps brutally anger raping genitically engineered superheros? Sign me up! Extra kudos for the blatant shout out to Grant Morrison in the form of a panel showing the dog and cat from We3. Only 4 stars because it's not so much an in depth, fully formed story as it is just a series of twisted jokes riffing on an interesting sci-fi concept. He's done much better work (see The Nightly News), but this is still top notch insanity from one of the medium's best."}, {"userName": "Tom", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/1825627-tom", "userReview": "An interesting sci-fi satire set sometime in the near future. A documentary is being made about a pair of companies, originally fronted by a pair of angry ex-spouses, each trying to come up with a way of improving the human condition using various combinations of cybernetics or genetic engineering. I'm not sure I would call it all that funny, but let's say the final reveal on the last couple pages hammers the satirical message home, and it turns out there was a clue in the narrative the whole time if you stopped to think about it."}, {"userName": "Brian", "userReviewDate": "Aug 28, 2014", "userURL": "http://www.goodreads.com/user/show/2644953-brian", "userReview": "One of the most poorly told stories I've ever encountered in any medium. Hickman is one of my favorite writers, but this felt like pure masturbation, an idea he felt was too good for the world not to have, though he didn't feel like putting in any work to do it justice. It's 100% exposition, and tired exposition at that. I would not recommend this book to anyone. It only receives two stars instead of one because the art is decent."}, {"userName": "waits4thebus", "userReviewDate": "Feb 22, 2014", "userURL": "http://www.goodreads.com/user/show/1709077-waits4thebus", "userReview": "Hmm. Documentary style story telling the age of genetic manipulation, or the beginning of the next phase of human evolution. There were moments of boredom, and the art wasn't really likeable, but the ending was interesting. I did like applying an analysis similar to writeups of Apple to something that hasn't happened yet. Predictably, even when we have the options of improving humanity, we are still selfish, greedy mammals."}, {"userName": "Jason Alvey", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/15230304-jason-alvey", "userReview": "Nice work by Hickman, with the pseudo-documentary style and the social commentary with just-satirical-enough bite. JM Ringuet's art balanced the televisual approach and the fantastical content well - in all it's a pretty compelling read. Ostensibly a story about evolution, I was most intrigued by what Hickman had to say about business and innovation. A great example of what comics can be."}, {"userName": "Malcolm Ross", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/20724031-malcolm-ross", "userReview": "I picked up this because it said transhuman and I am a total sucker for that, I admit it. But Hickman didn't disappoint. The comic reads like a documentary about the history of some future transhuman culture, playing prototypical but well fleshed out and interesting characters against each other. And the art is good too!!!!"}, {"userName": "Blake Petit", "userReviewDate": "May 07, 2012", "userURL": "http://www.goodreads.com/user/show/2385250-blake-petit", "userReview": "Really clever sci-fi story. It's a semi-thriller about a pair of tech companies racing each other to change the world with enhanced humans. The story is told in the form of a documentary after the race is over. The conceit works well and nicely hides a clever twist at the end. Some funny bits and some great science fiction make this one of my favorite works by Hickman."}, {"userName": "Jeff Raymond", "userReviewDate": "Aug 22, 2011", "userURL": "http://www.goodreads.com/user/show/32271-jeff-raymond", "userReview": "A strange, well-done story. Not really sure what to make of it - it's a satire of sorts, not always successful but not a failure either, but quick and interesting enough to be worth my time. Closer to a 3.5, I suppose, but I can't really figure out what I liked or disliked about it, if that makes any sense."}, {"userName": "Dann", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/21411070-dann", "userReview": "As an academic/PhD candidate focusing on transhumanism/posthumanism, this comic was an interesting read. The art is gritty, but works well with the story. A little disappointed towards the end, but overall, I enjoy the faux documentary style. Nice concepts, and wonderful ideas."}, {"userName": "Xavier", "userReviewDate": "Jun 13, 2013", "userURL": "http://www.goodreads.com/user/show/5886062-xavier", "userReview": "maybe 3.5 the book was enjoyable enough i suppose but like the story mostly goes nowhere. there's a lot of talk and not a lot of doing? i don't know but i do know this book had so few women but they were treated like shit so yeah."}, {"userName": "Chris (The Genre Fiend)", "userReviewDate": "Dec 27, 2012", "userURL": "http://www.goodreads.com/user/show/3636189-chris-the-genre-fiend", "userReview": "A confronting, stark portrayal of humanity's self-destructive quest for perfection, evoking a mashup of Gattaca, Planet of the Apes and the real-life machinations of companies like Apple and Microsoft. Bloody good stuff."}, {"userName": "Nick Kives", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/2816960-nick-kives", "userReview": "This was an odd book, but the last chapter brought it all together and made it great. It was kind slow since it was setup as if you were watching a documentary with a narrator who is doing interviews throughout to tell the story."}, {"userName": "Daniel Edelman", "userReviewDate": "Feb 12, 2014", "userURL": "http://www.goodreads.com/user/show/19581064-daniel-edelman", "userReview": "An absolute insult to the medium of comics. You are given the privilege of doing ANYTHING by Image and the best you can come up with is a bunch of people talking to camera. And the art is horrible. This has taken the top/bottom spot as my least favorite comic of all time"}], "description": "Jonathan Hickman and JM Ringuet present a mockumentary about the future, where genetically engineered humans are created by rival companies in an attempt to corner the market under the guise of bettering the world. Transhuman is an irreverent view of the origin of a new technology, the starting of rival companies, the piles of cash made from taking them public, and the marketing wars that end with one company dominating the other.Collecting: Transhuman 1-4", "title": "Transhuman", "url": "https://www.goodreads.com/book/show/3437311.Transhuman", "average": 3.37, "cover": "https://images.gr-assets.com/books/1427476764l/3437311.jpg", "reviews": 55, "authors": [{"url": "https://www.goodreads.com/author/show/356424.Jonathan_Hickman", "name": "Jonathan Hickman"}, {"url": "https://www.goodreads.com/author/show/6616011.J_M_Ringuet", "name": "J.M. Ringuet"}], "type": ["Sequential Art", "Sequential Art", "Science Fiction", "Fiction", "Graphic Novels Comics"], "outlinks": ["http://www.goodreads.com/book/show/3437311-transhuman", "http://www.goodreads.com/book/show/17929637-east-of-west-vol-1", "http://www.goodreads.com/book/show/15736709-the-manhattan-projects-vol-1", "http://www.goodreads.com/book/show/18809235-east-of-west-vol-2", "http://www.goodreads.com/book/show/22358464-east-of-west-vol-3", "http://www.goodreads.com/book/show/17124883-the-manhattan-projects-vol-2", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}