{"ratings": 6726, "userreviews": [{"userName": "Olivia", "userReviewDate": "Nov 27, 2015", "userURL": "http://www.goodreads.com/user/show/43582060-olivia", "userReview": "[ she is injured after the crash (hide spoiler)]"}, {"userName": "Mackenzie Dare", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/17677721-mackenzie-dare", "userReview": "This was a great book! It’s a good, clean love story with lots of intrigue and action. The author is obviously knowledgeable about navy seals, and aircraft carriers which makes it fun to read and 100% believable. I love how Dee Henderson really draws you into the story and makes you feel like you are right in the middle. I loved reading it! Though I’m a little behind on posting my review, this story really only took me about two days to read because it was so captivating. I really wanted to see what was going to happen next and loved the action scenes. They seemed so real. My favorite part is toward the end when the reader gets to hitch a ride along with Gracie on her bomber as she flies full speed ahead into mortal combat."}, {"userName": "Sarah Smith", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/11331062-sarah-smith", "userReview": "I enjoyed reading \"True Valor\" just as much as I enjoyed reading the previous novel in the Uncommon Heroes Series, \"True Devotion.\" Since I am -- and always have been -- an absolute sucker for series, it was so wonderful to have a connection back to Joe \"Bear\" Baker and his lovely newlywed wife of two years, Kelly Jacobs Baker. However, I was also thrilled to meet and form a fast friendship with another Navy SEAL in that same unit, Tom \"Wolf\" Yeats. After meeting Wolf, I was introduced to his brave, fabulous cousin, Lieutenant Grace Yeats; his beautiful, endearing girlfriend, Jill Stanton; and Jill's older brother, Bruce \"Striker\" Stanton. And, may I say...I fell in love with this foursome immediately!!!! ;-) Throughout the pages of this novel, these four individuals demonstrated friendship, respect, love, and appreciation for one another, as well as the job that each one held. They also embodied the true meanings of the terms patriotism and sacrifice in a very powerful and heartwarming way. Then, of course, the entire plot of \"True Valor\" was filled with adventure, rescue, and romance that ALL kept me hanging on the edge of my seat. Like me, if you are a reader who enjoys seeing all the aforementioned elements of a story; hold a deep respect and appreciation for brave men and women who serve in the military; and gravitate toward a work of fiction that is saturated in the importance of developing a loving, trusting, and enduring personal relationship with Jesus Christ, I would hope that you would enjoy this novel just as much!!!! ;-) Bravo to Dee Henderson!!!! This is another great work, and I can not wait to finish the rest of this delightful, inspiring series!!!! Thank you ever so much again, Ryan, for sharing this recommendation with me."}, {"userName": "Leah", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/3725802-leah", "userReview": "The second book in Dee Henderson's Uncommon Heroes series focuses on the love lives of two military people. Grace is a Navy pilot. Bruce is an Air Force Pararescue Jumper. The two met through relatives. Grace's best friend is dating her cousin. Grace's best friend's brother happens to be Bruce.The story is about how two people in the military, two different branches of the military, can fall in love and have what amounts to a long distance relationship. Many letters written by Bruce and Grace included scripture references at the end. The actual verses accompanied it, so the reader does not have to look it up. It's right there, which is nice and convenient. The front of the book includes a map of where the two are stationed in and around Turkey and Iran. I liked being able to see where they were and not trying to inaccurately place them in my head.I did have a hard time at first keeping up with who was who since many nicknames were used. Bruce is Striker. Tom, Grace's cousin, is Wolf. They have coworkers nicknamed Pup and Bear. I had to reskim the beginning, but I finally got it straight and was able to keep it that way through the rest of the book.The Uncommon Heroes series is not as good as the O'Malley Series, but it is suspenseful and appealing in its own right. The books are only loosely connected, so it's not so much a series as a set of books with a common theme. If you're a fan of Dee Henderson this book will not disappoint."}, {"userName": "Jeni Enjaian", "userReviewDate": "Oct 11, 2013", "userURL": "http://www.goodreads.com/user/show/4680796-jeni-enjaian", "userReview": "*Update* I was not as generous this time reading through. Everything I mentioned in the previous review still holds true and felt exaggerated this time. This book did not survive round two of the purge from my personal collection.I tried really hard to like this book as much as the first in the series but I just didn't. There's too much in this book that is disjointed, unconnected and without driving force. Rather than saying that there's anything wrong with this book, I'll say that there wasn't anything right. I never really connected with Bruce or Grace. The relationships between Bruce, Jill, Wolf and Grace, while explained briefly seemed to hint at a backstory not given in this book. The plot meandered through several months (maybe a year?) of the character's lives without having any really antagonist or driving purpose. That's the part that bothered me the most. I like my books to have a climax (at least the fiction ones). Without a proper climax (including a build-up to that climax and a denouement) the book flops around like an invertebrate. Thankfully the rest of Ms. Henderson's books don't suffer from this particular problem. It has enough to recommend it to keep it in my library but it's not one that will get another read through (probably)."}, {"userName": "Melody", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/18087456-melody", "userReview": "I have read maybe a dozen books by Dee Henderson and loved practically all of them giving them five stars. I did not enjoy True Valor nearly as much. she did not develop her characters enough, it was very surface in terms of their emotions, relationships, and their faith,; the scriptures used in this book did not resonate with me and the constant use of Air Force jargon which I did not understand made it a difficult read. My husband was navy and I have read Henderson's books about submarines, and solar systems and other technical areas with unique jargon and enjoyed them. She touches on some hard issues in this book about laying your life on the line for your country, the impact it has on loved ones, and the controversy of the U.S. entering into warfare in other countries. Yet it seemed almost as impersonal as a newspaper article."}, {"userName": "Emily", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/9083576-emily", "userReview": "I really did enjoy this book, and struggled with how to rate it. I chose 3 stars, because, honestly, there were a lot of forgettable parts to this book. Normally, I find Dee Henderson's jargon and descriptions immersing, but in this book, it seemed to be on overload. My imagination had a hard time processing, because a lot of the jargon was not in the glossary. I'm very much a word-lover, but military-specific wording is not part of my vocabulary. I loved the story about Gracie and Striker, but there were a lot of chapters that just weighed this book down. This was the first time I didn't absolutely adore one of Dee's books, so it's not stopping me from finishing the series :)."}, {"userName": "Jeremiah", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/20128033-jeremiah", "userReview": "This piece was intricately done by Dee Henderson and its very nature mirrors the life our brave men and women go though as they serve our countries and keep us safe by putting their lives in the line. but as love comes into the mix and two soldiers are drenched in love and cannot stay without taking to each other talk of letter writing an art we've lost thanks to social media. The choice of words and the candid ability Dee employs to take you to the front-line yet bring you back home full of love away from explosions and was is unprecedented. Just amazing"}, {"userName": "Sarita", "userReviewDate": "Nov 20, 2014", "userURL": "http://www.goodreads.com/user/show/37168935-sarita", "userReview": "This book was not as action packed and full of suspense as the O'Malley series or the first book of the Uncommon Heroes series. In the beginning I struggled to truly follow all the characters because it jumped between the character's real name and military name.I enjoyed the book, but did not loved it as much as Dee Henderson's other suspense books. For me it was more a fictional biography of life in the military. I enjoyed Bruce and Tom stories."}, {"userName": "AlegnaB †", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/9428172-alegnab", "userReview": "This did not have much action and wasn't very interesting. There were too many letters between the main characters because they were hardly together in person. I also didn't care much for the main female character, because her career as a Navy jet pilot was the most important thing in her life."}, {"userName": "Rebekah Tooley", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/43608220-rebekah-tooley", "userReview": "I didn't like this book as much as the last one for some reason. It just didn't speak to me, I suppose. This book was not so much focused on romance but other things as well. I enjoyed the flying and the different names."}, {"userName": "Tamara Tilley", "userReviewDate": "May 01, 2011", "userURL": "http://www.goodreads.com/user/show/1383724-tamara-tilley", "userReview": "I read this too long ago to give a good review. But, this is one of my all-time favorite books and favorite series."}, {"userName": "Stephanie A.", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/9617672-stephanie-a", "userReview": "A little heavy on the Christian angle but not as bad as I feared; it was actually the military jargon that dragged it down more. If you want a realistic romance between two seasoned members of the Armed Forces, especially ones who spend a lot of time on the job, this is definitely it. But I get why the religious theme is there, because it adds to the already overwhelmingly solid Classic Values foundation, starting with the theme of family in the closeness of the core four here: Bruce, older brother of Civilian Jill, who has a nice business managing the household affairs of deployed soldiers and is dating Wolf, who is Bruce's best friend / brother in arms and also the cousin of Grace, the other half of the central relationship / Jill's best friend. Bruce has also recently adopted an elderly yellow lab and is remodeling a house in his spare time, because being Pararescue wasn't enough to make him the archetype of American Hero. Grace is just starting to recover from the death of her serious boyfriend, so the romance is sweet and slow growing but very satisfying, never in any doubt or jeopardy as it progress from friendship to courtship, much of it epistolary. I like that Bruce has pretty much Decided on Grace as his future wife from the start, but never pressures her or expects more than she's ready to give.And of course, given that she's a pilot and rescuing soldiers in trouble is literally his job, those two things eventually dovetail nicely as far as hurt/comfort goes, though considerably later than the summary led me to believe.All in all, despite my eyes glazing over a lot during the drills and combat as well as any geo-political context, a very satisfying set of characters and technically two romances for the price of one. Wavering between 3 and 4 stars because the characters/romances are very memorable, but I don't think I would reread without skimming great chunks."}, {"userName": "TheModestMillennial", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/51937233-themodestmillennial", "userReview": "I'm finally starting to get used to Dee's writing style, certain patterns and word usages not bugging me as much. That being said, I was less than impressed with this story.Even with the close calls, crashes, and other disastrous happenings, the book lulled me in to a lethargic apathy. I had a hard time maintaining interest in the story due to the slow pace of the plot. Most of the time, I feel like there was a definite lack of passion (or any emotion at all) in Grace and Bruce's relationship, seriously wanting for any romance. Bruce's \"fascinating\" questions seem pretty basic. Isn't \"dreams for the future\" a first or second date inquiry? I'm glad the characters were in love with each other, because I lost all interest in both of them.I did, however, love how much encouragement they shared with each other, especially the use of biblical truths to get through the hard times.I have a thing about not finishing a series, so here's to hoping the third book is vastly better than this one."}, {"userName": "Sarah", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/40147342-sarah", "userReview": "I enjoyed this one. It was not action/suspense, and it was romance, but it was super sweet. Bruce and Grace getting to know one another through the old fashioned letter. It was great. I liked the emphasis on the important things in life; the focus on the people you love. There really isn't that much action or plot to this book, just sort of following along as Bruce and Grace do their jobs. As much as the military stuff could get a little hard to follow, I just didn't try to follow the code too much and it was fine. The camaraderie was fun. Wolf and Bruce are so fun together and Grace and Jill added some fun moments too. I love reading about close friendships. That part when Bruce shows Grace the built-in bookshelves... SO JEALOUS!!! I want. That is literally one of my dreams, to have a library in my house when I grow up."}, {"userName": "Barbara", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/2511537-barbara", "userReview": "Probably closer to 3.5 stars. This sweet Christian romance/suspense was ok, but not as good, in my opinion, as most of Dee Henderson's other books. I enjoyed Grace, and she seemed very realistic, but many of the other characters did not seem fully fleshed out. There were many letters back and forth between the two main characters, and that technique is not a favorite of mine. I am glad I read it, and will read the rest of the series."}, {"userName": "Debbie Waltz", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/68856266-debbie-waltz", "userReview": "it was a good book. Not it's good is the first one, but it gives you a in-depth look at what it really takes to be a Navy seal. I was disappointed that most of the excitement was going the last half of the book, though"}, {"userName": "Devin Vanderpool", "userReviewDate": "Dec 18, 2016", "userURL": "http://www.goodreads.com/user/show/40832661-devin-vanderpool", "userReview": "This one is good for completely different reasons from the ones that made the first one good. I didn't like it quite as much as the first one but I enjoyed the slow building relationship among the chaos of their jobs. It is proof that long distance relationships can work."}, {"userName": "Pelican Rapids", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/20355890-pelican-rapids", "userReview": "seemed like a more male-oriented book"}, {"userName": "Deirdre", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/17930931-deirdre", "userReview": "See my review of  True Devotion."}, {"userName": "Josephine", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/38710844-josephine", "userReview": "I listened to this on audio, it was great. I felt like I was listening to someones deep thoughts especially the letters."}, {"userName": "Connie Glasgow", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/815711-connie-glasgow", "userReview": "Excellent - our military are so special!"}, {"userName": "Kathryn", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/1329275-kathryn", "userReview": "I like this series about uncommon heroes. It was an easy story to get into. However, I must say that I like to read about a relationship that can develop in person rather than seeing it unfold in letters and phone calls as is the case with \"Gracie\" Yate an Air force pilot (wolf's cousin from the SEALS and Striker's sister Jill's best friend) and \"striker\" Bruce Staton with the Air Force Pararescue Jumpers (Wolf's fiance, Jill's, older brother). This read made me appreciate that I'm a civilian and don't have to try to live my life around terrorists, or nations war threats, or deployments and if I'll make it home to my family at night or who has my \"just in case letter.\"I think i was on edge waiting for crash with Gracie or her plane being shot down. I was also waiting for Bruce to be the one that didn't come back from a rescue mission. I'm glad that I was wrong in thinking that this may be one of Henderson's books that doesn't have a happy ending. I read to get away from reality that doesn't always have the happy endings.Gracie does get shot out of the sky and crashes in Iraq. Bruce goes in for the rescue with his partner Rich and with the tricky crash that still had a live missile that Gracie was right on top of. Her injuries allow the doctors to predict that she will not fly again. gracie works hard and gets her fly status back, but makes the conclusion that she can let flying go if it comes to that so she doesn't have to worry about not coming back from a flight. Bruce struggles to support Gracie even when he sees all the realness of pilots down and not coming back.Jill accepts Wolf's offer of marriage and Gracie and Bruce plan a double wedding. After Gracie looses her boyfriend Ben a astronaut to a car accident, she is slow to move on, but Bruce's direction and acceptance of life brings her around to giving a chance to friendship and love.I like how Bruce's close call in Ecuador, puts him to thinking of priorities, A dog, a house, a wife. He gets a dog from the pound to fulfill his childhood dream of owning a dog. I like how it portrays a pet, Emily filling in the needs of those left behind on deployment and those needing extra comfort. Real truth there."}, {"userName": "Susan Baganz", "userReviewDate": "Mar 17, 2013", "userURL": "http://www.goodreads.com/user/show/7667548-susan-baganz", "userReview": "In True Valor, Major Bruce “Striker” Stanton is a parajumper who is not fond of the water. His only living relative is his sister, Jill, who is a civilian dating a Navy Seal, “Wolf” who works with Joe “Bear” Baker from book 1. Jill’s best friend is Wolf’s cousin, Lieutenant Grace “Gracie” Yates who is a fighter pilot with the Navy. After a near death experience, Striker writes her a letter. She gets it before her next deployment and they strike up a relationship by mail.Gracie can’t see how a relationship can survive military separations but starts to fall in love with the man who writes her letters baring his heart and cracking open hers. When her plane goes down in enemy territory, it is Striker who rescues her and finds that he is in love. Now he just has to convince her to take a chance on him.This was not a wishy-washy relationship, on and off type of thing, this is one that blooms over time, distance and real physical threats. I enjoyed the letter writing part of this which is a unique way to tell part of a story and reveal character’s hearts. Again, Dee Henderson gives lots of details about missions and planes and made me realize I would never want to be one of those people flying and trying to land on an aircraft carrier! I felt anxious with every landing! That’s how well they are written."}, {"userName": "Deb", "userReviewDate": "Sep 04, 2007", "userURL": "http://www.goodreads.com/user/show/345866-deb", "userReview": "air force major bruce \"striker\" stanton has his sights set on navy pilot lt. grace \"gracie\" yates. he carefully plots out his pursuit of the beautiful blue eyed grace, approaching her at a bbq hosted by a mutual friend, then communicating with her by letters as they are sent of on their seperate missions. he has respect for her toughness, as a girl growing up with a dream to fly she bucked convention to rise up through the ranks and become a capable fighter pilot. bruce's job is as a medic recuing downed pilots or soldiers caught behind enemy lines. their courtship is daunting because of all the miles seperating them and the physical danger they face everyday.[return][return]style characterisics: pacing, clarity, structure, narrative devices, etc.[return]the story alternates points of view, mostly between grace and bruce with mutual friends also getting in on the action. of course with their occupations there is plenty of opportunity for action and adventure scenes. little touches, like the details about bruce's elderly dog, add a realistic touch to the story. [return][return]how good is it?[return]seemed to be about average for books of this type, not much to make it stand out."}, {"userName": "Teresa Snyder", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/6246084-teresa-snyder", "userReview": "Wow! This was an emotional book! Not because of the romance and not necessarily because of the storyline. It was the realization of everything the military personnel goes through to keep us safe. Although I gave the book 5 stars, the storyline, romance, and characters, were more along the lines of 4 stars. The emotional depth of the book was worthy of 5 stars. The book was a little difficult to get into, in the beginning; characters hard to follow and bond with. There was a lot of military terms that were hard for me to understand - guys would enjoy that part of the book. The majority of the \"romance\" took place in letters, written thousands of miles apart. But you really felt the emotions the characters were feeling. Good and bad. When Gracie's plane went down and Bruce found her, I was in tears. The emotions were that strong. Same with the homecoming after each deployment. There was a bonus second romance in this book. Wolf, from book 1, and Jill, the only civilian in this story. We also got to see a few snippets of Bear and Kelly, from book 1.Don't let the emotions keep you from reading this book. The required happily-ever-after ending is there, as is the romance. It will give you a new appreciation of military life. Good and bad. Looking forward to book 3."}, {"userName": "⚜️Trea", "userReviewDate": "Dec 23, 2015", "userURL": "http://www.goodreads.com/user/show/5223520-trea", "userReview": "This is the second time I've attempted to read this book, and I think it will be my last attempt at this series. The story didn't have much action and wasn't very interesting to me. I think that the most annoying thing was that these felt like stock characters that could be in any Inspirational Romance novel. Bruce and Grace are the same old talented, romantic, God-fearing people that I feel I've read about before. It felt like their cute little exchanges were very close to others the author has written. I couldn't get interested in the military conflicts of the story because they were very obviously dated and mostly made up. I did appreciate the letting love grow over months element. The love letters written while on deployment added a new facet to the story, but they also got repetitive. There were too many letters between the main characters because they were hardly together in person. On top of that, the \"love letters\" had no depth, feeling flat and impersonal. I also couldn't believe that Grace kept putting her Navy Jet Pilot Career ahead of love.This just wasn't a good read for me, though I had really high hopes for it."}, {"userName": "Janie Winsell", "userReviewDate": "Sep 10, 2016", "userURL": "http://www.goodreads.com/user/show/54017213-janie-winsell", "userReview": "This is the second book in the Uncommon Heroes Series. Dee Henderson does not disappoint by adding romance with a hint of suspense. She weaves a storyline through the eyes of her characters that is intense and draws the reader in.Air Force Pararescuer Bruce had a close call on his last mission. It got him to thinking about what he regrets not fulfilling in his life, so when he gets a chance to rectify those regrets, he doesn’t waste any time. One thing on his list has him looking at Gracie as more than a friend and fellow soldier.Navy Pilot Gracie holds her emotions inside. She lost a great man and isn’t sure she’s ready to give love another shot, but when Bruce begins writing her while they are on deployment, he sparks something deep in her soul. Can she let go and move on with Bruce?I loved reading this story. I even got to glimpse at characters from the first book, which I love in a series. Gracie’s fears spoke to my heart, and I felt her yearning to have something special with Bruce.Great Story! Five Stars!"}, {"userName": "Christy", "userReviewDate": "Feb 03, 2009", "userURL": "http://www.goodreads.com/user/show/1642261-christy", "userReview": "I was not as impressed with this book as I was with the first one. It may be my opinions about duel military families (I won't get into most of my military view points right now, not really wanting to offend others), sure I think that they can work out, but the reality of someone living in one area, and the other living somewhere different for a long period of time is just unrealistic to me. Air Force and Navy assignments, plus deployments, and thinking that a marriage can last through letters, come on. The way that things are described in the this book had me saying, \"ya right\" at times, but it was alright. I also didn't like how they thought it should be God, Country, and then Family. Even in the military when one spouse is required to be gone for a period of time I still think that the Family has a way of being a top priority and should be seen that way. I am excited to read the next book though and see what the new story will be."}, {"userName": "Ashley Fuhr", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/15334301-ashley-fuhr", "userReview": "This really fell short of my expectations for Dee Henderson. She is one of my favorites and giving her 3 stars pains me.I did greatly enjoy the characters, and that is perhaps what kept me so engrossed in the novel.The plot, however, was lackluster and at some points seemingly unnecessary. I do realize the \"realism\" she was trying to portray, and she did in fact portray much of military deployments as they feel to those experiencing them. As only being on the civilian side of deployments, I can't speak for the work details of those serving, but it seems as though she took great care in getting the details right. It just didn't add much to the progression of the story.This was more of a normal everyday rendering of two people you happen to know. There was nothing grand about it that made it worth portraying in a novel, except maybe their occupations. Like I mentioned before, I really enjoyed the characters, but the world she placed them in was, for the most part, dull."}], "description": "Deployment orders sent them overseas. Lieutenant Grace \"Gracie\" Yates spent her deployment catapulting off the deck of the USS George Washington in an F/A-18 Hornet. A self-assured naval aviator, she was flying to keep the peace while being ready for war. Major Bruce \"Striker\" Stanton, Air Force Pararescue Jumper, had been pulling pilots and Special Forces soldiers from behind enemy lines for twelve years. Bruce knew Grace was too good a pilot not to draw the tough flight assignments. She was on the front lines. If she got in trouble, his unit would get the call.Separated by distance, they wrote love letters. With demanding jobs, deployed to different locations, they kept their relationship alive by writing love letters. In the face of danger, they both leaned on the truth that God is sufficient no matter what the circumstances.When she's shot down behind enemy lines, he's got one mission - get Gracie out alive... A dogfight erupted. Gracie was determined not to be the first woman pilot shot down behind enemy lines. Babying her damaged plane homeward, she fought the necessity to eject. Her best efforts thwarted, her fighter jet went down. And now Bruce has one mission: get Gracie out alive.", "title": "True Valor\n      \n          (Uncommon Heroes #2)", "url": "https://www.goodreads.com/book/show/1346727.True_Valor", "average": 4.32, "cover": "https://images.gr-assets.com/books/1182895291l/1346727.jpg", "reviews": 173, "authors": [{"url": "https://www.goodreads.com/author/show/165519.Dee_Henderson", "name": "Dee Henderson"}], "type": ["Christian Fiction", "Christian", "Romance", "Fiction", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/1346727.True_Valor", "http://www.goodreads.com/book/show/359456.True_Valor", "http://www.goodreads.com/book/show/8334900-true-valor", "http://www.goodreads.com/book/show/3577423-true-valor", "http://www.goodreads.com/book/show/285011.The_Negotiator", "http://www.goodreads.com/book/show/370057.The_Truth_Seeker", "http://www.goodreads.com/book/show/359461.The_Guardian", "http://www.goodreads.com/book/show/426030.The_Healer", "http://www.goodreads.com/book/show/595822.The_Protector", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}