{"ratings": 99, "userreviews": [{"userName": "Valerie", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/27839098-valerie", "userReview": "Wow, what a book! This is another book from the Men of the Sisterhood series. As usual, Fern Michaels provides lots of action and suspense in this book. I’m looking forward to the next book in the series. I hope the series doesn’t end."}, {"userName": "Dawn", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/32246063-dawn", "userReview": "I believe this is the best MOTS book yet. The guys are hitting their stride and getting in the nitty gritty. When the villains are involved in child trafficking the men don't hold back on their revenge.New friends are made, a new mission going forward is decided and they have found their own peace when it comes to what they do.Of course you cannot leave out Cyrus or Lady and her pups. They have their own roles to follow. I cannot wait for more!I received this ARC in exchange for an honest review."}, {"userName": "Billie", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/53377635-billie", "userReview": "This is the first book that I have read of the Men of the Sisterhood novels. Three children are found in an isolated area. Joe Espinosa picks them up and arranges a meeting with the rest of the crew. In an effort to protect children that are victims of human trafficking the team must be one step ahead of the organization. It was a little difficult to follow all of the characters and I thought the book was slow moving. I received an advanced copy of this book from Goodreads Giveaways for an honest review."}, {"userName": "Jeanne", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/17385248-jeanne", "userReview": "I have to say at times I wonder why Fern Michaels continues some of her series as they seem to falter . . . this is NOT one of those times! This \"Men of the Sisterhood\" story was one of her best yet! Great story, great ending!! 9 out of 10!"}, {"userName": "Pamela", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/9415619-pamela", "userReview": "I used to read all the books about the girls going after justice, with the guys helping. Then after the pardon, it switched to the older ladies, and retired men. I read a few of those. This was the guys, and Maggie, and the wonder dogs. The theme was a worthy read, about child trafficking. The statistics were horrific. This in intolerable for everyone, that so many children, and young teens disappear from our country, for a very short life, and a terrible existence. These people from kidnappers, to the man at the top, should be publicly executed. I gave this a 3 .5 It got off track at times into unrealistic story telling. I love dogs, and they can be warriors, but controlling your actions, and thoughts? I felt that distracted from the serious nature of the book."}, {"userName": "Heather Warner", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/70896861-heather-warner", "userReview": "I won this book in a giveaway on Goodreads and thought it was a decent book. It had a good story/mystery/adventure that I enjoyed. I found it difficult though to follow all the different characters-I think reading the previous books in the Men of the Sisterhood series is very necessary to really get the full understanding of these characters. I liked the psychic dogs and will have to read the previous books to get the full story on them! A hard topic on the trafficking of children handled very well, excellent ending and closure for characters. All in all-a good book I would recommend with the caveat of strongly recommending reading the rest of the series first!"}, {"userName": "BookGypsy", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/76392189-bookgypsy", "userReview": "This is The Men of the Sisterhood series. The male allies of The Sisterhood series.The men have their own organization to help the helpless and they do it well. This time the men have a heart breaking and emotional case of child trafficking. This is book four in the series. The topic of child trafficking is not an easy one but the novel does well with it. It's everything you expect from Fern Michaels. Coming in July,2018Thank you Good ReadsAnd KensingtonFor the book win!Novels & LatteBook Blog"}, {"userName": "Linda Smatzny", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/14671807-linda-smatzny", "userReview": "This is a story about the men of the Sisterhood. Joe and Cyrus find three children alongside a rode. The kids are dirty and explain that they got taken when their aunt left them. Joe takes them to BOLO headquarters and calls a meeting. The guys discover the kids were kidnapped by a group that deals in children and young women. After taking the children to the farm it is discovered the kids are the children of two CIA operatives. The case goes from there. The book was a quick easy read."}, {"userName": "Maryann Fox", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/16131101-maryann-fox", "userReview": "Great book The Men of the Sisterhood take on a very relevant crime: child trafficking.Three kidnapped children running for their lives find sanctuary with the men and as they try to uncover more about the children they learn their parents \"career\".A rogue super agent joins forces with the men who in turn call upon other assistance to shut down child trafficking and the two men who are behind it."}, {"userName": "Shawn", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/12602330-shawn", "userReview": "I think it rains at some point in every one of her books. I like the cause that they went after in this book but it seemed like a lot of detail and set up and then the actual mission was done and over in a chapter or two. Of course, I will continue to read the series because it is always fun to see what the group will be up to next."}, {"userName": "Bin", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/7698321-bin", "userReview": "I really enjoyed this book. I laughed, teared up a bit, and cheered as the Men of the Sisterhood dealt a blow to the horrors of human trafficking.Thanks NetGalley for a chance to read this early.You can find my full review here: https://binblogsbooks.wordpress.com/2..."}, {"userName": "Nancy", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/29774102-nancy", "userReview": "3.8 I do prefer the “sisterhood series” but this book was the best I’ve read of the “men of the sisterhood”. I loved the ending. All the men are back, along with Cyrus the dog, and seeking revenge on the helpless that have been abused. The main topic is child trafficking."}, {"userName": "Helenk", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/19668070-helenk", "userReview": "I don’t know how Fern Michaels continues to come up with her plot lines. This was my first foray into Men of the Sisterhood. It too is intriguing. I like her use of many recurring characters. I won’t say much other than this one deals with child abduction and slavery."}, {"userName": "Sandra", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/8330421-sandra", "userReview": "I really enjoyed this book from the Men of the Sisterhood series. I love to read about Cyrus and his special powers. This one also included Cooper to look after the children. Could not put it down."}, {"userName": "Karen", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/5117803-karen", "userReview": "What an awesome book! The men of the sisterhood are back! I’m as hooked on the men’s cases as I am the women. The stories just keep getting better and better! Highly recommend!"}, {"userName": "Jackie", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/8098016-jackie", "userReview": "I've gotten tired of this series, but this one was better than some of the last few."}, {"userName": "SS", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/30934702-ss", "userReview": "I won this book in a Goodreads giveaway. Review to follow."}, {"userName": "Linda", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/12074564-linda", "userReview": "Fighting child trafficking is a worthy theme. Decent plot except for psychic dogs."}, {"userName": "Bernie", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/35921264-bernie", "userReview": "Truth or Dare is the fourth outstanding book in the Men of the Sisterhood series written by author Fern Michaels. Things is my favorite. Thanks to NetGalley and Kensington Books for the advance copy."}, {"userName": "Kay", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/6987277-kay", "userReview": "This is just like the Sisterhood only with a little more finesse and a lot less blood and guts."}, {"userName": "Sallie", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/16063808-sallie", "userReview": "Love this series!"}, {"userName": "Joan", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/20981514-joan", "userReview": "A friend read it and said it was one of her best books she read. She read it in one day. Characters and plot well developed."}], "description": "The Sisterhood: a group of women bound by friendship and a quest for justice. Now their male allies, the Men of the Sisterhood, have formed a top-secret organization of their own, with the same goal of helping the helpless and righting the wrongs of the world . . .\n \n When the call comes, the Men of the Sisterhood drop everything to help their friends. This time it's Cyrus, their four-legged hound dog and unofficial mascot. While member Joe Espinosa is driving along an isolated country road with Cyrus in tow, he catches a glimpse of movement in the woods bordering the road and notes Cyrus pawing desperately at the car window. As soon as he pulls over to investigate, Cyrus bolts out the door and leads Joe to three children clustered together--bedraggled, silent, and scared out of their wits. As soon as he has brought the children to safety, Espinosa arranges an urgent meeting.\n \n Charles, Abner, Jack, Dennis, Harry and the rest of the crew gather at BOLO headquarters to hear a shocking story that confirms their worst suspicions. Many more children are still in danger. But in order to protect and avenge the victims, the team must use more cunning than ever before. With so many vulnerable young lives at stake, one mistake would be too many . . .  Praise for Fern Michaels \"The Men of the Sisterhood series has it all . . . Michaels manages to surprise and delight fans of all ages with her novel's unexpected twists and turns.\" --RT Book Reviews, 4 Stars, on High Stakes", "title": "Truth or Dare\n      \n          (Men of the Sisterhood  #4)", "url": "http://www.goodreads.com/book/show/36602114-truth-or-dare", "average": 4.06, "cover": "https://images.gr-assets.com/books/1517230203l/36602114.jpg", "reviews": 26, "authors": [{"url": "https://www.goodreads.com/author/show/2609.Fern_Michaels", "name": "Fern Michaels"}], "type": ["Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/36602114-truth-or-dare", "http://www.goodreads.com/book/show/36371625-truth-or-dare", "http://www.goodreads.com/book/show/36815815-truth-or-dare", "http://www.goodreads.com/book/show/33001.Weekend_Warriors", "http://www.goodreads.com/book/show/201838.Payback", "http://www.goodreads.com/book/show/49500.Vendetta", "http://www.goodreads.com/book/show/88059.The_Jury", "http://www.goodreads.com/book/show/88058.Sweet_Revenge"]}