{"ratings": 6820, "userreviews": [{"userName": "Kemper", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "[ Grant really came across as a dangerous nut job in her first appearance, but she doesn’t seem to have the same evil energy here. Plus, it seems like a mistake that she and Lucas never come face-to-face. We’ve also seen the villains try to distract Davenport by going after his family or friends before so to have it happy yet again here seems kind of predictable. Again, I’d more expect Grant to use her political influence and media contacts to drop a world of hurt on Davenport as a way of neutralizing him rather than going to physical attacks against him and his wife as a first response. (hide spoiler)]"}, {"userName": "Liz", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "I think John Sandford has outdone himself with this book. Where he shines is in getting the details exactly right. Lots of dry humor here, especially when it comes to DC and politics. There’s a wonderful sense of tension throughout. Even though Davenport knows who’s behind the foul play, that doesn’t mean he can prove it for a court of law. Watching him put the pieces of the puzzle together kept me riveted. You can see the ending coming, but it was the perfect ending. I have to give Sandford credit. It’s wild to imagine this is the 28th book in the series. If anything, he’s getting better. I listened to this book and once again Richard Ferrone does a great job as the narrator."}, {"userName": "Brenda", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/5240149-brenda", "userReview": "After 28 books, the Lucas Davenport series is still going strong. This was a very enjoyable read. Lucas is asked to investigate the attempted assassination of a U. S. Senator, and he calls on Bob and Rae for assistance. Along with local law enforcement and the FBI, the U. S. Marshals follow leads and try to put together a case. There are several deaths as the investigation is thwarted time and time again.Both Virgil (of “that fuckin' Flowers” fame) and Kidd make minor appearances in this book. Good to know they are both well, and it seems Virgil is still headed toward domestication. You’ll know what I mean if you’ve read Sandford's Virgil Flowers series. Lucas's wife, Weather, and their daughter, Letty, have small roles as well.As is usual in John Sandford's books, the dialogue feels natural with lots of ribbing and humor. Lucas is a clotheshorse, and some downtime allows him to visit a tailor with Bob. I enjoy those little side stories. There is cooperation between all agencies involved, meaning they share information, so the case moves along to a satisfying conclusion."}, {"userName": "Monnie", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/6277675-monnie", "userReview": "Can this possibly be the 28th book in the Prey series? I know I haven't missed many, so guess that makes me an oldie (but goodie). And so is the series; even if \"star\" character Lucas Davenport, now a federal marshal, seems to be a bit more laid back these days, there's plenty of action here that kept me reading until my Kindle battery insisted it needed a recharge.Happily - and in one case, unhappily - a few other characters make return appearances in this one. There's Weather, Lucas's surgeon wife, Letty, his daughter, some former professional colleagues and the even more lovable (to me, at least) Virgil Flowers, upon whom Mr. Sandford has bestowed a series all his own.Still another blast from the past is Taryn Grant, a psychopath who's now a U.S. Senator. Lucas is certain she's up to her old tricks (and being a billionaire, she's able to grease wheels till the Minnesota cows come home). One of her other enemies, Sen. Porter Smalls, knows firsthand how dangerous the woman is. In fact, he's convinced that a recent auto accident that nearly killed him - and did kill the driver - was all her doing. Proving that, though, just isn't in his skill set.So, he calls in Lucas - who turns to local law enforcement, the FBI and others to help with the investigation. All heck breaks loose in the process, with suspicions turning into twists and turns that threaten the well-being of everyone involved, including Lucas's own family. And in the end, getting to the truth doesn't necessarily mean justice will be done. Or does it?Many thanks to the publisher, via NetGalley, for the opportunity to read and review an advance copy."}, {"userName": "Maureen Carden", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/54932249-maureen-carden", "userReview": "The psychopathic Minnesota Senator Taryn Grant and U.S. Marshall Lucas Davenport have faced off before in a murderous duel in the book Silken Prey. The best one can say is that is was a draw between the two.But now Grant is becoming more powerful and is eyeing the White House. Holding on to her coattails, I mean skirts, are members of a private and lethal military contracting company. Fortunately, they aren’t completely successful in their assignment to eliminate another senator but they draw the attention of Davenport. Always a big mistake. With whip smart dialogue, returning characters and a logical but a twisting plot, the fast moving Twisted Prey is a pleasure to read. A pleasure, but I have a few problems.I also found it annoying that Flowers and Kidd would show up for very minor appearances. A couple of paragraphs? Really? Why bother?I’m also confused about all of the Marshals in this book. U.S.Marshals are politically appointed by the President and approved by the Senate. There are very few of them. Most people who work for the Marshal’s service are Deputy U.S. Marshals. In theory Davenport could be a Marshall, but I doubt the rest of the Marshals that show up are actually Marshals, more like Deputy Marshals. Stuff like this really bothers me in a book.I don't understand why if the first person they plan to arrest is killed that they wouldn’t go eyes on with their next subjects. Oh come on, that’s not a spoiler, its obvious early on that he is a red shirt.If y’all think I am being a bit bitchy about minor plot holes, think about this being book 28. This is a hugely popular series for very good reasons. Carelessness makes no sense.Set mostly in the Washington DC area, Sandford amusingly portrays the disdain that most hold for the area. He managed to get in some terrific shots at the current political climate too.Everyone is fair game in this book. Big mistake, because Davenport is nothing if not Machiavellian.Thanks to NetGalley for an ARC in exchange for a fair and honest review."}, {"userName": "Tim", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/17042835-tim", "userReview": "Fantastic! My favorite \"Prey!\" 10 of 10 stars!"}, {"userName": "Sandy", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/24770184-sandy", "userReview": "This is one of those series that is kind of a sure thing. You may have favourites among the 28 books but if you like one, you'll enjoy them all.In this outing Lucas Davenport runs up against an old foe while investigating the politically charged assassination attempt of a senator. Politics, secret military contracts & backroom deals...you guessed it. We're in Washington D.C. & the swamp is alive & well.Luca again gets assistance from Bob & Rae, 2 characters I really enjoyed in the previous book & even that fuckin' Flowers does a walk on. Sandford is a master storyteller & keeps you turning the pages with a tightly spun plot & expert pacing. As usual, a quick & entertaining read."}, {"userName": "Connie", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/4906043-connie", "userReview": "Lucas, you dirty dirty dog, you...I love you so much! Another Prey book that I started one day and finished the next, finding it very easy to want to pick up where I left off and harder still to put down. I found the 'S' sink thing a bit far fetched, but at the end of the day I don't really give a crap. I was so happy to see more of Rae and Bob. I really worried about having Davenport in the middle of politics, not that Sandford has ever been quiet in that regards, but having Davenport as a US Marshal just seemed to be pushing it a bit far, however, although it's clear that politics play a part in these novels, in Sandford's minds and yes, in Davenport's mind, it's still clear that at the end of the day Lucas doesn't really care about much except the adrenaline rush he gets from winning against these 'bad' guys and girls. Lucas seems to have cooled his hot head a bit in his older years and doesn't quite act so rashly...or maybe I should say, he's gained enough patience to think through his plans and the long term consequences. He also seems more and more willing to manipulate others to see that justice is served as it should be at the end of the day. In the past, he would have just flown off the handle and cleaned up best he could afterwards. Now he lines up the players and patiently sits back until justice is done.As always, the dialogue is there, the action is there, and my love for Sandford is ALWAYS there...ARC provided by Netgallery for an honest review"}, {"userName": "Scott", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/24668886-scott", "userReview": "To begin with, I think it is only appropriate that I admit to being a fairly avid reader of John Sandford, especially a fan of his Lucas Davenport “Prey” series. A pretty big fan to be honest. However, I am coming off the last book, “Golden Prey” with a bit of disdain and disappointment. The plotting was one of his weaker ones and the last hundred pages was an overly drawn out, anti-climactic ending. Because of that I have been worried about how this one was going to turn out. Turns out I was wrong. What a difference a year makes…When we last saw our fearless hero, Lucas Davenport, he was getting comfortable in his federal marshal job which afforded him lots of freedom in cases he investigates. He had two agents assigned to him – Bob and Rae - both of whom are witty, hard-working and never lack an opinion. When this book begins, we see the return of Taryn Grant, the rich and power-hungry psychopath that previously beat out Porter Smalls for his U.S. Senate seat using murder to help her achieve her lofty goals a few years ago back in “Silken Prey” (book 23). Grant is beautiful, intriguing, and downright pure evil.Davenport is still angry over not being able to prove her responsibility in at least three murders back home in Minnesota and his opportunity for a second chance has arrived. Grant has found herself a seat on the Senate Intelligence Committee and is using it to seek the higher position in the land – the presidency. Lucas finds himself having to balance his own selfish desires when he is asked to investigate the claim that she is trying to eliminate those in her way. This time, Lucas is determined to settle his unfinished business with Grant, one way or another. This was the enjoyable read that I was hoping it would be. The plotting had more energy, tension, and risk for our hero. Unlike the last book, we get to see more of the family members and team mates that are a key part of Davenport’s life. In some ways, some appearances are for the wrong reasons, but that adds to the strong challenges that Lucas faces in this increased emotional plot line. We see Davenport’s wife, Weather. His outspoken daughter, Letty. We even get to see Kidd, the computer hacking wizard in action, as well as that awesome freaking Virgil Flowers. I missed them the last time out.The first third of the book is spent setting up the chess pieces on the game board and stirring the pot to get the action bubbling. Then when things just start to settle in – WHAM – the plot completely turns on an emotional game changing twist that boils over. What a twist! I found myself caught off guard but completely impressed by Sandford’s wicked manipulation of his reader’s emotions. No spoilers will be shared here other than to say there are “classic” Davenport moments in this outing that will not be forgotten for a long time. Sandford is definitely dipping into the emotional bank account this time around. And it paid off handsomely. In some ways that I did see coming and in some ways that didn’t see anticipate. There is a character introduced in this book that has multiple names, none of which may even be the real one, that develops an interesting relationship with Lucas and serves as a wildcard in in one of the outcomes. I definitely want to see her again in a future outing and I am sure there’s a lot more we can learn about her own background and story. Overall, this book was the great summer-time read that Stephen King talks about in his cover blurbs promoting John Sandford’s Lucas Davenport series. It was much better plotted and tension-filled than the last one where less feared bad guys provided a much weaker climax. Taryn Grant serves as a stronger adversary that challenges Davenport on a much more analytical and emotional level. There is no one around him she is not afraid to go after, whether it be professional relationships or personal ones. In my humble opinion, with “Twisted Prey” John Sandford has regained his writing groove and Lucas Davenport has rediscovered his detective mojo. He is the true law enforcement rebel with a badge and a cause. Unlike last year at this time, I cannot wait to read Davenport’s next adventure. If you haven’t tried reading him, pick up the first book and get started…"}, {"userName": "Skip", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "Back when he was still at the Minnesota BCA, Lucas Davenport tangled with sociopath Taryn Grant, who while running for the Senate, framed her rival (Porter Smalls) for child pornography and killed a few people to cover it up. Lucas cleared Smalls, but did not have evidence to arrest Grant, who was elected. Senator Smalls is coming back from his cabin with a female political supporter/girlfriend when a pickup runs them off the road, killing her. When the police cannot find evidence of another vehicle, Smalls asks Lucas Davenport to investigate, and his superiors agree to the Senator's request. Lucas is joined by the husband and wife U.S. Marshal team of Bob and Rae, as well as a competent and cooperative FBI agent, and together, they begin to look into the matter, tracking down the culprits, a bunch of shady government military contractors. As Lucas gets close, they derail his efforts with a solid offense, and then the contractors start dying, closing off all ties to the Machiavellian Taryn Grant. Unlike Silken Prey, where I was disappointed by the ending, I was quite pleased with this one."}, {"userName": "Chris Conley", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/7209420-chris-conley", "userReview": "I love the way Lucas Davenport’s mind works. I certainly would never to be on his bad side."}, {"userName": "LInda L", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/51456250-linda-l", "userReview": "It's a toss-up if I love Lucas Davenport or Virgil Flowers the most. But -- in this book, Lucas was outstanding. He is wonderful as a Marshal and this case was just fascinating. There were SO MANY bad guys, but all directed in some way by the worst guy of all -- an old enemy of Lucas. He gets help from fellow-marshals Bob and Rae and together, they meet all the many challenges thrown at them. John Sandford has such a way with words -- so clever, so funny, so insightful. I would not miss one of his books unless I was comatose."}, {"userName": "Darlene", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/33604667-darlene", "userReview": "I believe this is book 28 in the Prey series, and what a fantastic addition to the series this is. Like me, many of you have followed Lucas Davenport from the beginning and he keeps getting better with age. With each Prey book I feel like I'm back with a dear old friend. There are quite a few humorous parts where I actually was laughing out loud, even though the topic of the book was very serious. Don't wait so long to come back to your friends, Lucas."}, {"userName": "Janet Newport", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/7765576-janet-newport", "userReview": "Thank you Netgalley and the Penguin Group/G P Putman & Sons for this ARC.I love Lucas as a US Marshall. He seems to really enjoy it as well. Seems like there's less bureaucratic red tape for him (no employee overtime sheets to approve) yet he still has the autonomy to work a case as he sees fit and the ability to get the resources he needs. Twisted Prey was the usual fast wild ride one expects from John Sandford with the usual suspects and supporting characters. I'm still giggling at the thought of Bob with the tailor."}, {"userName": "Judie", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/10820707-judie", "userReview": "US senator Porter Smalls was well-liked in Minnesota, but he was defeated in a run to retain his office by Taryn Grant. She had run a vicious smear campaign against him which resulted in three murders, but there is not enough evidence to convict her. Two years later, Smalls ran again and was elected. Grant secured a seat in the Senate Intelligence Committee and is not averse to doing whatever she could to get her way and has the personal funds to buy anything she wants..\tWhile they were on a weekend getaway, Smalls and his friend Cecily Whitehead were forced off the road and down and embankment. Whitehead was driving and her skills kept them from dropping all the way to the bottom. She steered toward trees to slow them down. Unfortunately she died in the process. Because there was no physical evidence of another vehicle being involved, the local officials determined it was an accident even though Smalls insisted it was a deliberate attack. There was evidence of the car hitting a tree.\tSmalls called his friend Lucas Davenport who was now a federal marshal in Minnesota to help him prove what had happened. The investigators wanted to help and some did believe Smalls’ story but without evidence there was nothing they could do.\tDavenport wasn't in DC very long before he became a target. He called in his professional friends, Bob Matees and Rae Givens to help him solve the case. He was sure Grant was behind it but proving it would not be easy.\tTWISTED PREY tells the story of the search for evidence of the crime as well as the perpetrators. It reveals corruption in awarding lucrative government contracts and a blind obedience to orders, eliminating whoever might get in the way.\tAt one point Davenport is called back home after his wife becomes a victim but as soon as she is home from the hospital, he returns to DC and the investigation. He doesn't call her nor inquire about her condition after that.\tToward the end the language became more crude and there are a couple homophobic comments.\tA few years ago, this story would have been relatively unbelievable but with the philosophy and actions of the current administration and its ties to Russia, it becomes more of a portent of what could happen.\tThe book was a fast read and John Sandford knows how to tell a good story."}, {"userName": "Kathy", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/3446463-kathy", "userReview": "4.5 stars.The bloodthirsty world of politics takes center stage in John Sandford's newest release, Twisted Prey. This twenty-eighth installment in the Lucas Davenport series takes place in Washington, DC and pits US Marshall Lucas Davenport against a formidable foe who rather ruthlessly attempts to eliminate her opposition on her climb up the political ladder.Following an attempt on his life that leaves one person dead, Minnesota Senator Porter Smalls does not hesitate to reach out to Lucas Davenport for help. Smalls is convinced his former rival and current Senator Taryn Grant is behind the plot to take him out and he knows that Lucas is more than up to the task of proving it. For his part, Davenport would love nothing than another crack at Grant who once before turned to murder and nasty shenanigans to clinch her Senate seat. Quickly traveling to Washington, DC, Lucas, aided by fellow Marshalls, Rae Givens and Bob Matees, works hard to prove Grant and her merry band of henchman are behind the attempt on Smalls' life.Taryn's Chief of Staff Jack Parrish is the first person who falls under Davenport's scrutiny. A former Army officer and CIA operative, he is the obvious person for Grant to use for her dirty work. He, in turn, has some rather surprising ties to a defense contractor, Heracles Personnel, which is run by George Claxson. The discovery that Claxson has several former military members and mercenaries on his payroll raises eyebrows, but this does not necessarily mean they are involved in anything illegal.Lucas quickly ferrets out some dubious defense contracts that lead right back to Heracles. He also locates the person whom he believes was involved in Smalls' car \"accident\" and he must work quickly to get the authorities on board with his theory before evidence is lost or destroyed. Just as he, Rae and Bob are closing in on the person they hope will flip on key players,  the suspects put in motion a devious plan to divert Lucas's attention.  Taryn and her crew continue to be one step ahead of him and although he, Rae and Bob make considerable progress on the case, Lucas fears she will once again slip through his fingers.Twisted Prey is an intricately-plotted and riveting mystery. The storyline is quite clever and well-executed.  John Sandford keeps the long running Lucas Davenport series fresh by changing up Lucas's career and adding new faces to the cast. This newest release features a topical storyline, a particularly loathsome cast of despicable criminals and an interesting investigation that takes all of Lucas's skills to solve.  Will Lucas finally make a case against the vile and abhorrent Taryn Grant? Or will she once again escape punishment for her appalling  crimes?"}, {"userName": "Tim", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/16867480-tim", "userReview": "TWISTED PREY by John Sandford is the 28th book in the Lucas Davenport series, and Lucas is again called into a case involving Senator Portis Smalls, who believes a vehicle accident near his cabin that causes the death of the woman driving him was in fact an attempt on his life, although there is no proof to back up his claims. Taryn Grant, who is the Senator from a previous Prey book, is who Smalls suspects, and whom Lucas agrees would be a likely suspect based on her past ruthless behavior.Lucas has been a U.S. Marshall for some time now, and characters from his past like Jenkins and Shrake have been replaced by Bob and Ray, partners who enthusiastically work with him on the case after the boredom of their recent assignments leaves them hungry for action.One of the aspects that I like about the Prey books is how Lucas uses all the resources available to him, whether local authorities or FBI specialists, he’s always used unconventional and creative ways to piece together the clues discovered in a way that leads to the killer(s) responsible in the cases.Sandford has aged Lucas nicely, and the series has taken a shift from the high action and chase predominance of his earlier novels to a more focused investigative approach that fits with Lucas getting older and wiser, and as always a little bit of luck enters into solving the case.I liked this one as it got better the further the story progressed, something I’ve found true of my favorite books in the series, and once again I’m amazed at how many quality books author Sandford has written in this series with Lucas keeping his edge over the years in a way that makes him feared and respected by both colleagues and the criminal element alike.4 stars."}, {"userName": "Jessica Bronder", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/5781282-jessica-bronder", "userReview": "Lucas Davenport is back and working as a US Marshall. But he is going to find himself investigating a previous enemy, Senator Taryn Grant. Lucas was never able to prove three murders were committed by Grant due to her money and status. Senator Porter Smalls is involved with a car bomb that killed his driver and almost himself. Smalls has a feeling that Grant tried to kill him so he calls in Davenport to investigate. Of course Davenport is eager to prove this and starts calling in people to help him. But that is where things go sideways. Grant is not going to give Davenport the chance to prove he tried to kill Smalls and is willing to go to any length to stop him.This is a great story that is filled with lots of action, plenty of thrills, and a great story that twists and turns around itself and keeps you guessing about what is really going on. I have not read a lot of the books in the Lucas Davenport series but compared to the few I have, I loved it. Davenport is a tough person that is willing to prove that Grant is involved in this attempted murder. And when Grant decides to threaten his family, he made a BIG mistake.I really enjoy this series and think anyone that likes political thrillers will enjoy it too. I really need to go back and catch up on what I have missed in this series. I would love to see how Davenport started out compared to where he is now.I received a complimentary copy of this book. I voluntarily chose to read and post an honest review."}, {"userName": "RachelW (BamaGal)", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/31722634-rachelw-bamagal", "userReview": "Competent, by-the-numbers read; but dry and not overly compelling. Davenport just isn't fun anymore, and I find I much prefer the Virgil Flowers books these days. The ending was anticlimactic and unsatisfactory. Maybe it's time to wrap this series up..."}, {"userName": "Steve", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/21767591-steve", "userReview": "John Sanford always writes an enthralling and unique story. Twisted Prey is no exception. For those of us who have followed Lucas Davenport since his first outing, reading another installment is like hanging out with a friend who happens to be a cop. In this instance Lucas is not working for the Minnesota Bureau of Criminal Apprehension, the B.C.A. but for the U.S. Marshall Service.He is on the track of a doer who has attempted to assassinate a U.S. Senator. What happens next is why the book is entitled what it is. The reader is taken through a maze of twists and turns, meeting various bad dudes who are selling weapons off the books, plotting killings, robbery, and fraud on a massive scale. All of this is thrown at Lucas as he tries to decipher what is going on and who is responsible for the attempted killing. My advice is to buy Twisted Prey as soon as it is available. If you have never read Sanford, read his entire backlist of Prey novels and then hit the equally entertaining Virgil Flowers books. You will have a great time."}, {"userName": "Wendy", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/19889444-wendy", "userReview": "Twisted PreyJohn Sanford is the best writer around today. He has been one of my favorite authors since the very first Prey novel I read. I can sincerely say that his writing just gets better and better every year. I loved this book and I especially loved the ending. I don't know if I can wait another year for his next book to come out."}, {"userName": "Donna Lewis", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/6585903-donna-lewis", "userReview": "Lucas Davenport always get his man.... well, what if he is no longer in the Minnesota Bureau of Apprehension? What if he is not in Minnesota, but Washington DC? What if he is not after a man, but a woman? Fast paced, interesting, with a touch of elegant clothes."}, {"userName": "Ruth Ann", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/4028443-ruth-ann", "userReview": "Well executed plot in an action-packed thriller based in Washington DC, Virginia and West Virginia. Bob and Rae make a return, as well as the much-despised Taryn Grant, Minnesota Senator.This one would make a perfect movie."}, {"userName": "Joyce", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/61807998-joyce", "userReview": "4 starsLittle does Lucas know at the beginning of this story that he has an appointment with an old nemesis of his. Psychopath Taryn Grant is back. She is now a United States Senator and very powerful, as well as being very rich. She can buy just about anything – or anybody – she wishes. When US Senator Porter Smalls and his sometimes lover and his wife’s best friend Cecily “CeCe” Whitehead are having a planning session at his out-of-the-way cabin in the woods outside of Washington, DC. While on their way home, they are sideswiped by a pickup and driven off the road and down an embankment. CeCe is killed. Porter contacts Lucas and tells him the story, He is certain that it is Taryn Grant who is trying to kill him as revenge for some earlier perceived hurts on her part. Lucas takes the case and begins his investigation. He is going to have to be careful, for Grant is relentless is pursuing her targets. While Lucas is conducting his investigation, with a little help from his friends, including Virgil Flowers, tempers flare and the going gets hot – very hot. I must admit, like another reviewer, that while I very much like all of John Sanford’s novels, I particularly like the Virgil Flowers series. He has definitely stolen my heart. This book is well written and plotted as are all of Mr. Sanford’s novels. But, I didn’t care for this one quite as much as some of the previous stories. Politics…meh. The tension in the book began immediately with the wild car chase and tumble down the hill. It continued throughout the book as the reader got drawn into the chase and machinations of the “bad girl.” I liked the book, and will continue to read John Sanford’s novels as long as he continues to write them. I want to thank NetGalley and Penguin Group Putnam/G.P. Putnam’s Sons for forwarding to me a copy of this great book to read and enjoy."}, {"userName": "Darcy", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/2225246-darcy", "userReview": "It's always fun to pick up a book with Lucas Davenport. While I miss him working in MN, he has built up a crew to support him that are just as fun to read about. The other Marshalls, Rae and Bob fit in well with Lucas, they can talk about common things and are just as blood thristy, but not quite as sneaky as Lucas.I liked that this book brought about some familiar faces in the case they worked, the 2 Minnesota Senators from a case that Lucas worked on in the past. I know it bothered Lucas that he knew what happened in the past, but couldn't prove it, allowing the bad guy to go free. With that knowledge you knew that Lucas wasn't about to let that happen again. Lucas and his crew slowly started to unravel things, each lead found something bigger. Soon it seems like so much was going on, so many alphabet groups were in on things, so much bigger than the original crime of a car being run off the road.Towards the end it seemed to me that Lucas wasn't going to get his bad guy himself, but he might be letting someone else do the work for him. It was only on the last page that I realized I was right and more than just me knew it."}, {"userName": "Mehmet Utkan", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/49076619-mehmet-utkan", "userReview": "Satellite noise. Then Wendy said, without preface, “I’ve been thinking about it. And I’ve been thinking about you. You believe I was involved in that shooting at the Watergate Hotel. Why didn’t you ever come after me?” “We were looking for you . . .” “No, you weren’t. Or if you were, you weren’t looking very hard. The media was going wild, Homeland Security was issuing press releases every five minutes—all of them wrong—the FBI was running in circles. The one group that might have given me trouble, which was you and your marshal friends, never came looking. You didn’t come even though you knew some people I was friends with. You never squeezed Tom, you never really squeezed John McCoy, you never squeezed Claxson or the lady who worked for him . . . Why was that?” “We don’t have the investigatory resources to throw around like the FBI does,” Lucas said. “Or like Homeland Security. Whatever happened at the Watergate, it didn’t seem likely to have much connection with our main objective, which was to find out who tried to murder Senator Smalls.” “Oh, bullshit, Davenport. Nobody came to the Watergate and shot the place up by accident, not with a machine gun,” she said. “You had to know there was some connection.” When Lucas didn’t say anything, Wendy demanded, “Were you grooming me?” “What?” “When you got Tom to give me your phone number, did you want to talk so you could manipulate me . . . Were you grooming me to kill Grant?” Lucas let that hang in the air, then said, “I don’t know what you’re talking about,” and hung up. “What was that?” Flowers asked. “Unfinished business,” Lucas said. He picked up his Leinie’s, took a swallow, and added, “But it’s finished now.”"}, {"userName": "Alasandra Alawine", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/8706109-alasandra-alawine", "userReview": "Lucas gets another shot at Taryn Grant when she tries to have Smalls eliminated permanently. Unfortunately the trail leading back to Grant keeps getting eliminated so Lucas gets creative in bringing her down. Looks like Grant killed the wrong man this time, because his girlfriend has the skills to end the Grant problem once and for all and Lucas has no compunction about putting Grant in her cross-hairs after she Ok'd an attack on Weather. Enjoyed reading about Kidd, he has always been one of my favorite characters and I was sorry his series ending so I really appreciate it when he pops up in a Davenport book."}, {"userName": "Sara", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/7792453-sara", "userReview": "One of my very favorite protagonists, Lucas Davenport, is contacted by a Senator who was involved in a car accident that killed his female companion. Although the authorities have ruled it accidental he is convinced he was deliberately targeted as he was previously the victim of an assassination attempt by his political rival, Taryn Grant herself now a US Senator. Faithful readers will remember Ms Grant from Silken Prey when she was introduced as a wealthy, narcissistic ambitious sociopath, back when it seemed impossible that such a person could rise to political power! This is a well written, exciting thriller with everything we have come to expect, including appearances by Virgil Flowers!!"}, {"userName": "Jim A", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/5496710-jim-a", "userReview": "Pretty good Davenport procedural from Sandford. He brings back characters from previous novels, both good guys and bad guy. Asked by Porter Small, senator from Minnesota, to investigate an attempt on his life, Davenport gets involved with the operators from a company that supplies private military contractors. From there Davenport brings in the FBI when he finds evidence of illegal weapons shipments by that contractor. All in all a pretty good read. And, as with all of Sandford's novels, it really is a 'no brainer' book."}, {"userName": "Rachel", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/19399662-rachel", "userReview": "Another Great PreySandford rarely disappoints. I absolutely loved last year's Golden Prey and had my fingers crossed that Twisted Prey would at least come close in quality. It exceeded my expectations. Lucas Davenport is one of my favorite characters. Sandford surrounds him with an entertaining cast of supporting characters. There are plenty of laugh out loud moments, along with heart pounding tension. I won't say more for fear of spoilers, but Lucas is at his best when he rides the line of legality. He's a sneaky bastard and Twisted Prey was an awesome ride."}], "description": "Lucas Davenport confronts an old nemesis, now more powerful than ever as a U.S. senator, in the thrilling new novel in the #1 New York Times-bestselling Prey seriesLucas Davenport had crossed paths with her before.A rich psychopath, Taryn Grant had run successfully for the U.S. Senate, where Lucas had predicted she'd fit right in. He was also convinced that she'd been responsible for three murders, though he'd never been able to prove it. Once a psychopath had gotten that kind of rush, though, he or she often needed another fix, so he figured he might be seeing her again.He was right. A federal marshal now, with a very wide scope of investigation, he's heard rumors that Grant has found her seat on the Senate intelligence committee, and the contacts she's made from it, to be very...useful. Pinning those rumors down was likely to be just as difficult as before, and considerably more dangerous.But they had unfinished business, he and Grant. One way or the other, he was going to see it through to the end.", "title": "Twisted Prey\n      \n          (Lucas Davenport #28)", "url": "http://www.goodreads.com/book/show/36530636-twisted-prey", "average": 4.5, "cover": "https://images.gr-assets.com/books/1523715832l/36530636.jpg", "reviews": 565, "authors": [{"url": "https://www.goodreads.com/author/show/4610.John_Sandford", "name": "John Sandford"}], "type": ["Mystery", "Thriller", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/36530636-twisted-prey", "http://www.goodreads.com/book/show/36140457-twisted-prey", "http://www.goodreads.com/book/show/39848330-twisted-prey", "http://www.goodreads.com/book/show/36168749-twisted-prey", "http://www.goodreads.com/book/show/37301.Rules_of_Prey", "http://www.goodreads.com/book/show/37304.Winter_Prey", "http://www.goodreads.com/book/show/9440448-buried-prey", "http://www.goodreads.com/book/show/14785.Chosen_Prey", "http://www.goodreads.com/book/show/988950.Dark_of_the_Moon"]}