{"ratings": 93192, "userreviews": [{"userName": "Petra X", "userReviewDate": "May 08, 2011", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "5 stars because it's a work of genius, so everyone says.4 stars because it has so many deep literary and classical references that to say one understood the book, is like saying one is very well educated.3 stars because the words, strung together in a stream-of-consciousness mellifluous, onomatopoeic way, read just beautifully.2 stars because it was boring as hell. I just couldn't care less about the characters, I just wanted them to get on with whatever they were doing and have Joyce interfere in their lives with his references, his poetry, and his mellifluous whathavewehere considerably less.1 star because I had to give it up. It got wet when I dropped it in the bath and the pages stuck together when I dried it out. Since it wasn't exactly cheap to start with and there wasn't another copy in the island bookshop (mine), I had no choice but to give it up.........Or at least that's my story and I'm sticking to it............Or it would have been if I hadn't had the audio book.Reviewed 28 May, 2011"}, {"userName": "Jimmy", "userReviewDate": "Apr 07, 2008", "userURL": "http://www.goodreads.com/user/show/1064949-jimmy", "userReview": "I Can't do it, It fell in my toilet and didn't dry well, and I'm accepting it as an act of god. I decided against burning it, and just threw it out.Yes, I am a horrible person."}, {"userName": "Ike", "userReviewDate": "Jul 18, 2008", "userURL": "http://www.goodreads.com/user/show/1290853-ike", "userReview": "Life is too short to read Ulysses."}, {"userName": "Paul Bryant", "userReviewDate": "Sep 25, 2007", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Each chapter is rated out of ten for difficulty, obscenity, general mindblowing brilliance and beauty of language.Note : if you're after my short course bluffer's guide to ulysses, here it is :http://www.goodreads.com/review/show/...But now... the real thing.******************* 1. Telemachus. Difficulty : 0 Obscenity: 0 General mindblowing brilliance : 8 Beauty of language : 7 Stephen the morose ex-student isn't enjoying life. Lots of brittle dialogue, mainly from motormouth blasphemer Buck Mulligan. Breakfast. An old crone delivers milk (this was before 24 hour Tescos). A modicum of swimming. Sea described as snotgreen.2. Nestor. Difficulty : 0 General mindblowing brilliance : 8 Obscenity : 0 Beauty of language : 7 Stephen is teaching history. He has a crap job as a part time teacher because he doesn't know what to do with his life. i can sympathise with that, I still don't. His pupils are mostly eager and polite so God knows how he'd get on in today's hellhole classrooms. Anyway he gets paid and his boss the pompous old git Deasey gives him a letter about foot and mouth disease to give to somebody else which Stephen couldn't give a flying fish about. He mooches off.3. Proteus Difficulty : 9 General mindblowing brilliance : 10 Obscenity: 2 (there's some nosepicking and urination) Beauty of language : 10 Now we get emo Steve trudging along the beach on his way to get a few pints down him, and now the Stream of the Consciousness starts up and gushes and torrents all over the place. And it's all stunningly beautiful. If I was a genius this is exactly how I'd think too. This may be my favourite chapter. May Stephen mooch about forever. Mooch on!4. Calypso. Difficulty : 5 (now we are getting used to the S of C and Bloom's S is so much easier than Stephen's S - although also a great deal less lovely) General mindblowing brilliance : 5 Obscenity : 8 Beauty of language : 3 We jump back to breakfast time and enter the house and mind of Leopold Bloom who's rustling up some breakfast for himself and his dear lady wife. As we are moseying along in Bloom's brain, accompanying him on his trip to the butchers, suddenly out of nowhere we get the c word - and it really isn't anything but a train of thought. Joyce could have included another stray thought. But no. Joyce was completely committed to the truthfulness of his technique and also convinced of his own genius too. Still, it comes as a shock. Later we trip down Bloom's garden to his outside toilet where he has a pleasant bowel movement: \"that slight constipation of yesterday quite gone. Hope it's not too big bring on piles again. No, just right.\" I mean, Jimmy, is this really necessary? But of course, in Ulysses, it is. The obscenity they found in Ulysses was mostly the disgustingness of minute descriptions of ordinary activities. In movies people never ever used to go to the toilet. Now they do it all the time - what was the first toilet scene in a movie? You could write a list of 20 great toilet scenes. (Contributions welcome.) It must be said that Bloom's mind is cram-ful of bits and bobs about his own life which are never explained, you just have to pick them up and piece them together if you can be arsed. But for instance Bloom is trying very hard not to think that Molly will be meeting Blazes Boylan in the afternoon and will probably be going to bed with him. It's one of those he-knows-but-does-she-know-he-knows situations. So, all in all, a very uncomfortable chapter. Oh, since you asked, I just went to my own toilet for the very same Bloomesque purposes - but not being Joyce, I'm not going to tell you anything further. But it was okay! Thanks for asking!5. The Lotus Eaters. Difficulty : 4 Obscenity: 4 (see below) General mindblowing brilliance : 2 Beauty of language : 2 There's a couple of tedious chapters of Ulysses, it must be confessed (aside from the chapter that's deliberately boring!) and this is one. Bloom is off on his rambling day, meets a couple of coves, visits a chemist and then a public bath (this was before the days of houses having bathrooms! Imagine that!). We get a lot of this kind of stuff - (Bloom is at the chemists):Living all the day among herbs, ointments, disinfectants. All his alabaster lilypots. Mortar and pestle. Aq. Dist. Fol. Laur. Te Virid. Smell almost cure you like the dentist's doorbell. Doctor whack. He ought to physic himself a bit. Electuary or emulsion. The first fellow that picked an herb to cure himself had a bit of pluck. Simples. Want to be careful. Enough stuff here to chloroform you. Test: turns blue litmus paper red. Chloroform. Overdose of laudanum. Sleeping draughts. Lovephiltres. Paragoric poppysyrup bad for cough. Clogs the pores or the phlegm. Poisons the only cures. Remedy where you least expect it. Clever of nature.I might have to agree with critics of Ulysses here - I don't need every scrap of word association and mental flotsam that swishes through Bloom's bumbling brain. But Joyce thinks I do!The obscenity in this chapter is here: Time to get a bath round the corner. Hammam. Turkish. Massage. Dirt gets rolled up in your navel. Nicer if a nice girl did it. Also I think I. Yes I. Do it in the bath. Curious longing I. Water to water. Combine business with pleasure.and here (he's in the bath now) [Bloom:] saw the dark tangled curls of his bush floating, floating hair of the stream around the limp father of thousands, a languid floating flower.Well... Bloom pleasures himself but you must say it's rather delicately put, no? (Another list please : greatest masturbation scenes in literature without mentioning Philip Roth!)6. Hades. Difficulty : 3 Obscenity: 2* General mindblowing brilliance : 2 Beauty of language : 3 Another chapter I'm not a fan of because we're stuck mostly inside the brain of Bloom who's full of Readers Digest tips and quips and boring \"I wonder if\" and Molly this and Milly that. The Homeric parallels : yes, well, he goes to a funeral and thinks about death and rotting and such, so that's Hades. Helen's friend Eleanor is living with us at the moment and she CLAIMED to have read Ulysses as part of a course on epics but when pressed admitted that she had SKIMMED it and didn't like it much to which I said \"Skimmed? SKIMMED? You can't skim the greatest modernist work of literature in English! Faugh! Crivens! Help ma Bob! I think I'm coming down with the apoplexy so I am!\" Even the tedious chapters, of which this is one, have to be read word by word, line by line.* the only trace of rudeness I could find in hades was this - Bloom is thinking about precisely when his son (deceased) was conceived: \"Must have been that morning in Raymond terrace she was at the window watching the two dogs at it by the wall... Give us a touch, Poldy. God, I'm dying for it. How life begins.\" To readers of 2010 it all seems somewhat coarse, yes, but to readers of the 1920s these stray remarks were incendiary. However I would like to complain about this otherwise handsome Modern Library hardback edition I'm reading. This is one of the two available hardbacks of Ulysses and it comes wreathed with introductions, blurbs and reprints of judicial decisions all of which are entirely to do with the alleged obscenity of the book. Hence I thought I would reread it partly with that in mind. But really, who cares any more about that? Get rid of all this stuff. Let's have an introduction all about the crackle and the pity and the joy and fire of this bizarre book.* 7. Aeolus. Difficulty : 5 Obscenity: 0 General mindblowing brilliance : 2 Beauty of language : 3 Oh dear - do I actually like this damned masterpiece at all? Another tiresome chapter full of huffy snippy geezers sniping and out-quoting and oneupmanshipping each other. Next! Quick!Review continues herehttp://www.goodreads.com/story/show/2..."}, {"userName": "Michael Finocchiaro", "userReviewDate": "Jul 16, 2016", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "I have read Ulysses at least three or four times (and once with Gilbert Stuart's authorised translation) and always found unsounded depths that I had not suspected. Every chapter introduces new narrative techniques, new perspectives and characters, and new voices. This is a book that definitely requires some homework to fully appreciate. I would recommend the aforementioned Gilbert Stuart commentary and biography, the Frank Budgen criticism, and especially the classic Richard Ellman biography. There is precious little here not to love regardless of your literary tastes, but like most good things, this book asks you to work for it. As Leopold Bloom goes through this day in Dublin, all kinds of things are happening all around him and it is a virtual reality experience in four dimensions - ending with for me one of the most beautiful chapters ever written, the stream of conscious dialog of Bloom's wife posing as Ulysses' Penelope. It is of such texture and voluptuousness that it is impossible to capture without first hand experience of having read it. If you put forward one personal challenge for a great summer read, make it Ulysses!I was recently in Dublin and spent a good 30 cold minutes with a strong wind on the turret where Buck Mulligan has his shave in Chapter 1 - amazing! I cannot even begin to express how this book moves me. When I get the classic GR question when friending \"what is your favorite book and why?\", I always answer \"Ulysses, because I learn more about myself everytime I read it!\"Most difficult books I have ever read (but which also gave me the most pleasure: Ulysses by James Joyce  La Recherche du Temps Perdu by Marcel Proust  Infinite Jest by DFW  Gravity's Rainbow by Thomas Pynchon  Underworld by Don DeLillo"}, {"userName": "Fernando", "userReviewDate": "Nov 15, 2016", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "\"He puesto tantos enigmas y puzzles que van a mantener ocupados a los catedráticos durante siglos debatiendo sobre lo que yo quería decir, y esta es la única manera de asegurarme la inmortalidad.\" James JoyceUn tour-de-force literario. No tengo otra manera de describir el proceso de lectura que me deparó el Ulises. Ha sido la prueba más dura, compleja y reveladora a la que me sometí con un libro, pero a la vez, una magnífica experiencia que nunca olvidaré. Me siento orgulloso de haber leído todo el libro disfrutando de la literatura sin tratar de entenderlo, sino de \"vivirlo\". Borges no lo pudo terminar (sin que con esto me crea que supero en algo a semejante maestro, pongo en consideración que el Ulises no es fácil de abordar). Amado, querido y respetado por muchos escritores (Orwell, Nabokov, Elliot, Banville, Faulkner, Pound) y denostado, odiado, destrozado por otros (Woolf, Borges, D.H. Lawrence), es un libro pesado, denso, inabarcable, ampuloso, que da miedo y que pareciera estar hecho para leerlo con la mente extraordinariamente abierta. Mi camino por sus páginas ha sido arduo. Very difficult.Este libro se tornó por momentos asfixiante, desesperante, hilarante, hartante, errante y todo aquello que termine en –ante. Es imposible querer tener la historia bien ordenada en la cabeza a medida que se la lee, porque es un libro que se presenta en forma caótica y desordenada y eso es lo que hace que el lector desista de avanzar luego de las primera cincuenta o cien páginas, dependiendo de qué resistencia aplique para persistir en la lectura antes de tirar la toalla. Es así de simple. El Ulises es un libro que se encara y se lo lee poniéndole (no hay que negarlo) mucha garra y corazón. Por mi parte, traté de informarme de qué manera estaba estructurado, es decir, de que se compone de tres partes (Telemaquía, Odisea y Nostos) que a su vez contienen dieciocho capítulos y que todos ellos tienen una relación directa con La Odisea de Homero, libro que le agradezco a Zeus de todo corazón haber leído para poder orientarme a los largo de las casi setecientas páginas que componen este ladrillo literario.Era fundamental saber que Leopoldo Bloom y Ulises realizan sus viajes odiseicos de manera similar con la diferencia que todo lo que sucede en Ulises pasa en sólo un día en la vida de Leopoldo Bloom (Ulises), Stephen Dedalus (Telémaco) y Molly Bloom (Penélope). Todo el libro sucede el 16 de junio de 1904. ¡Qué casualidad!, es un día después de mi cumpleaños, pero 68 años antes…No estoy de acuerdo con los que pregonan que para leer Ulises debemos conocernos Dublin como la palma de nuestra mano pero sí es de una gran ayuda el hecho de haber leído La Odisea. Confieso que tuve que anotarme algunas cosas puesto que de otra manera hubiera sido imposible para mí entender una sola frase y esto no significa que haga trampa o me imponga un auto-spoiler para evitarme inconvenientes de comprensión literaria, pero es necesario para afrontar la densa literatura que encierra el libro.Como comentara previamente y para aquellos que no lo hayan leído (me temo que son muchos. Muchos) cada capítulo hace referencia o alegoría a algo de la Odisea, como pueden ser personajes, personajes mitológicos o situaciones que vive Ulises en su epopeya homérica y para ello, Joyce despliega su enorme potencial de manera titánica. Por ejemplo el capítulo 6 se denomina Hades porque ese descenso al mundo de los muertos concuerda con el de Leopoldo Bloom al cementerio para despedir a su viejo amigo Dignam. El episodio 11 corresponde a las Sirenas y está totalmente emparentado con la música y el embelesamiento por parte de Bloom con dos meseras cantando.Cuando Bloom regresa a casa después de veinticuatro agotadoras horas, leemos lo que sucede en un capítulo llamado \"Ítaca\", al igual que Ulises en La Odisea. De esta manera uno va “entendiendo” para qué lado va la historia. Sin algo de esa información leve pero importante, la lectura se torna errática, enloquecedora o simplemente se pierde el interés.El capítulo 15, atribuido a Circe transcurre completamente dentro de un burdel en el que Bloom y Dedalus se ven rodeados de los personajes más extraños de los bajos dublineses y está escrito por Joyce como un guión completo de teatro, con instrucciones de escenario incluidas. Este capítulo ha sido uno de los más desesperantes para mí. Fue un momento en que casi sucumbí, puesto que se torna completamente incomprensible. Es un bombardeo constante de frases, palabras y diálogos inconexos, sin sentido ni construcción sintáctica o semántica. Un enloquecedor torbellino que golpean al lector como una ametralladora que dispara palabras sin cesar. Un auténtico infierno.Lo que pasa es que estamos hablando de un libro que posee en su idioma original más de 267.000 palabras y cerca de 30.000 vocablos, muchos de ellos de propia invención del autor. El libro posee texto en inglés, español, hebreo (Blom es judío), latín, francés, italiano, hindú, nonsense joyceano y palabras completamente inentendibles.En Ulises podemos encontrarnos con capítulos de narrativa tradicional como es el caso del capítulo 2 (\"Néstor\"), pero de a poco, todo comenzará a tornarse en textualidad apabullante, sobredimensionada y desbordante. A lo largo de esta historia desfilarán ante nuestros ojos, parodias de la novela romántica al estilo de los folletines del sigo XIX (\"Nausícaa\", capítulo 13), abundantes pasajes de poesía, canciones populares y tradicionales irlandesas, un capítulo completo escrito en pequeños fragmentos de estilo periodístico (\"Eolo\", capítulo 7), hay incontables ejemplos de simbología mitológica, bíblica y alegórica. En el capítulo 9, \"Escila y Caribdis\", Stephen Dedalus explica su propia teoría acerca de Shakespeare y Hamlet ” Por medio del álgebra demuestra que el nieto de Hamlet es el abuelo de Shakespeare, y que él mismo es el espectro de su propio padre.\". La sumisión, idolatría y homenaje de Joyce a Shakespeare es total y el bardo será nombrado y alabado en distintas partes del libro (\"Después de Dios, Shakespeare es el que más ha creado.\"), aunque también descubriremos referencias y cálidas palabras sobre Oscar Wilde, Charles Dickens, Thomas Carlyle y Daniel Defoe entre otros.El anteúltimo capítulo, Ítaca, era su preferido del libro (y el de Bernard Shaw), cuando Bloom llega finalmente a su casa está escrito en forma enciclopédica con preguntas y definiciones de alto contenido científico, poblado de párrafos inagotables, repletos de datos estadísticos y que a mi entender se relaciona con la singularización o desautomatización textual, un concepto literario que los formalistas rusos (Schklovsky) definían como el \"Arte como artificio\": \"La finalidad del arte es dar una sensación del objeto como visión y no como reconocimiento, los procedimientos del arte son el de singularización de los objetos, y el que consiste en oscurecer la forma, en aumentar la dificultad y la duración de la percepción. El acto de percepción es en arte un fin en sí y debe ser prolongado. El arte es un medio de experimentar el devenir del objeto: lo que ya está “realizado” no interesa para el arte\". Eso es lo que creo que Joyce utiliza en este capítulo. El no dice que \"Llenó con agua la pava\". Dice \"Pasó la cacerola a la hornalla de la izquierda, y levantándose llevó la pava de hierro a la pileta con el fin de hacer fluir la corriente de agua abriendo la canilla para dejarla salir\". De eso se trata \"aumentar la dificultad y la duración de la percepción\".Por último en el capítulo 18 y final, \"Penélope\", no encontraremos con la gran invención de James Joyce en la literatura: el \"Stream of conciousness\", también denominado \"monólogo interior\" (aunque también lo realiza Stephen Dedalus en el capítulo 3), y que para enunciarlo correctamente transcribo su definición como \"«corriente de la conciencia» que consiste en expresar los pensamientos del personaje sin una secuencia lógica, como ocurre en el pensamiento real. La culminación de esta técnica narrativa es el epílogo de la novela, el famoso monólogo de Molly Bloom, en el que el relato, sin signos de puntuación, emula el fluir, libre y desinhibido, del pensamiento\".Personalmente creo que más allá de esta invención literaria, ninguna persona en su sano juicio puede estar divagando como lo hace Molly durante ocho eternas oraciones que ocupan las últimas cuarenta páginas (¡40!) del libro sin freno ni la utilización de una sola coma.Finalmente Ulises es un mapa completo de la ciudad de Dublin. Toda la esencia de Irlanda está en esa ciudad y Joyce la lleva al detalle como si fuera una mezcla de guía turístico y cartógrafo profesional. Alguna vez supo decir que si Dublin desapareciera de manera catastrófica, esta ciudad podría ser reconstruida a partir de su libro y no se equivocó en absoluto.Se termina el año y me siento contento y orgulloso de esta fructífera lectura de clásicos que emprendí en 2016, que fue aún más extensa que la de 2015 y que abarcó, entre otros, algunos títulos \"Los Demonios\", \"El Maestro y Margarita\", \"Los Hermanos Karamazov\", \"Drácula\", \"Ilíada\", \"Odisea\", \"Stoner\", \"Cien Años de Soledad\", \"La Campana de Cristal\", \"El Señor de las Moscas\", \"La Letra Escarlata\", \"Jane Eyre\", \"Almas Muertas\", \"Ubik\", las dos versiones de \"El Doble\" y muchos más para coronarla con este libro enorme, monstruoso, genial, único, inclasificable y eterno que es el Ulises. Carlos Gamerro, escritor argentino y experto en la obra joyceana y que escribió uno fundamental llamado \"Ulises: claves de lectura\" dice que nada vuelve a ser lo mismo a partir de leer el Ulises y es verdad. Que uno puede no haber leído uno libro de un autor pero puede apoyarse en otros, pero que esto no sucede con el Ulises, ya que es un libro que no se parece a ningún otro.El modo de ver la literatura y el mundo cambian a partir de que uno lee esta obra de arte, puesto que no se la puede denominar de otra manera. Y James Joyce lo hizo posible.Dixit."}, {"userName": "Miriam", "userReviewDate": "Aug 17, 2008", "userURL": "http://www.goodreads.com/user/show/237469-miriam", "userReview": "Sometimes reading a Great Work of Literature is like drinking fine French wine, say an aged Burgundy or Mersault. Everyone tells you how amazing it is, and on an intellectual level you can appreciate the brilliance, the subtlety, the refinement. But really it is too refined. It is unapproachable, it is aloof, it doesn't go with thatketchupy burger you're having for dinner. You're not enjoying it.But then you read the label more closely and realize that although it tastes just like a fine burgundy your wine was made in the Abarca Hills of Chile. It is from Casa Marin and was in fact not made by a snooty Frenchman with a degree in oenology but by a down-to-earth woman farmer, and although it is sophisticated and complex there is a more accessible note, a friendliness... And perhaps more importantly, it is several percent higher in alcohol than that French wine youthought you had, and by the time you're halfway through the bottle it really seems pretty likeable after all, you and the wine are getting along just fine and you are having an enthusiastic discussion ofliterature with people who were strangers an hour ago, and one of them tells a dirty joke that Joyce would have sniggered at, and you laugh so hard you spill your wine on him, and maybe he's a little annoyedbut your host brings a towel and another bottle and the party isgreat. And maybe you are a wine ignoramus and the fancy bottle was kind of wasted on you, but you enjoyed it, so -- so what?"}, {"userName": "Bookdragon Sean ", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "I have left this book unrated because I simply cannot rate it. I cannot review it either or try to criticise it. Instead, I’ve decided to share my experience with something I cannot define. But first, here’s what James Joyce had to say about it: \n'I’ve put in so many enigmas and puzzles that it will keep the professors busy for centuries arguing over what I meant, and that’s the only way of insuring one’s immortality.’\nThe accuracy of this statement balances out the sheer arrogance of Joyce’s assertion. I tried to put my own design on the book. Well, at least, I tried to focus on one particular recurring theme as I read in order to try and bring the thing together in my own mind. I failed. I focused on Death, or at least, discussions of Death and the representations of it. But after a while the ideas started to contradict each other and fade out of the narrative only to randomly pop up again and vanish.Here’s three quotes I pulled out from the beginning though: “Old England is dying…….” “And what is death she asked…..” “In a dream she had come to him after death…..”Death, and its shadow, seemed to haunt the early part of the writing. What is this end we are pushing towards? Is it an end? Can we even call it painful? The idea it conveys is that time, at least time according to human perception, pushes singularly towards this phenomenon: the ultimate truth of life.  Ulysses is deeply symbolic. This haunting can be read as a decay of the state, the breakdown of society (its traditions and values) as it enters a new modern era. The old structures of civilisation are dying, the world is changing, art is changing, thought is changing and perhaps this is what  Ulysses represents in some sense. Perhaps this new creature of literature is the very essence of this new dawn, of the modernist art movement, or perhaps I have simply been swayed by one of the many nuanced impressions within the work, the subtle hints and suggestions that can be ready in so many different ways. I focused so much on death that when it left the narrative I did not know what else to look for or why I was reading it or where the story was going. This book is not something that fits into a nice little box or one that can be summed up accurately: it simply is a thing that is. Forming a coherent opinion of something so incoherent is even harder. What can one judge? The sheer brilliance of the innovative writing is juxtaposed against the dull drawn out interactions and descriptions. Isn’t that sentence just one huge contradiction? Well, the entire book is one contradiction. I could spend a lifetime studying  Ulysses and still not be able to decipher it.I hate it. I love it. I want to burn it. I want to celebrate it. Certainly, I enjoyed reading parts of  Ulysses, in fact, I engulfed parts of it. However, I detested just as many bits of it. I was so terribly bored with large parts of the novel, frustrated, agonised and, on one occasion, actually sent to sleep. You could imagine my dismay when I woke up the next morning with the thing on the floor and I’d lost my page number. I had no idea where I was exactly, somewhere between pages 300- 500 I guessed rather inaccurately, so I had to try and back track. Much harder than it sounds. I lost my place in a book that I was already lost in completely. Not lost as engrossed, but lost in the sense that I had no idea where the hell I was in this labyrinth of writing and that’s before I lost my page. Now there’s some irony. The result was me reading around seventy pages a second time round with next to no memory I had actually read them until I came across a rather distinctive passage and was rather annoyed with myself.  Ulysses is a book that washes over you; it’s the sort of book that you can spend reading for a few hours and then barely remember what you have read. It requires a reader who can pay attention to a book that has a wavering plot, likes to wonder all over the place, and then return randomly to characters that have disappeared for a long period of time. All in all, it was my nightmare and my dream. It defeated me twice. I kept forgetting what had happened, and despite reading so many plot summaries, I probably could not describe this book beyond what the blurb on my copy says. I feel like I need to read it again. The thought fills with me dread. Perhaps one day when I am old, surrounded by thousands of books and an army of loyal cats, I will pick up this book again and remember my initial desondency and admiration. Or perhaps I will be wiser. Perhaps I will see to the heart of the matter and hate/love Joyce even more for this, for this thing. As a random aside, I feel sorry for whatever kooky old professor in  Fahrenheit 451 drew the bad straw and had to remember this book. I digress, but imagine that. Poor bastard.  I had to start the book again three times, and I found myself agonising over sections of inane and irrelevant bollocks. But there’s also beauty inside, just like life. How sentimental of me.  Ulysses is modernism. Modernist literature varied, though a sense of newness permeated all artistic representations. And this was, and still is, something new. \nI dare you to go and read it for yourself."}, {"userName": "s.penkevich", "userReviewDate": "Sep 24, 2011", "userURL": "http://www.goodreads.com/user/show/6431467-s-penkevich", "userReview": "Often considered one of the ‘greatest novel of the 20th century’, James Joyce’s masterpiece, Ulysses, is both a feat and feast of sheer literary brilliance. Reimagining Homer’s epic poem The Odyssey as the travels and trials of an everyday man through the crowded streets and pubs of Dublin, Joyce weaves strikingly versatile prose styles and varying perspectives to encompass the whole of life within the hours of a single standard day, June 16th, 1904. This day, dubbed Bloomsday, is celebrated with increasing popularity in modern times, which is a testament to the lasting greatness of the novel (and to the desire to drink and be merry of all people). Instead of taking a daily life and elevating it to mythical proportions, Joyce has taken mythology and reversed it, shrinking it into an average day, which in turn gives each character and action a heroic sense about them. In this way, even besting a drunken nationalist spewing anti-sematic sentiments at a bar can be seen as a legendary conquest. Ulysses is an epic in its own right, setting the bar for literature up to the stratosphere as we immerse ourselves in Joyce’s dear dirty Dublin.While one must have their wits about them to navigate this laborious labyrinth of literature, the task is highly rewarding. It is very understandable that so many people do not finish this novel, or just plain dislike it; this book can be downright frustrating. Combining the heavy use of cryptic and dated allusions, obfuscating narration, an enviable vocabulary and pages of dense prose to decipher, Joyce intentionally set out to create a literary odyssey of words to conquer saying ‘I’ve put in so many enigmas and puzzles that it will keep the professors busy for centuries arguing over what I meant, and that’s the only way of ensuring one’s immortality.’ Readers should be warned this is a tough novel. Often times this novel inspired such frustration that it was tempting to slam the cover for good, and it wasn’t until the second half that I was finally able to recognize that this novel had written its way into my heart. Upon reflecting back after completion, only then did I realize that this truly is one of the greatest books ever written and I have come to love it. Perhaps this is akin to the feeling those who run marathons or climb mountains feel; the adventure is a long, arduous struggle where one must keep focus and positive to battle through, yet the pride and elation of completion more than makes up for the struggles. I do not wish to make this book seem like it is only for masochists though, as there are more than enough rewards to reap along the way. This is some of the finest displays of writing I have ever encountered, and offers a broad range of style. Many people fail to mention that this book is downright funny as well. There are countless little jokes, such as characters running from a bar so they can fart loudly unheard, endless sexual jokes and quips, and many funny characterizations. It should be noted as well that there is no shame in seeking aide for this book. Originally I didn’t want to, but there are so many esoteric allusions and puzzles that an annotation guide and a few essays really helped my understanding. This is a novel to teach to yourself, not just read – there are people who spent years at universities digging through this book and it is still widely debated. Even the great Ulysses (or Odysseus depending on who your asking) had to seek aide in his epic journey.The variety of style in this book is highly impressive. Each of the 18 chapters, aside from being thematically built around a corresponding episode of The Odyssey, has its own unique set of techniques and lexicon, often parodying the styles of newspapers or current women’s magazines, traditional Irish mythological styles, a chapter dissolving the world into scientific properties, the famous stream-of-consciousness, 200 pages of jocular hallucinations in play format, and a dizzying array of prose from flowery language to the language of flowers. Joyce had such a love of style that there is even an entire chapter devoted to alternating writing styles as he parodies many famous authors throughout history (calling all fans of David Mitchell or If on a winter's night a traveler) in a swirling scene of drunken debates. The language is often quite playful, lyrical and full of puns. He even uses sentence structure to convey motion, such as Gerty’s limp: ‘Tight boots? No. She’s lame! O!’. If just for the use of language alone, this is one of the most spectacular books ever written and practically killed my dictionary. Also, it is interesting that C.G. Jung diagnosed Joyce as having schizophrenia based on reading this book due to the rapidly changing styles and the use of playful rhyming and jangling speech. Joyce's daughter did in fact have schizophrenia.One of Ulysses most discussed features is Joyce's technique of placing the reader within the minds of the characters. It is not a typical first person narration, however, as the characters are seemingly unaffected and unaware they have a reader riding along in their thoughts. Information comes across in broken and random spurts, and Joyce does not bother with clarifying these thoughts to the reader. Much like William Faulkner, Joyce leaves the reader unaided to piece together his massive puzzle. Often the subject of a thought can switch between several people without any indication, as with Boylan and Bloom in Molly’s soliloquy, and many chapters take pages to realize who the person speaking is. While initially following Stephen and then Bloom second by second through their routine, the novel soon fractures into smaller chunks of concurrent narration, to further fit all of life within the day and to offer a broader, more varied perspective on the events that transpire. The idea of the ‘parallax’, which is essentially a scientific term that different perspectives will have a uniquely different view of the same object, is often on Bloom’s mind, and is a major theme running through this novel. Through the multiple points of view, the reader is flooded with alternative, and often conflicting, images of the characters. The readers must then decide themselves what is the whole picture.The various speakers are another testament to the versatility of the pen employed by Joyce. Each speaker has a drastically different tone and vocabulary, as well as structure (most notably Molly). There are times when the reader may wonder if Joyce’s opinions on the Jewish people and women may be rather negative, but then he will surprise you with a completely opposing statement. Women, and sexuality in general, are a major topic in this novel, and it is no surprise many have dismissed Joyce as a misogynist as many of the women in this novel are viewed strictly in regards to their sexuality. There are many female roles who are only used to further this idea, often by having many characters be prostitues. Through Bloom we see an unapologetic image of women as a sexual objects, and a male opinion on how women view sexuality. However, with Molly, Joyce offers a highly contrasted opinion on how women view their own sexuality, how women view men’s sexuality, and even how women view how men view women’s sexuality. Molly even fantasizes about having a penis and what it would be like to mount a woman. So while some ideas may be offensive to a reader, they must view it with an open mind and in the context of the novel and characters. Also, Joyce was aware of the overzealous censorship of novels in England and America and often wrote passages that blew past the lines intentionally to irk these censors. No wonder the novel was banned in American until 1934 when the Supreme Court over-turned the ruling in a landmark obscenity trial.Shakespeare’s Hamlet plays just as much of a role in this novel as the Odyssey. This further emphasizes the parallax, and Joyce’s goal to keep the life of his characters grounded in reality by not aligning any of the characters in a clear cut way. Hamlet is often discussed amongst the intelligentsia of Dublin, and a critical scene involves Stephen’s interpretation of the play revealing many themes of the novel at hand. From the ideas of Stephen’s role as Telemachus searching for a surrogate father in Bloom’s Ulysses as well as the ongoing thoughts over adultery all reveal themselves early on through Stephen’s lecture on Hamlet. However, this scene also demonstrates that Stephen is a Hamlet figure as well as Bloom being a figure of the deceased King, and that Molly may also fit the role of the betraying Queen as well as Penelope. There are many other roles in this novel that have more than one character that could fill them, such as how both Buck Mulligan and Blazes Boylan are both ‘usurpers’. It is interesting to note here that many of the characters, Mulligan in particular, are based from people Joyce interacted with in real life. ‘The supreme question about a work of art is out of how deep a life does it spring.’, is said at a timely manner when Stephen explores how the characters of Hamlet all correspond to Shakespeare’s own family, much like how these characters correspond to those around Bloom and to those that were surrounding Joyce. Stephen is also highly representative of Joyce himself. He was the hero of Joyce’s semi-autobiographical novel A Portrait of the Artist as a Young Man, and in this novel we see him continue his quest of artistry. He even sides with an unborn child in a debate over whether a mother or child’s life is more important during birth, signifying his ideas that art, something we create, is of the utmost importance. A touch of metafiction as well as a compounding use of themes is one of the many ways this book stole my heart.Joyce avoids distinct lines anywhere he can with this novel. Characters such as Bloom are walking contradictions and a paradox to those around him. He is Jewish, but also baptized. He is a father figure, but also displays many motherly traits and desires causing the more masculine characters to harbor a bit of disdain for him for being rather ‘womanly’. He is very caring and generous, but then at times very cheap and critical of others for their generosity. Such is the enigma of Leopold Bloom, one of the most likeable everyman characters in all of literature (it was very difficult not to picture him as George Clooney from O Brother, Where Art Thou?, another wonderful retelling of The Odyssey). He is not without his faults though, as he is a shameless womanizer and has the ‘undressing eyes’ aimed at all the fair ladies of Dublin (and what is with Joyce and men masturbating in public, ie The Encounter from Dubliners? I’m on to you Joyce…). Bloom spends much of this novel on the go, trying to move forward from the sadness of his past and the weight of thoughts of his wife’s possible transgressions. ‘Think you’re escaping and run into yourself,’ Bloom mentions. His ‘coming together’ with Stephen is also grounded in reality, as there is no clear-cut bond between them. ‘Frailty thy name is marriage’ Bloom thinks, playing off of the famous line from Hamlet. The marriage of Bloom and Stephen, Bloom and Molly, and many other ‘marriages’ of characters are fraught with incompatible moments, as people just do not always get along or agree. While the union of Bloom and Stephen is alluded to through the entire novel, they often are at odds with one another or offend the other while trying to be friendly. However, this meeting is highly significant in both their lives, and as many of these ‘marriages’ are flawed, they are shown as having shaped each individual. As C.G. Jung once wrote, ‘The meeting of two personalities is like the contact between two chemical substances. If there is any reaction, both are transformed.’Ulysses is not an easy novel by any means, but it is well worth the effort. The prose may be daunting at first, but patients, and a bit of guidance can really go a long way and this novel will eventually bloom for any reader so they can drink the sweet language of Joyce’s pen. There are so many wonderful techniques buzzing about and puzzles to unlock. Plus, this novel is outright hilarious. For one of the more comprehensive reviews you can find, you should also read Ian's stunning review.  Joyce has certainly left his mark on the face of literature with this novel, which is more than deserving of the title bestowed on it by the Modern Library of the greatest novel of the 20th century. Yes it is the greatest and yes you should read it and yes each word will blossom in your mind and Yes will I give this book a 5/5 and yes I said yes I will Yes.5/5Also, reading this book in public will make you appear smart.And even the great Jorge Luis Borges was moved by this novel:James Joyce (as translated by Norman Thomas di Giovanni)In a man’s single day are all the daysof time from that unimaginablefirst day, when a terrible God marked outthe days and agonies, to that other,when the ubiquitous flow of earthlytime goes back to its source, Eternity,and flickers out in the present, the past,and the future—what now belongs to me.Between dawn and dark lies the historyof the world. From the vault of night I seeat my feet the wanderings of the Jew,Carthage put to the sword, Heaven and Hell.Grant me, O Lord, the courage and the joyto ascend to the summit of this day."}, {"userName": "Dan", "userReviewDate": "Mar 28, 2009", "userURL": "http://www.goodreads.com/user/show/1344527-dan", "userReview": "Good books should participate in a \"conversation\" with each other, and with us when we read them. I made the mistake of inviting Joyce - via Ulysses - to join my literary conversation. He's not much of a conversationalist. He mostly just sat in a corner mumbling incoherently to himself. Every once in a while he'd quote - or try to ridicule - something he'd read somewhere, but that's not really conversation is it? More like namedropping.Buried within Joyce's verbosity is something similar to a plot related to a day in the life of Leopold Bloom, husband of Molly, father of Milly - away at photography school - and Rudy - namesake of Poldy's father - who's death at eleven days of age strained the marriage beyond recovery but left the sexual obsessions of Poldy and Molly intact leading to scenes such as Leopold masturbating on the beach while flirting at a distance with Gerty MacDowell or Molly masturbating as she daydreams about past, current, and future lovers including Stephen Dedalus who is seen by both Leopold and Molly as a substitute for poor Rudy - albeit in very different ways. How about that? I can write at least as well as James Joyce.Reading Ulysses is something akin to reading a very long list of spelling words...many of them without spaces between them. I've come to the conclusion that stream of consciousness writing comes in two forms. In one form, authors such as Thomas Pynchon and Virginia Woolf employ real - albeit often strange - sentences to portray the thought processes of their characters. The second form - epitomized by James Joyce and William Faulkner - involves the mere stringing together of unrelated words perhaps with the intention of revealing the depth of the psychosis of their characters. I much prefer the former method."}, {"userName": "Lyn", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "The singer asked the crowd - \"how many of your have read James Joyce?\" He had just sang Whiskey in the Jar and was queuing up to sing Finnegan's Wake, he was setting the stage for his next song. A few hands went up, mine among them. We were in The Merry Ploughman's Pub in South Dublin and the crowd was having a good time, singing and drinking Guiness from pint glasses. \"Now, how many understood what you read?\" The crowd laughed and half as many hands stayed up and I realized my extended arm wavered some too.I have looked at Ulysses over the years like it was a high and formidable mountain to climb. I have picked it up several times over the years, weighed it, set it beside the phone book and compared width. I have scanned the pages and noticed with alarm a painful lack of punctuation, and not the Cormac McCarthy kind of simplicity; but run on sentences, stream of consciousness. I have avoided the The Sound and the Fury for the same reason, finally giving up on that. Mailer’s Why Are We in Vietnam? was a morass of nonsense that I slogged through to the end, but it was a relatively short book. And then there is the length. Formidable. I read through War and Peace, in awe of its epic stature, and I finished Atlas Shrugged out of sheer inertia and also out of a morbid curiosity to see it through. Ulysses was long and in stream of consciousness prose.And so the years went by and I could not bring myself to begin the climb, did not feel up to sloshing through the swamp of adjectives and relentless narration.When I did finally begin, I was pleasantly surprised. The stream of consciousness technique was not overwhelming, was not the nonsensical morass of Mailer nor the cacophony of thought from Faulkner. Joyce’s language is rich and engaging, his storytelling modern and experimental but still approachable. There were moments that I was in love with the book, believing this was the greatest novel I had ever read, I was convinced of Joyce’s brilliance and inspired by his genius. It is funny, profane, irreverent, even shocking. The references to classic literature, especially the parallels with Homer makes it worthy of a greater review than I can come up with. Molly Bloom's lengthy soliloquy at the end is a gem of vulgarity and human observation. Other times I was simply reading to get through, keeping a runner’s pace through the long back miles and steep hills of a marathon.Ultimately, this is a masterpiece, a great work in the English language or of any language, literature of the highest order. But it can be difficult, in its length and its narration, and Joyce asks a lot of his reader, his prose is steeped in his own erudition and he makes little attempt to step it down. But for the reader who makes it to the top, it is a great view from the summit."}, {"userName": "Matt", "userReviewDate": "Jan 14, 2008", "userURL": "http://www.goodreads.com/user/show/780845-matt", "userReview": "as a bloke with an english degree, i guess i'm supposed to extol all thing joycian and gladly turn myself self over to the church of joye. after all, that's what english grads do, right? we revel in our snobbery and gloat about having read 'gravity's rainbow' and 'ulysses' start to finish.well, i may be in the minority when i say i didn't care for this book at all. i get that it's a complex book with innumerable references to greek mythology, heavy allegories, dense poetry wacky structures, and to some serves as a sort of mental masturbation. however, i think it's also pretty unreadable. maybe i'm old-fashioned, but i think books should be accessible and readable. it's something john steinbeck understood all too well. he most definitely wrote for the masses and the 'every man,' and it shows in his work. i prefer books that use simple language to expound on profound truths, not necessarily a book that requires me to constanty refer to other sources to help me understand what i've just read. this, of course, is just my opinion and should be taken as nothing more. i'm hesitant to say that anyone who gives this book 'five stars' does so because 'ulysses' carries such a cachet amongt the academic elite and intelligentsia, but i think most of them probably do. sure, that's unfair, but i'm really kind of wondering how anyone ever finished it. it's a bit of bore, linguistical acrobatics or not. if you do decide to read it, definitely get a copy with judge john m. woolsey's treatise on lifting the ban on 'ulysses.' it's a remarkable piece of writing and display's the judges thoughtfulness, eloquence, and fair-mindedness. it's the standard by which all judicial opinions should be judged [no pun intended!].maybe you'll read 'ulysses,' maybe you won't. if you do and you don't care for it, that's ok. being a great reader doesn't mean you two the critical line."}, {"userName": "Fionnuala", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "Reviewed in August 2012This review is my attempt to reclaim Ulysses from the academics. My edition was a simple paperback without notes or glossary but containing a preface which I intend to read after I've written my review. I'll probably look at other reviews too, as frankly, I'm suffering withdrawal symptoms from the world of this novel. The word 'novel' seems inappropriate to describe Ulysses but at the same time, the word might have been invented specifically to describe it. Everything about it is novel, from the structure to the use of language, from the characterisation to the treatment of history. But by ‘novel’, I don’t mean experimental in an obscure or inaccessible way, as its reputation seems to imply: I found Flan O’Brian’s At Swim Two Birds quite difficult to follow in a way that Ulysses is definitely not and I’m finding Beckett’s Molloy, which I’m currently reading, much more difficult to get involved with; Ulysses was pure pleasure in comparison. So why has this book developed such a fearsome reputation? Perhaps because we mistakenly think that to understand it, we need to have a thorough knowledge of the classics, including Shakespeare and Homer. The fact that I know very little about the Odyssey except that it recounts a long journey home made by Odysseus/Ulysses didn’t take from my enjoyment in the least. I’m not an expert on Hamlet either, but the little I know, and which most people probably know, was sufficient to allow me to follow the sections which refer to it. There are a few Old English phrases near the beginning that I googled but I soon decided to just let myself sink into the world of Leopold Bloom and Stephen Dedalus without further interruption. Being able to read this without disruption is probably part of the reason I enjoyed the experience so much. When I bought my copy some fifteen years ago, I read about a third of it with great pleasure but as I had young children at the time and limited free moments, I had to give up when the reading experience became more challenging. And yes, it does become challenging in some parts, but never for very long, as if Joyce knew exactly how far he could try our patience. As to deciphering those challenging sections, I think that one reader’s guess is as good as another’s. A big part of the pleasure for me was the puzzle element because I had plenty of time to reflect on what I was reading, time to figure out a meaning that satisfied me and also made sense of the bigger picture. And that’s what my reading without notes proved to me: there is a perfectly logical trajectory behind it all, even behind the more phantasmagorical elements. During the course of one day, Joyce reveals more and more facets of his main character, Leopold Bloom, and of the world he lived in. The characterisation of Bloom is so well done that by the end, he represents everyman, and every woman too, as well as messiahs and prophets, kings and emperors, in short all of humanity, complete with all of its goodness, and yes, some of its failings. Of course, my interpretation may not be accurate and there may be acres of symbolism that I missed, but since I had such a satisfying read, how can that matter? My satisfaction may have depended to some extent on the fact that I have an Irish background, but to what degree it helped me, I cannot tell. It is true that some of the material was familiar from history lessons and from general culture but at the same time, the Dublin of 1904 was a complete revelation to me. And the themes covered move quickly from the local to the universal so that a lack of knowledge of Irish life and culture shouldn’t be an impossible barrier, just a challenging one. If you prefer exciting, stimulating, rewarding reading experiences, Ulysses is definitely for you."}, {"userName": "Emily May", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I did it. I finished it. And it was everything everyone said it would be: difficult, infuriating, brilliant, insane, genius, painful, etc. You get the idea, I'm sure. I can't even rate it. How do you rate a book that left you wide-eyed with awe at the author's brilliance, yet simultaneously made you want to bring him back to life just so you could kill him?"}, {"userName": "William1", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/4684009-william1", "userReview": "NOTES:1. Reading this so late, so long after its lessons have been absorbed and modified and abandoned and resurrected (see Will Self's Umbrella), I can't imagine what it was like for a first-time reader in 1922-23. For those who both loved and hated it, it must have been a hydrogen bomb of a book. The classicists must have been fit for tying. The hubris of rewriting Homer. The classicists must have been apoplectic!2. In the Hades/Graveyard section (6), Leopold Bloom considers the enormity of death at Dignam's graveside: \"Must be 20 or 30 funerals every day [here]. Then Mount Jerome for the Protestants. Funerals all over the world everywhere every minute. Shoveling them under by the cartload doublequick. Thousands every hour. Too many in the world.\" And later: \"Plant him and have done with him. Like down a coalshoot.\"3. I suppose what dazzles me most is that this Novel can be so thoroughly packed with subtext, yet remain so readable. Is it the first scalable modern novel? This of course almost guarantees ever richer subsequent readings.4. Father Conmee. What a great name. Too funny. Not sure if this is a pattern yet, but so far Joyce seems to alternate chapters of rich allusion (Stephen Dedalus and others discussing Hamlet at National Library in the Scylla and Charibdis chapter) with chapters of pretty straightforward action (Conmee, Bloom's peripatetic progress). There's conflation, too, of Odysseus ten-year ordeal at sea with Leopold Bloom as Wandering Jew. 5. The Wandering Rocks chapter is Ulysses's center where Joyce parades virtually his entire cast past the reader as the Governor makes what smacks as a triumphal progress through Dublin. This reminds me very much of Henry Fielding's The History of Tom Jones: A Foundling, when all the players cross paths at the inn in the book's middle. Perhaps Fielding was also using a Homeric model?6. It's hard to endure the jeering layabouts (Lenehan, Dedalus pere, Dollard, etc.) as they make fun of Bloom's misfortune. Bloom who, suffering in silence, we come to like more and more. Also, cross-cutting, filmic. Yet we read (mostly) with assurance. Sure of our way. Again, I can't imagine what the first readers felt. Unlike us they had no precedent.7. Joyce's penchant for puns annoys. Actually, I'm beginning to hate it. Funny, almost everything else I'm fine with: the purposeful rhymes; the interlarded alternately speculative, abject, or ebullient etc consciousnesses; the rich allusiveness and multiple languages; the use of meaningless, infantile sounds, almost a babble (or perhaps Babel). Yet the puns strike me as sophomoric, someone playing saw amidst the philharmonic. Harsh dissonance. I suppose dissonance is sometimes useful. Penderecki springs to mind, and Coltrane, though these may be extreme examples.8. On another level the book can be read, at least in part, as an indictment of Irish Anti-Semitism. As expressed cogently on p. 484 of my Everyman edition: And to the solemn court of Green street there came sir Frederick the Falconer. And he sat him there about the hour of five o'clock to administer the law of the brehons at the commission for all that and those parts to be holden in and for the county of the city of Dublin. And there sat with him the high sinhedrim of the twelve tribes of Iar, for every tribe one man, of the tribe of Patrick and of the tribe of Hugh and of the tribe of Owen and of the tribe of Conn and of the tribe of Oscar and of the tribe of Fergus and of the tribe of Finn and of the tribe of Dermot and of the tribe of Cormac and of the tribe of Kevin and of the tribe of Caolte and of the tribe of Ossian, there being in all twelve good men and true. And he conjured them by Him who died on rood that they should well and truly try and true deliverance make in the issue joined between their sovereign lord the king and the prisoner at the bar and true verdict give according to the evidence, [etc.]This passage and others ridicules the bigotry and suggests that we are all of us of one tribe. Not to put too fine a point on it, but much else is given similar treatment in this chapter: blind nationalism, especially, which, at time of publication, had done so much to depopulate Europe of its young men. Come to think of it, aside from the well-known exceptions, there are no teeming displays of young men in the novel as there are displays of old men. On p. 632, supporting this observation, there is a deprecation of the \"mutilated soldiers and sailors\" of Dublin's streets.9. In the pure-streaming language section now known as \"Oxen of the Sun.\" If this were Kubrick's 2001: A Space Odyssey, this would be the part where Dave has entered the pod and is now speeding through far-flung intergalactic space experiencing a virtuoso display of psychedelic landscapes on the way. Yes, one can see how this would have been completely new in 1922. Then the language turns mock-chivalric/courtly/archaic as Bloom awaits some word on the Purefoy child. (See Erik's excellent comment No. 30 below.) Dixon arrives and so it's hie to the pub where Bloom comes upon a drunken Stephen, and they await Stately, Plump, Buck Mulligan. After long consideration of Mrs. Purefoy's protracted labor, Malachi arrives with the hilarious lament, to wit:It grieved him plaguily, he said, to see the nuptial couch defrauded of its dearest pledges: and to reflect upon so many agreeable females with rich jointures, a prey to the vilest bonzes, who hide their flambeau under a bushel in an uncongenial cloister or lose their womanly bloom in the embraces of some unaccountable muskin when they might multiply the inlets of happiness, sacrificing the inestimable jewel of their sex when a hundred pretty fellows were at hand to caress, this, he assured them, made his heart weep.This chapter must include a dozen or so parodies of various narrative styles, each with an almost seamless transition to the next. I can only pick out a handful of them on this first reading. They include the triumphalist battle song, troubadour's ballad, bawdy Rabelaisian tale, ancient Greek drama, epistolary, confessional, gothic, and Restoration Comedy modes, etc.10. The early going in the hallucinatory Brothel chapter (15) is as funny as anything in the book. I especially like Bloom's mock trial in the street, which might be called \"Bloom's Ordeal,\" for sexual molestation and general rakishness. The style reminds me of Samuel Beckett who, as we know, thought the world of Joyce. Most of the section is wildly madcap and suggests a sheer ecstatic joy in storytelling. But it is long, too. Stephen's Latin has worn thin. I've stopped translating these passages. That can wait for a second reading. I have to admit I'm a trifle mystified by the long sex-reversal hallucination with Bello and Bloom. I thought at first that it might be a proto-feminist tract whose unseemly length hammers home a commentary about the lowly station of early 20th century women, but but then I thought that's too earnest and forthright for Joyce, who was no one's moralist. This was almost immediately contradicted by a passage in the following chapter (16), set in the cabman's shelter, in which the fate of prostitutes is bemoaned at length. The chapter (15) is a massive, teeming set-piece in which every character in the book makes an appearance, plus many historical figures not seen before: Shakespeare, Edward the Seventh, Lord Tennyson, etc. This was for me the most wearying slog of the entire book. I put it aside and came back four times before I could finish it. Hope your progress is brisker.11. Skipped pages 948-1005, a thing I abhor doing. I just felt that if I didn't I would never get to Molly's soliloquy."}, {"userName": "Kalliope", "userReviewDate": "Jun 28, 2014", "userURL": "http://www.goodreads.com/user/show/3593962-kalliope", "userReview": "[https://www.goodreads.com/book/show/5... (hide spoiler)]"}, {"userName": "Seemita", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/34622220-seemita", "userReview": "[When I started, I had two versions of Ulysses with me; a kindle version and a paperback. I wasn’t quite sure which one I should rather read. So, I did just a little bit of support-text research. There are loads of stuff offline and online and I am mentioning here only those that I sort of feel would be useful: Ulysses Annotated is a rich book for those looking for annotations to help understand certain contexts of political, commercial and religious heat of that time. Also, the deployment of multiple languages means multiple references to translating websites/ apps, where again, this book comes handy. But it is expensive (in fact, more expensive than Ulysses!) and may be unavailable in libraries. In such a scenario, there is a free alternative which is fairly good, if not that good as the book. Put together by some lovely soul from Columbia University, this neat website has annotations for most of the chapters and these annotations have their source back in Ulysses Annotated. If podcasts or audio is your thing, you could check Frank Delany's blog for some assistance. And now with all these resources, we are back to same question - how does one read Ulysses? Well, there is no answer, really. I ended up reading both my kindle and paperback; one after another. I didn’t refer to the annotations beyond Chapter 3 and went free bird thereon. There was a certain rhythm that had seeped into my reading and I begun viewing the incessant reference as an impediment in the overall experience. I do intend to read this again someday with all the annotations in place. That should be, then, an experience of another kind! Oh another element in this: does one need to read Odyssey before venturing into Ulysses as most of us know the former to be the structural bed of the latter? I have only one answer; if you have read Odyssey, great! and if you haven’t, fantastic! Either way, you are bound to have a trip of your life :) (hide spoiler)]"}, {"userName": "MJ Nicholls", "userReviewDate": "Aug 12, 2012", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "First, about the haste. This book is a page-turner. Forget Stephen King. Joyce is the man you read in bed, furiously tongue-fingering the pages to see what seminal modernist technique he invents, masters, inverts, spins on its head like a circus freak with a whirligig in his bonce. The first five episodes set the pace perfectly, setting the reader up for the all-singing all-dancing feats of outrageous showboating that follow in the remaining thirteen chapters, each adding a few Jenga blocks to the superseding chapters to challenge the reader and keep her on her toes. Look, Joyce loves his reader! He’s the most unpatronising author this side of L.L. Cool J.! Joyce believes in you. He believes everyone has the capacity within them to crack his boggling Enigma code, and if that isn’t some heartwarming Sunday school moral, what is? So what if Joyce was wrong and every reader would need The New Bloomsday Book merely to scratch the surface of this amorphous, expanding superbrain of a book? Ulysses is an infinite novel. Unlike Finnegans Wake, where every attempt at some semblance of lucidity and meaning falls flat—the book a distant satellite fated to drift forever in space—Ulysses is an infinitely re-readable supernova of emotional and intellectual replenishment. Pure aesthetic pleasure. Everything that followed Ulysses expanded, plundered and rehashed Ulysses. It was the end and beginning of literature. If you like any books at all, anything post-Ulysses, you’re an ideal candidate to read Ulysses. It will break your heart, and your brain. End of."}, {"userName": "Renato Magalhães Rocha", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/29402621-renato-magalh-es-rocha", "userReview": "Like Odysseus was aided by his fellow men and gods on his quest to return to Ithaca after twenty years of absence, I, who feared so much tackling Ulysses all by myself, for its complexity amounted a reputation as big and powerful as the Trojan horse, I received great help from my fellow companionship from the Odysseus to Ulysses reading group, who contributed with information, different interpretations and perspectives - which without I might have failed at finishing - and that undoubtedly pushed me to finally get to my Penelope - or, in that case, Molly.I'm not gonna lie though: even with all that help, concentrating and focusing at times were rather difficult tasks for me to accomplish, not that the process wasn't amusing as I found it curious to observe that while reading a character's stream of consciousness - and the writer really excelled in writing those as it was mind boggling how one thing led to another and how many times I thought to myself how it all made perfect sense and how everything had been finely connected -, but while reading Joyce's words, streams of my own were triggered, and as I started following them thought after thought, my eyes - feeling cast aside, completely ignored - complained that my brain wasn't processing what they were showing and how they were working for nothing - see, the eyes are forever jealous of the mind's eye, the one that truly possesses the great power of vision. It turned out my brain assumed that since I was reading someone else's stream of thoughts, it set out on a quest to prove that it could produce its own - and \"much better!\", it told me - since it had the deepest knowledge of what would really interest me. So I did find myself having to go back two or three pages - oh how my eyes protested against it! - to be able to return to Joyce's book.As it happened when I started reading The Odyssey, I was very anxious to meet Odysseus. So, in Ulysses, after going through its first three episodes, I was all ready for some Bloom: such expectations were certainly met with some reservations. He made me very angry countless times with his tip-toeing and what seemed to be a general lack of courage to engage in confrontation (I should just say \"he lacked balls\", as it would definitely go well with the feel of the book and its indecent manners, as it was accused of being upon its release) - but when I came to think of it, even this anger Bloom provoked in me was a brilliant move from Joyce's part, especially once we think Leopold is a modern day Odysseus: he flees from fights as quickly as the Greek warrior ran into them, asked, solicited them. If Odysseus's soul had reincarnated into Leopold Bloom, one could make a point that it was still so tired after so many endless traps and mishaps from its past life that it lost all of its vigor, power and energy, thus turning into someone who, while faced with daily, banal difficulties, couldn't even gather one tenth of the necessary strength he had showed in the past to face his adversities.But as Joyce wouldn't write a one-dimensional character, I did empathize with Bloom on one or two occasions, the main one being his recognizing in Stephen Dedalus his dead son Rudy, and wishing to take him under his wing and care for him as a proper father would. Although there wasn't much else I could relate to when it came to Joyce's other characters, I did recognize myself in the moments where a character is seemingly engaged in conversation with another, but what goes through his mind has nothing to do with that talk. I usually lose track of conversations I'm having because I'm inside of my head, and if my interlocutor could come up to me, just as close as it takes and peek through my eyes, he definitely would see a complete different and separate place, in another time and in another situation. This gave me a very good sense of reality in Joyce's writing and the feeling that he was really devoted in being as realistic as he could be.He toys with language and style like no other: each episode is written differently from the previous and the next, and that advantage you normally gain in reading books that flow better once you adjust to their universe never works for Ulysses, since each episode felt like a new, different and (at times) more complicated beginning, like a new battle. His versatility seems to be unmatched. While Wandering Rocks (episode 10) is written in a fast-paced mode, composed of little vignettes following characters out and about Dublin that are intertwined here and there through small details, taking the reader to a car ride around the city, watching, while passing, every scene as if he was at home pressing fast-forward on a film playing on the tv, Circe (episode 15), is a surrealist play featuring fantasies, sexual fetishes and hallucinations: it is even structured as a play, with dialogues assigned to the characters and even stage directions. In this lengthy episode, Joyce takes us as deep as unimaginable to a level as of yet unexplored in Bloom's and Dedalus's subconscious. Penelope (episode 18, the last one) leaves it all behind and we find ourselves inside of Molly's head, witnessing her side of the story, her frustrations and expectations, all through a woman's perspective.At the core of the novel, dusting off all parallels, correspondences and contrasts, blowing out the candles and leaving the book with just a basic moonlight to illuminate it, we find the book's raw plot. Joyce has his characters performing mundane and uninspired tasks - as most of the days on ordinary people's lives really are - which poses an interesting challenge for the writer: how to involve his reader? How to make him want more of this story? What would make a reader continue to go through a struggle reading?It's difficult? Yes, but it's rewarding at the same time. Joyce himself has said it that he wrote in his book \"so many enigmas and puzzles that it will keep the professors busy for centuries arguing over what I meant.\" Did I assimilate everything Joyce was throwing my way? No. There are many literary, political and historic references that in one way or another I was able to understand, but some (honestly? most!) I for sure overlooked, and that brings me to another important point I had in the back of my head throughout my reading experience.There are many levels of reading and different types of readers and because of that, each Ulysses is as unique as the next person, so one should never expect to read the same book or find the same reading experience as others. The amount of references, connections, underlying motifs, web of ideas and synapses labyrinth to be found here is simply Homeric. To be able to enjoy this book and Joyce's literary achievement, to relish in his geniality, you don't need to have a checklist to know you absorbed everything or pen and paper to cross each item you understood as if it was a to-do list. It's mean to be reading, it's not homework, although the latter is deeply connected with the former, they're separate things that serve different purposes. I, for one, really enjoy understanding connections as well as possible, so I did my share of external reading as far as my curiosity took me, I did not push myself any harder than that. I prepared a joyceride where I read Dubliners, A Portrait of the Artist as a Young Man, The Odyssey and Hamlet, and even used a very helpful guide (The New Bloomsday Book: A Guide Through Ulysses) - but those were books - minus the guide - I would already read at one point or another. It's certainly not mandatory - don't shy away from this book because it seems like a chore and too much work - to read any of those in order to conquer Ulysses and, frankly, even with as many references as I gathered, I wasn't able to take everything at once, and that's ok. I don't need to, no one needs to. Plus, it would for sure take away all the fun of a re-read.Speaking of re-reading, I regret my decision of reading this work in Portuguese. This isn't at all a testament against Caetano W. Galindo's translation: he's an accomplished translator and one of the best and I do believe he made the best choices he could in order to make Joyce's masterpiece make sense in our language, but nonetheless some things were lost as they just wouldn't translate well. I kept an English copy for reference and it was pretty useful, but I do plan to re-read the entire book in its original form late next year.Rating: one of the criteria I use to evaluate just how much I enjoyed a book is the level of related reading it prompts me to do. I already listed what I read in preparation for this literary journey, and now I have a list of post-reading that I want to tackle: James Joyce (a biography by Richard Ellmann), Re Joyce, Finnegans Wake, and then re-read Ulysses and A Portrait of the Artist as a Young Man... well, 5 stars."}, {"userName": "Manny", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "(Geneva, late 2012. Plainpalais market, a riotous display of phallic vegetables, ill-smelling cheese and trash literature. THE REVIEWER and his GIRLFRIEND walk through the stalls hand in hand. Polyglot conversations around them.)THE REVIEWER: Now here's a significant quote.\"My methods are new and are causing surpriseTo make the blind see I throw dust in their eyes.\"STANISLAW LEM: Mogę to rozwinąć.MICHAEL KANDEL: I can give you more details on that.SWEDISH SHOPPER: Hej! Jag kommer ifrån Bollestad. THE REVIEWER: And this one. \"The sense of beauty leads us astray.\" It's like Proust, but the exact opposite. Maximally implicit rather than maximally explicit. AMERICAN SHOPPER: I'm from Biloxi. THE REVIEWER: A projective space? A Riemann sphere? U.P.: up. Or down, if you prefer. It comes to the same thing.(THE GIRLFRIEND gives him a irritated look)THE REVIEWER: [Smugly] Don't get your knickors in a twistor.[They have reached a bookstall full of lurid French paperbacks. THE GIRLFRIEND, ignoring him, starts going through them]THE GIRLFRIEND: Have you read this one? Les Sirènes de l'Autoroute.THE REVIEWER: Très douce.THE GIRLFRIEND: Les Sacrifiés du Soleil?THE REVIEWER: Amazingly, appallingly alliterative!THE GIRLFRIEND: La Plage aux Nymphes?THE REVIEWER: Nausicating.GIRLFRIEND: [Giving up in disgust] You're such a smartarse. What were you talking about? Cosmology again?ALBERT EINSTEIN: Take one curvature tensor, contract, subtract a scalar, et voilà! Instant universe. On that mystery and not on the Madonna which the cunning Italian intellect flung to the mob of Europe the Church is founded and founded irremovably because founded, like the world, macro- and microcosm, upon the void. Ex nihilo nihil fit. Mais non. THE GIRLFRIEND: Speak English, you old fart.[EINSTEIN shrugs and calls over LAWRENCE KRAUSS and RICHARD DAWKINS to join him. They sing together in uncertain harmony]ALBERT EINSTEIN: Space is curved.LAWRENCE KRAUSS: But it's flat.RICHARD DAWKINS: Well, that's put an end to that.THE REVIEWER: I'm not sure I follow---RICHARD DAWKINS: [Irritated] There is no God. Do I have to explain everything? [EINSTEIN, KRAUSS and DAWKINS all disappear again. THE REVIEWER and his GIRLFRIEND proceed towards the Route de Carouge. A TRAM passes, on its side a Christmas-themed wine poster whose title is \"La belle houx\"]THE TRAM: Brhm brhm brhm brhm-hm-hm. Brhm.STEPHEN POTTER: [Holding wine-glass] Too many tramlines. THE REVIEWER: A little bit cornery round the edges.STEPHEN POTTER: Well ployed sir! [He raises his glass in salutation to THE REVIEWER, who follows his GIRLFRIEND across the Route de Carouge. CHARLES DARWIN steps out of the Rue De-Candolle to meet them] CHARLES DARWIN: There is grandeur in this view of life, with its several powers. THE REVIEWER: [Blankly] What's evolution got to do with it?CHARLES DARWIN: Oh, I don't know. Survival of the fittest or something. I mean, it's survived? You can't deny that? And you wouldn't expect it to if it were as crazy as it looks?THE REVIEWER: I suppose not. But---CHARLES DARWIN: Not only that, it's reproduced. Any number of people have copied it.THE GIRLFRIEND: Look, just because---CHARLES DARWIN: [Cutting her off] Well then. I rest my case.THE REVIEWER: [To his GIRLFRIEND] So what is the fascination of the book? What revelation does it promise us? [Enter KRISTEN STEWART, wearing a semi-transparent gown] THE GIRLFRIEND: You can't see as much as you think.THE REVIEWER: The opacity only makes it more interesting. Trust me.KRISTEN STEWART: Art thou real, my ideal? it was called, and after that there was something about twilight, will thou ever? That's so inspiring, isn't it?THE REVIEWER: [who cannot take his eyes off her] May I write a poem to your breasts? [With an insinuating leer] They say I'm good at that.ROBERT PATTINSON: [Shoving in ahead of him] I was first. THE GIRLFRIEND: Well fuck me dead.ROBERT PATTINSON: NecrophiliaI've heard of sillierThe question isWont ya or will ya.[He goes down on one knee]KRISTEN STEWART: I will. Voglio. However you pronounce it.THE REVIEWER: But she'll be hard. Impenetrable. Like marble. Where's the pleasure of the text?ROBERT PATTINSON: It's not hard when you're married. You need to make a commitment.THE REVIEWER: All the same---[THE GIRLFRIEND drags him away towards the Pont du Mont-Blanc. Halfway across, they meet THE PROPHET ELIJAH]ELIJAH: Behold! [They turn, following his outstretched arm, to see the Jet d'eau]THE REVIEWER: A height of one hundred and forty metres. Five hundred litres per second. That's --- ah --- thirty thousand litres a minute. Nearly two million litres an---ELIJAH: Yet the lake is not full.THE GIRLFRIEND: Well of course it fucking isn't. It flows off down the Rhône.ELIJAH: [Disappointedly] Don't pick at the metaphor.[THE GIRLFRIEND is about to say something else but THE REVIEWER, seeing that ELIJAH is about to make a speech, manages to stop her]ELIJAH: Regardez! Protéiforme, constant mais toujours en changement, ange annonciateur, puissance inépuisable. C'est ça, ce livre. Vous comprenez?THE GIRLFRIEND: [Surprised at herself] Yes. [ELIJAH bows, first to her and then to the fountain. For a moment, they all gaze at it in silence]E.L. JAMES: [who has somehow turned up unnoticed] Holy shit! CURTAINYou may also want to read my review of The Bloomsday Book"}, {"userName": "Bram", "userReviewDate": "Jan 20, 2010", "userURL": "http://www.goodreads.com/user/show/1797553-bram", "userReview": "I wanted to start out discussing the baggage that comes with reading this book and the challenge of attempting to reach a verdict on its quality in out-of-5-star form, let alone that of trying to write a coherent response. But unfortunately, I’ve already covered that intro ground with another  review. But where I succeeded in not becoming a slobbering fanboy or prickish contrarian on that occasion, I have here, much to my own surprise, failed. During the early episodes of the book I felt like I was in 3- or 4-star territory. But then came the Shakespearean Scylla and Charybdis sequence and I started getting excited; a few chapters later I read the Cyclops episode, which caused me to become, in my wife’s astute summation, ‘giddy’. I swallowed the rest of this book in a couple of days, foregoing the finishing of The Odyssey itself, which was purportedly my preparation for Joyce’s celebrated novel. My final, overwhelmingly positive response to Ulysses was an unexpected delight after holding the impression that Joyce's works, while enjoyable, might not be for me in the same way as those of some of his contemporaries. I wasn't completely bowled over by A Portrait of the Artist as a Young Man in high school or by Dubliners a few weeks back. I’d even read the first 100 pages of Ulysses back in 2008 before getting sidetracked by War and Peace, the conception of a nearly year-long Russian fever that began to abate about the time I became enamored with this website. But that initial setting down of the book was likely a blessing, as fresh Shakespeare and Homer reads go a long way toward increasing a layered understanding of and gratification from this novel. I think the primary reason that I enjoy plodding Realist epics and plotless Modernist fare is that I find human drama and psychology, realistically portrayed, to be endlessly interesting. There's no topic too boring when laid out truthfully in a prose that elevates the mundane to a realm demanding rapt attention via aesthetic alchemy. To successfully embrace and conquer the ordinary takes a special writer, but I remain easily enthralled when Proust or Woolf wax prolix on table setting rituals or when Tolstoy dallies on a hirsute upper lip. Joyce moves a step further with the whole 'make the quotidian interesting' approach and, for me, it works because it seems—to every part of my mind and experience--true. Bloom and Stephen are real people with thoughts and actions, ranging from the tedious to the generous to the despicable, that are often wincingly human. They’re presented to us in a way that’s wildly imaginative and über-detailed yet considerate of our desire to follow a well-arced human story. And this, Goodreaders, is why I read. It’s often difficult to love a book when the main characters are unlikeable, and I know this is a problem that some have had with Ulysses. Thankfully, I found myself caring more and more for Bloom, in spite of and because of his numerous flaws, as June 16, 1904 wore on. Our hero constantly dwells on his cuckolded state and occasionally even on suicide. It's clear that he's an outsider and has to make an extra effort just to remain at the periphery of his social circle. Something about the way his mind works, how it bounces around curiously from topic to topic without dwelling too much on his misfortunes, is genuinely affecting. There's little woe-is-me with Bloom; he’s just a real-life accepter, trying to get by while nursing modest bourgeois dreams. It’s this upbeat-in-spite-of-everything attitude, tinged with a degree of compassion not found elsewhere in the book, that makes him so endearing. Given that we have access to every bit of his mental processing, the transgressions of his mind (mostly sexual and adulterous in nature) seem minimal and intrinsically human. Some serious critics claim that Joyce needed an editor, but we require all of Bloom's thoughts: the irrelevant, the irreverent, the erroneous, the silly, the serious. And with these thoughts we get excellent treatments of all the themes (and more) for which I come to fiction: death, lust, love, existence, virtue, debauchery, justice, purpose. A day after finishing the book, I’m still struck by Joyce’s ability to render such a rounded character within a generic 24-hour period. By the end of the book we know Bloom intimately, but as with the people we know best in our own lives, there are aspects of him that remain mysterious and conflicted. Bloom’s strong points are often so well-connected to his weak ones that it can be difficult to conclude which is which. For instance, Bloom seems always to think the best of people even after they’ve behaved horribly. Following a man’s drunken and public cries of anti-Semitism, Bloom thinks that he probably meant no harm and was just riled up from the drink; he silently forgives him. But then he considers that he (Bloom) might have gone too far by declaring, in defense, that Christ was a Jew. He’s finally stood up for himself (in one of my favorite passages ever), but he ends up feeling guilty about it, a guilt that betrays a weakness in his character or, from a shifted perspective, a strength gone too far. He also treats Stephen’s ill-considered remarks and behavior charitably, blaming these on the detrimental influence of mean friends. Bloom sees himself as Stephen's personal 'catcher in the rye', and while he’s impotent to prevent the violence visited up young Dedalus late in the story, he does manage to salvage his money and personal effects. He goes beyond this service, however, by paying off Stephen’s brothel debt and even returning his money with interest, becoming his Good Samaritan or, to stick with The Odyssey, his Eumaeus—the loyal swineherd who helps a travel-battered Odysseus upon his long awaited return to Ithaca. Regarding this story’s relationship with The Odyssey, one of the most obvious points of dissonance between the two is with the notion of heroism. In Homer’s epic, we have the quintessential manly-man whose fighting skills and wit are second to none, and who ultimately defeats his enemies via large-scale slaughter. In Ulysses, we have the effeminate, cuckolded social outsider who uses his curious and well-meaning perspective to defeat his enemies with magnanimity. And Joyce doesn’t just invert Homer's idea of a hero, but also Shakespeare's representation of a cuckolded husband. In Shakespeare’s world, the cuckold is someone to be laughed at, the butt of all jokes, and the embarrassment and even the responsibility of the man who couldn't control his wife. Joyce makes cuckolding appear tragic while not overstating its importance, at one point listing dozens of deeds that are worse, including everything from mayhem and contempt of court to criminal assault and manslaughter. The imminent cuckolding pops up in nearly every episode (maybe all of them), hounding and haunting Bloom. There’s no wool over his eyes. He knows and, in a way, allows the act to happen due to his own perceived powerlessness over the situation. In a later episode, I thought that side character Gerty (a stand in for The Odyssey’s Nausicaa) had spied out a sad-looking Stephen Dedalus on the beach, but a few pages later we find out this man with the despondent countenance is actually Bloom. When I realized that Gerty’s pity wasn’t in response to the ennui of an intellectually-tortured dilettante but to a man who was currently experiencing an intimate betrayal, the episode reached a peak of poignancy. And then in true Joycean fashion, he moves right past this moment to one of lust and masturbation, complete with a climax joined by beach fireworks that’s reminiscent of the love scene between Cary Grant and Grace Kelly in Hitchcock’s To Catch a Thief. Where Bloom may get into trouble with readers (and Joyce with censors) is with his lustful, objectifying, and lecherous thoughts. And it’s this frank sexual honesty that’s still surprising and blush-inducing 80 years later. Bloom's specific lustings and yearnings aren’t universal to the male experience, but they are recognizably human in their sui generis imagining. The very specificity of his desire, at times quite blunt and offensive, is certainly what led to the charges of vulgarity and indecency. For it has been common throughout history to treat sexual proclivities not shared by oneself as strange, creepy, and even dangerous. So Bloom is, as he’s referred to in the hallucinatory Circe episode, ‘No Man and Everyman’, at once ordinary and extraordinary. Exhibiting Bloom’s fetishes so completely is what pushes this novel into a realm of reality that was at the time unexplored, and perhaps not yet bested in the fiction that’s followed. Almost as if he sensed that the reader may be building up too much sympathy for Bloom in spite of his occasional creepiness, Joyce decided to bring him down a few notches after his side of the story is finished. We’re reminded that we’ve only been getting half of the picture with his marriage and that two genuine experiences do not always add up to the same interpretation of reality. Once we get to hear Molly’s voice, we find that in certain instances the two of them are simply misinformed about the actions and thoughts of the other. Communication has been damaged, perhaps irreparably. In other cases we get the fullest realization of one of the primary themes in the book: parallax, an astronomic concept that Joyce uses metaphorically throughout the novel. One of the great misfortunes or, depending on the circumstances, boons of humanity is that because we see certain events and ideas from disparate locations with respect to context, intellect, gender, nationality, etc., we perceive these things differently, despite the fact that in reality, outside the world of perception, they are the same. Thus, Bloom and Molly feel that the other is to blame for many of the problems—recognized independently from distinct perspectives—in their marriage. Joyce also employs the concept of parallax stylistically, utilizing different prose formats for each episode and forcing us to confront the ways in which a writer’s stylistic and aesthetic sensibilities influence the way we perceive a narrative and react to it emotionally. So anyway, here we are. Living our lives; reading our books. Experiencing reality through the ineluctable modality of the visible. Does this book have anything to say about the big questions of life and how to derive some meaning from this giant mess? Yes, yes it does. The world of Ulysses revolves around a single Word, a concept that's refracted into many meanings and contexts. Each of the three main characters—Bloom/Odysseus, Stephen/Telemachus, and Molly/Penelope—ultimately recognizes its power, its necessity as the grounding of their lives. But only one of them has the bravery to weather charges of sentimentality and soft-heartedness, to utter the Word in the face of cruel mocking; that's our hero, that ‘conscious reactor against the void incertitude,’ Leopold Bloom. Here on Goodreads I haven’t his courage, and I will name it along with Stephen as ‘the word known to all men.’"}, {"userName": "Franco  Santos", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/29931457-franco-santos", "userReview": "(¡Al fin!). Cuando uno habla de grandes clásicos de la literatura, es ineludible nombrar al Ulises de Joyce. Nadie puede dejar de lado este libro, que se supo situar inmortal en los espacios más venerados y eruditos de la literatura. Ulises es una obra monumental, un tour de force lleno de conocimientos y narraciones desparramadas e intervenidas por la decadencia del lenguaje en todas sus formas, una lenta y convulsa degradación hacia los distintos componentes que nos rodean y el latente caos interno del ser. El Ulises no es solo pura literatura, sino que también es una experiencia única. Y así como nadie puede ignorar la importancia del Ulises en la literatura, nadie puede negar la influencia que este libro tuvo (y tiene) en los escritores constitutivos que la alimentan. Ya decía William Gaddis, quien, con tan solo haber leído el monólogo interior (stream of consciousness) final de Molly Bloom, se refirió a Joyce como una influencia más allá de la práctica, casi metafísica o religiosa, de las letras.El Ulises es único, inigualable, una violenta forma de arte que tiende a tomar al lector por las orejas e incrustrarlo en una historia simple pero plagada de elementos enciclopédicos que hacen de su lectura una muestra expuesta de profunda desesperación. Cada oración del Ulises viene acompañado de una referencia, de algo más. Nada en este libro es lo que se cree y nada de lo que uno pueda leer es superficial. El Ulises es una obra de incalculable valor que mientras se desarrolla se va transformando en un texto que trasciende su forma hacia su expansión ad infinitum, total; una expansión, sin embargo, manchada en parcialidad por la voz popular.No puedo decir que disfruté esta lectura. Yo no tengo drama de leer libros demandantes, pero esto es otro nivel. Siento que el Ulises fue demasiado para mí. Porque hay que aceptarlo, hay que despojarse del traje sucio y arrugado de «me lo sé todo» y rendirse ante el conocimiento de que el Ulises es una bestia. Varias veces en la novela terminé perdido, releyendo una y otra vez pasajes o capítulos enteros buscando algo conocido que me guiñase el ojo o me gritase «Psst, es por acá». A veces lo hallaba, pero la mayoría de las veces no. Joyce no tenía piedad de sus lectores. Esto no fue un camino para nada fácil, y en muchas y deprimentes ocasiones me he encontrado a mí mismo preguntándome si llegaría algún día al final, si sería capaz de alcanzar agónicamente al épico «Sí» de Molly Bloom, o caería muerto antes, quizá en una oración cortada, inacabada, o encima de uno de sus tantos chistes obscenos. (Además, algo que cabe resaltar y lo que probablemente aportó su grano de arena a mi inquina intermitente hacia este libro, es que no pude interesarme por demasiado tiempo ni en los personajes ni en la historia, a excepción de unos pocos episodios). Pero aquí estoy. El libro ya está reposando en mi estantería, con las solapas arqueadas y el filo de sus hojas ligeramente ennegrecido. Esto tiene que significar algo, ¿no? ¿No?"}, {"userName": "Hadrian", "userReviewDate": "Oct 05, 2013", "userURL": "http://www.goodreads.com/user/show/4100763-hadrian", "userReview": "Yes, yes, we've all heard the hype and sniping. Ulysses is one of the greatest books ever written, it is a masturbatory piece of tripe, it is a triumph of modernism and the culmination of Irish literature, it's an unintelligible prank on literature professors, and so on. You can read the other reviews here or volumes of critical analysis elsewhere.So this is the very first time I have read Ulysses to its completion. I tried once as a pockmarked adolescent and quit in the chapter composed almost entirely of sound effects (The Sirens). Two thousand books and years later, I think I understood parts of it. I used very little in the way of previous annotations, with the exception of looking up strange new words on Google and using a map of Dublin. With only a little effort, we can discern such things as a 'plot', 'main character', and 'themes'. Ulysses follows the lives of two men - the morose contemplative Stephen Daedalus, and the kidney-eater Leopold Bloom, and their lives in the city of Dublin on June 16, 1904.The book is infamous for its personal detail and experiments with style, and there are new methods in almost every chapter. Joyce writes sections in the style of a newspaper, in musical motifs, and in Chapter 14, in almost every literary style used in the British Isles since the pre-Roman era.Aside from this technical virtuosity, there are some astounding experiments in human psychology, written in a stream-of-consciousness style, as seen most famously in Daedalus' internal monologue in Chapter 3 and Molly Bloom's titanic rambling sentences in the final chapter. In Chapter 10, 'Wandering Rocks', we see the divergent streams of multiple characters in the city itself, and Joyce skips from person to person, demonstrating their vast differences as part of a broader whole.But aside from these broad literary themes, what is the book about? Well, almost everything that Joyce could fit in there. He talks about food, music, science, theology, history, mythology, contemporary politics. But it is also about human details. It is about sex and masturbation and taking big shits and lots of other filthy things which previously had not been discussed in novels. (Remember the title of Buck Mulligan's play, \"Every Man His Own Wife\".)Aside from such physical concerns, there is a great deal of emotion and melancholy here. Memories of a lost past, and a present in turmoil. Joyce wrote the book in a span of seven years during one of the worst wars in human history, (Trieste-Zürich-Paris 1914-1921), but never saw his beloved Dublin in them. Bloom weeps bitterness over his dead son. Perhaps Joyce wrote part of this book as forlorn praise to a home that he could no longer visit. It is about a place that he loved, and within it he found eternity."}, {"userName": "Alex", "userReviewDate": "May 07, 2013", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "[Molly, whose presence has permeated the book, isn't who Bloom thinks she is either. (hide spoiler)]"}, {"userName": "Jenn(ifer)", "userReviewDate": "Feb 15, 2012", "userURL": "http://www.goodreads.com/user/show/780933-jenn-ifer", "userReview": "Are you ready for it? Are you sure? Okay, well here it is!!http://www.youtube.com/watch?v=AuULcV...I finished Ulysses! It took Sir Edmund Hillary and Tenzing Norgay 7 weeks to climb to the top of Mt. Everest. It took me 5 weeks to conquer Mt. Ulysses. After I finished, I threw the book on the table, ran out the door, down Kelly Drive, through the art museum circle, ran up the stairs, started punching at the air and raised my fists in victory!! And the world reJoyced! Okay, so I didn’t really do that, but I did a little victory dance. It looked like this:http://www.youtube.com/watch?v=s1kVX8...*******To prepare for this journey, I consulted many on-line resources that provided the fundamentals I would need for comprehending this beast of a novel. A friend loaned me his copy of the erudite Heffernan lectures from the “great courses” series. I procured a reading buddy to accompany me on the expedition, acquired a copy of the novel, got lots of rest and had a good, hearty meal, then began my trek.We got off to a quick start. Weather was lovely, supplies plentiful, and the Irishman we brought along for the journey was amusing.Halfway through the expedition, I began to tire. My reading partner could wait for me no longer, so he took off for the summit alone, leaving me with the onus of finding the wherewithal to finish this book on my own. That fucking Irishman started getting on my nerves and my enthusiasm wavered. Yet I continued climbing. At times I thought I was losing my mind. At other times I marveled at how eloquently he spoke about such tasteless things as taking a crap, masturbating in public, having a pissing contest:“The trajectories of their, first sequent, then simultaneous, urinations were dissimilar: Bloom’s longer, less irruent (is that even a word?), in the incomplete form of the bifurcated penultimate alphabetical letter who in his ultimate year at High School (1880) had been capable of attaining the point of greatest altitude against the whole concurrent strength of the institution, 210 scholars: Stephen’s higher, more sibilant, who in the ultimate hours of the previous day had augmented by diuretic consumption an insistent vesical pressure.”Ya don’t say.Somehow I found the resolve to push through all of the nonsense and concentrate on what it is that makes this book a classic: brilliant writing. There is no doubt that James Joyce was a master of his craft. Jimmy, my man. And believe it or not, I’m actually looking forward to reading the rest of his oeuvre (well, minus Finnegan’s Wake. Fuuuuck that). If you’d like to read an actual awesome review of this novel, may I direct you to s.penkevich’s: http://www.goodreads.com/review/show/.... He kicked my ass in reading (and reviewing).Potato."}, {"userName": "Stephen M", "userReviewDate": "Sep 24, 2011", "userURL": "http://www.goodreads.com/user/show/3712181-stephen-m", "userReview": "On Not Reviewing this Book*this review has a lot of swearing in it and for that I apologize. drinking requires apologies*I have about thirty pages, front and back, of notes on this book, I swear. My intentions for the review were epic in proportion: multiple Ian-Graye style headings, a dissertation level of analysis, and a wealth of puns scattered throughout. But of course, books leave their impact in complex and frustrating ways and initially, any semblance of a review was far too intimidating. Then, there arose other reasons—that are personal and embarrassing—as to why I did not even want to look at the damn thing ever again. Certain emotions cling and others fade away and I feel quite fortunate for the ones that have departed and the ones that have yet to leave. I look back on this book with warm nostalgia and a longing for the past.So, perhaps I can write about this book now. Perhaps.On Reviewing this Book: a Personal AnecdoteI read this over the summer of 2012, reading about 100 pages a week. When I fawn over my hardcover copy and admire the eye-patched picture of Joyce, memories spring up, automatically. I reminisce about the swimming pool my friend manages and my free-access to it summer-long. The months of June and July were probably the hottest I’ve ever experienced in Colorado. So in between the days I worked—outside, wedding services, black clothes, 13 hour shifts—I would waste an entire day at the pool, reading Ulysses and jumping into the cool, refreshing water every thirty minutes. This is life, I tell you. Beautiful warmth, great literature, and water slides. But most of all, at the end of each week, I got to meet with the most beautiful girl I’d ever met at a coffee shop and talk about the book. The first day we met to read the book was June 16th, 2012. Every conversation hit the “standing-up and nearly screaming” type of excitement that only I achieve when talking about the things I love the most. Only with literature have I experienced that epiphanic, everything fits together type of religious sensation. Ulysses delivered that in droves. Nearly every page is its own work of art that deserves to be read and cherished. My Joyceful friend knew a staggering amount about the Bible and Greek Myths, so the over-abundance of references that I missed, she would point out and the over-abundance of theories that I spun, worked in tandem with information we gathered. Imagine a 20 year old, slightly pretentious-looking college student, leaping out of his chair, exclaiming his excitement for all the coffee house patrons to hear and imagine the blonde-hair girl opposite, laughing and smiling at the response.Joyce Has So Much Fucking Swagger, Jay-Z Ain’t Got Shit on HimI remember reading a line in Ulysses that proclaims that Ireland doesn’t have its masterpiece yet. . . yet! The book went airborne and crashed against my wall. That pretentious and self-satisfied fuck! I had never been so pissed at an author for intruding on the text. I finally got over myself and continued reading. It took maybe three pages of Siren’s section to realize that yes, Joyce totally earns that intrusion about masterpieces. The writing is so frequently virtuosic and dazzling and well-written that it’s hard to not to think about how much of a genius Joyce was and wonder how the hell he ever got so good at using the english language.He does just about every imaginable thing a person could do to the language while still managing to make you laugh/cry/scream in joy.EmpiricismI had, at the time, what I thought to be some brilliant reading of the whole book and how Joyce incorporates sense experience in his writing to create a continuous stream-of-consciousness that is always correcting itself and rewriting itself, as the act of conscious experience is an act of writing and rewriting narratives to make sense of the outer world, an idea that I copped from Daniel Dennett’s Consciousness Explained who copped it from Derrida or something. There are jaw-dropping scenes that incorporate the characters’ sensual experiences, their thoughts about that experience and the memories that constantly inform their interpretations of those original experiences all in a single moment. The third chapter of the book constitutes what I deem to be (actually my literature teacher deemed it so but I will just use it to sound smart) one of the few true stream-of-conscious-thought pieces of writing. Loves loves to fucking love loveWhat a classic line. And bully for Joyce for pouring such sentimentality into his masterpiece of high-brow literature. Did you know there’s essentially a romance novella written in the middle of this book? I bet you didn’t know that. And goddamn if it isn’t better than any romance novel I’ve read. Joyce probably made a list of things that he wanted to “take care of” as far as writing the book was concerned. And over the seven years (?) it took him to write the book, I’m sure Joyce ticked off several items off the list, and with each, he chuckled to himself and went back to fucking shit up with his typewriter.The Nightmare of HistorySpeaking of classic lines. I thought a lot of about the history being a nightmare. You know, towards the end, Joyce described Bloom and Stephen as somnambulists (sleepwalkers) and my mind exploded—i.e. the whole book was the nightmare the characters were trying to wake up from.Then I thought about how much Joyce references works of other literature (especially Shakespeare, holy shit there’s a lot of shakespeare in this thing). And Stephen struggles to be a writer because he can’t stop thinking about how his work resembles works from the past, from history. And my mind exploded.I think about how history is a nightmare, yet the ending, the beautiful, bittersweet ending, jumps into the past. Joyce embraces the past at the end, but not after making the present moment so beautiful.The Present, The Everyday, The EpiphanyMy modern short story teacher once described narratives with “epiphanic realizations” as Joycean. I think I know why. Since history is what haunts Joyce’s novel, he tries to show the present moment for all the beauty that it is. This is why the book takes place over one day. He is trying to show how much beauty and meaning is packed into the everyday mundane. People drink at pubs, people go to funerals, people flirt with other people. People give birth. Don’t even get me started on the Oxen of the Sun aka “the greatest thing done with the english language, it’s fucking demonstrable, it is”. Okay, here’s the deal. There’s a girl giving birth upstairs, so Joyce decides to give birth to the english language. He writes in Angelo fucking Saxon and then works his way up through all the evolutions of the language until he returns to modern day vernacular. No one had ever even gotten close to doing that kind of ventriloquistic madness and no one ever will. David Mitchell is a pussy.Okay I’m sorry about the D. Mitch comment. That was messed up. I still love him.Anyway, nearly everything in the novel is connected by this idea, that the present moment ought to be celebrated. It gives justification for all the literary tricks within. All the literary tricks are meant to make the mundane, beautiful. Is that Bloom walking into a bar? Or is it a retelling of Odysseus sailing past the sirens, being pulled in by their beautiful song (transposed *(pun fucking intended)* in Joyce’s poetic prose). The entire section is first of all, really beautiful and second of all, filled with music imagery. Then there’s this blind character who keeps “tap tap tapping” around as we, the reader, “tap tap tap” around the prose to get our bearings, trying out sounds in order to orient ourselves in a setting, reinterpreting the sense data to create narrative and Joyce uses the sounds of music to convey this in order to show how a blind person creates a narrative out of life with sound. And now we’ve gone full circle, connecting back to one of my first points. Boom bitch!James Joyce is the Original Based God and Lil ‘b is just his Lowly FollowerSwag Swag Swag Swag Swag Swag Swag Swag Swag Swag Swag Swag Swag Swaghttp://www.youtube.com/watch?v=ukhk_I...Swag Swag Swag Swag Swag Swag Swag Swag Swag Swag Swag Swag Swag SwagPuns out the WaazooI won’t even pretend to make any puns in this review. I would just fail under the punning prowess that is the Joyceman.There’s a part where Bloom orders a sandwich and he thinks about how the ham sandwich ended up on his plate with the ingredients “bred and mustered there”. Obviously to talk about the deplorable state of factory farming. Because, obviously Joyce was a vegetarian and animal-rights activist. Only in my deluded readings of his book probably.A Failed Love PoemThe fair, misses that I met with was named Erin Greenhalgh. I only say this because flip to page 123 and you’ll understand.Erin Green(halgh), gem of the silver sea,so inadequate to depict you as merely pretty—you leave far behind the likes of Remedios the beauty—confounding my inane iambs and cleverly-metered trochee.Trying to capture the experience of your being with me,renders all dewey-eyed ideals into weakening words in atrophy.Such is the attempt to capture every single quiddityof the deft, green beauty in the gem of the sea.Still as I navigate thru currents and against the breezeI succumb to the inevitable tide, ineluctable in its emotional pleas.Waves crashing within, any any sight, they screamin a sense, blinding all thoughts, its power must be.So to pen down these things, only things it relieves,still remains the wonderment inherent in thee.Unable to continue in second-person flattery,I’ll retreat back to third, with what I remember, a story.Once intoned in her words so suffused in poetry,that in the search for meaning, language is a commodity.But I hope this is not any purchase, in dollar or penny,of the uncommodifiable desires of human feelings, plenty.So to the face of a thousand ships, here’re my words, not many:I worry about the eventual demise of our proximity.Winding towards its end, our summer Odyssey,on the cusp of being too trite and not cliché hopefully!Never let it die; our interactions are so lovelyand let’s keep this skiff abreast the waves chatting literature and life over coffee.-SM"}, {"userName": "Orsodimondo", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "TEASES US OUT OF THOUGHT... diceva Keats.Così è con Joyce, ci fa uscire di testa, ci porta al punto in cui l'intelletto non serve. Milo O’Shea/Leopold Bloom e Geoffrey Golden in “Ulysses” di Joseph Strick, 1967, liberamente ispirato al romanzo di Joyce.Sono altri gli organi sollecitati dalla scrittura, altri neuroni: abbandonarsi, non capire, capire a metà, fraintendere, ascoltare il brusio incessante del linguaggio, seguirne le capriole...Il bel bianco e nero del film....Ho ancora il sapore del rognone che sfrigola nel burro sulla padella...And I schschschschschsch. And did you chachachachacha? And why did you?Milo O’Shea/Leopold Bloom."}, {"userName": "Ian \"Marvin\" Graystik", "userReviewDate": "Mar 06, 2011", "userURL": "http://www.goodreads.com/user/show/5022264-ian-marvin-graystik", "userReview": "100 Words in Search of a Precis (For Those of Us Who Prefer the Short Form of Stimulation)“Ulysses” is a snapshot of one day’s life, with us watching from our couch as if we were watching the Simpsons.Its meaning is a creative joint venture between author and reader and, equally likely, other readers. Bloom sees sex as procreation and a continuation of himself, his journey, his culture, his legacy into the future. Ultimately, \"Ulysses\" is Joyce's gift to his wife, Nora, the mother of his son (George), the mother of his daughter (Lucia). “Ulysses” is the container, the receptacle (dare I say it, the Holy Grail?), the womb that holds all of this love, and more.Completed Review: August 25, 2011My Review is here:http://www.goodreads.com/story/show/2...Reading NotesMy Reading Notes are here:http://www.goodreads.com/story/show/2...Original Drunken Book Review: March 6, 2011Warning: Some alcoholic substances were consumed by the author of this review. The rest, though regrettably significant in quantity, were consumed by the keyboard of his thirsty desktop computer, which wishes to state on its own behalf and in its own defence that none of the opinions expressed in this review reflect its opinions or state of mind at the time. Things I'm Prepared to Swear AboutI do solemnly swear that I bought this book today, 6 March, 2011.It only cost $16, which was a bargain.It has a different cover, but that's cool, I hope.It's based on the 1960 translation from the English.It's 933 pages long, but the font size is much bigger than I feared, so I'm OK with that.I think of it as value for money in this era when the counter culture has been superseded by the over-the-counter culture (or should that be the uber-counter culture for us Buffy fans?).Upside Down and InvertedI haven't been able to find any inverted commas in my version.This might mean that this book is all action and no dialogue.Or it might mean that they hadn't invented inverted commas in the days of Ulysses.Either that or they were all uninverted then.The March of a Thousand WikipedesI am thinking of writing all of the headings from the Wikipedia article on Ulysses at the beginning of each chapter (in pencil, in case someone edits them while I'm reading the book), because I'm sure it will aid comprehension.My Mother, a Clear Mind and Anthony BurgessMy mother always said that a clear mind aids comprehension.However, I'm not prepared to stop drinking for as long as it takes me to read the \"Greatest Novel of the Century\" (Anthony Burgess, Observer).I don't know who Anthony Burgess is (I haven't checked his WP article, if he's got one).However, this dude needs to seriously update his opinion.Everybody knows that Ulysses was written last century, der (I've just realised I don't know how to spell \"der\". If only I could txt in my revu, sir).Another Observation by a Different ObserverYou can bet that my review won't just say I'm an Observer.I'm going to proudly proclaim that I am the 12,975th most popular Good Reads reviewer of the first week of March, 2011 (how contemporary can you get)?Should I Really Be Committed?Well, that's my review of the front and back cover and an arbitrarily chosen page in the middle (unfortunately, for a supposedly dirty book, it didn't fall open on any particular page).I suppose I should commit to reading it now.I must admit that, despite the font size, I still find this task daunting.Everybody I know says that reading Ulysses requires a lifetime of commitment.I don't think I'm ready for a lifetime of commitment.I'm a male, for dog's sake.Conspicuous ImpressivismHowever, I do promise to leave it somewhere conspicuous, where impressionable people (the \"impressionista\") can see it and be suitably impressionistic.If they say, \"Shit, have you read Ulysses?\", I'll be honest and say, \"Only enough to write a 600 word review for an online journal of opinion read by 13,000 highly opinionated professional opinionists, der\".I don't know how many words I've actually written. I can't work out how to use Word Count on Good Reads. But who's counting, we're all readers here!A Show of Great PromiseSo what should I promise?I do solemnly and sincerely swear a lot, but not idly, and in order not to be deemed idol, I promise to read one chapter by the end of this financial year.In fact, I'm feeling kinda sporty now.III, II, I, Blast OffHang on, what's this bit at the beginning with the strange page numbering? lxxv, lxxvi? Roman numerals. I'll skip that. There's a reason why Latin is a dead language.If their words are all cactus, why should their numbers count?Show me the greatest novel of the last century and I'll show you a book that's English. Now, \"Stately, plump Buck Mulligan...\"Gees, I'm into it already.Completed Review: August 25, 2011My Review is here:http://www.goodreads.com/story/show/2..."}, {"userName": "Ahmed", "userReviewDate": "May 29, 2015", "userURL": "http://www.goodreads.com/user/show/11260920-ahmed", "userReview": "انا بحب الرواية دي من ساعة ما شوفت صورة لمارلين مونرو وهي بتقرأها , وأنا بحب مارلين بصراحة فحبيت اللي بتقرأه : لكن وأنا بقرأ الرواية دي كان شكلي عامل كدا :ت.إس.إليوت في معرض حديثه عن هذه الرواية بيقول:عن طريق استخدام الأسطورة و استغلال التوازي المستمر بين المعاصرة والقِدَم , يتبع السيد جويس طريقة يجب على الآخرين تقليده فيها ... و هي ببساطة طريقة للتحكم والتنظيم و إضفاء شكل و أهمية على مشهد العبث و الفوضى الطاغي الذي يمثله التاريخ المعاصر لو قُدر لنص أدبي أن يقدس , لكانت عوليس هي الرواية المختارة .طب بالله عليكم , دا يتقال عنها إيه , ولا تتوصف بإيه ؟ دي مش رواية مكتوبة , دا عمل أدبي منحوت , منحوت من صخر صلد , الكاتب مكنش بيكتب مجرد رواية أدبية يُخلد بها إسمه , لأ , دا بيكتب عقاب , عقاب أدبي لكل واحد تسول له نفسه إنه يفتكر فيها العظمة والابداع , ليه كدا يا جيمس ؟ ليه كدا يا حبيبي , دا إحنا غلابة والمصحف , عملنا لك إيه علشان تعمل فينا كدا , وكله بمزاجك , عايز تقرأها إقرأها , مش عايز , لا يكلف الله نفسًا إلا وسعها . الرواية اللي ممكن متفهمش منها حاجة , لكن مجرد ما تنتهي منها هتلاقيها بقت جزء منك (وكنا بنتريق على هاروكي موراكامي إن قططه بتسمع مزيكا , دا إحنا غلابة ) , الرواية المتاهة , اللي لو فلتت منك في جزئية هتظل حبيس صفحاتها وعقلك متعلق بها .بص يابني : في نوع من الأدب , حلو وسهل وظريف , والأديب من دول لا بيتعب دماغه ولا بيتعب دماغك معاه , بيقدمك العمل سهل وبسيط , يعني من الآخر بيقدم لك الأكلة جاهزة وانت تتذوق وتمزز فيها براحتك , الأدب دا حلو , حلو خالص , حلو جدا .وفي بقى نوع تاني من الأدب : هو بيتخطى مفهوم الأدب , بيتخطى كل الحدود وكل المعايير , ليصنع هو حدود ومعايير لا يقترب منها أحد (واللي عايز يجرب يقرب هو بقى ) , يعني الكاتب لا بيجيب لك أكل ولا حتى مكونات , وبيقول لك اشبع أنت يا حلو , نوع الكاتب فيه بيخترع حياة وعالم , عالم يخلقه هو , وينسج تفاصيله و أحداثه وشخصياته , كلها من خياله , كلها من ابتكاره , ابن الظالم اخترع لغة , أول لنقل إنه اخترع استخدام خاص للغة عريقة , بيعلم على الانجليز . النوع التاني قد لا يجد انتشار في زمن معين , ولا يجد اهتمام ولا حتى شعبية , ولكنه يضمن خلود وعظمة لا يقربها أي خلود آخر , عظمة الآلهة الأدبية المقدسة , كآلهة الأولمب العظماء .المهم : نحن أمام عمل وُصف على أنه الأعظم على مر العصور , وحتى هذا الوصف لا يفيه عقه من العظمة والابداع , فهذا عمل لا يشببه أي عمل آخر , ولا يقترب من عظمته أي رواية أخرى , رواية ؟ وهل هي رواية ؟ و أي رواية تلك التي تحتاج إلى كامل خلايا عقلك لكي تندمج معها وتفهمها , لا , أنت تحتاج لكامل عقلك لكي لا تفقده ويتشتت منك , فتشعر بجنون وحيرة لا يضاهيها حيرة , منطقي جدا وأنت بتقرأ الرواية دي إنك فجأة تقفلها وتبدأ من أول وجديد , منطقي إنك تقرأها بصوت عالي , ومنطقي إنك تلاقي نفسك بتضحك بصوت عالي وتعمل حركات غريبة بوشك , رواية غريبة , هتعمل علاقة معها كعلاقة حب بينك وبين فتاة , هتندمج فيها بلا أي مبرر منطقي , وهتلاقي صعوبة وتعقيد مريب لكن مش هتقدر تتركها , هي سحر البيان , وسحر الكلمة وسحر التشكيل , إيه دا , أي روح ملعونة تلبست جويس , وأي واد جن قام بزيارته ليخرج علينا بهذا النص , أي ألعاب لعينة مارسها هذا الكاتب , لكي يتسرب إلى عقولنا بهذا الشكل ويترك علينا هذا السحر .كارل يونغ كان بعت رسالة لجويس بيقول له فيها : (« يوليسيسكَ يا سيّدي قد قدّمتِ العالمَ على أنّه معضلة سيكولوجيّة مُقْلِقة، و التي قد عُنيتُ بها مرارًا بسلطةٍ مفترضة على الأمور النفسية.يوليسيس تثبت أنها مثل ثمرة جوزٍ صلبة بشكل مفرط. كتابك بالإجمال قد وهبني لانهايةً لمشكلة كنتُ قد أطلتُ التفكير فيها طيلة ثلاث سنوات حتى نجحت في أن أضع نفسي في مواجهةٍ معها. لكن، لابد لي أن أخبرك أني أشعر بالإمتنان العميق تجاهك- تماما مثل ما هو تجاه تحفتك العظيمة لأنني تعلمتُ الكثير بسببها. من الممكن أني لستُ متأكدًا لو أني قد إستمتعت بها؛ لأنها قصدتْ أن تكون محطّمةً للأعصاب للغاية، و و للمادة الرمادية(أحد مكونات الجهاز العصبي). و لا أدري أيضًا إذا ما كان سيعجبك ما قد كتبته عن يوليسيس؛ لأنه يساعدُ في أن أخبر العالم كم هو شعور الملل الذي كنتُ أشعر ) ودا يونغ , يبقى إحنا الغلابة يجرى لنا إيه ..الفكرة دائمًا في إبداع الإنسان , وعقله الغريب المعقد , ورحه المقدسة القادرة على إثارة الدهشة دائما ,وحياة الإنسان البالغة البساطة والتعقيد في آن واحد , يوم واحد , يوم واحد هو زمن الرواية دي , الرواية اللي حيرت الملايين وقامت من أجلها الدنيا ولم تقعد من يومها , زمنها يوم واحد , بكل تفاصيله وشخصياته و حكاياته , بكل الفكر المنتشر فيها , بكم المعلومات الرهيبة المذكورة فيها , كل دا في يوم واحد , يوم واحد يا مؤمن , خلانا نعيش أيام من المعاناة في مجرد قراءتها , ما بالك الكاتب ؟لازم تعيش في 16 يونيو دا التفاصيل كلها , لازم عليك تعرف ليوبولد بلوم ومراته واصحابه وافعاله , لازم تتقمص ذكرى اليوم كاملة . الخيال يا خوانا , لازم يكون عدك خيال جامح ليقترب (مجرد اقتراب من خيال الرواية وكاتبها ) تيار الوعي وسنينه السودا , ماله الأدب المبتذل ولا الأدب المريح المفهوم , اللي تقرأ له ولا كأنك قرأت حاجة , لازم نقرأ لحاجة دسمة يعني , لازم تيار الوعي دا , اللي مطلوب منك تركيز 1000% علشان الرواية لا تفلت منك , وتحاول تفهمها , رغم إن الفهم غير مهم في الأساس , لأن الرواية قبل أن تخاطب عقلك , تخاطب روحك و نفسك الدفينة .اللغة : أنا سمعت كثير عن ألاعيب جيمس جويس اللغوية , سمعت عن حس دعابته العالي المذهل , لكن مجرد ما بتواجه نص كدا بتقول إن أكيد في حاجة مش طبيعية , الكاتب أيرلندي يكره الانجليز , فأراد ان يتفوق عليهم , وهل يوجد تفوق أعلى من أن تتفوق على خصمه في ملعبه ؟ ولهذا أبدع جويس في استخدام اللغة الانجليزية ولكن ليس ذلك الاستخدام العادي التقليدي , بل هو استخدام جديد سُجل باسمه هو ولم يوجد بعد من يجيد استخدامه أو حتى تقليده , كم الدراسات اللي اتعملت على الوراية وكم المحاولات لفك طلاسيمها وفي النهاية تبوء كلها بالفشل . كل فصلة وكل حرف وكل سطر وكل جملة , لها أهميتها , ولذلك نجد أن مشاكل الطبعات لا تنتهي .الترجمه : لنا أن نتخيل مترجم مثل د\\ طه محمود طه , يفني من عمره 20 عام بالتمام والكمال لكي يخرج لنا هذا النص بلغتنا العربية , لازم نشكر هذا الرجل من صميم قلبنا , ونشفق عليه لكم المعاناة اللي أكيد واجهها أثناء ترجمته , وهو في الأصل كان يخطط لعمل دراسة عن ألدوس هكسلي ولكنه وقع في سحر جويس وعوليسه ليتفرغ لها , ويقوم بزيارة الأماكن المذكورة في محاولة منه ليتقرب من روحها .الرواية العظيمة بحق , و واحدة من الروايات الفارقة في تاريخ الرواية , فنقول ما قبل عوليس وما بعدها , النص الغريب المعقد الصعب الساحر , النص الذي يسيطر عليك بكل تفاصيله , قد لا تجد فيه متعة ما , ولكنك ستجد فيه روح ادبية قادرة على الخلود ."}, {"userName": "Forrest", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/811928-forrest", "userReview": "What I've discovered about myself from reading Ulysses:1. I am good for only one \"major\" read in a year. I had set out wanting to read this and Proust this year. Alas, I was only able to make it through Ulysses.2. It's okay to have another along to help you out the first time through. In this case, it was Blamire's The New Bloomsday Book. 3. I realize that Joyce was, indeed, a literary genius. I can see why some writers would quit writing after reading Ulysses, as he is a master of the written word. His flitting from voice to voice and style to style without losing the narrative is proof enough. That said, there are moments of tedium, some of them many pages long, that rival and exceed even the great Moby Dick for sheer boredom. When he's on, he's on, when he's off, he's drop-dead boring . . . and no academic pretense that you want to learn something about whaling (which you really don't, let's face it) will save you this time.4. I realize that Joyce plays domestic angst in an excruciatingly understated way. He creates excellent tension by what he does not say, as much as by what he does say.5. The funeral/underworld scene is an astounding piece of work. I felt sadness, pity, annoyance, and laughed aloud, all at once. Such a mixing bowl of emotions in that section. My innards are all tumbled around after that, like I don't know which way is, emotionally speaking, up.6. Anyone who coins the acronym \"K.M.R.I.A\" deserves a statue. Or did he coin the term? Either way, he inspired The Pogues to use it in a song, which deserves a statue in its own way.7. Jest on. Know thyself. may be all you need to know about Joyce and the notion of fiction as autobiography.8. I love the \"sirens\" section, with its sing-song rich voice, which feels like it was written in the shadow of Finnegan's Wake. It's one of my favorite places to be a brain.9. I need to read all of Finnegan's Wake.10. \"-Tis a custom more honored in the breach than in the observance.\" may be the most clever pun I've ever heard. Ever.11. I love the sections where Joyce is seemingly channeling Lovecraft, then Dunsany, then Wavy Gravy.12. The sentence: \"The heaventree of stars hung with humid nightblue fruit.\" may be one of my favorite sentences of all time.13. Good golly, Miss Molly!14. I am lost and found somewhere betwixt Dedalus and Bloom, yet unbounded by one, the other, or both, inside their circle, outside their confines, them, yet me. Joyce's words, Dedalus' and Bloom's actions, my brain, my past, my hopes, my frustrations, my feelings.15. Yes. Yes."}], "description": "The revised edition follows the complete and unabridged text of ULYSSES as corrected and reset in 1961. Like the first American edition of 1934, it also contains the original foreword by the author and the historic court ruling by Judge John M. Woolsey to remove the federal ban on ULYSSES. It also contains page references to the 1934 edition, which are indicated in the margins.", "title": "Ulysses", "url": "http://www.goodreads.com/book/show/12804.Ulysses", "average": 3.74, "cover": "https://images.gr-assets.com/books/1327202666l/12804.jpg", "reviews": 5475, "authors": [{"url": "https://www.goodreads.com/author/show/5144.James_Joyce", "name": "James Joyce"}], "type": ["Classics", "Fiction", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/12804.Ulysses", "http://www.goodreads.com/book/show/338798.Ulysses", "http://www.goodreads.com/book/show/30233656-ulises", "http://www.goodreads.com/book/show/10545.Ulysses", "http://www.goodreads.com/book/show/763241.Ulysses", "http://www.goodreads.com/book/show/1178525.Ulysses", "http://www.goodreads.com/book/show/6503519-ulysses", "http://www.goodreads.com/book/show/12803.Ulysses", "http://www.goodreads.com/book/show/3263632-ulysses", "http://www.goodreads.com/book/show/23303441-ulysses", "http://www.goodreads.com/book/show/14624024-ulysses", "http://www.goodreads.com/book/show/331597.Ulysses", "http://www.goodreads.com/book/show/395290.Ulises", "http://www.goodreads.com/book/show/8455363-ulisse", "http://www.goodreads.com/book/show/7588.A_Portrait_of_the_Artist_as_a_Young_Man", "http://www.goodreads.com/book/show/11012.Dubliners", "http://www.goodreads.com/book/show/23289.The_Dead", "http://www.goodreads.com/book/show/11013.Finnegans_Wake", "http://www.goodreads.com/book/show/23296.A_Portrait_of_the_Artist_as_a_Young_Man_Dubliners"]}