{"ratings": 19129, "userreviews": [{"userName": "Ben", "userReviewDate": "Jan 10, 2009", "userURL": "http://www.goodreads.com/user/show/551473-ben", "userReview": "Purchase a large bottle of tequila and start walking from Ernest Hemingway's house to Vladimir Nabokov's house. As you're walking, take a drink for the sake of squandered love. Then take one for isolation. Take one drink for war, and two for peace. Take one for world-weariness. Take one for betrayal. Take a big one for fear. Take a bigger one for the allure of death. Take one for a chasm opened between lovers. Take one for connections that span oceans, continents. Take one for filthy, homeless dogs. And take one long drink, just for the sake of it.If you do this right, you will end up passed out in a ditch somewhere between Hemingway and Nabokov, and you will have a fair idea of what 'Under the Volcano' is like."}, {"userName": "Glenn Russell", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/23385697-glenn-russell", "userReview": "“Far above him a few white clouds were racing windily after a pale gibbous moon. Drink all morning, they said to him, drink all day. This is life!”― Malcolm Lowry, Under the VolcanoDon't be fooled by the usual blurb on this novel telling you the story is about a British consul and his wife, his half-brother and his childhood friend. They are but bit players. This is a novel where the main character is liquor and how liquor turns human blood and the nerves of the human nervous system into trillions of tiny colorful skulls, each skull with a mouthful of shinning white teeth chewing up the host human and, in turn, his relations with everything and everybody. Most appropriately, Malcolm Lowry set his novel in Mexico during the Day of the Dead.“In the bathroom the Consul became aware he still had with him half a glass of slightly flat beer; his hand was fairly steady, but numbed holding the glass, he drank cautiously, carefully postponing the problem soon to be raised by its emptiness.” The Consul (there is a tincture of humor in the narrator continually referring to him by his official title) is an alcoholic, thus, his one central problem is the inevitable empty glass - all those legions of tiny colorful skulls need alcohol to maintain their bright red, blue, green, yellow, black, orange, white colors so they can keep their sharp teeth chomping.The Consul speaks, “I am too sober. I have lost my familiars, my guardian angels. I am straightening out,” he added, sitting down again opposite the strychnine bottle with his glass. “In a sense what happened was a sign of my fidelity, my loyalty; any other man would have spent this last year in a very different manner. At least I have no disease,” he cried in his heart, the cry seeming to end on a somewhat doubtful note, however. “And perhaps it’s fortunate I’ve had some whiskey since alcohol is an aphrodisiac too. One must never forget either that alcohol is a food.” Famous last words for an alcoholic: “It’s fortunate I’ve had some whiskey” - not only fortunate, but completely necessary, thus, my observation, the real main character in this Malcolm Lowry novel is liquor. All of the alcoholics I’ve had the misfortune to come into contact with (nobody in my immediate family, thank goodness) have likewise surrendered their blood, vital organs and nervous system to those chomping skulls. Every day is the Day of the Dead around the globe for millions of alcoholics drinking under their personal volcano.A reader of Lowry’s novel will find enough references, both direct and indirect, to Dante, Faust and Lost Eden as well as Christ, Don Quixote and Oedipus, but, from my reading, all of these allusions and suggestions, signs and symbols, codes and enigmas, are filtered through the alembic of Consul Geoffrey Firmin’s liquor glass, bestowing a particular flair to the well-worn citation “through a glass darkly,” words depicting our less than omniscient manner of seeing and understanding.To conclude on an up note, one of my favorite scenes is when Geoffrey, his former wife Yvonne and his half-brother Hugh attend a bullfight. Hugh jumps in the arena. We read: “It was Hugh. Leaving his coat behind he had jumped from the scaffolding into the arena and was now running in the direction of the bull from which, perhaps in jest, or because they mistook him for the scheduled rider, the ropes were being whipped as by magic, Yvonne stood up: the Consul came to his feet beside her.“Good Christ, the bloody fool!”The second bull, no indifferent as might have been supposed to the removal of the ropes, and perplexed by the confused uproar that greeted his rider’s arrival, had clambered up bellowing; Hugh was astride him and already cake-walking crazily in the middle of the ring.“God damn the stupid ass!” the Consul said.A nearly 400-page novel and, for me, that was the up note, since, when it comes to alcoholics and alcoholism, there is really very little of what could be considered ‘up’; quite to the contrary, it is either down or very far down or all the way down."}, {"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "Έτρεξα μόνη μου,βγήκα δεύτερη. Αδηφάγος λαβύρινθος αλκοολικών παραισθήσεων και συμβολισμών. Πέρασα άσχημα βράδια με αυτό το βιβλίο. Με κούρασε πολύ. Με έφθειρε εγκεφαλικά. Με τύλιξε μια ψυχρή,αργή μάζα εσωτερικών συγκρούσεων και παραίτησης χωρίς καμία εννοιολογική διαδοχή πέρα απο μια μεθυσμένη και χορταστική αποτυχία στη ζωή και το θάνατο του πρωταγωνιστή. Το πάλεψα σκληρά να βρω το αριστούργημα που προβάλεται,μα βρήκα μια τρομακτική μονομανία απίστευτα περίπλοκη και παραληρηματική και μια ολοκληρωτική απαξίωση ασφυκτική και βαριά,σαν την κληρονομιά μιας καταραμένης ανθρωπότητας. Όλο το βιβλίο είναι βασισμένο στην μετουσίωση της ύπαρξης ενός τραγικού,εθισμένου,ευαίσθητου,πληγωμένου και πολυσχιδούς άνδρα. Ο Πρόξενος Τζόφρεϊ Φέρμιν. Ο αιώνια μεθυσμένος ονειροπόλος. Ο πολίτης της γης των συμβολισμών. Ο πρωταγωνιστής μιας αρχαία τραγωδίας επιφορτισμένος με σεξουαλικά κατάλοιπα, τύψεις και απέραντη θλίψη. Δεν προσπαθεί να γιατρέψει τις πληγές του, παλεύει να τις ματώσει ακόμη πιο πολύ και είναι αυτό ακριβώς που μεταφέρει στον αναγνώστη, η απόγνωση και η παρακμή μιας ολόκληρης ζωής που περιγράφονται και μάχονται για κατανόηση μέσα στην πλοκή του βιβλίου λαμβάνοντας ως χρονική κάλυψη το τελευταίο εικοσιτετράωρο της ζωής του. Επομένως,κάθε δευτερόλεπτο της αποφράδας μέρας και της αφήγησης παράλληλα παίρνει βασανιστικά εφιαλτικές διαστάσεις. Πρέπει μέσα σε μια μέρα,συγκεκριμένα τη μέρα των νεκρών,να συμπεριληφθούν στην ιστορία και τη συνείδηση μας όλες οι προϋπάρχουσες καταστάσεις, τα γεγονότα, η σκιαγράφηση των άλλων ηρώων, ο εσωτερικός κόσμος τους, οι πολιτικές και κοινωνικές εξελίξεις,εξομοιώσεις πράξεων,ο έρωτας, ο θάνατος, η προδοσία, η ήττα, η τρέλα της εξάρτησης απο το αλκοόλ και λοιπές ψυχοφθόρες ουσίες και παρουσίες.Επιπροσθέτως, το ντελίριο της μετουσίωσης του Φέρμιν ξεπερνά τον εαυτό του και αργά αργά καθώς εμβαθύνει καταστρέφεται και μας παρασύρει σε μια βάρβαρη και θλιβερή ασάφεια. Δεν κατάφερα να βρω εννοιολογικό συνειρμό,δεν προσέγγισα καμία κοινωνιολογική θέση,δεν εμβάθυνα σε κανένα καθήκον σκέψης. Όλα πολύ έντονα, κάποια τελείως περιττά,τα γεγονότα με προσπέρασαν αφήνοντας με σε μια κατάσταση φόβου, ελλιπής κατανόησης και καχυποψίας. Κρίση εξιδανικεύσεων. Απέτυχα παταγωδώς να συλλάβω την ενόρμηση του Λόουρυ σαν μια εκπρόσωπο, εξουσιοδοτημένη με ένα κάποιο μήνυμα απο έναν αποστολέα για έναν αποδέκτη. Κόλαση κάτω απο το ηφαίστειο χωρίς αρχή - μέση - τέλος. Ατελείωτο βασανιστήριο. Δύσκολη γραφή, πυκνή,μακροσκελής πέραν του δέοντος και λεπτομερειακά μπερδεμένη. Ένας εθισμένος αφηγητής, κρυμμένος κάπου στο Μεξικό κάτω απο ένα ηφαίστειο. Απωθεί τη ζωή και τους λόγους για να ζήσει. Απορρυθμίζεται (βιο)λογικά,διαταράσσεται ο ήδη πληγωμένος ψυχισμός του και θέτεται εκτός λειτουργίας μαζί (ίσως) με τον αναγνώστη. Όλα τα υπόλοιπα λάβα, μάζα, έρεβος. Λυπήθηκα ειλικρινά γι’αυτή την άποψη που εκφράζω καθώς και τη χαμηλή βαθμολογία επειδή οι διθυραμβικές κριτικές με κάνουν να την εκλαμβάνω ως προσωπική ανεπάρκεια και αποτυχία. Παρόλα ταύτα θεωρώ πως δικαιολογώ απολύτως τη δυσαρέσκεια μου και ρίχνω περισσότερο βάρος στη δική μου (ίσως) κούραση ή στην έλλειψη σωστού συγχρονισμού με ένα ομολογουμένως κλασικό έργο.  Στις προτάσεις για δεύτερη, τρίτη ή και τέταρτη προσπάθεια ανάγνωσης για την καλύτερη εμπέδωση νοήματος, θα απαντήσω: Ευχαρίστως ναι, αλλά όχι....Καλή ανάγνωση - καλύτερη μάλλον-Πολλούς ασπασμούς!"}, {"userName": "Ted", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/7213075-ted", "userReview": "[I swear I haven’t done this, but if you Google something like “greatest novels of the twentieth century\", and then examine lists which might come up, I’ll bet you a drink (what else) that Under the Volcano is on most of them. (hide spoiler)]"}, {"userName": "Lyn", "userReviewDate": "Jul 18, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "A true literary masterpiece. This is minimalistic in scope but brilliantly complex and multi-layered in detail. The exceptional prose is interspersed with flashes of stream of consciousness and eclectic, almost poetic imagery. The multiple references to Conrad were interesting, almost the flip side of Heart of Darkness as Lowry describes the inevitable collapse of a man and in metaphor, civilization."}, {"userName": "Agnieszka", "userReviewDate": "Oct 29, 2009", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "Labyrinth of streets, wild, lush tropical vegetation impudently encroaching everywhere, seizing the garden and the residence of Consul; volcanoes majestically tower over the city hiding every moment in the clouds, humidity and heat suffocating everything around. Atmosphere of unspecified horror lurking in the alleys, misery hanging in the air like a premonition of impending storm. Mexico, fiesta Day of the Death, 1938. And though we know the time and place of action, in dialogues and flashbacks with Consul, Hugh and Yvonne, we wander around the world, traversing countries and cultures, their history, myths and poetry.The city spread out at the foot of two volcanoes, streets and buildings remembering better times, not only the Consul's but much earlier, the Spanish' explorers. The city with ruins of Maximilian’s Palace, where yet still seem to wander the ghosts of his ill-fated love for Carlotta. Narrow and winding streets that Consul, stupefied in scorching heat, like in somnambulistic transe, alternately drunk, sober and hung-over, traverses from cantina to cantina, chased by demons and hallucinations.The narration is jerky and chaotic, full of complaints, remorse, memories, monologues. Words are flowing and flowing ... One can read  Under the Volcano  as a record of extreme alcoholism, self-destruction, as a human one way journey. As a record of a one day, the last one in fact from Consul Geoffrey Firmin’s life, the day in which Consul reached the end of the line, marked gradual plunge into darkness, alcohol, exploration of ... absolute ?But it is also a story of love Consul and Yvonne, their separation and her return on fiesta day. Her desperate attempt to save Consul from himself and stick that what is irrevocably broken. How one can help other man, contrary to him ? Is it really possible such a thing, to save anyone ? But one can look at the novel as an allegory of the fall. Of a man, but also the world and civilization. Not only by invoking the ruins of Maximilian's Palace and statues of ancient conquistadors on the squares of the city or devastated garden, like a parody of paradise from which lovers were exiled. But also by reference to the time of action. November 1938, there is not much time left when world will plunge into madness of war. Images that Lowry creates are painfully suggestive so that in the end we seem to lose orientation, we wonder if it is still Mexico whether delirium, is it heat or maybe hangover."}, {"userName": "Tara", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/70459127-tara", "userReview": "[his inability to push through any longer, to continue that exhausting, never-ending war (ever upward!) we must wage just to be able to stand still (hide spoiler)]"}, {"userName": "Chris", "userReviewDate": "Jun 28, 2007", "userURL": "http://www.goodreads.com/user/show/158615-chris", "userReview": "This seemed so promising (self-destruction! love triangles! Mexico!), but after about 150 pages I couldn't hack it. Certainly the most committed stream-of-consciousness study of alcoholism I've ever failed at reading, but in the end I just decided to not become an alcoholic and stopped reading."}, {"userName": "Nick Craske", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/5484622-nick-craske", "userReview": "Under The Volcano. I thought The Tunnel was the most exquisitely drawn book title. But no. Under The Volcano. A fiercely poetic title. Terse in form and rich in mythic imagery.Under: Beneath and covered by. Below the surface of. At a point or position lower or further down than. In the position or state of bearing, supporting, sustaining, enduring, etc….This is an incredible book. I'm experiencing an incredible run of great reads and discovering writers who I want to read more of but Malcom Lowry's book stands out as the most memorable - its imagery and symbolism are imprinted in my mind.It made an impression early on. As the first chapter draws to a close; as the initial strokes of scene setting are made, with our drunken protagonist Geoffrey Firmin, staggering through the Mexican streets, past colourful characters, all preparing for the Day of The Dead ceremonies, the closing passage descends down into a insular character observation, beautifully poetic in its foreshadowing:\n…set the writhing mass in an ashtray, where beautifully conforming it folded upon itself, a burning castle, collapsed, subsided to a ticking hive through which sparks like tiny red worms crawled and flew, while above a few grey wisps of ashes floated in the thin smoke, a dead husk now, faintly crepitant…Suddenly from outside, a bell spoke out, then ceased abruptly...Over the town, in the dark tempestuous night, backwards revolved the luminous wheel\nLowry embeds motifs and symbolism throughout the fine prose incorporating, philosophy, religious symbolism, literary references; tragedy and mysticsm to dramatic effect. The book's title is an example of the fine use of metaphor. I have recently read William H. Gass's essay collection Life Sentences and the chapter on metaphor certainly primed me for this novel. Feels the perfect novel to have read in succession, in fact.And there were moments I felt I was reading a Gass novel. Personally I see many similarities in tone between Under The Volcano and Gass's debut novel, Omensetter's Luck. There's a feverish zeal in the layering of emotion and psychological drama as our protagonist journeys through the story's increasing intensity, which erupts in the epic closing scene.I'm under it's intoxicating wiles."}, {"userName": "Aubrey", "userReviewDate": "Jan 23, 2013", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "Lowry could not perform the vital surgery of separating himself from his characters. He suspected at times that he was not a writer so much as being written, and with panic he realized that self-identity was as elusive as ever.-Conrad Knickerbocker\nYou could state this novel was amazing. You could name it false. You could call this novel a giant of Modernism. You could pass it off as the rambling obscurities of a overeducated white guy with too much money in pocket and too lengthy a time on his hands, enough of each to not only allow for lazy alcoholism but to also think it worthy of a book. You could wonder at the explications of historical context or frown at it for being too 'political', depending on whether your methodologies for coping with reality lie in grasping explication or willful ignorance.I thought to compose an ode to this thin-skinned and oh so brave piece of work, one that considered 'vital' the need to cloak oneself in shrouds of objective cleverness writing from the scheme of rote, but recognized the conventions as being too limited. Poetry it is, in the attention it pays to rhythm of word and the homage it pays to the feeling provoking it, all those words circling and circling and never quite circumventing the fundamental issue of conveying the state of a human being in full with mere paper and pen. But an ode? That implies form, and function, and the worst sort of dignified pride, all prettied up above and so horridly stunted down below. So I am sticking with prose, where there is at least more room to breath and stretch and thrust into realms not yet choked with nitpicking banalities.If history draws a line in the sand and says to you, congratulations, you won, is it better to take your winnings and hightail it back to the stolid world of living a normal life, or fumble one's way across the line in a horrifically misguided effort to help? Neither direction will guarantee a sustained sense of worthwhile living without sustained effort, and the shame of that effort is often enough to kill. Lucky for you, there are ways to run, and keep on running, deep into the fuming dark of drink after drink which renders mind and reality palatable to each other, so long as you keep on coming back.Some bring back some packets of papers from these trials. Some luck out through sheer sense of language and liking for certain literature and pass through the fires of public perception with a penchant for labeling things as 'trivial'. Lowry was right in feeling his will to write translated into being written, and yet he went on taking risks to the contrary of the sensibilities of his fellows. Today, he is beloved of the certain echelons of readers and poses a difficult challenge to those not yet in the 'know', or on the contrary is passed off as the pretentious tragicomedy of an unlikeable man with no real reason to be moping around besides his pandering at an 'existential crisis'.\nMeantime do you see me as still working on the book, still trying to answer such questions as: Is there any ultimate reality, external, conscious and ever-present etc. etc. that can be realised by any such means that may be acceptable to all creeds and religions and suitable to all climes and countries? Or do you find me between Mercy and Understanding, between Chesed and Binah (but still at Chesed)—my equilibrium, and equilibrium is all, precarious—balancing, teetering over the awful unbridgeable void...Though it is perhaps a good idea under the circumstances to pretend at least to be proceeding with one's great work on \"Secret Knowledge,\" then one can always say when it never comes out that the title explains this deficiency.\nThere's something bloodcurdling about the inexorable crimes of history and the question posed in every era of how one is to 'do one's part'. For what constitutes a 'crime', and what is a suitable 'part', and just how long is one supposed to wait around for a situation to arise where it is not only 'right' to act, but 'proper' in motivation and 'vital' in context and anything but 'trivial'?Lowry wrote what he knew in order to bring his self to a final resolution. Somehow, it was decided that his results were worthy of surviving in the hallowed halls of literature, for all his half-handed attempts to decry atrocities and feckless graspings at a life worth being sober for. Someone, somewhere, decided that for whatever reason, this work for all its ivory tower references and obtuse characterizations was important to merit a place in the future.Pity the poor fool with time enough to think on the scope of humanity, and cannot bear the weight without the solace of addiction or the finality of death. They wander outside the range of 'conventional' society, and we can only acknowledge their presence and hope that that they will return. And if they bring something back that we recognize as part and parcel of our own nobly fallible states of life, ensuring a record of that forlorn mess of feeling that so many unknowingly struggle in with every bit of mindless work and drink and frivolity, all the better. For one is always alone in composing a how-to guide for their lot in life, and while criticism is useful, condemnation wallows in a pit of aborted failings. You'll do yourself no favors in claiming to be better than it all, no matter how loud and long you scoff and bleat."}, {"userName": "Paul", "userReviewDate": "Feb 24, 2014", "userURL": "http://www.goodreads.com/user/show/4643325-paul", "userReview": "This is an influential book; Bolano opens The Savage Detectives with an epigraph from it. Under the Volcano isn’t just a book about a drunk and a record of his drunken ramblings. Our protagonist, the British Consul, Geoffrey Firmin is not a classic hero in the Hemingway mould; craggy and square-jawed. Nor is he drowning his sorrows. His primary relationship is not with Yvonne, his estranged wife, but with alcohol.There are oceans of allusions and references here; the book is packed with them. The Faust myth was there in abundance with references to Goethe and Marlowe. The fall from grace myth also takes us to Paradise Lost. Dante’s Inferno is the backdrop to some of the more hellish descriptions. However the allusions that interest me relate to John Bunyan, I was brought up with Bunyan; “Grace Abounding to the Chief of Sinners” has an epigraph and it has been pointed out that Under the Volcano is a sort of Pilgrims Progress in reverse; although there is a redemptive theme. There are equivalent companions related to those who journeyed with Pilgrim at various points. That’s a line I would like to consider if I re-read; particularly the feeling of being enmeshed/tangled.The numbers are also important; the novel takes place on the Day of the Dead one year apart; there are 12 chapters; signifying 12 hours and 12 months. Books have been written about all this and many academic essays produced.It seemed to me that disintegration was one of the underlying themes; the world is beginning to disintegrate. It is 1938 and the world is almost at war. The alcoholic disintegration is also well written; Lowry had some experience of this! Alcoholics who drink long enough and hard enough develop a type of dementia (known as Korsakoff’s syndrome) and some of Firmin’s experiences feel a little like this and his conversation reminds me a little of people I meet with this condition (in structure rather than content). There are also contradictions here; redemption and loss, ascent and descent, identity and annihilation; I could go on. The atmosphere and heat you can cut and it exudes noir film of the 30s and 40s. If I live long enough to read this again I think I will read it with Bunyan to pick up more of the crossovers."}, {"userName": "Fabian", "userReviewDate": "Jul 10, 2012", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "A good word to describe 1947’s Under the Volcano by Malcolm Lowry is languid. This is authentic rambling & genuinely one continuous drivel. All of it: sound and fury signifying… nothing. It’s a true pity that the book is so inaccessible, unreadable; it invites for some spontaneous skimming to occur, something a book must never inspire in its reader. The setting is magnificent, but certainly not unalike Henry Miller with his snooze-inducing masterpiece impostor “Tropic of Cancer,” the uglification of Mexico is as abhorrent & ridiculous as the descriptions of rancid Paris in “Tropic.” There is not one single sentence clever enough, beautiful enough, even at all special or pretending to be special. Lowry decides to produce one of the only books that I can think of that is totally devoid at least ONE special, one poetic sentence. It's that horrible!“The eternal sorrow that never sleeps of great Mexico…”: this certainly is a promise left unfulfilled. We get nasty descriptions which repeat endlessly, all in a headache-inducing loop, just as the brain of a drunkard reels about. Aimlessness--murkiness, being inside the mind of a drunk without being drunk ourselves is a total bust. This is that overly-typical story of the crazy gringo (well, a displaced British Consul, actually) getting “tight” on a Mexican holiday, the unintentionally un-symbolic Day of the Dead, boozing on mescal and myriad other liquors which appear before him like mirages in the wild. Why are stories with roaring drunks in ‘em so critically lauded? I REALLY don’t get it…! Unlike Hunter S. Thompson’s “The Rum Diary,” or any of the innumerable American plays (by Arthur Miller, by Eugene O’Neill, by Edward Albee… you know exactly the tragic type) this one makes it hellish for the reader himself (poor poor guy) to really delve into the novel; into the awful sways and malicious deviations from a proper plot and proper character portrayals. It’s insipid, it‘s a novel which transpires one fateful day but feels like one l-o-n-g, sad weekend; actually, like an entire week of swimming in alcohol like a booze hound. Although considered one of the bonafide towering achievements of the 20th century, it is indeed novels like this one which make one glad that that century is long gone."}, {"userName": "Michael", "userReviewDate": "Aug 14, 2014", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "I can see why many people love this book as a masterpiece. Now several weeks since I completed it, I still experience some potent emotional resonance over its hollow dance of life and its frustrating ambiguities on the locus of evil and purpose. I still expect to look up from the plane of my existence and see the twin volcanoes of its Oaxaca setting, glorious one moment, lonely or threatening the next. That is a good sign that the book has gotten under my skin and shaken me up. But my personal rating notches down over the denseness of the prose and how it sang for me with such few notes in plot and characters. Luckily, the narrative periodically rendered flights of perception and imagination which lifted me out of the story and gave me the glide to reach the known end of the day. The book jacket blurb lays out the overall trajectory:It is the Day of Death in Mexico and, stranded in the colorful fiesta gaiety, Geoffrey Firmin—ex-consul, ex-husband, an alcoholic and a ruined man—lives out the last day of his life. Drowning himself in mescal while his former wife and half-brother look on, powerless to help him, the consul has become an enduringly tragic hero and his story—an overwhelming image of one man’s agonized journey towards Calvary—the prophetic book for a whole generation.The setting is the high plains of Cuernevaca in the fateful year of 1939. Save for the beginning piece where the French movie producer Laurelle introduces the three main characters, we spend almost all of our time with Firmin. Yvonne has recently returned to him after about a year’s absence and a divorce, wondering why she left him and wishing to begin anew. His younger brother Hugh has also arrived for a visit, full of idealism over taking a stand against Fascism in the Spanish Civil War and not yet disillusioned by communism. Over the day, they drink, attend a sort of rodeo, dine, drink, visit a church, take a walk up the mountain, drink some more. Not much happens, but everything that does is portentous. For example, they witness a dying peasant by the roadside who has been severely beaten, possible by the police. Every discussion in the present gathers a net of meanings from their past, from history, from literature. Through the lens of Firmin’s infirm mind, there are so many nuts of meaning to be dug from the shells. I can see already by tossing out the term “hollow dance”, I am already subconsciously infected with Lowry’s ways (over the head with literary reference or under the radar with metaphor). Firmin’s life seems hollow because his former role as British consul posted to a small city seems pointless. And he professes love for Yvonne, but why can’t he commit to a future with her? Yvonne, whom we are told is a former Hollywood movie actress, is hollow because she is a cipher, essentially unknown to the reader. Hugh, the aspiring writer and reporter, has more depth through revelations of his backstory. He comes off as a fool pretending to be a Conrad or Byron, but he is admirable to me because he still believes he can change the world.Why Firmin is really in Mexico is not clear. His friends wonder if he is running away from some naval disaster in World War 1 in which German officer prisoners were executed under his command. The Fascist-leaning police seem to think he is a spy. Of all the ambiguities in the book left to the reader to resolve is why Firmin drinks and why he can’t stop drinking and just live in the world and love Yvonne. We experience again and again such entertaining vitality in Firmin’s imagination when he drinks. He can see through the veil of the present to the sweep of history back to the time of Mexico’s conquering by the conquistadors, skip beyond the beauties of nature before him to the spinning of galaxies, and in to dark truths of the lonely soul, and splash back to the divine comedy of the human circus before him. The careening is so entertaining over cocktails, so incisively funny, so scary with its truths and judgments, it always seems to call for another drink. Yet, this form of living is incompatible with the biggest message sown in the text: \"No se puede vivir sin amar” (“You can’t live without loving”). At a church with Yvonne, he tries to pray:\"Please let me make her happy, deliver me from this dreadful tyranny of self. I have sunk low. Let me sink lower still, that I may know the truth. Teach me to love again, to love life.\" That wouldn't do either... \"Where is love? Let me truly suffer. Give me back my purity, the knowledge of the Mysteries, that I have betrayed and lost. -- Let me be truly lonely, that I may honestly pray. Let us be happy again somewhere, if it's only together, if it's only out of this terrible world. Destroy the world!\" he cried in his heart.”If you are intrigued enough at this point to consider reading this, I really must share some more samples of wonderful prose that reveals the state of Firmin’s (and Lowry’s) vision:Nothing in the world was more terrible than an empty bottle! Unless it was an empty glass.“But my lord, Yvonne, surely you know by this time I can’t get drunk however much I drink.”Far above him a few white clouds were racing windily after a pale gibbous moon. Drink all morning, they said to him, drink all day. This is life!But who could agree with someone who was so certain you were going to be sober the day after tomorrow?How alike are the groans of love, to those of the dying.What is man but a little soul holding up a corpse?And this is how I sometimes think of myself, as a great explorer who has discovered some extraordinary land from which he can never return to give his knowledge to the world: but the name of this land is hell.I leave you with one particular rant around a question that goes to the moral heart of human choice and civilization, prompted by a pondering if they couldn’t have done more for the dying peasant in the road: ‘Why should we have done anything to save his life? Hadn’t he a right to die, if he wanted to? … Why should anybody interfere with anybody? Why should anybody have interfered with the Tlaxcalans, for example, who were perfectly happy by their one stricken in years trees, among the web-footed fowl in the first lagoon—‘Like these wars. For it seems to me that almost everywhere in the world these days there has long since ceased to be anything fundamental to man at issue at all…Ah, you people with ideas!…’‘Can't you see there's a determinism about the fate of nations? They all seem to get what they deserve in the long run. … What in God’s name has all the heroic resistance put up by poor little defenceless peoples all rendered defenceless in the first place for some well-calculated and criminal reason … to do with the survival of the human spirit? Nothing whatsoever. Less than nothing. Countries, civilizations, empires, great hordes perish for no reason at all, and their soul and meaning with them that one old man perhaps you never heard of, and who never heard of them, sitting boiling in Timbuktu, proving the existence of the mathematical correlative of ignoratio elenchi with obsolete instruments, may survive.’…’I should like to know what the bloody hell it is you imagine you’re talking!’‘Why can’t people mind their own damned business!’We root for Firmin to surmount the dark truths he sees as the flame he burns with is so bright."}, {"userName": "Jessaka", "userReviewDate": "May 02, 2015", "userURL": "http://www.goodreads.com/user/show/4659464-jessaka", "userReview": "Este libro era muy dificil. I heard about this book when my friend Julie and I were in Oaxaca, Mexico back in the mid-80s. We had met a young man named Michael while there, and he showed us around Oaxaca and even took us to meet a Zapotec family in nearby Lacalulu. It was All Soul's Day, and the women in the family were making tamales. Julie and I tried to stir the dough that was in a large caldron. She made it once around, and I could hardly move the spoon though the thick tamale dough. The women laughed and must have thought that American women were very weak. Maybe we all are.After the tamales were cooked we began eating them. Delicioso. Michael had told us earlier that it was very insulting to refuse food or drink from an Indian family. I don't know how many tamales I had before it dawned on me that if I ate real slow I would be saved from eating another one. It worked. Next, we were outside on a patio and were being served mescal. I don't drink, and I can't handle alcohol because it all gives me a headache immediately or just makes me sick when drinking it. I drank my first one, yuck. The next one I poured into a flower pot, and the flower wilted and died right in front of me. I was offered another, and so I had to say, \"No es bueno para mi.\" It worked. Their feelings were not hurt. Then we drove to another town to its cemetery and sat on the cement border of a grave while eating more tamales. The cemetery was filled with families, food, and lit candles. A priest was walking around taking up money from the families and offering prayers. And that was my introduction to All Soul's Day. How much I wished that we had come to Oaxaca earlier during Dias de los Muertos, a similar holiday, but then I would have missed meeting this family and sharing All Soul's Day with them.Michael also told us about the movie, \"Under the Volcano,\" saying that it was filmed in Mexico, it was also a book, and the author used to live in Oaxaca. The movie took place during Dias de los Muertos. What a lovely holiday, I thought. And after telling us about the bar that Lowry frequented, we had to find it and take a photo. No, we did not go inside, and being that it was during the day when we were in this run down section of town, we were safe.When we returned to the U.S, I saw the movie and loved it. \"Such a depressing movie,\" a friend said. \"No,\" I replied, \"It was marvelous, the scenery was wonderful, and the story was captivating.\" I don't know what I really said outside of not thinking that it was depressing, but I like what I said just now.Anyway, the book was about the last twelve hours in the life of the Consul, a man who was an alcoholic. Albert Finney played him in the movie, and Jacqueline Bisset played his estranged wife. Finney, by the way, was nominated as best actor for his part in the film. As for Basset, I loved her clothes. I own the movie and have probably watched it four times. I tried to read the book back in 1985, but the large vocabulary that Lowry used made it too difficult to read. I tried to read it again a couple of years ago, and even with the dictionary, some of the sentences didn't make sense. I put it down again. I swore this time I would read it even if I didn't understand it. After all, I almost know the story by heart. What I learned recently is that it is part auto-biographical. Malcolm Lowry was that alcoholic, and his real wife,Yvonne, was the woman in the book. Then I learned that Lowry was kicked out of Mexico, and I am very curious as to why. I started to read his wife's autobiography, but when she said that he was abusive, I didn't care to have the book spoil the story. It was obvious anyway, but I hate reading about dysfunctional families.As I said, it was the Day of the Dead in Mexico, the Consul spends those next 12 hours of his life looking for one more drink. His estranged wife has come back to him, after being away for a year, and hopes to make the marriage work. His half-brother has also returned, and it is obvious that he had once had an affair with Yvonne, but in spite of this, they all spend the last 12 hours of the Consul's life together. First, Lowry is looking for alcohol in his garden. Then the book becomes obscure for a while. It finally picks up a long thread of coherency when they ALL take a bus ride. During this ride, the bus driver stops when they all see man lying down on the side of the road. Next, the passengers are getting off the bus in order to view the dying or dead man, I can't figure out which, but this part of the book is important to the remainder of the story. Then they go to a bull throwing, and finally, after leaving the bull throwing, the Consul disappears. His wife and half brother end up going from bar to bar looking for him, and then the story ends in tragedy.This book vacillated between being extremely boring due to his stream of consciousness ramblings and his alcoholic hallucinations, to being beautifully written but extremely depressing. I imagine that Lowry wrote best when he was lamenting over this ex-wife. What a tortured man. As a result, I hated picking this book up every day. I asked myself, \"Why is it is classic, a masterpiece?\" \"Why are their so many five star reviews? Tal vez, los que le dio cinco estrellas eran intelectuales, y yo no soy uno de ellos. Además, yo no entiendo algunas de sus palabras en Inglés y Español, y yo no quiero aprender.John Huston directed the film, and I feel that it was he who created the masterpiece, not Lowry. John Huston did something marvelous: He took out the boring parts of the book and left the exciting moments. And being filmed in Mexico, well, me gusta Mexico y deseo vivir alli, pero no como en este pelicula. Here are what I think are some of Lowry's deep, moving words:In a letter to Yvonne that was never mailed I offer three paragraphs:\"I like to take my sorrow into the shadow of old monasteries, my guilt into cloisters and under tapestries, and into the misericordes of unimaginable cantinas.\"\"I know a good deal about physical suffering. But this is worst of all, to feel your soul dying. I wonder if it is because tonight my soul has really died that I feel at the moment something like peace.\"\"If I am to survive I need your help. Otherwise, sooner or later, I shall fall. Ah, if only you had given me something in memory to hate you for so finally no kind thought of you would ever touch me in this terrible place where I am. \"And then a few that I had missed but found online: “How, unless you drink as I do, could you hope to understand the beauty of an old Indian woman playing dominoes with a chicken?”“Adiós,\" she added in Spanish, \"I have no house only a shadow. But whenever you are in need of a shadow, my shadow is yours.\"\"Nothing is altered and in spite of God's mercy I am still alone. Though my suffering seems senseless I am still in agony. There is no explanation of my life.\""}, {"userName": "Szplug", "userReviewDate": "Nov 21, 2009", "userURL": "http://www.goodreads.com/user/show/1843184-szplug", "userReview": "Everything that takes place in Under the Volcano exists beneath the rarefied gaze of Popocatepetl, the towering volcano that dominates the south-central Mexican plateau. It is fitting that Lowry chose to make the volcano the omnipresent entity in his watercolor novel, since alcoholism, slumbering through filmy days and slurred nights, can erupt at any time into a furious outpouring of violent emotions, freed from the ruined tatters that constitute the remains of self-control. Such molten rivers are capable of burning to cinders those trying to penetrate the drunken mesh and reach the sober person trapped underneath; of seizing control of the alcoholic's mind and letting loose all of the primal demons bent on destruction and irrationality that gestate in the fires of the soul's own hell.British consul Geoffrey Firmin is on the verge of this very eruption - exiled to the lush no-where of Mexico, spending his days drinking wherever he finds himself, amongst Mexican amigos who hopelessly try to steer him towards a drier future, and longing for the return of his ex-wife, Yvonne; a reunion he both desires and dreads, as he knows all too well the true destruction that will ensue from such a piebald fantasy. Enter Yvonne and, somewhat earlier, Firmin's half-brother Hugh, each having come to reclaim him and both of whom carry their own limiting secrets: Yvonne, that of an affair with Hugh; the sibling, the affair and a deep shame at having let down his side by failing to achieve socialist heroism in the Spanish Civil War. All the ex-pats laden with guilt, then, Geoffrey's worst of all because, deep down, where the truth resides unshriven by the bottle's temporary falsehoods, he wants to probe the bottom of the abyss; he desires to remain unredeemed, to damn himself and wound those who love him as penance for making him let them down. Thus, when Yvonne presents Geoffrey with a cherished fantasy about leaving Mexico for Canada and creating a new life in the outlier forests of Vancouver, the consul accepts with alacrity, and does his best to remain dry for long enough to set up a glimmer of hope in his former spouse and current brother. Alas, delirium tremens is a very real and horrible master, a sender of nightmares and chimeras, a sere spirit that dries out the tongue and the soul. A nip here, a tuck there, and soon Geoffrey - as all knew inevitably would happen - absconds with hope and dreams in an effort to soar wildly and deliriously happily amidst the winds of irresponsible abandon.Firmin is, more or less, the self-based portrait of the inveterate drinker author, and his character is painted in unflattering pastels and given an impressive varnish of truth. He garners little pity, but that isn't what Lowry wants. He is simply telling the tale of another lost soul in the twentieth century, lost and damaged and careless of damaging others. It is all done with superb writing, vivid portraits of a fantastic, earthy and magic-imbued Mexico, always under the brooding stare of the conical peak. A hallucinatory and, at times, exhilarating book, though ultimately hopeless, and worthy of the high praise it has received."}, {"userName": "Mala", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/5960716-mala", "userReview": "A hell of a book, i.e., if you can take the hell!In his seminal essay, 'A Temple of Texts: Fifty Literary Pillars', William Gass has this to say:\"Under the Volcano should have been an entry among this fifty. Imagine it as the roof. It took me three starts to get into it; my resistance to it is now inexplicable, though I suspect I knew what I was in for. I have never read a book more personally harrowing. It is also a rare thing in modern literature: a real tragedy, with a no-account protagonist to boot. The Consul is one of the most completely realized characters in all of fiction.\"Vollmann has read it thrice – need I write more?Edit: Apparently, a few more lines are needed:\"When to the sessions of sweet silent thoughtI summon up remembrance of things past, I sigh the lack of many a thing I sought, And with old woes new wail my dear time's waste:Then can I drown an eye, unus'd to flow, For precious friends hid in death's dateless night,And weep afresh love's long since cancell'd woe, And moan the expense of many a vanish'd sight: Then can I grieve at grievances foregone, And heavily from woe to woe tell o'er The sad account of fore-bemoaned moan, Which I new pay as if not paid before. But if the while I think on thee, dear friend,All losses are restor'd and sorrows end.\" –William Shakespeare, Sonnet 30.The Mexican Day of the Dead is the perfect setting for this elegiac tale - both a remembrance and a dirge to one of the most poignant characters in modernist fiction– the Consul, Geoffrey Firmin.The ending fills you with an unmistakable sadness and that is 'cause despite all evidence to the contrary, you were hoping for a miracle - that the tale of the Consul and Yvonne would somehow find a completion.Like Laruelle, we are left wondering, in the aftermath of the tragedy, of what went wrong & why it went wrong.There are no easy answers of course - by the time,  Under the Volcano opens, the Consul is already like a runaway train heading for a spectacular crash.* * *I've discussed this book here, in this group read:http://www.goodreads.com/topic/group_..."}, {"userName": "Pantelis", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/59132978-pantelis", "userReview": "The novel that accommodates the two absolute opposites: No se puede vivir sin amar, Hell is my natural habitat..."}, {"userName": "Liam Howley", "userReviewDate": "Mar 07, 2014", "userURL": "http://www.goodreads.com/user/show/20612160-liam-howley", "userReview": "[It is the relationship of Yvonne, with not only the Consul, but Hugh, that offers a sense of perspective, for having seen the world through Hugh's eyes, (his desires, his sorrows, his discontent), it suddenly seems possible that Hugh and the Consul are different aspects of the very same man. In fact, there are four main characters in the book, and it is possible to interpret all four as differing aspects of the one character. This is confirmed in the introductory letter, but also by any biographical reading of Malcolm Lowry's life. (hide spoiler)]"}, {"userName": "Oziel Bispo", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/56294126-oziel-bispo", "userReview": "Gente, acabei a leitura desta obra agora pouco. Nunca pensei que fosse me deparar com uma leitura tão difícil é desgastante. Este livro não é para leitores lights . É uma leitura que exige muita atenção e apego.Basicamente conta a história de Um cônsul Inglês que vive no México que se afunda no vício da bebida e é visitado por sua ex esposa que tenta salva-lo desse caminho sem volta.O livro todo é envolto no misticismo dessa cidade Mexicana com todas as suas tradições e festas sob o olhar atento de dois vulcões um ativo e outro já morto.Um livro trabalhoso de se ler ,mas recompensador...."}, {"userName": "Evan", "userReviewDate": "Jun 30, 2008", "userURL": "http://www.goodreads.com/user/show/1248986-evan", "userReview": "Ah, Malcolm Lowry, you were a batshit crazy drunken nut of a novelist at the right time to be so: the mid-20th century -- a time of Jackson Pollock and atonal music and cut-up literary narrative and horrible black box skyscrapers; a time of an artistic aesthetic that, thank God, is dead -- and your obsessively overdescriptive novel in which even the non-drunk characters spout non-sequiturs showed your critically fashionable Joycean penchant for the stream of conscious and ample obscurantist references that send English majors into raptures that are usually followed by unfortunate attempts at symbolic analysis that make even less sense than the novel they are analyzing. This is not at all to say that Under the Volcano doesn't make sense; it actually does, very much. I found the stream of consciousness, the time shifting, the changing centers of interest, the flashbacks, the internal character monologues and the like all very easy to follow, even if I wasn't always sure what the hell they were entirely talking about. I'm not entirely convinced that Lowry did either. I was mostly very convinced that, for most of the way, I didn't much care.Under the Volcano had its first iteration as a short story, which might be informative to read in light of the absurdly fulsome, interminable descriptions of flora and fauna that Lowry has added to pad it out to novel length. Sometimes the descriptions served a symbolic purpose -- as in the glowering, menacing, foreshadowing presence of the volcanoes dominating the setting -- but just as often I simply found them to be examples of Lowry showing off his descriptive chops to no good purpose other than to do just that. He played chicken with this reader's patience, and this reader conceded to him and skimmed through a whole lot of flora and fauna. On one end of the spectrum we have Hemingway, who described places a bit too sparely for my taste, and at the other end we have Lowry, who has writerly OCD in telling us so much about the setting that I never could grasp or visualize it. After contending with this for a number of pages I finally decided once and for all what the town and the surrounding environs looked like and settled for that in my mind and ignored the rest of Lowry's embellishments. Somewhere between Hemingway and Lowry there is a happy medium.In Lowry's lush vegetal Mexican hell symbolic portents of tragedy are dolloped out to give the English majors plenty to write about as horses get loose, charging and frightening the innocent and disappearing into the night, dead dogs ooze life, scorpions sting themselves to death, lazy bulls drunk with happiness like Ferdinand are wrangled, made confused and goaded into rebelliousness and complacency, and a caged eagle is set free as an ineffectual gesture by the powerless Yvonne, the clingy enabling romantic interest of the alcoholic protagonist, Geoffrey Firmin. The symbolism all refers back to him and his self-fulfilling prophecy of personal doom.The partisans of this book are probably right in calling it one of the great achievements of literature. I can't deny Lowry's herculean patience as a craftsman, his mastery of description, and his artistic integrity in creating a unique novel that is unlike any other. Despite the grotesqueries and disturbing contradictions he reveals about the human condition and Mexico, his story is also imbued with compassion and wonder.But, whatever the reason, and notwithstanding the tour de force that it may be, I found less to engage my heart in Under the Volcano than I have in other novels about western expatriates in Third World lands written by the likes of Paul Bowles and Graham Greene. I couldn't muster much sympathy for Geoffrey Firmin, the naval war hero/criminal turned diplomat, demoted over time from high to low posts in the British diplomatic corps because of his drinking, or for his hapless girlfriend, Yvonne, or for his globe-trotting leftist twit brother, Hugh. There are many flashbacks in this work that help us (to some degree) understand the characters, but the flashbacks I really wanted, to help me figure out why Yvonne and Geoffrey are so hung up on each other (in which the nature of the couple's past relationship might be clarified and fleshed out) are virtually absent.Having lived with an alcoholic for too long, I no longer have much patience for them or for people who tolerate their lies and manipulations and self-destructive arrogance. In romanticizing Firman to some degree (understandable, Lowry himself being an alcoholic), particularly in the finale where he is seen as abandoned (rather than, say, as being someone who abandoned everyone else), Lowry tries to turn Firmin into an tragic hero of a sort, and I'm just not buying it.I was remarking to a good friend this evening about how, as I grow older I find myself caring less about philosophy or agonizing over insoluble existentialist problems that nobody will ever be able to answer or solve anyway, but which always seem to fascinate the young (as they did me when I was discovering these weighty concepts). I think this change of priorities comes with the realization of having fewer years left, fewer years in which one will have a functional dick, for instance. Which all leads me to the following passage from Under the Volcano, which, for me, sums up my own criticism of the book, or, more precisely, why I find it more fun to live than to overthink enigmas or to read books that I do not love:\"But where does it all get you in the end?\" The Consul sipped his strychnine that had yet to prove its adequacy as a chaser to the Burke's Irish (now perhaps in the garage at the Bella Vista). \"The knowledge, I mean. One of the first penances I ever imposed on myself was to learn the philosophical section of War and Peace by heart. That was of course before I could dodge about in the rigging of the Cabbala like a St. Jago's monkey. But then the other day I realized that the only thing I remembered about the whole book was that Napoleon's leg twitched—\" -----(kr@Ky 2008, slightly revised in 2016)"}, {"userName": "Kimley", "userReviewDate": "Nov 06, 2007", "userURL": "http://www.goodreads.com/user/show/368148-kimley", "userReview": "It's been a while since I found myself so completely frustrated by a book's ability to be simultaneously truly amazing and annoyingly awful. There were so many things about this book that I really loved. And one thing that especially ruined the entire experience for me and that is Lowry's writing style. In the dictionary next to the phrase \"purple prose\" is a giant photo of Lowry, grinning sheepishly, fully aware of his penchant for ornate verbiage. About half way through I took a glance at the \"About the Author\" section in the back and found his self-composed epitaph:Malcom LowryLate of the BoweryHis prose was floweryAnd often gloweryHe lived, nightly, and drank, daily,And died playing the ukulele.Now, actually, I rather enjoyed the above and give him credit for a bit of self-awareness but that didn't stop me from constantly screaming \"Bloody hell, Malcolm, just spit it out. What the fuck are you trying to say already????\" Aaaaagh. And the frustration sank in.Frustration particularly because this is a beautiful character study. Taking the story of a drunk and not committing egregious sins of the stereotypical drunken tale is not an easy task and Lowry really gives us a character with some serious meat to him. And not just the main character but the secondary characters are worthy of intense consideration as well. The fetid overgrown jungle-like Mexican locale mixed with these interesting characters sound like they would make a fantastic cocktail. Damn him for using the blender and frothing the whole thing up too much!I keep finding myself wanting to call Lowry the anti-Hemmingway. Both writers deal with acutely damaged men living in the extraordinarily tumultuous first half of the 20th century, macho men with substance abuse problems who don't know the first thing about women. Hemmingway, for me, never seems to explore his characters beyond the surface and I get instantly bored and roll my eyes. But I've always admired his spare, elegant writing style. And, well, Lowry has great characters - if you can only find them buried underneath all those freakin' words.Lowry does do some interesting things where he gets you to really experience the drunken stupor of the main character. Suddenly you find yourself completely lost in the narrative, you go back a bit and realize that you've just gone through the main character's blackout. This was disturbing on one level but kind of fascinating that Lowry could achieve such a visceral reaction so I can't decide whether I hated that or loved it. Much of the narrative is a drunken stream-of-consciousness and it makes you feel tipsy reading it. It's uncomfortable but kind of impressive at the same time. But then again, I've been told I'm a cheap date so it doesn't take much to get me drunk..."}, {"userName": "Janet", "userReviewDate": "Mar 04, 2009", "userURL": "http://www.goodreads.com/user/show/1421407-janet", "userReview": "The magnificent novel was the product of ten years of work by Lowry. It takes place on a single day, the Day of the Dead 1938, on the eve of war, in Cuernavaca, Mexico--in the shadow of the volcanoes Popocatepetl and Ixtaccihuatl--where the British Consul is drinking himself to death. His beloved wife has divorced him, but now returns to see if anything can be salvaged of their relationship, which is the hope of the book, and part of its tragedy.Lowry's own alcoholism was prodigious, but his novelistic talent was even moreso, and over the period of the ten years he wrote and rewrote Under the Volcano--submitting it for publication every few years, only to have it widely rejected, taking it back, working further--resulted in one of the masterpieces of the twentieth century. I think of it as spiral novel. It collects motifs, hundreds of memorable images--a bit of a movie poster for Los Manos de Orlac,, a barranca (ravine) which appears suddenly and dangerously as the consul staggers around the town, pariah dogs, the \"spider\" (spy) which the police suspect he might be--which gain power as they come around again, and more meaning adheres to them. They whirl around, circling inward, tighter and tighter, as you move from the beginning of the novel--or the outside of the storm, inwards towards its heart--and then the explosion. For instance, early on he introduces the motif 'Oaxaca.' Something about Oaxaca, very casual. Then thirty pages later, he says, 'Oaxaca meant divorce.' After that, every time Oaxaca comes up, there's more and more meaning attached to it, the motif grows and becomes more complex and interlocks with other aspects of the book. The only line I ever stole in a book was one of Lowry's--who was a magpie himself, so I don't feel bad... a description of the Farolito, a ruinous foul mescal bar that only opens at four in the morning. To the Consul, it was \"the paradise of his despair.\" What a phrase! There is a test that's designed to prove whether the responder is a human or a robot--the Turing test, it's called. To my mind, that line alone could prove one human--what robot could understand the glory of self-destructiveness in a line like that? In fact, the whole book is a Turing test, and is one of my favorite novels of all time."}, {"userName": "Abailart", "userReviewDate": "Nov 13, 2008", "userURL": "http://www.goodreads.com/user/show/863801-abailart", "userReview": "Under the VolcanoI read the Picador Classics edition (1967) with an introduction by Stephen Spender. Unusually, I read the introduction first, then again after reading the novel, which I read in three sittings. I like Spender, and relate to his reading of the book.\tDespite its dual reputations of being difficult and about alcoholism, it is neither. As for difficulty, it’s true that understanding Spanish would be helpful, but the saturated extratextual references to mythology, mysticism, history and so on can be taken as fragments of a disintegrating mind in a disintegrating world: the central theme is of stability versus instability, fragments against ruins, and from this erupts the permanent psychological divisions between desire’s positivity and its demonic twin of destruction. The characters are all one character, the places all one place, the times all one time, though an impossible time – that of a moment that is an ideal locus without nostalgia for past or future. \tAlcohol is central of course because the character of the novel is alcoholic, and best read, therefore by an alcoholic – which is most people, for Firmin and his alternatives are merely further advanced into descent and ascent than most which makes his expression approach the ideal moment. The refusal to accept love is not a failure but an affirmation for love is part of the dreadful entanglement of contingent dual actions of affirmation and immediate denial, and it is this tangle (the novel is thick with imagery of entanglement) which is transcended by final descent into the (literal) abyss. Obviously for it could be no other, a novel of immense contradictions, impossible antipathies, and the realisation of being as antithetical to identity.\tIt is easy to read when one accepts its imagistic concentration. Films, stills, photographs, paintings, advertisements, thicken every paragraph to a flicker that has the paradoxical potential to, like a hollywood movie, enspectre a counterpart to diegesis – a clean, pure, fluid, immensely joyful….. illusion. \tIt’s a wonderful, exquisitely awful and painful novel of redemption."}, {"userName": "Ian \"Marvin\" Graystik", "userReviewDate": "Feb 24, 2011", "userURL": "http://www.goodreads.com/user/show/5022264-ian-marvin-graystik", "userReview": "Place HolderI read this in about 1974.It is one of my favourite books ever, though I haven't read it again, yet.I remember its crystalline clear prose, even though it describes the life of an alcoholic.Perhaps, he just drank to achieve clarity.My Alcoholic TheoryLowry is probably evidence against my theory that alcohol kills the unhealthy brain cells first, therefore it purifies your brain.If this was ever true of Lowry, I think the alcohol didn't stop at purity, it started on all the other cells and turned them into a puree.Still (interesting choice of word for a review of a book about alcoholism), this book seems to have been completed while most things were in working order."}, {"userName": "Josh", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/6041973-josh", "userReview": "I appreciate all the 5 star reviews for this book, but why did I give it 3 stars instead? Each character had their downfalls. Each had dreams shattered by one circumstance or another, hence this book read like one I would enjoy to the fullest, yet I can honestly say I only enjoyed parts. The internal monologue of Firmin (the Consul) alongside his hallucinations and voices in his head were not for me. I read slowly to interpret and soak it in, yet it didn't stick as much as I would expect. I appreciate and enjoyed the language at times, while at others I felt like it was a long-verse poem full of convoluted nonsense (which can be interpreted as 'the point of the book'). I mostly enjoyed reading about the imagery of Popocatépetl and Iztaccíhuatl and of the letters that were written between the Consul and Yvonne. The imagery portrayed in context of the two volcanoes was amazing and the letters supplied the raw emotion that I tend to look for in a novel.Symbolism and metaphor a-plenty, it is a book that rewards many readers, but not this one. As said previously, it is appreciated, but I can't give 5 stars to a mostly lauded book if it doesn't connect with me."}, {"userName": "Jonfaith", "userReviewDate": "Apr 08, 2013", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "Towards the nightmarish conclusion of Under the Volcano, Yvonne recognizes that the drinks \"lay like swine on her soul.\" That poetic glimpse into Bacchic darkness is a glimpse of the novel's mastery, It is impossible to distinguish it only as a novel about alcoholism, or, even, a return to the primoridal Eden besieged by History's jackboots. Under the Volcano is so much more than that. Each of the principal characters exposes their soul, yet motivations remain dim, much like the fetid cantinas and the dubious mescal.The novel's poetry is electrically animated and emerges from the pages like Promethean firestorms. Pedestrian brains will find themselves winded and unnerved by the pyrotechnics. I know I was. Consider me grateful for such."}, {"userName": "Adam", "userReviewDate": "Nov 15, 2007", "userURL": "http://www.goodreads.com/user/show/214053-adam", "userReview": "Malcolm Lowry’s Under the Volcano is a mad prophet’s dream of rising dangers, a masterpiece of symbolism (the animal imagery, Dia de los Muertos, the Volcanoes), a great intertwining of voices (radio, letters, movie posters, remembrances), an encapsulation of the era’s political thought and literature, a surreal, hypnotic journey into the night, and a breathtakingly beautiful book; a sad, half-demented augury. The last 50 or so pages are especially worth it. One the most chilling last lines I have ever read. I can see echoes of this work in that of Stone, Pynchon, and Fuentes. Great, great novel."}, {"userName": "Lorna", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/6700518-lorna", "userReview": "Under the Volcano by Malcom Lowry is a riveting literary masterpiece transpiring over a period of twenty-four hours in Quauhnahuac, Mexico beneath the volcanoes, on the Day of the Dead and on the eve of the war in 1938. Geoffrey Firmin, former British consul in the throes of alcoholism, is visited by Yvonne, his estranged wife, who has come back to Mexico in hopes of salvaging their marriage, as well as by his half-brother Hugh and a childhood friend, Jacques. \"Before him the volcanoes, precipitous, seemed to have drawn nearer. They towered up over the jungle, into the lowering sky--massive interests moving up in the background.\"\"The cemetery was swarming with people visible only as their candle flames. But suddenly it was as if the heliograph of lightning were stammering messages across the wild landscape; and they made out, frozen, the minute black and white figures themselves. And now, as they listened for the thunder, they heard them: soft cries and lamentations, wind-borne, wandering down to them. The mourners were chanting over the graves of their loved ones, playing guitars softly or praying. A sound like windbells, a ghostly tintinnabulation, reached their ears. A titanic roar of thunder overwhelmed it, rolling down the valleys. The avalanche had started. Yet it had not overwhelmed the candle flames. There they still gleamed, undaunted, a few moving now in procession. Some of the mourners were riling off down the hillside.\"Malcom Lowry was a British novelist and poet. It is reported that he worked on Under the Volcano for ten years with much of the material based on his own experiences in Mexico. The book was published in 1947 with Lowry's subsequent death in 1957 attributed to asphyxiation after a night of heavy drinking."}, {"userName": "David Lentz", "userReviewDate": "Jun 11, 2011", "userURL": "http://www.goodreads.com/user/show/3604115-david-lentz", "userReview": "Lowry's narrative technique is bold: here we have the tale of one half of the last day in the life of a man who is drunk. He is a British Consul living in Mexico beneath a volcano. The narrative captures the vision of the drunk experiencing his life, which has become a Kubla Kahn. This can't be easy to render: yet Lowry ambitiously does so in a true 20th century masterpiece. The protagonist literally stumbles through his incoherent existence like Leopold Bloom in the red light district of Dublin in James Joyce's Ulysses. Great literature has been built upon the construction of envisioning life through the eyes of a disoriented person for a brief period of time. Love is hopelessly beyond his practical competence to fulfill. \"While you're enjoying all this, do you realise the extraordinary allowances being made for you by the world, which has to cope with you?\" M. Laurelle asks him. The Consul chalks it up to his battle against death or his \"battle for the survival of the human consciousness.\" He views himself as a \"little soul holding up a corpse.\" The Consul tries to make some sense of his life beneath the volcano and its storm clouds amid a fiesta and a grotesque theft by a pelado of bus fare from a dying man. Amid frequent flashbacks, there are many moments in the vast self-imposed delusion of the Consul: \"In spite of God's mercy I am still alone. Though my suffering seems senseless I am still in agony. There is no explanation of my life.\" The story is tragic: the writing is utterly exquisite. If you love great writing simply for the sake of the writing itself and are prepared to journey into the interior of a lost soul, you'll be rewarded for your persistence. We do live under the volcano, after all, which could erupt at any time and sweep us away in the course of its flow. Ah, we are free to make sense of life, despite our bewilderment, as we will. Therein, lies our best hope and redemption. I strongly encourage you to read this great novel: it's truly memorable in the genius of its craft."}, {"userName": "Jeff Jackson", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/811567-jeff-jackson", "userReview": "Confession: It took me three tries to get past the first chapter or so. You almost have to take it on the faith that things will become clearer and more compelling -- they will! -- and that the initial chapter is there for a good reason -- it is! -- though that will only become evident as you finish the novel. So don't be deterred by the initial steep path, the views from this Volcano are almost unmatched in 20th Century fiction. It'll reward your patience and careful reading several times over. Plus it has maybe the best last line in all literature."}], "description": "An alternate cover for this ASIN can be found here.Geoffrey Firmin, a former British consul, has come to Quauhnahuac, Mexico. Here the consul's debilitating malaise is drinking, and activity that has overshadowed his life. Under the Volcano is set during the most fateful day of the consul's life--the Day of the Dead, 1938. His wife, Yvonne, arrives in Quauhnahuac to rescue him and their failing marriage, inspired by a vision of life together away from Mexico and the circumstances that have driven their relationship to the brink of collapse. Yvonne's mission is to save the consul is further complicated by the presence of Hugh, the consul's half-brother, and Jacques, a childhood friend. The events of this one day unfold against a backdrop unforgettable for its evocation of a Mexico at once magical and diabolical.Under the Volcano remains one of the most powerful and lyrical statements on the human condition and one man's constant struggle against the elemental forces that threaten to destroy him.", "title": "Under the Volcano", "url": "http://www.goodreads.com/book/show/18912153-under-the-volcano", "average": 3.8, "cover": "https://images.gr-assets.com/books/1409143426l/18912153.jpg", "reviews": 1114, "authors": [{"url": "https://www.goodreads.com/author/show/17439.Malcolm_Lowry", "name": "Malcolm Lowry"}], "type": ["Fiction", "Classics", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/18912153-under-the-volcano", "http://www.goodreads.com/book/show/31072.Under_the_Volcano", "http://www.goodreads.com/book/show/12982111", "http://www.goodreads.com/book/show/18481710-under-the-volcano", "http://www.goodreads.com/book/show/22054160-under-the-volcano", "http://www.goodreads.com/book/show/126576.Under_the_Volcano", "http://www.goodreads.com/book/show/821426.Under_the_Volcano", "http://www.goodreads.com/book/show/2407343.Under_the_Volcano", "http://www.goodreads.com/book/show/126573.Under_the_Volcano", "http://www.goodreads.com/book/show/978613.Under_The_Volcano", "http://www.goodreads.com/book/show/920269.Under_the_Volcano", "http://www.goodreads.com/book/show/1013226.Under_the_Volcano", "http://www.goodreads.com/book/show/1179955.Lunar_Caustic", "http://www.goodreads.com/book/show/241398.Ultramarine", "http://www.goodreads.com/book/show/2033013.Dark_As_The_Grave_Wherein_My_Friend_Is_Laid", "http://www.goodreads.com/book/show/1136482.Hear_Us_O_Lord_from_Heaven_Thy_Dwelling_Place", "http://www.goodreads.com/book/show/1179956.October_Ferry_To_Gabriola"]}