{"ratings": 11481, "userreviews": [{"userName": "Glenn Sumi", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "UPDATE May 2016: Just found out this is going to be a movie, starring Catherine Keener as Reta! It will probably play the Toronto Film Festival in the fall. Looking forward to it!***In Carol Shields’s Unless, Reta Winters, a happy, middle-aged novelist and translator, a wife and mother of three children, discovers that her 19-year-old daughter has dropped out of university and is panhandling on the streets of Toronto holding a sign that reads “Goodness.” That one-sentence synopsis, while accurate, doesn’t begin to suggest the rich detail and generosity of spirit behind Shields’s final novel.The book is partly a mystery, an attempt to solve the question: “What happened?” As Reta fills in details about her husband, her children, her neighbours, her friends, her mother-in-law, the eminent French writer whose memoirs she’s been translating for years, we begin to get a sense of the rhythms and layers of her life – of anyone’s life, really.And then there are the characters in Reta’s new novel, a sequel to her light comedy My Thyme Is Up. As she sinks deeper into despair, unable to protect her homeless daughter, she focuses on moving the lives of her characters around to their inevitably happy ending.This passage is key:A life is full of isolated events, but these events, if they are to form a coherent narrative, require odd pieces of language, little chips of grammar (mostly adverbs or prepositions) that are hard to define, since they are abstractions of location or relative position, words like therefore, else, other, also, thereof, heretofore, instead, otherwise, despite, already, and not yet.Each chapter in this book – and indeed the book’s title itself – takes its name from one of those “odd pieces of language.” And gradually the details begin to form a coherent whole.So many scenes made me reflect on my own life, recognize how certain moments can be so fleeting. Shields helps capture them in all their wonderful ordinariness. After an exchange between Reta and one of her daughters, Reta thinks: When she looks back on her life, when she’s a fifty-year-old Natalie, post-menopausal, savvy, sharp, a golf player, a maker of real estate deals, or eighty years old and rickety of bone, confined to a wheelchair – whatever she becomes she’ll never remember this exchange between the two of us outside the bathroom door… Her life is building upward and outward, and so is Chris’s. They don’t know it, but they’re in the midst of editing the childhood they want to remember and getting ready to live as we all have to live eventually, without our mothers. Three-quarters of their weight is memory at this point. I have no idea what they’ll discard or what they’ll decide to retain and embellish, and I have no certainty, either, of their ability to make sustaining choices.So much clear-eyed wisdom about life. I could go on quoting passages – there are so many – but I'll let you experience them yourselves."}, {"userName": "Paul Bryant", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Did I tell you I just clocked up a count of just over 500 novels read, according to my GR novels shelf? Hey, how about that. It must make me some kind of authority now. I can dish out advice, start up a helpline, I know which novel to attach to the St Bernard dog to take to the fallen climber in the Alps. Except, I’m actually getting worse at picking novels to read. I just checked, and 13 out of 27 novels read so far this year have got a 1 or 2 star rating, i.e. I hated them & felt they were a blight on my life. Why is that?Part of the problem is that when I find an author I like I never read anything else by them, it would be too obvious (recent exceptions : Edward St Aubyn and Jean Rhys). Also, I think I’m easily led by reviewer enthusiasm. This explains The Shock of the Fall, Gone Girl, Little Big and Her. But glorious reviews also led me to Life After Life, Animals and The Death of Bees, three recent books which delighted my very left ventricle. You can’t even rely on a novel’s “classic” status, whatever that consists of. I Capture the Castle and The Man Who Loved Children turned out to be insufferable and worthy of forceful defenestration, but Lucky Jim, Where Angels Fear to Tread and The Talented Mr Ripley were all ripping good fun.This present volume, Unless, winged its way to me garlanded with shortlists (2003 Booker & Orange) & dripping with critical fluids. But they were all wrong. It was dire.A comfortable late 40s doctors’ wife in Ontario has three lovely daughters. The eldest, 19 year old Norah, drops out of university to become a street person. Sits on the pavement in Toronto with a begging bowl holding a sign saying GOODNESS. This is not an uninteresting circumstance – Philip the Roth had a similar thing going on in American Pastoral. But it’s not what you do, it’s the way that you do it, and Carol Shields does a Lionel Shriver by mentioning the awful horror briefly then spending 100 plus pages maundering over every last possible detail of her comfortable middle-class-translating-wise-feminist-books-from-the-French-growing-old-gracefully-but-now-wondering-what-the-point-of-it-all-is-cutesy-artsy Canadian life. After p 120 I knew what the daughter was up to. The front of her sign said GOODNESS but the back said ME, MOTHER, PUT A SOCK IN IT."}, {"userName": "Hugh", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/32318315-hugh", "userReview": "This is another of the books that was shortlisted for the Booker prize in 2002, which is the year chosen for the latest historic shortlist project in The Mookse and The Gripes group.This is a quiet but rather impressive book. On the surface not much happens. The narrator Reta Winters is a writer and translator, happily married with three daughters. The book follows her as she comes to terms with the strange behaviour of her eldest daughter, who has dropped out of university and now begs at a street corner bearing a sign saying \"Goodness\".The book is largely about the inner life of a writer, and the parts about the process of writing a novel, the nature of a writer's relationship with a translator and the role of the editor are fascinating and often very funny. The nature of goodness and what this means is also explored, and some of the chapters are letters which Reta has written but not sent, usually feminist critiques of articles she has read.One other thing that interested me was the chapter titles, most of which are one word, and generally neutral linking words (Unless itself being a typical example)For me the whole thing worked very well. I have never read anything by Shields before but I will probably read more."}, {"userName": "Fabian", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "Compulsively readable, the main character comes from a very proud lineage of other literary protagonists who get totally fucked over by their offspring. Although it doesn't come close to the pathos & articulation thereof of, say, Lionel Shriver's \"We Need to Talk About Kevin\", nor the titan-in-decay tableau that is Philip Roth's \"American Pastoral\"--\"Unless\" is way more playful and more accessible. It is the same old story, though. &, unless anything happens to me, I will definitely get my hands on every single thing Carol Shields has written or will write!"}, {"userName": "Trudie", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/4617856-trudie", "userReview": "I am tempted to write, \"this was a beautifully written load of old cobblers\" and leave it at that, but that statement probably deserves to be elaborated on. I didn't start out hating on this novel, it incrementally built up, misdeed upon misdeed. I can't work out if Shields is basically thumbing her nose at any critic that has suggested woman's writing is too small, too focused on the domestic, not concerned with the larger crisis of 'man'. In Unless  Shields seems to be purposely playing to those criticisms. There is a lengthy love letter to silk scarf shopping, a discourse on the satisfactions to be found in housework, awkward judgements on appearance (oh, the poor \"chunky daughter\") and a kind of Vogue Living-esque passage about what constitutes a room and the importance of fragrant woods and perfectly faded kilim rugs. This is all set against what is nominally a story about a daughters flight into vagrancy and her inexplicable search for \"GOODNESS\". It actually ends up being very little about Norah's actions but rather it seems like Shields has used this as a motif upon which to theorise about powerlessness and the plight of modern woman. I find this an unforgivable abuse of a minor character. I was desperate to hear more from Norah herself or her sisters, her boyfriend ... anyone but the melancholy hand-wringing of her mother Reta. The explanation of Norahs behaviour when it does finally come, is so puzzling to me that I audibly muttered \"no, no, no\" when I read it. It is all rather casually dealt with in a few pages like an afterthought. Poor Norah.So, if this is not really about family disfunction or vagrancy, what is it about ? It seems to me to be most concerned with writing itself and specifically the struggles of woman writers to be taken seriously. I wish this could have been done without these large sections from Reta’s novels A Thyme in Bloom  and My Thyme is Up both of which I would award a Good Reads rating of 1 star if I could, purely for the passages about Andy and his thrusting thrombone. Was all this meant to be ironic ?, a writer with feminist sensibilities writing what seems like escapist soft romantic fiction. Is it a parody of the kind of books woman are suppose to like and woman writers are expected to write ?. I just plain gave up trying to dissect all layers of potential meaning. Some books I dislike due to the writing style, others, as in this case are beautifully written but just fail to resonate. Despite finding this all fairly dire I am still interested in reading Shields's Pulitzer prize winner novel  The Stone Dairies  as I think this novel just struck me at all the wrong angles."}, {"userName": "Shovelmonkey1", "userReviewDate": "Oct 11, 2011", "userURL": "http://www.goodreads.com/user/show/3926982-shovelmonkey1", "userReview": "The 1001 books list is great for introducing you to authors that you were not previously familiar with. It's like a little black book literary dating service and without shame or embarrassment it will lead you by the clammy hand to meet a new author without you feeling half-witted, socially inept and geeky for making the effort or for not having made the effort earlier. Here Shovelmonkey1, it says, meet some new authors. Put your eyes between their pages and let their words roam around in your head. Then, if it does get awkward and you want to do a runner, I won't judge you. But you know you'll judge yourself, right?So, the 1001 books list introduced me to Carol Shields via Unless, her last and apparently most popular work (big thumbs up from many literary gurus and a teeny tiny mountain of award nominations). Well thanks for the intro 1001 books list, but this one kind of bombed for me. It was the literary blind date I had to run away from. I approached this book with no preconceptions about what the story might be and then immediately failed to engage with it. I didn't empathise with the character Reta Winters. I just didn't really care about Reta, her novel, her husband, her nice house or her wayward daughter. I was actually a bit interested in the ideas behind Norah and her pursuit of \"goodness\" but that never got expanded upon sufficiently for my liking which was shame because it was the most interesting part of the book. Maybe this is a book that only speaks to a certain group of people and perhaps one day when I have wayward children of my own and am a parent, worried out of my head over the inexplicable eccentricities of my beloved children, then perhaps I'll pick up this book again and think \"right, so that's what this is all about\"."}, {"userName": "Ron Charles", "userReviewDate": "Dec 26, 2013", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "You wouldn't expect it from her, but Carol Shields has written a naughty book. Put your yellow highlighter down: There's no sex, but the Pulitzer Prize-winning author of \"The Stone Diaries\" is doing something indecorous here -- ribbing our notions of grief, even snickering at what inspires us.Her latest novel, a mischievous monologue called \"Unless,\" begins with lamentations. Reta Winters once had it all: a loving partner who's a successful doctor, three smart daughters, a beautiful house outside Toronto, and a stimulating career as a translator. She had heard of sadness and pain, of course, but she confesses, \"I never understood what they meant.\"Until now. \"Happiness is not what I thought,\" she concludes. \"Happiness is the lucky pane of glass you carry in your head. It takes all your cunning just to hang on to it, and once it's smashed you have to move into a different sort of life.\" Now, in this new dark world, it's clear to her that the past was filled with \"impossibly childish and sunlit days before I understood the meaning of grief.\"Who needs a downer like this? That's what's so strange: It's a very funny book. Even in the middle of her anguish, she suddenly looks into the camera and says with deadpan sarcasm, \"I am attempting to 'count my blessings.' Everyone I know advises me to take up this repellent strategy.\"But nothing can alleviate the pain caused by her daughter's decision to drop out of college and \"live a life of virtue.\" For months now, 19-year-old Norah has been sitting on a street corner, begging, with a sign around her neck that says, \"GOODNESS.\" She won't speak to her parents and friends, or even acknowledge their presence.For Reta, this calamity calls everything into question, particularly her family's baffling reflex to carry on with normal life. The melody of their pleasant days stays essentially the same; only the beat changes. At night, her husband sets aside his study of trilobites to investigate mental illness. She checks out a few books on the nature of goodness.Like the friends of Job, everyone offers Reta reasonable, but ultimately unsatisfying counsel: Norah must be depressed; it's just a phase; her hormones are out of balance; she's had a nervous breakdown; she broke up with her boyfriend; she's suffering from post-traumatic stress. All reassure her that it has nothing to do with the quality of her mothering, but Reta knows better.And then she slides around again and realizes that her daughter must be responding to the powerless condition of women by rejecting the chauvinistic world and retreating into \"a kind of impotent piety.\"Aha -- a cause to fight! Suddenly, her women's group seems more relevant than ever. The gains of the feminist movement were paltry, and the movement itself is stalled. There are letters to write, outrage to be registered (calmly), and corrections to be made (without sounding shrill).Shields has captured something remarkably subtle and unsettling. Reta's grief would be so much cleaner if she weren't cursed with such ironic self-awareness, with moments of realizing that's she's a \"self-pitying harridan.\" How can she speak of her bottomless agony while translating the work of a Holocaust survivor? How can she stomach the embarrassment of reading her own \"whining melodramatic scrawl\"?On the other side, she can't keep her own wit from corroding every moment of inspiration. No sooner does she sigh with teary relief than she realizes such moments are \"fake jewels -- twin babies in snowsuits\" -- that allow her \"to be tipped from skepticism to belief. \"Even as she begins studying virtue, she feels compelled to note: \"I am not, by the way, unaware of the absurdity of believing one can learn goodness through the medium of print. Bookish people, who are often maladroit people, persist in thinking they can master any subtlety so long as it's been shaped into acceptable expository prose.\"As a writer, Reta can't resist the reflex to stand outside herself, analyzing, calling into question every motive, pushing her emotions and thoughts in one direction or another just to see where they lead.She also begins writing a comic romance, knowing full well that she's retreating from the stubborn problems of her real life to enter a fictive world under her control. But how, this wily novel asks, can a placebo work if you know it's a placebo? What can keep the witty, self-aware person from ricocheting between gassy inspiration and bitter shame? In her own sophisticated way, Shields has sneaked a whoopee cushion under the soft pillow of self-pity.Nothing is more surprising, though, than the story's ending. In a weird translation into comedy -- with some brilliant commentary on the publishing world -- the novel suddenly wraps everything up neatly. Of course, Reta notices this tidy denouement, too. After all, throughout the story she's one step ahead of us: \"Novelists,\" she admits, \"are always being accused of indulging in the artifice of coincidence.\"Since we first met her, Reta's taunts have trained us to be skeptical of all such artifice, but, come on, Shields suggests with a wink, everybody needs to rest sooner or later. And ultimately, what other indulgence can we enjoy more than the wonderful coincidence of being alive together? This is one of those books that make you regret that reading is a solitary pleasure.http://www.csmonitor.com/2002/0509/p1..."}, {"userName": "Jeanne", "userReviewDate": "Jan 23, 2012", "userURL": "http://www.goodreads.com/user/show/624623-jeanne", "userReview": "I waited patiently for this book to come out in softback so that I could read the final novel by Carol Shields. It just so happened that it came out right around my wedding and so the book gathered dust on my nightstand as I was a little busy and preoccupied with wedding planning. So I packed it and took it with me on my honeymoon. I remember pulling it out of my book bag, slathering on some sunscreen and settling myself onto a raft in the pool.I finished the book in about two days with a wicked sunburn. But what I remember the most was crying under my sunhat and sunglasses and glancing up to see that there was a row of readers seated at the edge of the pool. 10 people of various ages, all voraciously reading... Harry Potter and the Goblet of Fire. And then I noticed one of their numbers, an older woman with soft grey curls was reading Unless like me. When our eyes met, we both noticed that the other was crying. A knowing smile passed between us.Reta Winter's reevaluation of her own happiness, which, as in most of Shield's novels, works as a metaphor for the internal struggle and external struggle that each woman and women, respectively, have been going through since the soldiers came home from WWII and we all had to decide what we wanted to do and be with our lives--what would make us happy--is at the heart of this novel. This is an incredibly introspective story, it will either work for you or it won't. For me, I'm not sure if it was the story, or the knowing that this would be the last novel I would read, for the first time, from the voice of Carol Shield, that made me weep more."}, {"userName": "Amy", "userReviewDate": "May 07, 2008", "userURL": "http://www.goodreads.com/user/show/1211411-amy", "userReview": "This is my favorite Carol Shields book so far, and that is saying a lot because I adore Carol Shields. This novel was short-listed for the Booker. There is so much here, but it is portrayed in the classic slow, sensitive, Shieldsian manner. Those who think there is \"nothing going on here\" or that it's \"too slow\" or \"boring\" are most certainly missing a great deal. This novel invites a second or third read as well."}, {"userName": "Alice Poon", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/28700577-alice-poon", "userReview": "A perfectly normal, healthy and congenial nineteen-year-old young woman who grew up in a closely-knit and nurturing well-to-do family suddenly quits university, her family and her boyfriend to panhandle in a street corner of downtown Toronto.The novel is the youngster’s mother’s account of her experiences in dealing with the shocking loss of her lovely eldest daughter. She makes a desperate attempt to come up with possible reasons for her derelict daughter’s inconceivable action. Being a translator (from French to English) of memoirs written by a renowned French feminist, who has long influenced her worldview about gender inequality, she develops a bent towards the theory that her daughter’s action is an expression of her powerlessness in face of the world’s entrenched prejudices towards women; her only defense is withdrawal from life altogether. Interviewing her daughter’s boyfriend and university professor doesn’t provide any rational clues. Her desolation drives her to write imaginary letters lashing out at those writers whom she considers as sexist bigots. Meanwhile, she struggles, along with her husband and the other two daughters, to continue living life as normal as she can manage, being aware all the while though of the big hole left in the fabric of the household.The denouement comes as quite disturbing but not too much of a surprise. In these modern times, we all know how a traumatic event could exert damaging mental stress on an otherwise perfectly normal person. But the reader is left to wonder if the immediate tangible cause (a traumatic event) is the only cause that fully explains the youngster’s abrupt self-abnegation. Could there be an ultimate cause too? Could the mother’s maternal instinct be correct – that the intangible cause is the incremental build-up in the girl’s young mind of innate fear and powerlessness evoked by what she perceives as a male-dominant universe in which she would never achieve greatness?What's so haunting about this novel is the realization that not even parents' sacrificial love can shield their vulnerable young girls from some of the world's harshest realities."}, {"userName": "Cynthia", "userReviewDate": "Jan 02, 2008", "userURL": "http://www.goodreads.com/user/show/54076-cynthia", "userReview": "I was so bored reading this book. It started out boring in the first chapter when she listed all of her works and explained her translations. I'm not one of those type of readers where a book has to immediately grip you in the beginning otherwise you quit. So I kept on reading hoping it would get better... but it didn't. The book focuses on how Reta deals with her daugher, Norah's, strange decision to live in a shelter and to beg on the streets. Reta starts to believe the reason why Norah became this way is because of some feminist plight. So Reta rants about feminism for a good boring portion of this book and starts to write letters to random people about her daughter and feminism. The story about her daughter Norah was mildy interesting but it always felt like it was the background not the main focus. I did like how in the end, the mystery of why Norah took to begging on the streets in the name of Goodness was revealed, which tied back into an earlier small part in the book. I felt like I did not get to know any of the characters. Reta's husband, Tom, and their daughters, Natalie & Christine, have no personalities. Their characters are completely flat. The only two people we see any kind of personality are Reta, who is neurotic, and Danielle Westerman, who is unlikeable."}, {"userName": "Lydia", "userReviewDate": "Nov 08, 2008", "userURL": "http://www.goodreads.com/user/show/1331593-lydia", "userReview": "\"Unless\" is the last book Shields wrote before she succumbed to cancer. Written in true literary style, the book chronicles the life of a novelist/translator as she copes with the withdrawal of her daughter from college to a mute sitting on a street corner with a sign which simply reads \"Goodness\". All phases and forms of woman as creator of life, words, information, and emotion; as mother, daughter, sister, friend; as intellectual and emoter; and as feminist, femme, activist, accommodator and perserver of life, family, society play roles in this novel. The writing is smooth yet jarring in places.For me, I again find I am not a fan of the literary novel except in terms of the beauty of language. Too often I have found the subject of these novels to depict a way of life of which I will never take part and therefore have difficulty in reading. This lifestyle is one which is unobtainable in my space. It is interesting that when written in historical settings, such as those of Austen and Alcott, I can enjoy and comprehend the metaphorical and conceptual images. Such behaviors in modern times actually results in nothing but negative emotions.Is there such a thing as a literary novel which embraces those of us who are not part of mainstream middle America?"}, {"userName": "Catherine", "userReviewDate": "Nov 16, 2008", "userURL": "http://www.goodreads.com/user/show/876716-catherine", "userReview": "I was initially offended by the description of Sheilds as a \"gentle feminist.\" This double-edged sword of a description seemed an attempt at making a dirty word like \"feminist\" more palatable to the general public. The feminist in me roared, \"Why must a woman still be described as 'gentle'?!\"Upon reflection, though, I have realized that Sheilds truly is a gentle feminist, in the best way possible. While the ultimate quest in this story is the protagonist's daughter's quest for goodness, there is an underlying message that truly is that of the gentle feminist. Sheilds does not proclaim \"I am woman: hear me roar\" but rather \"I am woman: HEAR ME.\"Sheilds fights to be heard in the world of literature, which has traditionally excluded women's voices when they say things that men do not want to hear."}, {"userName": "Meike", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/59050228-meike", "userReview": "\"Unless is the worry word of the English language. It flies like a moth around the ear, you hardly hear it, and yet everything depends on its breathy presence. (...) Unless provides you with a trapdoor, a tunnel into light, the reverse side of not enough. Unless keeps you from drowning in the presiding arrangements.\"Reta (not Rita - Shields obviously read Derrida) Winters is 44, works as a translator and writer, is married to a doctor, has three daughters and a golden retriever named Pet, and lives in a beautiful house in Orangetown, Ontario. When her eldest daughter, 19-year-old Norah, drops out of college and starts to beg on a Toronto street corner, sitting behind a cardboard sign reading \"goodness\", Reta starts questioning her life: Is it really as idyllic as she thought, or did she simply not confront some lesser aspects of it? \"I am supposed to be Reta Winters, that sunny woman, but something happened when her back was turned.\" In Reta's opinion, Norah consciously chose her new life of passivity because she realized that as a woman, she will not be granted the same opportunities as men, and she will not be able to fully experience the world.It is remarkable how this set-up objectifies Norah: Her intentions are ascribed to her by her mother, she herself does not explain them (the truth only becomes clear at the end of the book, which to me was rather surprising, but well thought out). To some degree, Norah becomes a projection surface for her mother's feelings about gender inequlity, and, by that, also a victim of it. The sign saying \"goodness\" leads Reta to the interpretation that her daughter has committed herself to seeking goodness - which seemed odd to me, because a) as a beggar, she is asking for other people's goodness, and b) no one will increase the level of goodness in the world by sitting on a street corner. Don't get me wrong: Misogyny exists, the glass ceiling exists, the standards for men and women are still different, and we have to fight it, \"we\" being women AND men, because the consequences would be good for everybody - it's not as if men weren't also trapped in toxic behavioral patterns. I am just not sure whether Carol Shields does a good job capturing the problem.I have to admit that it certainly played a role that I simply did not like Reta, her passivity made me angry - and she was not in a position in which taking action would have been connected to possible negative consequences. Why does she treat her mentor Danielle Westermann like a mother-figure and belittles herself by never contradicting or challenging her? Why doesn't she simply ask her mother-in-law what it is that makes her so sad? Why doesn't she confront her almost grown-up daughters with the fact that they sometimes make her feel invisible and taken for granted? Why does she write letters and does not send them? In case she just writes them to order her thoughts, why does she indulge in blaming those she adresses of not acknowledging the contribution of women to literature? I do agree with Reta that being a WASP is still very beneficial when you're a writer, but writing down this unoriginal observation in letters you do not even intend to send will most certainly not help the situation. It will and does put her down further, as it is nothing but a kind of rumination, re-assuring her of her own passivity. I am not a psychologist, but it seems to me that Reta is generally very busy demonstrating to what degree she internalized her learnt helplessness, a path that takes people straight to a final destination called depression - and instead of facing her own depression, Reta projects it onto her daughter Norah, because she is hardly able to feel herself. Another aspect of the book that bothered me were the crude, in-your-face metaphors: Reta Summers becomes Reta Winters by quasi-marrying Tom (they are not really married so they can fool themselves that they are super-sixties-alternative - *yawn*), a friend gets her navel surgically removed because a man wants her to (you got to be kidding me), Reta's editor keeps interrupting her when she wants to explain her ideas for her novel, Reta tries to re-establish order in her life by cleaning her house, her quasi-husband Tom - who is a nice guy, but as a man seems also to represent the ancient male-dominated order - is a specialist for trilobites, oh yeah, and of course there's shopping for colorful accessories. Wait - are these still metaphors or is this just proof that Shields thinks her readers are not particularly smart, so she spares them the subtlety that, by the way, is unfortunately a typical power tool of misogyny?In other parts, the levels of language are so twisted that it becomes impossible to deconstruct any meaning (for me at least): \"The sentiment (of inequality) is excessive, blowsy, loose, womanish. But I am willing to blurt it all out, if only to myself.\" The language is as wrapped up in itself as Reta is, which is incredibly frustrating. What is Reta saying here? I am angry about inequality, so I am not going to do anything about it except letting my inner voice bitterly mimick the derogative perspective of misogynysts by calling my feelings \"womanish\". You do you, Reta, but this is nonsense. Why am I reading this?This strange loop is also mirrored in the book Reta writes, a sequel to some light romance where a woman loves cats and makes rice casseroles because she is a woman or something along those lines (yes, I am losing patience with our good Reta, and I am not only verbalizing it to myself, folks).And one last point: A writer does a major disservice to feminism when she writes sentences like \"I've had about two. Two conversations with men who weren't dying to 'win' the conversation.\" This is simply absurd. Absurd!At least this book offers a lot of material for discussion, so check out the Mookse & the Gripes Booker 2002 discussion thread!"}, {"userName": "K.D. Absolutely", "userReviewDate": "Aug 15, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "A woman writer working on her second novel. Then suddenly, with no particular reason, her eldest daughter leaves college and her boyfriend and begs in the street of Toronto with a placard sign on her neck that reads: \"GOODNESS\". The daughter refuses to speak to the mother or anybody. Just like that. Yes, the plot is just like that but the way Carol Shields (1935-2003) writes is different from what I've read so far. It is fluid, supple and multi-layered or multi-pronged. I would imagine that if this plot were given to Marilynne Robinson of Home or Roxana Robinson of Cost, they would have created a huge tearjerker. Shields is also a woman, a mother and looking at her picture she seems to be a warm person. However, despite the opportunity of activating my tear glands, she kept me in thrall throughout my reading. For a plot as simple, she interjected her life as a struggling female writer (in a predominantly male Canadian literary world), a mother who is trying to do her role to take care of her two other daughters, a wife who still has to regularly make love with her husband for 25 years despite either one of them ending up crying after each lovemaking session. That last statement, at first seems to be displaced just like how Shields used the menial activities that the mother, Reta Winters, 44 years of age, has to go through everyday. But when you slow down and pay attention you would get that feeling that the triviality of Reta's everyday lives heightens the message that the book wants to convey: that for parents, regardless on how good we think our parenting skills are, will never have the guarantee that our children will be want we want them to be. That parenting is a hit-miss and there was nothing that prepared us to that role.The book does not preach how to be a good parent. In fact, while reading, I was murmuring to myself as if talking to Reta: It is your writing. You are too busy, you don't have time for your kids. Only to be proven wrong in the last chapter when the reason is revealed. Lesson: in my opinion, good writers can never be double-guessed by their readers.This book was published in 2002 and was shortlisted in the 2003 Man Booker Prize for Fiction. On that same year, Shields died from breast cancer. There is a part in the book that seems to describe the non-cancer situation using CA terminologies. It's kinda creepy, I would like to share it with you:\"Norah seems lodged in childhood's last irresponsible days, stung by the tang of injustice, nineteen years old, with something violent and needful beating her brain. It's like a soft tumour, but exceptionally aggressive. Its tentacles have entered all the quadrants of her consciousness. This invasion happened fast, when no one was looking.\" A few years back, my loving aunt died of breast cancer so I wonder how a CA patient can still write a beautiful beautiful book while suffering from it. Saludos, Shields!"}, {"userName": "Book Concierge", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/1628041-book-concierge", "userReview": "Digital audiobook narrated by Joan AllenReta Williams is a successful author and translator, a wife, and a mother to three teenage daughters. Her oldest daughter, Norah, is a 19-year-old freshman at university, when Reta and her doctor husband, Tom, discover that Norah has apparently dropped out, and spends her days sitting on a Toronto street corner, with a signed around her neck that reads simply “Goodness.” The mystery of how and why her daughter has come to panhandling in this way is the major plot point of the novel.However, this really isn’t a plot-driven story. It’s a character study: of what it means to be a woman, a mother, a writer, a feminist. Reta is worried sick about Norah, but she is still a wife, still meets friends for lunch, does laundry, buys gifts, works on her latest book, and she writes letters (which she doesn’t send) in response to articles she reads. Yet, while Reta continues to lead her life, she cannot stop thinking and worrying about Norah. I finished this book nearly two weeks ago, but I’ve been thinking about it ever since. I simply didn’t have the words to describe how I felt about it. The best way is to quote from the novel itself: \t“A life is full of isolated events, but these events, if they are to form a coherent narrative, require odd pieces of language to cement them together, little chips of grammar (mostly adverbs or prepositions) that are hard to define, since they are abstractions of location or relative position, works like therefore, else, other, also, thereof, theretofore, instead, otherwise, despite, already, and not yet.\t....Unless, with its elegiac undertones, is a term used in logic, a word breathed by the hopeful or by writers of fiction wanting to prise open the crusted world and reveal another plane of being, which is similar in its geographical particulars and peopled by those who resemble ourselves.”This is the last book that Shields wrote, though it is the first by her that I’ve read. I cannot help but wonder how much of Reta’s internal dialogue was really Shields’. (The author died of breast cancer within a year after the novel was published.)Joan Allen performs the audiobook. She is a gifted actress, and is perfect for this work. She made Shields’ prose virtually sing."}, {"userName": "Fatema Hassan , bahrain", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/16564718-fatema-hassan-bahrain", "userReview": "إلا إذاللروائية الكندية كارول شيلدزرواية غريبة، قد لا تحبها، قد لا تفهمها، لكن العروج إليها يتطلب نوعية اهتمام معينة، لأنها تعبر عن فئة عمرية محددة -المرأة الأربعينية- تمارس مهنة صارمة لا تقبل ان تندرج ك الخطة ب في الحياة - الكتابة - ف لك أن تتخيل كم الصعوبة التي ستواجهها لسبر الرواية، شعرت بأني أقرأ سيرة ذاتية في البداية واستغربت تصنيفها كرواية ! لكني استرسلت في القراءة مستسلمة ومفتونة بتفاصيل حياة الروائية، شعور لذيذ يشبه شعور السطو والتلصص على خزانة امرأة لمعرفة أسرار تفوقها و أسباب قوتها، ولكن بعد أن حددت الروائية أُطر حياتها الشخصية و المهنية - متزوجة ولديها ثلاث بنات- سعيدة ومحبة لمهنتها كمترجمة و كاتبة قصص و مقالات نقدية متملقة النشأة على حد تعبيرها- لم أغفل روعة هذه الجزئية التدميرية و حِدتها و يجدر بكل قارئ ألا يغفلها فالتملق ثقب مركب القراءة و إن كان سدادة مؤقتة لكاتب ما- وكذلك وضحت صعوبات مهنتها وعددت بعض من أهم انجازاتها المهنية في محاولة لتفعيل خاصية استراتيجيتها الطاردة على حد تعبيرها للوصول للأهم في حياتها والاعتزاز بالإنجازات، تهوية لابد منها لطرد كل المثبطات لعزيمتها، بعد أن مضيت قدمًا في القراءة اكتشفت أني لا أقرأ عن حياة الروائية كارول شيلدز بل عن شخصية روائية أخرى اخلقتها كبطلة ذات مقاييس تشبهها - برأيي-.. هل قل اهتمامي بالسيرة؟ لا، شيلدز أوصلت اهتمامي لذروته أساساً، التركيز تغلب على الاستمتاع، لكن شعور السطو على خزانة امرأة أصبح حانق أكثر وحل محله شعور السطو على خزانة امرأة سارقة وكل ما أمامي مستعار، يعادله شعور شفقه على خزانة امرأة كل ما تحويه مفروض عليها وهي تتباهى ببلاهة به، ماعلينا، نعم، أنا أفقد عقلي.هذه الروائية الكندية الأخرى ريتا وينترز بعد نجاح روايتها الصيفية ذات الطابع الهزلي الخفيف، تأمل في أصدار جزء ثانٍ للرواية، وتناقش حياة بطلتها إليسيا على مدار الرواية، كارول تتحدث عن ريتا التي بدورها تتحدث عن أليسيا!!! هذه الكياسة المهنية تتخذ شكل حلقات متداخلة، تكاد تجرم أنها بذات الأهمية رغم كونها انعكاسات لذات الحلقة الرئيسية، أو لنقل انتكاسات! هل يوجد معيار لاختيار الروائي لأبطال روايته؟ هل يتخيرهم مشابهين له؟ أم مكملين له؟ أم يعبرون عن نقص فيه ؟ هل يحدد وعيه أم لا وعيه هذا المعيار؟ ألف سؤال سينفجر في رأسك إذا احتملت أن تسلم نفسك لدوامة شيلدز هذه.عقدة الرواية تتلخص في كون ريتا ويتنرز، الزوجة السعيدة و الأم لثلاث فتيات و المهووسة بالكتابة، تمر بامتحان صعب ف ابنتها الكبرى نورا ١٩ عام تقرر ترك دراستها و بيتها و صديقها و تزهد بحياتها و تعيش حياة التشرد، على زواية شارع وأمامها وعاء تبرعات تجمعه لصالح الفقراء و لافتة مكتوب عليها ( الخير )، فتاة لي مقتبل العمر اعطت لنفسها الحق في الحرية في ان تكون الغائبة الأكبر في حياتها الخاصة ! تقدم استقالتها من حياتها وعلى أهلها تقبل الأمر، مشاكل ريتا كمترجمة و ككاتبة تحتاج صفاء في حياتها لتبدع ولتتفاوض مع محررها على شروط إصدارها الروائي الجديد، تلاحق ريتا مسارات حياتها بكل جدية بشخصيتها الكندية المسالمة و الصبورة و البسيطة.إلا إذا ..عبارة تفصل بين عالمين، بين رأيين، مؤكد أنها من المنغصات تنطوي على خبث حواري متخفي، تخرج ممن نحاور ما نريد دون توضيح لمقاصدنا، إلا إذا.. أراها أرجحة.. فرضية وهي عكس السؤال المباشر والمحدد الذي يفتح القلوب المقفلة، مالذي تخرجه الأسئلة منا؟ ما مقدار الراكد من أجوبة في داخلنا الذي نغفل عن تراكمه أصلاً؟ إلا إذا و السؤال المباشر تقنيات سهلة تتكل عليها شيلدز لتبني روايتها هذه التي تعبر من مناطق الضعف لمناطق القوة. لا أحد يرغب أن يعيش في -إلا إذا-مقتطفات :- ان الرواية تساعدنا في أن نخفض صوت \" خطابنا \"الداخلي، إلا إذا كان بإمكانها تقديم البديل، خطابٌ به تفاؤل و أمل، إنها مجرد سردٌ متفتت، إلا إذا.. إلا إذا.إن كلمة إلا إذا هي كلمة القلق في اللغة الانجليزية، فهي تطير مثل الفراشة حول الأذن بالكاد يمكنك سماعها، و مع ذلك يعتمد كل شيء على وجودها، إلا إذا هي الكلمة الشرطية التي تحملينها بين تجاعيدكِ فهي دائمًا موجودة أو غير موجودة."}, {"userName": "Neil", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/33119635-neil", "userReview": "I read this as part of The Mookse And The Gripes’ read through of the 2002 Man Booker Prize shortlist. As it happens, it is one of two books from that short list that I have on my book shelf (the other being the winner, The Life of Pi). This means I must have read this book 15 years ago, making this officially a re-read. However, unfortunately, I have no recollection of that first reading. This is a shame because 15 years is a long time and it would be interesting to know how both my taste in books and, maybe, books themselves have changed in that period.One of the first things I noticed about the book was the chapter titles. The first couple piqued my interest and then I flicked through to see what was going on. We do get an explanation of sorts right near the end of the book:\"A life is full of isolated events, but these events, if they are to form a coherent narrative, require odd pieces of language to link them together, little chips of grammar (mostly adverbs or prepositions) that are hard to define [...] words like therefore, else, other, also, thereof, therefore, instead, otherwise, despite, already, and not yet.\"It is these words that form the chapter titles and I didn’t understand it for a while. But, thanks to WndyJW over on the M&G discussion, I was able to see that the chapter titles are part of Shields’ attempt to show the fragmentary nature of life.This fragmentation is key to the book. There were several points where I read something and thought \"But you’ve already told us about that - why are you saying it again?\". But once I had realised the stuff about fragmentation and then read a chapter that started \"Tom and I still have sex—have I mentioned this?—even though our eldest daughter is living on the street, a derelict.\" I understood that the episodic nature of the story and the narrator living through a time of stress mean that the repetition is probably deliberate - the impression is that the narrator isn’t sure of what she has or hasn’t told us already.What we get is a series of connected episodes from Reta Winters’ life. She is struggling to come to terms with the fact that her eldest daughter has apparently thrown her life away and now lives by begging on a street corner. At the same time, Reta is an author writing a novel - this actually makes Shields a writer writing a novel about a writer writing a novel about a writer, and the topic of writing is another dominant theme in the book. More on this in a minute.The final key theme of the book is the struggle for women to be recognised in a man’s world. Reta writes, but never posts, several letters to people who have written books or articles that completely ignore the role women have played. She relates this to her belief that her daughter’s situation is a reaction to the way women are treated. At the very end of the book, we learn the truth behind her daughter’s actions, but I won’t spoil anything by saying what it is or whether Reta is right.For the most part, I enjoyed reading this. There are several moments of humour - this was my favourite:Willow is a superb cook and she has said to me a dozen times—I exaggerate, if only a little—that she reads cookbooks the way other people read novels. “But wouldn’t you be less of a bore if you read novels?” I long to say, but of course I don’t.And the general topic of writing is interesting. I found myself fascinated by my own reaction where I was interested in Reta’s story but not in the story she was writing. There’s something Shields is saying about narrative, and possibly about our distance from the narrative, that I haven’t quite processed yet.But there are also some painful bits. In a book that focuses on the role of women, it seems a bit petty to make your male characters so 2-dimensional and unbelievable. Or maybe I'm doing Shields a disservice and this is deliberate given her theme of women being overlooked. Reta’s husband, Tom, has a hobby and a job but little else. And don’t get me started on her editor who comes to visit her towards the end of the book! I found him an entirely unbelievable (possibly deliberately?) and ridiculous character who, I have to say, rather spoiled the book for me.Overall, it was an uneven reading experience for me with some good writing but some parts that I simply found awkward to read."}, {"userName": "Jonathan Pool", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/27950748-jonathan-pool", "userReview": "At first sight Unless is a simple story, somewhat dated in its telling, making an (by the standards of 2017) unfashionable commentary on the joys of homemaking (by women).The narrative is rather deeper than that, though, and cuts to the core of family hurt and upheaval if a loved child goes off the rails. Carol Shields also reflects deeply and frequently on the difficulties, for women particularly, in trying to make a real and lasting difference in their lives.\"My nineteen year old doomed to 'miniaturism' she can have goodness but not greatness\"(247)I read Unless as a feminist book rather than an apology for domestic subservience and curtailment of ambition.\"\"The problem of women, how they are dismissed and excluded from the most primary of entitlements\"(99)North American women writers today, Anne Tyler, Ann Patchett, Elizabeth Strout address similar themes of domestic reality focused on the family.In Shields words:\"modern psychological novels about fairly ordinary people\"I do enjoy reading about this subject matter.Unless uses the device of the novel within the novel:\"I too am aware of being in incestuous waters, a woman writer who is writing about a woman writer who is writing\"(208)But this is not a convoluted, complicated duality. The developing story of Alicia and Roman and allows Shields to make oblique points about the \"real\" life of Reta, her writer narrator.An enjoyable read, my first as part of  The Mookse & The Gripes group re read of the 2002 Booker Prize shortlist."}, {"userName": "Philip", "userReviewDate": "Aug 20, 2008", "userURL": "http://www.goodreads.com/user/show/1391890-philip", "userReview": "Unless by Carol Shields has been my third novel in a row written from the perspective of a self-analytical, self-critical and perhaps self-obsessed female narrator, the other being by Margaret Drabble and Anne Enright. Maybe Carol Shields drew the short straw, because I felt that Reta, the writer-narrator of Unless, internalised everything, so much so, in fact, that the other characters in the book became no more than projections of themselves within her. Maybe that was part of the point.Ostensibly about a family of ordinary people, Unless portrays Reta Winters, her partner Tom and their three daughters. They live an hour from Toronto in a home that sounds as big as a village. Reta can’t decide how many rooms there are, or even what might constitute a room. Tom’s a medic and Reta is a published author of moderate success. Not, at least for me, run-of-the-mill ordinary folk.The eldest daughter, Norah, a nineteen year old determined to make her own marks, has recently left home to live with a boyfriend. She has dropped out of college and then she suddenly took to sleeping rough, occasionally in a hostel for the homeless, whilst, during the day sitting on a street corner behind a sign saying, “Goodness”. Reta can’t rationalise her daughter’s apparent rejection of everything she was supposed to be and begins to delve into her own psyche for clues. It affects her work, her family life and her relationships, all of which must, of course, go on.Throughout, the narrative is both clear and crisp. Reta’s character is credible, if a little prone to a lack of self-awareness, despite the fact that she seems to have majored in the topic to the extent that her self-preoccupation verges on the obsessive. Her writing progresses, but for me unconvincingly. A light read, something twixt romance and general fiction, is what she is looking for. Quite why the main character needs to be an Albanian trombonist (good at sex, apparently, because of the regular arm-pumping) only Carol Shields knows. There were comic opportunities that were never taken and, equally, possibilities for parallel lives that were never exploited. Personally, I found the scenario of the novel within the novel, as explained by Reta, herself, the writer, offered neither comic relief nor insight. When Reta’s new editor demands that the light fiction be transformed into the literary by means of, amongst other things, redrawing the last chapter to introduce surprise and enigma, undertones, unexpected depth, we are led directly into the unexpected discovery of the reason behind the unexplained behaviour of Reta’s daughter, the events that prompted her drop-out into apparent depression. It ought to have been a poignant moment, but for me it all became a bit pedestrian.I thoroughly enjoyed the book, by the way. My criticisms are technical at best and petty at worst, but I fell I have to record them. Perhaps it was attempting three psyche-analysing, internally-bound first persons on the trot that got to me. Perhaps I too got lost inside myself as I read. Carol Shields’s “I” was a darned sight more balanced and self-sufficient than either Drabble’s or Enright’s. Perhaps if Reta had made a bit more fuss I would have found her more credible. But that, undoubtedly, was her strength."}, {"userName": "Tiffany", "userReviewDate": "Apr 15, 2009", "userURL": "http://www.goodreads.com/user/show/1545272-tiffany", "userReview": "In a manner more eloquent than I could ever manage, this book expresses everything I feel about modern feminism and why it's still very much a necessity. Heartbreaking. Beautiful. Consuming. These are only a small portion of words that can begin to describe Unless by Carol Shields. Reta Winters' daughter is so overwhelmed by her desire to experience every success and beauty the world has to offer, but her realization that she can never have everything as a woman is too much to bear. As a result, she shuts down: she lives her life on a street corner in Toronto, begging for money and wearing a sign that simply says \"Goodness.\"\"Goodness not greatness.\" Yes, women can choose whether or not to stay home with their children or have careers. Yes, they have the potential and opportunities to become world leaders, business moguls, successful human beings. But are we completely, truly, utterly equal in that we have every opportunity for actual greatness, not just goodness, that a man does? Unless explores this question in a way that is genuine and sincere, acknowledging our feminine past as well as what still needs to be done for our future.I cried while I read this book, and when I mulled it over afterward. I feel like it extracted my core and shook it up a bit."}, {"userName": "Nahed.E", "userReviewDate": "Dec 10, 2015", "userURL": "http://www.goodreads.com/user/show/37363150-nahed-e", "userReview": "لكن ليست السعادة كما نتصورها ، فالسعادة هي ذلك اللوح الزجاجي الذي تحمله في رأسك ويستنفذ كل براعتك كي تظل متمسكاً به ، وحين يتحطم يتوجب عليك الانتقال إلي نوع آخر من الحياة ولكننا لا نعرف كيف نطلب ما لا نعرف حتي أننا نريده القراءة الأولي لـ كارول شيلدز ..و .. لقد انتهت الرواية معي دون تقييم .. !هناك شئ مُحير في هذه الرواية .. شئ يجعلك - ربما - تستمر في القراءة للنهاية علي أمل أن تجد ما يجعلك شغوفاً بها لا أنكر أن هناك اقتباسات من نوعية السهل الممتنع .. شئ يطرق باب الفكر ويطل برأسه من بين الصفحات وربما يجعلك مستمراً في القراءة علي أمل أن تجد فكرة مشابهة له بعد عدة سطور أو عدة صفحات شئ يجعلك تقول فجأة .. هذه الكاتبة حقا ماهرة .. لقد قالت ما أريد قوله ..ولكن ... أين القصة ذاتها .. ؟ أين الحبكة ؟ ..فانا أقرأ فصولا منفصلة متصلة عن حياة كاتبة في الأربعين من عمرها تحيا رحلة البحث عن النجاح الأدبي من خلال الكتابة والترجمة لأعمال كبار الكتاب لديها مشكلات أسرية عادية .. ولديها قناعات فلسفية بسيطة .. ومجموعة من الصديقات لكل منهن مشكلة ما فقط !!هذا ما وجدته .. فالأمر ليس عويصا علي الفهم ولا يثير الشفقة ولا يُحرك القلب ولا يعصف بالعقل فقط تقرأه .. وتنتظر ما يٌتعب .. تنتظر المشكلة .. وتنتظر الحل ...ولكنك تجد السرد فقط .. سرداً رمادي اللون .. ثلجي .. بارد .. لا يُحرك بداخلك تلك الشعلة في القراءة .. ولا الرغبة الكبيرة في الاستمرار هل أقيمها .. ؟لا اعتقد ... ولا استطيع ولا أريد !"}, {"userName": "Ben Babcock", "userReviewDate": "Dec 18, 2010", "userURL": "http://www.goodreads.com/user/show/1188122-ben-babcock", "userReview": "I bought this book as a Christmas gift for someone, attracted to it by its recent accolade of competing on Canada Reads. I have never before read anything by Carol Shields, and when I buy books that I haven't read before with the intention of giving them to other people, I tend to read them myself first. So I embarked upon Unless not knowing all that much about it, knowing only that it had won a poll entitling it to a spot in a national debate, only that it was some sort of book about a mother in a city near Toronto with a daughter who lives on a street corner in pursuit of \"goodness.\" And I ended up falling in love with Carol Shields' writing, with the way she describes people and feelings and what matters to us, but I didn't fall in love with Unless.I seem to be in the habit of reading meta-fictional fiction lately. Books about writers, books about writers writing. Writing about writing. Reta Winters is a moderately successful writer and translator, content in how she has managed to fuse domestic life with her own goals, except, of course, for what has happened with her nineteen-year-old daughter, Norah. As Unless unspools, Reta reflects on her writing, on how it has shaped her, on how writing shapes others, and especially on the role of women in writing. Later chapters begin with an unsent letter Reta has composed to an author or editor, in which she questions why a book or magazine article cited so many influential male authors and no female authors. Meanwhile, Reta alternates between discussing her life, including the slow, simmering story of how and why Norah came to live on a street corner, and discussing with us her plans for a sequel to her novel, a sequel in which she realizes the emancipation of her female narrator.Rather than confront the whys and wherefores of Norah's societal estrangement directly, Shields has Reta approach the issue sideways. It is as if Reta herself cannot bear to interfere directly; heeding the advice of many, she waits and sees how long Norah can continue this self-imposed homelessness. Instead, she explores what she slowly comes to believe is the reason Norah has chosen to search for goodness on the street corner. She confronts the gender divide in our society, and most notably in how it affects her as a mother and a writer.Reta, and through her, Shields, are right about this, of course. This week I have been following the #MooreandMe trend on Twitter, started by a feminist blogger outraged by insensitive comments made by Michael Moore regarding the allegations against Julian Assange that he raped two women. Moore and Keith Olbermann's initial reactions to this protest movement, not to mention all the trolls on Twitter, made a point abundantly clear, if you weren't already aware of it: this is still a grossly unequal world. Despite our nominally-democratic, Charter-enshrined (in Canada) society, gender is still a minefield and a battleground.Shields takes an interesting way of reminding us of this fact, a way that is simultaneously seductively unique yet frustratingly heavy-handed. I like Reta, both as a person and as a narrator. I like all of the Winters: Tom, Norah, Natalie, Christine, Lois. I even like the overbearing, interrupting Arthur Springer—he does mean well, even if he is an example of a man who has been educated by society with certain notions of power, gender, and what readers want. I like them, because Shields makes these characters people. They have flaws, but they try hard. There are no moustache-twirling villains here, nor are there golden messiahs. At the same time, Shields avoids making any of her main characters a subject of spectacle. I think there is a tendency to hype literary fiction that focuses on the spectacular character, the crack addict or the prostitute, the child soldier or the homeless mother. Unless, among all its other charms, brings us ordinary people who, for the most part, do not have any serious problems with their lives. And it makes me care about them, invest three hundred pages in them. That's pretty cool.Yet I cannot ignore that heavy-handed approach Shields takes to these issues of gender inequity. Maybe it's because I am a man, but there is something alienating it, a fatalistic tone to Reta's melancholic proclamations:Because Tom is a man, because I love him dearly, I haven't told him what I believe: that the world is split in two, between those who are handed power at birth, at gestation, encoded with a seemingly random chromosome determinate that says yes for ever and ever, and those like Norah, like Danielle Westerman, like my mother, like my mother-in-law, like me, like all of us who fall into the uncoded otherness in which the power to assert ourselves and claim our lies has been displaced by a compulsion to shut down our bodies and seal our mouths and be as nothing against the fireworks and streaking stars and blinding light of the Big Bang. That's the problem.\"Because Tom is a man…,\" because he is outside, he is Other, he can never really comprehend. And I say this not to invoke the rather dim lament of \"Oh noes, not feminism! What about the poor mens?!\" I just have a difficult time accepting or even considering the idea that there are certain mentalities, certain perspectives, forever inaccessible to me by dint of, as Reta puts it, a seemingly random chromosome determinate. I don't know if that is the case. As a writer I certainly hope not; as a reader I strive my best to access that inaccessible perspective through the voices of narrators like Reta Winters.Of course, if you have read the book, you might recall the paragraph that immediately follows the one I quoted above. You might, thus, be preparing to call me out, for I have done the questionable thing of taking a passage out of context. I really do like the passage above, as a piece of writing, even if I find the sentiment rather extreme. So, to correct my temporary omission, I will mention that Shields acknowledges her hyperbole:This cry is overstated; I'm an editor, after all, and recognize purple ink when I see it. The sentiment is excessive, blowsy, loose, womanish. But I am willing to blurt it all out, if only to myself. Blurting is a form of bravery. I'm just catching on to that fact. Arriving late, as always.Additionally, it is clear that Shields' intention is never to alienate nor even to preach. Danielle Westerman is a foil to Reta, a woman whose bitter old age has metamorphosed her feminism into a general kind of misanthropy. It's her class-conscious, power-conflict sentiments that Reta is echoing, and that is only one view of many that surfaces in Unless.For despite having a single first-person narrator, Unless carries within it a symphony of multiple voices. Shields manages to convey, through Reta, the opinions and ideas of the other characters, assembling a multi-dimensional view of the story as it centres around Norah.I am, like with much of this book, ambivalent about Norah and her role. I like that Shields does not pursue the reasons behind Norah's choices directly, because that would have made for a very different type of book, something that would almost be a mystery. Yet I feel a little cheated by the resolution. I feel like the way Shields explains the mystery is careless, because we hear it second-hand through Reta, and Norah remains, as she does for the rest of the book, little more than a name with a sign that says \"Goodness\" attached to it. That being said, I understand why Shields does it this way, revealing that it is not a careless decision at all. For this is Reta's story, not Norah's, and hence it is important to hear how Reta interprets Norah's actions and Norah's reasons, more important than it is to hear Norah herself discuss them. Thus my ambivalence. I want more than Unless can give, more than it should give. I'm just a greedy reader!The back cover of my edition has two blurbs, one from The Ottawa Citizen and one from The New York Times Book Review, both so glowing and gushing that I'm a little embarrassed, on the book's behalf, by them. These blurbs are falling over themselves to convey to me, with adjectives and adverbs and exclamation points, how much they love Unless. I won't do that. I try, for one thing, to limit the number and type of adverbs and adjectives I expend on any one book. And I fast approach my quota. Moreover, I obviously do not share these blurbs' sentiments when it comes to this book. I liked Unless, and as my unabated intention to give it as a Christmas present attests, this is a book worth reading. Is it a book Canada should read? Not having read any of its contenders, I will withhold my judgement of that.So I'm not going to tell you that this is \"a signal novel, profound and resonant.\" Let me be clear in the way only stumbling, awkward prose can be: Unless more than doesn't suck, and it is in fact quite good. It has a simplicity that truly makes it a serious, thoughtful work of art. And it deserves accolades and attention. At the risk of sounding trite, I will conclude with a quotation: \"Goodness, not greatness,\" as Reta echoes Danielle Westerman, is what Unless and Carol Shields achieve."}, {"userName": "Julie", "userReviewDate": "Apr 03, 2010", "userURL": "http://www.goodreads.com/user/show/3534502-julie", "userReview": "Ugh--I couldn't even finish this book. This is only the third time I have ever been unable to complete a book once I started reading it. I really gave it a good try. I didn't set it aside until I had forced myself to read at least 50 pages.From reading the synopsis, I thought the book would be about the dynamics of the mother and daughter's relationship and the disintegration of such. This was all about the books that the mother authored and her feelings. The daughter was hardly mentioned in the 55 pages that I forced myself to complete.When I read a book, I like to be entertained and to feel some enjoyment. The vocabulary the author used in this book was so over-the-top that I found myself pulling out my dictionary on more than one occasion.If this is any indication of this author's writing style, I would be hard-pressed to pick up one of her books again."}, {"userName": "Elaine Mullane", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/873807-elaine-mullane", "userReview": "''It happens that I am going through a period of great unhappiness and loss just now.''\nMeet Reta Winters: translator and author of \"light\" fiction, doctor's wife, mother of three teenage daughters. Reta lives one hour outside of Toronto in a small town called Orangetown. Her family are close-knit and loving, and she is content in her comfortable life in her large and beautiful home. Reta is working with Danielle Westerman, a formidable Holocaust survivor whose memoirs, which Reta translates, amount to several volumes, and is working on her second novel, Thyme in Bloom, which will, she hopes, be as light and summery as its predecessor (My Thyme is Up).We soon learn, however, that Reta's cosy world is collapsing. Her eldest daughter, Norah, has withdrawn from the world, and abandoned university, her boyfriend and their apartment to sit on a street corner in Toronto, wearing a sign around her neck that reads only ‘Goodness’. Reta, her husband, Tom and her daughters go to see Norah, give her food, clothes and money, but Norah gives these things away. They visit the Promise Hotel, a dormitory where Norah sleeps at night, and try to make sense of what has happened to make her retreat from life. But any efforts to speak to her, let alone reclaim her, are rebuffed. Norah - beautiful, intelligent Norah - sits in silence and stares past them, lost in her own private world.Friends of Reta offer her conflicting advice - let her have her silent protest, let her be; have her arrested; treat it as a behavioral issue and bring her home, with force if it is required. None of these suggestions help Reta, however, whose sunny outlook and general optimism have been lost. As Reta seeks the causes of her daughter’s retreat and tries to make sense of her new reality, her inquiry turns into an examination or meditation on society - where we find meaning and hope - and on female exclusion. In letters she pens but never sends, Reta creates a passionate defense of female writers who write of 'domestic' subjects and female novelists who are doomed to \"miniaturism\".\"The world is split in two between those who are handed power at birth, at gestation, encoded with a seemingly random chromosome determinate that says yes for ever and ever, and those like Norah, like Danielle Westerman, like my mother, like my mother-in-law, like me, like all of us who fall into the uncoded female otherness in which the power to assert ourselves and claim our lives has been displaced by a compulsion to shut down our bodies and seal our mouths and be as nothing against the fireworks and streaking stars and blinding light of the Big Bang.\"Reta wonders if it is these feelings of exclusion or miniaturism that have left Norah feeling hopeless and driven her from the world. Without any real explanation, the careful and thoughtful architecture of Reta's happy and content life is undermined, right down to its very foundations. The narrative has been broken and we, like Reta, are desperate to find out why. There are some very poignant moments in this book where our protagonist struggles to make sense of Norah's plight. In one short chapter on the details of housekeeping, Reta reveals her hope that putting her house in order will bring her daughter back, a desperate effort to regain control that gives us insight into how troubled her mind has become. As a mother (albeit, a new mother), it was heartbreaking to read about Reta's many attempts to try and resolve her daughter's pain, while not knowing what has caused her deterioration in the first place. Sheilds handles this delicate topic with such wonderful sensitivity and intelligence; it is truly remarkable.The reason for Norah's withdrawal is revealed, finally, you'll be glad to know. I was so desperate to find out what happened to this beautiful, intelligent and kind young girl, both for her sake and for her family's. Some readers may be disappointed to find that the truth is only exposed just a few pages from the end of the story, and is almost glossed over, carrying not nearly as much weight as the mystery that has been built up within the book's pages. For some, this may be seen as a flaw in the structure of the book, but I saw it as a delicate handling of a situation that shows that Rita's response and insights to her family crisis are far more brave and moving that the crisis itself.Unless is such a unique and daring novel. Shields was such a master at writing extraordinary fictions about ordinary lives. While this can be described as a story of domestic ordinariness, it is told with great poignancy and great wisdom. While so many authors write about characters, Shields writes about lives; small, quiet habits tied up with important issues and insightful meanders of the mind.Unless was Shields's last book (she died from breast cancer the year after this book was released) but it won't be the last one I read by her. A wonderful and moving story with intelligent and thought-provoking discussions of what it is to be female. Highly recommended."}, {"userName": "C.", "userReviewDate": "Aug 14, 2008", "userURL": "http://www.goodreads.com/user/show/1425694-c", "userReview": "Unless is really quite good. And I really mean quite good, not brilliant, not bad, but quite good. It's quiet and peaceful and pretty and enjoyable without being mind-blowing. It is full of beautiful moments, and the language is really nice. It is subtle. In fact, it's so subtle that it's difficult to work out why it works as well as it does. Maybe I'll just let the text do the talking.\"I'm not interested, the way some people are, in being sad. I've had a look, and there's nothing down that road. I wouldn't reply, as Anna Karenina does when asked what she's thinking about: \"Always about my happiness and my unhappiness.\" The nakedness of that line of thought leads to a void. No, Ms. Winters of Orangetown much prefers the more calculated protocols of dodging sadness with deliberate manoeuvres. She has an instinct for missing the call of grief. Scouring the separate degrees of innerness makes her shy. A reviewer... charged...me with being \"good\" at happy moments but inept at the lower end of the keyboard. Well, now! What about the ripping sound behind my eyes, the starchy tearing of fabric, end to end; what about the need I have to curl up my knees when I sleep? Whimpering.\"I picked this paragraph pretty much at random from among the pages I marked as having standout passages, and it's an excellent example of Shields' prose. Unless is about the protagonist Reta Winters' struggle to cope with her daughter Norah's withdrawal from society. One day, for no reason that her family can understand, Norah leaves her steady boyfriend and seemingly happy life as a student at the University of Toronto to take up a position on the footpath, begging for alms and wearing a cardboard sign with the word \"goodness\" written on it around her neck. Reta Winters is a translator and writer of 'light' fiction; Unless follows the parallel journeys of Reta and the protagonist of the book she is writing until both reach their respective conclusions. In the sort of trick that some might call silly, naff or cheap but that makes me want to squee, Unless embodies the uncertainty and conditionality encoded of the sense and connotations of the word 'unless'.Thanks to its subject matter, this book immediately reminded me of Phillip Roth's American Pastoral (both are about a daughter performing an act that is shocking and seems completely out of character and her family's attempts to deal with it), and I originally wanted to write a comparison of the two, but I'll admit that it's been too long since I read American Pastoral and that I also just can't be bothered. In brief, though: for all the similarity of the plots, the two are very different. American Pastoral is \"raging and elegiac\" (in the words of the reviewer who is quoted on the cover of my edition) - it is anger, a cry of despair and why?? that echoes in my head even now. Unless is totally different. It is quieter and more restful, but no less meaningful and potentially heart-wrenching. But then, I went back a few weeks later and found it beautiful. Not 'quite good', but excellent."}, {"userName": "Allison", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/27047099-allison", "userReview": "The novel I wish I'd written. So many times in the book I thought \"YES!\" and \"Well put!\" and \"Why can't I articulate like Carol Shields!? This is exactly how I feel!\"I loved this book, which I ignored for many years for some reason. No idea why, as I loved The Stone Diaries. While this one is different, it is equally as beautiful, and even more intellectual and precise. This is a book I'll save for my daughter, and one that I wish my husband could read, but I doubt he'd get it, which is, of course, the irony of the book itself!I kept thinking of Elizabeth Hay and Rachel Cusk as I read Unless. These are two similar authors that I have loved, and would recommend to readers who enjoyed this book."}, {"userName": "Carolyn", "userReviewDate": "Jul 28, 2008", "userURL": "http://www.goodreads.com/user/show/380782-carolyn", "userReview": "this was the worst book ever. i thought the premise was interesting (the back cover describes a story of a mother who's eldest daughter gives up her college life to live on a street corner wearing a sign that says 'goodness'). the daughter is barely mentioned, however the mother goes into nauseating, never-ending whining about her writing career/lack of writing career.... it's horrid. i kept waiting for her to go into more detail about the daughter, but it never happened. needless to say, i gave up on it as i couldn't stomach the last few chapters of pointlessness.i'm actually going to throw it away, it was that big of a waste of time."}, {"userName": "Carole", "userReviewDate": "Mar 31, 2014", "userURL": "http://www.goodreads.com/user/show/8276857-carole", "userReview": "I read Unless about 10 or 12 years ago when it first came out. I know that I enjoyed it then but I am so glad that I decided to read it again because I had forgotten how much I loved this wonderful book. On the one hand, this is the quintessential feminist novel, exploring the many ways in which women are invisible in our world. At the same time, Shields muses about the art of writing fiction, presenting the thoughts of her writer main character as an obvious reflection of her own philosophy on this subject. Amid these reflections, the central plot of the story, her daughter Norah's story, is related as a page-turning thriller which the reader reads compulsively to find out the solution to the mystery of Norah's behaviour. Throughout, the novel is spiced with many touches of dry, witty humour particularly the conversations with her editor, Arthur Springer.How does she put all these disparate elements together? Brilliantly! \"A life is full of isolated events, but these events, if they are to form a coherent narrative, require odd pieces of language to cement them together , little chips of grammar (mostly adverbs or prepositions), that are hard to define, since they are abstractions of location or relative position, words like therefore, else, other, also, theretofore, instead, otherwise, despite, already and not yet.\" Shields uses these little \"chips of grammar\" to link all the elements of the narrative together and of course, the most important one is \"unless\"."}, {"userName": "Mary Novaria", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/2623473-mary-novaria", "userReview": "Unless, a novel by Pulitzer Prize winner (for The Stone Diaries which I've just ordered!) Carol Shields was published in 2002, the year before her death from cancer. Somehow, I missed this author until a friend recently (and thankfully) lent me her copy of Unless which, even at almost 10-years-old, is as contemporary and astute as anything written today. Isn't that kind of relevance over time one of the characteristics of a truly great story? Things are going swimmingly for Reta Winters until a crisis with her eldest child interferes. With rare eloquence, Shields gives voice to Reta’s doubts, fears and love for her family. While trying to navigate her role as a mother, Reta also is nurturing her latest novel. Her profound compassion and feelings of confusion about Reta's own life help her more fully develop her fictional characters—whose lives she then must defend to a quirky new editor. Perhaps the core exploration of Shields’ book is the concept of “goodness.” Without giving away key elements of the plot, let’s just say that Reta tries to discern what goodness means to her, to her forlorn daughter and to the world. One might say that goodness translates to love; without sacrificing literary values for sentimentality, love is at the heart of Unless."}], "description": "Reta Winters, 44-year-old successful author of light summertime fiction, has always considered herself happy, even blessed. That is, until her oldest daughter Norah mysteriously drops out of college to become a panhandler on a Toronto street corner -- silent, with a sign around her neck bearing the word \"Goodness.\"--back cover", "title": "Unless", "url": "https://www.goodreads.com/book/show/74462.Unless", "average": 3.63, "cover": "https://images.gr-assets.com/books/1525169040l/74462.jpg", "reviews": 950, "authors": [{"url": "https://www.goodreads.com/author/show/12034.Carol_Shields", "name": "Carol Shields"}], "type": ["Fiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/74462.Unless", "http://www.goodreads.com/book/show/1099694.Unless", "http://www.goodreads.com/book/show/474021.Unless", "http://www.goodreads.com/book/show/3283770-unless", "http://www.goodreads.com/book/show/74465.Unless", "http://www.goodreads.com/book/show/1355260.Unless", "http://www.goodreads.com/book/show/18480015", "http://www.goodreads.com/book/show/956199.Unless", "http://www.goodreads.com/book/show/8214112-unless", "http://www.goodreads.com/book/show/496333.Unless", "http://www.goodreads.com/book/show/77554.The_Stone_Diaries", "http://www.goodreads.com/book/show/356768.Larry_s_Party", "http://www.goodreads.com/book/show/31678.Jane_Austen", "http://www.goodreads.com/book/show/368503.The_Republic_of_Love", "http://www.goodreads.com/book/show/368499.Swann", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}