{"ratings": 2674, "userreviews": [{"userName": "Paul Nelson", "userReviewDate": "Jul 25, 2015", "userURL": "http://www.goodreads.com/user/show/7553206-paul-nelson", "userReview": "Urban Gothic is a full on screaming, head caved in with a hammer, fingers bitten off by a monstrous dwarf kind of horror that is fucking wincingly good horror and a barrel load of fun. This is the Wrong Turn horror films diverted into a suburban street in Philadelphia and landing up in a house that has more doors, passages and secret rooms with murderous psychos than Horror Kill House 16: Revenge of the freaks. If you want to be chased round by an grotesque 7ft monstrosity named Nigel, wielding a hammer that’s too big for little Thor and loads of other friendly aberrations then you've come to the right place.A totally riotous, tortuously enjoyable horror that has humongous big and tiny freaks chasing down the usual bunch of young kids on their way to score some weed after a concert. Throw into the mix a copper plunderer who definitely picked the wrong house to rip off, stupid boy and a bunch of neighbours looking to launch a rescue mission. And we have all the ingredients for some good old fashioned horror, plenty of outrageous violence and loads of fun. Not a classic but what do you want, it does the job and does it very well.A 3.5* RatingAlso posted at http://paulnelson.booklikes.com/post/..."}, {"userName": "Dirk Grobbelaar", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/3102740-dirk-grobbelaar", "userReview": "At night, there were monsters on the streets.And even worse things in the shadows.Ick! What a macabre freak show. This novel is, quite simply put, a gore-fest. Or a crash course in taking an already terrifying situation, and making it worse. Oh, so much worse.Bloody saliva dripped from his open mouth, leaking around gums that had receded from his black, broken teeth.This is horror stripped down to the bare nuts and bolts. Is it frightening? YesIs it bloody? YesAnd that is the gist of it.The woman’s skin wasn’t her own. She was wearing someone else’s.Brian Keene is pretty well known in horror circles, particularly for novels like Ghoul and The Rising. I’m not entirely sure where Urban Gothic fits into his repertoire. I will give him this though: despite the fact that the gore is over-the-top and events sometimes play out plainly ridiculous, it never really feels like he’s trying too hard. This is nothing short of a miracle, given some of the twaddle that goes down here. Perhaps this is more of a homage to splatterpunk than anything else, and should not be taken too seriously? ”Don’t know how he keeps from cutting himself on the skull fragments. Them things can be sharp.”The Good, the Bad & the UglyThe Good – it’s Brian Keene, and it’s horror, and it’s got deformed freakazoid cannibal mutant thingsThe Bad – brainless characters (often literally – ho ho) and “scares” that alternate between ridiculously silly and frankly disgusting; it’s way too OTT to be genuinely scaryThe Ugly – what, you’re even asking? There’s a lot of ugly in this book“Don’t be stupid. You can’t milk a man once he’s dead.”I would have liked if goodreads allowed for a rating out of 10, or at least half-stars. I would have liked to rate Urban Gothic 5/10, or 2.5 stars. Now I have to settle for either 2 or 3, neither of which particularly appeal to me. To be fair though, Urban Gothic never pretends to be anything other than a (rather hardcore) horror novel (what were you expecting, after all?) so I am giving it the benefit of the doubt by rounding my rating up (and not down).Something warm and wet squished between her toes.In conclusion: if you’re a horror aficionado (with a high gross-out tolerance) and the thought of, for instance, heads bursting like overripe watermelons doesn’t make your stomach churn, or if you’re not averse to an antagonist wielding, for instance, an enormous pus-dripping manhood (don’t ask) then read this book. Everybody else: stay away, stay way away. ”Let your insides slip out and show you what they look like, all wet and shiny. Ever strangled a man with his own intestines?”"}, {"userName": "Kasia", "userReviewDate": "May 02, 2010", "userURL": "http://www.goodreads.com/user/show/2087548-kasia", "userReview": "I have dreamt about reading this book for months and once I got it I read the sucker in half a day. The good part - it's full of icky, gross horrific stuff that makes horror books fun, the not so good part - I wasn't crazy about it. The character development was shallow and maybe if the six kids who get stuck in the bad part of town at night weren't so stupid and lame, I would have liked the book more. It's hard to relate to someone who acts in a way that gets them in trouble in the first place, not to mention I could hardly tell them apart, yes they had different names but they were mere filler in the book, something for the monsters to snack on, fish food I guess one could say. And if I wanted to read a book about fish food I would have shopped in the marine biology section of Amazon, not the non existent horror section. Basically a bunch of white kids get stuck in the ghetto and when confronted with another human being that doesn't look like them, they freak out and end up making a grave mistake. They run into an abandoned house and find that they can't get out, but that's not the worst part. They are not alone in the house, and what they encounter makes them shriek, about forty times for each person, that action is repeated through out the book. Fans of \"Hills Have Eyes\" and those who love vile descriptions will enjoy, to me it felt more like a way to take up pages, but didn't build the story into something great. The parts of the book where someone is mourned were good, those little bits of misery and missing the dead person made them feel real, but when alive, the kids weren't so interesting. Fewer characters but with better development would have shined. I didn't get the dark gothic part of this, the urban part yes but the cloying, eerie intensity was not there, it was more of a teen outing gone wrong.Keene has slowly emerged as the recognizable name in horror, I personally look forward to his books and stories, my favorites were \"Dead Sea\" and \"Dark Hollow\" but I felt that this book lacked that special something, at least for me. I know that Keene doesn't let his audience dictate his craft, but I could clearly see the lack of juice in the novel when I read Ketchum's \"Cover\" the next day, the difference was night and day. \"Cover\" flowed and entertained with writing that was easy to absorb while this felt like I was following words written on the page. I thought of giving up on \"Urban Gothic\" half way through but decided to stick to it and just finish it, honestly I didn't get into the story until I got to page 260 which was the ending to my favorite chapter, the one that really grabbed me. Too many additions, unnecessary characters ( give us less and it will be more) and hastily finished resolutions to few things in the book that took away from the story were just few of the problems that I had with it. To each his own of course, some will love this some won't, I simply wouldn't want to read it again but I will definitely buy his next novel, after all horror is hard to resist when you really love it."}, {"userName": "TK421", "userReviewDate": "Mar 31, 2010", "userURL": "http://www.goodreads.com/user/show/2624672-tk421", "userReview": "Haunted houses litter the horror genre, but URBAN GOTHIC, by Brian Keene, takes the subject and slams it on its head. Ya see, this starts off as if this is your garden-variety haunted house tale. That is until you meet the residents of the \"haunted house\". Ya see, this house is full of backwooded-hillbilly-cannibals that are thirsty for some fresh meat. (Oh, I forgot to mention that it is located in da hood.) And these BHC are so grotesque from inbreeding and lack of sunlight that they are not soon forgotten. (Drop me a line after you've read Zed's conversation with one of the gals about a certain garment one of the guys was wearing.) From the initial scence of violence (I wish I could tell you about it, but it soooooo much better read with virgin eyes), the pace hardly ever lets up. There are a few moments where Keene tries to get political about the state of some neighborhoods in America, but these are few and far between and don't really serve a purpose in this book. The real story is watching if this group of kids can survive the night. If you haven't experienced Keene's work before think of it as a montage of (early) Stephen King, Edward Lee, Bentley Little, and Jeffery Deaver. Recommendation: A good read if you have an afternoon (or, if brave enough, a night) with nothing else to do."}, {"userName": "Bill", "userReviewDate": "Oct 21, 2011", "userURL": "http://www.goodreads.com/user/show/5846407-bill", "userReview": "\"Shit happens.\"That may be a wee bit of an understatement for the unfortunate group of friends who get trapped in a house filled to the brim with a brood of deformed cannibalistic penis pus dripping, leathery vagina human skin wearing giants and mutant midgets bearing knives, razor sharp teeth and a taste for human flesh. That will teach them to have their car break down in the hood.As a Brian Keene homage to Edward Lee, I went into this one expecting pretty much what I got and honestly, I kind of liked it. It was bloody disgusting to start with and then it got bad. For a no-brainer, splatter, gross out fest drenched with blood and bodily fluids, this right here, boys and girls…is your huckleberry.3 Nipple Ripping Skug Titty Twisters!!"}, {"userName": "Not Now...Mommy's Reading", "userReviewDate": "Feb 28, 2010", "userURL": "http://www.goodreads.com/user/show/1185550-not-now-mommy-s-reading", "userReview": "Originally published on Not Now...Mommy's ReadingI just finished \nUrban Gothic\n today. It starts off interestingly enough, six teens from the suburbs are leaving a hard core rap concert when they decide to take a detour through the seedier parts of town to score some weed. Of course, teenagers + hard core rap + drugs always equals a bad idea and this is confirmed when the teens end up with a flat tire and are soon approached by another group of teens whose attire of sagging pants, gold chains and hats to the back clearly indicate that they are not from the suburbs. I chuckled a bit to myself as I read this confrontation because I knew that things were quickly about to get out of hand due to prejudices both groups had towards the other going in. No sooner had I thought it, the ever controversial N-word was thrown out which resulted in the suburban teens bolting into the abandoned house at the end of the block. The teens soon found out that this house is not abandoned and they would have had better luck facing the crowd outside on the streets than the foes that lurk within the walls of the house.This was a decent read. I managed to complete it in three days. What kept it from being a good or a great read to me were too many unanswered questions. Like who were these mutants? Where had they come from? How had they come to be? Were they actually human at one point? Were they just cannibals that laid waste to whoever was unlucky enough to stumble into their abode? At one point, I thought that one of the mutants might have actually been a human who had been allowed to live in exchange for breeding purposes but I never got any clarity on that. Also, it was hinted at that some of the teens had a back story that would have given them more depth or made them a bit more interesting but it was never explored. For example, Javier and the terrible things he had lived through before. Ummm, like what? I understand that I couldn't get a whole story on each one but instead of reading about a penis dripping pus and blood - maybe a scene that showed me why I should care about any of the six other than that they were human and didn't deserve any of what they had to deal with. Just something.Nonetheless, I still rank Brian Keene among my favorite horror authors. The only legitimate gripe I had with this book is the usage of the term \"All of the sudden\". This has been occurring in more and more novels and...PLEASE, FOR THE LOVE OF THE GODS, OLD AND NEW, STOP IT!!! \"ALL OF THE SUDDEN\" MAKES NO SENSE. NONE. STOP USING IT. IT'S \"ALL OF A SUDDEN\".IT WILL ALWAYS BE \"ALL OF A SUDDEN\". STOP TRYING TO MAKE ALL OF THE SUDDEN HAPPEN!!! Seriously, though. Stop."}, {"userName": "Liz", "userReviewDate": "Aug 27, 2010", "userURL": "http://www.goodreads.com/user/show/1233422-liz", "userReview": "I don’ t know why I got so link-happy in the review.How to describe Urban Gothic? In a word: icky.The premise: Six white teens from the suburbs are returning home from a concert when they end up lost in the ghetto of Philadelphia. Their car breaks down in a dangerous neighborhood. When they’re approached by a group of black teens who act in a threatening manner. One of the white teen panics, calls them the ‘n’ word, and runs.Sidebar: This didn’t ring true for me. Believe me when I say that this is not a complete criticism; in today’s schools and society enough white guilt is taught that the use of that word wouldn’t even be part of the active vocabulary of an upper middle class white teen. Not that I think they wouldn’t know that word, I just don’t think it would be used. But perhaps I’m naïve; I just know that my lower middle class friends and I wouldn’t have used it. End sidebar.The slur has its expected effect though, the white teens start running and the angry (and as we find out later, hurt) black teens chase after them. The white teens head for a creepy, old, Victorian style house at the end of the street. They go inside and the mayhem begins. Almost immediately the way out is barred and one of them is decapitated.What they find in the house reminded me of the movie Bleeders (http://bit.ly/bYOrPo) a little. Inbred, animalistic freaks that enjoy eating humans begin to hunt them through the large house which has secret passages, sliding walls, and booby traps throughout.Except this is much, much, much more disgusting and violent. And seriously, perhaps I’m a bit impulsive, but if I was trapped in a house of mutant, cannibalistic freaks with little hope of survival and I had a lighter – well I wouldn’t see much harm in setting the place on fire. Or one of the mutant cannibalistic freaks. Seriously, Let’s Start a Riot! http://bit.ly/UqwYEI must congratulated Mr. Keene on creating some truly unsympathetic villians though. On the downside, note that I haven’t mentioned a single character name. It hardn’t matters; there isn’t much personality to be found here.Meanwhile, outside, the black teens who hadn’t meant to scare the kids so badly are feeling guilty. The house at the end of the street, to borrow a phrase from Shirley Jackson, “was born bad.” http://bit.ly/21zGBf. Or at least they know that nobody in the neighborhood goes near it, not in their generation and not in their parents. However, despite the fact that they were called a bad name, they feel guilty that their intimidation sent the other teens charging into the house of unknown evil. They go to an older neighbor’s house to place a call to the police which goes unanswered (not uncommon in this neighborhood). While waiting for help that never comes, they finally decide to go offer what help they can.Bottom-line: If you want to read about humans fighting for their lives in horrific circumstances, this is indeed the book for you. If that doesn’t appeal to you, give it a miss. As for me *sob* I’m going to go read something by Dr. Seuss or Laura Ingalls Wilder."}, {"userName": "Marvin", "userReviewDate": "Oct 05, 2011", "userURL": "http://www.goodreads.com/user/show/2160536-marvin", "userReview": "This flashback to the splatter-punk days of horror novels is a difficult book to compare to other horror novels. Why? Because all I can think of to compare it to are movies. Indeed, it feels like Roger Corman was looking over the author's shoulder and saying \"Here's some money. Come back in 15 days and give me a script\". Urban Gothic ends up being a bloody mixture of movie ideas: The People Under The Stairs meets The Hills Have Eyes meet every other mutant cannibal movie.Not that this isn't any fun. It's a riot. Spoiled teens trapped in haunted ghetto house with cannibal mutants. There are some nice social messages at the beginning. But pretty soon they get lost in an orgy of blood and gore. This one is for the hard-core horror fan who thinks victims slipping on their own intestines is funny. Personally I'll stick with Keene's end-of-the-world novels and chalk this one up as an amusing detour for the author."}, {"userName": "Pierre", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/24075907-pierre", "userReview": "A splatterpunk gore fest. If you like cheap, cheesy gore filled horror movies, then you should like Urban Gothic. Not the best novel I have read by Brian Keene but nevertheless entertaining and excelling at descriptions of gore. The ending is rather abrupt and anti-climactic after going through the harrowing underground pursuit."}, {"userName": "Todd Charlton", "userReviewDate": "Aug 20, 2011", "userURL": "http://www.goodreads.com/user/show/5963567-todd-charlton", "userReview": "Brian Keene channels Richard Laymon with Urban Gothic. At one point he even uses Laymon's favourite word as a homage \"rump\". The thing is, Keene out-Laymons Laymon here. Urban Gothic is a major achievement. The pace is break-neck throughout and you come to care for the characters as they deal with horrors scarcely put to paper. It is ultra-violent; one character dies in a way I have never read before; but shit when you run into a whole subterranean cannibal civilization there is bound to be blood. Some of the characters reminded me of that film from the 1930s Tod Browning's \"Freaks\". Only Keene's things that breathed and consumed were much more frightening. And the ending is satisfying, a place where many authors seem to stumble after a great ride.The best tribute I can give to the book is that yesterday I was at the supermarket and I smelled something rotten coming from the storeroom. It immediately reminded me of Brian Keene's Urban Gothic.The best Brian Keene book I have read to date."}, {"userName": "Logan", "userReviewDate": "Sep 13, 2009", "userURL": "http://www.goodreads.com/user/show/1961707-logan", "userReview": "I started reading Brian Keene with \"Dead Sea\", which I really enjoyed. It changed up some Zombie conventions (species hopping, etc.) and had a realistic, well developed protagonist. While everyone was an archetype, it also acknowledged that flat out, which was funny. Unfortunately, the past few offerings have fallen flat for me. This book was pretty much crap. As I read, I felt as though I was reading the script of a film that I would decry as symptomatic of the ruination of the horror genre. Writing genre fiction, I admit, means writing for a specific audience that wants specific things. This is just a lazy attempt at placation. Additionally, one thing that has really irked me has been Keene's recent reliance on rape of female characters. Rape is definitely a scary thing, but using it, repeatedly, in every book, as part of the eventual fate suffered buy his consistently 2D female characters is just gross, and not in a gory, horror way.On a positive note, I think Brian Keene writes about race and race relations better than your average academic-his writing is clear and accessible or novelist-not relying on sterotypes. He portrays his characters of color as real people, instead of ridiculous \"urban\" stereotypes perpetuated by most American media. It's also great to see the black guy come out the hero, instead of being offed in the first act, as is typical of the genre.I was also surprised, after reading many reviews exclaiming \"OH MY GOD, SO GORY!\" to find this as really no more gory than his usual fare. At least limitless gore could have redeemed this dull tome. This is strictly by the numbers twaddle. I won't call it hack writing, b/c Keene is still a step above the genre rabble, but it comes damn close."}, {"userName": "Tressa ", "userReviewDate": "Jun 02, 2009", "userURL": "http://www.goodreads.com/user/show/226335-tressa", "userReview": "I'm not going to say too much about this book, except that I didn't care enough about the characters to not flip to the end to see what happens. It ended the way I thought it would. This has your typical teen horror movie plot: kill the young, good-looking people off one by one, making each killing more gruesome than the next. Zzzzzzzz.And how did such mutants come to live even in a ghetto where people keep to themselves? You would think that after 20+ years of people in the neighborhood missing, someone would have torched the place late one night. Who's going to stop them? The po-po? And in just two or three generations 7-foot tall deformed creatures and dwarves with all kinds of weird, disgusting disfigurations were bred?Loved Keene's zombie novels and Conqueror Worms. The excerpt from Darkness on the Edge of Town looks promising. I might give that one a look when it comes out."}, {"userName": "Justin", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/5067007-justin", "userReview": "This was a decent read if you are just looking for a kill em all splatterfest of a novel, don't expect any questions to be answers though, except for who will survive and what will be left of them. It was by far the goriest most depraved novel of Brian keene's that I have read and I have read most of them. It had some original and grewsum parts in it that made it stand out from similar novels."}, {"userName": "11811 (Eleven)", "userReviewDate": "Oct 25, 2010", "userURL": "http://www.goodreads.com/user/show/4460829-11811-eleven", "userReview": "My IQ dropped nine points over the course of this novel."}, {"userName": "Karl", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "This hardcover book is copy numbered 64 of 300 published"}, {"userName": "Melissa Helwig", "userReviewDate": "Jan 16, 2010", "userURL": "http://www.goodreads.com/user/show/1133853-melissa-helwig", "userReview": "Being a huge Brian Keene, fan I had been looking forward to Urban Gothic for months before it was released. But it took me almost six months to finish reading it. I got halfway through and gave up. It actually turned me off horror for awhile and made me wonder why I preferred gore and monsters over interesting characters. I don't, what I want is for my horror novels to have it all: fascinating characters that I don't want to see die, monsters and gore. But Urban Gothic focused more on the characters' torture than on their description and development. Eventually I got back to reading Urban Gothic (obviously, or else I wouldn't be reviewing it now) and found the second half to be better than the first.Three young couples attend a rap concert and on the way home their car breaks down in a bad neighbourhood. When a group of young black men approach them, they become frightened and run away, hiding in an abandoned house. Or so they think - the house is actually inhabited by a family of mutant creatures.The plot is a familiar one, but I didn't mind because it's a plot I love (almost) every time I encounter it. It's similar to Brian Keene's last novel, Castaways, which was also about monsters killing and eating people, but had a different setting (a tropical island).The pace moves fairly quick, having the first mutant sighting/teen killing by the end of Chapter One. But the teens' efforts to hide or escape get old fast. Eventually Urban Gothic becomes dull and monotonous, which was the point I stopped reading. But when I picked the book up again months later, I was surprised to find that it wasn't as bad as I remembered. And it introduced a few fresh plot developments (killer mutant babies, for instance), which kept me reading to the end.As I already mentioned, the area of the novel most lacking are the characters. Keene gives virtually no back story on them, making me careless about what happens to them and wonder why I should read any further. And because of this, I couldn't tell any of them apart. I spent the entire novel trying to identify Kerri from Heather, having to flip back to previous chapters to remember.But I liked the group of black young men. They were the only interesting, non-stereotypical characters in the story and Urban Gothic would've been better if Keene focused on them more instead of the teens. And I did find the mutants (and mutant babies) disturbing.It's not a bad novel, especially if gore interests you more than compelling characters. But if you're looking for a good mutant cannibal novel, I would stick with Ketchum's Off Season.Read more of my reviews at http://littlemisszombie.blogspot.com"}, {"userName": "Reese Copeland", "userReviewDate": "Jul 08, 2011", "userURL": "http://www.goodreads.com/user/show/1736146-reese-copeland", "userReview": "This was the first book I read by Brian Keene. I absolutely loved it! It was very raw and chock full of absolute terror. Situations and experiences of the characters I would never have thought of before, but written in such a masterful way that you just can't stop reading. Sick as what happens to the characters is, you just keep reading hoping they will find a way out and it will be a happy ending. This is one reason I love the book so much. It's not a happy ending. The people in the \"bad\" neighborhood seem to come together to fight a common cause, the house. I like how the ending is left open as to what happens to the residents of the house. This type of ending would drive others batty, but, I really liked the ending. THere is not a huge character deveopment, but, with some characters, such as Javier, there is some self examination, looking inward. That part I liked. It's not the type of story where you really want to see the \"growth\" of a character. The lone survivor of the story of the original kids who made it in, I did not see surviving. The one I expected to survive, well, they didn't make it. I like how the story leads you to have certain expectations, then takes that away. All in all, an incredible read. First time I've read Keene, I can say, I'm a fan! I will be making an effort to check out his other titles."}, {"userName": "Unapologetic_Bookaholic", "userReviewDate": "Oct 13, 2009", "userURL": "http://www.goodreads.com/user/show/1125077-unapologetic-bookaholic", "userReview": "The story begins with 6 best friends running through an urban neighborhood to a haunted house. 3 paired off couples. As with most[any:] Brian Keene novel the action waits only for you to turn the page. To say who dies first and who survives would give away a GREAT horror story, so I'll just say that the flesh munchers had crude weapons but imaginative deathes/tortures for their victims. An honorable Ob mention, hats off. The creature/horror/monster in Urban Gothic are described at best as mutants, at worst as homacidal limb ripping pus-infected genitals and sores. If I for one moment thought 'Ah God they have gone and put torture porn to page.' I would have sadly have to leave my first ever Brian Keene novel unfinished. But...just as he can bob and weave through 6 main protaganist characters and dozens psyche and then ruthlessly chop them down to bite-size. The antagonist are able to taunt their victims verbally, phsyically and mentally throughout a house outfitted to maim. Some parts of the story were abit fanstatic because it was a house in an urban setting but if I just switched over to that 'suspending belief' mode, I was OK. I won't get to fancy with my thoughts on this book. I love the author. He provided me an evening of leisure horror and again another keeper added to the growing Keene collection."}, {"userName": "Joshua Buhs", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/17746077-joshua-buhs", "userReview": "Straight-forward pulpy horror.Like the rest of the book, the title is not shy about itself. Keene shouts his attention. The book is meant to be understood int he gothic tradition--though it is fully, brutally horror--and harkens back to the progenitor of the genre, Horace Walpole's Castle of Otranto. But Keene also wants this to be a twist on the tradition, and so it is not set in a moldy castle, but in the heart of Philadelphia's ghetto. The action takes place in (and below) a haunted house in the midst of crumbling rowhouses.The book starts out luxuriating in clichés: privileged white kids, coming home from a concert, get lost in the most run-down part of Philadelphia; their car breaks down; they are confronted by a gang of black teens. They run for cover in the house no one ever enters--no one except crack addicts and the homeless, who never come out again. With in minutes, we meet the first of a huge cast of villains, a hulkish mutant who murders two of the six white kids in mere moments, the rest scattering.One need only have read one or two books by Keene to know that he will subvert some of this set up quickly enough--he was in the pulp tradition, but adapting it, too: hence urban gothic. In this case, we leave the white kids and flash outside to the black youths. They weren't a gang at all, just a bunch of teens who were fronting a little bit but were eventually going to help. They have no guns, do know drugs. More still, they are heroic.Over the course of the rest of the book, the narrative will flip back and forth between the various kids in the house, and their horrific encounters, following them as they split up and come together in new combinations, and the kids outside the house, and their attempts to get the police (but the police never come to this neighborhood) and, later, enroll an older man to help break into the house.In terms of building tension, of keeping a narrative flowing, of hinting at (but never really developing) character, Keene is excellent. I refer to him as working int he pulp tradition, which sounds like a slight, but isn't. Yes, many pulp stories were bad. Sturgeon's Law, though, is harsh--but egalitarian. Ninety-five percent of everything is crap. The good pulp, however, the remaining five percent, developed a form of addictive, straight-forward story-telling with techniques that should be admired. Keene has mastered these, and he tells good stories.This one, though, is hard to take at times. Part of that is the imagery--it is the story's intent. What horror does is render--the pun here is apposite--the body into its constituent parts, to reduce it to meat. Usually this descent from mind to body parts stops for a time to admire the body--thus the ubiquitous sex scenes in slasher films. (Carol Clover says that pornography is the surface, horror exists below the surface.) Keene mostly avoids this, though; there is a bit of sexual tension here and there. Sex is a (threatened) horrifying weapon. But mostly the idea of the body as beautiful is only remembered, as it is being torn apart.The old pulp editor Rogers Terrill is useful here, too: \"Horror is what a girl would feel in watching something from a safe distance. Terror is what she would feel if she knew she were the next victim.\" This book isn't terrifying--the situation is too ridiculous--but a kind of voyeurism in which the reader is forced to watch as bodies are mangled, dissected, repurposed. There's a truly horrifying (there is not other word) beheading about half-way through the book that will live on in my nightmares forever.Other parts of the book are hard to take not so much by intent, but as side effects of technique. In the books of his I have read, Keene likes to present a horrific situation (or a terrifying one, or an uncanny one, a disconcerting one) without too much explanation. He comments on that directly in this book a couple of times. Shit just happens, we don't really know why. That's a legitimate point, and makes the stories scarier in some ways. But here it works against him.It is not a spoiler to say that the kids in the house discover it is inhabited not just by one mutant--that giant's name, we learn, is Noigel. Read that backwards and you'll get a sense of just how many there are. Hundreds of them living in a cave under the house--echoes of Walpole. It is quite literally a hell, with horrifying descriptions; the mutants are as depraved as one can imagine. But the lack of explanation for them makes the story not quite work. On the one hand, they have apparently existed in this area for hundreds, if not thousands, of years. Many of them have no language at all.Others, though, speak in a terrible comic-book voice, with traces of racist Native American tropes (they did predate the current houses . . . ) but also the voice of the hulk and other nincompoops. All the horrifying descriptions then sometimes crash against ridiculous dialog. The problem is at its worst with the mutants and their silly ways of speaking, but even early on the dialog is sometimes clumsily exposition-heavy.Not explaining how the mutants haver survived all this time, though, how their society operates, makes other dialog even more confusing. A few of the mutants speak easily, and these use contemporary American slang. How? If they spend most of their time in this hideous Hell, how have they learned to talk about skull fucking? Why would the worst insult they think of be the same as the worst insult of sexist American society: calling someone a bitch? They should have their own norms, their own language, their own idiosyncrasies. With these, they would feel that much more ominous, that much more real. Without them, they feel cartoonish, inventions so that Keene could describe his Grand Guignol.Because pulp-style storytelling is so streamlined, its message is usually very easy to understand. Sex is dangerous. Reproduction is hard. Mind your own business. These aren't really morals as much as homilies. But they depend on the very basic (in the sense of vulgar--another apposite pun--or fundamental) forces and imagery. If one wants to twist them, it is necessary to pay attention to how the elements re-align. It seems to me that Keene might not be fully in control of the elements, and thus what he says and what he seems to want to say are at odds.The book includes a critique of government and how it has forgotten huge swaths of people. The police, the City of Philadelphia, have written off this ghetto, and provide it with no services. And so evil grows here--not drugs, not prostitution, but a genuine Hell. The solution the book offers--in the conclusion--is that the neighborhood needs to come together to root out the evil, to take care of it themselves. Fine--except that this undermines the original critique: it's not really the city's fault at all, not really the fault of the powers-that-be, but the neighborhood for ignoring the evil in their midst. The people that Keene wants to redeem--the gang of black teens, the old man who helps them--really are dangerous because they haven't pulled up their bootstraps and solved all of their problems on their own.It is unfair, however, to judge a book by its message. The book is constructed to end up where it did, a carefully built machine, but whatever the ending one can admire, as well, the skill that goes into that construction: because the book is also a machine for generating horror, and it does that excellently.If you want hard-to-stomach descriptions of bodies being decomposed, this is the book for you. It is true horror in that sense, hard to read, hard to turn away from."}, {"userName": "Eden", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/2263713-eden", "userReview": "Their car breaks down in a dangerous neighborhood in the city, Kerri and her friends begin to look for shelter. After being scared by some locals, they find a house that they thought was abandoned. And figured they would be safe there until the morning. They were very wrong.If you've got a weak stomach, this is probably not the book for you. Detailed and very gory. It starts out very much in the haunted house way, but this book is definitely not that. The house is way more than haunted. Couldn't really relate to any of the characters, but it was still a good read. Well-written and original. I really enjoyed it."}, {"userName": "James Brigham", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/14010394-james-brigham", "userReview": "This was like watching a blood and gore soaked version of Double Dare. Except less intellectually stimulating than that Nickelodeon staple."}, {"userName": "Wayne Simmons", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/1798859-wayne-simmons", "userReview": "A young group of friends seek solace in an old, ruined house after their car breaks down in inner-city Philadelphia. When the teenagers don’t emerge, a gang of local kids seek the help of disillusioned old stalwart, Perry Watkins, to lead the rescue party. But deep inside the house are monstrosities that neither local nor outsider can fathom...I’ve enjoyed several of Brian Keene’s horror novels prior to reading URBAN GOTHIC, his tribute to horror veteran, Edward Lee (here seeing re-release through Deadite Press). Keene once described himself as a blue collar horror writer. I love to read about ordinary people in extraordinary situations and Keene writes ‘working class’ (for want of a better expression) characters that are believable, flawed and engaging. URBAN GOTHIC doesn’t disappoint. It’s different to other Keene books, the gore and violence turned up to eleven, suitably paying homage to Lee’s famously uncompromising style. For the most part, however, characterisation is tight. The teenagers trapped within the old house do, at times, blend into one another, their universal plight to escape blurring individuality. However, it's the story of the well-meaning locals, led by jaded community leader, Perry Watkins and local youth, Leo, that grabs me most. These are typical Keene protagonists, their hopes, fears and baggage proving tangible to the reader as they argue (often in a rather comical way) over whether or not to help the middle-class white kids invading their neighbourhood.Fans of backwoods horror, such as DELIVERANCE and THE HILLS HAVE EYES, should particularly enjoy this book. The monstrous creatures within the house are as wildly eccentric as they are vicious, the pursuit of their prey vividly played out, with guts and peeled skin slopping around by the bucket load. There are cliffhangers aplenty, the kids’ fight to survive becoming more and more useless as they fumble their way along dark, dank corridors, a seemingly endless maze of blood-spattered hell. Torture features heavily, the creatures’ raison d’etre cannibalistic, the trapped kids forced to watch each other’s fates in full technicolour glory. But it’s not all grim, the heart of this story (being a community trying to rediscover itself, taking control and exorcising its own demons) reaching a satisfying and (dare I say) touching conclusion. URBAN GOTHIC is not a book for the faint-hearted. The gore is front and centre for the majority of the book, meaning those looking for nothing short of brutal may find it a challenging read. However, fans of a less compromising brand of pulp horror, such as that on offer from fellow Deadites Andre Duza and Wrath James White - and of course Lee himself - will definitely be pleased. Originally reviewed at: www.waynesimmons.org"}, {"userName": "Bill Walton", "userReviewDate": "Jun 02, 2013", "userURL": "http://www.goodreads.com/user/show/19911660-bill-walton", "userReview": "I was somewhat disappointed by this book, as I had just finished Darkness on the Edge of Town (by the same author), which I found to be a much more compelling and well-crafted piece.As the summary indicates, Urban Gothic revolves primarily around a group of teenagers who find themselves trapped inside an ancient house full of maniacs. So far so good. It was very atmospheric and creepy, and the initial character development was adequate.Without giving anything away, let me just say that I believe the author tried a little too hard to shock and disgust. Let me make it clear, this wasn't troublesome because the graphic depictions of violence upset me. I just encountered too many over-the-top portrayals of gore and horror that ended up pulling the curtain back a bit too far. That is, some of the scenes and dialog were cranked up to such a cartoonish extent that I, as a reader, saw the strings of the marionette and was pulled out of the immersive fantasy and found myself thinking about the author rather than the imperiled characters.Yes, some of the dialog was silly, unrealistic and distracting. Among several issues, characters who fell into and out of dialects (unintentional code-switching) for instance. After doing a little more research about the author, I found that in addition to writing horror novels, he writes comic books. I guess I can see that. Urban Gothic feels like a hybrid of a standard horror novel with a horror porn graphic novel like Crossed. Whether that's a good thing is, I suppose, somewhat subjective.To summarize, I didn't hate this novel. It was consistently creepy and disturbing (in a good way), but had some glaring issues that derailed it to an extent. I think the author, especially considering his superior efforts in Darkness at the Edge of Town, is a skilled, though perhaps uneven, author. In any case I intend to continue reading what he has to offer, as his bleak and relentless writing style tickle me."}, {"userName": "DJMikeG", "userReviewDate": "Aug 06, 2009", "userURL": "http://www.goodreads.com/user/show/2134262-djmikeg", "userReview": "I've read most of Brian Keene's mass market releases, and this is, without a doubt, the most extreme novel he has written. His first novel, \"The Rising\", rivaled the mayhem on display here, but didn't go quite as far down the gross-out road. This book wastes no time. Once the violence starts, only about 20 pages in, it doesn't let up for the rest of the book. Its beyond extreme, some passages had me shaking my head in disbelief, and I have a very high tolerance for this kind of thing. Some people have surmised that this book is Keene's homage to 'splatterpunk' and Edward Lee, but it actually bears many similarities to the work of Richard Laymon, who Keene saluted with his last book \"Castaways.\" This story in particular echoes \"Midnight's Lair\" and the climax of \"Funland\". This is definitely not Keene's best writing, and some of it really just feels like he was trying to outdo himself in the yucky department. His commitment to keeping the novel WAY over the top is admirable. There is also some very interesting social commentary tossed in here, as well. The fast pacing and endless shocks had me glued to the pages, and I read the book in less than 24 hours. Where \"Ghost Walk\" felt a little boring and also felt like maybe Keene had taken his 'Lehorn Hollow' mythos about as far as it would go, this novel is the polar opposite, the literary version of grindhouse horror movie. Its no \"The Rising\" or \"Ghoul\", but if you like Brian Keene, and you have a very strong stomach, you might want to check this out."}, {"userName": "Иван Величков", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/42554429", "userReview": "Голям кеф е когато преведат на български любим автор. Виждат се всички малки нюанси, които са ти избягали при четенето на чужд език. Или поне когато преводачът е Елена Павлова и преводът е малко по-добър от оригинала става така. “Градска готика” е единственият роман на Кийн излязъл на роден език. Царят на сплатъра доста се е постарал в него и затвърди убеждението ми, че Барайън Кийн започва от там където свършва Ричард Леймън. Движейки се по ръба на клишетата в жанра Кийн успява едновременно да ги разшири до космически висоти и да им се подиграе. В текста има дузини препратки, както към съвременни мемета, така и към класически произведения и десетки спускания в различни посоки, показващи, без да натрапват, висока езикова култура. Не се е сдържал и да отдаде почит на демоничния си пантеон на 13-те велики, макар и само с една реплика.Шест хлапета закъсват по средата на гетото и подплашени търсят убежище в изоставена къща. Какво ги очаква там, повярвайте ми не можете да си представите. Класическата ситуация със семейство мутирали канибали е пренесена насред мегаполис и е разтегната до цял един свят, грозен, мръсен и потресаващ.Знам, че авторът не обича да оставя “живи свидетели” в книгите си, но за пореден път ме държа на нокти до последната страница, надявайки се някое от хлапетата, които се бореха с зъби и нокти, да оцелее или поне да не умре по особено жесток и изобретателен начин. Никакъв шанс."}, {"userName": "Matt", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/7559863-matt", "userReview": "I haven't read horror in a good long while, so it was nice to have something that felt relatively new. The book admittedly started out rather slow, and the initial introductions of the key players made them seem like stock high schoolers about to meet some monsters. And to some extent they remain that way, but deep characterization really isn't the point of a horror novel; there's enough there that you can take an interest in the characters, relate to them, and keep track of who's who. While I admit that the book started slow, it does become rapidly engrossing once shit starts to go down, and from that point on I was hooked. Keene likes to use pretty graphic descriptions of filth and gore to raise the bile in his readers' collective throats, but it works in creating the decrepit and fetid atmosphere. Were there a concordance made for this book, I can only imagine the amount of entries there would be for the words \"blood\" and \"feces.\" But if you're looking for escapism in a horror novel this is a good place to turn to. Keene takes the classic haunted house full of things trying to kill and eat people and makes it fresh and interesting via the supporting cast, the course of events, and the perils he introduces. Some of the psychological aspects are a bit wanting, but if you let go and fall into the story, it's unlikely they'll turn out to be so distracting as to pull you back out again. It's definitely an enjoyable terrific, horrific romp."}, {"userName": "Mark", "userReviewDate": "Feb 01, 2010", "userURL": "http://www.goodreads.com/user/show/798905-mark", "userReview": "Six friends, white kids on their way home from a hip-hop concert, find themselves in car trouble, deep in a rundown black area of Philadelphia. The wrong choice of epithet leads to them sheltering in an abandoned old house, that contains more peril than anything they might have faced outside. Although Keene is a good writer who drags you along at a tremendous clip, this doesn’t stand up like his other books have and is very similar to “Castaways” (and feels more like a Richard Laymon homage, than the suggested Ed Lee). The characters are passable, the gore is good fun but the pacing is off, with far too much time spent in the dark cellars that quickly become so big the reader gets lost (and which makes one characters exit, later in the book, seem far-fetched). The mutants, generally, are well-done and their origins cleverly kept mysterious, but several speak excellent English, which sits oddly and one is called Noigel, which sounded too close to Nigel for me to take seriously. There are some good ideas, such as the house being some kind of entity itself, but these are allowed to peter out quietly. Not a bad book, by any means, but certainly not a Keene novel that I’d recommend to a first-time reader of his."}, {"userName": "Jill Franklin", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/56837703-jill-franklin", "userReview": "Okay, first just let me go ahead and get it out there........this book started extremely unrealistic and I wasn't so sure about it. The way the teens came to be in the neighborhood and enter the house in the first place......I mean, seriously? The teen characters were very unlikable, save from Javier, he was the only one I was genuinely rooting for. Mr. Perry and Leo, along with the rest of the \"gangters\" were my fave characters.That said, once they entered the house of hell and the story started rolling along, I became immensely engrossed. This was a fast read for me, I simply could not put it down.I was a little shocked at some of the content coming from Keene, this read more like a Ketchum book. That's not a bad thing, just not what I've come to expect from Keene. If you are put off by the inbreeding, raping, vulgar, cannibalistic freaks often encountered in Ketchum type books......then this one may not be for you. It is violent, graphic, fear wrenching horror done well.Keene continues to amaze me, he can do just about any type horror, and do it as well as any of the big boys in this genre."}, {"userName": "Chris", "userReviewDate": "Jul 29, 2010", "userURL": "http://www.goodreads.com/user/show/4083467-chris", "userReview": "I love Brian Keene's books. The Rising is, bar none, the best zombie book ever written, and Conqueror Worms is the best modern \"Lovecraftian\" book I've read.Urban Gothic, to me, fell largely flat. I really just felt like a less impressive version of Ketchum's \"Off Season\", and, like another reviewer, it took me a long pause between reading the first half and second half to finish it (it's the first Keene book that I haven't been able to read in a day or two).All told, the writing was fine (par for the course for Keene), and the setting was interesting. Unfortunately, the rest of the story simply died on the vine (and actually stopped me from writing a story that I had started that was similar in the \"a bunch of bad stuff suddenly happens to a group of people\" vein... though my setup and villains were FAR different).Though it pains me to do so, being a huge fan of Brian's other work (including a fan of the similar Castaways), I just can't give this more than a mediocre review."}, {"userName": "Shannon Barber", "userReviewDate": "Oct 27, 2011", "userURL": "http://www.goodreads.com/user/show/399339-shannon-barber", "userReview": "I am right in the middle of this book. As other reviewers have commented it's gross. You have all the gross out points, blood, menstrual blood, bodily harm, poop, pee, fat people, stink etc. A few of the scenes so far have been a little long for my taste but not anything that I find upsetting. However I am having a hard time finishing this book because I just don't care about the protagonists. At this point I kind of hope they die. I stopped caring almost as soon as the plot was set up. To put a fine point on it I'll quote Naughty By Nature- If you ain't never been to the ghetto. Don't ever come to the ghetto.. I will probably put this book away for a little bit and read something else/"}], "description": "When their car broke down in a dangerous neighborhood of the inner city, Kerri and her friends thought they would find shelter in the old dark row house. They thought it was abandoned. They thought they would be safe there until morning. They were wrong on all counts. The residents of the row house live in the cellar and rarely come out in the light of day. They're far worse than anything on the streets outside. And they don't like intruders. Before the sun comes up, Kerri and her friends will fight for their very lives... though death is only part of their nightmare.", "title": "Urban Gothic", "url": "http://www.goodreads.com/book/show/6318775-urban-gothic", "average": 3.72, "cover": "https://images.gr-assets.com/books/1347441482l/6318775.jpg", "reviews": 200, "authors": [{"url": "https://www.goodreads.com/author/show/52050.Brian_Keene", "name": "Brian Keene"}], "type": ["Horror", "Fiction", "Thriller", "Horror", "Gothic"], "outlinks": ["http://www.goodreads.com/book/show/6318775-urban-gothic", "http://www.goodreads.com/book/show/11531504-urban-gothic", "http://www.goodreads.com/book/show/23460769-urban-gothic", "http://www.goodreads.com/book/show/18723918", "http://www.goodreads.com/book/show/216213.The_Rising", "http://www.goodreads.com/book/show/90577.City_of_the_Dead", "http://www.goodreads.com/book/show/216215.Dead_Sea", "http://www.goodreads.com/book/show/155977.The_Conqueror_Worms", "http://www.goodreads.com/book/show/216211.Ghoul", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}