{"ratings": 3094, "userreviews": [{"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "Ψυχεδελικός περίπατος παρέα με τη μνήμη και τη λήθη και ξάφνου μπροστά μας εμφανίζεται μια μεγάλη αγάπη που δεν θα καταπιεί ποτέ η λησμονιά. Πως να μην ρίξεις όλα τα αστέρια του ουρανού σε αυτό το αίσθημα ιλίγγου και συνειδητής λογοτεχνικής μελαγχολίας;Το παράξενο γεγονός του έρωτα μας εξηγεί ο Σταντάλ και μας μεταφέρει σε ιστορικές μάχες, απέραντα πεδία πτωμάτων,πολλές ερωμένες,απογοητεύσεις,αρρώστιες και το τελευταίο ταξίδι ανάμεσα σε φαντασία και πραγματικότητα. Ενα ταξίδι που απολαμβάνουμε για τις αλησμόνητες ώρες σιωπής και τον χιμαιρικό έρωτα ως ψεύτικη συναλλαγή ευτυχίας. Αρχικά ξεκινάμε απο τη Βιέννη είμαστε ακούραστοι περιπλανητές και κάνουμε μεγάλες και κουραστικές πεζοπορίες. Κάπου συναντάμε τον ποιητή Δάντη,είναι κι αυτός εξόριστος απο τη λήθη του,μα δεν προλαβαίνουμε να του μιλήσουμε. Περπατάει βιαστικά και χάνεται. Ίσως φταίει η μνήμη που μας παραπλανεί κοροϊδευτικά.  Στις νυχτερινές βόλτες μας υπάρχει σκοπός. Πρέπει οπωσδήποτε να αντιμετωπιστεί το αίσθημα δυσφορίας και ιλίγγου. Δεν είναι ώρα να γείρουμε στο «ρεύμα του χρόνου». Όχι ακόμη τουλάχιστον. Συνεχίζουμε στη Βενετία. Εδώ πρέπει οπωσδήποτε να ρυθμιστεί το σύστημα νομολογίας για το ερωτικό πάθος. Πρέπει να αθωώσουμε τον Καζανόβα πριν αρχίσει να παίρνει στα σοβαρά τις σκέψεις του περί τρέλας και ορίων της ανθρώπινης λογικής. Φτάνουμε στα Λουτρά της Ρίβα. Χρειαζόμαστε απομόνωση-ξεκούραση-θεραπεία- και έρωτα πλατωνικό. Υπάρχει ένας βασανισμένος επισκέπτης ανάμεσα στους άλλους. Φοβάται την πολυκοσμία,είναι απίστευτα μοναχικός και μόνιμα σκεπτόμενος. Μας κάνει να τον αγαπήσουμε,να τον πιστέψουμε να τον νιώσουμε ως την ψυχή όταν μας λέει μουδιασμένα ιστορίες για την αρρώστεια του και μια αποσπασματική θεωρία περί του έρωτα δίχως σωματική επαφή. Πριν ξεκινήσει μας ξεκαθαρίζει πως θα κάνουμε λίγο παρέα χωρίς ανταλλαγές προσωπικών στοιχείων και όταν έρθει η ώρα του αποχωρισμού θα φύγουμε απλώς αφήνοντας μόνο ευσεβείς πόθους. Και λεει: στον έρωτα δίχως σωματική επαφή δεν υπάρχει διαφορά ανάμεσα στο πλησίασμα και την απομάκρυνση. Όταν θα ανοίγαμε τα μάτια,θα ξέραμε ότι η φύση είναι η ευτυχία μας και όχι το σώμα μας,που απο καιρό πια δεν ανήκει στη φύση. Γι'αυτό κρατάνε όλοι τον λάθος αγαπημένο,και υπάρχουν σχεδον μόνο τέτοιοι,στον έρωτα έχουν τα μάτια κλειστά ή τα έχουν διάπλατα ανοιχτά απο την απληστία,το ίδιο πράγμα δηλαδή. Ποτέ οι άνθρωποι δεν ήταν τόσο αβοήθητοι και τόσο ασυνάρτητοι πνευματικά όσο σε αυτή την κατάσταση. Και τότε δεν μπορούν πια να κυριαρχήσουν στις αντιλήψεις τους. Υπόκειται κανείς σε μια διαρκή πίεση προς την εναλλαγή και την επανάληψη,η οποία,κάνει τα πάντα απο τα οποία προσπαθεί κανείς να κρατηθεί,ακόμη και την εικόνα του αγαπημένου προσώπου,να διαλύονται. Τέτοιες καταστάσεις λίγο απέχουν απο την τρέλα. Αυτά μας είπε και δεν χρειάστηκε να συστηθούμε. Δεν ήταν άλλος απο τον Φράντς Κάφκα!!Μόνο γι'αυτά τα λόγια περνάει στα αγαπημένα και αξέχαστα. Μόνο γι'αυτά τα λόγια δεν γίνεται να αποχωριστούμε πολιτισμένα. Μόνο γι'αυτά τα λόγια ....Καλή ανάγνωση!Πολλούς πλατωνικούς ασπασμούς!"}, {"userName": "Seemita", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/34622220-seemita", "userReview": "[ Austerlitz\n(hide spoiler)]"}, {"userName": "Steven  Godin", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "Hmm......this is a tough one, and still don't know just quite what to make of it. I Could sit on it for 24 hours and reach a different conclusion, but while it's fresh in my mind I settle for now. And speakings of minds, Sebald going by this certainly had an imaginative one, made up of fragmented memories from his youth, and historical meditation swirled with fantastical events from an overview of the life of Stendhal in 19th century Italy . The positives from Vertigo far outweigh the negatives, but I so wish it had either been an ingenious novel of vast proportions, or a travelogue memoir solely based on fact, it mixes both, with mixed results. It has given me vertigo, a sensation of whirling and loss of focus, I wish I had a feeling of equilibrium, because reviewing this is not going to be easy.A ghostly figure, which I will call Sebald's doppelganger, takes off from England to travel via the streets of Vienna, Venice, Milan, Verona and Innsbruck, finally ending the journey in the German village of W. (Wertach? his family home). Driven by a hypnotic prose (which was seriously good) Sebald the narrator takes readers on an almost spiritual pilgrimage, bending his own thoughts from places visited in the past, and the felling it evokes inside of him. Some pages contain old photos and drawings that accompany the text, this just adds to the feeling of buried thoughts and periods in the past, some are blurry, but then so was Sebald's mind. Kafka on a bus, his link with a pizzeria in Verona?, the image of Ludwig of Bavaria floating by in a vaporetto in Venice, the mythical figure of Gracchus the huntsman, and an ancient war, entrancingly, are spellbound into Sebald's vision. His wondering travels conjure up some wondrous landscapes through Italy, and are beautifully descriptive, casting bewilderment and daze. In a moment of confusion whilst in the Milan Cathedral, he would all of a sudden no longer have any knowledge of his surroundings, unable to determine whether he was in the land of the living or already in another place, having a force of uncertainty that pervades everything around him. This sums Vertigo up in a nutshell.Vertigo is not the type of book to put your feet up and relax to, on the contrary, it stimulates the mind, gets you thinking, puzzles and dazzles likewise, to a degree this reminded me in some ways of calvino's \"Invisible Cities\", for the way it wraps you in a magical blanket. But Sebald writes with a more melancholic and haunting tone. There is sadness within, especially towards the end.There is a problem though of piling up too much detail and jumping from thought to thought that felt increasingly random and oblique. In terms of the readers, there are no hints about the points he was trying to raise. I don't want to call more than 50% of it's content as self-indulgent, but not to lie, it was. I can understand the whole dislocation from reality thing, but it didn't fully grasp me.And this coming from someone who generally does not use criticism in reviews, always looking rather for the good things, and there are plenty here. But one must be honest with ones self, otherwise doubt over ones ability to judge fairly is bought into question.A good solid three stars is the best I can do."}, {"userName": "Kris", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/5974610-kris", "userReview": "Throughout Vertigo, W.G. Sebald, through deceptively clear prose and photographs, creates a disorienting waking dream for his readers. The novel is divided into four sections, and while there is not a straightforward plot or clear storyline, Sebald weaves thematic connections as well as specific details revisited from different perspectives to hold the novel together. Some sections read as biographies of historical figures, while others are written from the perspective of neurotic characters, traveling in Venice, Vienna, and the Tyrolean Mountains in dreamlike states. Nothing is stable in Sebald's world. Although maps, atlases, and sketches of terrain appear throughout the book, discrepancies between these guides and the actual sites, changed by time, development, or the gap between the ideal and reality, make these worlds difficult for the characters to navigate. Sebald uses water as another device to convey the dream-like vertigo suffered by his characters. Waves roll, vaporetti rock on the canals of Venice, the lapping of water acts as a lullaby. Buildings and works of art molder and decay. Characters attempt to find something concrete to hold onto - friends, people on the streets, a walking routine, scraps of paper to decipher - but in the end their dream-states always prevail.Since finishing Vertigo, I can't shake off the disorienting sense that I was dreaming along with the characters. This novel is recommended for people who don't require traditional plots, but who are interested in traveling with Sebald, witnessing his blurring of genres, and sharing in the disconcerting experience of life with his characters."}, {"userName": "Orsodimondo", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "MIND THE GAP L’io narrante di Sebald è quasi sempre in un periodo delicato e doloroso della vita – conosce la desolazione degli ospedali, ha frequentato anche quelli psichiatrici – è immerso nella malinconia, ma direi anche in qualcosa di molto prossimo alla depressione. E’ alle prese con una forza con la quale ingaggia una lotta muta, ma strenua.Immagino che quella forza sia il ricordo: ricordare o dimenticare fa ugualmente male, è un peso dal quale non ci si libera.Ma è qualcosa che non si può trascurare.Anche conservare memoria perfetta di una lacerante amnesia è preferibile al completo oblio.Ma le immagini che la memoria riconduce, per quanto fedeli al proprio vissuto, possono essere prese come dati di fatto, sono davvero affidabili? Quante più immagini del passato riesco a raccogliere, tanto più mi sembra inverosimile che si sia svolto proprio in quel modo: nulla in esso può definirsi normale, la maggior parte di quanto vi è accaduto è ridicolo, e là dove non è ridicolo suscita orrore.L’orrore è l’eredità dell’heimat, nasce da quei dodici anni che durarono mille, durante i quali Sebald e il suo io narrante videro la luce: e, anche, dall’essersene andato via, avere abbandonato la terra natia, un gesto sentito come aver voluto dimenticare e rimuovere quel passato (ma si è comunque portato dietro l’infezione nazista, proprio come Stendhal nel primo racconto, sotto l’alias di Beyle, si porta dietro la sifilide nel suo peregrinare per l'Italia settentrionale). Perché, in fondo al ricordo, c’è sempre dolore, c’è sempre una colpa. Il ricordo è ‘vertigine'.L’io narrante di Sebald parla in modo accurato, dotto, forbito, ironico, ipnotico.Parla col silenzio. Parla attraverso gli spazi geografici e temporali che percorre.Parla di paesaggi di rarefatta solitudine. Traccia linee di collegamento tra la mano di una donna che potrebbe essersi poggiata sulla sua spalla nella hall di un albergo di Limone sul Garda con il ricordo di anni prima a Manchester dove un’ottica cinese gli riparò gli occhiali giungendo a una vicinanza fisica quasi simile. Sembra sempre circondato di simboli, ha visioni, vede persone morte da tempo, fa incontri strani, è perseguitato da atmosfere gotiche, cupe, sospese, desolate. Si ferma a scrivere dove capita, anche nel corridoio del treno o davanti alla stazione di Desenzano, prende appunti con la matita su taccuini dimenticando tutto tutti e se stesso: scrive e afferma di non sapere cosa scrive, …ma di avere sempre più la sensazione che si trattasse di un romanzo giallo.L'io narrante di Sebald parla attraverso racconti che sono romanzi che sono memoir che sono saggi che sono autobiografia, diario di viaggio, ricordi personali, diari altrui, lettere, articoli di giornale, confidenze (romanzo giallo?)… Parla di storia e geografia e arte e botanica e architettura e musica e … Parla di viaggi, nel tempo e nello spazio. Sono viaggi dell’anima, che il corpo asseconda: Entrato in chiesa, mi sedetti un attimo per slacciarmi le stringhe delle scarpe e all’improvviso, come ricordo ancora con immutata chiarezza, non seppi più dove fossi. Nonostante il faticosissimo tentativo di ricostruire lo svolgimento delle ultime giornate – quelle che mi avevano condotto lì - non avrei neppure saputo dire se mi trovavo ancora nel mondo dei vivi o in un Altrove.Parla, e sembra tacere.Parla piano, parla col silenzio e in silenzio.Respira e mi trasmette libertà: non solo perché è oltre la costrizione di qualsiasi genere letterario. E’ proprio questa forma di quiete che ha il profumo di libertà.La mia sensazione è che segua una linea più sinuosa che retta, più periferica che tesa al centro: potrebbe ridisporre queste quattro sezioni (racconti?) in un’infinita varietà di combinazioni.Non è in fondo questo che il narratore di Sebald afferma quando nella biblioteca civica di Verona sfogliando le raccolte dei giornali locali risalenti all’agosto e settembre 1913 scrive: …storie senza né capo né coda che, pensavo tra me, sarebbe stato opportuno approfondire?E ancora:…con le mie annotazioni mi trovavo ormai arrivato al punto in cui si trattava di andare avanti non si sa fino a quando oppure di lasciar perdere.Perché in tutte le opere di Sebald ci sono le fotografie, cosa significano?Sono abbandonate tra le pagine come in un diario, per ricordare qualcosa, un momento particolare?Ma anche se si trattasse di un diario, è un diario pubblicato, la foto è stampata in un posto e un ordine precisi: vuole avvalorare il testo, confermarlo, dargli più verità? O siamo nel campo della letteratura postmoderna, e Sebald sta cercando di ricordarci che si tratta di un’opera di finzione, una sua invenzione (come l’attore che improvvisamente volta le spalle al palcoscenico e parla rivolto allo spettatore, squarciando il velo): in fondo, la foto non dimostra nulla, può essere quella o un’altra cosa, non abbiamo prove per collegarla al testo, se non una specie di verosimiglianza. Lavoriamo al buio - facciamo quello che possiamo, diamo quello che abbiamo. Il nostro dubbio è la nostra passione e la nostra passione è il nostro compito. Così Henry James sintetizza il lavoro dell’artista: sono parole che si applicano anche al lettore, perché quando s’incontra una vera e propria opera d'arte, come gli scritti di Sebald, è come leggere al buio, non si può mai sapere dove si verrà condotti.Ecco perché, quando posso, io cerco rifugio nella sua prosa, come in un cinema: quando inizio a leggerlo, è come se si spegnesse la luce e io prendessi il largo."}, {"userName": "Geoff", "userReviewDate": "Jan 13, 2012", "userURL": "http://www.goodreads.com/user/show/126266-geoff", "userReview": "~~~\nI listen, as it were, to a soundless opera.\nElsewhere I have called Sebald Europe’s last great rememberer, the final inheritor of the legacy of all those literary and artistic exiles of the disasters of the 20th century, sort of carrying all of that over for us into the new millennium, wandering late in the terrible century the landscape of what was built on top of those ruins and embers, surveying in a more detached mode the reconstruction smothering out the ghosts and relics, tuned to the ever-returning, ever-retreating voices of all of those marching backwards into history’s shadows. Within the fissures of all of his prose, the white space between letters, the timeless calamity resounds. Under his gaze the stream’s course not so much reverses as superimposes, a river overlapping a river overlapping a river in an endless palimpsest of fading impressions yet proving ineradicable. He bears witness to what is no longer witnessable, the centuries accumulate in his books, and become semitransparent as fog overlaying a dark morning forest whose trees in the wind resemble the slow undulation of oceans. On these oceans barques are setting sail for unknown places. They return, bereft of crew, ghost ships with holds full of enigmatic riches.It feels appropriate that the last of his fictions for me to read was his first novel, for Vertigo is something like Sebald’s ricorso. In it Sebald appears already fully formed - the wanderer in search of the strange interdependencies of Life and Fate. The Teutonic conscience that cannot bear the legacy of its homeland and so exiles itself. The living man ferried over Styx to the land of the dead like so many before him, but unable to find port - the hunter Gracchus. The man to whom Art and Letters are a world above the unfathomable world below, one which we carry inside of us and retreat to for meaning, for solace, for safety and for rejuvenation. His procession home is fraught with phantoms, mists, paranoia, doubling, mirror-worlds, unsettling coincidences, emergences of the same, tonal repetitions as in a piece of music, manifestations of nightmares, disconsolate memories, distant warnings, obscure signposts, and the titular unrelenting nauseating imbalance and sense of dislocation. Yet it is as achingly beautiful and melancholy and brilliant as any of his works, and found me at the perfect moment, when its celestial longing and sense of the inherent beauty in the struggle at recovering the irrecoverable (one of the main purposes of Art), of setting down in the more permanent fixture of words and images the finite, the fading, the ungraspable, its determination not to lose the hope of uncovering meaning within the cosmic occurrence of apparently meaningless collapse, however obscure and at times terrifying (”For beauty is nothing but the beginning of terror, which we still are just able to endure”), was much needed succor for this brother huntsman of the Black Forest, this fellow Flying Dutchman.\nDi Morte l'angelo a noi s'appressa. Già veggo il ciel discindersi.\n~~"}, {"userName": "Gorkem Y", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/5811468-gorkem-y", "userReview": "Sebald, II. Dünya Savaşı sonrası Alman halkının belleklerine, baskı ve korku içinde yaşayan dünyalara bizi gene otobiyografik, deneme ve farklı öykü türlerini kendine has bir biçim içerik içinde müthiş bir okuma zevki sunuyor. Sebald birbirinden bağımsız yapılardan oluşan öyküleri temalar ile birbirine bağlaması ve gene Sebald'ın inanılmaz doğal anlatımı ile Beyle isimli Napolyon döneminde bir askerin (evet düşündüğümüz kişi) okuyucuya sinyaller çakarak bu kişinin aşklarını ve başarısızlıklarını okuyoruz.İkinci bölüm ve diğerleri cidden tarif edilmesi zor ve ancak okuma doğrultusunda tadı lezzeti beyninizde kalacak inanılmaz göndermeler ile devam ediyor. Sebald bizi tarihsel anlamda yolculuklara çıkararak yazarlar üzerinden harika göndermeler yapıyor.Harika bir deneyimdi.Herkese iyi okumalar10/9"}, {"userName": "Grazia", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/29190640-grazia", "userReview": "\"Una fiammata brevissima, uno scoppio, sprizzi di scintille e poi ogni cosa si spegne.\" Gli ingredienti sono i medesimi di Austerlitz: viaggio, memorie, letteratura, arte, architettura, Storia.L'impasto si compone di prosa elegantissima (mai artificiosa) e fotografie in bianco e nero. Fotografie come testimonianza di vite che furono. Pensieri, associazioni, parallelismi, ricordi, ricostruzioni. Pensieri evocati che non appartengono più alle persone che li hanno concepiti perché legati ad un tempo e ad un luogo.La vertigine è quella che coglie nel momento in cui avviene la presa di coscienza di quanto sia effimero l'uomo, le sue pulsioni, i suoi ricordi, i suoi mutabili pensieri, i suoi tentativi di sopravvivere al tempo.Vite di persone, si intersecano semplicemente perché hanno solcato lo stesso suolo, hanno osservato lo stesso dipinto, in anni differenti, attraversati dagli stessi pensieri e dalle stesse pulsioni. Forse. Oppure passanti in maniera fortuita per gli stessi luoghi, senza un disegno, ma solo per pura casualità.Il viaggio che compie Sebald, non è (solo) un viaggio nei luoghi, è un viaggio nel tempo e nelle coscienze. Un tentativo di ricostruzione identità e individualità dissolte. Ma come mantenere ciò che è stato se i luoghi e le cose non sono in grado di testimoniare?\"Quante più immagini del passato riesco a raccogliere, continuai, tanto più mi sembra inverosimile che proprio in quel modo si sia svolto il passato: nulla in esso può definirsi normale, anzi, la maggior parte di quanto vi è accaduto è ridicolo, e là dove non è ridicolo suscita orrore.\"A Sebald non interessa raccontare una storia. Sebald regala suggestioni."}, {"userName": "Pantelis", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/59132978-pantelis", "userReview": "Sebald was a follower of dead authors. I now follow him. He teaches me how to walk along the edge of Τime..."}, {"userName": "[P]", "userReviewDate": "Jul 13, 2015", "userURL": "http://www.goodreads.com/user/show/40516522-p", "userReview": "I find the wonderful German writer W.G. Sebald so difficult to review that my treatment of his second novel, The Rings of Saturn, was no more than a long story about a trip I once made with my then partner to her home in Cornwall, during which, mostly on account of her parents, I lost my mind and my girlfriend. I’m not, of course, going to go over all that again, and I couldn’t even if I wanted to, for I have forgotten much of what took place; yet the disquieting thing is that what I can recall or bring back I now doubt the veracity of. For example, my girlfriend’s parents were very rich, but I am sure that it is not the case that their admittedly large home was backed by an even larger field, in which wild horses ran; yet that – the field, the horses, the house – is my strongest memory of the week I spent in Cornwall.Some years ago I was at college and my philosophy teacher told me a story about how he moved to the Czech Republic, on a whim so to speak, in order to be with a Czech girl he had met whilst she was on vacation in England. When he arrived at her house she showed him in and explained that he ought to say hello to her father. He agreed and so she directed him to climb the stairs, where her father could be found in the first room on the right. My teacher may have found this odd, but in any case he climbed the stairs and entered the room and there he saw the old man, sitting in a chair, listening to Wagner, with tears streaming down his face. Now, this did not happen to me. I know that well enough, so why is it that this memory now seems as though it belongs to me? Why is it that I am able to put myself in that situation, in place of my teacher, and see, not what he saw, but my own version of it, with as much assurance as anything that has actually happened to me in my life?As I sit here and think about those two trips, one to Cornwall and one to the Czech Republic, both of which are a strange mixture of fantasy and fact, the proportions of each unknowable to me, I feel extremely disorientated. This disorientation is, I believe, what Sebald called vertigo, a state that is characterised by the difficulty, or a belief in the difficulty, of putting one’s feet on the ground, of being sure of yourself and of the world around you. It is this mental, and physical, state that Sebald writes about in this book, the first of his four great novels. In it he tells a series of anecdotes and stories, involving both fictional characters and real people, including himself.Sebald’s first vertigo-sufferer is Marie-Henri Beyle, who we are told was a soldier in Napoleon’s army; he was also a writer, and is better known as Stendhal. Throughout his life Beyle’s memories and perceptions, according to Sebald, consistently played tricks on him. For example, he was convinced that the town of Ivrea, through which he once passed, would be indelibly fixed in his mind, only to find, some years later, that what he actually remembered was nothing but a copy of an engraving called Prospetto d’Ivrea.Beyle writes that even when the images supplied by memory are true to life one can place little confidence in them.For Beyle, the distinction between truth and fiction, reality and imagination, was tenuous at best. Probably the most wonderful, the most moving anecdote Sebald shares with us in this regard involves Beyle’s relationship with a possibly imaginary woman, La Ghita. Beyle, writes Sebald, claimed to have been travelling with La Ghita, to have had involved conversations with her, and to have eventually broken from her, and yet there is no definitive proof that she ever existed; in fact, the likelihood is that she was a composite of numerous women the Frenchman had known.As with all of Sebald’s work, in Vertigo he is concerned with melancholy outsiders, or eccentrics. Most people do not have a troubled relationship with reality, like Beyle does, but the few that do tend to not be particularly happy [or mentally stable]. This appears to be borne out when, at the beginning of the second section of the novel, Sebald, or the narrator who so closely resembles Sebald, discusses his own mental breakdown, which occurs when travelling through Vienna, Milan, Verona, Venice and Innsbruck. The narrator’s vertigo manifests itself as a kind of dread or neurotic fear, and by a sense of the uncanny. For example, at one point he tells the story of Casanova’s imprisonment and notices that the day the Italian had set for his escape is the day that he [Sebald] had visited that same prison, Doge’s Palace. When he leaves each town or city he does so as though trying to outstrip his anxiety, as though he is on the run from himself [and possibly the two shadowy figures he believes may be following him]. In the second half of this long second section, Sebald returns, seven years later, to make the same trip and visit some of the same places. This trip is a tour of his memories of those places as much as it is an actual tour of them.Like Beyle, Sebald is hyper-sensitive; the things that he reads and the art that he engages with often break into reality, the everyday world is often transformed by his imagination [or madness]. At one point in the book he thinks that he is following Dante, at another he mentions that he was once convinced that a black limousine driver was Melchior, one of the three magi [or wise men]. Throughout, there hangs over the book the question, What is reality? Are Sebald’s strange experiences reality? Instinctively one would want to say no, because Dante was dead at the time the narrator claims to have seen him, and yet, for me, the issue is far from clear-cut; what someone experiences, regardless of how impossible it may may seem, is their reality, is as real as anything we would accept without raising an eyebrow. The truth of the world, I once wrote, is like a cloud of blue smoke on a windy day.Over the years I had puzzled out a good deal in my own mind, but in spite of that, far from becoming clearer, things now appeared to me more incomprehensible than ever. The more images I gathered from the past, i said, the more unlikely it seemed to me that the past actually happened in this or that way.According to many of the reviews and articles I have read, Vertigo is the weakest of Sebald’s four novels, but that is not an opinion I share; for me The Emigrants is the least engaging of the bunch. However, what does distinguish this novel from the others, and perhaps accounts for some of the indifference towards it, is that it wears its influences more brazenly. Sebald’s other work all tastes subtly of Marcel Proust and Jorge Luis Borges, but here the flavour is very, very strong. The prose style, involving long complex sentences, with multiple clauses, is recognisably Proustian; and some of the ideas contained within Vertigo are not only similar to some of those found in In Search of Lost Time, but actually appear in it. Furthermore, the structure of this book, in comparison with Austerlitz and The Rings of Saturn in particular, is far from sophisticated. For example, while the opening Beyle section is thematically connected to the rest of the work, it still essentially stands alone. Later in his career Sebald would work his anecdotes and stories into his overall narrative and that gave them a satisfying flow that Vertigo does not have.Yet there are also positive aspects of the book that one will not find in Sebald’s more sophisticated work. First of all, it is at times pretty funny. There is a refreshing lightness of touch, or lightheartedness, in certain passages. Two incidents stand out or me in this regard, there is Sebald possibly getting hit on in a bar in Italy and a scene on a bus when he spies two kids who he thinks are dead-ringers for Franz Kafka. Here, our intrepid narrator approaches the boys and their parents, but receives a frosty reception; he asks for a photograph of the children but is turned down. They probably thought I was a pederast, Sebald notes. Ha! Martin Amis once said that all great writers are also comic writers, and I believe there is some truth in that. A comic writer does not have to mean someone like P.G. Wodehouse, but, for me, and Amis too, includes the likes of Tolstoy and Kafka. The idea is that if you understand the world, and the human condition, you cannot help but be, on occasions, funny, because life is funny; so it pleases me that Sebald has shown that he, too, could be humorous. The story of the Kafka kids also highlights another pleasing aspect of Vertigo, which is that it is more obviously fictional than the novels that came after it. One may in fact see that as a negative, but it was nice, in my opinion, to encounter a more relaxed Sebald, one trying stuff out, even some goofy stuff."}, {"userName": "Tristan", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/3781470-tristan", "userReview": "“The more images I gathered from the past, I said, the more unlikely it seemed to me that the past had actually happened in this or that way, for nothing about it could be called normal: most of it was absurd, and if not absurd, then appalling.”\n How does one explain, let alone come to grips with Sebald's 'Vertigo?' What is it that he does exactly? What is he reaching for?Judging from fellow reviewers, this seems to be a question of some import, leaving vast amounts of his readers – devotees and those viewing him with mild disfavor alike– pretty much stumped for a definite answer. In fact, the man's style has spawned its own adjective, Sebaldian. Always a telltale sign that you've \"made\" it as a writer. Or that academics have just given up trying to come up with their own description of you, if one is more pessimistic about these things. One wouldn't be so arrogant as to presume being able to provide anything remotely close to a definition (especially a thoroughly unqualified dweeb like myself, having done only the most preliminary, dewy-eyed reconnoitre of his oeuvre). That, and it has always seemed to me that it's the very epitome of vulgarity when one attempts it with certain kinds of literary fiction; the genre(?) which Sebald, as is apparent in his debut, has a distinctive approach to, though I would hold off hailing this particular book as a masterpiece just yet.After this first - fittingly vertiginous - encounter, Sebald to me very much is like an amorphous fog bank which, wholly unexplained, appears on a sunny, clear-skied day, slowly occupying reality only to transmogrify it, to subject it to its own particular whims and inclinations. To be sure, this \"invaded\" reality still feels familiar, yet has assumed an eerie, disorienting aspect. Suddenly, one clumsily reaches into thin air, wanders around aimlessly, stumbles at inopportune moments. There is no solidity to be found, one's illusion of having a firm grasp on things is done away with. Time as well falls under its spell, its linear progression tampered with, or indeed smashed to pieces. These can be decided to be puzzled back together by a brave soul, or alternately just be left alone, to let exist on their own, to be replayed in the mind again and again. Very much how one remembers a dream, in ostensibly disconnected fragments. As an attempt at wedding ego document (the main protagonist it would be uncontroversial to state is a clear stand in for Sebald himself) to meditations on literary/historical figures ( Kafka, Stendhal, Casanova ), 'Vertigo' certainly is ambitious, employing a structure composed of what are (auto) biographical, thematically linked vignettes, each devoted to a single character. They all have one commonality: they engage the world in a deeply oneiristic manner. That, it seems, is what drives both Sebald and his characters, be they real or fictional. They are dreamers, visionaries even, roaming their respective worlds, whilst inviting in, stepping into and out imaginary ones at the same time. They seek to escape, get away from their own being, their very identity. They want to be rootless, even destroy themselves, after which they can construct themselves anew out of the wreckage; in other words, metamorphosis (it is no coincidence, I think, that Kafka gets his own vignette here) is their God.Is it hard to fathom why Sebald might be attracted to this concept? After considering the fact he was born (May, 1944) while the Nazi war machine and concomitant reign of terror was still in full swing, one can safely assume its odious legacy was inculcated in him as a child. Indeed, its horrors, and the resulting shame and disgust must have haunted him for all his life, as it did - and still does - many Germans. No wonder one might want to adopt a different identity, another nationality, another reality, another anything; to seek solace in the past, to flee into the comforting, always so seductive embrace of the unreal. Just mark the following quote, as it is as revealing of the author's mental state as anything to be found in these pages: \n“How I wished during those sleepless hours that I belonged to a different nation, or better still, to none at all.\"\nBut let's ditch the psychoanalysis, and return to the actual work, which is where frustration rears its ugly head. Especially because of its many virtues, it must be said that few books have made me feel so conflicted as 'Vertigo' did. Theoretically I should be busy evangelizing it whenever and wherever I can. Yet ( and this probably can be attributed to it being a collection of loose vignettes primarily concerned with dabbling in impressionism ), the whole couldn't be held together enough for me to be fully satisfied. Sebald just never held me in that almost transcendental zone, enraptured. Always there was this cool distance present, a clear remove from what was happening (or not happening, since it's purposefully without plot) on the page. Like a dream, 'Vertigo' feels more like a mood piece; while in possession of a veneer of quiet, soulful melancholy, reaching occasional heights of profound insight and lyricism, ultimately it slips away, is fleeting. Its fragrance, not without irony, remains of the fragmentary sort. *** All images are - naturally, this film buff couldn't resist - taken from that singularly haunting Hitchcock which bears the same name ***"}, {"userName": "Vit Babenco", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/19283284-vit-babenco", "userReview": "Vertigo is about properties of human mind and memory and the story goes as a sudden paroxysm of dizziness…“…over the years I had puzzled out a good deal in my own mind, but in spite of that, far from becoming clearer, things now appeared to me more incomprehensible than ever. The more images I gathered from the past, I said, the more unlikely it seemed to me that the past had actually happened in this or that way, for nothing about it could be called normal: most of it was absurd, and if not absurd, then appalling.”It is a tale about that strange occupation we call living…“Mme Gherardi maintained that love, like most other blessings of civilisation, was a chimaera which we desire the more, the further removed we are from Nature. Insofar as we seek Nature solely in another body, we become cut off from Her; for love, she declared, is a passion that pays its debts in a coin of its own minting…”Between sanity and madness there is but a step…"}, {"userName": "Tony", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/33771-tony", "userReview": "There are three main arteries to drive the 12.5 miles from my suburban home to downtown Pittsburgh. Foremost is McKnight Road, a six-lane swath through McDonalds and Target and JiffyLube and, well, you know the route. It's under construction this summer, a bridge reduced to two lanes. McKnightmare Road, now. If you insist on going that way, you sit, you do not move. I can not 'not move'. But as I said, there are two other alternate routes to take; narrower and slower because of the additional traffic, but acceptable at an additional 5 or 10 minutes of actual moving. I took one, Thompson Run Road, which meanders beside that trickle, a pleasant if slower choice. Alas, the world is run by 'C' students, Al McGuire once famously and correctly said. And there is 'stimulus' money in the pipeline. So, they tore up that road too. My 20-minute journey became a grueling hour instead on the third option, Babcock Boulevard. Stuck again, implacably. A road sign beckoned: Cemetery Lane. The road rose through a dense wood and opened, aptly, in a clearing with a cemetery on the left. And another and another. One mile of graves, canted downhill, the markers facing the winding, rising road. Very old markers, tilted askew from the shifting ground or an unhappy tenant. Monoliths. Family plots. A Star of David on Stoltz' headstone, perhaps incongruously by Gruber's. Hemlocks and arborvitae give shade, maybe peace. I wondered how long ago this road was named. How many souls were laid here before it would be defined as such a place? And how many souls now? I don't know since I can't see over the hill, now from the road where I crawl to work.I think also of another cemetery and another time. The flatter ground where my parents lie in Pennsylvania's soft coal country. I saw my grandparents buried there when I was a small child. A double marker in Polish joined them among so many others like them. But away from all the others, in the furthest corner, there stood a tiny marker. The other stones were together, a family or community, a church, even in death. But not that little stone, removed palpably from the rest. I asked my father why. He said she was a young woman who was not quite right. She had a baby when she shouldn't have. She killed herself shortly after. I looked there again, and back to my father. He said, because she killed herself she can not be buried with the others. That spot is not consecrated. I suppose he didn't agree with that. He was not that kind of man. But he never said so.Every visit, I would look away and to that back corner and feel her staring, feel her judgment. It was then, for me, that the robes became costumes, the intonations turned hollow. That marker is still there today, alone. No one joined her and no petition moved her. I doubt she has visitors. I mean, why would I?(This is not a review anymore than Vertigo is a novel. I've tried to create in my own way the meandering spirit in which Sebald writes. I don't know if I've succeeded or if he would approve. Maybe if I had a grainy photograph of a solitary grave marker nestled amid the prose.)"}, {"userName": "K.D. Absolutely", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "Dizzying yet beautiful. Reading Sebald, my second, is like drinking red wine. It tastes bitter yet there is an aftertaste of something sweet that is left in your mouth. It makes your head spin after a while and yet you enjoy the feeling. It is something that you don't normally drink (since I prefer beer being cheaper generally) but it gives you some class and it is reason enough for you to finish the till the last drop from the glass.What I am trying to say is that this book takes you to an unfamiliar places and events: Napoleon's war-ravaged France with dead bodies lying on the streets, Frank Kafka's hometown or just those side streets in European cities and the people who lived in them whose names don't ring a bell at all. I mean, I have been to Paris (in 2004) and those two weeks I still vividly remember but with the many world-known events that happened in that city, there are just too much images (from books, films, television) that compete in my mind and clutter those that I had during the quick two-week visit. So, the images of Beyle (first of the four narratives int his book that was actually that of the writer Stendhal) dying of syphilis is a bit uneventful for me to associate with first-hand images of Paris. However, what hooks you to continue reading is Sebald's easy to read prose and the interesting pictures and illustrations that are supposed to be the actual and yet felt only imagined images of the events narrated in the book. The book's title is very apt as the narratives, told in first person, seem factual and yet while you are reading, you would wonder whether those events are actual because how could the narrators (four of them) recall all those details if they happened a long time ago. You can immediately conclude that they are unreliable narrators and yet you can't stop reading because the beautiful lyrical prose of Sebald prods you to go on. I mean, his storytelling does not have concrete solid plot but there is underlying theme - vertigo, that is - that connects the four stories. I know. I know. Vertigo as a theme is like having a fluke as a trematode to discuss in your Biology class. I mean, who cares about flukes, right? But flukes are interesting enough because as parasites they can feed from many other species that they can even outlive. I mean, Sebald does not offer something new really but his style is distinct (free flowing narration that do not have plot yet his prose is lyrical and too hard to pass up on) and so you miss a lot by not reading his works.This is my second Sebald. My first was Austerlitz (4 stars) that I read five years ago. Five years ago and still I remember what it is all about. His books are not easily available here in the Philippines so I order them via Book Depository or Amazon.com but I swear that they are really worth your every hard-earned centavo."}, {"userName": "Szplug", "userReviewDate": "Jun 06, 2011", "userURL": "http://www.goodreads.com/user/show/1843184-szplug", "userReview": "It's interesting for me—as I reacquaint myself with the frequencies of the Sebald-via-Hulse literary signal—to contrast the prose styles of the late German and the modern French academic Mathias Énard, the author of the five-hundred-plus page shotgun blast \nZone\n: whereas Énard's amphetaminic, propulsive narration piles one gruesome event upon another with such energized and relentless urgency that no single scene is given the opportunity to overwhelm or paralyze the reader with horror, but rather blends and merges into a chiaroscuro of violence that swells in Döppler fashion as the conclusion approaches, Sebald slows the pace to a steady crawl, a languid and leisurely stroll through memory's arcade, taking time over and again to pause before a particular reminiscence—and its temporal residues—in order to fully absorb the vibrations emanating from its anamnestic position.It seems to me that each of Sebald's books represent the author working through his own collection of memories and reminiscences and, in individuating particular scenes, assaying to determine the degree of truth constituted within—and bemusedly lending free rein to the myriad brushes wielded by his imagination in filling in whatever gaps exist, easily crossing the ever hazy borders between fiction and (relational) fact—and fluidly intermingling unusual incidents from the lives and writings of historic personages whose physical and/or textual beings once occupied and performed amidst the same physical spaces where Herr Sebald places himself in the course of unfolding his eerily calm, episodic memory games—in order to flavor a recollection to better suit the memorial meal he is creating. Is the Sebald who narrates the books the same as the individual of the identical name who penned them? Does the placid shell splintered with cracks form the outer layer of both? How much does fiction abut, overlay, and obliterate the actuality of the past as remembered by the author? Could even he have stated the amounts with certainty before his untimely passing? It's a fascinating game we are privy to here, especially in that our own arranging of the past will influence that which the writer has put on paper for us to ingest and absorb; and the spicing provided by the shimmering drama enacted throughout his literary and historic borrowings finds the nodal points of similarity in perspectives unvaryingly alienated and chafed by the ebb and flow of the uncanny and unusual scenarios that life configures and bestows upon the human soul during the course of its journey in earthly incarnation—creating a framework of pond ripples that effortlessly sync with the perspective of any reader who has stood raw and bemused before the impenetrable mystery of his own life. That the eerie dissonances and asynchronous disturbances the author encounters when a reminiscence is invoked by a particular configuration of material and temporal settings and intersections—and visually represented or inspired by the strange and haunting collection of colorless photographic way stations liberally sprinkled about the book, pictorial lodestars guiding, succoring, and tethering the reader at select points along the textual voyage—can be understood and evaluated in coevality by a large proportion of his readers—whatever their age, sex, or nationality—is a testament to the German's ability to perceive the universal inherent within the uncanny interactions of the past and the present upon unique individuals, and to access it through the subdued and temperate working of his words.Such is the manner in which Sebald's writing subtly but palpably work upon the reader's emotions. I feel uneasy under the spell of his toneless inflection, infected with a piercing melancholy for all that has passed into shadow and will never again bloom strong and fulsome against the noonday sun; the brief passages about the squalid, boarded up, serrated roof tenement building standing like a rotted tooth in the Viennese jaw, or the ghostly flour factory dourly frowning upon the cluster of cluttered Italian renaissance in the Venetian lagoon, give me a peculiar shiver when I read them, exposing a nerve to some powerful current of existential angst, unearthing a deeply buried spiritual cavity where the life has been excavated in a manner similar to that of the natural world shattered and shifted and shaped to allow the imposition of our temporary temples to our tool-worshipping, technocultural, self-incarnated pantheon. Even when the story veers into a visit to Sebald's childhood home, the village of W. cradled at the foot of the Bavarian Alps, the characters and events recollected by the discomfited prodigal son are those of eccentricities, madnesses, depressions, and madcap antics that lead furiously towards an abyss eagerly anticipated as a release from the numbing inanity of the present. It is telling that the few intimations of human sexuality are those which have been either deeply repressed or proven of an ephemerality and futility, and that—in either case—have left their subject distressed and wounded; when Sebald recalls a heated tryst he witnessed whilst still a boy, the woman bent backwards and receiving the urgent thrusts seems more dead than alive, with eyes of a glassy mania that recall those of the crazed horses that have frightened the author for as long as he can remember. The novel's final sentence describes a London visited by a silent rain of ashes—it serves as an exquisitely apt summary of the contents of Vertigo: nature's cyclical bounty of the contents of tombs, the temporary structure of a temporal life that is perpetually being forgotten or altered even as it occurs.Fritz Leiber once wrote about how he found a decrepit alleyway in the urban midnight, with its silent spray of wires, pipes, shuttered windows and peeling façades, far more terrifying than castles or forests or the roiling seas, and it has stuck with me ever since. Sebald not only agrees with Leiber, he works these fears upon the wheel of memory to spin his uniquely disquieting marriage of the inanimate with the animate, the lifeless with the lived, the crumbling with the dead; a macabre and elegiac epic theatre that in its prime seemed conceived and written by a brilliant and daring virtuoso, but with the passing of the years has progressively revealed itself as the disturbing and decayed vision of a madman. Few other writers can so casually-yet-masterfully access the angst inherent within the transient nature of humanity—its life and its works—as set against the conception of forward-moving time as this enigmatic German genius."}, {"userName": "Jeff Jackson", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/811567-jeff-jackson", "userReview": "1) Inspired to pick this up after seeing Grant Gee's doc \"Patience: After Sebald\" which is currently streaming on Netflix. It's worthwhile viewing, especially for Iain Sinclair's comments about why Sebald chose not to put his work into English himself (he was more than capable) and the subtle transformation that happens to his prose through the lens of translation. 2) His first novel isn't as tightly constructed as The Emigrants or as brilliantly sprawling as The Rings of Saturn, but the web of connections is still dizzyingly complex and expertly woven - the closer I picked at the various strands, the more I was amazed at the patterns that emerged. 3) The Kafka chapter is pitch perfect, often laugh out loud funny, and the ending is gently breathtaking. Maybe the best thing he ever wrote. 4) Stendahl, sure, but I wasn't expecting to run across outsider poet Ernst Herbeck. 5) A German lit professor once told me to skip the opening chapter b/c it had nothing to do with the rest of the book. Nonsense. Read it all."}, {"userName": "Özgür Daş", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/35751923-zg-r-da", "userReview": "W. G. Sebald kendimi bulduğum ender yazarlardan biri. Yapıtlarında genel olarak geçmişin izlerini arayan, içsel düşünceleriyle gerçeği yoğuran bunu fotoğraflar, mektuplar, belgeler vs. gibi materyallerle destekleyen kimseye benzemez tarzı olan bir yazar. Kanaatimce Proust, Joyce vb. yazarların seviyesinde bir isim.Vertigo'da Sebald yine geçmişin peşine düşüyor. Avusturya, İtalya ve Almanya'da geçmişin izlerini sürüyor; ilk öykü büyük Fransız yazar Henri Beyle Stendhal'in imgelerindeki bozulmalara ve aşk girişimlerindeki başarısızlıklarına odaklanarak yaşadığı psikolojik yıkımları ele alıyor. İkinci ve dördüncü öykülerde Sebald bizzat kendi yolculuk yaparak gerçekliğin içerisinde geçmişin özlemlerini ve korkularını, maddenin hüznünü, bunaltılarını zengin bir dille anlatıyor. Üçüncü öykü ise Kafka'nın melankoli ve bunaltıları üzerine yoğunlaşıyor.\"Yabancısı olduğum şehirlerde bir şeyler yemek içmek için gideceğim yerleri nasıl seçtiğimi bilmiyorum. Bir taraftan çok seçiciyimdir, bir karar vermeden önce saatlerce sokak ve caddeleri arşınlarım; diğer taraftan çoğunlukla sonunda gerçek anlamda bir seçim yapmadan herhangi bir yere girer ve hüzün verici bir ortamda, iç sıkıntısıyla hiçbir şekilde hoşuma gitmeyen bir yemeği yerim.\"(s. 76)"}, {"userName": "MJ Nicholls", "userReviewDate": "Apr 18, 2011", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "It’s hard to write about what Sebald does, since his style belongs to a tradition of German writers such as Thomas Bernhard: it’s sparse, lyrical, poetic and formally original. Vertigo is the first of four “novels” where he pioneered his mix of memoir, historical lecture and evocative description. Like The Emigrants, the book is divided into four separate trips, whose connections (conceptual or intellectual) I am too feeble to understand. Each section explores the tension between memory and art, whether through evocative childhood paintings or landscapes etched into the narrator's subconscious. We might define ‘Sebaldian’ as work with a philosophical and personal bent that tackles big bad German themes like Weltschmerz or Kafkaesque alienation. This book also highlights the intrinsic ocular evil of equines."}, {"userName": "Jimmy", "userReviewDate": "Nov 21, 2010", "userURL": "http://www.goodreads.com/user/show/1325473-jimmy", "userReview": "\"He had no answers, but believed the questions were quite sufficient\" (p. 62)Now I have read all of Sebald's four major \"novels\". I feel, as I often do after reading Sebald, unable to say anything meaningful about his work, even though I was deeply moved while reading him. It seems funny to me, in retrospect, that I didn't especially like Rings of Saturn, the first book of his I read. I'm sure if I return to it now I will love it. His writing goes to the edge of so many things that it is easy to imagine one not liking it if they just aren't in the mood for this type of stuff, though lately I have been all about this type of stuff.Since I am again unable to say anything meaningful, I wanted to transcribe what I wrote about Sebald in my notebook while sitting in the park a few weeks ago:The problem with most writing is that it tries to do so much and what it tries to do is so predictable and in the same mode. I want a literature that is not trying to say anything, not the intention constantly hounding at every word. How to write for the barely visible? How to make it not seem significant, at least not in the normal ways? Approaching BOREDOM that is the goal. Even achieving boredom, which is a task--boredom that is not the result of boring writing--boredom which is carefully manufactured boredom in the reader which is a kind of constant attentiveness--a state of unease where the reader is potentially responsible for everything.Deliberately slowing down the pace, not deliberately beautiful, as if an accident. Signifiers not bundled together like a thesis--a sort of rambling that defies easy 'purpose', allowing the person speaking to be the only common element, that voice and his concerns which is larger than the piece of writing, that goes on afterward and was going on before, that the writing becomes a sort of artifact of his thinking & materializing perspective without DEFINING him, without concluding anything without easyness of \"saying\".It is not that it lacked significance, it's that the words did not create that significance. The words were like a rag, already soaked in whatever mysterious significance it needed--so that the words themselves didn't have to try to convey anything. The attention is focused back to the basic attention of the sentence, its parts taken simply which becomes a feat astounding by itself. To read every sentence as if it were the only sentence in the English language. To make a reader read it that way. How?I'd like to append that I do not completely stand behind all these thoughts, they are just jottings I made without time to revise or think through. Nonetheless, Sebald was on my mind when I was thinking about these subjects. Also interesting is this article I read about Sebald, in which I quote:It is clear that his work was as unfinished as it was original. And odd. It was work of high seriousness without pretension. That is, it engaged with many of the great themes of the literature and art of the past: war, peace, life, death, art itself, memory, absence, omission. But almost as prominent was—for a writer with such high regard for the history of individuals—the almost total absence of such concerns as love, sex, family, children; or of such ordinary (and powerful) emotions as jealousy, hatred, love (again) or greed.It is interesting that I never thought about what was omitted in his writings, which are very familiar themes in other writer's works. I would also add that \"love\" in that quote above should probably be amended to \"romantic love\", since he does convey a lot of friendship and deep connections between (usually neglected) people, as well as familial love. And also absent is humor, though there are glimpses where you can tell he was highly attuned to humor, but that his main concern, at least in his writings, lay elsewhere.I would like to say something about his technique of embedding images within his narrative, but I fear I have not thought it through enough to say anything interesting yet. Perhaps that will be something I can think about on a re-read, which I plan to do very soon, starting with Rings of Saturn.One last thing that I wanted to mention, and this is going out on a limb, is that it would be interesting to study the parallels between Sebald and Bolano. From the limited Bolano that I've read, I feel like they are approaching the same subjects and big questions from completely different angles and writing styles. Which means I should probably read more Bolano, since I also did not love the first (and only) Bolano I've read (2666). I will end with a quote from the book itself, since I have already rambled on long enough:\"The more images I gathered from the past, I said, the more unlikely it seemed to me that the past had actually happened in this or that way, for nothing about it could be called normal: most of it was absurd, and if not absurd, then appalling.\" (p. 212)"}, {"userName": "Sophia", "userReviewDate": "Aug 26, 2016", "userURL": "http://www.goodreads.com/user/show/12202286-sophia", "userReview": "2,5 στα 3 ⭐κανονικά αλλά λόγω εορτών νιώθω γενναιόδωρη! Για την κατηγορία \n\nB.R.A.CE. 2017 ένα βιβλίο που δανείστηκες \n\n και περαστικά μου!Το βιβλίο έχει 4 ιστορίες. Και στις 4 βρήκα κάτι. Κυρίως έναν ταξιδευτή, έναν άνθρωπο που με διάφορα ερεθίσματα θυμόταν και περιέγραφε γεγονότα και άτομα του παρελθόντος. Ο συγγραφέας είχε μια μικρή εμμονή ( έτσι μου φάνηκε εμένα ) με οδούς και πως και από που πήγαινε όπου πήγαινε.Δεν είμαι ικανή να πιάσω βαθύτερα νοήματα και παραλληλισμούς και να καταλάβω το \"τι εννοεί ο συγγραφέας\". Ξέρω να πω πως λίγο ζορίστηκα (στην ιστορία All'estero περισσότερο ) αλλά γενικά \"κύλησε\". Μου άρεσαν οι \"αναμνήσεις\" και οι αναδρομές, σαν μικρά κουτσομπολιά που λένε οι άνθρωποι μεταξύ τους \"Θυμάσαι τον τάδε που και όταν\" Δεν θα βιαστώ να διαβάσω κι άλλο δικό του, αλλά θα του δώσω κι άλλη ευκαιρία αν βρεθεί στο δρόμο μου.Το μεγάλο μου πρόβλημα ήταν με την έκδοση. ΟΚ να δεχτώ πως οι σημειώσεις είναι στο τέλος (δεν μου αρέσει, αλλά το δέχομαι. μου την δίνει το μπρος πίσω) αλλά να υπάρχει ένα σημάδι, κάτι που να υπονοεί ότι αυτή η λέξη π.χ. έχει σημείωση. Είχαν διατηρηθεί κάποιες ιταλικές φράσεις από τις οποίες κάποιες είχαν εξήγηση στο τέλος και κάποιες άλλες όχι. WTF! Αυτό το \"σετάρισμα\" με εκνεύρισε αρκετά."}, {"userName": "Sophie", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/14647179-sophie", "userReview": "Πρόκειται για ένα έργο που αναπτύσσεται με τη μέθοδο ροής συνείδησης, με αποτέλεσμα η αφήγηση να δομείται με σπονδυλωτό τρόπο, ενώ το ένα συμβάν ανακαλεί στη μνήμη του ήρωα ένα άλλο, προσδίδοντας, έτσι, μια αλληλουχία στα κεφάλαια, τα οποία φαινομενικά δε συνδέονται μεταξύ τους. Η πρόζα του Sebald θυμίζει όνειρο, ζαλίζει και θολώνει τα όρια μεταξύ πραγματικότητας και ψευδαίσθησης, αληθινού και πλασματικού. Παράλληλα, η χρήση εικόνων δίνει μια μοναδική ζωντάνια κι αληθοφάνεια στο κείμενο.This particular work of art is developed by the stream of consciousness method and as a result the narration is constructed with a modular way, whilst an event brings back to the hero's mind another event, arranging, thus, the chapters, which ostensibly have no connection, in a logical sequence. The dreamlike prose of Sebald stuns and blurs the boundaries between reality and illusion, real and fictitious. In addition, the use of images alongside the passages of the book gives a unique liveliness and plausibility to the text."}, {"userName": "Drew", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/4675538-drew", "userReview": "I think there's a strong argument to be made that this is a five star book; Sebald will routinely, with a seemingly quotidian sentence, compel you to feel almost breathtaking pain and loneliness--it's a crazy trick. And the last several pages are jaw-dropping in a way I won't spoil. The front of my copy of Vertigo calls Sebald \"memory's Einstein,\" and this pretty much has to be true since it's well established that Sebald can write a great book (or more than one) about what is essentially a walking tour, just by interpolating little historical or autobiographical side notes.So why the vertigo? Well, vertigo is really just a change in perspective--it's what happens when you've been looking at the ground beneath your feet, but then are forced to notice the immeasurable chasm two feet to the left. And it's an apt metaphor for what the book does; it wrenches you from your narrow perspective of history or geography or the human psyche, and forces you to confront a broader one: the madness of large-scale battle, or the effect of a secret rape on a small town, or the loneliness of maybe never being able to know love. A couple demonstrative quotes:\"There is something peculiarly dispiriting about the emptiness that wells up when, in a strange city, one dials the same telephone numbers in vain. If no one answers, it is a disappointment of huge significance, quite as if these few random ciphers were a matter of life and death. So what else could I do, when I had put the coins that jingled out of the box back into my pocket, but wander aimlessly around until well into the night.\"Or, from near the end, on a train trip: \"There was no room for doubt, however, about the reality of my poor fellow travelers, who had all set off early that morning neatly turned out and spruced up, but were now slumped in their seats like a defeated army and, before they turned to their newspapers, were staring out at the desolate forecourts of the metropolis with fixed unseeing eyes.\"And my big problem with Vertigo and maybe even Sebald in general is this incorrigible, pervasive, European-style world-weary fatalism. A wise viewpoint from an older person, especially a European (Sebald's historical reveries provide good evidence for fatalism as a philosophy, or at least I thought so), and in fact he makes it pretty hard to argue with him without sounding like a petulant American child. But you know what?I reject fatalism. I don't believe that what we have is the best we're going to get. I don't just want wisdom; I want truth. I don't just want sex; I want love. I don't just want law; I want justice. And I refuse to believe that these things can't be found. I claim the right to bite off more than I can chew, and to gleefully spit it all back into the sneering faces of the naysayers. I claim the right to disturb the comfortable, and in return I will do my best to comfort the disturbed. And though I am cynical, I cannot--will not--let cynicism govern my actions.And when I'm older and smarter and inevitably have accomplished so much less than I expected, I'll come back and read this again, and I'll doubtless find Sebald to be better company."}, {"userName": "M. Sarki", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/5562041-m-sarki", "userReview": "It seemed remarkable to me the ease in which I sped through this book. Not that I understood it all, I did not. Even though the translation I read was in English, the writing still felt foreign to me. The words for people and places, and even things, were unfamiliar, and from time to time I would skip back a few pages to see if I had missed something important in my understanding of this dream. Reading this felt like a dream. And often I would find myself pages ahead to somewhere I failed to understand how I could have gotten to. There have been enough moments in my life on the road when I have felt the same way. The many miles I drove each day found me in places I knew I needed to be but hadn't a memory of getting there. It was if the car had driven itself. My mind would wander. The experience was similar to reading Max Sebald's Vertigo. Others have claimed the same dream-experience regarding this book. It could go without saying that I will read this book again, most likely after I have read all four of the major Sebald works. It is comforting to me, the manner in which he writes. The way in which Sebald introduces something almost nonchalantly and then offers a treatise on the subject. But not exactly, because as soon as you get comfortable in this new direction his text has taken he swerves off the road again naturally, as if he meant to, and with such great skill the move feels not frightening at all. I am envious of the way in which Sebald records his memories. The grace in his athleticism on the page is nothing short of astounding. He is so coordinated in these actions. And the photographs add so much even if they are blurred and out of focus, tired and crumbling from years of being stored on dusty shelves in boxes tied in knots of twine and wire gauged in oil and overuse. A language foreign, but lined in memory, familiar but uncanny, and sounding out the truth he makes believable in my own world today, rife with its own skeptical and judgmental versions of a country's patriotic morals and delusional beliefs of superiority. Sebald instead adds to the growing number of this member group of like-minds against, but holds dear his own position of autonomy. And though the leaders of this memory-movement are mostly all dead, their numbers are expanding, daily, and with a fervor, in my mind, bordering on nothing short of something quite delightful. The insanity of made-time."}, {"userName": "Jim", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/1895570-jim", "userReview": "Perhaps one of the reasons I do not read as many contemporary writers is that I find myself somewhat at sea as each one works his or her own strange magic on me. There is something comforting about reading a Balzac or a Trollope. I know their worlds and feel at home in them. Poor W G Sebald, on the other hand, suffers from a sense of Vertigo as he travels around Europe, bringing up memories and strange historico-literary coincidences involving Stendhal, Kafka, Casanova and others -- and many somehow connected with that fateful year 1913. Living in England, he travels through Italy and Bavaria, ultimately returning to his childhood home of W., where everything has changed.In a conversation with the last surviving person from his childhood, Lukas, the following observation is made:He particularly agreed when I said that over the years I had puzzled out a good deal in my own mind, but in spite of that, far from becoming clearer, things now appeared to me to be more incomprehensible than ever. The more images I gathered from the past, I said, the more unlikely it seemed to me that the past had actually happened in this way or that way, for nothing about it could be called normal: most of it was absurd, and if not absurd, then appalling.Touché! I see it in myself, as I examine my past life, that I all too frequently rely on personal myths I have concocted to explain my life to myself. But when I check with old friends, I see that they do not remember me in that way at all.Sebald has an interesting habit of interspersing black and white photos and other illustrations among the text, some more relevant than others, but all suggesting a kind of strangeness that goes well with the author's meditations on the past and on his memories of childhood. In the end, I think I can read some more Sebald and feel good about it. Maybe a little vertiginous in my own way, but perhaps that feeling is also a part of my own life."}, {"userName": "Dhanaraj Rajan", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/4373783-dhanaraj-rajan", "userReview": "What can I say about a Sebald book?I can say only this much: It is no use trying to explain his book. The one and only solution - Buy the book and read it.What will you find?Sebald loves to travel and loves going on foot. That is what you will have to be prepared for - to travel. Do not worry about the new terrains and landscapes. Just follow Sebald. That is enough and he is an entertaining travel companion. Without you asking him anything, he will volunteer himself narrating some interesting tidbits on the way specifically connected to the locality. He will also very ably spice it up with some historical/biographical/literary/artistic details. By the time you finish the journey (at the end of the book), Sebald will vanish leaving you in an imaginary prison in which your mind will be a willing prisoner. Can you remember the details that Sebald narrated?May be or May be not. For, \"there is something strange about remembering.\" And our memory is stupid for it stores only what it wants. Or \"the overpowering sensation\" at the end of the book can blot out the memory entirely.If after a careful moment of rumination, you succeed to remember, will that be worth?I doubt that you could remember everything vividly. For each new episode will wipe out the previous episode except for some tiny details that emerge here and there to induce you to see a person/event/detail of the previous episode. And remember that: \"Tiny details imperceptible to us decide everything!\"What do you gain, if that is the case, from this book?A lovely experience of delirium."}, {"userName": "Carla", "userReviewDate": "Mar 24, 2014", "userURL": "http://www.goodreads.com/user/show/2007205-carla", "userReview": "Elucubrações produzidas por um homem-sombra, memórias, viagens em que se cruza com os fantasmas do (seu) passado. A morte é um sonho, um caminho, um incêndio voraz, um penhasco devorador, a neve que não derrete.Desconcertante.“Nos meus tempos livres, disse Salvatore, refugio-me na prosa como numa ilha. Passo o dia todo no meio da azáfama da redacção, mas à noite instalo-me na minha ilha e quando começo a ler as primeiras frases, é como se fosse a remar pelo mar fora.” (P.101)"}, {"userName": "trovateOrtensia ", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/9616721-trovateortensia", "userReview": "\"L'incrociarsi dei riflessi luminosi sul soffitto della stanza indica che, tra qualche istante, vi si dischiuderà un varco, che presto qualcosa si manifesterà.\" Ma il varco (così montaliano) non si apre: il senso sul punto di essere afferrato si sottrae, l'ordine è di nuovo sopraffatto dal disordine, l'atto stesso del ricordare appare impossibile, si rivela arbitrario, illusorio, menzognero. I ricordi \"sono una cosa davvero strana\", e le \"vicende ormai tanto remote\" rimangono in mano come le tessere di un mosaico impossibile da ricomporre. Questo libro ha creato in me una sensazione di profondo turbamento, di vigile allarme. Come un gioco di specchi in un labirinto. Una fuga di stanze lungo un corridoio di cui non si vede la fine. E' un libro che, a mio avviso, contiene le chiavi per la comprensione dell'opera di Sebald."}, {"userName": "Arthur", "userReviewDate": "Nov 08, 2009", "userURL": "http://www.goodreads.com/user/show/694421-arthur", "userReview": "\"Vertigo\" is a haunting book. I don't know that I should call it a novel. I don't know what it's about. But it's absolutely marvelous, a strange concatentation of digressions, anecdotes, minor incidents, memories, and random thought processes such as you experience when you're sitting on an airplane and the present is a transition that feels like a suspension of your \"real\" life.\"Vertigo\" feels as if the book is being whispered in your ear by a master storyteller who never gets around to telling you the story. There is a narrator, an \"I\"; there is a journey. There are dates given and locations named and causes linked to effects. There is an irresistible narrative pull. There are enough conventions deployed of the traditional Western novel to make you feel as if you know where you're going. But you don't. It's as if \"Vertigo\" is wandering through the ruins of the 19th-century novel. The main story line has been hollowed out of the narrative, and all that's left is a periphery of observation, incident, and digression. Yet you never feel that there's something lacking or that something is being unfairly withheld or postponed; each sentence feels full in the way consciousnes is full even at the quietest moment. And you always know exactly where you are; the stream of consciousness is presented in beautifully simple and precise prose. Moment to moment, there is no difficulty, no mystery--that is, none beyond the quotidian uncanny we all feel when we consider how little we know about what's going on around us. Cumulatively, however, the effect is of strangeness and beauty, and that most traditional and compelling effect of fiction: that you've experienced another life from the inside."}, {"userName": "jeremy", "userReviewDate": "Mar 27, 2012", "userURL": "http://www.goodreads.com/user/show/635936-jeremy", "userReview": "what to make of this melancholic, reflective, alluring work that so defies classification? memoir, history, travel writing, fiction, literary recollection of daydreams past? vertigo, sebald's first \"novel,\" is all of these many things at once, eclipsing and synthesizing their respective elements to form something unassumingly unique. while the conception of memory (and its inevitable antipode) is of interest to many a writer, sebald's patient, ruminative reflections stand out in the way that they are able to convey more than mere nostalgia for what has since elapsed. incorporating instances in the lives of stendhal, kafka, and casanova into his narrative, sebald enlives his own tale of exploration and evocation. as he wanders western europe both past and present, we witness the ever ongoing struggle to make sense of remembrance's infinite ebb. with rich, magnificent prose, vertigo, in spite of the dizzying effects of time's onward march that sebald aims to capture, is a lucid work that ambles a long way to revisit what's been left behind.\nmme gherardi maintained that love, like most other blessings of civilisation, was a chimaera which we desire the more, the further removed we are from nature. insofar as we seek nature solely in another body, we become cut off from her; for love, she declared, is a passion that pays its debts in a coin of is own minting, and thus a purely notional transaction which one no more needs for one's fulfilment than one needs the instrument for trimming goose-quills that he, beyle, had bought in modena."}, {"userName": "rmn", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/1036274-rmn", "userReview": "According to wikipedia, W.G. Sebald was a great writer. According to the novel Vertigo, either:A. I am not a great readerorB. Wikipedia is wrongThis book oscillated between boring and super boring, pointless and completely pointless, and meandering and whatever is more meandering than meandering.Sure, not every book needs a plot, but not only did this book not have a plot, but it didn't really have a point (though again point A from above may be right, so do with this as you will). To be honest, I don't even know how to write a review of this since I don't even know what it is I read. Imagine buying a magazine, but then just reading all of the copywriting from beginning to end and skipping the articles, that's kind of what this was like.To be fair, this isn't supposed to be one of Sebald's better works, but to be fairer, I don't care."}], "description": "Vertigo, W. G. Sebald's first novel, never before translated into English, is perhaps his most amazing and certainly his most alarming. Sebald—the acknowledged master of memory's uncanniness—takes the painful pleasures of unknowability to new intensities in Vertigo. Here in their first flowering are the signature elements of Sebald's hugely acclaimed novels The Emigrants and The Rings of Saturn. An unnamed narrator, beset by nervous ailments, is again our guide on a hair-raising journey through the past and across Europe, amid restless literary ghosts—Kafka, Stendhal, Casanova. In four dizzying sections, the narrator plunges the reader into vertigo, into that \"swimming of the head,\" as Webster's defines it: in other words, into that state so unsettling, so fascinating, and so \"stunning and strange,\" as The New York Times Book Review declared about The Emigrants, that it is \"like a dream you want to last forever.\"", "title": "Vertigo", "url": "https://www.goodreads.com/book/show/730376.Vertigo", "average": 4.03, "cover": "https://images.gr-assets.com/books/1348258687l/730376.jpg", "reviews": 254, "authors": [{"url": "https://www.goodreads.com/author/show/6580622.W_G_Sebald", "name": "W.G. Sebald"}, {"url": "https://www.goodreads.com/author/show/255721.Michael_Hulse", "name": "Michael Hulse"}], "type": ["Fiction", "European Literature", "Cultural", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/730376.Vertigo", "http://www.goodreads.com/book/show/18513988", "http://www.goodreads.com/book/show/80148.Vertigo", "http://www.goodreads.com/book/show/17615570-vertigo", "http://www.goodreads.com/book/show/10453097-vertigini", "http://www.goodreads.com/book/show/28076707-vertigo", "http://www.goodreads.com/book/show/2842109-schwindel-gef-hle", "http://www.goodreads.com/book/show/29082610-vertigo", "http://www.goodreads.com/book/show/821303.Vertigo", "http://www.goodreads.com/book/show/991825.Vertigo", "http://www.goodreads.com/book/show/13499932-vertigens-impress-es", "http://www.goodreads.com/book/show/88442.Austerlitz", "http://www.goodreads.com/book/show/434903.The_Rings_of_Saturn", "http://www.goodreads.com/book/show/76507.The_Emigrants", "http://www.goodreads.com/book/show/183922.On_the_Natural_History_of_Destruction", "http://www.goodreads.com/book/show/88444.After_Nature", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}