{"ratings": 11748, "userreviews": [{"userName": "Kerry", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/16188188-kerry", "userReview": "This lovely story about Jay & Jackapple Joe is one of my all time favourite books. I could read it over & over again.A story filled with nostalgia, a yearning for wonderful childhood memories, magic and trust. Jay goes on a journey of faith and self discovery, learning how to trust in himself and others, believe in magic and that anything is possible as he once did as a child. With a little help from Joe and his 'specials'. A wonderful heart warming tale that is a pleasure to read."}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "2018 Reading Challenge: fruit or vegetable in the titleI’m a huge Harris fan, but somehow this is the first of her novels I’ve read with a main male protagonist. I don’t typically gravitate to these types of books. RTC but I loved this as much as any of her other books. She’s a beautiful storyteller"}, {"userName": "Dolors", "userReviewDate": "Mar 21, 2013", "userURL": "http://www.goodreads.com/user/show/18383778-dolors", "userReview": "My first novel by the author of Chocolat and I have to say I enjoyed it far more than expected.The story of Jay Mackintosh, a 37 years old writer, famous because of an only novel written fifteen years ago. Jay seems to have lost inspiration and faith in the magic of life, as if all these feelings had been spent in that successful novel.The novel moves forward and backwards in time, and the reader is able to know young Jay, when he meets Joe, an eccentric old man who leaves a deep impression in lonely Jay, becoming his special friend and his secret hideaway.Home brewed wine made by Joe takes unusual importance in the present time of the story, because it's only when Jay drinks it that he finds the courage to change what makes him unhappy. Guided by a kind of Joe's ghost, Jay leaves London and moves to a little rural village in France where he buys an abandoned farm and where he starts writing again, inspired by his mysterious neighbour, Marisa.This is a book about haunted lives, unfinished stories and the chance to change your own life and atone for your past mistakes.Magic, wine, faith or simply luck and coincidence. Choose your own explanation.I'll stick to the magic and a bit of luck, as Jay says.It's only a matter of not losing hope completely and let others surprise you, with one foot in the Earth and the other one suspended in the air, letting the wind blow where it has to.Refreshing, heartening and uplifting reading. Great for dreamers and romantics."}, {"userName": "Chana", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/1400289-chana", "userReview": "I loved this story, or maybe I should say, I was in love with this story, I was in love with Joe and his eccentric ways. I loved the gardening, the wine making, the magic. I was in love with the bond of love between old man Joe and young man Jay. This is a book about the young man growing into maturity, into a man who can love a woman and a child and protect what he values. Growing into a man who can accept the weaknesses and mistakes of others, accept those same things in himself, and figure out how to make things better. It is about an old man passing on his skills and dreams to the next generation. It is about the value of the past to the creation of the future; respect and love for the land and diversity of species. Although the story has many fantastical elements the only thing that struck a somewhat odd note for me was Marise's past. Lovely woman, but more than her share of conveniently dead in her life and rather iffy taste in men, although let's hope that we are looking at a brighter future for her. Truly, I just loved this book. For me, it was better than Chocolat and better than Five Quarters of an Orange. I don't drink wine but I related absolutely to the wine in this story; to the stories it tells, to the stories it releases. Sometimes I want to hug a book. This is one of those books. I haven't yet looked to see how others liked this book, but I recommend it."}, {"userName": "Tracey", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/16973418-tracey", "userReview": "Nothing evokes memories like scents and Joanne Harris is a 'master' of descriptive prose that will bring memories flooding back.The senses are further brought into play with the sounds of the 70s nailed and remembered. The best times of my life childhood memories were exactly depicted in this wonderful story narrated by a bottle of 'fleurie' wine and the 6 'specials' which are filled with magic. Lansquenet the little french village of Chocolat fame is the setting for this book too along with some characters recognized from their also. The main characters are Joe an eccentric old man who brews wine, gardens, makes pouches of herbs that protect against bullies layman's alchemy he calls it and Jay a young lad who admires Joe and learns much of life from him the story follows Jay into adulthood in alternating chapters.If you want reminding of long hot summers, best friends and bike rides when we used to see magic in everyday things then treat yourself to Blackberry Wine.ps Today I was getting my last bits for Christmas and standing alone on the shelf a bottle of 'Fleurie'..... Karma? Layman's alchemy? magic Ohhhh I really hope so."}, {"userName": "Vonia", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/5204784-vonia", "userReview": "I read Harris' Five Quarters of the Orange & Blackberry Wine back to back, so I shalll review them together. They are very similar, actually; a little too much. Both feature lead female protagonists that have strong, proud, independent, walled-away personalities, unwilling to accept, let alone ask, others for any sort of assistance. In both, they are not the lead character, but as the focus of the protagonist, they are as, if not more, important. In Five Quarters of the Orange, this bold female character is Mirabelle Dartigen, the mother of present-day narrator Framboise Simon. In Blackberry Wine, Marise d'Api is the strong female lead, writer Jay Mackintosh's unfriendly, closed off, and mysterious neighbor. Like in all Harris' novels - the singular touch that ensures my return interest in her novels - both novels contain a food that serves as a saving elixir and the irreplaceable addition of magic and whimsy. The former uses an orange, the scent of which inexplicably increases Mirabelle's anxiety spells (for some time, admist verbal and sometimes physical abuse from her, Framboise surreptitiously leaves orange peels to seep through the ventilation so as to earn a reprieve). In the latter, the elixir is fruit-based wine, specifically a set of vintage '75s, which Jay Mackintosh finds in the remains of Pog Hill decades ago when he returns the summer following his unannounced disappearance.Five Quarters of the Orange tells a multi-generational story with lies, secrets, family database, but with redemption, love, healing, and perseverance shining throughout. Framboise, having had a tenuous relationship with her less than ideal mother (abusive, actually) all her life, she is surprised to uncover redeeming secrets written in code in a beloved cookbook that belonged to her. Her childhood took place during the Nazi occupation, causing more than typical difficulties in her young years. Along with her siblings Cassis & Reinette, they begin associating with a German Officer named Leibwitz. For varying reasons, each idolizes, to the point of compromising their integrity by becoming informants, providing information Leibwitz utilizes to blackmail their neighbors. They rationalize this by convincing themselves as well as each other that this is harmless; it is only words, after all, and it isn't like the Germans are murdering anyone. (Although one evening there is one somewhat accidental related death.) Framboise falls the most for Liebwitz. By, in fact, actually falling in love with him. Which leads to the event that has remained hidden for years, decades, in the family. The event that changed each of their lives forever. When he tells young Framboise that he can no longer see her, likely ever again, she cries, imploring that this not be so. When he refuses her pleas, she desperately convinces him to swim out to a dangerous area of the lake, simply to spend more time with him. He is caught in a root underwater and drowns. The three of them, Cassis, Reinette, and Framboise, surreptitiously make the body disappear, and never discuss the incident again. Their mother, despite showing no real love for them their entire lives, covers up for them when she finds out. They never know until present day that she even knew.All these events lead to the entire city shunning the family, and following one situation too many, they flee in separate directions, barely in time escaping death by the neighbors' wrath and need to designate a scapegoat. Of course, there is also the love aspect, a childhood friend, Paul, whom she eventually lets in. Together they learn to heal. If not forget, but to accept the past, their indivual secrets, and Framboise finally makes amends with her mother.Blackberry Wine I liked far less. Jay honestly seemed like an immature adult, left in the past. Worse yet, he is aware of it, yet quite nonchalant to the idea of changing. His personal relationships are minimal, he hardly allows himself aspirations, avoiding any real work. Honestly, none of the other main characters were that much better. His love interest, Marie A'pi, is a negative, closed off person for most of the novel. The ghost of Joe is more lovable, but honestly his presence was perplexing. I am typically a fan of magical realism, but the ghosts/spirituality aspect was not smoothly embedded into the story. it definitely stood out, causing the reading to seem off-kilter. Kerry, his initial love interest, was written like a bitch, clear and simple. All the other characters in the new town, neighbors to Jay, were not very deeply explored. Relatives to Marise (similar to the neighbors in Five Quarters of an Orange) were cold and unwilling to be understanding, believing only what they want to believe.The only character that was well-written for me was his childhood friend during his Pog Hills days. Gilly was courageous, spunky, and had a spirit that was lovable rather than unattractive. Marise's daughter, whom Jay initially mistakes for her, comes close to bringing back the spirit. In all, two fun reads, but I am still searching for a book from Harris in which the depth and overall significance of her words and stories match the way she has perfected the tone of magic and whimsy."}, {"userName": "Nikki ", "userReviewDate": "Aug 13, 2009", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "The first time I tried to read Blackberry Wine apparently wasn't the right time to try to read this book. This time, though, I read it practically all in one go -- with, yeah, a glass of wine. Joanne Harris' prose is always easy to read, really clear, and I can believe in the characters she creates at least enough to carry on to the very last page. Joe, in particular, rang true with me: a miner's son, a gardener, a Yorkshire lad... Jay, perhaps not as much, particularly not at the beginning, but yes, enough that I cared what happened to him.I love the everyday magic that Joanne Harris' characters work. Just normal enough that you can believe it's true for a while. Just close enough to coincidence or wishful thinking that if you can't step over into fantasy, you don't have to.I don't think I'm likely to reread any of Joanne Harris' books: I guess to me they're a bit like chocolate, or a bottle of wine. You can only have the experience once. But I do greatly enjoy them, and will be sad when there are no more that I can read."}, {"userName": "Ellen Black", "userReviewDate": "Oct 10, 2009", "userURL": "http://www.goodreads.com/user/show/2001979-ellen-black", "userReview": "This is a beautiful book, written by the author who later wrote Chocolat. Blackberry Wine takes place in both England and the same small French town that is the setting for Chocolat.Blackberry Wine tells the story of Jay, who as a boy, meets an eccentric man named Joe, who opens Jay's world to gardening and magic and homemade wine. As an adult and established author, Jay escapes his stifling life in England by buying a small cottage in Lansquenet, France, where he not only becomes a gardener, but writes another book, solves a mystery when he falls in love with a local woman scorned by most of the town, babysits this woman's daughter and goat, and is visited by the ghost of the late Joe, as well as an old girlfriend from London, who, unfortunately for Jay, is alive and still controlling and vicious.Beautiful book. I felt like I was tasting the words while I was reading."}, {"userName": "Chris Eastvedt", "userReviewDate": "Mar 21, 2012", "userURL": "http://www.goodreads.com/user/show/5092701-chris-eastvedt", "userReview": "I prefer tea….I have mixed feelings about Blackberry Wine, unfortunately more negative than positive. For the first ten chapters I despised this book: I didn’t care about the characters, couldn’t care about the plot and wanted nothing more than to just get through the thing so I could move on to another story. Even though the chapters are short, fifty-seven pages is more than I want to wait for a story to get interesting.Blackberry Wine describes the life of Jay, a one-hit-wonder in the literary arena who fell victim to the freshman curse and now lives as a writer of trashy sci-fi novels and part-time fantasy-conference attendee. One day he impulsively buys a farmhouse in France that brings back childhood memories and moves in, hoping to find what he thinks he’s lost. Via astral projection, his friend/mentor Joe, visits the farmhouse to continue giving the advice he started in Jay’s youth. Jay the adult reverts back to the child he was time and again in his bitterness at being abandoned by the old man’s sudden parting, continuing the legacy. Blackberry Wine is written as a piece of commercial fiction, but has definite elements of fantasy that feel out of place. This inconsistent tone added to my discomfort.One of the reasons I had trouble with this book is because of the way Jay is written. Personally, I thought he was schizophrenic, but I don’t think that was the author’s intention. He seems like an intelligent person, but has the insight of a fifteen-year-old boy coupled with a dog’s manic need to defend his territory (or in this case, Jay’s righteous indignation). Jay’s lack of maturity and poor decision-making ability mark him as a victim, a martyr, so I had trouble caring about him.This book jumps back and forth in time about every other chapter which I found distracting. The copious descriptions were a bit much and repetitive: how many times did I have to hear about the canal, or that something was yeasty- an odd word to be given such prominence? And don’t get me started on the magically animated bottles of wine….On the upside, once the story warmed up it was engaging. Jay’s garden renovation and the relationship with his neighbor and her daughter were nice, the practical peculiarities of Joe added color and interest and the French townspeople formed a nice backdrop. All in all I thought Blackberry Wine was flawed, but it did have moments."}, {"userName": "Jenny Sparrow", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/5876033-jenny-sparrow", "userReview": "\"Ежевичное вино\" - шестой роман Джоанн Харрис в моем зачете :)Главный герой - англичанин-писатель Джей Макинтош, повинуясь чарам \"Особых\" вин, созданных эксцентричным садовником Джо, и детских воспоминаний, приезжает в уже знакомый нам городок Ланскне-су-Танн, чтобы разобраться в своем прошлом и найти своё будущее.Я в восторге! Эта книга понравилась мне больше, чем все остальные (исключая, может быть, Леденцовые туфельки, хотя в целом, для меня сравнивать книги Харрис между собой по критерию \"нравится больше/меньше\" довольно трудно). В Ежевичном вине мне понравилось решительно всё - и сюжет, и новая встреча с Ланскне (не таким, каким он был в Шоколаде) и его жителями, и главные герои, и ретроспектива, и фрукты-вина-овощи-травы, и загадка Маризы, и напряжение тайны - в общем, всё-всё-всё. Последние страницы я читала так жадно, что засиделась вчера допоздна - не могла остановиться! Бесподобным назван роман в аннотации и я горячо присоединяюсь! Вот уж не ожидала, что буду в таком восторге. По сравнению с этим романом Остров на краю света кажется бледным, шаблонным. Шоколад всегда казался мне слишком затасканным, приторным на грани фола, Ежевичное же вино - как раз по мне!"}, {"userName": "Margaret", "userReviewDate": "May 12, 2013", "userURL": "http://www.goodreads.com/user/show/10549695-margaret", "userReview": "Of all the books written by Harris, this is my favorite by far. It is a delightful tale of young Jay MacIntosh and the friendship he develops with Joe Cox over the course of 3 summers spent at a small village in England. Joe's past is never made clear; his tales become truth and his truths become tales. The one certainty is that Joe, in his ramshackle cabin knows all there is to know about gardening, herbs and their \"magical\" healing and protective powers, and wine-making. Althouogh the quality of the wine could be debated. After Jay's parents divorce and he is sent back to school in London, his unhappiness is so great that he decides to return to Joe; only to find Joe has vanished without a good-bye.Jay grows up to write one acclaimed novel based on Joe Cox, his childhood friend, but no more great writing comes to him. When Jay sees a picture of a farmhouse in Lansquenet, France, he is reminded of Joe's dream of one day owning such a place. On sudden impulse, Jay buys the property without seeing it first, packs a duffle bag, his typewriter and a few bottles of wine he managed to retrieve from Joe's abandoned home and leaves his urban London life to farm and to write another novel.I loved the few references to Vianne and Roux (Chocolat); I also loved the fact that while a strong woman character enters the story, this is the story of Jay, a male character who is struggling to find himself and to put his friendship with Joe into perspective without the feeling of betrayal at not being able to say good-bye. There is still magic and whimsy, but it is without the darkness of the controversy between magic and the church. Finally, I loved the fact that Jay does write his next great novel with surprising results, and that he does win the struggle of finding out just what he has been searching for over the years. Oh! One more thing....the references to so many of the great songs in the 70's was a delightful, whimsical touch, no magic needed, that made me smile. (Springsteen, Beach Boys, Elvis...)_"}, {"userName": "Holli", "userReviewDate": "Apr 22, 2008", "userURL": "http://www.goodreads.com/user/show/1107216-holli", "userReview": "I really enjoyed this. I liked the setting (England and France) and the magical quality of the story. I liked the old character, Joe and in my mind saw one of our library patrons playing his part. It made me want to read more of Harris's books. I like the way she conveys that there is more going on in our lives than meets the eye.From Publishers WeeklyLike her well-received 1999 novel, Chocolat, Harris's latest outing unfolds around the arrival of an outsider in a tiny French town. This time wine replaces chocolate as Harris's magic elixir, and the newcomer to the village of Lansquenet sur Tannes is Jay Mackintosh, a 37-year-old has-been writer from London. Fourteen years have passed since Jay's debut novel, Jackapple Joe, won the Prix Goncourt. Since then, he has been churning out B-novels under a pseudonym; he currently lives with his girlfriend, Kerry, an aggressively successful 25-year-old celebrity journalist. Flashbacks reveal that Jay's only recollections of happiness are the golden summers he spent as a youth with old Joseph \"Jackapple Joe\" Cox in the small English town of Kirby Monckton. Joe, a colorful character who made wines from fruits and berries, inspired Joe's successful first novel. But one day he disappeared. When Jay stumbles across an advertisement for an 18th-century \"chateau\" in wine-growing country, the spell of his misery is broken. After downing a bottle of Joe's '75 Special, which he has been hoarding for 24 years, Jay decides to buy the house sight unseen. Leaving Kerry in London, Jay moves to Lansquenet and starts a new rural life, beginning to write under his own name again. He is bewildered by his reclusive neighbor, Marise d'Api, who apparently coveted his derelict house and land, and is ostracized by the townspeople. Jay's quest to discover why everyone, including Marise's former mother-in-law, blames Marise for her husband's suicide keeps the plot moving at a steady clip. Despite some unbelievable twists and a slightly uneven paceAit begins slowly, but by the last quarter races aheadAthis is an entertaining narrative, equal parts whimsy and drama. (July)"}, {"userName": "Janice", "userReviewDate": "Aug 23, 2014", "userURL": "http://www.goodreads.com/user/show/2513987-janice", "userReview": "When I compare this offering from Joanne Harris to her other books, it is just a meh response. I was disappointed. It flipped back and forth between 1975 and 1999 too rapidly. I couldn't really get into either period. The ending was abrupt, like the author herself was tired of the whole thing.I did like some of the characters - Joe & Rosa. It was nice to be in the company of Josephine and Roux again. And there was lots of wine and food to be enjoyed."}, {"userName": "gufo_bufo", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/70050060-gufo-bufo", "userReview": "Ci sono ricascata. Leggo qualcosa di un autore, e quando trovo il suo nome su un altro frontespizio mi sembra di ritrovare un amico e mi ci butto a corpo morto, come se il nome fosse una garanzia. Così, ho amato Joanne Harris per \"Chocolat\" e \"La scuola dei desideri\", decisamente meno per \"La spiaggia rubata\" e \"Le scarpe rosse\": ma dopo questo \"vino, patate e mele rosse\" credo di aver chiuso. Sempre lo stesso lo schema narrativo, il presente e il passato che si alternano, il mistero che si profila, il contrasto anglo-francese, tutto che si risolve e si compone nell'ultimo capitolo grazie a una lieve, sensuale magia. Carino una volta, anche due, ma ormai il gioco mostra la corda. Meglio dedicare tempo e diottrie a qualcosa di più succoso."}, {"userName": "Sonia189", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/16300378-sonia189", "userReview": "Another story with special elements by this author. It's been a while since I've read one of her books...I can't say if it's this book in particular or if too long has gone since I was enamored by the author's writing and/or voice but I just didn't seem to connect as well with this one.I liked it how it ended but between the lack of connection with the characters and the continuous jumping from one time to the other (action takes place in two moments, the main character's childhood summers and the present day) weren't aspects that pulled me in.It's also mentioned the narrator is the bottle of wine...well, it is but not in such an obvious way that I barely noticed it.Oh well, maybe another one in the future will bring me back to the author's favor."}, {"userName": "Юля Білоус", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/18509377", "userReview": "Харріс таки дуже моя письменниця - кожна книжка як якась вишукана і дуже смачна страва: от читаєш і реально \"смакуєш\" всі ті історії.А ще в мене якась особлива, трепетна любов до книжок, де оповідач історії зовсім не людина. Були вже книжки, де розповідь велася від імені смерті, від імені корови, від імені чорта, а от ця - Ожинове вино- ведеться від імені ... вина. Кілька бутилок домашнього вина, заховані в льосі старенького будиночку в маленькому містечку Франції розповідають не тільки історію свого створення, але і про людей, які його пили, які тримали його в руках. Я ніколи не хотіла в Париж, але в книжках Харріс оці маленькі французькі містечка і села змальовані з такою любовю і з таким натхненням, що дуже захотілося там побувати.Отож, кілька бутилок \"особливого\" вина розповідають історію одного письменника Джея Макінтоша. Переживаючи творчу кризу, він купляє маленький будиночок з виноградниками в містечку Ланскне (тому самому, де свого часу жила Вівєн і де відбувалися події книжки \"Шоколад\", тож кілька відомих імен зустрінуться;).В льосі Джей знаходить вже згадані бутилки вина, яе було зроблене ще в часи дитинства Джея, і, з кожним келихом цього особливого вина Джей згадує своє дитинство і дивного старенького Джо, який відкрив Джею не тільки світ дерев, овочів, ягід та таємниць їх вирощування, а й світ повсякденної звичайної домашньої магії... З кожним деревом, з кожною рослинкою Джо розмовляє, вкриває ковдрами, щоб не замерзли, розвішує обереги і талісмани, а потім готує з того всього вино, джеми, варення... Окрім оцих спогадів, вино розповідає і про Джея теперішнього, про містечко Ланскне, про його жителів... тут стільки маленьких згадок про життя в французькій глубинці, про місцеву кухню, про звичаї і традиції, що книжку читаєш на одному подиху.а ще тут щаслива кінцівка, правда щаслива в трохи нестандартний спосіб, на який можна сподіватися в такій історії;)дуже раджу почитати, а для більшої атмосферності запастися бутилкою ожинового вина;)"}, {"userName": "Telans", "userReviewDate": "Jul 22, 2014", "userURL": "http://www.goodreads.com/user/show/8095789-telans", "userReview": "Похоже, у Харрис такой фирменный стиль - маленькие городки, Франция, обыденное волшебство, цыгане на заднем плане, матери-одиночки с дочками, непонятые окружающими, и несколько секретов в шкафу. Во всяком случае, *Ежевичное вино* и *Шоколад* этим всем очень похожи.*Ежевичное вино* - роман взросления. Запоздалого возможно, но взросления. Главный герой пытается разобраться с собой (уже довольно длиииительное время) и в себе, в чем ему, незадачливому английскому писателю, очень помогает одна французская деревенька, парижанка с рыжеволосой дочуркой, несколько бутылок фруктового вина, обладающего волшебными свойствами, и вздорный астральный старик-шахтер, посвященный в магию семян (и жизни). Милая книжка. Летняя и легкая. Такая себе кавер-версия \"Вина из одуванчиков\"."}, {"userName": "Candy", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/4044719-candy", "userReview": "I read this book as a recommendation from my monthly book club. As someone who might be described as enjoying a glass of wine (perhaps two..), I was looking forward to reading it. I thoroughly enjoyed it. I loved the characters, the tiny town in France, the bottles of wine that \"spoke\" (I could relate to that), to Jay and to the belief that all good things can come from a little magic. Because I so enjoyed the movie Chocolat (I had not read the book), I went into this book thinking that it would have the same kind of magic/mystery about it. I was not disappointed. When you read this book, you won't be either!"}, {"userName": "Sorento62", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/5235304-sorento62", "userReview": "Joanne Harris paints a picture of intense summers of childhood alternating with farming life in a small French village, interwoven with threads of magic. Unfortunately the regret and ennui of the main character permeate the majority of the book, which made my experience as a reader ho hum.It all came together with a satisfying ending. However, on reflection, the one-sided negative portrayal of several women characters in the book leaves a bit of an unpleasant aftertaste."}, {"userName": "Kristen", "userReviewDate": "Jun 05, 2007", "userURL": "http://www.goodreads.com/user/show/117033-kristen", "userReview": "After enjoying Chocolat so much, I couldn't wait to read another book by this author, but I remember being very disappointed in this book. Not quite in the same league as Chocolat or even Five Quarters of an Orange."}, {"userName": "Barb Lawrence", "userReviewDate": "Sep 16, 2008", "userURL": "http://www.goodreads.com/user/show/1389365-barb-lawrence", "userReview": "This book offers everything I want in a novel: magic, superstition, gardening, introspection, interesting characters, nostalgia. Yet another book I had to read with pen in hand so I could underline favorite passages. Similiar to Alice Hoffman, Joanne Harris is my new favorite author."}, {"userName": "SarahJaneSmith", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/38279936-sarahjanesmith", "userReview": "I don`t get the alleged magic of this book. Boring... So I`m out, having read about 130 pages."}, {"userName": "Victor", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/6115077-victor", "userReview": "What a wonderful read this is. Thoroughly enjoyed both the plot and the narration of 'Blackberry Wine'. A punch of intoxicating senses which vapouriser's the encantation of the past at every page turn, from page one to the last page. One can almost taste the wine bubbling and working it's magic on the reader too. Super. 'I've had me fill now and bah gum.It tasted ta' right. Hope thee enjoy thy'sen with'dabook, twa's a bloody good read!'."}, {"userName": "Laura B. ", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/18318673-laura-b", "userReview": "Writer's block has building blocks and built these walls around me I don't feel lucky in hereburied in my headI'm seeing red and nothing else- mad all the time by waterparksI could't get these lyrics out my head the entire time whilst reading this book"}, {"userName": "Evgenia", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/8672234-evgenia", "userReview": "Не одном дыхании...\"Ты не можешь!\" - \"Нет такого слова.\""}, {"userName": "Jane Campbell", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/4419237-jane-campbell", "userReview": "Meh. Disappointing. I found the story predictable, the characters underdeveloped, and the theme a familiar one. I hear happy to finish the book and get on to a new book."}, {"userName": "Isabella May", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/68610499-isabella-may", "userReview": "Stunning. Magical and compelling. A book I didn't want to end!"}, {"userName": "Filipe Miguel", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/5855795-filipe-miguel", "userReview": "Não há qualquer dúvida de que gostei do que li, ou não fosse fã confesso da escrita e imaginação da autora, mas pela primeira vez, num livro de Joanne Harris, não senti satisfação do principio ao fim. Aliás, foi precisamente aí, principio e fim, que surgiram as grandes dúvidas.A história começa abruptamente e abruptamente acaba. No espaço de poucas páginas, damos por Jay a tomar uma decisão impulsiva que o leva a abandonar a vida que leva e a lançar-se em algo que ele próprio não sabe o que é. No final, em pouco mais de três folhas a narrativa é encerrada, quando parecia haver potencial para bastante mais.Pelo meio temos o verdadeiro sumo do livro, a mistura que lhe dá real cor e cheiro. Passado entre meados dos anos 70 e o final do século XX, andamos sucessivamente a saltitar entre Pog Hill Lane em Inglaterra e Lasquenet em França. Seja a acompanhar Jay nas suas peripécias de criança ao lado do transversal-ao-tempo Joe, ou a visitar com ele Lasquenet, todos os momentos são preenchidos e saborosos. Conhecemos personangens \"marcantes\", como Marise e Rosa, outras não tão marcantes, Zeth e Kerry, mas ficamos com a impressão que podia ter sido servido algo mais delas. Na realidade, sendo verdadeiramente sincero, não considero que cheguem a ser marcantes. Deveriam ter tido mais peso na história e não aparecerem apenas de passagem. No fundo, todos ficaram entregues à condição de acessório e foi passada a ideia de que nada mais importava senão Jay e os seus devaneios Joeísticos.A subida de Jay nas impressões gerais da população de Lasquenet, contudo, é interessante e chegamos a sentir-nos embebidos por toda aquela calma e \"fofoquice\", tão típicia de lugares pequenos.Quanto a Lasquenet propriamente dita, poderá ser uma qualquer aldeia junto a um rio, com pretensões de crescimento, carregada de nostalgia e com medo desse mesmo desenvolvimento. Pitoresca q.b., com habitantes cliché (facto que não os torna desinteressantes, de forma alguma!), cheia de virtudes e defeitos.Chegados ao fim, ficamos com a sensação que estivemos a ler um livro extremamente bem escrito sobre o quotidiano, que versa sobre a infância, sobre a vida adulta, sobre impulsos, crenças, magia e... sabores, sobre tudo e sobre nada. Talvez lhe falte um pouco de sal. Acabaram-se os Especiais, acabou-se a história!PS - Considero a tradução do titulo do livro mal conseguida, pese embora não destoe do conteúdo. Preferia um Vinho de Amoras ou Vinho de Amoras Silvestres, ao invés deste Vinho Mágico, um tanto ou quanto infantil.Rating: 3.5/5.0"}, {"userName": "Lynne Agnew", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/46744088-lynne-agnew", "userReview": "Absolutely magical, in every way. A tale of every day magic.... the bottles of Joe's special red wine, the mid life crisis of Jay, a one book author with writers block. I love the way it weaves between now and the past. But I particularly love old Joe, his everyday magic and humour. I read this book once a year with a glass or two of red wine and enjoy every second."}, {"userName": "Kathleen", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/1062592-kathleen", "userReview": "Fair warning: I’m on a bit of a Joanne Harris binge these days. ”Blackberry Wine” is the story of a writer, widely acclaimed for an insightful novel written fourteen years earlier and financially solvent from lesser sci-fi writing, who is now stuck on so many levels. The novel alternates between Jay McIntosh’s memories of three summers over twenty years before and the present. Adolescent, lonely, left adrift by his parents’ egocentricity and divorce, Jay finds solace from an eccentric, mysterious man whose stories he is not sure he believes. Nevertheless he is mesmerized by them and what the old man can grow on land that would seem unable to sustain any living thing. Over the course of three summers he learns as much as his adolescent personality allows him to understand about living resourcefully, close to the earth, “having a heart,” and a bit of magic. Meeting a fearless young girl who shares his fascination with found objects in Pog Hill and the dark canal nearby, he fills his days with adventure and finds courage sometimes to stand up to the bullies that troll the area. In the present, Jay McIntosh, self-centered, self-pitying, impulsively buys a property in the tiny village of Lansquenet and flees London and his live-in girlfriend carrying six bottles of homemade wine from those summers long ago. Surrounded by many of the characters from “Chocolat” and “Peaches for Father Francis,” he immerses himself into the lives of the villagers, finding another \"important\" novel to write, rebuilds his farmhouse and land, pays attention to the magic of the six bottles of wine, and finally finds his way. The pull of this novel for me is about the rebuilding of land and heart and the story of Jay’s reclusive neighbor and her daughter, resiliency and fierce love set against the gossip of the village. Jay spends a lot of time in the novel battling anger that I couldn’t always understand its power to blind or mislead him after so many years (I am a believer in the “moveon.com” philosophy), but this is still a rich, sustaining story filled with lush descriptions of the land, the people, and their conversations."}], "description": "Em Vinho Mágico a história é-nos contada por uma garrafa de Fleurie 1962, um vinho vivo e tagarela, alegre e um pouco impertinente, com um acentuado sabor a amoras.Jay Mackintosh, em tempos um escritor de sucesso, encontra-se em crise, leva uma vida sem sentido e entrega-se à bebida. Até ao dia em que abandona Londres e se instala em França, na aldeia de Lansquenet (a mesma aldeia que serviu de cenário a Chocolate, o primeiro romance de Joanne Harris). A partir daí a sua vida vai modificar-se, nomeadamente por acção da solitária Marise (que esconde um terrível segredo por detrás das persianas fechadas) e das recordações de Joe, um velho muito especial que conheceu na infância e que lhe ofereceu precisamente essa garrafa de propriedades invulgares e misteriosas...", "title": "Vinho Mágico", "url": "http://www.goodreads.com/book/show/3439816-vinho-m-gico", "average": 3.79, "cover": "https://images.gr-assets.com/books/1379858839l/3439816.jpg", "reviews": 747, "authors": [{"url": "https://www.goodreads.com/author/show/9432.Joanne_Harris", "name": "Joanne Harris"}, {"url": "https://www.goodreads.com/author/show/2877841.Maria_Jo_o_Neves_Pereira", "name": "Maria João Neves Pereira"}], "type": ["Fiction", "Magical Realism", "Cultural", "Contemporary", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/3439816-vinho-m-gico", "http://www.goodreads.com/book/show/15101.Blackberry_Wine", "http://www.goodreads.com/book/show/15104.Blackberry_Wine", "http://www.goodreads.com/book/show/7426094-blackberry-wine", "http://www.goodreads.com/book/show/3238427-vino-patate-e-mele-rosse", "http://www.goodreads.com/book/show/2903468", "http://www.goodreads.com/book/show/321573.Blackberry_Wine", "http://www.goodreads.com/book/show/262184.Blackberry_Wine", "http://www.goodreads.com/book/show/47401.Chocolat", "http://www.goodreads.com/book/show/15096.Five_Quarters_of_the_Orange", "http://www.goodreads.com/book/show/15102.Gentlemen_and_Players", "http://www.goodreads.com/book/show/2227371.The_Girl_with_No_Shadow", "http://www.goodreads.com/book/show/321572.Holy_Fools"]}