{"ratings": 33, "userreviews": [{"userName": "Bob Milne", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/2224905-bob-milne", "userReview": "\"What is normal?\"It's a good question, and one you'll never look at quite the same way again after reading Amanda McNeil's Waiting For Daybreak. Taking her inspiration from I Am Legend, Amanda offers up a first-person exploration of the last human being on Earth scenario . . . but then ups the stakes with a narrator who was already asking the question \"What is normal?\" long before the world devolved into a mass of angry, violent, brain-eating zombies.Frieda is a young woman with a borderline personality disorder, one that causes dissociative fugues where she becomes angry and violent, and leaves her with no memory of her actions later. As if that weren't enough, she also suffers from anxiety and depression, often resorting to self-harm in order to alleviate the psychological pain. Despite that, Amanda portrays her more as quirky than crazy, establishing her as a very likeable, extremely sympathetic character. It quickly becomes clear that her personality (and the isolation it imposes upon her) is largely responsible for her being spared from the outbreak.The first half of the novel is like a diary of her survival. We learn about how she's fortified her apartment, how she's cultivated balcony and rooftop gardens, and how she deals with the Afflicted (i.e. zombies) who get too close. We also get to explore a bit of her back story through her memories and musings on the last few days of her life before the outbreak. Where the story takes an interesting twist is when her cat, her sole source of companionship, becomes ill. Forced to embark on a dangerous scavenging mission to the veterinary hospital across town, Frieda leads us on a frantic chase through the ruins of the city, confronted more than once by the hungry, only to discover there's at least one other human being left alive.The second half the novel then becomes something of a post-apocalyptic love story. It's an interesting and awkward romance, one that you want to succeed for Freida's sake, but which you just know in your gut can't end well. Convenience and desperation are never a solid foundation for a relationship, and when both lovers suffer from their own issues with depression . . . well, the potential for disaster looms large. This is where Amanda really gets to the heart of the novel, using Freida and Mike to question just what is normal - pre and post apocalypse - and whether it's better (or, perhaps, easier) to just be like everybody else.I won't spoil the ending, but it took a turn that quite surprised me, leading to an action-filled climax that worked exceptionally well. While I found it a little light on detail on some areas, and felt as if there were some secrets about Mike that were hinted at but never fully revealed, the writing is solid, the dialogue creatively engaging (even with Freida's silent cat), and the novelty of the personality issue alone definitely makes this worth a read.Originally reviewed at Beauty in Ruins"}, {"userName": "Hira", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/4356644-hira", "userReview": "Let me first confess to a few things - I'm a bit wary of Indie books, and Indie authors! *Gasp* Yes, I hear your collective gasp, and trust me, I am appalled at myself, too - but I assure you it is not because I am a publishing snob of any kind, but because I am wary of if I would like the book or not, if I will find editing discrepancies, etc. You see, I mostly try to avoid putting books I don't care about on my blog - I believe they just don't deserve the time it takes to write up something special, even if it's antagonizing, about them. I cherish my creative license as a blogger and book reviewer to say anything I damn well please about a book - and if I do so, I might be leaving the carcasses of an indie author's dreams in my wake. So yeah, as a general rule, I limit how many indies I take up for reading/review. But when I spoke with author Amanda McNeil, I instantly knew I'd say yes to reading/reviewing and going so far as to be part of her blog tour. Are you wondering why? Because she appeared to be extremely charming, disarming and incredibly sweet - and I realized, this intelligent woman will not hold my opinions against me, even if they may not be in favor of her book. Knowing this, makes me feel at ease, knowing I'm not harangued by limitations.Since I used the word \"confessions\" - confession #2: Before 2009, every time I heard the name \"Frieda\", I thought of Frieda Kahlo. After 2009, every time I hear the name \"Frieda\", I think of Frieda Pinto. The former was a remarkable woman...the latter makes me nauseous for being heralded as a starlet, when you and I both know she is just a talentless, cardboard bland actress with stunning looks. So, automatically, I have a distrust of characters named Frieda. Now, I know you are thinking, how in the world are either of those two things pertinent to the \"REVIEW\" for this book (that, or you are seriously wondering if I'm crazy, and that would make the two of us my friend!)? Well, here's how...I'm blown away!Simply put, I'm blown away by this indie author, and this indie novel. That entire fear being disappointed by this indie novel was completely unfounded, because this book is wonderful. And this Frieda, well, let me tell you I'd take this Frieda over Ms. Pinto any given day! (But seriously, if this novel is ever optioned for a movie, and they chose Frieda Pinto to play Frieda...I'd slit my wrists!)Frieda (not the actress) is a dynamic character, and an immensely interesting one, at that. She has Borderline Personality Disorder which means she dissociates into an angry and violent personality, from time to time, with no recollection of the things she says and does during those lapses. As most such patients with behavioral and mental health issues, Frieda also suffers from bouts of anxiety and depression, and having to deal with these issues often sends Frieda spinning into a world where she inflicts harm and pain upon herself, in order to refrain from facing the actual pain of her disability. Addled by these psychological hurdles, Frieda is constantly trying to asses \"What is normal?\", in her world. Her quest for the meaning of life, and her existential pondering and musings make her an unlikely, but ultimately quite perfect, heroine of our novel.The first half of the novel reads like Frieda's journal as she navigates a new world - a drab, destroyed, post-zombie apocalypse world, where society has crumbled, and Frieda and her cat appear to be the lone survivors. As we explore the daily routines of our heroine and her trusted feline companion, the book opens up like a flower and introduces us to the innermost thoughts and emotions of a troubled, yet beautiful, mind. Those who are fans of zombies, and the gore and carnage that this genre usually bequeaths, don't worry, this book does not disappoint - the action is coming, just you wait. But understand, this book is not merely about zombies, and it is not merely about survival - it is about all that, and it is about what it means to be different in the world, and how that changes when the world you knew no longer exists.The second half of the novel gets more interesting as we are introduced to Mike! Aha, the plot thickens! A post-apocalyptic, awkward romance ensues. Why is this romance awkward? Well, it's difficult navigating the uncharted seas of relationships in \"normal\" life...can you imagine how this changes in a world where you might be the only people left, with all norms and traditions out the window? Especially given our heroine and her \"disease\"? Well, in some ways Mike and Frieda connect on a personal basis, what with their struggles with mental illness - but, they are also thrust into a world where they didn't choose each other, but were thrust upon each other, by way of being out of choices. Ahhh... not an auspicious beginning for a romance, right? Well, trust me... you are going to want to read this novel to find out where this unique romance goes.Finally, the book picks up it's languid pace, and hurtles forward into action and drama, resulting in a climax that is action filled and will keep you at the edge of your seat. And the ending...oh, the ending...well, it is safe to say this ending shall surprise you! This book may have gotten one less star than how many I have given it, because I think there are other aspects of this novel that could be better explored (or perhaps I just want to read MORE from author Amanda McNeil! LOL) - but the reason it gets FIVE STARS, is because I simply loved how well-realized, and well-developed author McNeil's characters were, ESPECIALLY Frieda. Amanda writes about mental illness with sensitivity, and yet never fails to make it interesting. All in all, Amanda McNeil has created quite an interesting world in her novel, \"Waiting for Daybreak\", and I assure you, you will be reading it all night and through daybreak, scurrying to try find out...what IS normal?"}, {"userName": "Shelley", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "*Genre* Dystopian, Zombies*Rating* 3.5*Review*WAITING FOR DAYBREAK is the story about Frieda (no last name) a presumed 20 something who lives in Boston and works in a hospital. She survived the end of the world as we know it and learned how to live with the threat from The Afflicted (zombies) who now rule the roost and roam freely without anyone to stop them.Frieda is a character who is far from perfect. She suffers from crippling Depression and battles reality as well as the zombie hoard. McNeil states emphatically that the cause of this epidemic was a virus that quickly spread around the world after some sort of conflict in the Middle East. Unaware airline travelers spread the disease far and wide because they didn't know they were carriers of the virus. Frieda is also clever. She has learned how to keep herself safe from the hoards, as well as growing her own food. She lives in a comfortable yet strategically placed apartment on the top floor where zombies don't normally look for their food. She also has an adorable cat named Snuggles who is her only companion.It's fun to read other reviewers who state this is a take off of I am Legend. Having read that book, and seen the original Charleton Heston and Will Smith's Remake, I can see basic correlations like the fact that Frieda believes she is the last human alive on planet earth. Yet, there are differences as well and that's because McNeil tossed in a love interest by the name of Mike to make things interesting.Final thoughts* After speaking at length with the author, there will be another book in this series and we will get to see more of Frieda and Snuggles! Yay!"}, {"userName": "Ellie Hall", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/9161938-ellie-hall", "userReview": "This book was requested for review. I am a long time follower of Amanda’s reviews.Since I read ‘Waiting for Daybreak‘, Amanda has begun her promotional blog tour and she has had a chance to express her intention in writing this story more clearly than in a 200 word blurb. That is a very good thing. I hope that readers like myself who have followed her reviews will have followed the blog tour and gained a feel for her book’s strengths, and so will not be holding expectations of the book which it was not intended to meet.If I had begun reading knowing what to expect, a YA story of emotional development, I would have given grace to the author and trusted her to introduce me to Frieda and her innermost fears. Instead, I began reading a post-apocalyptic science fiction zombie story, well written, but with some serious flaws. That made me wary and I questioned, then, what Frieda was revealing to me.I wavered for a long time over a rating for Waiting for Daybreak. I couldn’t decide between a three – ‘this is an okay read, but….’ and a four – ‘this was a good book; it ticked most of the boxes; go ahead and read it.’I settled on the four stars so I should start with what I loved about it.This is not a long book and it moves along at a clip. The story flies by and it is thoroughly engrossing, with periods of action and adrenaline nicely balanced by periods of memory and self-reflection. The sense of danger and suspense is well developed, and the narrator’s doubts and fears are easily understood. It is not hard to empathize with the characters in this book.The main character, Frieda, has a dissociative mental illness. She is socially inept and has a history of deep depression, substance abuse, and self-harm. Her journey toward daybreak is compelling and well told. As a book about Frieda, it is well worthy of its four stars.But ….To begin with the coloquialism of the grammar and syntax grated every now and then. As I read on, however, I decided that as a first-person present-tense narrative, I was reading the words of the character and not the author, so that minus moved closer to a plus.Secondly, as with most addictions, self-mutilation acts a dampener to emotional development, which explains the immaturity of Frieda’s actions and reactions. Her flawed decision making processes would then also have been deliberately plotted by the author. But it was difficult at first to know if they were intentional or if Frieda was an awkward characterization, acting as the author believes any reader in the same position might act. In the end I decided it didn’t matter; she is as she is and she acts as she does. As a vessel for sharing understanding of mental illness, she is better than many. Again, as I continued reading I became more aware and more convinced of the fact that I was following Frieda’s inner story more than an apocalyptic story.Ultimately, these issues only arose because I struggled with the genre tags. With the freedom of self-publication, genre definitions are being blurred and discarded. That is fine, but it can make it hard for readers to connect to the stories they enjoy and for authors to direct their work toward its ideal market. By its nature this book is going to appeal to readers of two distinct types, and I am not certain either of them will find what they want unless the reader understands exactly what it is about.It is framed, primarily, as a post-apocalypse zombie survival story. For readers who want that, it does not work very well; it is two dimensional. The opening scenes are straight out of ‘I Am Legend’, the remainder from ‘Shaun of the Dead’, with the splatter/melodrama/comedy intact. I apologize if that sounds harsh, but there is no nuance at all in this zombocalypse. It does not seem well thought out in regard to Frieda’s methods of survival, or the series of events that establish the story in its place. True devotees of zombie tales are likely to shred these elements.The second group of readers, however, those who enjoy a sympathetic journey through the worst experiences of young adult angst, will find a gem. It is a story which asks the reader to question what is normal, as Frieda is forced to examine her darkest demons – those inside her head not those outside. I am not entirely sure they will find it, hidden as it is in its zombie-colored camouflage. The zombie apocalypse is no more than a crisis event on which to hang the threads of a deeper emotional story, and that is not made plain in the introductory blurb.In summary, properly marketed so that it finds its way to its best readership, this book is deserving of four stars. If it is picked up by zombie aficionados, it will suffer. I hope the author reaches her intended market. Its tags at Amazon clearly show a primary reference to the lesser zombie/horror without mention of the superior emotional interior landscape. [zombies, horror fiction, dead series, post-apocalyptic, zombie apocalypse, etc] Its tags need boosting toward soul-searching, mental illness, and personal development.Four stars."}, {"userName": "Kayleigh", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/4279209-kayleigh", "userReview": "Confession time. Considering I spent last year writing a thesis about zombies, and am currently 6 months into a PhD on the same subject, I usually detest zombie books. I'm not really sure why, I've never had a bad experience with zombie fiction but for whatever reason it doesn't fill me with the same joy and excitement that zombie films and video games do. So I went into Amanda McNeil's Waiting for Daybreak a little reticent, but hoping- as I always do- that it'd change my mind. Within a few pages I was pleasantly surprised, and knew I hadn't made a mistake accepting this book for review.Yes there are zombies in Waiting for Daybreak (referred to as the Afflicted) but they are more a backdrop for the events surrounding protagonist Frieda, than a focal point. Affected by anxiety, depression and self-esteem issues (to name a few), Frieda has never felt like she truly belonged in society. Thanks to the zombie outbreak though, society basically no longer exists and Frieda actually seems to be doing OK. Much like Justine (Kirsten Dunst) in the film Melancholia, Frieda always felt like her world was falling apart, so when it actually happens emotionally she's better prepared than most people. Armed with only her cat for company (best survival partner ever!) Frieda lives her life day by day, cultivating plants on her roof, reading up on canning and fruit preserving for the coming winter, rearranging the house to better prepare for potential zombie attacks...you know, the usual. But when her cat gets sick, she's forced out into the ruins of the city she called home in a desperate attempt to save her only friend, and perhaps herself too.On her trip to the animal hospital, Frieda comes across another unaffected person, the first she's seen in about a year. Mike is around her age and attractive - and not just in a \"haven't seen a person in over a year\" kind of way. Although he does have a barbed wire tattoo - so maybe the zombie apocalypse has more to do with the attraction after all! They decide to stick together and during their lengthy (and dangerous) trip to the hospital the two of them bond over their pre-zombie eccentricity and post-zombie attraction. Of course, it's not all smooth sailing. Frieda's pre-zombie anxiety and self-esteem issues return full force, and Mike has his own share of issues to deal with. The biggest question in this book is not whether they can survive an attack by the zombies, but can they survive themselves and each other?I loved that Amanda McNeil took something that's currently in vogue and twisted it to explore the psychological issues of the book's characters. Frieda only survived the initial attack because of a 'black-out' after a particularly upsetting date, and her continued existence seems to hinge on her ability to survive alone and outside of society. Mike seems to be in a similar boat. A question raised often through the book (whether in text, or just in my mind while reading) is why are the only two people left alive (at least who have run into one another) people who have a history of mental illness and self harm? As the synopsis asks \"Frieda can’t help but wonder if she now counts as healthy and normal, or is she still abnormal compared to every other human being who is craving brains?\" In the first half of the book Frieda's current stability is demonstrated by juxtaposing a series of current-time interactions with zombies and maintaining her fortified apartment with flashback scenes from before the zombie outbreak where she was much more fragile mentally and emotionally. After Mike is introduced their relationship serves as the catalyst for unease, tension and uncertainty. The constant threat of zombie attack only adds greater stress as the two struggle to maintain a relationship in their crazy broken down world.The book is written in the first person, and for the most part I thought it was of a high quality. There were a few instances where the dialogue between Mike and Frieda was a little cringe-worthy, and a couple of continuity/plot issues (why was the first zombie able to get into the house when Frieda locks it for the rest of the book?) but the structure of the story and execution of it was enjoyable and interesting. The first encounter between Frieda and a zombie/afflicted was fantastic, full of tension and very visual - exactly what a zombie novel needs to be- and set the tone perfectly for the direction the rest of the novel was heading. Because of the zombie threat, any time Frieda ventured outside I was sure a zombie was going to pop up from behind a car and maul her, and Mike's arrival sent all kinds of warning signs flashing (zombie 101, don't trust handsome men with barbed wire tattoos when zombies are running around!). So while I did have a few problems with the writing, they weren't significant enough to damper the overall quality of the book."}, {"userName": "Elizabeth", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/4299179-elizabeth", "userReview": "Frieda suffers from a slew of mental illnesses including anxiety, borderline personality disorder, and depression. She finds it hard to interact with people without being consumed by her inner dialog telling her she is being too extreme or not doing enough. When she becomes overwhelmed and extremely angry or sad, she turns it on herself and self mutilates, either by cutting or by burning herself with hot pans. The zombie apocalypse suddenly happens and she finds herself without any other sentient human for a year. Her problems with her mental illnesses also cease. Suddenly, on a quest to get medicine for her sick cat, she runs into another normal person, a man named Mike, who has similar problems pre-apocalypse as her. Frieda immediately feels an attraction to him, but she doesn't know much about him. Only time will tell if he is one in the parade of losers she knew before or if he is actually worthy of her affections.Waiting for Daybreak is an unexpected read and puts a new spin on old tropes in the zombie genre. I was expecting just things I've seen before because I have read a lot of zombie books, but Amanda McNeil surprised me. Frieda quickly became one of my favorite zombie survivor heroines. She is smart, resourceful, and fiercely loyal to the people and things she cares about. I loved that she risked life and limb to get medicine for her cat. Many would say she should just let it die or eat it, but, at least for me, cats are family. So she gets major brownie points in my book for that. Her mental illnesses constantly make her doubt her feelings and actions, but after the zombies appear and eat everybody, they cease to bother her. The question of what is normal is a central one in this novel. Is she normal now that she is more like people were before the zombies? Or is she still abnormal because the majority of people are clamoring to eat each other's brains? Frieda is never portrayed as crazy despite her mental state sometimes and has a quirky personality that I immediately related to. It shows that people with mental illnesses are not defined by them and there are more to them than just that illness.The first half of the book is showing Frieda's day to day life with her cat during the zombie apocalypse. She looks after her roof garden, kills the occasional zombie (who she calls the Afflicted) that comes her way, cooks food, fortifies her apartment, stuff like that. This part of the novel also offers glimpses of her life before and during the zombie apocalypse. It describes her last date that ended horrifically and the fact that she is only alive because she called in sick to work. It serves to let the reader know how she changed over time and fill in her background. Then she meets Mike. Attraction is instantaneous between them and they have a cute, slightly awkward romance because they both have their own emotional baggage. I want desperately for them to work out because I really like her and her last date ended in disaster. This relationship is the first she has even seen anyone and she's beginning to hope for the future.I love the zombies (or the Afflicted). It's unclear what caused it. The news claimed it came from some sort of military facility, but it doesn't really matter because the effect remains. They start with a flu-like sickness and then crave brains, attacking whoever is closest. Pain and injuries don't phase them one bit and they are very resilient. What I find most creepy is that they still seem to keep some level of sentience. They can speak and even plead for help because of their hunger right before they attack and try to smash your brains. It makes me wonder how much they realize what they are doing and what their actual mental capacity is. Do they do that because they know they want to prey on sympathy or are they just doing it out of instinct because their hunger causes them pain? I would like to know more about these type of zombies.Waiting for Daybreak is an amazing zombie read. The only thing I didn't like is the cover. It's a little generic and I think it might put people off. I read it in about a day because I couldn't put it down. I really want to know more about this world and about what happens next. I really really hope there is going to be a second book because if any story deserves a series, it is this one."}, {"userName": "Todd", "userReviewDate": "Sep 03, 2012", "userURL": "http://www.goodreads.com/user/show/3328360-todd", "userReview": "As the resident zombie expert at Reflections of a Book Addict, I feel compelled to give any novel that mentions our favorite half-dead friends a good read and review. As I've stated before, it's definitely one of my favorite sub-genres within the greater context of the postapocalyptic world genre. Ever since reading World War Z and The Walking Dead graphic novels, I've been basically hooked. Fortunately, Waiting for Daybreak by Amanda McNeill was a great addition to this genre.Taking place in modern-day Boston, Waiting for Daybreak chronicles the life of Frieda, a twenty-something microbiologist who works in a diagnostic lab in a hospital. Unfortunately for her, she is the only known survivor of an outbreak of an incredibly virulent virus that causes its hosts to transform into cannibalistic, half dead zombies. For nearly a year, she has subsisted in her apartment on the fourth floor of an apartment building, using a combination of scavenging for supplies and growing a garden as a means of nourishment and survival. As far as in the infected are concerned (or \"the afflicted\" as she calls them), Frieda has become skilled with the use of various knives and other non-projectile objects in luring the zombies to her and dispatching them when necessary. All of this changes when her cat, Snuggles, becomes afflicted with parasitic worms, and Frieda must travel to the local ASPCA office to find medicine to treat her. Unfortunately, the office is far from her current location, and Frieda faces untold dangers in getting there. Most interesting, however, is what happens along the way. She comes into contact with a man named Mike, the first uninfected person she's seen since the outbreak. What happens between them is predictable, but it's what happens after that which is something no one could have seen coming.I've always said (in regards to zombie movies/books/etc), that the lessons learned from this type of story are more about what happens to people after the rise of these zombies instead of what happens with the zombies themselves. Basically, the terrifying effects created by the catastrophic destruction of society serve to strip down the survivors and find out what they're really made of. With no outside interference, people become who they really are, deep down. In this case, Frieda has been diagnosed with a mental illness and struggles with feelings of self-doubt and low self-esteem. However, the longer that she survives in the zombie apocalypse, the more clear-headed and confident she becomes. This is interesting, as when the general public (that is also generally uneducated about mental illness) thinks about any kind of mental illness, they would assume that any kind of stress or isolation would serve to reinforce this problem and make it worse, rather than better. In Frieda's case, the time alone has given her an opportunity to think and do a lot of self-evaluation, which has made her come to the conclusion that she is a strong and self-sufficient woman, albeit with a good dose of self-doubt that kicks in every once in a while. Despite this intermittent self-criticism, Frieda is doing better than she ever has before, and her interaction and eventual course of action with Mike only serves to reinforce the fact that this apocalypse has caused her to become the strong, resourceful person that she really always was, and just needed this external stimulus to bring out.In all, it is an awesome read that really gets you in tune with Frieda's struggle with the undead. There are a few minor zombie-centric details, such as the believability of the actual virus and the way that the zombies act that could have used some reworking, but as I said before, zombie books are more about the live folks rather than the undead. In that regard, McNeil did a wonderful job.Todd (Reflections of a Book Addict)Originally Posted: http://wp.me/p18lIL-1aa"}, {"userName": "Fangs for the Fantasy", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/5912634-fangs-for-the-fantasy", "userReview": "Freida had a difficult life. Living with mental disabilities, she had a hard time negotiating the world and, especially, the people within it. It certainly seemed she’d hit one of her low points after a particularly awful date sent her into disassociation, self-harming and depression.Of course, if she hadn’t been in that low, she’d have been outside when the zombie apocalypse began, rather than in bed reeling from depression. She would have been like the rest of Boston – perhaps the world – roaming around seeking brains to feast upon.In the greatest irony, she almost seems to be thriving far more in this new, bleak world than ever she did before – just her, her cat – and even a love interest who doesn’t seem nearly as awful as her last real date. Perhaps they can carve their own life in world of zombies, despite every day being a battle to survive under constant threat from the AfflictedWhen I picked up this book, I had reservations. It’s a very short book, especially for something not part of an ongoing series. It seemed too short to be a self-contained story in and of itself.So I was wonderfully surprised by the masterful pacing that made this book and this story exactly as long as it needed to be. We had plenty of flash backs of Freida’s life to have a greater idea of her as a character and her history of mental illness. We learned enough about her to flesh her out as a person, to get an idea of the outbreak and what happened to her and how she survived – but not so much that it was extraneous, padding or unnecessary fluff.Similarly when she met Mike and had a relationship, we had enough information and scenes to see the shape of it, but not so many that we were drowned in excess detail that bogged the story down and turned it into a romance. We didn’t learn much about Mike, we didn’t need to know much about Mike. The story was a extremely well done balance –neither too much nor too little.Which covers most of everything in the book – the action scenes were exciting, lasted long enough that you didn’t blink and miss them but not so long that you were tempted to skip forwards; they were well described enough to get a sense of what was happening, without being so over-described that it felt like the fighters were actually taking notes. This whole book just hits the sweet spot – that perfect balance between too fast and too slow, too much description and just enough, too much world building and backstory, and not enoughI also love that Freida is every bit as much an action hero as Mike in this. In fact, when she finds Mike, he is surprised to see her kill zombies with a knife when he has been using a gun. She is the one who tells him you can kill them by stabbing them through both eyes and bashing their head in – she’s the one who has been getting up close and personal with the zombies while he’s been taking them out from a relatively safe distance.This book is relatively unique by having a disabled person as the protagonist. She is neurologically atypical, mentally ill, suffering from depression, paranoia and obsessive tendencies. Since we see things through her eyes we actually have an excellent portrayal of what that can mean and how those can manifest – as well as what she does because of them. We get her anger, her emotions, her thought processes and the difficulties she faced in the world – and continues to face.Read More"}, {"userName": "David King", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/5108119-david-king", "userReview": "I had originally assumed that \"Waiting for Daybreak\" by Amanda McNeil would be just another Zombie apocalypse novel, which seem to be all the rage at the moment. However, there is a little bit more to the novel that this as McNeil has chosen to concentrate the story on a character that had a personality disorder long before the apocalypse occurred. I found this to be quite an original and refreshingly different viewpoint which ensured I was willing to read this ahead of the many other run of the mill zombie novels that are sitting on my bookshelf. The story itself is broken up into two distinct sections, the first focuses on the day to day life of Freida, a young woman with a troublesome past who is trying to survive a zombie apocalypse alongside her pet cat, Snuggles. This section of the novel almost reads like a diary, which explores some of the actions she has taken to ensure her survival such as the fortification of her apartment. In addition, we get to follow Freida's musings as she recalls the various events that occurred just before the zombie outbreak and over the first few weeks. The second half of the novel however morphs into a sort of love story between Freida and another uninfected man named Mike that she discovers in the city. However, when it is revealed that Mike has his very own personality issues, the awkward and desperate romance they have undertaken looks certain to end in some form of disaster. Without doubt the utilisation of a main character with some form of disorder leads to a rather interesting story. Particularly when Mike is thrown into the mix and the novel explores some aspects of what it really means to be normal when the world itself is anything but. In addition, Freida herself is an incredibly complex person and I was impressed by McNeil's ability to develop such a unique character to the point that I could actually relate to her on some level, despite the way she would think. She really does come across as quirky and likeable despite her issues and I particularly appreciated how it becomes clear that the very personality traits that caused her problems in the past that has probably led to her survival now. The one thing that I was a bit disappointed with was the rather short length. Don't get me wrong, the pacing has been used really well to make sure that the story is entertaining and self contained but the ending felt slightly abrupt to me and I think a few elements could have been expanded upon. Basically, I would have liked to discover more about the world and Freida herself and am now hoping that McNeil will decide to expand on the story via future novels. Overall, this was an entertaining post apocalyptic zombie novel that also makes the reader think about how the normalcy of life is relative. It isn't always a light and easy novel to read due the characters McNeil has utilised but these characters are what make it unique. I think any fan of post apocalyptic survival horror that is after something a little bit different and thought provoking will enjoy this."}, {"userName": "Diana (Offbeat Vagabond)", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/4571498-diana-offbeat-vagabond", "userReview": "Original post here: http://offbeatvagabond.blogspot.com/2012/08/waiting-for-daybreak-blog-tour-indie.html Waiting For Daybreak is a great post-apocalyptic story about a woman named Frieda. Frieda is left all alone in a world full of zombies. She has nothing to depend on but her thoughts and instincts which is not always great thing. Even before the zombies or the “Afflicted” as she likes to call them, she has suffered from Borderline Personality Disorder. She suffers from explosive emotions and moods. Her mind tends to go to very dark places and she does sometime inflict pain on herself. Frieda has always been afraid and just didn't feel like living. But things have changed since it is the end of the world. But it is for the best? She doesn't know. I absolutely loved Frieda. McNeill has done such a great job with giving us a different kind of lead character to root for. Frieda is a character a lot of us can relate to. She isn't perfect, she has issues both inside and outside and she still fights for her life. And even with her issues, she has a great, spunky attitude that had me smiling. I found her very inspiring and I was rooting for her survival from the beginning. Then after Frieda is alone for a year with nothing but her cat Snuggles and her books, she meets a man named Mike. He is definitely the hot guy I wish I loved next door too. They have immediate chemistry. I love how impressed he was with her when he first met her (after he tried to shoot her). They are very impressive together. But when we start to hear his story, we see why they are so good together. I love the McNeil gave him depth and he wasn't just another pretty face. I would have liked more on his past because he knew a couple of things I was curious about. But then again, it is probably for the best. This is a story about one woman's drive to survive in a world full of zombies. This is very character-driven. She does everything on her own especially when it comes to Snuggles. She does all she needs to to save her best friend. This is how she meets Mike. I love how McNeil gives us a nice relaxing period with Frieda and Mike and Snuggles. Everything just feels good between them until it all goes to hell. I don't want to spoil it, but I had a feeling something was off, but I had no idea how bad it would get. My jaw definitely dropped. I wish this book was longer. I think we would have more backstory and maybe more characters. But that is what you get with a short story. I really enjoyed this. The last chapter of this book will have you on the edge of your seat. My heart was racing and I was panicking. Again, you will be jumping up and down for Frieda. I would love to see this made into a movie/TV show. This would look and feel great. Waiting For Daybreak will give you such a unique outlook on the world through Frieda's eyes. Highly recommended."}, {"userName": "Allizabeth Collins", "userReviewDate": "Jul 24, 2012", "userURL": "http://www.goodreads.com/user/show/5963757-allizabeth-collins", "userReview": "Review: Over the last few years it seems that a shift has occurred, instead of teenage girls going ga-ga over Twilight-esque vampires, readers are flocking toward a different type of undead - zombies. These lumbering flesh-eaters are ripe with interest, ( in human brains), and are bringing back the gut-shredding fear and blood-curdling uncertainty that their 'sparkly' counterparts lack. Books, comics, movies and TV shows - especially The Walking Dead series - are popular because they scare the bejesus out of fans using blood, gore, gritty violence, and an overall feeling of doom - not to mention some pretty kick-a** plot-lines; however, after reading one, (or eighteen), similarly themed books, the premise can get old. I currently have four 'zombie' novels in my \"To Be Read\" pile, and I am already suffering from an undead hangover of apocalyptic proportions. When I was asked to read Waiting for Daybreak, I almost declined the opportunity. Another end-of-the-world zombie-pocalypse scenario? Boring. But after reading the blurb I was surprisingly intrigued.  Frieda is an multi-faceted character, her Borderline Personality Disorder adding layers to her already depressed, yet quirky and attitude-laden, persona. I was blown away by Amanda McNeil's ability to develop such a unique and troubled character who every reader can relate to on some level. Everyone has questioned the boundaries of normalcy, but Frieda finds herself in a situation where her past fears and vulnerabilities don't coincide with the present. Now that ~90% of the human population is craving a dripping chunk of people-meat, where does that leave the rest of the uninfected, (seemingly normal), individuals? (Or their pets?) I enjoyed the relationship between Frieda and her cat, often unbothered by the fact that the dialogue was mainly one-sided. Frieda's love for her pet - her only living companion - was genuine and provided a couple of laughs. I much preferred this connection over Frieda's awkward relationship with another survivor, Mike, who I felt did not have enough of a history. I found the plot-line engaging and surprisingly twisty, each chapter bringing in more of the gore I would expect from the genre without soiling the well-written characters. Also, the ending was excellent, and I didn't see it coming, (no spoilers). This is one of the first zombie novels I have read with a psychological/romance flair, and I really enjoyed it! I will definitely be adding this book to my collection, and hope to read more of Amanda McNeil's novels and short stories! Recommended to fans of the survival horror genre, and those looking for a psychological twist for the end-of-the-world.Rating: On the Run (4/5)*** I received this eBook from the author in exchange for an honest and unbiased review."}, {"userName": "Angie", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/5598036-angie", "userReview": "I'm not to sure how I feel about this book. I liked it a lot, and found a lot of parts humorous even knowing that they probably weren't suppose to be. But I'm that jerk that laughs when you fall so I find a lot of things in life funny when others don't.I have to start of with my biggest complaint. The zombies. I'm pretty strict about my zombies, and in all can say that I'm a lover of the classic kind, I can handle some runners thrown in but for the most part I want my zombies dumb and slow. Here I wasn't sure what to think of them, and honestly liked how Frieda was calling them the Afflicted, because I started to think of them as \"zombie like creatures\". They liked to eat brains, but hey they talked and you know could open doors and stuff if they were up to it. But as soon as the \"Z\" word came out I didn't like it, not one bit. Every time I saw the word zombie, I just made it into the word Afflicted. If I hadn't done that I would have really started to not like the book and it is a good book so I didn't want that to happen. I'm just strange when it comes to my zombies. The story itself isn't your classic survivor story. Sure there is plenty about her scavenging stuff to live, and some close calls, but other than that not like any zombie story I have read before. Frieda is really a piece of work, and I can honestly see how see was able to survive. I mean if you have to convince yourself everyday of your life not to panic over things, it turns out pretty much the same when you can see your neighbor hood going to hell.I can say I expected Mike to show up eventually, I also guessed correct as to when he would make his appearance. It made sense to me that a hot man would show up eventually. What I didn't except was him being just as emotionally damaged as Frieda, and all that before the end of the world came. I can't say I really like how they interacted with each other though. Snuggles. . .you my feline friend were a very nice touch. I love cats.I didn't see the end coming at all, I seen some form of it. . .cause you know it is a zombie book and all, but just not the way it did. It is nice to be surprised when reading a zombie book, there are only so many ways they can go and to see someone throw a little bit of a curve ball in there is nice.Would I recommend this book? Yes, if you like zombie books you should like this one. Its a quick and easy read as well.**Disclaimer: I received a copy of this book from the author in exchange for a honest review.**http://zephyrbookreviews.blogspot.com/"}, {"userName": "Kelsey (Kelsey's Cluttered Bookshelf)", "userReviewDate": "Jun 13, 2012", "userURL": "http://www.goodreads.com/user/show/6610795-kelsey-kelsey-s-cluttered-bookshelf", "userReview": "Originally posted on my blog Kelsey's Cluttered Bookshelf.Frieda is an interesting character, and we first meet her in a bathtub with her surrounded by books, a kitchen knife, and her cat. What could be better than that combo? And the cat’s name is Snuggles, too cute! Frieda also suffers from depression, which makes her feel different from others before the outbreak. She says she suffers from Dissociation once in a while, where she pretty much blacks out and becomes more violent and angry.Another thing I liked, was that she lived in an apartment. A lot of the zombie books I’ve read center around houses or forts, and so on. But I myself live in an apartment, and it makes me wonder how I could survive if an outbreak happened, so I’m glad for this!The zombies in this are called the Afflicted, they seem to be almost human with speech at first, but change in a second if they see or hear someone who is living, and then try to kill them and go for the brains to eat. They also seem to be falling apart and oozing grey goo, which was one of the warning signs of someone changing into one.I won’t give away too much of the story, but Frieda decides to go on a dangerous scavenging to find something for her cat. On the way, she meets Mike, the only guy she’s seen in ages. There’s attraction of course, but they get what they need and head home, him going with her. Mike seems to have his own issues and depression, and he doesn’t talk about his past or what he went through. Something seems to be eating up at him (no pun intended) but we don’t see what he’s thinking until the end.The ending was a bit of a shocker, I wasn’t expecting that to happen, but I’m glad that Frieda has learned to become strong in a weird world. She starts to like herself, and realizes she can do just about anything.The one thing that I would have liked for this book, was if it was a little bit longer, gone into Frieda’s struggles with the zombies in the beginning a bit more. Or maybe there being a continuation of Frieda’s journey after this book. Even a novella of how Mike became the way he is would be awesome!This book is recommended for Zombie fans, there are some sexual scenes and violence, but it’s not over the top which is good. This was a great first debut book for the author."}, {"userName": "Mervi", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/5616131-mervi", "userReview": "Most of the people in the world have succumbed to a virus which makes them always hungry and cannibalistic. As far as Frieda knows, she and her cat Snuggles are the only survivors. She has fortified her apartment, grows vegetables, and raids nearby houses and stores for supplies.The situation is ironic because all her life Frieda has suffered from a dissociative mental illness. She has trouble with her relationships, has panic attacks, and thinks that she feels everything too strongly. Before the apocalypse, she hurt herself to relieve her mental pain with physical pain. Sometimes she was too depressed to get out of bed. In fact, the day of the virus outbreak, she was depressed and hungover, and called in sick. This may have saved her life.But now she has to survive and she does her best keep both herself and Snuggles alive. Earlier, she stayed in her apartment because she couldn’t face other people. Now, she regrets that decision but it’s too late.This is a short book but it feels just the right length for the story. Most of the story is told in present tense and is set in Frieda’s present time, after the zombie apocalypse. A couple of chapters are flash backs to Frieda’s life before the Incident and they bring nice background to her character. These chapters are in the past tense. The actions scenes are intense and the story move along briskly. The zombies can also be interpreted as a metaphor for all of the other humans who treated Frieda badly because of her illness. As a character study, the story is great.Unfortunately, the zombies and the situation aren’t very original. Frieda calls the zombies the Afflicted and thinks that they are mostly just sick but she has seen them tear healthy people apart and she knows that she has to kill them. The zombies are fast, they groan, want to eat brains, and tend to avoid daylight. The zombie virus is the only science fiction element in the book. The story’s strength is definitely Frieda who has to confront her inner demons in addition to the zombies. She also doesn’t go the usual way of becoming somehow cured or getting some powers to survive."}, {"userName": "Kristin (Blood,Sweat and Books)", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/6974252-kristin-blood-sweat-and-books", "userReview": "I received this book for review from the Author. All opinions are my own and I was not compensated in any way for them.Review:Waiting For Daybreak follows a young woman named Frieda as she struggles living during a Zombie Apocalypse.The GoodThe Plot- I really liked the concept of this book, it wasn't your traditional Zombie story. First off Frieda is flawed. She has a dissociative mental illness coupled with self harm, substance abuse and depression. I've never really read about a character like her and I think it was unique to see how someone with all that working against them would find the will to live during a Zombie Apocalypse.Snuggles- I really enjoy animal companions. You can learn so much about a person by how they treat a pet and Frieda was no different. I also found myself loving the moments of interaction between them. Snuggles doesn't Judge Frieda for being awkward or having faults. So why should I?Mike- While we don't learn to much about Mike he does play a pivotal role. Mike was the perfect character to transition Frieda from this rather depressed, angst driven girl to kick ass take the world by balls woman. I don't want to give away what happens but I let out a cheer when she slugged him, he really deserved it.The End- I can't help but be completely satisfied with how this wrapped up. Would I like to read more about Frieda? Heck yeah but if the Author decided to not write a sequel I'd be happy with how this ended. Sorry folks no hints from me about what happens, you'll just have to buy a copy and find out for yourself!!The BadThe Cover- I know to many people covers don't matter but to me they do. I feel it would be better to have a blank background with just the title then to put something that looks unprofessional up just to have one.Final ThoughtsIf you have some time, pick this book up and give it a go. Waiting For Daybreak has just enough Action, Romance and Angst to satisfy even the most jaded Zombie fan. I look forward to reading more from this Author. I will be rating Waiting For Daybreak by Amanda McNeil ★★★★ 4 stars!!"}, {"userName": "Chandni", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/5748551-chandni", "userReview": "The prospect of a zombie apocalypse has always been in the back of my mind. I’ve always wondered how people would survive as society crumbled, how life would alter, and what the remnants of the world would look like. In Waiting For Daybreak, Amanda McNeil describes the aftermath of a zombie apocalypse through the eyes of an unlikely heroine.Even though Frieda has a personality disorder and periods of extreme depression, the character was still somehow easy to relate to. In high school, she battles the same form of pressures and faces the same sort of vulnerabilities that every other teenager does. She also has that same desperate desire to fit in. Later on, she questions existence and the meaning of her life, which is also something most people do. However, they aren’t as deeply affected by the answer as Frieda is. Sometimes, Frieda disassociates and finds herself making violent, reckless, and erratic decisions.For the first half of the book, we learn more about Frieda and the things she has done to ensure her survival. She’s created her own garden, makes rare foraging trips , occasionally has to kill one of the Afflicted, but has generally settled into a comfortable routine with her cat Snuggles. When her cat falls sick, she ventures outside to get medication for it. There, she meets Mike, the last uninfected man in the Boston area. The book takes an interesting turn once there’s a second person…the relationship changes the atmosphere. The whole novel is quite dark and forces you to see the world as obsolete. Not only is the post-apocalyptic world desolate, Mike brings attention to how pointless it is.However, I felt the end was portrayed as hopeful and almost enlightening. This is a really interesting novel about how the word “normal” can be entirely relative. There are parts that could have been slightly expanded upon and the climax of the novel was quite abrupt, but overall, I liked this book and recommend it.I received this book from the author in exchange for an honest review."}, {"userName": "Meganm922", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/2327196-meganm922", "userReview": "I enjoyed this novel quite a bit. Frieda is the narrator and it is written almost like a journal, but I suppose that is because Frieda is a zombie apocalypse survivor who is alone, save for her cat. Frieda suffers from Borderline Personality Disorder and struggles with the age old question: what is normal? This book reminded me a bit of I Am Legend (the movie, as I have not read the book) in the sense that it is a lone survivor and her trusted animal companion that carry out daily tasks and occasionally forage, though the zombies are quite different from the ones presented in the movie. The overall tone is similar, though. The entire concept and feeling of loneliness is quite present in the narrator and I could feel Frieda’s apprehension about the world and what happens next.While there is zombie mayhem and action and it’s pretty awesome, this book is more about the inner thoughts of someone who realizes she is probably the last person in the world and impact that has on her. Frieda tells us about the moments before the outbreak and the struggles she had in everyday life when the world was normal and how she is different afterwards, especially in relation to her disorder. It is both intelligent and philosophical and less focused on actual zombie action. Without spoiling any parts of the story, I will say that Frieda grew as a character throughout the novel and was a pretty strong female character, while also being compassionate and loving (at least towards her cat. She was quite ruthless towards zombies.) Overall, this was an intriguing novel that touches upon some of the things I’m sure we all think about in terms of being all alone after an apocalypse or viral breakout. I thought it was a clever and extremely interesting. I think the author captured the tone perfectly. Wonderful book!http://meganm922.blogspot.com/2012/07..."}, {"userName": "Michele", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/3469288-michele", "userReview": "This, and other reviews can be found on my blog Just a Lil' LostFrieda never felt like she was normal and it’s because of this that she happens to stay home from work one day when all hell breaks loose. She manages to avoid a mass outbreak that causes the population to take on zombie-like qualities. She lives with her cat in a state of worry and caution, holed up in her home. She survives day-to-day until something happens that forces her out of her safe shelter. Having been alone for so long, she isn’t sure what to make of it when she encounters another out in the demolished city she once knew.McNeil brings a fresh voice with this zombie apocalypse-type story. She has written a character that is refreshing and different from others I have read. Frieda is strong but vulnerable, self-conscious but self-assured. I really enjoyed the dynamic that was built up between her and her cat as they live in hiding and was actually a bit disappointed at the introduction of a male character. I felt that behind all of Frieda’s neuroses and inhibitions, she was strong and independent. So when a potential love interest shows up, I was apprehensive as to how that would change her. I really didn’t want the feel of this story to spin into a possible love story.Personally, I am not a fan of the cover. It doesn’t feel final, or reflective of the good story that’s within the pages. That being said, Waiting for Daybreak is a different take to a zombie survival tale with an independent female main character. In spite of her self-proclaimed shortcomings, she somehow rises among the destruction to live on. Overall, a unique new voice to the zombie genre, and looking forward to McNeil’s subsequent work!"}, {"userName": "Angie", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/4964628-angie", "userReview": "Synopsis: \"What is normal?Frieda has never felt normal. She feels every emotion too strongly and lashes out at herself in punishment. But one day when she stays home from work too depressed to get out of bed, a virus breaks out turning her neighbors into flesh-eating, brain-hungry zombies. As her survival instinct kicks in keeping her safe from the zombies, Frieda can’t help but wonder if she now counts as healthy and normal, or is she still abnormal compared to every other human being who is craving brains?\"My Review: Wow! Not at all what I was expecting! I was expecting Waiting for Daybreak to be a book mostly about zombies and fighting them, but what I found was more a journey into a survivor's psyche. I don't know what was scarier, the zombies or being in Frieda's mind. Amanda McNeil did a great job of using the first person narration and character development to draw us into the story. You really get the full feeling of being alone and not really knowing whether you are the only one. While I found some of her thought tangents a little distracting and not exactly linear, it gave you insight into her mental disorder. I adore Snuggles, and hope that if I am alone in a world like that my cat is still with me for company! One last thing I loved about the book, it takes place in Boston and being only an hour from there and spending a lot of time there, I was really able to picture the destruction."}, {"userName": "Pinar Celebi", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/3365198-pinar-celebi", "userReview": "http://pinucciasbooks.blogspot.comI was a bit nervous before I started reading this book as I promised the author herself to review it. I was thinking what I would do if I cannot keep reading after the first few pages and honeslt, this made me postpone start reading it for a week or two.I'll start with the story itself. I'm a sci-fi fan in all aspects: I read sci-fi books, I watch sci-fi movies and TV series so the only thing that caught my attention in the core of the story is the disorder of Frieda, nothing else. When one is exposed to too much apocalyptic stuff, s/he always tries to find something untold before. I believe this is an understandable but easy wish from a reader's/watcher's perspective. It also puts a lot of pressure on the creater's side. The story was not a new one but the main character was.I liked unstable, unpredictable, complicated character of Frieda. Sometimes I managed to understand her. Sometimes I just couldn't relate with her and I think this shows the author's success in creating the character and adding bits of mental disorder.I liked the pace of events. I almost always like stories where the action hero is female like this one. I also liked how the book ended, which is very tricky in apocaplyptic novels. Sometimes the auhtor ruins everything with a bad ending. Amanda McNeil did not do that and I managed to read Waiting for Daybreak in a single day (although it was in English)."}, {"userName": "Nicki Markus", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/1104010-nicki-markus", "userReview": "Now, when I agreed to review this book, I was pretty flat out both at work and at home and I never picked up on the word 'zombie'. Why is this an issue? I am terrified of zombies - yes, they complete freak me out. I can handle the comedic versions, but anything serious has me cowering behind the sofa.So when I started reading this late last night, my first thought was 'uh oh'. Luckily, though, I was still able to sleep and I'm glad I stuck with it as this is a well-written and enjoyable (even though the zombies scare me!) novella.Frieda is a great lead character, not least because she has her flaws and they make her seem that much more real and believable. Plus she likes cats, so she scores highly with me! I was investing in her story right from the start and really wanted her to make it out of there alive.The pacing of this piece is well managed and the tension was maintained perfectly from start to finish. I was definitely on the edge of my seat the whole time.The basic plot is reminiscent of I Am Legend, with more of a zombie twist, so it will definitely appeal to fans of that book/movie. Zombie fans will also, of course, enjoy it.So even if, like me, zombies make you cringe away in fear, give this novella a try as it is well worth your time.I received this book as a review copy from the author."}, {"userName": "Ken", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/4223286-ken", "userReview": "Waiting for Daybreak is a rather unique zombie tale. Instead of focusing on the horrors of flesh eating undead, the book reads more like a personal diary of survival.In the first part of the book, we are treated to Frieda's musings and generally how her life has changed since the outbreak. We learn that the zombie outbreak has created some inconveniences in Frieda’s life but otherwise she has been doing fine by herself, getting the resources that she and her cat need.During one of Frieda's routine scavenges, she meets Mike, another survivor of the zombie apocalypse and quickly develops a romantic yet slightly awkward relationship with him. It is during this part that the book explores how these characters cope with the despair and loneliness of knowing that they are possibly the last surviving people on the planet.If you have seen or read I Am Legend then you will see some similarity between that and this story. Both stories ask the question of what is normal if you are the last human left on the planet and whether it's better to just let nature runs its course.Even though Waiting for Daybreak is a quick read, it has a fully fleshed out story with a fascinating and different lead character and is very entertaining overall.(Originally posted at http://www.paperlessreading.com/2012/...)"}, {"userName": "LilyElement", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/5639357-lilyelement", "userReview": "Freida's life changes when she decides not to go into work after a bad date. She finds out there is a virus spreading rapidly around the world and quickly discovers that it is turning people into zombies. The first half of the book is Freida's day to day life. It goes into details of how she survives in a bleak world by killing the Afflicted (zombies), keeping her apartment secure, make foraging trips, and even relaxing with her cat, Snuggles. The last half of the book revolves around Freida meeting a man that isn't infected. They quickly form a relationship and seem to suit each other. I won't spoil the end for you, but I can honestly say I wasn't expecting what happened.Waiting For Daybreak isn't a light read. The book revolves around Freida surviving in a zombie filled world. I suggest this book if you want something different and enjoy zombie books.Disclosure: I received a copy of this book from the author in exchange for an honest review."}, {"userName": "Margaret", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/118390-margaret", "userReview": "If anyone had told me that I'd enjoy a zombie apocalypse a year ago, I'd have told them they were nuts. However, I have come to enjoy a few zombie apocalypse stories like Waiting For Daybreak. The story started off with the immediate realization that there were zombies, but we didn't know right off where they came from. Thankfully, McNeil didn't make us wait long to find out. She intertwined the back story with the current story together well so it wasn't disjointed. Frieda bothered me at first, she was quirky and not all that likeable. However, when she went on the mission to save her cat, I started to understand what made her tick. I loved her interaction with Mike, and especially enjoyed the way their relationship developed despite the zombies. I really liked Mike... and then I really hated Mike. The story seemed a bit abrupt at the end, but I did enjoy it over all."}, {"userName": "Amanda", "userReviewDate": "Aug 27, 2012", "userURL": "http://www.goodreads.com/user/show/11835120-amanda", "userReview": "The zombies in this book were an ancillary issue. The primary question was why had Frieda survived the virus? Frieda doesn't think of the creatures she hides from as zombies, referring to them instead as \"the Afflicted.\" This was carefully plotted and well-written, an intelligent treatment of a lone woman's struggle for survival in a world turned to hell."}, {"userName": "Michelle", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/897898-michelle", "userReview": "Highly enjoyed this different take on craziness and apocalypse scenarios. A lot of stories look at how the end of the world makes people crazy, but not how already mentally troubled people deal with that kind of change. It's a great story with a twist I didn't foresee."}, {"userName": "Jess F. (From Me to You ... Book Reviews)", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/4473848-jess-f-from-me-to-you-book-reviews", "userReview": "Check out my review and two teasers on my blog during and after my blog tour stop on July 22, 2012 -- http://frommetoyouvideophoto.blogspot.com/2012/07/blog-tour-feasted-on-waiting-for.html"}, {"userName": "Eva ", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/4304198-eva", "userReview": "My complete review can be found on my blog along with an interview with the author.http://vampirekiss1967.blogspot.com/2..."}], "description": "What is normal?Frieda has never felt normal. She feels every emotion too strongly and lashes out at herself in punishment. But one day when she stays home from work too depressed to get out of bed, a virus breaks out turning her neighbors into flesh-eating, brain-hungry zombies. As her survival instinct kicks in keeping her safe from the zombies, Frieda can’t help but wonder if she now counts as healthy and normal, or is she still abnormal compared to every other human being who is craving brains?", "title": "Waiting For Daybreak", "url": "http://www.goodreads.com/book/show/14762040-waiting-for-daybreak", "average": 3.7, "cover": "https://images.gr-assets.com/books/1338815936l/14762040.jpg", "reviews": 28, "authors": [{"url": "https://www.goodreads.com/author/show/5039763.Amanda_McNeil", "name": "Amanda McNeil"}], "type": ["Horror", "Fantasy", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/14762040-waiting-for-daybreak", "http://www.goodreads.com/book/show/12031229-ecstatic-evil", "http://www.goodreads.com/book/show/36596861-cassette-94"]}