{"ratings": 1391, "userreviews": [{"userName": "Will Byrnes", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "In 1945 our parents went away and left us in the care of two men who may have been criminals. \nWhen we are young we rely on the people who surround us to introduce us to the world, to explain the many elements of life that can be so confusing, overwhelming, or simply opaque to young eyes. Some of this knowledge can only come from first-hand experience, but it helps to have adults at hand, of a trustworthy sort, who can help us along the road of becoming. Nathaniel (aka Stitch) is fourteen. His sister, Rachel, (aka Wren) is sixteen when their parents depart for Singapore on mysterious government assignments after the war, leaving them in the care of the boarder they call “The Moth,” and a fluid cast of what can only be considered dodgy characters, reminiscent of Caravaggio from The English Patient, who was both a criminal and a spy.Questionable they may be, at first glance anyway, but they are a remarkably colorful lot. One of my favorites was one Norman Marshall, aka The Pimlico Darter, aka The Darter, a fellow with a taste for cheating at dog-race betting and transporting materials uncertain, nicely hidden in boxes, from one place to another under cover of night. All very hush-hush, and possibly criminal. There are plenty of other lively supporting characters who stroll, dash, or creep across the pages. \nThe house felt more like a night zoo, with moles and jackdaws and shambling beasts who happened to be chess players, a gardener, a possible greyhound thief, a slow- moving opera singer. \nIt is among these remarkable personalities that Nat and Rachel are introduced to the realities of a world that exists largely in shadows, the dim light redolent of wartime London, or warlight of the title. The first part of the story, Nat and Rachel’s adolescence, takes place in the immediate post-war period. The curtain between war and post-war being sometimes permeable, they are affected by events of a continuing shadow engagement, in which war-time battle driven by armored divisions, fleets of ships, and waves of aircraft was replaced by the dimly-lit conflict of combatants in street clothes, engaged in theatres where stealth and treachery defined the landscape.\nWe passed industrial buildings, their lights muted, faint as stars, as if we were in a time capsule of the war years when blackouts and curfews had been in effect, when there was just warlight and only blind barges were allowed to move along this stretch of river. \nThe focus is primarily on Nathaniel, with Rachel relegated to activities that are mostly reported rather seen first-hand. There is a strong element of coming of age here for Nat, whose experiences in the world of work, whether legal or not, and adventures with the opposite sex expose him to a broader vision of the world. With both parents away, he must look to the adults at hand for role models. It would help if he actually knew what they were really were on about. Michael Ondaatje - image from his FB pagesFurther on, we meet him in his late twenties, in a surprising profession, focused on learning the full truth of his mother’s involvement in the war, and with related tasks after.\n…There’s a photograph I have of my mother in which her features are barely revealed. I recognize her from just her stance, some gesture in her limbs, even though it was taken before I was born… I found it years later in the spare bedroom among the few remnants she had decided not to throw away. I have it with me still. This almost anonymous person, balanced awkwardly, holding on to her own safety. Already incognito. \nNat’s search for the truth of his mother, Rose’s, life is, in a way, a stand-in for seeking the truth of his own. Telemachus wanting to learn of his mother’s odyssey. While the primary focus of the book is on Nathaniel, Rose comes in for the next-most attention. Her history is fascinating, and a delight to read. There are many echoes here of the author’s prior work. (I have read several, but not all of his earlier six novels) As he has done before, Ondaatje takes us into war from a place of later reflection through older, wiser eyes, which may remind readers of Anil recalling ethnic slaughter in Sri Lanka in Anil’s Ghost, or the many war scenes in The English Patient. \nYou return to that earlier time armed with the present, and no matter how dark that world was, you do not leave it unlit. You take your adult self with you. It is not to be a reliving, but a rewitnessing. \nIn our look-back, Rose and others engage in mortally perilous missions. Some do battle on the homefront as well, although no less dangerously. Scarring is another feature Ondaatje returns to. The English Patient was surely a high point in the literature of skin miseries. But the experience that scarring suggests shows up here as well. An immigrant with whom Nat works as a teen sports noticeable facial scarring. A co-worker of his mother has less than beautiful hands from his scaling interest. Another has abdominal marks that were clearly nearly mortal and Rose has a decent dose of skin-told-tales as well.He also sustains the motif of almost-darkness in looking back at this time, as well as in the characters’ initial experience of it. \nThere are times these years later, as I write all this down, when I feel as if I do so by candlelight. \nThe darkness extends to identification as well, given how many of the characters are known by their colorful noms du guerre rather than by what might appear on their birth certificates. There are bits of payload you will appreciate here, information about the real world that appears in the story, some information on greyhounds and dog-racing, and covert programs to cope with domestic security risks. You will get a feel for life in London during the aftermath of war, and also in The Saints, an area of England new to me. You will pick up a bit on the range of bird whistle signals that might be used by a secretive Thames-borne barge, and most surprisingly learn a bit about stegophily. (you have to click, at least, to learn that one.) Ondaatje mentions a program of post-war mopping up, called The Silent Correction. I do not know if it refers to something real or imagined. My googling yielded nothing informative, but it does seem like the sort of thing that would have existed. An abbey that is put to another purpose is a fun-fact. An interesting element is the acquisition of skills that might not be so readily acquired during peacetime. A bee-keeper, for example, has a  questionable talent for anaesthetics gained during the Italian campaign. A veterinarian is a skilled lock-picker. Ondaatje plants seeds early in the tale that grow to mighty oaks by the end. There is a large twist, serving to remind how what has happened can define what is and direct what can be. \n We are foolish as teenagers. We say wrong things, do not know how to be modest, or less shy. We judge easily. But the only hope given us, although only in retrospect, is that we change. We learn, we evolve. What I am now was formed by whatever happened to me then, not by what I have achieved, but by how I got here. But who did I hurt to get here? Who guided me to something better? Or accepted the few small things I was competent at? Who taught me to laugh as I lied?...But above all, most of all, how much damage did I do?\n As in most good novels, there are Easter-egg clues to the novelist’s craft. \na high perspective, as from a belfry or cloister roof, allows you to see over walls into usually hidden distances, as if into other lives and countries, to discover what might be occurring there, a lateral awareness allowed by height. \nThis nicely reflects the author’s on-high ability to see past windows into the secrets of his/her characters’ lives. And another nugget. \nWho made me move from just an interest in “characters” to what they would do to others? \nAnd just in case you were not aware, Ondaatje’s writing is poetical, exquisite, and moving. There are many passages in Warlight that call you to return, mull, and savor. A writer who is not fond of linear narrative, he jumps about without much warning, but attentive readers should have little difficulty knowing when they are in the narrative. While considerable attention is paid to the business of international intrigue, that seems more to provide a palette against which the characters can be displayed. Warlight may be about the dim light of history, secrecy, mystery, and uncertainty, but it glows with the luminescence of a master story-teller at the peak of his power. Whether you read by the glow of a low-wattage bulb or under the blaze of the noonday sun, the sparkle will shine through. I found Nat’s story, as well as his mother’s, compelling. Nat’s yearning to cast light on his family’s secrets will lead you along, teach you a thing or two, tug on your emotions, and leave you dazzled. Ondaatje’s portrait of coming of age during dire times, and the perils and prices of desperate measures, will keep you turning pages, whatever the candle-power at your disposal. The challenge of making moral decisions under dangerous and murky conditions that is presented here should, nonetheless, leave you with a simple, unambiguous, choice. Warlight is such a brilliant piece of work that you might need shades. Review posted – May 4, 2018Publication – May 8, 2018I received the book from the publisher's First To Read program in return for an honest review. I will post the dishonest review elsewhere. =============================EXTRA STUFFMichael Ondaatje on FBThe Guardian - MO reading an essay he wrote while staying in Conrad’s boat in London Guardian Artangel books podcast: Michael Ondaatje June 4, 2007 – The New Yorker -  The Aesthete: The novel and Michael Ondaatje  by Louis Menand – a fascinating analysis of MO’s work -  He is not telling stories; he is using the elements of storytelling to gesture in the direction of a constellation of moods, themes, and images. He is creating the literary equivalent of a Cornell box or a rock garden or a floral arrangement."}, {"userName": "Elyse", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Damn this was good!!!! I purposely stayed away from reviews- but now I’m dying to read what others have to say - especially since I’m ‘long-winded review-retired’ for the rest of 2018. From the title itself, “Warlight”, to the luring first line in the novel - “In 1945 our parents went away and left us in the care of two men who may have been criminals”......I was completely captivated to the end.Nathaniel—is an adult writing about his life. In childhood, Nathaniel, 14, and Rachel 16, get entangled with a slew of fascinating sinewy boisterous characters whom most seem to have nicknames. The siblings and their mother also have nicknames…very symbolic to this novel: everyone being a substitute. Smugglers and low lives replace parents. From Nathaniel’s childhood to his adult years he is most unsettled with his mother. Her secrets - lies - betrayal- and heroism - resulted in adverse blacklash for their family. The questions that troubled Nathaniel about his mother -things not fitting together- haunting & mysterious —were insightful about post war life. Past wars are never past. The loss, destruction, and hurt still lives. Michael Ondaatje is phenomenally talented. His prose is powerful and luminous. Extraordinary mysterious atmosphere—a few violent scenes - seductive to the end."}, {"userName": "Jeffrey Keeten", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "[And then his mother returns.\n(hide spoiler)]"}, {"userName": "Tammy", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/50603889-tammy", "userReview": "This might have been a coming of age novel but it’s not. It might have been a post WWII novel but it’s not. It might have been a family drama of sorts but it’s not. The narration is messy, the plot is pointless and the premise is unbelievable. Warlight meandered about without a glimmer of light at the end of the tunnel."}, {"userName": "Lori", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/68050592-lori", "userReview": "Your parents left you with two dodgy characters while they left for a year-long trip! Neither our storyteller, Nathaniel (Stitch) nor his sister, Rachel (Wren) know either man very well. He slowly unravels answers. Each one reveals more questions. It’s probably better that way.\nI was fourteen at the time, and Rachel nearly sixteen, and they told us we would be looked after in the holidays by a guardian, as our mother called him—we used to call him “The Moth,” a name we had invented. Ours was a family with a habit for nicknames, which meant it was also a family of disguises. Rachel had already told me she suspected he worked as a criminal. The arrangement appeared strange, but life still was haphazard and confusing during that period after the war; so what had been suggested did not feel unusual. We accepted the decision, as children do, and The Moth, who had recently become our third-floor lodger, a humble man, large but moth-like in his shy movements, was to be the solution. Our parents must have assumed he was reliable. As to whether The Moth’s criminality was evident to them, we were not sure."}, {"userName": "Roger Brunyate", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "A Lost Inheritance\nWe continued through the dark, quiet waters of the river, feeling we owned it, as far as the estuary. We passed industrial buildings, their lights muted, faint as stars, as if we were in a time capsule of the war years when blackouts and curfews were in effect, when there was just warlight and only blind barges were allowed to move along this stretch of river. I watched the welterweight boxer whom I had once perceived as harsh and antagonistic turn and look towards me, talking gently as he searched for the precise words about the ankles of Olive Lawrence, and about her knowledge of cyan charts and wind systems.\n======The photo is no more than a convenient summary of the noir world that Michael Ondaatje conjures up in the first hundred pages or so of this masterpiece of emotional archaeology. Like another  WG Sebald, only working with words, he shows snapshots of distant reaches of a damaged London, exhausted by the Second World War. And as with Sebald, Ondaatje's word images are half-open doorways giving onto a mysterious, half-remembered past. He is a grown man looking back at his early teens, groping in the dark to grasp the shape of a life that was itself a mystery, a limbo life that begins with his opening sentence:\nIn 1945, our parents went away and left us in the care of two men who may have been criminals.\nOne of these men is a lodger in their London house whom they call \"The Moth.\" He is benevolent but distant, disappearing for days at a time to leave the 14-year-old narrator (Nathaniel, more generally known as \"Stitch\") and his older sister Rachel to their own devices. The other is a former boxer known as The Pimlico Darter, who soon involves Stitch in activities of doubtful legality such as the smuggling of greyhounds upriver to race at the London tracks. Various other people come and go in the house, such as the \"geographer and ethnographer\" Olive Lawrence and the scholarly Arthur McCash, but it is The Darter who makes the biggest impression:\nThe music-loving Moth appeared blind to the evident anarchy in The Darter. Everything the ex-boxer did was at a precarious tilt, about to come loose. Worst were the crowded car rides when the two of them sat in front, while Rachel and I and sometimes three greyhounds squabbled in the back on the way to Whitechapel. We were not even certain that the dogs belonged to him.\nI am also reminded of Patrick Modiano, for his fascination with the hidden details of a great city, his excavation of memory, and his sense of a semi-criminal half-life with its roots in the War. But there are even closer echoes of Ondaatje himself. His masterpiece \nThe English Patient\n is also concerned with the immediate aftermath of war, and the way in which it can make criminals into heroes. But my most immediate connection was with his 2011 novel The Cat's Table. That was the story of a voyage from Ceylon to London of a schoolboy named Michael who might to all intents and purposes have been the author; though fiction, it used (in the author's words) \"the colouring and locations of memoir and autobiography.\" In Warlight, the action has been moved back by a decade or so, but in other respects it might almost be a sequel, with the same character a year or so older, compiling a scrapbook of extraordinary experiences that would be the raw materials for his later career as an author. This sense of memoir was confirmed when I suddenly realized that Nathaniel's school is the same one that Ondaatje himself attended in London—Dulwich College:============This color painting of Dulwich by Camille Pissarro also serves to mark the break between the noir feeling of Part One of the novel and the rural setting of Part Two. For a little before the halfway point something dramatic happens which brings the adolescent adventures to an end. The story resumes again, fifteen years on, in a beautiful group of villages in North Suffolk (photo below) known as \"The Saints,\" where his mother grew up. This is more than the brief jumps into adulthood towards the end of The Cat's Table, more like the double-time frame he uses in Divisadero. Though \"double\" may be a misnomer. For although the narrator moves well forward in his own life, he makes it a vantage point from which to look even further back into his mother's story, to the interwar years and her activities during the War itself. Now the narrator is trying to make sense not so much his own life as that of his mother, from childhood on. Yet understanding his mother and understanding himself may be parts of the same process:\nWhen you attempt a memoir, I am told, you need to be in an orphan state. So what is missing in you, and the things you have grown cautious and hesitant about, will come almost casually to you. \"A memoir is the lost inheritance,\" you realize, so during this time you must learn how and where to look. In the resulting self-portrait everything will rhyme, because everything has been reflected. If a gesture was flung away in the past, you now see it in the possession of another. So I believe something in my mother must rhyme in me. She in her small hall of mirrors and I in mine.\nHe goes about his task elliptically; only gradually do you realize the web of connections that tie him to the village where his mother had grown up. But there are gaps in that web, and Stitch, true to his nickname, slowly attempts to stitch them up. And he does so, no longer as a memoirist or biographer, but a full-blown novelist, inventing an inner truth from the few fragments of fact that he can unearth.The book will eventually come round full circle, as most of the mysterious characters in Part One are brought into the real world. Yet the gift of Part Two is to introduce a new character with the marvelous name of Marsh Felon. The son of a family of roofing thatchers, he grows up with even more unexpected talents than The Darter, from being the genial host of a weekly nature show on BBC to a lethally effective operative in the War and its aftermath. It is a brilliant feat of alchemy on Ondaatje's part that the figure who returns the novel to the light of day should also be its loveliest source of romance.\nFacts, dates, my official and unofficial research fell away and were replaced by the gradual story, half dreamed, of my mother and Marsh Felon. How they eventually walked towards each other without their families, their brief moment as lovers and then their retreat, but still holding on to their unusual faithfulness to each other. I had barely a clue as to their cautious desire, of travels to and from dark airfields and harbours. All I had, in reality, was no more than a half-finished verse of an old ballad rather than evidence. But I was a son, parentless, with what was not known to a parentless son, and I could only step into fragments of the story. […] I know how to fill in a story from a grain of sand or a fragment of discovered truth.\nIndeed he does!======"}, {"userName": "Faith", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/17430801-faith", "userReview": "Warlight was the faint illumination that guided people during the blackouts. In this book it's a guide through a personal history. Nathaniel was 14 and his sister Rachel almost 16 in 1945 when their parents left for a year's stay in Singapore, leaving the children in the care of their lodger who they called The Moth. The Moth filled their home with dubious, possibly criminal, characters including a greyhound smuggler called The Darter. What seemed like it was going to be a coming of age tale turned into Nathaniel's attempt to reconstruct the story of his mother Rose's life. The father (whose past may have been even more mysterious than Rose's) and Rachel basically disappear from the book after Part One. As an adult, Nathaniel was recruited by the Intelligence Service and used his job to try to trace Rose's movements during and after World War II. All sensitive documents were destroyed after the war and even in the 1950s most people who had provided vital services during the war still refused to talk about it. Accordingly, Nathaniel's search was a combination of research, guesswork, memory and imagination as he found the links between Roses's past and his present. \"And by the time a war grew again in Europe, he had become a 'Gatherer' and 'Sender Out' of young men and women, luring them into silent political service—because of what? perhaps some small anarchy he glimpsed in them, an independence they needed to fulfill—and releasing them into the underworld of the new war. A group that eventually included (unknown to her parents) Rose Williams...\" Rose was a fascinating and enigmatic character whose life of bravery, danger and love was slowly revealed in flashes. The book shifts back and forth in time and there are no tidy conclusions. None of that bothered me. It's a little slow moving at times but I was never bored.I received a free copy of this book from the publisher."}, {"userName": "Diane S ☔", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "I am going to leave this unrated. At 35% I am putting this one down, unfinished. Usually enjoy this author for the wonderful way he uses words, and this book did have some of that, but the story just did not resonate with me. Maybe it's my mood, maybe I'll pick it up again sometime, but for now I'm done."}, {"userName": "Truman32", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/22271857-truman32", "userReview": "Michael Ondaatje’s wonderful new novel, Warlight, tells the story of fourteen-year old Nathaniel and his older sister Rachel as they are abandoned at their post-war London home by their secret-agent parents. This might possibly be one of the biggest cases of child neglect since my own parents left my older sister and me one horribly rainy afternoon when we were just children. In that instance, as my sister Sally and I realized (with the never-ending torrential rain beating against the house) that all we could do was to Sit! Sit! Sit! Sit! And we did not like it. Not one little bit. And then the home invasion happened. A curiously tall anthropomorphic feline wearing a red and white striped hat and a deranged expression kicked in our front door. His eyes blazed with the aura of the insane and his mouth frothed with pure malice, but he was nothing compared to the two frenzied maniacs he brought with him. These twisted miscreants were referred to only by their M-13 gang monikers: “Thing One: and “Thing Two”. Poor Sally and I were terrorized for hours by these scoundrels as they vandalized our poor abode, declaring over and over in their raspy evil voices that they know, “a lot of good tricks”, and that they would “show them to us” and that “our mother will not mind at all if they do.” Tragic. They wrecked everything. Our goldfish was killed and mother’s new gown with the dots that are pink, white, and red was rent into several irreparable pieces. Abandoning your children has severe consequences!Now back to Warlight. The time is 1945, just after the end of the Second World War. London is a burnt out wreck, recovering from the massive Nazi bombings. Nathaniel and Rachel are left in the care of an unusual fraternity of caregivers. These are mysterious and possibly criminal strangers they nicknames, chief among them “The Moth” and “The Darter”. How could their mother have left them in the custody of such wild and undomesticated people? These are people who smuggle greyhound dogs to fix betting races. People who take them on strange late-night boat rides to deliver unknown packages. Should they fear these people? Will they physically hurt them and abandon their injured bodies in hard to reach caverns like the Cave of Swimmers? Yikes! That would be devastating!But if Kevin Arnold has taught us anything in the 6 years The Wonder Years graced our Wednesday evenings it’s that what an adolescent observes and believes they understand might not in fact be what has actually happened. …and, of course, that Winnie Cooper is a keeper (and so good at math)! And this plays true for young Nathaniel in Warlight as well. What seemed so obvious in youth takes on differing interpretations in adulthood. Something Nathaniel discovers in the second half of the book when he uncovers some answers.I really enjoyed, Warlight. While the story unravels at a leisurely pace, it packs an emotional impact like a meteor of feels crashing into your heart from outer space. The events unfold in an enveloping fashion and I was transported to this world completely. This is something that used to happen frequently in my youth as a young reader, but not so often anymore. I was engulfed in this book like an infant swaddled in a blanket constructed of great characters and interesting plots. I strongly recommend it!"}, {"userName": "Ayelet Waldman", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/5447027-ayelet-waldman", "userReview": "The point of writing novels is to get early galleys of incredible novels like this one. My book is kicking my ass so hard that I think one of the reasons I’m still in this business is because I get to read books like this."}, {"userName": "Jill", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "The word “warlight” suggests a murky shrouded light that serves to only partially and poorly illuminate a tableau, and indeed, this is an apt title for Michael Ondaatje’s latest book.Our narrator is a teenage boy, Nathaniel Williams, who is left, with his slightly older sister Rachel “in the care of two men who may have been criminals.” Their mother, Rose, disappears from their lives in 1945, purportedly to engage in some sort of undercover or espionage actions. As a result, they spend their teenage years surrounded by Dickensian characters: a man they refer to as The Moth, a greyhound racer and bon vivant called the Darter, and others who flitter in and out of their lives. It is only in part two, a decade or more later, that a little bit of light is shed.The book, as one might expect from Mr. Ondaatje, is elegantly and lyrically crafted. It’s a pure pleasure to read prose this assured. An ambiance is set that keeps the reader on edge and off balance. Michael Ondaatje takes the all-too-common coming-of-age trope and turns it on its ear, as if he’s a magician pulling mesmerizing scenes out of his hat.But. Something changed for me in the second half of this novel. I am typically a big fan of novels that are non-linear and that switch from one point of view to another. But in this case, I found the switch to be distancing. I believe the author’s theme can be encapsulated in this line: “We never know more than the surface of any relationship after a certain stage, just as those layers of chalk, built from the efforts of infinitesimal creatures, work in almost limitless time.” If my interpretation is correct, then Michael Ondaatje delivers on what he sets out to do.Yet still, I couldn’t help but feel dissatisfied, as I do sometimes when I meet a self-professed “private person” who keeps me at arm’s length. Like Nathaniel, I kept trying to make my way to a core place called “home” – and maybe that’s precisely the point."}, {"userName": "Nancy", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/28397995-nancy", "userReview": "\"In 1945 our parents went away and left us in the care of two men who may have been criminals.\" WarlightFrom the opening line, I fell into under the spell of Nathaniel's story about how he and his sister Rachel were abandoned at ages fourteen and sixteen to the care of relative strangers, their third-floor lodger, whom they called The Moth, and the Pimlico Dancer.After their father departed, going to Asia for his work, never to be seen again, their mother stayed with them for two more weeks, sharing bits of her history, enough to lure them into understanding there was much more to her than they knew. Then suddenly she left them, too.The Moth welcomes shady company into their home. The Darter brings a string of women, none of whom last long. The teens are left alone, sometimes for days.Nathaniel discovers their mother's trunk is in the house. She had not left to join her husband. And The Moth wasn't talking. \"He was brilliant,\" The Moth says of their father, \"but he was not stable.\" Both parents are strangers to the teens.Over the next years, Nathaniel lives in a complicated and uncertain world, accompanying The Darter on nighttime trips that are perhaps criminal activities, and working odd jobs during the day. He has a secret liaison with a girl in empty houses.Years later, Nathaniel is approached to work in a government position that allows him access to files which he plumbs for information about his mother's war-related work. He visits people from his past. He pieces together who his mother truly was, the life she kept secret, the fear she lived with, and the lover who brought her into a world of danger.Warlight is a man's search for his mother, the story of the deeply etched marks left by a lost childhood, and an exploration of the stories we weave together just to survive. I received a free ebook from First to Read."}, {"userName": "Doug", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/25667717-doug", "userReview": "4.5, rounded up.My only previous encounter with Ondaatje prior to this was his Booker Award-winning 'The English Patient', and this has many of the same elements - for good and ill. The good includes exquisite prose, an exciting and involving story set in the years following WW II, and quirky characters that stick with you. Although the first section reads quickly, linearly and smoothly, the second part (purposefully and probably necessarily) fragments and is more difficult to follow, as one tries to piece together discordant elements, and the narrative bounces around in time. I was still enthralled by the artistry on display, but at times was never quite sure I was 'getting it' all. It's a book that undoubtedly would benefit from a second read-through - and should it be nominated for, say, the Booker, or another illustrious upcoming award, I probably will do so."}, {"userName": "Andrea Johnston", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/62655890-andrea-johnston", "userReview": "Beginning as I do at the beginning, and taking two steps back to reflect, I have to say that I was ready (and raring) to give \"Warlight\" a bad review. Especially after I read some of the other reviews on the work. However, upon the completion of those two important backward steps and the conviction that my old Canadian Literature professor would be gravely disappointed that I didn't \"dig deeper,\" I have come to a very different conclusion.For fans of Ondaatje, you are well aware that the words \"linear narrative\" and his name are rarely, if ever, found together. Ondaatje doesn't believe in going from A to B to C. Instead, he prefers to go A to X to G back to X (briefly) and then to B. And he does all this without telling the reader what he's up to. Conclusively then, many details are lost, key plot points are forgotten, and trying to connect with the characters is exceedingly difficult to do. And while many readers have found this narrative style frustrating, I think it actually works in favor for \"Warlight\" and enhances the meaning of the novel. This disorientation that we as the readers feel is the perfect juxtaposition to Nathaniel's upbringing as he too is passed from parent to caregiver to caregiver back to parent. Ondaatje is passing along the bewilderment and desperation that Nathaniel experiences as he tries to reconcile with who he is and where he came from. Another point of contention with this work is the ending. Again, I was more than ready to highlight the failure of this non-ending and tell you what a slap in the face it was. And indeed, it is. There *is* no ending for Nathaniel. He literally walks into another room with a piece of clothing of his mother's and that's it. Thanks Ondaatje. So understandably, many readers have denounced this novel as being a \"coming-of-age\" story. But here's what I realized when I walked away from the novel: of course there's no reconciliation for Nathaniel. He's still searching. He still has questions that need answering. He still needs to heal from the loss he's experienced and his traumatic upbringing. It IS tragic and I think Ondaatje MEANT to slap us in the face with the ending (at least, I hope so. If not, that's not very cool, Ondaatje) as Nathaniel is left bereft and lost. The reader is right there along with him as we close the book and think, \"Wait, what? That's it?\" because it IS for Nathaniel. At least for now. And that's what makes this work rather special and the one time that Ondaatje's scattering narrative works in his favor. A novel woven in beautiful language and poetic imagery, \"Warlight\" is a complex work that will strike the reader in the heart as we mourn for the characters who are still looking for their guiding lights to bring them home."}, {"userName": "♥ Sandi ❣\t", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/4984609-sandi", "userReview": "3 stars Thanks to Penguin's First to Read and Knopf for allowing me to read and review this ARC. Publishes May 8, 2018. I selected this book because of the author, Michael Ondaatje. I read his novel English Patient in the early 90's and l0ved that book. However I was much less enthused about this book. Only having just over 300 pages this novel felt like it was 600 or more pages long. I felt the story was so drug out that it lost any semblance of details. The protagonist, Nathaniel, told the story from the time he was a small boy. Then kept circling back to that time. The story kept introducing characters and then moving on, sometimes with and sometimes without them, only to circle back later in the book and detail each one. Nathaniel's mother and sister kept entering and leaving the novel in much the same fashion. I just could not follow the flow of this story due to the constant circling around. Needless to say I was very disappointed in this novel, especially after having liked The English Patient so much. I still believe that Ondaatje is a very good writer, I was just not able to connect with this particular book."}, {"userName": "Dave", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/35045983-dave", "userReview": "Quite often novels come right out at the very start and illustrate what's at stake, what matters, and where things are going. Not so in Warlight where Ondaatje starts with a bizarre situation of two children abandoned by their parents during wartime England and left with a collection of odd individuals. Very little about the situation makes sense and there are mysteries to peel back like peeling back each thin skin of an onion. We see Nathaniel and Rachel growing up, becoming young adults, left without answers. And, this is very much how children might view things, how things are strange, but Nathaniel goes on and lives and gets part time jobs, girlfriends, etc., but can never explain where his parents were off to or who his guardians are. It's a clever way to develop a story, learning tidbits as Nathaniel does. Nevertheless, we ultimately never learn all that much and are, in a sense, left hanging and waiting for the real story to be revealed but it never really does."}, {"userName": "Netta", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/42124025-netta", "userReview": "I bet you've already read this book many times. Imagine a coming of age novel (sort of) with a protagonist - a boy - whose life was torn apart by something which no ordinary human being can control (let's say, WW2, as it suits so many purposes of modern fiction). Imagine this said boy dealing with consequences of his parents and guardians mistakes. Suffering. Well, not-really-coming-of-age, in fact. We all know that oh so popular kind of protagonist who suffer delightedly in a very special, Peter Pan-esque style of \"I'm not going to grow up and mature because life's been too tough\". As many protagonists of this kind, this said boy has a sister and \"a guardian\" (and dysfunctional enigmatic family aka childhood trauma you never get past). The sister turns out to be a smart one, getting on with her life, understanding things, being irritated by her brother's stupidity and immaturity. She'll be fine in the end, I suppose (though, honestly, Ondaatje didn't -persuade me to care). The guardian is as enigmatic as a man called The Moth might be, and, of course, he's never appreciated (he won't be fine in the end as you can guess).This book is made of clichés and, sadly, Ondaatje did nothing to make them look like a clever move on his part. It's neither coming-of-age novel nor a WW2 novel. There're so many better written books with the similar premise than this one. There're so many better ways to spend time than to read this one."}, {"userName": "Stephen P", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/11602286-stephen-p", "userReview": "Epigraph: “Most of the great battles are fought in the creases of topographical maps.”A world of abandonment; a young boy and his slightly older sister are left by their parents in their family home in the care of someone who they name, The Moth.Grown, our narrator is looking back on his life of searching for, knowledge of his mother and the scattered pieces of his life. It traverses the gathering of pieces of one’s dislocated self. The searching and sweeping in of histories, relationships, and events. In this book the difficulty of this prevents an illumination of the entryway into the self. It is the outer, in its least distortion, which leads to the inner. Throughout this book this tension remains, gnawing, as does the story-plot of what does the mother do and how is this related to this band of disparate interesting others filling the house? Why has she left her children and not returned; not communicated. A sense of abandonment and aloneness teems through this novel.It unfolds intimately in creases of time. The style sublime in a lyricism unique to Ondaatje. A lyricism which plays chords unknown to others. An effect unseen. Yet, it carries the plot slipping through time but moving forward. Tension and suspense pulsing beneath the steady hand of literature.Ondaatje, one of my very favorites, I believe has matured to fruition in this work. His considerable skills have come together.I recommend this book highly."}, {"userName": "Creager", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/31294748-creager", "userReview": "Should you read Warlight? If you read English Patient and thought I should read the new Ondaatje, I would just read The English Patient again. I also give similar advice with the Ian McEwan bibliography, just read Atonement. Interestingly, if you are still feeling inclined to read Warlight, just read Atonement due to the successful play by play of a child’s point of view, whereas in Warlight Nathaniel’s self-centered POV is so lackluster it derails any and all interest in the actual interesting characters of this novel.But you’re thinking, she gave it a 2 Star? She thought it was okay. Throughout Warlight I was mentally thinking, okay? As well as oooKay Or simply o.k...also on finishing Warlight I shrugged-the physical manifestation of okay."}, {"userName": "Kasa Cotugno", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/2345554-kasa-cotugno", "userReview": "\"It was a time of war ghosts.\"Here, as with most of his books, Michael Ondaatje, sets a scene, but not immediately. By opening in 1945 and sliding around in time, he weaves a story rather than laying it out for easy consumption. The reader has to work. And I find myself totally immersed in the characters, the narrative, his ability to transform reality and capture and reassess elusive memory. This book in particular reminds me of the work of Patrick Modiano in which lives are transformed by secrets that usually have their roots in the past, most often in World War II."}, {"userName": "Katie Long", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/46311769-katie-long", "userReview": "Wow, this one surprised me! Ondaatje has long been an author who I admire without necessarily enjoying. Until now that is. I was blown away by the subtle skill of the details and fragments that seem hazy at first but that he eventually brings into focus. I was also totally engaged in the story itself and Nathaniel's determination to understand his own history, how he came to be the man that he is, and who he loved and damaged, and was loved and damaged by, along the way."}, {"userName": "Tony", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "WARLIGHT. (2018). Michael Ondaatje. 21/2*I have to admit that the only other book that I’ve read by this author was “The English Patient.” That was a fantastic – later made into a fantastic film – that went on to win the Booker Prize. This effort by Ondaatje was not nearly as good. Although it was well written, I searched high and low for the presence of a plot. It is the story of two teen-aged children, a boy and his older sister, who were left with a caretaker while their parents went off to Singapore to start a new phase in their father’s career. In fact, the story is really about the caretaker and his circle of friends that moved in with the kids. We get to meet most of the friends and hear stories about their lives, but the tales are disjointed and don’t really hold together. What can I say? I read it, but I really couldn’t recommend it to my friends. It was more an exercise in writing skills. I kept wondering how much more time I’d have to spend with each character before I could move on to the next one."}, {"userName": "Krista", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "We continued through the dark, quiet waters of the river, feeling we owned it, as far as the estuary. We passed industrial buildings, their lights muted, faint as stars, as if we were in a time capsule of the war years when blackouts and curfews were in effect, when there was just warlight and only blind barges were allowed to move along this stretch of river.\n I see I'm not the only reader who was reminded of The English Patient by this book – the end of WWII setting, the mystery that unspools nonlinearly, characters' moral ambiguity – but what I most remember of that earlier Michael Ondaatje work was what a slog I found it to read (I will allow that I read it nearly thirty years ago, may not have been up to the challenge, and enjoyed the writing in later Ondaatje reads). By contrast, I found Warlight to have been a mostly fine read – with plenty of quirky details and challenging ideas – and while it was totally accessible, I don't know if it was terribly deep. It's hard to know who to recommend this book for: it's neither breezy historical fiction or a profound character study; neither fish nor fowl; I can't muster up a strong reaction to what I've just read.\nIn 1945, our parents went away and left us in the care of two men who may have been criminals. \n This is the opening line of Warlight and it sets up a lovely ironic vibe. Nathaniel is fourteen, his older sister is sixteen, and after the recent disruption of the war and the Blitz that sent the children off to their grandparents' in the countryside, they accept it rather stoically that Dad has a new job in Singapore and Mom is going to join him there for a year. The mysterious boarder in the attic, that the kids secretly call The Moth, is soon joined in the duty of watching over them by his friend The Pimlico Darter, and shortly the house is filled with a strange assortment of weird, but secretive, visitors. There are so many odd details in this first section – boys peeing in the sink of their boarding school dormitory's third floor bathroom because it has no toilet, smuggling greyhounds along the Thames for bet-tampering at illegal racetracks, toiling behind the scenes at posh hotels and restaurants – and the mysterious, ironic, and detail-rich atmosphere was completely engaging. But then the kids discover their mother's steamer trunk, which they had helped her pack for her year away, hidden in the basement and a darker vibe is introduced. Stuff and such happens, there is a DRAMATIC incident, and the second half of the book begins and Nathaniel is 28 and living in the Suffolk village in which his mother grew up. He spends this second half searching for the truth of his mother's story, and while the narrative still has plenty of singular and surprising incidents, it started to lose my interest. \nI used to sit on the top level of a slow moving bus and peer down at the empty streets. There were parts of the city where you saw no one, only a few children, walking solitary, listless as small ghosts. It was a time of war ghosts, the grey buildings unlit, even at night, their shattered windows still covered over with black material where glass had been. The city still felt wounded, uncertain of itself. It allowed one to be rule-less. Everything had already happened. Hadn't it?\n This idea of “warlight” seems to chime with “fog of war” – circumstances in each case preventing one from seeing quite clearly – and while life valiantly carried on in a half-lit London after the war was officially over, those who had spent WWII as spies and undercover agents found they still had work to do in the shadows. Even those who thought their duties were fulfilled might discover that loose ends were now coming after them; how fitting that a long-flew knife was designed precisely for loose ends. It comes as a surprise to Nathaniel when the Home Office approaches him with the offer of a job (“cleaning up” its war time records), and in a too-good-to-be-true twist, he is literally given the keys to unlocking his mother's past.\nYou return to that earlier time armed with the present, and no matter how dark that world was, you do not leave it unlit. You take your adult self with you. It is not to be a reliving, but a rewitnessing.\n Much is made in Warlight of memory and map-making and music and codenames; when I get tired of seeing the same themes over and over, they feel pointlessly overused to me. The specifics of the history that Ondaatje writes about (and especially the morally queasy events in Italy and Yugoslavia) were all very interesting to me, but the efforts to elevate the literary aspects made the whole thing fall apart for me. I wish I liked this more, but it was just all right for me."}, {"userName": "Clay", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/861076-clay", "userReview": "Michael Ondaatje's books are for those who enjoy the sentence by sentence journey of a story and the depths the gradual accretion of beautiful, thoughtful sentences can reach. I read this wondering if the story--two teenagers left by their parents in the care of men who might be criminals during WWII--might be a young adult story, but it solidly adult in style. What the story's really about is the young man's lifelong search to understand who is mother was and who he is too, which, it occurs to me, is the search most children of complicated parents undertake at some point or points in their lives. Recommended to such readers."}, {"userName": "Steph Post", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/8942931-steph-post", "userReview": "Michael Ondaatje will remain my favorite author, but I was really disappointed with Warlight. There were a few moments of brilliance, a few images that were striking, but I found so much of the narrative repetitive, which then lead it to be aimless as well. Ondaatje's usual sparkle and brilliance with language seemed absent in most of the story. Overall, it just felt like something was missing, or had been left out, and then patched over by continuing to drive home the themes for the reader instead of letting them develop. I'm not sure what happened here, as I've read everything Ondaatje has ever written and love most all of it, but Warlight fell very flat for me."}, {"userName": "Jan", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/8550623-jan", "userReview": "Cool and controlled with a number of surprises but a frustrating amount of stuff withheld. I’m sure that’s the point, but it doesn’t mean I have to love it. Definitely interesting though!!"}, {"userName": "Moray Teale", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/7270869-moray-teale", "userReview": "It’s World War II in London and Nathaniel and his sister are left by their parents in the care of a mysterious and somewhat dubious figure known as the Moth. His acquaintances are unusual, varied and often rather suspicious and the two children soon come to the conclusion that their soft-spoken guardian is a criminal. But why would their parents leave them under the eye of such a man? Why did they leave so suddenly for Singapore? Why is their mother’s inexplicable return surrounded with fear and violence? As an adult Nathaniel tells us his story and he has few of the answers himself and we learn along with him as he searches for explanations for the strange and unsettling things he recalls from his childhood. It’s a story full of those things that have made Ondaatje famous, the complex non-linear narrative, the unreliability of memory and recounted events, the nature of guilt, particularly in war where the ends may be said to justify the means. They’re the things that worked so perfectly in the English Patient but just don’t quite come together here, at least not with the same force. It’s a book to that will leave you thoughtful and mildly confused but it fails to resonate the way that his most famous work does.For me this is not a consequence of the style, which many other reviewers have found frustrating, at least not in the main. It goes without saying that the prose is wonderful but I also loved the non-linear, circuitous route that the story took. This way of circling back to events to offer new thoughts, new details and new complications is one of the best, if most difficult, forms of the first-person voice. It mirrors more closely how we think and how we remember and also how we lie. The same is true of the gaps and the answers that we never get; the readers’ frustration is deliberate because in life sometimes there are no answers or those that keep them refuse to give up their secrets. For the majority of the novel this worked with all of the effectiveness and precision that I expect of Ondaatje. Where it faltered was the sudden change to the third-person when we were given such a large portion of Nathaniel’s mother’s story without any real idea of where these revelations came from. The problem was not the complexity of the narrative or the omissions but this odd section where an omniscient, unidentified narrator offered up so much information for free when we had had to work so hard to piece together the fragments of information revealed thus far. I kept waiting for an explanation as to why this happened, expecting it to be revealed as another unreliable element but it seemed to be utterly straightforward and I just couldn’t integrate it with the rest of the narrative or even what I had imagined were the key themes of the story. Why offer all of this information and leave the other gaps, the other problems so unsolved?This conspicuous deus ex machina destabilised the whole story but for no discernible reason, not even as a reflection of fractured unbalanced of life itself. This episode left me unmoored from the story and I was never able to fully reconnect, not least because it returns to its earlier formulation leaving this strange protuberance casting a shadow over the rest of the narrative. It could almost have been excised completely and the story would have been better for it. Give me no answers rather than easy answers any time."}, {"userName": "Kyra Leseberg (Roots & Reads)", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/5899398-kyra-leseberg-roots-reads", "userReview": "Nathaniel and his sister Rachel are left in the care of a mysterious man they nickname The Moth when their father receives a job promotion requiring a year abroad. Their mother will go with him and they will stay behind in London to attend boarding school.It is soon revealed that the family has many secrets that 15 year old Nathaniel tries to understand with limited experience while surrounded by people he believes are supposed to keep him and his sister safe yet seem vaguely dangerous.I failed to really understand this book. I can't explain any solid plot to you and the story Nathaniel tells us is meandering with a lot of pointless information. He is detached from the story itself, blaming youth most of the time, and we never get to know any of the characters.I didn't connect with any of the characters or the writing itself. The most interesting part of the story was the focus on his mother. I would be curious to read her full story from her perspective but this novel is flat, listless, and without any resolution or ending since all information given to the reader is so vague.Thanks to Penguin Random House for providing a digital ARC in exchange for my honest review."}, {"userName": "Jessica", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/29313144-jessica", "userReview": "I saw an ARC of this book in Florida around three months ago and have been awaiting it’s release with baited breath since I read the blurb on the back. Anyone who knows my reading habits knows I pick up a book with the words WWII in the description like it is my job to read the subject all the better is it is a spy story. I was completely underwhelmed by the finished product though. This book had the potential to be so many things yet fell short before choosing any of them.Warlight may have been the story of two siblings left in London with a mysterious figure known to them as The Moth, but it hardly focused on that fact at all. It could have been a story about the figures that stumble through Nathaniel and Rachel’s home while their parents are away but only really focuses on two or three of them, and not well. This could have been a novel about Nathaniel’s sexual maturity but we only brushed against the subject before he was whisked away. I began to think it would be a novel about greyhound racing with was not mentioned in the least but then suddenly everything flipped on its head and it wasn’t that either. Eureka, I thought at that point, obviously this is a novel about what Nathaniel’s parents were doing when they left home and what they did during the war. Except besides lots of research and some minor clues we never get the whole story there either. I give up I will never understand what this story is about.The writing style was fabulous, and to me the only redeeming factor of the book. I thoroughly enjoyed the almost magical characterizations of people and places. I read none of the reviews about this book before starting in and I am disappointed in the time I spent struggling to finish this book. I kept hoping that something would be resolved but no conclusions were contrived. Nathaniel was the POV throughout the story and he just seemed to read his life along the lines of a medical journal. Not enough emotion in relation to some of the events."}, {"userName": "Andy Weston", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/313206-andy-weston", "userReview": "Ondaatje’s Warlight is a novel of two halves, set in London just after the Second World War. The first half of the book concerns the adolescence of the narrator, X, who when the novel begins is 14 years old, and his parents have just mysteriously left him and his older sister in the care of one of their household lodgers, The Moth, for a lengthy trip away. It takes a while for Xs new life to settle, as he changes schools, and comes of age through a variety of summer jobs and The Moth’s acquaintances. The second half is X looking back as an adult at his life at that time and trying to make sense of it, and exactly what happened to his parents. It reads for the majority of it as a spy novel, and reminds me of Boyd’s Restless at times.  Warlight  is an absorbing study on what war asks of people. Given the storyline, this could have been a fast-moving spy-thriller, instead it is an intricately plaited and slow-paced read with recurring elements that leave the reader to join the dots. And, it’s memorable first sentence... In 1945 our parents went away and left us in the care of two men who may have been criminals."}], "description": "From the internationally acclaimed, best-selling author of The English Patient: a mesmerizing new novel that tells a dramatic story set in the decade after World War II through the lives of a small group of unexpected characters and two teenagers whose lives are indelibly shaped by their unwitting involvement.In a narrative as beguiling and mysterious as memory itself--shadowed and luminous at once--we read the story of fourteen-year-old Nathaniel, and his older sister, Rachel. In 1945, just after World War II, they stay behind in London when their parents move to Singapore, leaving them in the care of a mysterious figure named The Moth. They suspect he might be a criminal, and they grow both more convinced and less concerned as they come to know his eccentric crew of friends: men and women joined by a shared history of unspecified service during the war, all of whom seem, in some way, determined now to protect, and educate (in rather unusual ways) Rachel and Nathaniel. But are they really what and who they claim to be? And what does it mean when the siblings' mother returns after months of silence without their father, explaining nothing, excusing nothing? A dozen years later, Nathaniel begins to uncover all that he didn't know and understand in that time, and it is this journey--through facts, recollection, and imagination--that he narrates in this masterwork from one of the great writers of our time.", "title": "Warlight", "url": "http://www.goodreads.com/book/show/39209348-warlight", "average": 3.74, "cover": "https://images.gr-assets.com/books/1525482109l/39209348.jpg", "reviews": 315, "authors": [{"url": "https://www.goodreads.com/author/show/4030.Michael_Ondaatje", "name": "Michael Ondaatje"}, {"url": "https://www.goodreads.com/author/show/4030.Michael_Ondaatje", "name": "Michael Ondaatje"}], "type": ["Historical", "Fiction", "War", "Historical", "War"], "outlinks": ["http://www.goodreads.com/book/show/36723246-warlight", "http://www.goodreads.com/book/show/39209348-warlight", "http://www.goodreads.com/book/show/35657511-warlight", "http://www.goodreads.com/book/show/36723287-warlight", "http://www.goodreads.com/book/show/40377875-warlight", "http://www.goodreads.com/book/show/36410100-warlight", "http://www.goodreads.com/book/show/36701380-warlight", "http://www.goodreads.com/book/show/11713.The_English_Patient", "http://www.goodreads.com/book/show/11076177-the-cat-s-table", "http://www.goodreads.com/book/show/5946.In_the_Skin_of_a_Lion", "http://www.goodreads.com/book/show/5942.Anil_s_Ghost", "http://www.goodreads.com/book/show/80063.Divisadero"]}