{"ratings": 21957, "userreviews": [{"userName": "BlackOxford", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/17744555-blackoxford", "userReview": "This Gives Life to TheeNo contentious politics, no military apologetics, no analysis of motives, or rationalizations of judgmental error, We Were Soldiers is a memorial to the soldiers of the Air Cavalry during their first battles in Vietnam. The book reports almost every step taken by the two battalions involved in the week-long battles of Ia Drang, mostly in the words of the soldiers - on both sides - who took those steps. It is a humbling and heartbreaking chronicle of comradeship, suffering and frequent violent death. Written without any conventional narrative and in direct journalistic prose, the book presents no message other than remembrance. Consequently I think it is impossible to read without feeling awe at the courage and devotion to each other shown by these men."}, {"userName": "Jeff ", "userReviewDate": "Sep 27, 2012", "userURL": "http://www.goodreads.com/user/show/12618229-jeff", "userReview": "This is the story of the Battle of Ia Drang and the first time United States ground troops went up against the North Vietnamese Army (NVA) in a pitched fight. There are two parts to the engagement: 1) U.S. forces, using helicopter as mech-calvalry, drop into a zone and are surrounded by a force that out numbers them 4 to 1. 2) Troops march from here and move to another “zone” and are quickly ambushed and put in a truly desperate situation.The battle not only “changed” American soldiery’s involvement by scaling up the bloodshed, but went further to entrench Washington policy maker’s misguided approach to the conflict. Beyond the fact that it was huge mistake to even be in Vietnam to begin with, supreme errors in judgment effectively made this a no-win situation from the beginning; a decisive military outcome would never be in the cards. The heroic fighting men, laying down their lives, were caught in a vice-grip squeeze between an angry public and dull-witted foreign policy makers.The NVA used Cambodia as a staging area for its forays into Vietnam and because the U.S. could not pursue thier mauled opponent into this nation, the NVA could recover and regroup. The Nixon administration had no qualms about chasing enemy soldiers into Cambodia, but by then it was too late. More proof that this was a no-win situation: the U.S. army would free a region/village from NVA control turn it over to the South Vietnamese, who would promptly let be overrun; leading to a repetition of bloodletting and misery to re-take it.In his book Moore does touch upon this, the larger picture, at the end, but it’s the heroism and valor of his troops and the in-battle decision making that make up the bulk of the book. If you’ve read Black Hawk Down, you’ll appreciate Moore’s stirring rendition of combat. To his credit, Moore knows the sorrows of the battlefield don’t end there and gives families of the fallen soldiers their say on the impact the war directly had on them at the end of the book.A sidenote: Early in the conflict, the Army did not have a system in place for notifying families (or even helping them cope with grief) when their loved ones were killed in battle. Telegrams were given to Yellow Cab drivers, who, not always sober, would deliver the tragic news to the next of kin."}, {"userName": "David", "userReviewDate": "Mar 29, 2013", "userURL": "http://www.goodreads.com/user/show/7220379-david", "userReview": "I was an Infantry Officer in the 101st Airborne in Vietnam, during the \"Hamburger Hill\" - Firebase Ripcord period in the area of the Ashau Valley that, like the Ia Drang Valley, ate American units whole. I came back disillusioned and angry as many did.But when I finished this book, I looked at my wife and said, \"If THIS MAN were to walk up to our front door, drop a rucksack and a rifle on the porch and say \"Follow Me,\" I would do it. THIS MAN (Lt Col. Hal Moore) is a leader who cares! I was gratified some years later to learn that Hal Moore retired as a General Officer.I still would still follow Lt Col. Moore. The man did his best to safeguard the young lives who were entrusted to his care, and bitterly regretted every life that was sacrificed. The first half of the book describes how Lt Col. Moore's Battalion was dropped into the middle of an NVA Regimental Headquarters and the battle that resulted.Sadly, the second half of the book is a description of what happened to the battalion that was combat assaulted in to relieve Lt Col. Moore's Battalion after the battle and was decimated because that Battalion was lead by a man who clearly did not care and was incompetent.This book was not an easy book to read, but it clearly deserves the five stars that I gave it.I am proud that I served and I am not saying that we should never go to war. But I do feel that there should be a required reading list for anyone who wants to send young Americans to die on foreign battlefields and this book should be high on that list."}, {"userName": "Marijan", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/6928596-marijan", "userReview": "jedna od najboljih knjiga o ratu koju sam pročitao. bez pretjeranog busanja u prsa i mačoizma, ispričana iz perspektive vojnika koji su u bici učestvovali, a autori su se potrudili, otišli u Vijetnam i intervjuirali vođe druge strane, te u knjigu ubacili i njihovu perspektivu.Plus, samo da znate, film prikazuje samo prvi dio bitke."}, {"userName": "Timothy Miyahara", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/43828026-timothy-miyahara", "userReview": "Moore's work is an essential reading for students of the Vietnam War. While it covers only the 1965 engagement at Ia Drang, the work provides tremendous insight into this first major conflict between an American force and regular NVA forces, and the learning curve both sides had to climb during that short span. The author's direct involvement in the conflict as the U.S. forces commander, and his access to the individuals involved allows a gritty personalization of the actors and actions of the battle.The meeting engagement of an airmobile battalion and North Vietnamese ground units quickly descends into a fight for survival for the smaller U.S. forces as they realize they have planted themselves into the midst of a much larger NVA division. Surrounded and with no means of resupply or extraction except by air, the outnumbered U.S. soldiers must hold their ground and fight for their lives until able to maneuver to safety.The reason Moore asserts Ia Drang changed the Vietnam conflict is that this battle is not only the first engagement of NVA regulars, this is the first test of vertical envelopment using rotary wing aircraft (helicopters). The lessons learned in this battle helped forge U.S. doctrine for the entire war.Along with Charles MacDonald's Company Commander: The Classic Infantry Memoir of World War II, this is an essential work on understanding the experience and dynamics of small and medium-sized unit command."}, {"userName": "Larry Bassett", "userReviewDate": "Apr 30, 2011", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "The book opens with five pages listing those killed in the Pleiku campaign in October and November 1965 when the War in Vietnam was just beginning to heat up. And the Prologue continues along the same vein with descriptions of encounters with enemy soldiers and death. The lead author, Hal Moore, was a Lieutenant Colonel in the 1st Calvary Division, one of the units at the front of the battle about which We Were Soldiers Once … And Young is written. The second author, Joe Galloway, was a UPI reporter who managed to work his way into the battle, complete with M-16 rifle long before imbedded was the common terminology. As they say, both lived to tell the story. And this is it.This is about what we did, what we saw, what we suffered in a thirty-four-day campaign in the Ia Drang Valley of the Central Highlands of South Vietnam in November 1965, when we were young and confident and patriotic and our countrymen knew little and cared less about our sacrifices. In contrast to the intense, descriptive language of the Prologue and Chapter 1, The Heat of Battle, Chapter 2, The Roots of Conflict, delves into the background taking the point of view of both the Americans who were by and large new to Vietnam and the North Vietnamese People’s Army, testing and evaluating the new American fighters whom they knew were supported by a new entry into warfare, the Huey chopper. Key figures on both sides are introduced, including senior commanders of the North Vietnamese army. Information about North Vietnamese plans and troop movements has been obtained by direct interviews with military personnel years after the end of the war as well as from captured war documents and prisoner interrogations during the war. The hairiest part of any operation was always the air assault. We had to time the flight and the artillery so close. When the choppers were one minute out the last artillery rounds had to be on the way or you get Hueys landing with the shells. We always sweated because if you shut down the artillery too soon the enemy could be up and waiting when the choppers came in. This one was precisely on time. First person accounts dominate Chapter Six, The Battle Begins. (Chapter Notes at the end of the book include documentation of the source of many of the details and quotes.) Throughout, there was the constant close-in noise of rifles, machine guns, and exploding grenades and mortar shells. You are there on the ground in the midst of the action and are introduced to the men who are fighting for their lives as well as those who lose their lives. Some of them speak directly to you in the first person.Chapter Seven: Closing with the Enemy –  The enemy on the mountain started moving down rapidly in somewhat uncoordinated attacks. They streamed down the hill and down the creekbed. The enemy knew the area. They came down the best-covered route. Chapter Eight: The Storm of Battle –  Suddenly the M-60 jammed. … Debris from the ground had caught in the ammo belt when Adams was hit. I flipped it right side up, slapped the ammo belt back in, slammed the feed cover closed and began firing again. It seemed like a lifetime, but it wasn’t more than five or ten seconds. …I don’t know what the hell’s happening. I’m out there by myself. I’m only a twenty year old kid. I don’t know what’s going on. I followed Russell Adams; I’m his assistant gunner so I go where he goes. That’s how I got up there. …While Doc Nall was there working on Russell, fear, real fear, hit me. Fear like I had never known before. Fear comes and once your recognize it and accept it, it passes just as fast as it comes, and you don’t really think about it anymore. You just do what you have to do, but you learn the real meaning of fear and life and death. Chapter Nine: Brave Aviators – The Huey crews performed magnificently, running an enemy gantlet of enemy fire time and time again. They never refused to come when called. In turn, we did our best to call them only when fire was lightest, and we tried to have teams standing by to unload supplies and load the wounded in record time, to reduce the aircraft’s exposure on the ground.And so it goes… chapter after chapter: Fix Bayonets! Night Falls. A Dawn Attack. Friendly Fire. Rescuing the Lost Platoon. Night Fighters. It Ain’t Over Till It’s Over. A Walk in the Sun. Hell Is a Very Small Place. Death in the Tall Grass. Escape and Evade, Night Without End. The Sergeant and the Ghost.As one who has never been in a war, it is hard for me to understand how and why the men described in We Were Soldiers Once … And Young did what they did. Reading this book and others about Vietnam is my feeble way of trying to put myself in that position. But I still don’t understand. The 17 page Appendix of the book is an effort to tell the story after the battle of those who survived. What can be said in a paragraph about men who risked their lives and saw many of their friends die, often gruesome and bloody deaths? How did those survivors support or oppose the eventual wars the U.S. carried on in Iraq and Afghanistan? It is easy to say that no one came home from Vietnam the same but hard to comprehend the enormity of that statement. More than three million Americans served in the long and bitter struggle in Vietnam. 58,000 Americans died.This is another book about Vietnam that was turned into a movie. Made in 2002, it starred Mel Gibson. You can make money off a war movie. Joe Galloway, the UPI reporter and co-author of the book, got a pay raise too. From $135 to $150 a week. His mother called it blood money. And he thought she was probably right. But not enough money for all the blood. As he was being airlifted out of what they called Landing Zone X-Ray, author Hal Moore thought:As I looked down on the battle-scarred earth and shattered trees below, I felt pride in what we had done, grief at our losses, and guilt that I was still alive. P.S.: I often wonder as I read a book about war, something I have done often in recent years, if the author is anti or pro-war. How could someone be pro-war you might ask. Maybe it would be better to suggest that some writers have the point of view that war is inevitable and that, as a part of our world, it affords its participants the opportunity to be heroes and experience positive character development. You know, camaraderie. Bonding. We Were Soldiers Once … And Young includes the mandatory example of a soldier throwing himself on a grenade to save his friends. And there is also the enemy going from body to body, killing those who are not yet dead while our hero pretends to be dead so survives. We didn’t do that. Much. Talk about something that leaves me scratching my head.  Diduryk, then twenty-seven, had commanded this company since May. He was eager and aggressive and yet totally professional; over the next three days and nights he would emerge as the finest battlefield company commander I had ever seen, bar none. He operated on the basic principle of maximum damage with minimum loss.No doubt Vietnam resulted in maximum damage. But not minimum loss. This book will make that obvious. I give it four stars. It held my interest even knowing what was going to happen. It humanizes both the American and Vietnamese soldiers. It has a definite ebb and flow of intensity, as you would expect in a book about pitched battles and the lulls between them. While it focuses on the action on the battlefield, some of the repercussions for loved ones back home are effectively included. At times I found myself reading intently through horrendous events just to get to the end of the book. I felt like that during the actual war. I just wanted to get through it to get to the end. It took a long time for the end to come and for some it still has not come."}, {"userName": "Lisa", "userReviewDate": "May 28, 2011", "userURL": "http://www.goodreads.com/user/show/3163454-lisa", "userReview": "Every time I read a book about a war, or a battle, or a military conflict which is written by someone who experienced the conflict first hand (AKA a combat veteran,) I feel the need to explain something before I begin my review. I have found that when a veteran of combat writes a book about a particular battle or incident, that they write from their perspective (AKA the rank they held) at the time as opposed to their current rank or status. Sometimes, they may add some more recently acquired wisdom, but for the most part they only know how they thought and felt and acted within the role that they held at that time. Therefore, if I refer to Hal Moore as a Lieutenant Colonel and not as a general, it is for this reason. Based on the above statement, I should state that for whatever reason, ignorance or stupidity or whatever, I have found that usually, I only understand War from a \"Platoon or Company perspective.\" I have read, understood, appreciated and loved multiple books by Lieutenants, Sergeants, and even Captains, but I have a much more difficult time understanding higher ranking officers or larger military units. This book definitely fit that pattern at times. Colonel Moore described the battlefield, the perimeter, the strategy, the communication process, and administrative things in a way that sometimes left me flicking at my lips with my pointer finger. Frequently he went off on an LTC tangent which he would explain better in a subsequent chapter. Luckily for me, much of the story was told in short narratives by battle survivors. I really understood and enjoyed reading about small group interactions such as the experiences of the lost platoon or interactions that occurred in foxholes. I got a little lost when I read about the placement of companies around a perimeter, reserve units, command post operations, air strikes, artillery, and machine gun activity. Luckily he included maps. I did enjoy the tidbits of leadership insight despite the fact that I will never use them.I'd like to add here that I have a personal fondness for battle maps. Any maps will do really. Squiggly lines and arrows drawn hastily on a napkin are fine with me. I HATE books which attempt to explain a battle without providing any kind of visual clues whatsoever. Because frankly, verbal descriptions of \"flanking manuevers, columns, and patrol formations\" are pretty meaningless to me. Is the left flank on our left, or the enemies left? LOL. I guess I'm not really the target audience, anyway. I gave the book 5 stars because it is a classic and really quite wonderful despite my inadequacy as a reader."}, {"userName": "Sweetwilliam", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/5862503-sweetwilliam", "userReview": "I was at a fund raiser for a local VFW and I ran into an old, grizzled, retired master sergeant. I asked the old veteran which war he fought in. He said “You ever seen that movie ‘We Were Soldiers?’ Well I was one of the soldiers” and he proceeded to tell me about “bodies stacked this high” as he put his hand up above his waist and other amazing stories. After thanking him for his service, I ran home and downloaded the book on my Kindle. I absolutely loved the book and I especially liked how the author and 1st battalion CO, Colonel Hal Moore, allowed key contributors to each write their own narrative. Even civilians on the home front and the enemy contribute to the overall story. It may have made the story a little less cohesive at times but it sure made it a fun read. Just keep in mind that when battalion size units become intertwined with other units, both friendly and enemy, in canopy jungle, events are bound to get confusing. This story is about the Vietnam War at a time when the United States became involved in the War en masse. The first major confrontation was in the Ia Drang when Hal Moore’s 1st battalion, 7th Cavalry slugged it out with North Vietnamese and Viet Cong troops. The 7th Cavalry boys called themselves the Gary Owens after the famed 7th Cavalry of George Armstrong Custer and the famous last stand at the Little Bighorn about 90 years earlier. This was a new type of airmobile warfare and Hal Moore’s battalion was highly trained. They ran into problems prior to deployment as the “short-timers” were sent home and many key billets were replaced with completely untrained personal. Also, there was another accompanying battalion that had almost no training at all. The Hollywood movie follows the first part of the book fairly close until the movie’s end when Hal Moore played by Mel Gibson, led a ridiculous bayonet charge that never happened. There was a second part to the book that the movie did not depict. Moore’s battalion was relieved by another battalion that marched in overland. In this part of the story, the new battalion is moving in column through the jungle when they bump into enemy forces. For some reason, all the line officers are called to the head of the column just prior to all hell breaking loose. The officers cannot get back to their units. In this part of the battle, US fared much worse than Moore's battalion. Hal Moore’s troops had to saddle up and relieve the other battalion.The North Vietnamese claimed that they learned from the fight in the Ia Drang and they took copious notes about how to beat the Americans. The US Army said something on the order of that’s BS. All the NVA learned was that the politicians wouldn’t allow Army units to hunt them down in their sanctuary in Cambodia. This was another political mess and it was worse than Korea. Enjoy"}, {"userName": "Dave", "userReviewDate": "Jan 22, 2009", "userURL": "http://www.goodreads.com/user/show/1185730-dave", "userReview": "Since I'm now reading the sequal I thought I'd review the original book. This is probably the best book to come out of the Vietnam war, and is a classic in terms of the view from the other side. This is the battle where America \"took the plunge' into the war and was the battle that the North Vietnamese used as a blueprint for their war against the Americans for the next 10 years."}, {"userName": "Virgil", "userReviewDate": "Aug 08, 2008", "userURL": "http://www.goodreads.com/user/show/845600-virgil", "userReview": "Every once in a while, a book comes along that really has an impact on me, and this is one such book. Interestingly, I didn't know the book existed until 2002, 10 years after it was published. I had heard of Ia Drang, though, from a good friend who was there and told me about the battles a couple of times when he got drunk. It is the only time I ever heard him mention it, I think he had to get drunk to talk of it and he did so with tears in his eyes. And just after I finished reading the book, I ran into another Ia Drang veteran who just two months before learned that a buddy of his had not died back in 1965. Both had been severely wounded and both thought the other dead. This man told me that the \"longest\" period of his life was being put on a helicopter taking severe fire after being wounded. I didn't say medevac helicopter because they refused to fly into LZ X-Ray to pick up the wounded since it was a \"hot\" LZ. The helicopters of the 7th Cavalry, designed to carry troops, flew mission after mission into incredible danger to bring in ammunition and water and take out wounded and dead. Some of those pilots and crews didn't make it, either, but they saved countless lives while the medevac crews sat on their asses back in safety.The authors are Hal Moore, the commander of the battalion that fought at LZ X-Ray (Landing Zone X-Ray) and Joe Galloway, a journalist who was there. Joe was one of the few \"good guys\" when it came to journalism in Vietnam.The mention of Ia Drang causes a grim gut reaction among people who know what happened there. What makes it worse is that very few people have ever heard of it and fewer care. It is one of those now forgotten battlefields with its warriors also forgotten. If you will recall the movie Good Morning Vietnam, you might remember toward the end a bunch of happy-looking soldiers sitting in the back of troop carrier trucks and Robin Williams asks them where they are going. One of them says, smiling, \"the Ia Drang valley.\" That was an insider anti-joke. Those smiling boys ran into hell in the Ia Drang. This book is about the first major American contact with the enemy in what became the Ia Drang campaign.This book concentrates on firsthand accounts of two battles, but starts and finishes with historical and political musings, as well as the effects of war on the families back home.The first part is devoted to the history of the development of air assault doctrine, which was a completely new concept in warfighting, with a lot of promise for a place like Vietnam. Essentially, this doctrine eliminates land lines of communication by inserting men and supplies into an area, keeping them supplied and extracting them by helicopter.One of the things that makes this such a powerful book is that every effort was made to let us know who these men actually were, including the lives they had led as civilians and introducing us to their families. Some of them were \"three war men,\" those who had seen combat in World War II and Korea and now were going into another one in Vietnam. Others were draftees, some with only days left in the Army when they landed at LZ X-Ray on November 14, 1965, or arrived in the vicinity of LZ Albany on November 17.Hal Moore's battalion, the 1st of the 7th Cavalry (Custer's old unit) had a simple mission - find the enemy and fight him - see how well this air assault doctrine works. They did not know what they would find; accurate intelligence on enemy strength was nonexistent. The battalion was understrength and had some 431 men and officers in the line companies.They landed in the middle of a regular Army North Vietnamese Division, well trained and fresh from their unimpeded journey from the north down the Ho Chi Minh trail in Cambodia. LZ X-Ray was ten miles from the Cambodian border, and the US was not allowed to breach that \"sovereign\" territory, despite its use as a safe haven for the enemy.What followed was three days of horrendous fighting. Moore had time to set up a reasonable defensive perimeter as the fighting got started, even though they were in an intensive firefight before the entire battalion had been landed. The exception was one platoon with a gung-ho platoon leader that chased a North Vietnamese soldier to capture him and found themselves cut off and up against at least a battalion-sized force. The platoon leader, Lt. Herrick, was one of the many KIA in that platoon, and Sergeant Ernie Savage, after two other men had taken Herrick's place and been killed, took over and held the platoon together.Meanwhile, the rest of the battalion was also in the fight of their lives, including an attempt to break through to the cut-off platoon. They had virtually nonstop artillery fire support from a location a few miles back, which probably saved them against these overwhelming odds. They also had air support from the Army and Air Force, including one unfortunate incident when napalm was dropped on US troopers.In the end, the 1st of the 7th Cav prevailed and the enemy withdrew. One machine gunner had literally killed hundreds of enemy soldiers single-handedly. Enemy and American bodies were everywhere. The Vietnamese had systematically searched out and killed all the US wounded they could find during the nights. This Vietnamese killing of wounded was even worse at LZ Albany.As Moore's battalion was cleaning up the mess at LZ X-Ray, McDade's 2nd of the 7th Cav and another battalion, the 2nd of the 5th Cav, arrived to relieve the men who had not slept for 3 days. On the morning of November 17th, these two battalions marched toward rear LZs for pickup, with McDade's battalion diverting, under orders, to LZ Albany. It was supposed to be a \"walk in the sun.\"McDade was an inexperienced battalion commander, having just recently been given his command. His companies were strung out when they reached the outskirts of LZ Albany, a clearing in the forest. Two North Vietnamese were captured, and McDade called his company commanders to the front to confer. Only one of those commanders made it back to his company, and he did so only by reflex as the enemy attack broke out.This spread-out battalion was cut to pieces, and only a small perimeter near Albany was able to mount an effective defense. The book outlines in detail the horrors of this battle until reinforcements finally arrived the next morning.This book contains unbelievable gore, incredible heroism, and selfless sacrifice by men of every rank in the face of some of the most overwhelming odds ever faced by a small unit. Much of it is in the survivors' own words as they remember it. This stuff makes most of the fictionalized accounts of combat by those who have never experienced it look positively silly. This book also brings home the point indirectly that soldiers are able to separate politics from soldiering. Soldiers care about each other and staying alive and, believe it or not for most, doing their jobs.The last part of the book deals with some politics and the effect these battles had on the families at home. On the political front, Moore comments on the suicidal policy of not allowing the US to mount any kind of effective counterattack on the North Vietnamese sanctuary in Cambodia. When Nixon finally bombed this country, it was too little too late, and American leftist war protesters once again made it clear that the lives of American soldiers were meaningless to them. The men who fought and died in the Ia Drang would beg to differ, but their story has been one that many would like to pretend didn't happen.Some of the most touching parts of the book are the descriptions of the impact these battles had on those at home, particularly the families living at or around Ft. Benning. For example, the terror that the wives had of yellow taxis, which were used to deliver the \"Secretary of the Army regrets\" telegrams in the early days of the war. Another example follows the wife and daughter of Lt. Geoghegan, whose daughter had been born just before he left for Vietnam. Lt. Geoghegan was killed while trying to save one of his wounded men. By a twist of fate, their names are together on the wall of the Vietnam memorial (the man's name was Godboldt).This book is not for the weak of heart. It will make you cry. It will sometimes make you cheer. It is an important book. The story of these heroes in today's age of antiheroes, overpaid baseball players, and criminals allowed to continue to play college and professional sports, is inspiring. Even though Vietnam has been forgotten and is rapidly fading into memory, while WWII remains the number one best seller (I don't mind that, it deserves it, but American treatment of Vietnam and Korea has been disgraceful), there is an entire living generation of Americans (and some Brits and Aussies and others, including the North and South Vietnamese) who will never forget it until the day they die.A Note on the movie, We Were Soldiers, starring Mel Gibson: The movie was very good and I remember a bunch of us watched it together at Fr Benning as we waited to leave for Iraq, but please don't substitute the film for the book. The movie simply fails to capture the essence of the book. It also leaves out the battle at LZ Albany entirely. What really made the book powerful, and the movie failed at, was making these men real. Only when people are real to us can we truly appreciate what they did. That said, this is the only Vietnam movie that I have had a survivor of Ia Drang recommend as being an accurate portrayal of Vietnam. My friend made my wife promise to watch it, and she hates war movies. Perhaps he just wants people to know what he and his buddies went through before it is completely forgotten, or maybe he knows that most people just don't read books. I don't know; it is his business."}, {"userName": "Jim", "userReviewDate": "Jul 01, 2010", "userURL": "http://www.goodreads.com/user/show/275498-jim", "userReview": "Put on your helmet and web gear if you're going to read this epic. This is a real page-turner that pulls no punches. Nicely researched and written in the clear, no-nonsense language you would expect from a professional military man. Be alert, however: one can be confused by some of the anecdotal input - it's sometimes hard to tell where one soldier's comment ends and the next fellow's begins. All in all, a great read which blows the movie out of the water, and that's coming from someone who loved the movie."}, {"userName": "Jimmie Aaron Kepler", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/2536642-jimmie-aaron-kepler", "userReview": "I checked We Were Soldiers Once and Young by Gen Harold G. Moore and Joseph L. Galloway out of The Colony, Texas public library. There is a movie based on this book. I read the book first and was surprised when I saw the movie. They had left out the second battle. It was a battle that was just as bloody as the first, but without LTC Moore commanding. General Moore and Joseph Galloway have written a fine book. It should be must reading for every military officer and politician. I found this book to be consuming my attention. It was very hard to put down. The narrative of the training, deployment, battle, wives back at Fort Benning, battle, deaths and death notifications by cab drivers, and the stupidity of the leadership that lead to the second battles terrible losses. We Were Soldiers Once and Young is terrific book! I was in junior high school when the battle of Ia-Drang took place. I remember it vividly. My dad had returned months earlier from his first duty in Viet-Nam. I was living in a military family. I watched soldiers march to and from training daily from my school's playground. I can still vividly recall the CBS evening news story with Walter Cronkite discussing the impact of all the deaths on Fort Benning and Columbus, Georgia. I wish I had read this before I served as a US Army Infantry platoon leader. I have a cousin who graduated from high school with co-author Joseph L. Galloway in Refugio, Texas. Buy it, read it, and keep it in your library. Read in November 2005."}, {"userName": "An Odd1", "userReviewDate": "Apr 03, 2011", "userURL": "http://www.goodreads.com/user/show/4863716-an-odd1", "userReview": "Truth hurts. Too much for my soft civilian sensibilities who lost father, relatives and their homeland to air force and war. General Harold Moore and reporter Joseph Galloway start with 12 pages of Vietnam memorial soldier names. Ouch. Photos in the center show forever young KIA, some posed with 50s costumed large families. Appendix is 22 pg capsule biographies. Hundreds of American dropped into the HQ of thousands of enemy. Brave men sacrificed themselves and their parts for their comrades in arms and country. Bullet by bullet play by play. Closing pages added interviews with families who were left behind. The Prologue says movies get the war all wrong; the movie of the same name sent me to the book. I cannot say I liked a book I did not have the fortitude to finish. The record seems complete, especially when stories from the Vietnamese side contributed to research accuracy."}, {"userName": "Richard", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/1751300-richard", "userReview": "This is a must-read book for anyone interested in learning about the Vietnam War. It describes the first, crucial battle between land forces of the United States Army and North Vietnamese regulars (the NVA). It lasted over several days in November, 1965 and was noted for being ferocious. Hal Moore, a retired Lieutenant General, back then a Lieutenant Colonel who participated in the battle, collaborated with Joe Galloway, who was also present at the scene as a UPI correspondent. Moore and Galloway were diligent in their efforts to interview everyone possible among the veterans, on both sides; these included the commander of the North Vietnamese forces, Lt. Col. Nguyen Huu An, who also later attained the rank of Lt. General. They have produced a meticulous timeline of all of the events surrounding the battle but also have infused the book with a sense of the personal feeling of danger that everyone on the scene faced.Lt. Col. Moore was commander of a new kind of military unit in the mid-1960's, consisting of infantry trained to fight in the techniques of air assault. The Air Calvary was formed at Fort Benning, Georgia to utilize helicopters to transport soldiers to and from battlefields and protect them with other, heavily armed craft using machine guns, grenade launchers and rockets. Moore trained his unit, designated the 1st Battalion of the 7th Calvary. It, and its sister unit, the 2nd of the 7th deployed to Vietnam in mid-1965 after more than a year of training at Benning. One problem present on arrival overseas is that about a hundred well-trained soldiers didn't make the trip, since their terms of military service had expired. The Army, even at this relatively early date in the war, had relied heavily on two-year-obligated draftees and a lot of Moore's men had seen their two years expire before the unit went overseas. The resulting need to operate with depleted companies which the government wouldn't, or couldn't bring up to full strength was a factor which led to difficulties when the 7th found itself in combat.Any good history book about the war in 'Nam will give a useful account of the Battle of Ia Drang Valley, but none will exceed the intimacy of the factual portrayal offered by Moore and Galloway. They place the reader in the middle of things, and give you a feeling for the superhuman struggle which took place there. You can get a good sense of Moore's dedication to his personnel as well as of his sense of mission. He knew all of the people who served under him, at whatever rank. During the opening of this battle, which began with the insertion of personnel into what had been designated Landing Zone X-Ray (LZ X-Ray), Moore was on the first helicopter on the ground, and four days later, would be the last soldier to step on a helicopter and leave the scene. The Americans immediately ran into trouble as they started to insert soldiers into the Ia Drang Valley company by company by copter. What they didn't realize before the operation, which was intended to draw North Vietnamese out into open battle, was that they were inserting companies into the middle of the headquarters area of three NVA regiments. They quickly found themselves operating in chaos as the units on the ground ran into a buzzsaw of enemy bullets while the helicopters had to fly in and out under intense ground fire. There was no time to build defensive positions or even dig fox holes. The soldiers fought for their lives, making as small a target as possible while hugging the ground, particularly in the case of the platoon of Lt. Henry Herrick, which became cut off from the rest of its battalion and had to survive for several days while under constant attack. Moore put up a command post and had to direct his forces while under constant fire. Gradually, other companies of other battalions reinforced the 1st. Hard fighting eventually forced the withdrawal of the NVA. While Moore's forces were being removed from LZ X-Ray, another battalion marched overland to another LZ, Albany, when it was attacked. Again, the American forces found themselves under strong attack from the enemy, aggravated by the bad timing of the battalion to concentrate all of its leadership in one place exactly when the Vietnamese attacked the column. In what Moore calls \"the Valley of Death\" (p. xx), 234 of his young soldiers died in four days of fighting at LZ X-Ray and LZ Albany, which he points out as a higher casualty rate than either side suffered at the epic Battle of Gettysburg in 1863. These losses were in addition to seventy more who died in the Ia Drang in skirmishes occurring in a 34-day campaign which encompassed the X-Ray and Albany battles. Moore pays tribute also to the hundreds of deaths of soldiers in the 320th, 33rd and 66th Regiments of the People's Army of Vietnam (p. xxi).There was a wide disparity of North Vietnamese deaths at the Ia Drang compared to their American adversaries. A good part of this disparity can be attributed to the Americans' availability of helicopter gunships, artillery, and Air Force A-1 Skyraiders and B-52 bomb drops. Both sides claimed victory based on the damage they did to each other and the tenacity their soldiers displayed in their struggles. The Secretary of Defense, Robert McNamara and the JCS were encouraged by this action to ratchet up the war effort. Now, the commitment of even more thousands of American soldiers to Vietnam would be justified. And this is where Moore and Galloway got their motivation to eventually make the considerable effort to document what happened on a battlefield many years earlier, when they and their fellow soldiers \"were young and confident and patriotic and our countrymen knew little and cared less about our sacrifices\" (p. xviii). To the war machines of the adversarial countries, Ia Drang represented to Vietnam what the Spanish Civil War of the 1930's meant to World War II, namely, a testing ground of the newest weapons and tactics. To the soldiers who joined or were drafted into the Army, they were proud to serve their country as their fathers and older brothers had demonstrated in World War II and Korea. This \"Class of 1965\", however, found the country they thought they left to go to war had disappeared when they returned (pp. xix, xx). The war they had shed their blood for was increasingly hated, and they found themselves hated by association. They would, by and large, build and live their civilian lives in the shadow of past events that were largely forgotten in the national consciousness but would, over time, regain and share their pride in their service to their country with each other. Toward that objective, the authors have produced a testament to the past lives of the soldiers they knew in the Central Highlands of South Vietnam."}, {"userName": "Gerry", "userReviewDate": "Dec 20, 2012", "userURL": "http://www.goodreads.com/user/show/15162550-gerry", "userReview": "Early on within this book with self descriptions of achievements since this battle was a little “drab” to me; boring in that I wanted to proceed further to the battle itself. As is normally the case this actually sort of set the tone for everything real. As I kept reading I began to become impressed with several points of interest. First, General Moore was not the arrogant person I thought he would turn out to be, and second – the journalist (Joseph L. Galloway) that tagged in an embedded sense was not of the mold of his “anti-war, anti soldier, anti establishment” generation became. This includes authors such as David Halberstam and Neil Sheehan of the time frame; their tone changed over the years but the early works of these two was much different from the experience of the American Marine and Soldier in Vietnam. General Westmoreland lent his name to the conspiracy theorists that came to rise during this time frame by not allowing any service member to discuss the neutrality of Cambodia and how the North Vietnamese would use this to their advantage – LBJ is the sole person responsible in this sense as well as he himself directed the bombing raids and targets from the Whitehouse and tied the hands of every single field commander in Vietnam. These authors hold no punches back but they by no means acknowledge the counter culture of the 1960s either as anything more than a beating on Military Service Members who served either because they wanted to or because they were forced to do so. For people that have read anything on Vietnam of significance will find this book simply fascinating for the detail and true to count historical facts. If you have ever read anything by Dr. Bernard B. Fall then this book is for you. His works are referenced no less than 3 times within the various pages and there is even a chapter entitled “Hell In A Very Small Place”. Not long after arriving “in country” to Vietnam Lt. Col. Moore and his Sgt.Maj. walked the battlefield off Route 19 (The Battle of Mang Yang Pass aka Battle of An Khe) about 10 miles to the west of An Khe where the Viet Minh had ambushed French Group Mobile 100 (Groupement Mobile No. 100) this battle along with Battle of Dien Bien Phu destroyed the French Forces but not the will power of the French Foreign Legion (Légion étrangère). Point here is that Lt. Col. Moore and Sgt.Maj. Plumley took nothing for granted early on and the Colonel himself knew as he walked this battle site that “Death is the price you pay for underestimating this tenacious enemy”. He came to realize and state this to himself as he was looking at web gear, bone fragments, empty casings and other such macabre reminders of the battle fought on that ground 11 years previously.I was touched when Joe Galloway (having survived Landing Zone X-Ray battle) would be recuperating with rest as he compiled his account of the events. During this time he learns of the death of one Dickey Chapelle, a friend of his and a friend to all U.S. Marines from Iwo Jima, to Okinawa, to the Korean Peninsula and beyond. The details of her death weren’t covered in this book and I sensed that as Joe Galloway is the co-author he didn’t want to expand on personal feelings in this regard. I was happy she earned an honorary mention in this book. The survival of Spec. 4 James Young and Toby Braveboy is nothing short of a miracle. Many sad stories along the way of some you hope will make it out but don’t.Lastly, General Kinnard states later that “…when General Giap says he learned how to fight Americans and our helicopters at the Ia Drang that’s bullshit! What he learned is that we were not going to be allowed to chase him across a mythical line in the dirt. From that point on he was grinning. From this point on he can bring us to battle when he wants and where he wants, and where’s that? Always within a few miles of the border, where his supply lines were the shortest, where the preponderance of forces is his, where he has scouted the terrain intensely and knows it better than we do.” I for one accept this as face value – not discounting of course the Jane Fonda types and their effect as well in all this; the only sufferers were the men in ranks between Colonel and Private. Slap in the face and tied arms from Washington, slap in the face and spat upon by their own hippy age groups. Proud to be a part of the counter culture today; much different from 1965 mind you."}, {"userName": "Jim", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/9616369-jim", "userReview": "This is an amazing book, fascinating and disturbing at the same time. There is probably nothing I can add to the hundreds of reviews of this book. However, I'd just like to say what lessons I took from it. First of all, at the risk of hyperbole, I must say that I wish every American would read this book. In it you will learn about the bravery of the American service person, and the real cost of war. It is a story that transcends the conflict in Vietnam and is very applicable to our modern military adventures, where the burden of war is carried by only a small percentage of our citizens. The first half of the book describes the formation what would become the 1/7 Cavalry, part of the first air mobile division (1st Cavalry Division) and its deployment to Vietnam. The 1/7th is commanded by the co-author, Hal Moore. Moore's battalion is sent into LZ X-ray and survives a battle against what would have been overwhelming odds if it were not for massive American artillery and close air support despite the expert leadership of the officers and NCOs in the battalion from Moore down and the undisputed bravery of each individual soldier. This is significant as the first major engagement between American air mobile forces and the North Vietnamese Army.The second half of the book, however, did not get portrayed artistically in the Mel Gibson movie. It tells the story of Moore's sister battalion, the 2/7th Cavalry, that was marching toward LZ Albany to be extracted after reinforcing the 1/7th at X-ray. While approaching the LZ, unprepared for meeting the enemy again, the battalion was attacked by three battalions of NVA soldiers. The chain of command was not able to bring artillery and air support their rescue in this engagement for several hours. The results were devastating. Both fights constitute the Battle of the Ia Drang, not just the part stylized in the movie.The most moving part of the book is revealed in the closing chapters. The story of two widows and two daughters bring to light how the sacrifices of soldiers not only take the lives of amazingly talented soldiers, but also dramatically affects the lives of their loved ones at home, who continue to pay the price. Reading about the aftermath and the effect on the veterans and their family members is a very emotional experience. However, even more amazing and anger inducing is the way the battle was treated by the leadership of the country. The upper management of the Army and the government refuses any lessons to be learned from this battle, and the country continued on a path that was already decided upon before the 1st Cavalry Division even arrived in Vietnam.I wish I could give this book more than five stars. If you enjoyed the movie, then please read this book and get the whole story."}, {"userName": "PennsyLady (Bev)", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/12364449-pennsylady-bev", "userReview": "We Were Soldiers Once And Young: Ia Drang - The Battle That Changed The War In Vietnam\"We went to war because our country asked us to go,because our new President, Lyndon B. Johnson, ordered us to go,but more importantly because we saw it as our duty to go.\"n November 1965, some 450 men of the 1st Battalion, 7th Cavalry, under the command of Lt. Col. Hal Moore, were dropped by helicopter into l clearing in the Ia Drang Valley.They were immediately surrounded by 2,000 North Vietnamese soldiers.A few miles away, a sister battalion was chopped to pieces.The conflict at the landing zones of X Ray and Albany are viewed as significant, savage and one of the most violent battles in American history.Lt Col Moore has promised his soldiers and their families\"I will leave no man behind...dead or alive. We will all come home together\"Detailed...realistic...valor... courage...and so much more as the brotherhood of soldiers persevered and sacrificedChronicled by retired lieutenant general Hal Moore and Joseph Galloway, the only journalist on the ground throughout the fighting.\"A picture of men facing the ultimate challenge, dealing with it in ways they would have found unimaginable only a few hours earlier\"(1992)5* for excellenceThe drama and impact of this military event far exceed any words I can lay on paper."}, {"userName": "Tony Taylor", "userReviewDate": "Jan 21, 2010", "userURL": "http://www.goodreads.com/user/show/2566274-tony-taylor", "userReview": "Each year, the Commandant of the U.S. Marine Corps selects one book that he believes is both relevant and timeless for reading by all Marines. The Commandant's choice for 1993 was We Were Soldiers Once . . . and Young. In November 1965, some 450 men of the 1st Battalion, 7th Cavalry, under the command of Lt. Col. Hal Moore, were dropped by helicopter into a small clearing in the Ia Drang Valley. They were immediately surrounded by 2,000 North Vietnamese soldiers. Three days later, only two and a half miles away, a sister battalion was chopped to pieces. Together, these actions at the landing zones X-Ray and Albany constituted one of the most savage and significant battles of the Vietnam War. How these men persevered--sacrificed themselves for their comrades and never gave up--makes a vivid portrait of war at its most inspiring and devastating. General Moore and Joseph Galloway, the only journalist on the ground throughout the fighting, have interviewed hundreds of men who fought there, including the North Vietnamese commanders. This devastating account rises above the specific ordeal it chronicles to present a picture of men facing the ultimate challenge, dealing with it in ways they would have found unimaginable only a few hours earlier. It reveals to us, as rarely before, man's most heroic and horrendous endeavor."}, {"userName": "Jeff Dawson", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/5163904-jeff-dawson", "userReview": "There isn’t a lot I can add to what other reviewers have said. This is a great story of courage under fire and how Johnson and McNamara’s handling of the war was horrendous. No definitive goal was established on how to fight and win the war. We can’t go into Cambodia or Laos and hit the enemy where he’s staging. To win, you must go to where the enemy is hiding. Think of when Osama Bin Laden was hiding in the Bora Bora mountains. He was trapped, but do to political maneuvering, the Pakistan government allowed him to escape and then take up refuge for a decade. The real question, as was also pointed out in a recent documentary, was why in the hell did the troops march out in enemy territory instead of being transported out with the rest of the battalions? Politics aside, this an excellent addition for anyone interested in the Vietnam WarFive Stars"}, {"userName": "Barnabas Piper", "userReviewDate": "Oct 23, 2011", "userURL": "http://www.goodreads.com/user/show/6330303-barnabas-piper", "userReview": "Incredible account of the chaos of the battle for the Ia Drang Valley in Vietnam - it was hard to follow because of all the moving pieces. But that reflected the battle well, I think. Reading it gives a glimpse of the difficulty and futility of so much of what happened in Vietnam."}, {"userName": "Michael Burnam-Fink", "userReviewDate": "May 07, 2014", "userURL": "http://www.goodreads.com/user/show/4828849-michael-burnam-fink", "userReview": "War is awesome and terrible, and so is We Were Soldier's Once... and Young. One of the blurbs calls this book a monument to the men of the 1/7th Cavalry, and I can think of no better way to describe this book. Opening with a sepia toned reminiscence of the development of Air Mobile tactics and helicopter warfare, the story moves soon enough to Vietnam, where the proud soldiers of the air cavalry would face their greatest test. Intelligence suggested Viet Cong forces in the Ia Drang valley, but nothing could have prepared the 1/7 for landing almost on top of an North Vietnamese Army base area and 2000 soldiers. For a fraught 24 hours, Colonel Moore brought in more troops, called down a withering cordon of fire support, staved off a crushing dawn offensive, and rescued the 'lost platoon' which had become separated in the opening moments of the battle. The second half focuses on the battle of LZ Albany, and the terrible mauling that the 2/7 Cav took leaving the area the following day.Colonel Moore is a born leader, and this book provides a close up portrait of the kind of selfless dedication and love that men in combat deserve. But while Moore's voice is dominant, he is not alone. Oral histories from hundreds of Ia Drang veterans, including the Vietnamese commanders, rounds out the story of this desperate combat.I've often said that Vietnam was fractally fucked up, and Ia Drang is a perfect example of that. In the 34 day campaign the Cavalry inflicted a 10:1 kill ratio on the NVA. However, Ia Drang remained Indian Country and the most of the NVA units involved in the battle survived to escape into Cambodia. A well-led American unit with sufficient fire support was essentially invincible in defense, but even a momentary lapse in focus could prove fatal, such as what happened to the 2/7 at Albany. While both sides had the capacity to regenerate their units, in many ways the finely-tuned high morale 7th Cavalry that went into Vietnam could not be sustained by draftees from an increasingly anti-War America. In a microcosm of the whole disaster, hundreds of death notifications were delivered by taxi drivers and Western Union messengers because the Army hadn't realized that families would find the experience traumatic.This book begins with a list of every American killed during the battle, and that is the ultimate tragedy of war, one repeated throughout the book. [Name] from [Home town] died [in some terrible way]. To compress a life into that brief sentence; to compress hundreds and thousands of lives into that sentence. Never start a war."}, {"userName": "Jimmy", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/3357765-jimmy", "userReview": "This book tells the story of the battles in the Ia Drang valley. The word Ia means river. It was a turning point in the war because American troops became more involved in the fighting. It would lead to a massive increase in troops by President Johnson. There was a French plantation nearby where young girls in bikinis relaxed. The owner paid the Viet Cong protection money and the Saigon government taxes to live like this. Then they charged the US government for any damage to rubber tree damage. How fucked up is all that. Sometimes North Vietnamese soldiers would stand up and laugh. They would just be mowed down. The author never offers a theory as to why they would do this. My guess from what I know is that they were drugged up and no sense of what was happening. I despise napalm. I can't help but think of all the millionaires who got rich inventing and selling such an absolute abomination. Two soldiers--Nakayama and Clark--were hit accidentally. Nakayama was completely black and would die later on. Their hair and clothes burned off. Their skin blistered. One man grabs the boots and they crumbled and the flesh came off. They were taken away screaming at the top of their lungs. The day Nakayama died, his wife had a baby. But they had to order the napalm strikes to keep coming in. Americans soldiers will cheer when they see the napalm strikes on the enemy soldiers. The worst phrase I ever heard in Vietnam was \"hand-to-hand combat.\" I can't imagine what that must have been like. The most savage one-day battle of the Vietnam War occurred here. When the battle ended 155 Americans would be dead and 124 wounded. NVA soldiers were spotted wondering around in the elephant grass killing wounded American soldiers. The author contrasts that with how Americans took prisoners. I was impressed by the bravery of the helicopter pilots who went in to gunfire to pick up the wounded. Some great quotes in the book: 1. \"Dulce bellum inexpertis.\" Or \"War is delightful to those who have no experience of it.\"--Erasmus2. \"War is fear cloaked in courage.\"--General William Westmoreland3. \"There is many a boy here today who looks at war as all glory, but, boys, it is all hell.\"--General William Tecumseh Sherman4. \"I did not mean to be killed today.\"--dying words of the Vicomte de Turenne, 16755. \"One cannot answer for his courage when he has never been in danger.\"--Frqncois de la Rouchefoucald6. \"In war, truth is the first casualty.\"--Aeschylus7. \"Only the dead have seen the end of war.\"--Plato"}, {"userName": "Gavin", "userReviewDate": "Sep 14, 2007", "userURL": "http://www.goodreads.com/user/show/363531-gavin", "userReview": "This battle was the US's first encounter with the regular North Vietnamese Army. (The allies were fighting two forces in South Vietnam: the invading NVA and the irregular Viet Cong. We never invaded North Vietnam, which I think is the main reason we lost the war.) The analysis of the battle led to our standard, Westmoreland-crafted strategic approach to the war: find the enemy; insert troops by helicopter in the middle of a shitty situation surrounded by the enemy; fix them with small arms fire; and then blast their flip-flops off with overwhelming artillery and air power. The US lost ~ 60,000 KIA; the Vietnamese lost millions (how do we know this number if they removed their dead?) and is still suffering from that demographic slaughter, but they won because this strategy didn't work. The author was the Colonel in charge of his diminished battalion which triumphed over 2 or 3 NVA regiments (a company has ~ 150 men; a battalion consists of 3-4 companies; a regiment consists of ~ 3 battalions). His battalion was inserted in a bowl-like depression surrounded by mountains (Dien Bien Phu anyone?) where the enemy was encamped. The author masterfully directed the placement of his three-ish companies in a horseshoe pattern that kept the enemy from overwhelming their helicopter dropzone. On the last day, the enemy attacked through the thinly guarded opening in the horseshoe, but they failed once the author called out the code \"Broken Arrow\" over the radio. This meant that an American unit was being overrun and that ALL air power in the area was to be devoted to its defense. The movie made from the book shows how powerful this air attack must have looked. After the enemy assault was blown or napalmed to crispy bits, the Americans counterattacked and won the area, for a day. Not shown in the movie was what happened the next day. The replacement forces brought in and led by a different leader left the area (another stupid thing about Vietnam: we were not interested in holding land the men died for) and marched to a different helicopter drop zone. While they were spread out in a marching column, the one remaining, fresh NVA regiment in the area overwhelmed them and killed a large number of Americans.This book is great because the story is exciting and the battle can serve as a model of the whole war."}, {"userName": "Daniel", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/3148536-daniel", "userReview": "I wanted to read a book to commemorate Memorial Day here in the U.S. I chose this book, as it was the first true battle that was fought in the Vietnam War. My Uncle was in this conflict and he never would speak about it at all. Of course no one in the family ever pressured him about this as he was left deeply traumatized over the experience and all that my mother ever said he remarked on was his loss of good friends.This book was good and is a true tale of both sides. It is a newly built force that lands to fight the indigenous army in Vietnam, and they were in for it. The indigenous forces were brought up on a lineage of defeating larger forces with guerilla tactics, subterfuge and intelligence. What this means is that this was and would not be a decisive battle, but a bloody and desperate conflict that got a much larger event started.The author is excellent in giving information, historical pieces to research about this battle, and good profiles of the men who fought, and the families left behind. This book made me want to know more and delve into the history behind this battle.This Memorial Day means a lot to me, as I have many family members who served. Losing my father last year, an Army vet brings it even closer. I have very close friends who are also vets and I am proud to know them. War and Conflict on the battlefield are not for the squeamish and certainly are controversial, but one thing has to be said. The bravery it takes to serve your country and protect it, in times of war or not is an amazing thing and I for one am proud to know those and all those I don't know, and thank them for their service.Read this book if you want to have a great historical experience by an amazing author.Danny"}, {"userName": "Ctgt", "userReviewDate": "Jul 05, 2010", "userURL": "http://www.goodreads.com/user/show/3787451-ctgt", "userReview": "I never served in the armed forces, so I find it troublesome to comment on actions taken by those in the field. I have read many of these types of books from the American Revolution to the wars in Iraq and Afghanistan and find myself wondering how I might have responded in the situations many of these soldiers found themselves. Of course it's impossible to know, but when I read of the sacrifice and courage many of these ordinary citizens displayed, I only hope I might have done the same.There is the underlying theme of politicians running the show instead of commanders in the field. Between the decision not to extend tours of duty (by the time someone was experienced, they were shipping back home, with new recruits having to learn the hard way) and limiting forays into Cambodia to follow retreating or rearming North Vietnamese forces, it's the the same old story of politics getting in the way of battlefield tactics.Lt. Col. Harold Moore seems to be the quintessential battlefield commander, who along with Sergeant Major Plumley and huey pilot Bruce Crandall joined the long line of individuals who stood tall when called.I love this quote from Robert Carrara, battle field surgeon for the !st Battalion, 7th Cav\" I don't dwell on Vietnam, but now and then I hear something or smell something and flash back to those days. I have one very vivid memory of the second morning in X-ray. We were crawling around under intense machine-gun fire when Sergeant Major Plumley walked up, pulled his .45 caliber pistol, chambered a round, and said: 'Gentlemen, prepare to defend yourselves.' You never forget a thing like that.\"I remember that line from the movie and thought at the time that must have been written for the script. Obviously not."}, {"userName": "S.", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/15659828-s", "userReview": "falling short of absolute excellent, \"We Were Soldiers Once...\" is still a great war book. the primary criticism made about the work is that it covers only the initial insertion and first half of the battle, whereas most of the casualties suffered by the US unit took place over the next few days as the force withdrew. so in a sense, the author can be accused of doing a whitewash, covering only the glorious \"search for the lost platoon\" and the dramatic impact of the first ever helicopter insertion, while forgetting the human cost during the retreat.if an author does choose to make this choice, however, the resulting work is far more \"impact for word count.\" only reads more, because the facts are more compelling. falling short of the absolute epic quality of some of the really famous war books, We Were Soldiers Once comes pretty close to being on that level, and deserves a solid 4/5.http://en.wikipedia.org/wiki/Battle_o...even the wikipedia page is continued to be under dispute.apparently casualties were 5:1 against the Vietnamese even including LZ Albany. however, the Americans left and the Vietnamese retained the territory. I would rather have been an American than a Vietnamese in the battle if I had to be one or the other, but the American victories in the war ultimately resulted in nothing gained for the American side.does this summarize the war?"}, {"userName": "Rob", "userReviewDate": "Mar 15, 2015", "userURL": "http://www.goodreads.com/user/show/4189009-rob", "userReview": "I never read a book about the Vietnam War before. But I don't think I could've found a better book to start. This is an amazing retelling of two of first large engagements of the American involvement in Vietnam. The descriptions of the battle and the first hand accounts do a great job of dropping you into the middle of these fights and detailing the desperate struggle these men were in. Using the maps in the book and visiting the We Were Soldiers webpage helps by keeping you aware of the tactical deployment of the units involved and pictures of the actual battlefields at LZ X-ray and LZ Albany bThe flow of the book is great and it keeps you turning the pages. You become attached to the men that were there and feel the sorrow and the joy of them living or dying or being wounded. The last few chapters tell of how the survivors or the families of those that were KIA were affected after the war and they are very emotional. It is a sin that these men and the ones that served in Vietnam after them were never given or shown the respect that was owed to them by the country that sent them to war. Thankfully his book was written to pass on to us the story of these men and the sacrifices they made for their country and countrymen."}, {"userName": "Tom", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/1848870-tom", "userReview": "This is a detailed account by a battlefield commander of a critical battle in Vietnam’s Ia Drang valley. It was the first use of the concept of air cavalry…ground troops brought to the battlefield by helicopters and provided close air and artillery support. It is definitely not from the point of view of the ordinary soldier. Many of the Americans killed were draftees within weeks or months of finishing their tour of duty and, though this is mentioned in passing, it is subsumed by descriptions of the movements of platoons and positioning them in the geography of the battle.In the end, though I doubt this was the intention, it left me with the feeling that the Vietnam debacle was viewed by some in the military as a great opportunity to try out some new ideas. The cost in lives is hard to reconcile against what seemed to be a bit of adventurism."}, {"userName": "Leo", "userReviewDate": "Nov 21, 2009", "userURL": "http://www.goodreads.com/user/show/1693200-leo", "userReview": "Lt.Col Hal Moore was a veteran of the Korean conflict. He was given a command of a batallion. Most of the officers were young and inexpierienced. He trained them as if they were going to be paratropers. He trained them for cambat. He had the 7th Calvary and went into cambat in Vietnam.The 7th was Custers and he got masacred. Moore new that and he studied his enemy well. When they went into combat the 7th aircab(Heuy helicopters) ferried them in. The enemy was waiting and launched their attack. Hal used several tactics to outsmart the enemy and he held his ground. Casualties, yes we had lots of them but by beating the enemy here the top brass at the Pentagon and Whitehouse thought we could come out witha a win. BIG MISTAKE End result, we lost.To Sgt. Carlos Augusto Perez, died in Pleiku December 1 1967.Que descanses en paz!"}, {"userName": "Steven", "userReviewDate": "Dec 22, 2012", "userURL": "http://www.goodreads.com/user/show/15614137-steven", "userReview": "As a Vietnam veteran this book struck me really hard. Though I was in a different type of combat mission, I could feel the fear and anxiety of the soldiers that went through these battles. If you are the type of person that doesn't like violence even in military type novels, then don't read this book. However, if you are seeking to understand you Vietnam veteran spouse or family member that was in the infantry this may shed some light on why we don't talk to you about our experiences - you will never understand the pain that many felt. This is not a book for the weak hearted. The book also tells of the hazards of trying to run a war from behind the lines or without listening to the front line troops - people get killed or wounded. Am I bitter, not in the slightest. I very much enjoyed the book even though at times it brought back memories. Well written as well."}], "description": "Each year, the Commandant of the U.S. Marine Corps selects one book that he believes is both relevant and timeless for reading by all Marines. The Commandant's choice for 1993 was We Were Soldiers Once . . . and Young. In November 1965, some 450 men of the 1st Battalion, 7th Cavalry, under the command of Lt. Col. Hal Moore, were dropped by helicopter into a small clearing in the Ia Drang Valley. They were immediately surrounded by 2,000 North Vietnamese soldiers. Three days later, only two and a half miles away, a sister battalion was chopped to pieces. Together, these actions at the landing zones X-Ray and Albany constituted one of the most savage and significant battles of the Vietnam War. How these men persevered--sacrificed themselves for their comrades and never gave up--makes a vivid portrait of war at its most inspiring and devastating. General Moore and Joseph Galloway, the only journalist on the ground throughout the fighting, have interviewed hundreds of men who fought there, including the North Vietnamese commanders. This devastating account rises above the specific ordeal it chronicles to present a picture of men facing the ultimate challenge, dealing with it in ways they would have found unimaginable only a few hours earlier. It reveals to us, as rarely before, man's most heroic and horrendous endeavor.", "title": "We Were Soldiers Once...and Young: Ia Drang--The Battle That Changed the War in Vietnam\n      \n          (We Soldiers #1)", "url": "http://www.goodreads.com/book/show/775534.We_Were_Soldiers_Once_and_Young", "average": 4.3, "cover": "https://images.gr-assets.com/books/1347580134l/775534.jpg", "reviews": 528, "authors": [{"url": "https://www.goodreads.com/author/show/23897.Harold_G_Moore", "name": "Harold G. Moore"}, {"url": "https://www.goodreads.com/author/show/23898.Joseph_L_Galloway", "name": "Joseph L. Galloway"}], "type": ["History", "Nonfiction", "War", "War", "Military"], "outlinks": ["http://www.goodreads.com/book/show/775534.We_Were_Soldiers_Once_and_Young", "http://www.goodreads.com/book/show/42512.We_Were_Soldiers_Once_and_Young", "http://www.goodreads.com/book/show/42513.We_Were_Soldiers_Once_and_Young", "http://www.goodreads.com/book/show/16172762-we-were-soldiers-once-and-young", "http://www.goodreads.com/book/show/642863.We_Were_Soldiers_Once_and_Young", "http://www.goodreads.com/book/show/1900888.We_Are_Soldiers_Still", "http://www.goodreads.com/book/show/35582919-hal-moore-on-leadership", "http://www.goodreads.com/book/show/2429234.A_General_s_Spiritual_Journey", "http://www.goodreads.com/book/show/6399785-a-tender-warrior-leadership-letters-to-america", "http://www.goodreads.com/book/show/35383857-vietnam-per-sempre"]}