{"ratings": 211, "userreviews": [{"userName": "Nikki ", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "Another book of philosophical puzzles -- a lot of which I was familiar with, somehow, from doing Religious Studies at GCSE and A Level... It includes stuff like the Ontological Argument, anyway. Like the other book I've read by Peter Cave, it's interesting and presents difficult puzzles quite flippantly. It cross-references the puzzles, so if you're interested in a particular line of thought, you can follow it right through the book."}, {"userName": "LKM", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/1533779-lkm", "userReview": "Was it me or were most of those puzzles neither puzzling nor perplexing? Maybe I'm just not cut out for philosophy... Anyway, it wasn't a bad book, and the writing style was in between annoying me and trying to be funny (and sort of not managing, thus falling back on 'annoying me')."}, {"userName": "Helen Yang", "userReviewDate": "Aug 11, 2013", "userURL": "http://www.goodreads.com/user/show/23027044-helen-yang", "userReview": "Not that well-written or profound."}, {"userName": "Chris Moorhead", "userReviewDate": "Apr 07, 2013", "userURL": "http://www.goodreads.com/user/show/5731179-chris-moorhead", "userReview": "Some interesting bits, but wasn't altogether blown away."}, {"userName": "Solor", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/5957925-solor", "userReview": "Doc Cave manages to make those paradoxes even more puzzling than they actually are. I really couldn't follow most of his reasoning. I found Paradoxes from A to Z by Michael Clark a far superior insightful reading."}, {"userName": "Martin", "userReviewDate": "May 23, 2012", "userURL": "http://www.goodreads.com/user/show/1266160-martin", "userReview": "Interesting ideas, however I did not enjoy the way the book was written."}, {"userName": "Jay Sejpal", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/40371779-jay-sejpal", "userReview": "some of the philosophical concepts are good and thought provoking however writing style of author makes it very difficult to understand the concept for the people who are naive to philosophy."}, {"userName": "Chloe Crammond", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/17688318-chloe-crammond", "userReview": "The setup of this book is: ' You think A don't you? Well what if you though B instead?!' - the issue being that in most cases I didn't think A to start with, so there was never a 'puzzle' moment or a shock at seeing the world in a new light. I hated how the author tried to be funny, pages were wasted whilst he wrote 'witty' metaphors that often fell flat. I think it suffers from trying to make philosophy palatable for the masses - which it fails miserably at anyway. Either philosophy isn't for me, or this is a terrible example of what it out there."}, {"userName": "Himanshu Karmacharya", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/64966022-himanshu-karmacharya", "userReview": "Interesting title but no so interesting contents. There are many interesting ideas in the book but there are generally more questions than answers and some unnecessary paradoxes as well which are very convoluted."}, {"userName": "Rob", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/41538467-rob", "userReview": "Very poorly written - like someone took a bunch of chain letters, stapled them together, scrawled a few comments, and called it a book."}, {"userName": "Nour Sharif", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/10380469-nour-sharif", "userReview": "The book started really well, then it crashed downhill. The author is pretty hilarious. I enjoyed his writing style very much. The book speaks about  paradoxes  so it is fair to assume that the writer will speak from every possible angle, right? Well that was not the case. I felt that a lot of things have been left out. At the beginning, it was not as palpable as much as it was as I was reading further into it, but it reached a point where I could not ignore it anymore. Maybe the author did that on purpose, who knows? But I think since the book speaks about paradoxes that these points should not be left out. Another point is that he fails at comparing. He compares things together that... well cannot be compared together. Are you an idiot or what? Oh, and the author usually presents every chapter and paradox with an argument, and some of these arguments are very very poor. And in some points, I felt that the author failed at being objective. You are talking about PARADOXES, so when explaining the two points of view, you should NOT look biased, right? Well, his opinion generally matched mine, but that does NOT mean that I will ignore this point. the book then started boring me out except the last chapter which was really good. And I think the end was a really good end. Have a look:   When the mountain flowers are blooming,Their scent carries their meaning"}, {"userName": "Петър Стойков", "userReviewDate": "Jan 26, 2015", "userURL": "http://www.goodreads.com/user/show/2499456", "userReview": "Въпреки интересното си заглавие, въпреки ясно заявената неприязън на автора към постмодернизма във философията и въпреки моя нестихващ апетит към популярна философия, налага се да кажа, че това четиво не предлага нищо смислено и зслужаващо прочитане. Подходът към 33-те философски пъзела е плитък и елементарен."}, {"userName": "Sean Goh", "userReviewDate": "Mar 05, 2014", "userURL": "http://www.goodreads.com/user/show/17187084-sean-goh", "userReview": "We often engage in activities, seeking achievements - reaching the mountain top, discovering how the story ends, satisfying yearnings of passion - yet we also resist reaching the ends, for having achieved them, there is the anti-climax, the sadness, the emptiness. There's a charm in not saying or thinking, and merely experiencing.I probably would have enjoyed KI."}, {"userName": "BridgetT", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/7558458-bridgett", "userReview": "me thinks one really need to be in the mood to read this one. might enjoy it if i had a bit more time to ponder the dilemmas. i'll keep coming back to it. food for thought."}, {"userName": "Christopher", "userReviewDate": "Aug 17, 2013", "userURL": "http://www.goodreads.com/user/show/1579132-christopher", "userReview": "enjoyable little read. each chapter is about 6 pages long. some were quite provoking, others were only puzzles because the assumptions were odd."}, {"userName": "Douglas Graney", "userReviewDate": "Apr 14, 2009", "userURL": "http://www.goodreads.com/user/show/1443257-douglas-graney", "userReview": "Fun read. Some useful essays for my Philosophy class."}, {"userName": "Bülent Duagi", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/8947412-b-lent-duagi", "userReview": "So many puzzles, lots of food for thought. Didn't enjoy the writing style though."}, {"userName": "Carmen", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/4053708-carmen", "userReview": "Two interesting chapters. The rest is verbal diarrhea."}, {"userName": "Kent", "userReviewDate": "Dec 22, 2012", "userURL": "http://www.goodreads.com/user/show/15381286-kent", "userReview": "Covered too much ground in too little space. I used it for a bathroom book, which was ideal since I got it a chapter at a time, in small doses."}, {"userName": "Harley Rose", "userReviewDate": "Jun 30, 2014", "userURL": "http://www.goodreads.com/user/show/4090642-harley-rose", "userReview": "It got me thinking a little bit, but not on anything I haven't already spent time thinking on. Also, I've heard many of these topics discussed in a more interesting way. It was okay, though."}, {"userName": "Lee Belbin", "userReviewDate": "Nov 30, 2014", "userURL": "http://www.goodreads.com/user/show/32005999-lee-belbin", "userReview": "A series of philosophical scenarios along the lines of \"Have you stopped beating your wife?\". Thought provoking at times. A fair read for those inclined."}, {"userName": "Erkekjetter Palmer", "userReviewDate": "Feb 08, 2009", "userURL": "http://www.goodreads.com/user/show/2009002-erkekjetter-palmer", "userReview": "Funny and perplexing. Split into small 'puzzles' so it's easy to pick up and read when you have a 'mo."}, {"userName": "Matt", "userReviewDate": "Jul 17, 2015", "userURL": "http://www.goodreads.com/user/show/32546132-matt", "userReview": "Good intro to philosophy reading. Fortunately the chapters are short and succinct, so if you don't like a chapter then an enjoyable one might only be a couple of page turns away."}, {"userName": "Jenny", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5900460-jenny", "userReview": "I have no patience for working through the nuts and bolts of philosophical puzzles, so I read this book very fast. Not as interesting as the title."}, {"userName": "Neowuf", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/21334691-neowuf", "userReview": "This book is great for philosophers, not as deep, not a introduction, but something like a conversation I would love to have in a bar with a friend philosopher."}, {"userName": "Elizabeth", "userReviewDate": "Mar 09, 2011", "userURL": "http://www.goodreads.com/user/show/5080480-elizabeth", "userReview": "Not really that exciting, but pretty comical and thought provoking."}], "description": "With the aid of tall stories, jokes, common sense and bizarre insights, Cave engages the reader in a romp through the best bits of philosophical thought. Tackling some of life’s most important questions, his brilliant puzzles that will keep you pondering throughout the night. From encounters with bears (ethical dilemmas) to talking turkeys (the problem of induction), Cave storms through philosophy’s classic conundrums with rapier wit and wisdom. Illustrated with quirky cartoons throughout, What's Wrong With Eating People? leaves no stone unturned, covering a smorgasbord of topics including logic, ethics, art and politics. It is a great stocking-filler for anyone, of any age, who loves a mental workout!", "title": "What's Wrong With Eating People?: 33 More Perplexing Philosophy Puzzles", "url": "https://www.goodreads.com/book/show/5894317-what-s-wrong-with-eating-people", "average": 2.98, "cover": "https://images.gr-assets.com/books/1348475151l/5894317.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/7423324.Peter_Cave", "name": "Peter Cave"}], "type": ["Philosophy", "Nonfiction", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/5894317-what-s-wrong-with-eating-people", "http://www.goodreads.com/book/show/1841642.Can_a_Robot_be_Human_", "http://www.goodreads.com/book/show/9311398-do-llamas-fall-in-love", "http://www.goodreads.com/book/show/6580631-humanism", "http://www.goodreads.com/book/show/6729012-this-sentence-is-false", "http://www.goodreads.com/book/show/10393471-how-to-think-like-a-bat-and-34-other-really-interesting-uses-of-philosop"]}