{"ratings": 3967, "userreviews": [{"userName": "Lawyer", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "I am of the age where I could very well have been a veteran of the Vietnam War. Or, I could have died there. But I was spared that, first by student deferments and then the timeliness of the Paris Peace Talks. However, I know and have known many men who fought there. On the surface, they seem fine. Their silence about their experiences is uniform. Yet, I know one man who cannot stand to be touched. He has an exaggerated startle response at the slightest contact. And a good lady friend had a lengthy relationship with another veteran of that war. That ended after too many nights shattered by his night terrors and, on more than one occasion his choking her, believing he was engaged in hand to hand combat.My Uncle celebrated his 21st birthday at Hickham Field on December 7, 1941. During his lifetime he never spoke of that morning. Island hopping across the Pacific, his only story regarding New Guinea was having been in the same unit as Mario Lanza. He didn't like him. Crude, vulgar, he described him.But if you want to know what it is like to go to war, Karl Marlantes will tell you. He leaves no doubt as to what it is like.The briefest biography of Karl Marlantes immediately informs the reader his books will not be ordinary fare. A National Merit Scholar, Marlantes attended Yale University. He attended Oxford as a Rhodes Scholar, interrupted by his service in Vietnam as a young Lieutenant. There he was awarded the Bronze Star, the Navy Cross, and twelve Air Medals. Marlantes earned the right to be called a warrior and to educate those who have never been to war what it means to be one.Marlantes battled thirty years to achieve publication of his novel \"Matterhorn\" in 2010. Now, Marlantes has followed up his novel with a memoir on his experiences in Vietnam and his opinions on how young men sent into war are done so without the necessary education to understand what they will experience and without the appropriate services necessary to reintegrate them into civilian life.\"What it is Like to Go to War\" is a hard hitting portrait of the experience of war and its effect on the human psyche. When an author of Marlantes' stature rubs elbows with Joseph Campbell and Robert Bly, the end result is an eloquent, articulate, and psychologically astute punch to the gut.Generations ago, young men were sent to war by old men who had forgotten what it was like. That is no longer the case. Our military has grown successively younger. No longer do green young men have the benefit of older career non-coms and officers who have fought in previous wars. Nor have the vast majority of our nation's leaders had actual combat experience. The graying Master Sergeant portrayed by Sam Elliott in \"We Were Soldiers\" is fast becoming a thing of the past.Marlantes expresses disdain for congressional combat junkets where representatives never see the results of actual combat. Their experience is one of calm and quiet, conducted to assure their constituency that all things are under control and there is nothing to worry about.Interlaced with Marlantes' personal experiences are frequent references to classic military quotations and writings that address the essence of what it is like to go to war. Here, Marlantes shows us ancient cultural examples including the Celtic mythos surrounding Cuchulain, examples of the Code of Bushido, and some pointed quotations from General Patton addressing the importance of the principles of loyalty flowing from the top of leadership down to the enlisted man being more important than its flow in the opposite direction.Marlantes is merciless in his exposure of lying in the military world for the protection of career reputation and personal aggrandizement. His primary example centered on the false importance of \"body counts\" during the Vietnam War. Marlantes cheered Schwarzkopf when that General indicated the number of Republican Guard destroyed was irrelevant--that what mattered what who gave in first. In the end, that is what matters.Today, unless we have family members stationed in a hot spot, that we have troops engaged in military operations causes us little concern. Marlantes reminds us, \"Warriors deal with death. They take life away from others. This is normally the role of God...The Marine Corps taught me how to kill but it didn't teach me how to deal with the killing.\"It is impossible to read Marlantes' account without realizing that our young men who have returned from Iraq and who have yet to return from Afghanistan will not be the same young men we knew when they first went there. As they have served to ostensibly protect us, in turn we must now see that we acknowledge their return and welcome them home with the necessary services to lead the semblance of a normal life away from the sound of the guns."}, {"userName": "K. Elizabeth ", "userReviewDate": "Aug 24, 2011", "userURL": "http://www.goodreads.com/user/show/5807873-k-elizabeth", "userReview": "This wasn't an easy read. But then, nothing about war is easy, much less the psychological and spiritual effects of war on our combat vets. This was as thought provoking, challenging, and emotionally draining as any solid book about war should be. A few caveats to add context to my review of the book: 1) I won this book through Good Reads. 2) I am a civilian. 3) I am a US citizen. 4) I am an opponent of the vast majority of wars that we have participated in. 5) I am a counselor; the counseling profession has a recent yet fast moving awareness to the effects war can have on the psyche. Marlantes gently and intellectually challenged my views of war. In a profession where entire scholarly journals, conferences, and specializations are dedicated to the trauma or war, I had become even more set in my \"anti-war\" ways. This is certainly not to say that I am pro-war now. What I am, though, is aware of my previous sophomoric \"anti-war\" views. Marlantes presented a middle ground to me. This is a slow read. It should be this way too, as war is slow. At the end I knew this was a necessary read for me. It won't be long before this is required reading in High Schools (hopefully we will be wise enough to require it before our youth are of age to sign up for the draft). While never directly mentioning either, Marlantes helped me understand both a generation and political party I have never seen eye to eye with. I have not moved to stand on the other sides of those painted lines. But now, thanks to Marlantes, I stand closer to the center and have more balance, understanding, and compassion. What a surprisingly impacting read."}, {"userName": "Darwin8u", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "\"Warriors must touch their souls because their job involves killing people. Warriors deal with eternity.\"- Karl Marlantes, What it is Like to Go to War [my little brother in Afghanistan]An exploration of war. Part memoir of a Marine (Vietnam War), part Joseph Campbell/Jungian exploration of the warrior, part critique of policy. The book is also written directly to those men/boys (and yes, women I guess too) preparing for war. Having suffered PTSD from Vietnam, Marlantes uses this book to instruct younger warriors, while at the same time using the writing as therapy approach to understand his own perspectives about his past.I actually really appreciated this book. If you include my brother-in-law, all of my brothers have seen combat. My little brother and my brother-in-law both struggle with PTSD. My brother-in-law served in Iraq and Afghanistan as a LT. My little brother dropped out of UVA and joined 10th Mountain Division, served 15 months in Afghanistan and came home broken (alcholism, addiction, suicide-attempts, fights, jail, homlessness). My older brother served 2 tours in Afghanistan and 2 tours in Iraq before dying in a helicopter crash in Germany. So, as Marlantes relates his perspectives on war, killing, and coming home, I GET it. Not from the perspective of a soldier or warrior, but from the perspective of family who sees their loved one return broken.My only critique of the book, and it is a personal critique, is Marlantes does tend to get a little pie in the sky in his policy recommendations. His recommendations reminded me of the prescriptive parts of Thomas Piketty's Capital in the Twenty-First Century, where he talks about a global tax on capital. I knew he was right, in a perfectly rational and sane world, but also knew it was politically just a Ivory Tower wet dream to imagine a world that would be able to coordinate politically in such a way to reform global taxes to prevent future instability. Marlantes falls into the prescription trap. I agree with a lot of his recommendatiosn for ritual, burial of enemies, space between fighting and returning, etc., but also recognize Congress hasn't passed a 2-year budget in years AND the current President lacks a basic ability to feel empathy, so hoping our policy makers would empathize with those fighting our nation's battle, in the way Marlantes recommends, just seems to be closer to a dream castle than a war room. But, HELL, if writing this book, and thinking about these best case options for reintegrating soldiers, helps future warriors, or inspires and moves the needle a bit for future policy makers (OR if it just helped Karl Marlantes move a little further from the War and closer to his home), it was all worth it."}, {"userName": "Tim", "userReviewDate": "Sep 05, 2011", "userURL": "http://www.goodreads.com/user/show/2313194-tim", "userReview": "So, if a lifelong pacifist liberal says a book about how to train our soldiers is a \"must read,\" it must be full of peacenik bullshit aimed at undermining the military, right? Believe me, though, when I say that's not the case with Karl Marlantes' \nWhat It Is Like to Go to War\n. Marlantes brings experience and knowledge to bear on something about which I know little to nothing. Yet I find the book so profound that I do call it a \"must read,\" an appellation that rarely passes my lips.The list of those who should be required to read the book is long: every decisionmaker and policymaker in the Department of Defense, every NCO and officer in the military, and every member of Congress. It better be on President's Obama's list of \"books I read this summer.\" What It Is Like to Go to War should be assigned reading at every military academy and in any fundamental leadership course for non-academy military training. In fact, it is a book that should be read by everyone who relies on the military. In other words, it should be read by all of us.Marlantes combines personal experience, philosophy, history, mythology, ethics, psychology and spirituality in examining how we train our warriors. Marlantes has a range of ideas on how we can better prepare them for the jobs we assign them and, equally as important, to return home with the least damage to their psyche. Much of what he suggests comes from his own experiences as a combat Marine in Vietnam (some of which will be familiar to those who read his highly praised \nMatterhorn: A Novel of the Vietnam War\n) and as he tried to cope with post-traumatic stress disorder after the war. Even though that war was fought decades ago, Marlantes now has the benefit of perspective. He argues persuasively that not only do today's soliders face many of the same issues he did, the ability to kill remotely, and seemingly antiseptically, with drones, cruise missles and the like may raise other issues. Yet while recognizing modern warfare, What It Is Like to Go to War occasionally also looks to the past. Marlantes argues that some \"primitive\" societies better prepared their warriors for the toll combat takes on the body and the mind. Among other things, he suggests \"rituals\" to aid combat veterans, including some that would be performed immediately after a firefight. He also suggests that spiritual (not necessarily religious) guidance not only be part of military training, but available in the combat zone and afterward, particularly since our wars are fought by the young of society. At least from a layperson's perspective, much of what the book suggests does not seem to be difficult to put into practice or disruptive of military training. There is no question Marlantes, a Rhodes scholar, thought long and hard about the personal consequences of combat, how we prepare our soldiers for it and how to help them deal with it afterward. The book is stunning in the breadth of knowledge on which it draws yet is written to remain highly accessible. It is an important book, far too important to ignore.(Originally posted at A Progressive on the Prairie.)"}, {"userName": "Susan (aka Just My Op)", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/2489613-susan-aka-just-my-op", "userReview": "The author of the popular Matterhorn: A Novel of the Vietnam War has turned his talents to writing a nonfiction book about his experiences in Vietnam, how present-day warriors are not trained to emotionally and spiritually deal with the jobs they physically must do, what we've done wrong, what we need to do better. He looks at the history of war and warriors in ancient cultures and mythology, and how the wars we fight are changing every day. He has advice for warriors, those who are serving now, those who are trying to deal with having served, and those seemingly fearless and impressionable young who want to serve. He looks at the psyches of those who kill, what emotions they are feeling. And like the training, that which makes the warriors strong and loyal can also work against them. I haven't underlined so many passages in a book since I was a student, trying to memorize facts.I don't remember reading a book that touched me as deeply and as personally as this one did. Some of his writing is about theories, ideas, interesting to read and ponder. Some is very highly personal, violent, open. While I found the theories and ideas fascinating, the personal really hit home. I found myself, most unexpectedly, crying. I can't imagine it not having an effect on anyone living through that period. But I think it is very important reading for anyone who has served or is serving, for anyone considering it, anyone who is responsible in any way for training warriors. And it is also for those who oppose most or all wars. It's a must-read for anyone who has ever given a second thought to war.The version I read was an e-book uncorrected proof, and I thank Grove/Atlantic and NetGalley for giving me a copy. The publication date is scheduled for September, 2011. In case you haven't already figured it out, I highly recommend this book."}, {"userName": "El", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/83144-el", "userReview": "I didn't intend to read this book, but my boyfriend recently got it as an mp3 through the library, and since he never follows through on things he gets from the library, and the other mp3 I wanted to listen to was broken, I snagged this one on my way out the door one day because I have to listen to something while I walk the dogs or else I get sad.This was a bad choice to avoid sadness.About 20 mins into the walk I wanted to scrape my face off the sidewalk. I felt this heaviness in my chest and on my shoulders as I listened to Marlantes tell me his story (in Bronson Pinchot's voice, but not in his Balki accent, so it wasn't even amusing in that sense) of fighting in Vietnam as a 1st lieutenant in the Marine Corps.But before I lose you, this isn't just another guy's reminiscences of war, though there is plenty of that. Marlantes' intention here was to share with anyone interested what it's really like to go to war. War is somehow romanticized and glorified in society, primarily through film, literature, and media. It has often also been considered a \"rite of passage\" for many young men, which Marlantes discusses in great detail (for boys, they became men by experiencing war, etc, and girls became women by becoming mothers - that's an ugly paraphrase, but that's not really my point right now). His concern is that many young men (and women now) are going to war without really being mentally or spiritually prepared for what they will encounter. There is plenty physical preparation that takes place, boot camp and whatnot, but no one talks to these soldiers or marines about to what to expect will happen to them psychologically.Emotions have never been high on the list of priorities when it comes to going to war. Marlantes wants that to change. After his own experience, he was able to recognize what his own issues were, something that not everyone who goes to war is able to figure out for themselves. Marlantes talks quite a bit in the beginning about guilt - the guilt he felt for making decisions that could get any number of people in his unit killed, the guilt he felt for surviving, the guilt for the damage he inflicted directly on others in a different country. He reminds us that this guilt is not something that young warriors are warned about. No one gives them an outlet for discussing those feelings they have, and to be frank, there's not always the time or capability to have those discussions in the middle of battle anyhow.Marlantes, however, feels that men and women joining the forces now can be better prepared from that end of things if that's part of their training from the very beginning. It could help them make better decisions in the line of fire, help relieve some of the conflict they might feel. It makes sense if you really think about it.He also spends time talking about the spiritual end. He mentions God once or twice, but when he talks spiritualism here, he doesn't necessarily mean religion, though allows that everyone should be able to make their own decisions on that front. When one is in the middle of a war (something I have never personally experienced), one undoubtedly is confronted with the idea of their own mortality, and may philosophize over what might be out there. There's nothing wrong with that. When you have bombs going off around your face, you're welcome to do whatever it takes for you to get through the experience as far as I'm concerned. If you want to pray to the Flying Spaghetti Monster, you go right ahead. But Marlantes points out that again there's not as much an outlet for those sorts of morality issues that come up with spiritualism or religion - how do you reconcile killing large masses of people when killing is bad?Marlantes tackles a lot of serious questions like these, and I am in no way doing this book any great service. It's worth reading, or listening to. Bronson Pinchot, in all seriousness, was an incredible narrator, really expressing an empathy in his narration that made my heart ache.The areas I did have slight issue with (particularly towards the end where Marlantes talks about violence in general and how children \"should\" be raised) rubbed me the wrong way because I don't feel raising children is similar to going to war, though I understand his point was really about aggression and how aggression is reacted to in society, and children may benefit by a change in those views. In any case, it didn't really resonate with me or we have differences of opinions on that front.But the rest of the book was engrossing and terrifying and makes me want to hug anyone and everyone who went through or is in service, especially the ones who may not know how to deal with any of the emotions or experiences Marlantes details in his book."}, {"userName": "Larry Bassett", "userReviewDate": "Sep 10, 2011", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "After the warrior returns home from the initiation of combat, he becomes a member of “The Club” of combat veterans. It has always been a club with its own secrets and its own and societally-imposed rules of silence. Traditionally, it has been a club tied in with the mystery of gender because being a warrior was tied in with manhood. This ancient mystery combined with the silence forms an intriguing and powerful combination for attracting future members, particularly boys. You don’t join this club; you can only be initiated into it. This book is complicated and thought provoking. Karl Marlantes says, “This book is my song. Each and every one of us veterans must have a song to sing about our war before we can walk back in the community without everyone … quaking behind the walls.”Karl Marlantes is macho. He calls it “hyper-masculine warrior energy.” He lets you know that right off. It’s the macho guys in Kill Anything That Moves who rape the young girls, manhandle the civilians and kill the babies. I don’t think I like macho Marlantes much. But he does know how to write about learning to be spiritual in Marine Boot Camp. I am still not impressed. God told Abraham to sacrifice his son Isaac. And stupid Abraham was going to do it. I am not much in favor of being spiritual if it means sacrificing Isaac. I have been on another streak of Vietnam books. I don’t seem to be able to stop fighting that war. I recommend Loon A Marine Story, A Rumor of War and Kill Anything that Moves.How did you feel about killing, Mr. Marlantes?  My feeling? I was elated! I shouted to the team, “We got Chrispy Critters all over the hill!” . . . If, back then, I was who I am today, I would have felt differently. There would have been no elation. But back then I was just like the battalion staff that cheered our victory on the hill. I had identified with the reconnaissance team, whose lives were very much in doubt. Psychologically I had become identified with the threatened group and the advancing enemy was no longer human like “us.” I didn’t kill people, sons, brothers, fathers. I killed “chrispy critters.” It could have been krauts, nips, huns, boche, gooks, infidels, towel heads, imperialist pigs, yankee pigs, male chauvinist pigs … the list is a varied as human experience. This disassociation of one’s enemy from being human is called pseudospeciation. You make a false species out of the other human and therefore make it easier to kill him. The touchdown feeling combined with disassociating the enemy as human was in full glorious effect. . . .Ideally, I would hope that, in spite of the adrenaline, I would at least stay conscious of a terrible sadness while I burned these people. But burn them I would. No kidding? Say, what, Mr. Marlantes? But in some way, Marlantes had a sensitivity that I will never be able to own. I, who had never made a decision that someone else would live or die, would judge Marlantes from my safe world that never threatened death or was threatened by death. And, yes, I am judging him right now knowing that I will never be in his place to make the decisions that he made about life and death. I am righteous in my pacifism. I can’t believe that Karl says this: There’s a part of me that just loves maiming, killing, torturing. This part of me isn’t all of me. I have other elements that are indeed just the opposite, of which I am proud. So am I a killer? No, but part of me is. Am I a torturer? No, but part of me is. Karl says that he worries about the part of me that cannot understand that. And I want to tell Karl that I certainly cannot understand that.In the continuum of warriors, where does Karl Marlantes stand? He is so philosophical that he must be an aberration. How many like him came home in a body bag with a chunk of brain missing? How many books like this have not been written? I find it hard to attach him to his self definition as a spiritual being. He seems more tortured than torturing. How much agony has he suffered, not in the moment, but in the much later reflection? Decades later he suggests.This book is unbelievable. There is a chapter titled “Lying” that starts out this way: People lie. They lie in business, they lie in universities, and they lie in the military. Lying, however, is usually considered not normal, the exception. In Vietnam lying became the norm and I did my part. Only, in Vietnam, lying became so much part of the system that sometimes  not lying became immoral. This book is unbelievable: lying is the norm? Tell me about mom and apple pie, please. Body count is a lie but it is the score that counts.Marlantes distresses me over and over with his apparent pleas to ignore individual conscience. Isn’t that what this says? That your decisions in war must be guided by your stand-ins for the incomprehensible, “like the Marine Corps”? To be effective and moral fighters, we must not lose our individuality, our ability to stand alone, and yet, at the same time, we must not owe our allegiance to ourselves alone, but to an entity so large as to be incomprehensible, namely humanity or God. For us mere mortals who can’t grasp the incomprehensible, we limp along with allegiances to various stepped-down versions of the incomprehensible that seem to suit us, like the Marine Corps, the family, France, the Baptist Church, or the Order of the Eastern Star. We must strive, however, to always see these smaller entities as only small pieces of the larger one we’ll never comprehend. That is because when the moment comes for a tough decision, we can make it in light of the larger ghosts, even scared to death in the mud with all those frightened kids around us. Marlantes has some stunningly complex (or maybe obtuse) conversations about why he might follow “stupid orders” because of a loyalty to the larger unit. He observes “We are generally delighted to be cogs.”Some other nibs shared by Marlantes? There are plenty:  “Combat is the crack cocaine of all excitement highs – with crack cocaine costs.”One motivation for bravery: “I wanted a medal.” “One very strong reason why I deplore ignorant attempts by civilians and non-combat veterans to make boot camp more ‘humane,’ There is nothing ‘humane’ about dead kids because someone cracked under the pressure.”“ . . . he and the chopper crew were dead for sure if we didn’t break through to them, we all simply rushed forward to reach them before the NVA killed them. No one gave an order. We, the group just rushed forward all at once. We couldn’t be stopped. Just individuals of us were stopped. Many forever. But we couldn’t be. This too is a form of transcendence. I was we, no longer me.” “When a President or Member of Congress decides to go to war, they must do so as warriors, not ‘policy makers.’ It is they who are choosing sides and using violence to stop violence, the very definition of a warrior. It remains a reason why the electorate should value military experience in its leadership positions.” The chapter titles are a guide to the content of the book: Temple of Mars. (Note: Mars is the god of war.) Killing. Guilt. Numbness and Violence. The Enemy Within. Lying. Loyalty. Heroism. Home. “The Club.” Relating to Mars. There is some that is graphic and much that is intense. Although I only succeeded minimally, reading What It Is Like to Go to War was a lesson for me in trying to be non-judgmental. Karl Marlantes is a bright guy who has a lot to say about being a soldier. Since I have never been a soldier, it is probably good for me to hear what he has to say. Since he speaks very well, I cannot just write him off by saying “Bullshit!” His opinions and beliefs are not ones that I am often able to confront rationally. I can sympathize with him when he talks about being abused as a returning Vietnam veteran. I want to respect his effort not to return abuse for abuse and to acknowledge his battles with the furies within himself. I hear him say, “The phrase ‘politically incorrect’ hadn’t been invented yet, but I was a living prototype.” I wonder what I would think if I had devoted as much energy to being a pacifist as he has devoted to being a warrior? It is clear from the book that he has struggled with his experiences from so many years ago.  Pre-school teachers constantly use the convenient short-hand “use your words” when a child gets aggressive. The over-riding message is “aggression is bad.” It doesn’t recognize the healthy aspects of aggression. Unrecognized, the healthy drive goes over to the dark side. There are times when physical aggressiveness is an appropriate response. When you meet the serial killer on the jogging path, words are going to fail you. I would like to be able to be as cogent as Karl Marlantes is in this book. His references to the Roman gods and the Greek myths are erudite. He makes Yale, his alma mater, proud. I have quoted many of his words. I have read many books about the American War in Vietnam and this one is unique. It has some of the horror stories you come to expect in books about that war but it is also filled with an effort to teach and guide in a way that is different from any other book I have read.  I wrote this book primarily to come to terms with my own experience of combat. So far – reading, writing, thinking – that has taken over thirty years. I could have kept my thoughts in a personal journal, but I took on trying to get these reflections published so that I could share them with other combat veterans. Perhaps, in some way, I can help them with their own quest for meaning and their efforts to integrate their combat experiences into their current lives. I also want to share my thoughts and experiences with young people who are contemplating joining the military or who are about to enter combat themselves, sort of like providing them with a psychological and spiritual prophylactic, for indeed combat is like unsafe sex – it’s a major thrill with possible horrible consequences. . . . So, if by reading this book before entering combat, a young warrior can be helped to better handle the many psychological, moral, and spiritual stresses of combat, then this book will have been worth writing. In addition, if the ideas in this book help citizens and policy makers attain a clearer understanding of what they are asking of their warriors and of their own role in sending these warriors into the morale quagmire and sacrificial fire called war, then the book will have succeeded, if not beyond my hopes, beyond my expectations. Marlantes is a proud Marine. I can’t relate to that. He has killed and wrote to help others confront what it means to be a killer. He wants warriors to be able to kill in the right circumstances for the right reasons. I am having a hard time assigning a number of stars to this book. I would not expect a book about war to be an easy read. It isn’t. Marlantes is in a different emotional space than he was when he was a twenty-three year old Marine lieutenant in 1969. I am going to cop out and suggest that you go online and read the NY Times book review http://www.nytimes.com/2011/09/18/boo... that concludes “…its facility and sensationalism are symptomatic of the book’s prevailing emotionalism, which too often stands in the way of sustained social critique and of the patient moral and political analysis required to unravel the convoluted network of courage, shame, honor, obligation and betrayal that war entails.” Print that on your book jacket!I could rationalize three stars (because I found it too disagreeable politically) or five stars (because I found it stimulating). I am going with four stars and a recommendation that you think about reading What It Is Like to Go to War if you made it to the end of this loooooong review."}, {"userName": "Jaclyn Day", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/1373260-jaclyn-day", "userReview": "Vietnam veteran Karl Marlantes wrote this haunting nonfiction book about the realities and after effects of combat, in the context of both historical conflict and modern-day war.I had put this on my to-read list after reading a review of the book that earmarked it as one of the best insights into the modern-day warrior mind that the reviewer had ever read. Although I can’t say I’ve read every book in this genre in order to make that comparison myself, I can say that this book—and Marlantes’ personal combat experiences—will haunt me for some time to come.There is a divide between a civilian (like myself) and the veteran or modern soldier that this book attempts to gap by showing how intrinsically different combat is from any other human experience. There’s a tendency among civilians to believe certain things about combat situations from movies or fiction books, and I know I’m guilty of this myself. (I wonder how many non-veterans claim their greatest exposure to the Vietnam War to be Apocalypse Now, for example?)What this book does so well well is putting words to emotions and to experiences in a masterful way that I haven’t read before. I found myself taking away something so valuable from reading this, but believe that there is an even greater value in this book for the combat veteran, or currently-enlisted soldier, or for the person thinking about enlisting, or for the family or wife of a member of the armed forces. As for me—someone with very little personal connection to the military—I have left this book with a completely altered thought process regarding our nation’s soldiers and what is expected of them both abroad and at home. It’s incredibly sobering and eye-opening."}, {"userName": "Ryan", "userReviewDate": "Aug 22, 2014", "userURL": "http://www.goodreads.com/user/show/1500718-ryan", "userReview": "I read Tim O'Brien's The Things They Carried in July and decided to chase it with Karl Marlantes' What It Is Like To Go To War.Marlantes can write descriptively and honestly. I particularly recall one scene during boot camp when he swatted a mosquito. His drill sergeant took him to a slough and had him stand naked in a swarm of mosquitoes. I also enjoyed his description of how becoming a marine changes how he thought about danger and his abilities. These scenes were descriptive and I found them illuminating.As for honesty, I suppose the most striking idea I encountered here was a statement that a soldier is trained to kill without remorse and a teenage male will tend to, psychologically speaking, fit the requirement. He goes on to point out that they are extremely vulnerable afterward because they struggle to understand what they have done.I think my favorite chapter was \"Lying.\" Here, Marlantes explains why a soldier might be inclined to lie about his conduct, specifically the kill count. Let's say that a soldier and his unit are in the Vietnam War (as Marlantes was) and that they have just exchanged fire with the NVA. One of the American soldiers is killed. The firefight happened in a jungle, and it included grenades and other explosive weapons.How many NVA did you kill?Well, the soldier's buddy is lying there, dying or dead, and no one really got a look at the North Vietnamese soldiers they were trying to kill. They were just attacking that general direction. In this moment, the soldier needs to justify the death of his buddy in order to make sense of what has happened. This need can be, in part, satisfied by upping the kill count. Further, superior officers want to pad their numbers in order to jockey for promotion, so soldiers will feel that they are encouraged to lie.(I couldn't help recalling Campbell's Law, which states that when a statistic is given great weight, it also creates a great potential for corruption.)I was curious why Marlantes so often -- almost exclusively -- referred to \"soldiers\" as \"warriors.\" According to the Mactionary, a warrior is an elite soldier. So as a marine, I guess Marlantes qualified. However, it seems to me that most soldiers are \"soldiers,\" not \"warriors.\" Further, it seems to me that 'warrior' suggests a more romantic and more individual idea than \"soldier,\" but that as a member of an army, one is first and foremost a soldier.What It Is Like To Go To War offers a number of such rabbit holes for the citizen to consider. At times, I found this book a little too descriptive and at other times, I wondered to what extent I was reading an objective overview rather than a man's attempt to explain his actions to himself.Regardless, the best parts of What It Is Like To Go To War are very good."}, {"userName": "Doug", "userReviewDate": "Sep 08, 2011", "userURL": "http://www.goodreads.com/user/show/4763780-doug", "userReview": "Karl Marlantes and I share a good bit in common as regards the subject matter of this book. We both entered the service as Privates in 1964 ( he a Marine, me the Army), we both were commissioned as Lieutenants through OCS, and we were both rifle platoon leaders and interim company commanders in Vietnam in 1966. I am somewhat conflicted in commenting on this book. I read it principally because I read Matterhorn and and felt that it was the only Vietnam novel that I have encountered that was worth ones time reading - it was spot on accurate and Marlantes is an excellent writer. As long as he sticks to describing what it was like to be in combat, I am impressed. My experience was, of course, somewhat different. This is natural because no two people react to combat in exactly the same way. However, when he goes off on other tangents, I become a little less comfortable. In a nutshell, I believe he has a tendency to over-intellectualize something that is essentially visceral in nature. Some of the reviews that I have seen on Goodreads bother me a bit, too. When I say that I understand what he is saying, it is because my experience allows me to use his writing (again, quite excellent) to bring back the noise, the smells, the the sights and the complex set of emotions involved. When I see someone write that reading this book has enabled them to understand what it's like to be in combat, I have the same reaction that I have when someone tells me the same thing about having watched the first ten minutes of Saving Private Ryan - Bullshit! This book would have been more appropriatly entitled What It Was Like for Me to Go to War."}, {"userName": "Kathryn", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/2451592-kathryn", "userReview": "\"Matterhorn\" was certainly a notable book, so I had to enter the giveaway for this one! Marlantes as usual did not disappoint, and the subject matter of his book is one that everyone should be deeply concerned about, especially with the high suicide rate for out returning soldiers.Marlantes provides a riveting account of what it is like to be sent to war and points out how ill-prepared our young men are. Previous generations spent years preparing warriors. Modern Americans should and could do more to support these young men. Marlantes has written a book for everyone who supports and cares about your troops and the young men who are the future of this country."}, {"userName": "Terri", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/1968826-terri", "userReview": "Probably go so far as to say there was some over intellectualising going on here, but that aside, this book gave me many a valuable moment as it unlocks much of Matterhorn. The Marlantes fiction/memoir. Marlantes reveals in this non fiction book what you no doubt already suspected, that much of his fiction was based on truth and at times, danced very close to being an exact blow by blow of events.Many who know me on Goodreads, know that I lay my heart on the table in my review of Karl Marlantes book Matterhorn. That book moved me like no other book ever has. Fiction or non fiction.What It Is Like To Go To War is a completely different offering filled with theorising, theology and psychoanalytical complexity. This still makes it a powerful book for the mind and the soul. But, from time to time the depth that Marlantes goes into, may ostracise some readers. Most especially those who want something more grit and gut then bible and spirituality.*NB To you all who have read Matterhorn. Know this. Marlantes IS Mellas."}, {"userName": "Margaret", "userReviewDate": "Sep 02, 2015", "userURL": "http://www.goodreads.com/user/show/4098759-margaret", "userReview": "One of the best books I have ever read about war and my first book about the Vietnam War. I have always avoided movies and books about Vietnam because of having grown up while the war raged. My cousin who was a helicopter commander was shot down in 1970, he and two others out of his crew of 4 died. I'll never forget the day that my family heard the news that he died and to this day that fact is still lodged firmly in my memory. While reading this book I constantly thought about Alex and what his experience must had been like in Vietnam. Through much research I was able to contact a friend of the survivor of my cousin's crew, he blamed my cousin for being \"too aggressive\" and acting more like an officer. When I read the book I came across the author mentioning that the warrior had to approach the fighting in an attitude of not only survival but an aggression that carries them to the finish. This insight really helped me to understand that my cousin acted out in his approach of fighting was common and expected, in short, part of being a warrior. The author brought his own experiences of war and what it was like to go to war clear to the point what it was like to kill. I appreciated the psychology and the navel gazing in the effort to bring the reader to that grief and sadness and often the thrill of being a warrior, in his case a Marine. This book kept my interest engaged to the end and he brings some clear ideas and ideals that warrant re-reading this important book and recommending it to those who are interested."}, {"userName": "Jessica Buike", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/5840964-jessica-buike", "userReview": "What It is Like to Go to War by Karl Marlantes was a book that I won through Goodreads, and I was looking forward to reading it. My husband is an Army vet who spent time in Iraq and Afghanistan, as well as on the Korea DMZ. I thought that perhaps the book would touch on war experiences of multiple soldiers and provide insight on how the war affects soldiers.However, I found that I just couldn't get through this book. It read very slow with lofty psychological language (and I even have my BA in Psychology!) and just didn't capture my attention. I made it through only the first half, but I couldn't find the desire to continue reading as it just wasn't inspiring me to continue. Therefore, if you are interested in this nonfiction genre, I do hope that you will still consider giving it a try and not basing everything off of my one review. I think it's great that the author was able to share his experience, and perhaps this book was a cathartic experience for him. But overall, I didn't like the book."}, {"userName": "Timothy Bazzett", "userReviewDate": "Feb 26, 2012", "userURL": "http://www.goodreads.com/user/show/5491319-timothy-bazzett", "userReview": "As one of tens of thousands of readers who read and marveled at Karl Marlantes' best-selling novel of the Vietnam war, MATTERHORN, and wondered either privately or publicly how he managed to write such a viscerally real, honest and gut-wrenching fictional account of that war, here is our answer. Or at least Marlantes' attempt to answer that question. Because this \"follow-up\" book, WHAT IT IS LIKE TO GO TO WAR, reads like a cross between a psychological and sociological inquiry into the hell that is war and a personal examination of conscience. Marlantes lays bare his soul in this volume, or perhaps as close as one can come to doing this.The chapter headings in the book say it all: Killing, Guilt, Numbness and Violence, Lying, Loyalty, Heroism, and Home. Marlantes investigates thoroughly every aspect of what it was like for him and thousands of other young men who were torn from home and family, trained to kill and then thrust precipitously across an ocean and into an unforgiving jungle world filled with other young men who were trying to kill them.Although Marlantes also attempts to put the Vietnam combat experience into a larger historical context going all the way back to the Greeks and Mars the god of war, it is when he tells of his own personal agonies and fleeting madness in the heat of battle that he is most effective and touches the reader most deeply. And it is in the chapter on heroism that this comes through in the most profound way, when he tells of the specific events that earned him some of the highest medals, awards he's not sure he really earned, considering so many other he knew of who did and sacrificed so much and were never decorated at all.One of his exploits which earned him a medal involved trying to rescue one of his men who had been wounded, crawling and firing up a hill under a machine gun barrage, then dragging and rolling with the man back down a hill where the man died, \"a neat hole in the top of [his] skull.\" Decades later, Marlantes remembers that hole, and still wrestles with guilt and crippling doubt.\"He had been lying head down toward me. The bullet went into the top of his head. I could have put it there myself when I was trying to keep the machine gun fire down as I crawled toward him. I'll never know.\"And later, in the chapter called \"Home,\" Marlantes summarizes what so many returning veterans no doubt felt in those years, with no little bitterness and anger - \"To me, and to my parents, I'd been gone an eternity; to everyone else, a flash. This is no one's fault. Life is busy and full.\"I can remember how I felt coming home from the army after nearly three years away and people I knew acting surprised that I'd even been gone. But I was a Cold War veteran who never saw combat, so it's hard for me to imagine how such a reaction would have felt to someone who had undergone horrendous living conditions in a faraway jungle, risked life and limb and been wounded multiple times. In fact Marlantes didn't just get casual indifference from people; he got rejection and outright hostility. Indeed he even recalls having his uniform spit on by a woman on a train. Such were the sixties.There have been countless personal narratives detailing the Vietnam war experience. Two of the best that immediately come to mind are Philip Caputo's A RUMOR OF WAR and Robert Mason's CHICKENHAWK. But Karl Marlantes has spent most of his life trying to figure out exactly what happened to him in Vietnam, going over it and over it and over it again. Finally he gave birth to a most moving and enormously successful novel, MATTERHORN. In this new book, WHAT IT IS LIKE TO GO TO WAR, he finally explains his own personal experiences and the absolute hell that war has always been and how it can destroy lives. It's a pity that politicians don't make time to read books like these. Perhaps they would not be so quick to rush into wars. I hope, finally, that Marlantes has managed to expiate some of his own personal demons and doubts by writing. He deserves a separate peace. He has earned it.- Tim Bazzett, author of the memoir, BOOKLOVER"}, {"userName": "Ben Kane", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/5669202-ben-kane", "userReview": "I'm a sucker for books about war, or the effect that war has on people. Until I saw this book, I had never heard of Karl Marlantes. I mentioned this on Twitter soon after starting it, and was deluged with people recommending that I read his book, Matterhorn - called by many 'the best novel written about Vietnam'. Reel back to when I picked up What It Is Like To Go To War. I was hooked within a page. Good enough reason to buy, so I bought it, and read it all in about 24 hours.This is a great piece of writing. Marlantes survived the hell of Vietnam, where he served as a Marine Corps officer, fighting in the most awful conditions, killing Viet Cong, losing his own men, and winning a large number of medals for bravery. When he came back to the USA, it's not surprising that he had been deeply, permanently scarred by his experiences. It took him several decades, but he worked his way out of the hell of PTSD. This book is about his journey from that hell, and his opinions on how modern armies could better equip the soldiers of today to face what will happen to them when they are thrown into the white hot, unforgiving cauldron of war. In a world where men can kill their enemies by sitting at a computer screen and clicking a mouse, before going home to their wives/girlfriends and families, there is no space for contemplation, no room for the mind and psyche to process what has been done.As Marlantes says, this is not a good thing. War has been brought so close to 'ordinary' life, and yet the average person in the street still wants to know nothing about its terrible reality. Marlantes offers humane and sane alternatives in his book, which I believe would greatly help those who otherwise often come back to the real world as damaged individuals. He should be applauded for this magnificent effort, but I fear that it will be many years before any government implements these kind of processes. Sadly, and despite the trite words offered by politicians, soldiers are all too often expendable units to be used in poorly thought out wars that have no clearly laid out endgame. In this, nothing has changed in more than 2,000 years."}, {"userName": "Jackie", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/1147841-jackie", "userReview": "I've met Karl Marlantes a couple of times now, and each time I've been deeply impressed with his intense intelligence, his ability to tell a story, and his bravery to talk so very honestly about war, what he did in it, what he got out of it, and what he wishes were different, then and now. This book is very much like having a long conversation (albeit with footnotes) with the man himself. He opens up about everything which requires a depth of bravery that far surpasses that of a traditional warrior, though he would argue that the truly traditional warrior was a man of thought and philosophy, and we've stripped that part of war away over the millennia. He's introspective and probing, looking for meaning and lessons. He's also adamant about training and supporting the WHOLE warrior, not just on weapons and strategy but on spirituality, philosophy, moralityand psychological coping techniques--before they go, while they are in the field, and certainly after they come home. He makes many great points about what is wrong today, and what lessons we should have already learned from all the battles from Vietnam on. This is a very intense read, but an invaluable one. I urge everyone to read this book."}, {"userName": "Michael Beggs", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/20497593-michael-beggs", "userReview": "Quite possibly the best book written about the subject, at least the best I've ever read. I admit that as a contemporary of Marlantes, I had more than a passing interest in the subject, as a combat veteran Marine Corps officer myself. If I ever wanted to take the easy way out to try to explain my post-war self to my children, I'd simply hand them this book.Marlantes gives not only a \"this is the way it is\" narrative, but also a rather in depth philosophical look at the way American boys are (or at least used to be) raised, their expectations and others' expectations of them, and the effect that being a participant in infantry combat can be on the young men who experience it. However, if you're looking for an apologia for why some men experience PTS, this isn't it. Based on my personal experience, anyone who goes to war in the way that Marlantes and I did cannot escape being changed in some way by the experience, which is not to say that PTS is the inevitable result of war and therefore, to be avoided at all costs. No, this book isn't that. It's simply the best explanation I've ever read on what it is like to go to war."}, {"userName": "Chris", "userReviewDate": "Aug 20, 2011", "userURL": "http://www.goodreads.com/user/show/2222340-chris", "userReview": "What an amazing book! It's part memoir, confession, ethics workshop, psychology, mythology tutorial, and war story. While Dave Grossman's much touted On Killing gets into the psychology of killing, Marlantes' book delves into the soul of the matter. It's heartfelt, raw, prescriptive, and wise. It doesn't have the \"I told you so\" admonition nor does it have the \"I'm old and wise now, so listen up\" aura about it. But it's compelling reading. Marlantes sounds like a real jerk as a young man: seeker of medals, flip disregard for limits, pothead. But he was a lean, mean killing machine, a warrior and a troubled one at that. He did everything society asked of him and was rewarded for it, yet he felt empty and deeply troubled. He points out that the military has medics for the body but not for the soul. Chaplains don't do too much according to Marlantes in this regard. If you've been to war or live with loved ones who have, read this book. It will help you understand. The author and his family have travelled this difficult road."}, {"userName": "Lauraadriana", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/4440479-lauraadriana", "userReview": "This book gave me an entirely different perspective about war and what the men and women who fight them really experience.I have deep respect and empathy for the young men and women from all over the world who make incredible sacrifices sometimes sacrificing their own lives to fight wars, our wars.Karl Marlantes a Vietam War veteran, a Marine very eloquently and with amazing depth explores just how little preparation young warriors receive in terms of how their minds and their spirits will heal from the things that they do and see while at war.He explores emotional toll that it takes on all the men and women who go to war and tries to figure how things can be done different to that veteran don't come home with broken spirits.Very very interesting book. I really enjoyed it."}, {"userName": "Sarah", "userReviewDate": "Mar 19, 2012", "userURL": "http://www.goodreads.com/user/show/334766-sarah", "userReview": "This was an interesting companion to Matterhorn, Marlantes' novel about Vietnam. Here Marlantes further examines the preparation and repercussions of serving in combat. Pulling from his own experiences and historical references Marlantes offers suggestions for the military to better prepare soldiers - before and after. I found Matterhorn to also be well written but had more of an emotional punch. I would recommend this to contemporary memoir readers and those interested in combat and impacts of war on warriors."}, {"userName": "Nathaniel", "userReviewDate": "Nov 15, 2014", "userURL": "http://www.goodreads.com/user/show/3809399-nathaniel", "userReview": "Karl Marlantes' \"What It is Like to Go to War\" hit me so hard within just the few minutes of listening, that I immediately wondered why I hadn't heard of this book before. As it turns out, I had. Sort of. The year before \"What It is Like to Go to War\" was published (2011), Marlantes' published the award-winning, much-reviewed, best-selling novel Matterhorn, which I had heard something about. (You can read an NYT review of that book here.)Many of the events depicted in \"Matterhorn\" are identical in \"What It is Like to Go to War,\" but in the latter case Marlantes is using his own name and making clear that the events are not fictional, and that they happened to him. They include numerous harrowing and wrenching stories of bravery and stupidity and pride and honor during the Vietnam War. These stories are told with expert prose and interspersed with equally powerful anecdotes of Marlantes' life before and after his tour with the Marines in Vietnam. The bulk of Marlantes' focus, however, is on using his own experiences--and his decades-long struggle to come to terms with them--as a framework for making sweeping suggestions about everything from the military (he thinks that combat soldiers should be trained to be able to respond to spiritual injury just as medics are trained to respond to physical injury) to society at large (he thinks that Americans are too repressive of violence in our children--especially boys--with the result that violence is out of control in our society). For the most part, I was very, very impressed with his observations. I found many of them profound, especially when they were less about policy and more about philosophy. But they also explain why the book is not more widely-regarded. Since \"Matterhorn\" won so many awards, the NYT had to review \"What It is Like to Go to War\" as well, and they did, but the review is much less impressed. Here are the things \"wrong\" with his book, from my perspective:1. He's up to his eyebrows in Jungian / Cambellian psycho-analysis (with a little bit of Freud for good measure). These are all famous theories, of course, but they are generally considered intellectual artifacts of bygone eras, not the basis for serious personal or social analysis today. 2. His attitudes are often not politically correct, especially in his staunch dedication to brightly delineated and separated gender roles. He's with the times enough to not bother to argue against a gender-integrated military, but he makes it clear that he thinks men should be men and women should be women, although he's flexible about exactly what each gender role entails.3. His policy recommendations are presented with notes for specific implementation (which is why they do seem like \"policy recommendations\"), but without any extensive or rigorous analysis of the costs or steps to roll them out.In short, and this is just my impression, Marlantes is an iconoclast amateur treading on ground that has been long-since claimed and occupied by professional academics. I don't think this hurts the book at all. On the contrary, his views are much more interesting because they haven't been run through the factory of American post-graduate education and research. They just aren't trendy. I'm not sure, for myself, that his policy recommendations were convincing as solutions, but his analysis of the problems --which is the meat of the book, in my opinion--was absolutely convincing. It helped, by the way, that wherever his analysis happened to overlap with Dave Grossman's from On Killing: The Psychological Cost of Learning to Kill in War and Society, they were in exact agreement. (E.g. Grossman and Marlantes both--independently as far as I can tell--came to the conclusion that returning Vietnam vets should have (1) been brought back as units not individuals and (2) been returned on slow-going surface vessels rather than quick transcontinental flights to better help the re-integration process.) So here's my final say: if you are at all interested in the psychology of war: read this book. If you are at all interested in the struggles that vets face--whether it's from fighting in World War II, Vietnam, or current battles in Afghanistan or Iraq: read this book. If you are at all interested in the history of soldiers returning from Vietnam: read this book. If you're all at interested in the deepest and sometimes darkest parts of human nature: read this book. And if you just want to read a riveting memoir full of poignant and tragic personal growth in some of the most extreme conditions imaginable: read this book. Basically, I think everyone should read this book.(I listened to the audiobook version narrated by Bronson Pinchot. AudioFile magazine recognized him as Best Voice in Fiction & Classics for, among others, his narration of this book. It is absolutely fantastic. He reads the book with so much genuine emotion that at several points I was sure (1) that it had to be read by the author himself and (2) that the author was a fantastic narrator. Nope, it was jut Pinchot being an absolute genius.)"}, {"userName": "Jeimy", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/9310118-jeimy", "userReview": "I picked this up for a reading challenge where I had to read a memoir about someone who went to war. It was a bit heavy on the religious aspect and I almost stopped reading it, but I plowed through.This book is not particularly memorable. There is no new insights about the Vietnam War nor does it add anything to the argument about how our young men and women in the armed service are not prepared for the horrors they will face in the war."}, {"userName": "Jimmy", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/3357765-jimmy", "userReview": "One of the best books of this kind I have read. The key is to be honest. To tell the truth about how intense life can feel when you can lose it at any time. I read part of this book while watching young boys and girls at a baseball camp in a minor league park with \"Knocking on Heaven's Door\" playing over the loudspeaker. The combination of the song, the book, and the kids playing made me feel like this is what we want to fight to preserve."}, {"userName": "Roxanne", "userReviewDate": "Aug 23, 2011", "userURL": "http://www.goodreads.com/user/show/4245944-roxanne", "userReview": "I was a Goodreads First Reads winner of this book and I was fortunate to have this book land in my possession.First, I appreciate that the author is writing about something he knows first hand about. (I get upset when people write or talk about something they have never experienced.) I felt Marlantes' experience was explained appropriately and held my attention without being over the top in bloody details.Second, I want to thank all veterans who have served our country in the past and pre-thank all of those who are currently serving.Third, I think this book should be a required read for every American. Whether war is justified or not, moral or not, I think you can divide Americans into two groups. Those who serve in some type of military capacity, and those who do not. Those who know what it truely is like and those that do not (and, often have no interest in those that do.)I applaud Karl Marlantes in his efforts to bring awareness to everyone about what can and should be done better. I think it was Oprah or Dr. Phil who always says \"when you know better, you do better\"....Sending better prepared \"warriors\" to war and transitioning the returning warriors into society sounds logical and pretty simple. So I guess it comes down to making his ideas a priority and a reality. As much as I don't want to believe it, war is here to stay. I have friends and relatives who are \"mentally\" broken from their time served and it is heart breaking to know that the correct help was not available when it should have been. Karl Marlantes has left me with many ideas and thoughts. I know that I will be having many future conversations regarding the material he covered.A four star rating for sure!"}, {"userName": "Carole", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/4269738-carole", "userReview": "I received What It Is Like To Go To War by Karl Marlantes as a Good Reads First-Reads GiveawayI was so pleased when I heard I had won this book. It took me a few days to read but that was because I needed time to let each bit I had read sink in. Some parts were harder than others but only because my heart ached for the soldiers. In my life I have heard stories from teachers, family and friends who honorably served in different branches of the military, however nothing compares to the sheer honesty he shares in this Novel. I think it is that brutal honesty that pulled me in as the reader. Much of what he conveys explains why they can’t and don’t share everything with us when they return. I can’t even begin to imagine how anyone of these brave men and woman can mentally recover after war. The book was fantastic and I would definitely recommend you take the time to not just sit and read this book but truly take it all in and absorb everything you can from it. It gave me the knowledge to, quite frankly, not say something stupid and hurtful to a veteran who has sacrificed it all for strangers. I enjoyed the writing style it was different than I normally read but in a good way. It felt as though Mr. Marlantes just invited me right into his brain. By no means are any of our minds neat, tidy and chronological, so by giving us tidbits here and there I feel it completed each topic thoroughly while also supplying just enough back information without inundating me with useless information. It read like a casual conversation. Get it, read it, and please by all means share it with your friends."}, {"userName": "Philip Virta", "userReviewDate": "Oct 26, 2011", "userURL": "http://www.goodreads.com/user/show/6133408-philip-virta", "userReview": "I appreciate Mr. Marlantes' book and how it puts the human experience of war in context. Everyone should have to read this book and get a better understanding of what we ask our soldiers to do, to commit to. Perhaps then there would be a bit more compassion and support for soldiers at home, in the field, and those just returning. For someone who has, thankfully and especially thanks to soldiers like Mr. Marlantes, never had to go to war, I appreciate the perspective he provides. His book offers a glimpse into the mind and soul of the soldier, a vision of what it's like to experience combat and live with the raw emotions and exhaustion it bring, and the difficulties soldiers face upon returning home. The book also provides insight into how we can help our soldiers readjust to life after combat, plus good suggestions for what the military could do to better serve the men and women who bear the burden of our foreign policies. I'd like to offer up a quote from Tom Hanks, \"I'm glad I didn't have to fight in any war. I'm glad I didn't have to pick up a gun. I'm glad I didn't get killed or kill somebody. I hope my kids enjoy the same lack of manhood.\" I want to further qualify that with a simple thanks to all those who served or are serving in our military that give me the freedom to live a peaceful life."}, {"userName": "Jessica", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/3019127-jessica", "userReview": "This book was tough to read, but phenomenal. I myself am a civilian, but I grew up in a military family (my father was in the Air Force) and I currently work with veterans as part of a legal clinic at my law school that represents veterans in attempting to get benefits, discharge upgrades, etc. My main client through the clinic is a Vietnam War veteran who has suffered from severe PTSD since his time in combat, and I've been on a mission to read everything I can about Vietnam, war, the military, and mental illness, in order to better understand his experiences and what he went through. I've been meaning to read Marlantes's Matterhorn for a while now, but my seminar for the clinic read an excerpt of this book for class, and I found that I just couldn't put it down so I read it first. I will definitely be reading Matterhorn soon -- Marlantes's writing is phenomenal, and this book is an incredible exploration of what it is like to go to war and what it is like to come home from war, what it is like to kill and be a target of killing, and what these experiences do to the human psyche and spirit. I would absolutely recommend it to anyone who, like myself, wants to understand the war experience.--------------------Disclosure: I won a copy of What It Is Like to Go to War from the publisher in a Goodreads First Reads giveaway."}, {"userName": "Joe", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/88202-joe", "userReview": "I was a huge fan of Marlantes' MATTERHORN, which is one of the Great War Novels, up there with NAKED AND THE DEAD, THE THINGS THEY CARRIED (which is, I know, a collection of stories), CATCH 22 and SLAUGHTERHOUSE FIVE. I admired this work of non-fiction from Marlantes and found a lot of interesting and often powerful insights into what it means to be a soldier. Most of the book is an outstanding meditation on not just war but what it's like to be a human being. The aspect of it that kept it from earning the full five stars is that , especially later on in the book, he moves into much \"new age spirituality\" that I couldn't connect with. I understand that the spiritual exercises he went through most likely helped him deal with his grief and PTSD frm his experiences in Vietnam but for the reader who did not experience that (or, me, at least), I think those sections are not as successful as most of the book. It's still an important book, I think -- but he may have had a stronger one if he had stayed away from the spirituality."}, {"userName": "Dan", "userReviewDate": "Mar 01, 2013", "userURL": "http://www.goodreads.com/user/show/381899-dan", "userReview": "If this doesn't describe what it's like to go to war I am pretty sure nothing will. Not only is it a dark rumination, a book of atonement, it is also a book of ideas of how we can help our military deal with the psychological toll that war takes on our nation's youth. I am looking forward to sinking my teeth into Matterhorn, but first I'm going to need a short break from these themes."}], "description": "From the author of the award-winning, best-selling novel Matterhorn, comes a brilliant nonfiction book about warIn 1968, at the age of twenty-three, Karl Marlantes was dropped into the highland jungle of Vietnam, an inexperienced lieutenant in command of a platoon of forty Marines who would live or die by his decisions. Marlantes survived, but like many of his brothers in arms, he has spent the last forty years dealing with his war experience. In What It Is Like to Go to War, Marlantes takes a deeply personal and candid look at what it is like to experience the ordeal of combat, critically examining how we might better prepare our soldiers for war. Marlantes weaves riveting accounts of his combat experiences with thoughtful analysis, self-examination, and his readings—from Homer to The Mahabharata to Jung. He makes it clear just how poorly prepared our nineteen-year-old warriors are for the psychological and spiritual aspects of the journey.Just as Matterhorn is already being acclaimed as acclaimed as a classic of war literature, What It Is Like to Go to War is set to become required reading for anyone—soldier or civilian—interested in this visceral and all too essential part of the human experience.", "title": "What It is Like to Go to War", "url": "http://www.goodreads.com/book/show/12281306-what-it-is-like-to-go-to-war", "average": 3.96, "cover": "https://images.gr-assets.com/books/1328309135l/12281306.jpg", "reviews": 654, "authors": [{"url": "https://www.goodreads.com/author/show/2904306.Karl_Marlantes", "name": "Karl Marlantes"}], "type": ["Nonfiction", "History", "War", "War", "Autobiography"], "outlinks": ["http://www.goodreads.com/book/show/12281306-what-it-is-like-to-go-to-war", "http://www.goodreads.com/book/show/11290708-what-it-is-like-to-go-to-war", "http://www.goodreads.com/book/show/23532826-what-it-is-like-to-go-to-war", "http://www.goodreads.com/book/show/13587777-what-it-is-like-to-go-to-war", "http://www.goodreads.com/book/show/11343021-what-it-is-like-to-go-to-war", "http://www.goodreads.com/book/show/6411016-matterhorn", "http://www.goodreads.com/book/show/36395451-deep-river", "http://www.goodreads.com/book/show/240485.Storm_of_Steel"]}