{"ratings": 5879, "userreviews": [{"userName": "Dale Harcombe", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/4800708-dale-harcombe", "userReview": "A phone call saves Russell’s life when the September 11 Twin Towers disaster strikes. At the same time it brings him bad news. His mother has died and he must go back to Kansas and decide what to do about his older brother Ben who is mentally disabled. How can Russell possible care for Ben when his work and life are in New York? The slightest change of routine can send Ben into a spin and tantrums that seem to last forever. As well as the issues of family and sibling relationships which the reader learns more about as the story goes on, there are also issues of post-traumatic stress syndrome, racism and violence. The story stats on September 15 2001 and then goes back to the days leading up to that till it eventually comes back to September 15. But there are also chapters that go back to incidents from Russell’s and Ben’s childhood. This are all clearly labelled so there is no confusion. I was hooked into this story from the first page and felt for Russell, who seemed to have had more than his share or hard times in his life. Some of the incidents with Russell and Ben are amusing. Others are heartbreaking. Guilt plays a part in this story, even though sometimes that guilt is unwarranted. This is also a story of romance and love that can be found unexpectedly. But it is also a story of violence, distrust and hate. As a reader I had moments of laughter, tears and anger, which shows how involved I was with the characters. I did think the ending seemed a bit rushed through and a bit neatly tied up. But, all in all, I found this a captivating story, with great characters and one that deals with issues of our society. Having read several of this author's book, I really enjoy this author's work. She gets to the heart of issues people have."}, {"userName": "Rebecca McNutt", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Painfully sad and yet hopeful and inspiring, this novel connects small family moments with history to share the important message to never take your loved ones for granted."}, {"userName": "Ruth", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/335159-ruth", "userReview": "This book is written serviceably, but so simplistically that I kept thinking perhaps I’d strayed into young adult territory. Russell misses being killed on 9/11 by being late for work because he gets a phone call that his mother died, and he must come and take care of his brain-damaged brother. Back in Nowheresville, where he definitely doesn’t want to be he falls in love with an Egyptian girl who has 9/11 troubles of her own. Everything is just too neat and tidy in this story, especially the nice big pink ribbon which ties everything up with an improbable happy ending for all. I did read it all the way through, just to see how everything turned out, and it was a fun read, but this is not great literature by a long shot."}, {"userName": "Ivana", "userReviewDate": "Mar 01, 2012", "userURL": "http://www.goodreads.com/user/show/2893717-ivana", "userReview": "...and the award for the amount of humanity woven into a book goes to Catherine Ryan Hyde. Based on my experience with the previous and first-to-me book by this author, Don't Let Me Go, I've had only a faint idea of what to expect: \"small\" people waging their everyday battles, love and devotion, strength of human spirit and generosity in abundance. Our heroes in When You Were Older are Russell, who worked in one of the towers and thought he had left his small town far behind; his brother Ben who sustained a brain damage as child and is incapable of living alone after mother's death; Anat and her father who, being of Egyptian origin, become targets for people to take out their frustrations toward everything Middle Eastern; their neighbors and friends, some of them sent to war never to come back.Catherine looks at a fistful of people in a small town in the aftermath of the 9/11 tragedy and describes what probably went through people's minds, wherever they were in the world in that moment. It's a complex tale of tolerance, guilt, forgiving and love. When everything changes in a matter of minutes, Russell must deal with the loss of his new life that burned down in the debris of the towers and return to a life he ran away from. This book is about trying to make sense and reason with what happened while confronted with another life-changing tragedy. The author does it with much grace and warmth and bit by bit restores your faith in humanity.Maybe in all that Russell comes out as a bit too perfect. So does the rest of the cast. There's a happy ending after all the obstacles have been heroically overcome. But in this case, it works. It's not a book to provoke hate, but to promote optimism. Read it when you need something uplifting, a moral boost, and a book that makes you happy.The moment I received the ARC, I took a peek at the first page. I didn't stop until I finished the whole book in one day. Parting from the book, even for a few minutes was nearly a torture, filled with the yearning to be back. You know, that fantastic feeling that you only get from great books. As soon as I finished it, I had the need to start again and I'll definitely reread it some time soon. This is my new feel-good book."}, {"userName": "Lindsay", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/2844056-lindsay", "userReview": "I loved this story. It’s a wonderful, beautifully written tale. I found it compelling from start to finish, and read it very quickly as I couldn’t bear to wait to discover what happened. The author has created some lovely characters in Russell and Anat. September 11th 2001 changed many lives. Russell was running late for work at the advertising firm where he was employed, on the 104th floor of the World Trade Centre, New York. Just as he was leaving his apartment, the telephone rang, and after debating it he decided to answer. Upon finding out that his mother has suddenly passed away, and with her gone his brother Ben now has no one but Russell as a carer, he never goes in to work that day. And because of receiving this tragic news in that split second, he lives. He faces a long journey – with no flights because of the terrible events in NYC – hitch hiking his way back to Norville, Kansas, the place he regards as and refers to as ‘Nowhere-ville’, and thought he had escaped for good when he left six years ago aged eighteen. He can’t bring himself to think of it as home anymore. The reactions from the various people he meets on his journey home give us an initial feeling of the shock and response by the man on the street to the enormous events in New York. Further reaction will be evident when Russell arrives home. Everyone in Norville knew Russell as Rusty, and they all know and love his brother Ben, who, although older than Russell, is not capable of living alone, and is reliant on extensive support in his everyday tasks such as getting to his job as a bag packer at the grocery store in the town, getting to bed and up on time. (His dependence is due to an incident which is described in the novel, which I won’t spoil here.)The bulk of the novel is concerned with what happens when Russell is back where he grew up, and how he will possibly come to terms with, and move forward with his life as it is now. He finds himself drawn to the local bakery, run by a young woman named Anat and her father Nazir, and Russell forms a friendship and demonstrates a kindness towards them during a time of unease and unwarranted prejudice shown by some in the town. A few old acquaintances from his school days are now setting off to fight in Afghanistan. Russell has little in common with these men anymore, but despite his feelings about a war, he wishes them well. Russell has to deal with an enormous amount of stress; he has suddenly lost his mother, he finds himself as sole carer for his brother Ben, he has lost his job and all his colleagues at the advertising firm bar one other survivor, in an incident that he witnessed first-hand from the window of his apartment, and he is back in the small town he thought he had left for good. On top of this, he develops a friendship that causes others to judge him harshly, and feels he may be falling in love, but none of it will be easy.This is a lovely read. The confusion, challenges and stress that Russell faces are very well detailed and effectively portrayed. The first person narration means we see right to the heart of the matters in hand through Russell’s eyes; the pain, the struggles, the hope. He is a remarkable character, he has some impossible things to deal with but that is how life can be, and I liked that. At times he is close to breaking but he keeps going. In fact to me the characters are all so well realised that I could picture them. In my mind I could see Russell and Anat in the bakery chatting over doughnuts, getting to know one other, being a friend to each other. Additionally the author perceptively illustrates how enormous events in the world can filter down and influence and affect one small town and its population in various ways. My favourite novel yet by this author!"}, {"userName": "Brea Brown", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/6292364-brea-brown", "userReview": "I'm still reeling after reading this book. I felt so protective of each of the main characters that by the time I got to the climax of the book, I was simultaneously dreading and anticipating the turning of each page, unsure what was going to happen next. Beautifully written and conceptualized. I just couldn't read it fast enough."}, {"userName": "Susan (The Book Bag)", "userReviewDate": "Dec 16, 2012", "userURL": "http://www.goodreads.com/user/show/1516073-susan-the-book-bag", "userReview": "I read another one of Catherine's book a while back (Don't Let Me Go) and I loved it. I wasn't really expecting to but I love when that happens, don't you?Well, here is her newest book, When You Were Older - and I have to say, I think I love this one even more! I started reading it over the weekend, when I still had so much Christmas stuff to do and I did not want to put it down. But I do have my priorities ~ and my top priority last weekend was to get to the end of this story!I immediately loved Russell and empathized with him in his struggle to get home after 9/11. That morning, he was running behind schedule and was still home when he gets a phone call telling him that his mother has died and that he needs to come home to take over the care of his brother. If he hadn't been home to take that call, he would have been in one of the Towers when it was hit and he would have died along with all of his coworkers. He just wants to get home, take care of things and then get back to his life.Well ...... things are not that easy.I also loved this story because it took me back to the time of 9/11 and made me remember what a sad, crazy time it was. It was also a wonderful time for the United States because we all came together and became more patriotic. When You Were Older reminded me also that this time was not easy for everyone. People were shunned and hurt. And life goes on. And all we want is to be happy. This story is fabulous and different from anything I have read in quite a while. Catherine is a wonderful writer and her stories are so enjoyable to read and so easy to get lost in. I can't wait to read more of her stories! She is my new 'must-read-everything-she-writes' author! Thank you Catherine, for another wonderful story!"}, {"userName": "Toni", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/1521940-toni", "userReview": "I really wanted to like this book better than I did. It held such promise . It had some wonderful ideas that are good starting points for discussion . Some examples: Can a mother's love reach across time and space to essentially save you ? What is a person's responsibility to a family member,should their needs eclipse yours? Does brain trauma change a personality? What does our reaction to terrorism say about us? How much can we \"outgrow\" our childhood? How do we survive surviving when we should have died? However, even with all of this, I had too many issues with the book to rate it higher. For example: I never connected with Rusty. I agreed with him most of the time so that wasn't the issue. Somethings just bothered me too much about him .For one, his relationship with his mother which did not make sense to me ,at all. He never saw her in 6 years and seemed to barely interact with her.Nothing in his flashbacks explained that. Second, the writer made Ben so-ooo unlikeable as a child (jealousy and sibling rivalry only go so far) and then his personality totally changes after the brain trauma. I believe that the post trauma Ben was written believably and with sensitivity and I liked Rusty and Ben's relationship; however, there was just too much difference between the two Bens for me not to question it. So , I think that book is worth reading and thought-provoking for anyone looking for such a book . I just did not feel that it was as good as it could have been ( which is quite arrogant of this non- writer) but that is my opinion."}, {"userName": "Agnes (BeaderBubbe)", "userReviewDate": "Dec 19, 2015", "userURL": "http://www.goodreads.com/user/show/3265140-agnes-beaderbubbe", "userReview": "Gripping storyBuddy..... Brothers.... Tragedy.... The aftermath of 911. Having lived through it myself, I found this story very inspiring that life continues no matter what trials and tragedies we encounter. Everything happens for a reason. Why Russell didn't go to work the day the Towers fell has no answer other than he was still needed on earth would to take care of Ben, his disabled brother after their mom passed away. The story continues to show what Russell goes through to o what he has to do to find happiness. Well written story of love and what family means."}, {"userName": "Jenny", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/8788226-jenny", "userReview": "What a story. Beautiful, hopeful, but also at times heartbreaking. If you’ve ever been at the bottom, perhaps this book will remind you that it’s possible to go up again, who matters, and how to get through it."}, {"userName": "Anne", "userReviewDate": "Dec 24, 2011", "userURL": "http://www.goodreads.com/user/show/546484-anne", "userReview": "When You Were Older is set in the months after 9/11 - September 2001 and is the story of two brothers and their struggle to survive and thrive in what has become a strange new world for them. Russell is the younger brother, he bailed out of the small sleepy Kansas town that he was brought up in when he was just out of school. Living in New York, working in the World Trade Centre, his life couldn't be more different to that of his brother Ben. Ben still lives in that small town, he is mentally disabled and lives his life to a set routine, day in, day out. Russell receives the call to tell him that his mother has died on the morning of 11 September, the phone call makes him late for work, as he rushes about trying to make up lost time, he glances out of the window and sees smoke pouring from one of the towers of the World Trade Centre. It is at that moment that his life changes forever.Russell goes back to Kansas. Ben needs to be cared for, but Ben doesn't even understand that their Mom is dead.This is a truly moving story, the writing is remarkable and enchants the reader. Russell has his faults, and Ben can be incredibly frustrating but Catherine Ryan-Hyde paints a picture of siblings that love and care for each other. It is especially poignant when the reader learns just how Ben came to be brain damaged, and how that incident changed the balance of their relationship.The character of Anat; an Eygptian girl who works in a local bakery, and helps Russell through this confusing and emotional time is beautifully drawn.This is a love story, and a story of family dynamics. It is a story about people's reactions to life-changing events, how many people feel the need to have someone to blame. It's about injustices and hate, but also about friendship and loyalty.A very satisfying read that will stay in my mind for quite a while."}, {"userName": "Marianne Wallace", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/3139649-marianne-wallace", "userReview": "Compelling, emotional, causes you to examine how you would react in similar circumstances.Catherine Ryan Hyde's characters are created with a transparency that is almost uncomfortable. Her stories often deal with tough subjects head-on including, in When You Were Older, the bittersweet life of Russell, a young New York-area man who, but for the phone call telling him his mother died, might have been at work in the World Trade Center on 9/11 when the rest of his colleagues died.He hitchhikes (all planes are grounded and car-rental agencies have no more cars) back to the small Kansas boyhood town he couldn't wait to escape 6 years earlier to deal with the after-affairs of his mother's death and care for his brain-damaged older brother. In the weeks that follow, he must come to terms with racial backlash against those appearing Middle-Eastern, a brother that does not or cannot accept his mother's death, an uncertain future and questions about what he held true and dear in his life. When You Were Older takes us back to the days and weeks that followed the World Trade Center collapse, a time of impetuous reaction and the painful realization that life is ever uncertain."}, {"userName": "Theresa", "userReviewDate": "Nov 14, 2014", "userURL": "http://www.goodreads.com/user/show/7119585-theresa", "userReview": "An enjoyable read with some thoughtful plotlines about the tensions in smalltown US immediately post 9/11, tied up with other family drama. The kind of book you could read in one sitting, if only you hadn't started it after dinner on a school night."}, {"userName": "Vannetta Chapman", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/3927146-vannetta-chapman", "userReview": "I honestly can't remember a Catherine Ryan Hyde book that I didn't like.This one centers around a young man who is coping with family issues in the wake of 9-11. It's a very good read and very balanced overall. Note: For my Christian fiction readers, this one is clean with no offensive language (that I can remember) and no adult scenes."}, {"userName": "Marleen", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/1616365-marleen", "userReview": "Another genuinely heartfelt read by Catherine Ryan Hyde. In each of her books, this author succeeds in giving us authentic characters like I’ve seldom experienced before. Simple, ordinary people who are going through something; and you instantly relate. You want to know more. And you feel better after having read it. I tell you. Ryan Hyde has this unique talent, and she writes like no other about those ordinary people. And she does it masterfully.When You Were Older is a novel about a survivor of the 9/11 destruction of the Twin Towers; and it’s probably one of the best books written by this amazingly gifted writer. Catherine Ryan Hyde writes with such an emotional fluency that is breathtaking in its simplicity and depth. When You Were Older might just have become my favorite book by this author. I can't figure out how she does it. Once I was in the story I started caring immensely about the people and events she created and described. Russell, who works at a big advertising agency on the 104th floor of one of the Twin towers in NYC, had escaped his small-town life (in Kansas), and his family for six years now. On September 11th, on his way out the door to a meeting at his place of work, he answers a phone call. An old neighbor calls him to tell him his mom has died suddenly, leaving his disabled older brother with no one to take care of him. Russell makes arrangements to fly out to Kansas, and then sees, through his living room window, as his place of work is destroyed by the planes slicing in. From that point on his entire life goes into turmoil and chaos, even though he realizes that that phone call saved his life. How he survives in the following days and who he meets along the way are metaphors for the aftermath of the Twin Towers tragedy. The book is an emotional roller-coaster: it tackles subjects as brotherly love, grief, responsibility, cultural adaptation and tolerance. It will be hard to pick my next read; this was so unexpectedly excellent, poignant and engrossing, it’ll stay with me for a long time."}, {"userName": "Nenette", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/2156661-nenette", "userReview": "Russell was already running late, when he got the news that his mother died...for a while he was relieved since he wasn't late anymore; then he saw the planes hit the towers from his Jersey City apartment window. What follows was not so much an effect of the big news of that day as much as that of his mother's death. In a span of just three months or so, life as he knew it \"turned on a dime\", as was mentioned three times in the story....it didn't exactly turn for the worse, it \"turned on a dime\".As would be expected in a 9-11 story, the element of a screwed-up sense of patriotism (i.e., hatred for anything Arabic or Middle Eastern) was there. Russell experienced this first hand in all of those three months hence, when all he set out to do was just take care of his brother.The story would have played out just as well even without the 9-11 factor because of its unique central theme (siblings' love), but a major conflict would have taken its place. I admit I was left a little bit wanting at the end, though a happy ever after was already implied...Just the same, a sequel would probably be great."}, {"userName": "Holly Weiss", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/3455463-holly-weiss", "userReview": "My emotions were rocked by this book. I love this author. Her themes in this post 9/11 story is resetting your life and dealing with post traumatic stress disorder If 9/11/2001 has personal implications for you, this may not be the book for you.Unlike other reviewers, I found the personality of Ben before and after the accident perfectly acceptable. He returned to his true self after the accident.The book appealed to me on a very personal level. Russell, the main character, has doors open and close on every turn. He has a chance for love and happiness but circumstances always seem to impede him. We all experience change in our lives. The book was meaningful to me because I have had so many changed in such a short period of time. Sometimes you just have to push the reset button and go on.The only reason I didn't award 5 stars...where was the lawyer when Ben got into trouble two-thirds of the way through the book? Otherwise, another fabulous book from Ms. Hyde who understands using words sparingly and dipping deep into emotions."}, {"userName": "Susan", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "Russell thinks he has finished with the small town in Kansas he has grown up in. Living in New York, he has a great job in advertising and works in the World Trade Center. Late for work one morning he almost doesn't pause to answer the phone, but while he hears that his mother has died and someone has to return to look after his brain damaged brother Ben, a plane flies into the World Trade Center and the world is changed forever. Returning to Norville (or nowhere-ville as Russell refers to it), he struggles with his feelings and with coping with Ben. Then he meets Anat, the beautiful Egyptian woman who works at her fathers bakery. This is an important novel, a plea for tolerance shown through personal circumstances and tragedy. If you like Jodi Picoult I feel sure you will also enjoy this author."}, {"userName": "Book-shelf Shelf", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/3544349-book-shelf-shelf", "userReview": "Bloody brilliant!!! Because I have read 'Don't let me go' I know this was going to be a good read...or should I say I presumed, I hadn't quite known how good a read. There is so much packed into this book that it is hard to physically put the book down. The story of two brothers touches on the subject of terrorism, racist, duty, family, patriotism, love, in-fact so many emotions and heartbreaking subjects you couldn't name them all. The one thing that Catherine touches on is the Twin Tower Tragedy. A very brave move as it is still a subject that people are very tender about, but it is done in a way that you believe Russell was there, all his feelings and those of the people he meets. Brilliantly done and I would certainly recommend every one gets at least one of Catherine's books, if not all of them as the story's never tire."}, {"userName": "CatherineMorland", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/15174261-catherinemorland", "userReview": "An absolute beautiful story. If you want a happy rainbows-and-unicorns novel, this isn't for you. The events of 9/11 play a big role, so you can imagine the sadness. I was a child during that time, but When You Were Older brought back the memories for me, the tragic ones of loved ones lost, but also the way friends and families and strangers stood together. This book explored every emotion and I found myself kinda gasping at certain parts of the story and going, \"Nooo....\" That's what happens when you get attached to characters! ;)For more conservative readers (most people who follow my reviews are Christian, which is why I'm adding the disclaimer), there was quite a bit of language."}, {"userName": "Cathe Olson", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/2192498-cathe-olson", "userReview": "Catherine Ryan Hyde is so great at creating characters that pull you right into the story--and that keep you invested until the last page. 'When You Were Older' was such a sweet, enyoyable story that I really just wanted to stay curled up in my chair drinking cups of tea all day to read it . . . which is more or less what I did. I loved getting to know Russell, as well as the before and after Ben. 'When You Were Older' is Just one of those books that you can just escape into . . . the perfect weekend read!"}, {"userName": "Dawn", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/1383959-dawn", "userReview": "My first book by this author, but definitely not my last. The story takes place in the first few days and months after 9/11. An emotional read with endearing characters. The story brings back the feelings of confusion, anxiety, tension and uncertainty that many felt after that tragic day in America. The only thing I disliked was where the story ended. I would like to have read more of Russell & Anat's story."}, {"userName": "Barbara White", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/8368378-barbara-white", "userReview": "On 9/11 Russell was heading to work in the World Trade Center when he got the call that saved, but upended, his life: his mother was dead and he had to return to small town nowheresville to take care of his brain-damaged older brother. The novel pulls at every heartstring. Yes, it’s a 9/11 story told through the eyes and emotions of a survivor—one of only two from his advertising agency—but it’s also a story about love and survival in one spectacularly messed-up family."}, {"userName": "Carole", "userReviewDate": "Dec 05, 2012", "userURL": "http://www.goodreads.com/user/show/7630646-carole", "userReview": "This is the 3rd book I've read by Catherine Ryan Hyde. I've loved them all! She has a wonderful writing style, that really dives into getting to know the characters."}, {"userName": "Lo", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/6376052-lo", "userReview": "Pretty depressing book overall, some interesting emotional entanglements but felt contrived at times."}, {"userName": "Nikki-ann", "userReviewDate": "Mar 11, 2012", "userURL": "http://www.goodreads.com/user/show/3099305-nikki-ann", "userReview": "Russell Ammiano is rushing to get ready and out through the door to go to work on September 11th 2011 when a phone call saves his life. As tragedy strikes New York, Russell must rush home to Kansas to take care of his brother, Ben.Russell’s mother has died, turning his life upside-down. Ben is mentally disabled and now needs Russell’s help in order to function. Any change to routine is unacceptable and upsets Ben a great deal. Will Russell cope?When You Were Older is a moving story set in a time when America was on edge and afraid. The unimaginable events of September 11th, combined with the death of a mother and the needs of a young man, set the scene in this thought-provoking novel.As I’ve come to expect with books from Catherine Ryan Hyde, this story deals with issues that aren’t always easy to deal with - A young man brain-damaged and unable to cope with everyday life on his own; his brother who has drop everything to look after him; interracial and interfaith relationships; then there’s the after-effects of such a catastrophic event that changed the whole mood and rationalism of an entire nation.When You Were Older is a story of love. Not just of Russell’s love for Anat who works at the local bakery and serves him coffee & donuts, but of the love of two siblings who could barely be more different.I fell in love with the two main characters of the book and will miss them now it’s finished. Russell’s whole life is turned upside down and things just seem to go from bad to worse for him. He could take the easy way out, but instead he gains the strength to take on responsibilities beyond many people and to help those in need, despite struggling himself. Then there’s Ben... Ben isn’t the easiest person to live with and we learn, through a look back at their childhood, that he wasn’t always the nicest person either. However, Ben’s love for his little brother shines through and we learn that even when somebody is bad, there’s a nice person fighting to get out.I read When You Were Older in a couple of sittings which had me reading late into the night as I didn’t want to put it down. The story is well paced and had me wanting to know what was going to happen next. Catherine Ryan Hyde has certainly captured the atmosphere of post-September 11th, small town America in which emotions are volatile and frightened, ignorant people turn on and assume immigrant people to be something they are not.When You Were Older will stir emotions and I think it will be one of those stories that stay with the reader for a while. I thoroughly enjoyed the book and would definitely recommend it to other readers. Yet again, Catherine Ryan Hyde has raised the bar!WARNING: When You Were Older will have you craving donuts! I’m wheat intolerant and shouldn’t go near donuts, but this book had me craving them. Just a plain sugary donut would have done... I have a feeling donut sales will rise during the first week of release!"}, {"userName": "Samantha", "userReviewDate": "Jan 23, 2013", "userURL": "http://www.goodreads.com/user/show/1380067-samantha", "userReview": "A moving story about a man who might've been killed in the attacks on the Twin Towers on September 11th 2001 if not for the fateful phone call that his mother has passed away suddenly and he must return to his home town.The story is told both in the past and present and reflects on the lifetime of tragedies that have befallen a family. The main character, Russell, struggles with caring for his older brother who has limited capabilities due to a head injury when he was a teenager and losing the life he created for himself in New York.A bright spot in Russell's life is the young baker named Anat who along with her father runs a bakery in town. He comes to rely on her as a friend and finds himself falling for her despite the strict customs of courtship in her culture.Following the national tragedy, the bakery has been targeted by residents of the town who dislike/distrust foreigners. In a terrible accident, Anat is injured and it looks like Russell's brother may be to blame.Hyde writes a moving novel about losing everything and the process of rebuilding. At the heart of it all are two brothers who must find a new way to survive. Hyde's characterization is top notch and her plot twists are interesting and keep the story moving at a can't-put-it-down pace."}, {"userName": "Natalie", "userReviewDate": "Jan 13, 2012", "userURL": "http://www.goodreads.com/user/show/1731375-natalie", "userReview": "I really didn't want this book to end, and actually, I should have just not finished it, as after loving the book, I did find the ending rather rushed, and although it ended in a way I loved, I couldn't help being a tad disappointed, but not enough to give it less than 5 stars though, as I think a chunk of the disappointment was in that it was over!At the beginning, I was set to dislike Russell, after he'd not returned home in so long, and was so emphatic about never wanting to have gone back, I wasn't prepared to like him as much as I did! I really thought he was going to be quite an unlikeable character, but he wasn't at all, he was lovely, and you just couldn't help feeling for him, with all that he ends up going through! I did find it really hard reading the 9/11 sections, so if you're at all sensitive to that (let's face it, there's not many who aren't!) then be prepared for some serious choking up! I've so far avoided most books/films about 9/11, and I might have avoided this one had I realised before reading it was so heavily centred on it, but I'm so glad I didn't, it's such a sensitive depiction of the events!Brilliant book, highly recommended!"}, {"userName": "Stella Wenny", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/24629412-stella-wenny", "userReview": "There are many things I love about this book. Russell, the main character, of course, I can't help loving all Catherine Ryan Hyde's characters. They are usually just ordinary people who has this ability to stay strong even when their life has just ruined. They looked strong but if you really know them deeper, you'll know that behind those walls, they're still weak and needed saving too.In summary I think this book is pretty much about saving each other—yes, the mother saves Russell from the 11/9/01, Russell saves Ben who can't accept their mother's death, Ben saves Russell who had a hard time with life after the 11/9/01, Russell saves Anat from ethnicity issue, Anat saves Russell by loving him. I think a book about people saving each other is really beautiful and heartwarming.Also, Hyde is very talented at weaving an engaging story with beautiful yet casual prose that it's really hard for me to put down this book. I've read four books by Hyde and I think this one got the best plot story ever."}, {"userName": "Phoenix Carvelli", "userReviewDate": "Sep 19, 2012", "userURL": "http://www.goodreads.com/user/show/7217771-phoenix-carvelli", "userReview": "She has done it again! The author has captured the basic emotions and fears of real people and has transferred them into her work! The raw emotion that Russell feels as his life changes on September 11, 2001, brings readers into a world closer than they may have been on that fateful day. As the days progress, the reader experiences his frustrations with a responsibility he is unable to ignore but must learn to live with again. Russell even finds a silver lining to the dark clouds storming in his life. The reader is taken on a journey from New York to Kansas in 2001 and back into the days of Russell's youth.This is an emotional read, in that it takes the reader back to New York on September 11, 2001, to relive the horrors of the day and the prejudices and fears of some in the days that followed. Most of all, this is a story of family.Book was won from a contest on the author's website."}], "description": "I was doing my best to get out the door. And then the phone rang.\nI almost let it go.\nNew York, September 11th 2001Russell Ammiano is rushing to work when he gets a phone call that saves his life. As the city he loves is hit by unimaginable tragedy, Russell must turn his back and hurry home to Kansas.Kansas, September 14th 2001Ben Ammiano is mentally disabled, and a creature of habit. Any change to his routine sends him into a spin. But now his estranged brother has reappeared, and Ben's simple, ordered world has turned upside down.In a story as heartbreaking as it is uplifting, two brothers must bury their pasts and learn from each other, if they are to survive.", "title": "When You Were Older", "url": "https://www.goodreads.com/book/show/13279833-when-you-were-older", "average": 4.15, "cover": "https://images.gr-assets.com/books/1327437974l/13279833.jpg", "reviews": 470, "authors": [{"url": "https://www.goodreads.com/author/show/126447.Catherine_Ryan_Hyde", "name": "Catherine Ryan Hyde"}], "type": ["Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/13279833-when-you-were-older", "http://www.goodreads.com/book/show/16172578-when-you-were-older", "http://www.goodreads.com/book/show/20080847-when-you-were-older", "http://www.goodreads.com/book/show/215631.Pay_It_Forward", "http://www.goodreads.com/book/show/6780660-when-i-found-you", "http://www.goodreads.com/book/show/19355355-take-me-with-you", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/33389838-allie-and-bea"]}