{"ratings": 99, "userreviews": [{"userName": "Am4u ❀ ~ AprilMarie4u ~ ❀ ", "userReviewDate": "Aug 11, 2013", "userURL": "http://www.goodreads.com/user/show/21208173-am4u-aprilmarie4u", "userReview": "I'd recommend this book to anyone who enjoys reading religious testimonies. This book is basically an autobiography about the author's, Dabney Hedegard, personal journey with her faith while going through numerous medical problems. The author does also include her own personal story with common real life struggles that many people could relate to, like marriage & financial problems. Overall this book is a well written, fast, & easy read that will have your emotions all over the place. **I received this book for free through Goodreads First Reads.This review is my own honest thoughts & opinions. **"}, {"userName": "Orbs n Rings", "userReviewDate": "Jul 01, 2013", "userURL": "http://www.goodreads.com/user/show/4694420-orbs-n-rings", "userReview": "More than a story about miracles. An incredible journey of faith.When God Intervenes is an amazing memoir and the most inspirational story I have ever come across in my years of reading memoirs. The nightmare for Dabney Hedegard begins while pregnant with her first child at the age of 25. Now diagnosed with Hodgkins Lymphoma Dabney has to decide whether to save herself or her unborn child. In this powerful and moving memoir Dabney takes the reader through her life as she battles not only with cancer but with a multitude of other life threatening complications for ten years. While fighting for her life and the life of her child Dabney experiences profound moments where she is teetering on the brink of life or death. Her treatments are long and intense, draining her strength as well as her bank account. Being a newlywed Dabney finds that she and her husband Jason are slowing running out of resources to pay their bills. But through faith and the power of God Dabney finds the strength to continue on her journey, fight for her life and the life of her unborn child.This story is gripping, moves along quickly. I found myself not being able to put the book down and reading most of the book through one night. Dabney's story has enlightened me yet at the same time humbled me. I found myself feeling angry, sad, terrified and other times happy, such a mix of emotions, sometimes all in one chapter. Dabney's story is more than just a story about miracles, plain and simple it is about the power of God. Even though I myself experienced many miracles during the pregnancy with my own son, my story is a walk in the park in comparison to Dabney's. And as a reader of this incredible story, I was reminded of that power and my own journey while being left with a deeper understanding of how that power of faith and prayer can overcome anything."}, {"userName": "Ann", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/8014523-ann", "userReview": "Somehow reading true stories gives me the impression that my reading is more significant or productive. This type of reading provides me with both the benefit of experience and the sentiments, which I am sometimes left with after having read such sort of books.In general, after reading the back cover as reference, you sort of think you know or guessed what your in for. Actually, this is not quite what you will be getting in this case. Hedegard writes brilliantly and honestly, all the while going straight to the point. Her writing style is remarkably transparent, simple yet elegant. She graciously opens her tumultuous life to us over a period of 10 years. It’s as if we are riding a roller coaster with her. You will be in need of a tissue, that’s guarantied!October 28, 1988 – This is where we start our journey of faith through the eyes of an extraordinary couple! That day Dabney learns she has cancer. She has an eight-inch mass in her chest, about the size of a football; which is causing her pain and difficulty to breath. Being pregnant is complicating things for the treatments of chemotherapy…she is now in her sixth week of pregnancy and must make a choice about her treatments. So, the big questions is asked: Will she risk her life and continue to suffer without the treatments for as long as possible, while the cancer continues to do its damage for the sake of protecting her child or will she..?From there on everything seems to go down into a spiral, tragedy after tragedy.Despite everything, we see them growing spiritually, being rooted and affirmed more every day, overcoming ordeal after ordeal. I appreciate enormously the way Dabney was open from the very start about her relationship with God. Neither her nor her husband really were consecrated at first to God, and she doesn’t presume otherwise. This I believe makes their testimony even more powerful, genuine, truthful, and inspiring. Since we are able to see the work of the Holy Spirit in their lives. It is Him who fortified their faith through their trials over time. In reading her memoir, we clearly see their faith being built up as the trials come one after the other, along with their consecration in God. The Lord uses her husband Jason, who helps and encourages her enormously. He is extremely inspiring and has an unshakeable faith in God. What a marvelous godly man for his wife!I could write a lot more things, but I don’t want to sell the “punch”! Yet I do want to say that this book is a book of faith, courage, confidence, love, and dependence on God. Which makes us first see in priority the work of God: His work in their lives.It’s a marvelous testimony of God’s work in the life of those who chose to have confidence and depend on Him!A personal note to the author:“Thank you for giving Him the glory and for having the faith to walk in His paths that He had prepared for you to walk through. Despite all your many tragedies, you are an inspiration because you both kept your eyes on the only one who could give you hope: God. I loved reading your book and I was greatly encouraged by your faith”.Ann L Beaulieu* I have received a free e-book of \"When God Intervenes\" by Tyndale Publishers. However I am under no obligation to write a positive review. These are entirely my own personal opinions and thoughts expressed according to my own discernment."}, {"userName": "Hilary", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/21604798-hilary", "userReview": "When God Intervenes by Dabney Hedegard is an absolutely amazing testimony of one woman’s triumph over the death-sentence placed upon her by multiple diagnoses of cancer and other insurmountable health issues. I found myself completely absorbed by the end of the first page. So much so, I read it straight through in one sitting, sometimes crying, sometimes rejoicing out loud as I saw the Hand of God revealed in one spunky little lady’s life.The testimony of God’s faithfulness in the midst of devastating odds is the theme of this life story. Diagnosed with cancer, and growing a large tumor in her lung during her first trimester of pregnancy with her first baby, Dabney and Jason are faced with an incredible decision. What I love about this book is just how real Dabney communicates every decision they had to face. And they had to face some MAJOR ones. From the start, they took their burdens to the Lord together. The peace she describes that attended them as they decided to keep the baby and put off the chemo treatment as long as possible is beautiful. Just when I found myself cheering and crying as Madison is born and Dabney is declared cancer-free, she receives a phone call that guts her. The cancer has returned.I won’t recount every trial and victory this dear couple faces – you need to read the book. I will say that I could not put this down, and already I have several friends I would highly recommend it to. Cancer, infertility, depression, surrender to God’s will, adoption, financial crisis, sickness and long-term hospitalization - all of these issues are what the Hedegard family faces. These (and more) are also wonderfully shown to be completely under God’s control. His wonder-working power are put on display in this incredible testimony. Thank you, Dabney and Jason, for this incredibly personal look into your victories. You have encouraged my heart and you have made our Lord look really good. HIGHLY RECOMMENDED!!I received a free e-book copy of this book from Tyndale Publishers in exchange for an honest review."}, {"userName": "Kathryn Svendsen", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/16178383-kathryn-svendsen", "userReview": "This was an amazing book about an amazing journey. Imagine finding out when you are six weeks pregnant that you have an eight-inch tumour (Hodgekins lymphoma) inside your chest. You have to make a decision about whether to abort the child and begin treatment right away, or wait until the baby is born. In the meantime, the tumour could kill you. That was the choice given to Dabney Hedegard.This book was a well-written chronicle of the ten-year long journey that God took Dabney on. She should have died 4 times. But God intervened and did what man could not do. He kept her alive. She has had so many miracles in her life, including each of her children. After the chemotherapy for the lymphoma, Dabney was found to be sterile from the damage of the medications. But she got pregnant again, and more than once (each time with the doctors declaring that it was not possible) – proving that God does intervene in our lives.Her story is one of encouragement, faith, hope and healing. God’s hand in Dabney’s life is evident. It would be hard to argue His existence after reading this book. This is one of those books where the author is able to make you feel as though you are right there with alongside them. This is one of the best autobiographies I have ever read!I give this book 5 stars!"}, {"userName": "Blessedmomfxs", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/4832228-blessedmomfxs", "userReview": "Dabney Hedegard has an amazing story. She defied death again and again, and recognized that God’s providential hand was instrumental in the miraculous events. Most people in Dabney’s situation would be shaking their fist at God, asking “Why me?” and having a royal pity party. She was diagnosed with Hodgkins when she was only 25 years old -- and also SIX WEEKS PREGNANT -- and her daunting medical trials were only just beginning. Dabney’s story is rich with details. As an RN, I cringe when I read most books with medical details. They are notoriously inaccurate. Dabney’s book was well researched and the medical details were consistent with the situations presented. Dabney’s husband writes a powerful epilogue to Dabney’s story. He expresses incredible humility as he explains how watching Dabney suffer bravely caused him to love and cherish her more. Truly, Dabney has changed many lives by not just enduring her suffering, but by emerging stronger and with a rich testimony of the power of our Heavenly Father."}, {"userName": "C.E. Hart", "userReviewDate": "Jul 05, 2013", "userURL": "http://www.goodreads.com/user/show/4933643-c-e-hart", "userReview": "Wow. This truly is a can’t-put-it-down book! The first page sucked me in, turning pages as quickly as possible to see what happened next. It took me through a myriad of emotions, and made me reflect on my own life.The first chapter, dealing with Dabney’s symptoms and diagnosis is breathtaking! I put myself in her place, in her life, and making the difficult decisions she had to make. Don’t ever doubt there is power in prayer. Never ever. I really enjoyed this book, not only for the story, but for the impact it made on my spiritual life. A powerful read. Highly recommended—especially if you know someone going through difficult times."}, {"userName": "Emanuela", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/6051612-emanuela", "userReview": "Ce e mai minunat decat modul in care Dumnezeu intervine si Slava Lui care`o descopera celor ce`L cauta. Mare Dumnezeu avem! What`s more wonderful than the way God intervenes and His Glory that He reveals to those who search for Him. What a Great God we have!"}, {"userName": "Melanie", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/11675063-melanie", "userReview": "This book isn't bad, I just really think the author would have benefitted from collaborating with a more experienced author. The overall story is pretty amazing and inspiring, it's a shame because told well, this could've been an amazing book."}, {"userName": "Yiya", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/15856908-yiya", "userReview": "When Dabney and Jason thought that their marriage would fall apart, they had pretty concerning and happy news: growing in Dabney’s body, there were a tumor and a baby… The diagnosis kicks off a rollercoaster of events so drastic that often seem impossible to bear; so much pain and hope mixed together and the story of a woman who refused to give up and chose to grow closer to God along with her husband, despite the most dreadful and challenging circumstances. In a nutshell, this book is Dabney’s memoir of ten years in and out of life-threatening episodes and her personal struggle with financial crisis, infertility, long-term hospitalization, no house, adoption and even social rejection. I must say that I have been having issues completing this review. I just cannot seem to find the right words to describe the amazing way in which God intervened in Dabney’s life. Dabney went from a person who liked control and frequently sought other people's approval to complete surrender and freedom. It all started when a woman told her: \"...there's nothing you can do to change your circumstances,\" she said. \"There is only one person in control. It's not you. Once you realize this, life gets a lot easier.\" (page 82). The pain, the illnesses and even separation from her kids were horrible and I cannot imagine going through what Dabney went through, but the transformation in her and her husband's heart and the way her restored faith and strengthened life has blessed mine is a precious encouragement and a reminder that God is sovereign and cares for us in every circumstance.This brings me to the fact that, although this book focuses on Dabney's point of view, her husband also goes through a marvelous reassurance of his relationship with Christ. His care for Dabney and their kids reflects an authentic love, reminding us of God's love for His church. In this sense, the book is also a strong evidence of the relevance -and need- of a God-centered marriage in our society.Regarding her technique, Dabney has a very easy, friendly way of writing. Reading this book felt like having a conversation with an old friend. It is all just plain honest, the good, the bad, the struggle, the disbelief and the faith, all rolled together in a tight ball that keeps rolling and rolling and rolling… This is a highly recommendable book that will encourage those in need of comfort during hard times, whatever these could be.I received a complimentary copy of the book from Tyndale House Publishers in exchange for an honest review. This has not influenced my opinion on the book or on the author."}, {"userName": "Lizzie", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/8082854-lizzie", "userReview": "It’s not very often I use the term “inspiring” or “an inspiration” but \"When God Intervenes\" and Dabney Hedegard are just that.When author Dabney was only six weeks pregnant, doctors found a football-sized tumor in her chest which sparked a ten-year battle with her health that included four near-death experiences.If you don’t believe in God or are struggling with your faith right now, I dare you to read this book. I promise it will change you. I have never been so touched by a book as I have this one, and I finished it praising God and with tears in my eyes.The miraculous events and the faithfulness of God in keeping His promises to Dabney’s family not only encouraged me and stretched my own faith, but left me in awe. Her entire story is a testament to God’s love and power, and I couldn’t more highly recommend it! If you have money enough to buy one book this entire year, use it to buy this one. That’s how good it is.I picked up \"When God Intervenes\" thinking I’d read a few chapters and re-visit it later when I had time. I didn’t put it down until I finished it at 3:00 the next morning.The writing is smooth, the story is riveting, and the overall message is a life-changing one. Dabney’s openness and honesty about what she was going through was so refreshing, and I was surprised to even find a little bit of humor when the book dealt with such a serious topic.The one and only itty-bitty complaint I have has to do with the format of the book. Because you become so attached to Dabney and her family as you read, I wish they would have had a section in the middle with some photos of them. The book was so personal, I missed seeing who I was reading about. There was only one photo of the author and her family, and it was on the back of the book. And because Dabney’s story spans ten years, there was a lot of scene-hopping which was a little hard to follow at times. Although the scene/year changes were always marked, I wish they would have organized it a little more into sections, such as: “Years Before the Cancer,” “During the Cancer,” and “After the Cancer.” Something like that.However, those two little things weren’t enough to distract me or keep me from enjoying the book as a whole.So. I’ll summarize: BUY THIS BOOK.(I received this book for free in exchange for my honest review.)"}, {"userName": "Jennifer Clausen-greene", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/6457393-jennifer-clausen-greene", "userReview": "Beautiful and amazing story of letting God control your life, against all odds. keeping your faith, hope and eyes on Him for guidance in all things, no matter how fearful you might be or how unexpected life might become. This was am amazing, uplifting story or love and sacrifice. Beautifully told, you will not be able to put this book down. I laughed, cried and my heart was overfilled. The faithfulness to God of this family is inspiring. Dabey's willingness to continue to serve God through all her trials is what the true christian walk should like like. Yes, we get beaten down, yes, we don't understand why always, but what we do know is that God is perfect and He has our best interest at heart so we follow gladly, filled with the power of the spirit and that is exactly what Dabey did. While reading this phenomenal book I found myself asking \" How is God transforming my heart? I am I listening and walking in obedience to His will above my own?\"I would highly recommend this book to anyone struggling with the circumstances in thier life and needing a reminder that we are not in control-God is. The sooner we learn to lean on Him through our trials, the more fulfilling our lives will be.Disclaimer: I received a copy of this book free from Tyndale Publishing via Net Gallery in exchange for my honest opinion and review. My opinion no way reflects those of Tyndale or Net Gallery."}, {"userName": "Leah", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/3725802-leah", "userReview": "This is not just another story of a woman surviving cancer. This is not just another story of God stepping in and performing miracles.Dabney Hedegard faced death many times. When I say faced death I mean she was at the state where her next breath most likely would be her last. Six weeks into her first pregnancy an eight-inch tumor embedded in her chest was discovered. With abortion not an option she'd consider, treatment was postponed until she had progressed in the pregnancy. This was the beginning of her ten year battle against cancer, cardiomyopathy, mitral valve prolapse, pulmonary embolism, acute pneumonia, kidney failure, respiratory failure, and heart failure. Dabney is not a woe is me person and she had every right to be. She took every step as it came, the good and the bad. She put her life in God's hands. She did fall to the floor and cry at one point but who's to blame her? She's suffered more than anyone's fair share.Why did God send her to the brink so many times and then bring her back each and every time? She doesn't know. We don't know. All we know is He did. This is Dabney's story.God is in control. He does things we don't understand, but He also cares for us. When it's not our time to go He won't take. When it's not Dabney's time to go, He lets her stay.I read this book as a review request from netgalley using Adobe Digital on my laptop. All opinions are my own. I was not compensated for this review in any way."}, {"userName": "Soleil", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/21012035-soleil", "userReview": "When God Intervenes is a remarkable story about Dabney Hedegard. She writes her personal story of when was six weeks pregnant and was diagnosed with cancer at 25 and decided to postpone the treatment until after her first pregnancy. This marked the beginning of ten years battling cancer, cardiomyopathy, mitral valve porlapse, pulmonary embolism, acute pneumonia, kidney failure, respiratory failure, and heart failure. Ever time Dabney was given less than a 30% chance of surviving, and twice doctors told her husband she wouldn't make it through the night. But God intervened every time and miraculously rescued Dabney from death.  When God Intervenes is an extraordinary book. I am amazed at how Dabney Hedegard was able to make it through that time only on the Lord, and how close she was to not making it to the next her. Her testimony is touching, and she writes in a way you want to know what happens next. Does she get to see her family again the next day? At parts the story brings tears to your eyes, and you wonder what you would have done in that situation. When God Intervenes is a Five Star. (I received this book complimentary from Tyndale for review purpose)"}, {"userName": "Leemarie J. Morales", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/11043689-leemarie-j-morales", "userReview": "Review for:When God Intervenes: An Extraordinary Story of Faith, Hope, and the Power of PrayerI could not put this book down once I started reading it! I took it with me to read on my walk home from my son's school, on TV commercials, bathroom breaks, before going to bed, while my husband was driving, you get the point. I really enjoyed reading Dabney's testimony, how honest she was with readers about her fears, doubts, and sadness among other feelings and personal life details she shared. Yes, her story about what happened to her is sad, but somehow it makes you feel optimist when in contrast to our every battles we create ourselves for the most part. There's many lows in the story, but you encounter the amazing highs as you get deeper into the book, and at the end of the book you'll find a beautiful and heartfelt letter to Dabney from her husband. Thanks for giving me the book(first memoir I've read)!*I received the book for free through Goodreads First Reads."}, {"userName": "Suzette", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/10724296-suzette", "userReview": "Truly inspirational! I went through my own battle with cancer yet I still can not even imagine going through all the many trials that Dabney Hedegard did. Her journey begins as she battles cancer while pregnant! Dabney's story kept me reading well into the night. I couldn't put the book down. Her vulnerability is very refreshing as she shares all."}, {"userName": "Patricia Weitzel", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/27010595-patricia-weitzel", "userReview": "Wonderful story of God's loveA great read. I sat and read the whole book in one day. God is all powerful and all loving. This family has a wonderful story to remind us all of that love."}, {"userName": "Mary", "userReviewDate": "Sep 26, 2014", "userURL": "http://www.goodreads.com/user/show/1622108-mary", "userReview": "Amazing StoryThis story is a testament to the power of God and his deep love and faithfulness. Here is a woman who trusted The Lord, but struggled with believing God that she would be healed. Time after time He proved to her and to all those around her, that He is able."}, {"userName": "Libby", "userReviewDate": "May 03, 2014", "userURL": "http://www.goodreads.com/user/show/5735486-libby", "userReview": "Wow what a great story of God's intervention in a woman's life with many health challenges we get to see walk with her through them coming through in miraculous ways in answer to prayer yet she still has to go through each instance. Very encouraging."}, {"userName": "Belebe", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/5892141-belebe", "userReview": "What an awesome testimony! Dabney is an amazing lady with such strong determination and love for God and her family! She battled cancer and other life-threatening diseases and illnesses for 10 years! This story is also a great testament of the power of prayer! Praise and glory to God!"}, {"userName": "Frans Karlsson", "userReviewDate": "Nov 25, 2014", "userURL": "http://www.goodreads.com/user/show/5857985-frans-karlsson", "userReview": "A story of how God helped Dabney and her family through her sicknesses."}, {"userName": "Trina Duvall", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/20383548-trina-duvall", "userReview": "Good reads win!A good read if you are into religious testimonies. Not my biggest thing."}, {"userName": "Sarah", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/5973306-sarah", "userReview": "This was a very good book. A true testament to knowing that we should not doubt God's work in our lives!"}, {"userName": "Teri Fox", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/16165707-teri-fox", "userReview": "What a great book of faith, hope and perseverance. Loved the book."}, {"userName": "Linda", "userReviewDate": "Sep 14, 2013", "userURL": "http://www.goodreads.com/user/show/5433361-linda", "userReview": "What an inspiring story! This woman went through experiences many would liken to Hell on Earth, and not only survived, but thrived, through her faith and the support of friends and family."}, {"userName": "Jenny Schiralli", "userReviewDate": "Jun 10, 2016", "userURL": "http://www.goodreads.com/user/show/11013553-jenny-schiralli", "userReview": "just simply beautiful!I loved reading this sweet story of God's love and the power of prayer. it was such an encouragement to me."}, {"userName": "Jessica", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/1337168-jessica", "userReview": "A faith building story of healing"}], "description": "\"She'll never make it through the night.\"When Dabney Hedegard was six weeks pregnant, doctors discovered an eight-inch tumor embedded in her chest. She was diagnosed with cancer and opted to postpone treatment until further along in her pregnancy. This marked the beginning of a ten-year battle against cancer, cardiomyopathy, mitral valve prolapse, pulmonary embolism, acute pneumonia, kidney failure, respiratory failure, and heart failure. In each instance, Dabney was given less than a 30 percent chance of surviving, and twice doctors told her husband, \"She'll never make it through the night.\" But each time the doctors had given up hope, God intervened, miraculously rescuing Dabney from death's doorstep. Part medical drama, part account of divine intervention, Dabney's extraordinary story is a fast-paced, emotional roller-coaster ride that will have you crying one moment and cheering the next. Dabney's journey is an indisputable testament to the undeniable power of prayer.", "title": "When God Intervenes: An Extraordinary Story of Faith, Hope, and the Power of Prayer", "url": "https://www.goodreads.com/book/show/17131046-when-god-intervenes", "average": 4.47, "cover": "https://images.gr-assets.com/books/1406509473l/17131046.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/6851407.Dabney_Hedegard", "name": "Dabney Hedegard"}], "type": ["Christian", "Biography", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/17131046-when-god-intervenes", "http://www.goodreads.com/book/show/18816608-when-god-intervenes", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}