{"ratings": 22, "userreviews": [{"userName": "Berit☀️✨Traveling Sister✨", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/38946743-berit-traveling-sister", "userReview": "4 Gritty Stars 🌟🌟🌟🌟Harry Evans... you so remind me of my beloved Harry Bosch.... this is the third book in this Grady series... I am sure it can be read as a standalone, however you might miss out on some character development... I was glad I had read “No Comment” it gave me some much-needed insight into who Harry is and what makes him tick...The book starts out with two bodies found in a car that was submerged in the river... The man who was driving is dead and even more disturbing there is a decapitated body in the boot a.k.a. the trunk... it appears as though a different character is featured in each book and in this book it is Lauren’s turn.... after finding these bodies Lauren turns to her ex boss Harry, Who is now acting as a consultant to the police force.... I enjoyed the relationship between Harry and Lauren, they really balanced each other out well....As in the first book I read from the series, I really enjoyed how these characters went about solving the crime... there is some Grady oldschool crime solving going on with a splash of the new... and perhaps some rule breaking, or at least some questionable tactics.... once again I found this very reminiscent of ”Law and Order: Major Case Squad”... a US television show that is no longer on, however I’m sure you can find it on a cable station any time of the day... there is more than one case going on throughout this book, and I kept trying to figure out if there was a connection or not... I always love trying to figure these crimes out right along with the characters, but it is a good thing that they’re the detectives and not me!Absolutely recommend to fans of police procedurals filled with some pretty darn fabulous characters!*** many thanks to the author and Rachel at Rachel’s Random Resources for my copy of this book ***"}, {"userName": "Dash fan ", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/61989809-dash-fan", "userReview": "5☆ A Gritty, Compulsive read! Wow another action packed crime fiction from Graham Smith.When The Waters Recede is a quick, Fast Paced, twisting read that packs a punch.It was brilliant to be back with Harry Evans. He really is one of my favourite DI's. Although he works as a Consultant now he still is sharp, witty, respected, not afraid to break the rules and he gets stuff done! Everything I enjoy in a detective.When a car is pulled out of the water, what they didn't expect to find was that the driver was dead and even more shocking, inside the boot is a women decapitated.Who are they and why was the dead driver driving with a decapitated body in the boot!!What follows next is an investigation where two possible cases could well be connected!This is my second book by Smith he creates Fantastic writing that instantly draws you in.A wonderfully plotted and perfectly paced read, with a cast of well thought-out characters and a twisting plot, made for an addictive read I devoured In one night.Although you can read When The Waters Recede as a standalone, I am glad I had read No Comment first as it helped me connect to the characters.If you enjoy gritty crime fiction, with a twisting plot then you will thoroughly enjoy this book! Thank you to Rachel Random Resources for this copy which I reviewed honestly and voluntarily.My Review is also on my Blog Website:-https://dashfan81.blogspot.com/2018/0..."}, {"userName": "DJ Sakata", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/18344018-dj-sakata", "userReview": "Favorite Quotes:Blessed with neither looks nor brains, she’d fought her way through life, powered by nothing more than a sharp tongue and a cruel streak... Such was her popularity, the list of suspects for her murder wouldn’t be a short one. Everyone who spent more than five seconds in her company could be added to the list, as they’d be sure to want her dead.She was a right vicious piece of work. If she fell into the Amazon even the piranhas would be afraid to bite her.If Bell’s wife was a car she’d be a twenty-year-old banger with a possible oil leak and dodgy brakes.The DCI was a capricious man, who had the square head and shoulders of a rampaging bull – and the temperament to match.Eric Adamson didn’t so much have a chip on his shoulder, but the whole potato field.Tony made the kind of face only a gargoyle sculptor would appreciate…My Review:I was quickly immersed and held enthrall with rapt attention by Mr. Smith’s gripping tale and evocative writing. His uniquely peculiar characters were as compelling as his cunningly crafted and well-honed storylines. I relished and eagerly anticipated his clever introductions and amusingly colorful descriptions of each character, which I tended to pause over and savor, as they never failed to call forth a full visual such as, “His comb-over reached from ear to ear and a small bloodstain decorated one of his chins where a razor had nicked the skin.” There were several intriguing and tautly written storylines which pull me so deeply into their vortex that I started hearing their different voices with accents, and I couldn’t wait to see how each of the complex threads was going to intertwine. The Cumbria Major Crimes police unit was staffed by a group of quirky, complex, and multi-layered personalities with complicated relationships existing between them. Intricate deceptions were everywhere. This was a superbly written first-rate mystery and I loved every confounding puzzle piece and came away quite satisfied with the stimulating entertainment. And score! I hit a treasure trove and now have several new entries for my Brit vocabulary list which now includes toerags (a contemptible or despicable person), taken the mickey (take the fight out of), rubber-heeler (internal police investigation units), fly–pitching (street selling), owt (anything) and nowt (nothing)."}, {"userName": "Whispering Stories", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/20354973-whispering-stories", "userReview": "Book Reviewed by Stacey on www.whisperingstories.comDC Lauren Phillips has been called to the scene of a stolen car submerged in the swollen river Cocker, Cumbria, after the recent bad weather and floods. Inside the car, in the driver’s seat, is a man. Unfortunately, upon dragging the car out of the water the man is declared deceased.After going through his pockets and finding just some change, a set of keys and a wad of £20 notes, DC Phillips starts to look through the car to see if she can find any identification as to who he is. However, popping the trunk open starts her on a new case, that of the murder of the decapitated woman inside.DC Phillips knows she is going to need some help with this case so makes a call to her former boss, Harry Evans, who is now working as a police consultant after being pensioned off. Harry knows the identity of the woman, Jenny Fisher, a low-level criminal liked by no-one. The driver’s identity is proofing tricky to solve as his DNA and fingerprints are not know to the police.Who is this elusive man, and why has Jenny Fisher been killed in a horrific manner? It’s up to Lauren and Harry to find out.When the Waters Recede is an enthralling crime novel. It is the third book in the Harry Evans series and the first I have read. Whilst I agree with can be read as a standalone too, I do think to get a more rounded picture of the characters the first two really need to be read.The story covers more than just the one crime, and I found myself trying to work out the puzzle as to whether they all would be related in some way.Harry is an old-fashioned ex-detective, from the way he conducts his business to even his speech and attitude, you can tell he had a good few years in the job before being made to retire, something he deeply regrets.Lauren is new-school to Harry’s old. She has more tact about her and conducts herself in an altogether different manner. She is also one tough woman who doesn’t take any rubbish from anyone and is exceptional at her job.The two characters really bounce off one another and it works so well, especially with a great secondary cast too. The setting of Cumbria is just perfect, I love the area. I have noticed though quite a few crime/thriller books being set in the Lake District recently.This is a book you can really sink your teeth into if you love criminal investigation books. It has plenty of twists to keep you on your toes and the writing flows effortlessly making it a smooth gripping read."}, {"userName": "Sarah", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/27246754-sarah", "userReview": "After Harry Evans, Lauren is one of my favourite characters from the team. She is everything that I think women aspire to be. She is strong and sassy and just everything I’m not lol.Lauren actually has quite a big part in the book due to her having problems in her personal life. I enjoyed getting to see more of the person behind the work persona. It does humanise her and made me like her even more.I love that there are a few threads running alongside each other in the story. Probably best not to go to much into it but I do think readers will benefit from having read previous books just to get a bit more background to Harry as it is a very interesting one and he has been through a lot.Harry, he is like the father figure that the team look up to and who can blame them. I can understand why some higher ranks may not like him but he has the reader well and truly behind him totally routing for him.When The Waters Recede is another exciting and thrilling read in the series. This series would just be ideal for television as it really does have everything that I look for and definitely ticked all the boxes. Perfect for crime lovers."}, {"userName": "Amy", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/14045562-amy", "userReview": "While I’m a big fan of Smith’s other series (Jake Boulder) I hadn’t read any of the previous books in this series until now. I didn’t have any problem starting at this point though, there was enough pertinent background information shared that I caught on fairly fast. I will say that the cast of characters history does seem rather interesting though so reading them in order seems like it would be fantastic.Evans is exactly the type of lead character that I love in a police procedural, he’s reckless and sarcastic, but best of all he’s unpredictable and nothing keeps the reader on their toes more than a loose cannon. There are a lot of moving parts and various sub plots going on here for Evans and team, though I guess technically it’s not exactly his team anymore as he’s now retired and working as a consultant to the police. This was an interesting angle, he’s still working alongside his old colleagues but he’s a bit wrong footed and his team is as well. They’re not used to reporting to someone other than him and often find themselves deferring to him subconsciously. Lauren is a member of said team and I loved her character. There’s a personal story at play here that allowed me to really get to know her in a short period of time and I really liked what I saw.This was just such an interesting read with so many various angles to follow, I fear saying more but it was exciting and extremely well plotted. I’m a firm fan of Smith’s work and will now continue to follow this series as closely as his JB one, definitely give this a try if you’re looking for a unique crime thriller from a writer with a very strong voice.When the Waters Recede in three words: Controlled, Gritty and Solid."}, {"userName": "Col", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/12761919-col", "userReview": "Synopsis/blurb.......When a car is pulled from raging floodwaters with a dead man in the front and the decapitated body of an evil woman in the boot, Cumbria’s Major Crimes Team are handed the investigation.The woman is soon recognised, but the man cannot be identified and this leads the team and their former leader, Harry Evans, into areas none of them want to visit.Before they know it, they’re dealing with protection scams and looking for answers to questions they didn’t know needed to be asked.------------My take...Another case for the Major Crimes Team with former DI Harry Evans working as a consultant to the force. When the Water Recede was a solid police procedural. We have a couple of dead bodies in a car recovered from flood water, one drowned whilst on his way to dumping the body of the woman in the boot.I did like a lot of elements in this one. There's the close knit nature of the team, with the added awkwardness of Evans' former charges answering to a new boss, Campbell while the old boss hovers close by. Evans wrangling the consultancy gig by exerting some undue pressure on the new DI. Shouldn't cops or even former ones be above a bit of blackmail? There's also a bit of workplace politicking in the background with other elements resentful of the continued involvement of Evans in police work when to all intents and purposes the bad egg had been moved on.There's more personal stuff going on. I learned a bit more about the death of Janet Evans and how Harry is coping with his grief and opening up to some sort of life after his bereavement. There's also a big cloud hanging over Lauren, with a persistent suitor who won't take no for an answer. This strand was semi-frustrating as the author teased the reader for a while before releasing the nature of Lauren's worries. I did like the way the personal over-lapped into the workplace. Who doesn't sometimes take their problems with them into work? That said, Lauren is aware of the danger of distraction from the investigation.Local colour also adds to the flavour. The Cumbrian region and Carlisle in particular has suffered horrendously in the past decade of more with intermittent but repeated flooding, affecting thousands of residents. Smith shares his sympathy for the victims and his frustrations at the inability of the authorities to tackle the issue and make future occurrences a lot less likely.The investigation itself is interesting. A lack of identification of our corpse bearer stalls the team and the frustration felt is palpable. Other strands of criminality come to the fore and are investigated, including multiple missing persons, before a break in the case, brings a rapid conclusion to bear. There was a bit of unlikely coincidence at play in the resolution, which didn't bump me out of the story, but which I wasn't completely convinced by. I wasn't thrown by the case ending quickly, I guess when things break open there's an inevitable urgency and speeding up of events. It was more the way a character was in the process of scratching an itch with the very same person responsible for our nefarious deeds, while the rest of the team were back at base rapidly joining up the dots.All in all - a fast pacey read, albeit one read at a snails' pace (life interfering with my reading unfortunately). Definitely a series I will be returning to in the future. Lots to like here.4 from 5No Comment, an earlier Major Crimes/Harry Evans book was read and reviewed here.https://col2910.blogspot.com/2018/03/...Read in May/June 2018Published - 2018Page count - 260Source - review copy from Rachel's Random Resources as part of the blog tourFormat - Kindlehttps://col2910.blogspot.com/2018/06/..."}, {"userName": "Susan Hampson", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/36613708-susan-hampson", "userReview": "This is one pure adrenaline crime lovers fix from the opening chapter to way past closing the book so be prepared for buckling up for a day. The fast paced action and heart in your mouth moments just make it a perfect balance of work and personal situation dilemmas for the team.After a car has been pulled from the flood waters it holds a gruesome discovery in the boot, that of the body of a headless woman and a dead mystery man still sat at the wheel in the car. This is just part of the spidery web of investigations that the unpredictable and determined Cumbrian team get their teeth into this time. Oh bloody hell, it wasn’t long before I realised that two of my favourite characters, former D. I. Harry Evans and D. C Lauren Phillips were having their own crisis moments in their personal lives. Harry was fighting an internal struggle while normally sassy and independent Lauren was tackling something more psychical. Both of them know each other too well not to notice when things are not right. Harry has always been like a father figure to the whole team from when he was D. I. to his role now as consultant, his old team still turn to him for advice rather than D. I. John Campbell, who to be honest is in between a rock and a hard place quite a bit of the time. Still don’t like him! Sorry mate you won’t ever be #TeamCampbellOh boy this story just gets better and better from the uneasy feeling twinges I just began with to I need more oxygen moments that just blew me away. This is just pure pulse pounding perfection! Whoa Graham Smith knows how to hit that spot that just freezes moments where you stop the race to get to the good bit because it just may be the outcome that you don’t want. I was in frenzy heaven because I had to dive back in. Oh wow! OH WOW! What a story!This book can be read as a stand alone but really get in and read the series and get to know the team. Love how although this is a complete story the personal drama of the team is left in the balance. My mind is already spinning and my pulse rising for what is still to come. Superb!"}, {"userName": "Yvonne", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/30404765-yvonne", "userReview": "4.5 StarsWhen a car is pulled from the floodwaters with a dead unknown driver and a surprise I the boot, no one on the investigation team realise what they would uncover in the ensuing enquiries. Former DI Harry Evans is called in to help as a consultant.Having previously read No Comment I was aware of some of the characters and their histories. I would advise reading the previous books as it helps build up a better understanding of the dynamics within this group and also of the changes that Harry is going through. The story is predominantly about the case; who the victim is, how it is linked, why the murder and for what reason. But also is Harry’s part of the story and what is happening with him. I liked the way the author has used the “out with the old and in with the new” as Harry is only in a consultancy role now and under a new DI. There is a certain amount of tension and testing of loyalties.The case itself has a very realistic feel as those involved in it really struggled to find answers, in fact there were far more questions and answers most of the time. Gut instincts, hunches and what if’s showed up as the team have to use a range of different thought processes to work out what is going on. The book is not just about the investigation however, there is a story that emerges for one of the characters and it gave me a chance to see another side to those involved.This book takes a surprising route and one that I really did not anticipate and I was clueless as it was developed, this adds to the realism of the story, you are not going to know all the answers all of the time. The author does a great job of leading you along and has you where he wants you at all times. It isn’t a fast, all guns blazing read, it is slower, methodical and gradually builds up pace.This is a great read and one that I really enjoyed. For me it wasn’t just about the case but also the personal character stories and the interactions with a new boss. I would definitely recommend this book for readers of crime, thrillers, police procedural and suspense books."}, {"userName": "Claire", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/8791940-claire", "userReview": "When The Waters Recede has a different dynamic to the previous Major Crimes Team novels with the formidable Harry Evans no longer being officially police…not for want of trying to pass himself off still as a detective…I really felt Harry’s frustration at having to answer to Campbell and not being able to command the team in his own unique way. Campbell was also trying to stamp his level of authority on the teamIt’s not quite the #Harryshow. There is more of the team, particularly Lauren which I really liked despite it being her being in trouble. I was intrigued what was having such an effect on Lauren to make her so nervous and distracted! I won’t go too much into it but I think Mr Smith managed this storyline very well!There were points that I did chuckle – Mr Smith’s sense of humour showed through more in this one! The descriptions of the Leighton’s henchmen “Shaven Head” and “Mullet” – loved that! Why give a bit part character a name when Harry’s internal nicknames are perfect descriptions! The descriptions allowed my mind to picture these henchmen with there being too much description of them!Mr Smith also brings out the softer side of our Harry by taking him on a journey into the past by way of some family letters. I really liked the way the story built up through the letters and how Harry felt empathy for the writer.When The Waters Recede is another cracking crime thriller from Graham Smith packed with intrigue and twists – I defy anyone to see the solution of the case coming!!"}, {"userName": "Shell Baker", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/27220623-shell-baker", "userReview": "review to follow"}, {"userName": "Jessica Bronder", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/5781282-jessica-bronder", "userReview": "When a car is discovered in floodwaters with two bodies in it. The drive is unknown but the decapitated woman in the trunk is well known. DC Lauren Phillips is on scene but knows Henry Evens, now a civilian consultant, will want to come along for the ride as this murder investigation starts. Of course Henry jumps at the chance to be part of another investigation as things head in a direction neither person ever thought it would go. I admit that this is my first book from Graham Smith. It was not bad as a standalone, I had no trouble following along with the characters and such. But I do think that if I would have read the prior two books in the series some of the background would have made more sense.This was a great mystery and I loved how Henry Evan is a good detective but he seems to work better off the straight and narrow than toeing the line of formalities. Lauren Phillips is a great, strong female character that doesn’t take any crap from anyone yet has her own issues she is working on. She was a great lead for the case. This is a great thriller and a wonderful story. I really enjoyed this book and want to know what I have missed with the two prior books. I received a complimentary copy of this book. I voluntarily chose to read and post an honest review."}, {"userName": "Alexina Golding", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/31986999-alexina-golding", "userReview": "Evan’s is back, in his new role. He is taking some adjusting to it. One of the strengths of this series is the small cast of characters, so you get to know them extremely well. There is more focus on DC Lauren Phillips, it was good to see a more vulnerable side to her, but not necessarily the predicament she found herself in. Evans is also battling his demons, in his own unique way. Which again makes for an interesting insightful look to this dynamic team of characters. Smith has done it again, some cracking one liners. Bringing us closer to the team, in his own way. A thoroughly engrossing read, that was not only engaging, but nail biting in more than one place! Good to see Harry back, and anticipating what is in store for the team next."}, {"userName": "Donna Maguire", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/7997643-donna-maguire", "userReview": "https://donnasbookblog.wordpress.com/...I am a massive fan of this author’s books and was delighted to get my hands on a copy of this book! I started it as soon as it landed on my Kindle and had completely devoured it in a few hours. I loved the plot and found it really addictive, the pace was great and I thoroughly enjoyed the whole story. Most definitely a book I’m going to be recommending!! 5 stars from me!!"}, {"userName": "Sharon", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/5492096-sharon", "userReview": "Thank you to the author and the Publishers, Caffeine Nights for this review copy given in exchange for an honest review.  Also thank you to Rachel from Rachel’s Random Resources for organising the Blog Tour.A car is pulled from floodwaters with a man in the driver’s seat.  Unfortunately he is dead, and so is the decapitated body of a woman in the boot.  Former leader of Cumbria’s Major Crimes Team, Harry Evans, is now working as a consultant to the Force.  He recognises the woman from the boot as someone he has had dealings with before and she wasn’t a very nice lady.  Working with DC Lauren Phillips they struggle to identify the man in the car and are forced to visit areas they would rather not.  Given another case about a protection scam in a pub, the team begin to wonder if the two cases are connected.My first book by this author and it is also part of the Harry Evans series.  It can be read as a standalone novel, but I struggled with ‘who was who’ and ‘what was what’ as I hadn’t read any of the other books.  What I did read though was a gritty police story that had me hooked from page one.  Former DI Harry Evans was a force to be reckoned with, despite no longer being a serving police officer.  Whilst the team sometimes forgot that he was their ex-DI, he certainly didn’t and knew (sometimes!) when to step back a little.  As this is my first outing with Harry Evans I have nothing to base him on, but I have to admit I really liked his character and would be really interested in reading the previous books of the series to get an idea of what he was like when he was ‘in the job’!The story twisted and turned and was gripping enough to hold my interest right through the end.  I liked the way there was several ‘mini’ storylines running through the book, despite knowing that they are going to be all linked somewhere along the line.  This was a great read from a talented author!  I will definitely be looking out for more books by him!"}, {"userName": "Rosemarie", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/22054671-rosemarie", "userReview": "Took me a bit to get into, but enjoyed it once I did. Probably best to read the other books first. Full review on blog during blog tour 1st June."}, {"userName": "Emma", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/12794623-emma", "userReview": "Review to follow as part of the blog tour"}], "description": "When a car is pulled from raging floodwaters with a dead man in the front and the decapitated body of an evil woman in the boot, Cumbria’s Major Crimes Team are handed the investigation. The woman is soon recognised, but the man cannot be identified and this leads the team and their former leader, Harry Evans, into areas none of them want to visit. Before they know it, they’re dealing with protection scams and looking for answers to questions they didn’t know needed to be asked.", "title": "When The Waters Recede: Two dead bodies, one evil woman, one mystery man (DI Harry Evans Book 3)", "url": "http://www.goodreads.com/book/show/40242602-when-the-waters-recede", "average": 4.55, "cover": "https://images.gr-assets.com/books/1527704860l/40242602.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/66851.Graham_Smith", "name": "Graham Smith"}], "type": ["Mystery"], "outlinks": ["http://www.goodreads.com/book/show/40242602-when-the-waters-recede", "http://www.goodreads.com/book/show/40114789-when-the-waters-recede", "http://www.goodreads.com/book/show/36172209-the-kindred-killers", "http://www.goodreads.com/book/show/39197876-no-comment", "http://www.goodreads.com/book/show/11927795-we-can-be-heroes", "http://www.goodreads.com/book/show/15839969-gutshots", "http://www.goodreads.com/book/show/8872238-democratic-innovations"]}