{"ratings": 281330, "userreviews": [{"userName": "Lola  Reviewer", "userReviewDate": "Oct 21, 2014", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "*3.5 stars*Two teenagers, both named Will Grayson, coincidentally meet at a much unexpected place. And their life will never be the same again.One is shy and doesn’t want to be in a relationship. The other has depression and seeks love…in Isaac. But, is finding love on the internet the right thing? Could it be that Isaac may not be who he claims to be?It was an emotional but also full of life read. Containing the kind of atmosphere that can make you smile but also cry at the very same moment.The two main main characters, and narrators, are different in almost every way from one another. Yet, the fact that they were two opposite persons, made it interesting to read about each one of them and comparing them. While it was inevitable to do such thing, the results were surprising. The fact is, I can’t even admit who I preferred for they were, both, likable and had this character development that is more than well thought of. We can see it coming yet it still is impressive and welcome.Tiny is also a main character but not a narrator. He is actually the reason why Will Grayson #1 and #2 have a character development in the first place. He may seem to you full of himself at first (…and he kind of his) but you will absolutely learn to adore him. To say that he is important in the story is an understatement. Sincerely, I thought the romance was not captivating. It was just…banal. Sure, there are cute moments that will make you smile and sigh but they’re not breathtaking or what I call original. It is a main theme of the story, but I am now talking about the romantic one and, except for this latter, there are some others that are incidentally included. It is certainly not like not being hooked by the romance will keep any one of you from enjoying this read.The plot was quite simple but effective and even unique! I mean, rarely do I read about LGBT + drama (as in real drama) + gay and straight guy being best friends. It was enjoyable but unfortunately very slow. You see, even the writing is fantastic but, the fact that it is so slow (and I mean it) does keep me from giving it a higher rating. I did like this book but there are some scenes that do drag and could have been shortened. It’s quite some reading experience, this Will Grayson, Will Grayson book. It has a lot of humour, a special one though that may only appeal to some potential readers, and it also contains these sentences that will make you take a short pause and think a little about them. Probably asking youself: ''What is the author aiming for by writing that?'' And it makes you dig deeper to find the phrases in question’s significance. Which I loved. Reading books that make you think are the ones that you’ll remember after, at least in my opinion.Absolutely recommended! As an advice, don’t even look at the rating, if you’re the kind that is discouraged by a 3 1/2 star one. I liked it, would read it again but, when having much time, since it is a slow-paced story. To wrap up, great characters, unsurprising romance, wonderful themes, vivid atmosphere, slowness, not complex but unique plot still and \nan unforgettable read!\nArt source."}, {"userName": "Lyndsey", "userReviewDate": "Nov 22, 2010", "userURL": "http://www.goodreads.com/user/show/4224396-lyndsey", "userReview": "I have no idea what other book I could compare with Will Grayson, Will Grayson. For some reason, I got a very strong sci-fi vibe from the synopsis of this book. The cover itself just screams alternate universes. But nothing like that was involved. It was just two guys in the same ol' regular universe who meet under unusual circumstances. No speculative elements involved. But I still loved it!! Imagine that.Content warning for this book: Strong (yet hilarious) language including sexual references.In this book, we meet two Will Graysons.The first is John Green's Grayson. He is lovable, funny and best friends with this guy named Tiny Cooper, so I call him Best Friend Will. I really appreciate the fact that Best Friend Will isn't the kind of guy who runs crotch first toward any girls who like him. He keeps his distance, physically and emotionally, from relationships but never seems to do the same mentally. He is an over thinker, who notices every little thing about the people around him and analyzes each observation. But I wonder if guys really notice things like \"the pale skin of her back, and how she bites her lower lip, and that she smells like over sweetened coffee\". Maybe guys like John Green do. Who knows?The second is David Levithan's Will Grayson, who is a closet homosexual, gothic, and a manic depressive. Him I like to call Eeyore Will. He's soft, fluffy and cute but always so sad and complicated. I get the feeling that David Levithan is a very complicated person. Not like that is a bad thing. Some of my favorite people are \"complicated\", probably even myself included. However, I really have no authority the subject of Levithan since this is my first book of his. Eeyore Will takes a while to get to know but definitely has the most dramatic turn around and largest character arc.In truth - Will Grayson, Will Grayson isn't about either of the Will Grayson's. It's about Tiny Cooper. Anyone could see that. Really, it could have been called Tiny's Two Graysons.Tiny Cooper is the world's largest gay person. Not necessarily the most gay or the most large, but the ultimate combination of the two. His personality is just as large as his exterior, and I loved him.However, here's where I must issue a warning. Many people will not like him. His characteristics are very cliche and stereotypical, but I personally found him charming, not to mention, hilarious. Which is largely the result of the very good narration in the audiobook that got to the heart of each character. They all felt believable despite their flaws and stereotypes.This is one of those that I can't possibly imagine NOT listening to as an audiobook. I would even go so far as to say that I really ONLY recommend listening to the audiobook. The quality and narration was ridiculously good. It took a bit to really get into the story, but once I did, I realized that the humor of the book was captured perfectly by the two readers who portrayed each of the Will Graysons. I laughed out loud so often that I didn't even care if I looked like a maniac who loves laughing to herself and driving like a grandma down the highway.Strangely, I have found that audiobooks have the opposite effect of loud music. They make me drive super slow as I concentrate on and laugh hysterically over the book. So there I am driving along when all the sudden I burst out laughing: Hahahhahaa! Tiny Cooper wearing skinny jeans = denim sausage casings!!! Then after I've recovered from that, I'm driving along again. Dododododo. And Tiny sings this song to the Eeyore Will and he thinks to himself that Tiny's song must have carried all the way to the north pole. Then, he imagines that when Mrs Claus hears it, she turns to Santa and says \"What the f*ck was that?\" Those aren't even close to being the funniest lines.It was like listening to a high school drama TV mini series. In fact, it reminded me a lot of My So-Called Life. Since the story is really about Tiny Cooper, that would make him the Angela Chase of this book. So then, Eeyore Will would be the tortured and complex Jordan Catalano and Best Friend Will would then be Brian Krakow, I guess. Angst... Drama... Intrigue... Hilarity.The only major fail of the audio was how the IM chats were recorded with the screen names being said over and over again, faster every time. A few of the dialogue sections felt the same way with quick switching back and forth between the characters, but you don't notice it once you adapt to it. One of the best things about the audio was hearing Eeyore Grayson's poetry read first hand and hearing that narrators sing interpretations of the songs that Tiny Cooper wrote for his musical. EFFING BRILLIANT!!!Oh, and in case you were wondering about the picture at the beginning. All of the characters in this book seem to be on a constant sugar high of the grumbles. Alot of whining and complaining and angst. They've got the crumbly grumblies and it can be overwhelming. But I found it a lot of fun. Gotta give me them, grumblecakes.I loved the book. Though it took some time to connect to the characters, I believe it was well worth it in the end.At it's heart, this book is really all about friendship. I love that the end all be all is not for certain couples to confess love for each other and end up together. It was about admitting love for your friends and the people who have been there for you.It made me realize what an incredible thing we have going here on Goodreads.What I would do with myself now if I couldn't get online and talk to you all about the books that we read? If I didn't have someone to share the ups and downs of these important stories, to talk about life lessons with, or someone just to flat out laugh about random things that non-readers wouldn't understand.I laugh more than I ever thought I would, find books that I'd never think to pick up, meet people all around that world that I couldn't have met otherwise, and without a doubt, have an unbelievably amazing time with all of it.We all learn so much about life and about ourselves by analyzing books and have way too much fun doing it.So.... I appreciate you, Goodreaders. Whether you are grumblecakes or non-grumblecakes. This review is dedicated to you.Thank you for being awesome!"}, {"userName": "Tatiana", "userReviewDate": "Aug 20, 2010", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "3.5 starsI am glad David Levithan joined John Green to create this story, because clearly Green is unable to write any other characters different from what he had already offered in Looking for Alaska, Paper Towns and An Abundance of Katherines. His Will Grayson is the same old nerdy, too eloquent boy who is into a smart, attractive, and slightly pretentious girl. Green simply cannot move on to any other ensemble. Levithan's Will Grayson, on the other hand, is a breath of fresh air with a whiff of depression. He is a loner, a tad mentally unstable, but funny in a sarcastic kind of way. I have read a ton of YA lit and still I think this character is quite unique.The story itself is a great blend of Green's and Levithan's styles. Essentially, it is about both Wills romantic entanglements, their struggles to connect, to commit and to move on. There are great, difficult friendships and realistic parents. There are gay characters that are not cliches. And there is a fantastical, over-the-top, gay-licious ending in a form of a high school musical (I bet, courtesy of David Levithan) - my least favorite part of the novel, BTW. The book is funny too, or maybe its audio narrators just did a marvelous job reading it. Either way, I did enjoy it. A lot."}, {"userName": "Megs ♥", "userReviewDate": "Oct 29, 2011", "userURL": "http://www.goodreads.com/user/show/5691412-megs", "userReview": "[ 1. Of course we knew the only two gay guys were going to hook up. 2. It was also pretty obvious how things would end up for Will number 1 and Jane. It was also fairy obvious that \"Isaac\" wasn't going to work out because...well did ya read number 1? I will admit that even though I knew he wouldn't end up with \"Isaac\" I didn't think it would be who it was doing it all along, though.  (hide spoiler)]"}, {"userName": "Ryan", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/56788355-ryan", "userReview": "DNF at 24%\n Alternate title for Will Grayson, Will Grayson: Disappointment, Disappointment.John Green, I thought we had a thing going. You write incredible heart-wrenching books, and I cry about them and recommend them to everyone in existence. So what the hell happened with this?I said in my review of Eleanor & Park that never have I ever been so glad to check a book out from the library. You can just go ahead and scratch that now. I'm happier that I got this from the library. In the first 23 pages, I was hit with enough teenage angst to last me a lifetime. I couldn't even make it to page 100. Where to begin? The writing style was ridiculous. Will #2's POV was written like this: nothing was capitalized. everything was lowercase. not even names, like \"will\". not even \"i\". And that bugged the ever-loving shit out of me. The characters weren't much better. \"Insufferable\" is the best word I can think of to describe them. Yes, all of them. All of the main characters, at least. Will #2 was utterly annoying, Will #1 acted a bit like an asshole, and Tiny, the character who I thought would save the book for me, let me down. Ar first when I read the book's synopsis, I thought it sounded really interesting. But then I started the book, and my analysis began. Two guys who have the same exact first and last name just happen to randomly meet? Before you start thinking, \"It's possible to meet someone with the same last name and first name as you, you idiot\", allow me to explain. This would be more believable if their last name was something like \"Smith\" or \"Johnson.\" But no, their last name is Grayson. Maybe it's just me, (and it's probably just me) but I have never met anyone, in my entire life, with the last name Grayson. The name Will I can understand. I know three Wills. But no Graysons. I'm not saying it couldn't happen. It's just seems a little unlikely. I really wanted to like this book. But unfortunately, it just was not for me."}, {"userName": "Elyse", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "This book is terrific ---one that adults could spend time together discussing.....(high or low rating, there are topics worthy of discussion in this book) Sixteen year olds may enjoy this book - but I think the deeper insights might be more appreciated when older. There are already 15, 300 reviews .... I read two: ( 2 years ago), by Larry Hoffer, and Glenn Sumi. Larry's review was contagious and Glenn's thought provoking. With the recent floods in San Jose-an ongoing reminder for Paul and I - as we are hosting flood victims this month - and the two bomb threats at our Local Jewish Community center this week--I was hoping for a fun escape. ( so I grabbed this off my shelf)....However....THIS BOOK WAS FUNNY ....THE VERY FIRST SENTENCE WAS HILARIOUS....but I forgot -- TEENAGERS HAVE ISSUES: serious issues!! Underneath the laughter and funny dialogue, these kids were dealing with depression, love, loss, gay and straight relationships WITH PROBLEMS , friendships WITH PROBLEMS , struggles within their family, school, and struggles with their own painful awareness. --- ...........so basically -- The only way I really got my escape, was escaping into the teenage world of problems that were irresistibly funny... that we all know are a little bit sad.....and .... a little bit funny!! AS LIFE IS!!! FUNNY&SAD! At times some of these characters were annoying- rude - and unlikable - Other times we step back and our hearts open - we feel the tenderness - we feel the luv. The real star - standout - of this story is not the title characters -- but a character named: Tiny Cooper. \"Tiny Cooper is not the worlds gayest person, and he is not the worlds largest person, but I believe he may be the world's largest person who is really, really gay, and also the worlds gayest person who is really, really large.\" ......It's a different experience reading a book written by two authors where there're each creator of a character. John Green and David Levithan's writing style are 'very' different resulting in both characters of Will Grayson being 'completely' different.....but it's a beautiful blend ......ending with a bigger-than-life musical! These kids lives are complicated. The relationships are each entangled. Add social media- texting- smart phone -emails... and a musical stage production. There is a word taught in this book I thought was cool: \"weltschmerz\".... which means: \"It's that depression you feel when the world as it is does not line up with the world as you think it should be\".  And as my mother would say, \"Que Sera Sera\"..... 'what shall be will be\""}, {"userName": "Rae", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/2861470-rae", "userReview": "artificially inflated by the greens' ubiquitous little girl empire. for christ's sake, hamlet only has a 3.9.the feeling you get when you realize you've just wasted time and energy you could've spent reading one of infinitely many worthwhile books on something that has left you no richer for the wear is absolutely crushing. i read it over two days, first in the evening before picking it up again in the morning. when i fisnished, i threw it across the room and went back to sleep."}, {"userName": "Emily May", "userReviewDate": "May 25, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I really liked the idea of this book, having two authors create a character each and alternate their points of view throughout the novel. For me it was an entirely different kind of experience and the two authors have such unique styles that I would say it is definitely something everyone should read. It's a story about two teenage boys, both of which are called Will Grayson. They could hardly be more different, there lives have almost nothing in common... until one night when circumstances lead to them meeting by accident (in a porn shop). It's funny and it's ridiculous.So why the average rating?Well, because I couldn't get interested in John Green's character at all I'm afraid. This is my first experience of his writing and I know him to be a very highly rated and acclaimed author, one whose books have tempted me numerous times at my local library but I've never got around to reading. If this is any indication, I'm not sure his novels would be for me. I found his Will Grayson boring and a character who quickly became secondary to more interesting personalities like Tiny. I'm also yet to find a young adult novel that does the beauty and the geek story well. Will Grayson is an awkward, nerdy guy who can't believe the smart and beautiful Jane would fall for him. And neither can I, I'm sorry.That being said, David Levithan's character rocked. He's an angsty \"I hate the world\" type of guy and it's just effin' hilarious. One of my favourite parts is the part near the beginning where he's having a rant about people using things like \"lol\" on the internet:\"or ttyl. bitch, you're not actually talking. that would require actual vocal contact. or <3. you think that looks like a heart? if you do, that's only because you've never seen a scrotum. rofl! what? are you really rolling on the floor laughing? well, please stay down there a sec while I KICK YOUR ASS\"I really really liked Levithan's humour. In fact, I just really like him as an author, I'm yet to be disappointed by his writing. Perhaps I would have liked Green's character better if I didn't have this to compare it to but Green's Will Grayson just pales in comparison. Some people didn't like the musical at the end but I thought it was pretty funny. I've known a few versions of Tiny in real life - big personality, outrageously shameless - and his character repeatedly made me smile (credit to John Green there). On the whole, the novel was a pleasure to read: very entertaining, very gay (no offense intended in any way - read the novel and see what I mean) and very different."}, {"userName": "Arlene", "userReviewDate": "Mar 15, 2010", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "Wow! What did I just finish reading? I don't know whether to cringe, cry, walk away baffled, or sing from the top of the mountain in a musical-esque crescendo BRILLIANT! The writing was refreshing, edgy, raw, and offensive at times but never off the mark. Okay, how do I explain this book without mucking it up? Here is my attempt: Truly a honest and thought-provoking portrayal of two very confused and angsty teenage boys, both named Will Grayson who are just trying to figure out who they are and ultimately crossing paths in the least likely of scenarios. I started laughing from the first page and continued to laugh out loud throughout the story, but not without its occasional but constant tangents of sad and revealing moments and ultimate heart changing conclusion. This book covered the gamut of teenage struggles, including homosexuality, depression, love, loss, true friendship and painful self-revelation. The first Will Grayson, who I will refer to as WG#1, was my favorite as he’s the hilarious, self deprecating typical of John Green’s likeable characters. His motto in life is don't care… and shut up. But that can only last for so long. His best friend, Tiny Cooper, is a 300+ pound, gay guy who is constantly challenging WG#1’s feelings and adding a fair share of struggle into his life. WG#1 has some very revealing moments that come across as valuable lessons, some of them profound and others... well kind of gross actually. My favorites were You like someone who can't like you back because unrequited love can be survived in a way that once requited love cannot.  and You can pick your friends, and you can pick your nose, but you can‘t pick your friend‘s nose. *LMAO and cringing at the same time* I loved his ten minute game of just the truth. Overall, his observations were hilarious and intriguing. In my opinion, he could do, say or feel nothing wrong, I just down right fell for this character. Now WG#2, I struggled with him a bit. I couldn't really relate to this character... well for obvious reasons, primarily him being a snarky, twisted teenage boy, but at minimum I was hoping to develop some level of compassion for him. That took some time for me, but ultimately it did occur; the first of which came when he met Tiny and his internal self-revelation helped me understand his dark side. His humor was completely different from WG#1 as it was harsh, destructive, negative and sometimes just down right cruel. WG#2 has his fair share of life lessons that I felt were... well let’s just call them interesting, such as  The things you hope for the most are the things that destroy you in the end. and his bird shite rule was kind of harsh, but funny. Overall, his moment of self-revelation was his turning point for me as he shared his hurt about his dad, depression, money struggles, and homosexuality. It was sad to see that all this guy ever wanted in life was a simple break, so you ultimately hope he gets one.Okay lastly, why did I remove one a star? Two words... Tiny Dancer... Errrrr... Tiny Cooper.. okay that's four words and an unintelligible sound, but anywho... I could NOT stand him or his project/musical and his songs to me were crude. Tiny was selfish, self absorbed, exasperating and downright annoying. Despite his squealing to WG#1 that everything he did was for others, I did not buy it for one minute. Everything he did and said was to benefit him and his interests. How WG#1 remained friends with him simply baffled me. So minus one for a poorly developed character. But other than that perfect!Overall, great story with some intriguing characters and thought-provoking material. The writing might be offensive at times and the foul language could come across as harsh, but it was truly well done. Hats off to John Green and David Levithan for this brilliant piece of work."}, {"userName": "Julio Genao", "userReviewDate": "Dec 26, 2012", "userURL": "http://www.goodreads.com/user/show/3977017-julio-genao", "userReview": "Remarkable both for its polished wit and intense compassion, this is a story about three things: honesty, bravery—and Tiny Cooper.Mostly Tiny Cooper, though. He's the comma between the dumbass Graysons, y'see.Extravagantly emotional even in its hipster self-possession, this thing runs deep and wide, and I don't think you have to stagger up and out from the last line on the last page in the last minute of the last hour before dawn, sobbing in snot-nosed catharsis and joy and hope, to receive the very same message as I:Love as thou wilt.—Jacqueline Carey, Kushiel's Dart"}, {"userName": "Maggie", "userReviewDate": "Aug 18, 2016", "userURL": "http://www.goodreads.com/user/show/51318038-maggie", "userReview": "❝Some people have lives; some people have music.❞\nDNF at 14%1. I just chose that quote because it's the most popular one according to Goodreads2. I don't feel ashamed leaving a John Green novel as a did not finish book. Why?I really can't remember how many times the word \"gay\" was mentioned in the first pages. Were there any other words John could've used? Yes, they're called synonyms and he's a writer and author of other novels, he would know. The only word used to describe Will could've been gay and other things like funny, different, boy lover, or something related to liking guys. But no! John kept using the word gay and gayness and even though I'm not homophobic but I actually find gay guys really adorable and cute, I wished he would use other words. Not just describing Will, but Will describing his friends.Examples:\"My friend might be gay\"\"He's full of gayness\"\"I can't tell if he's gay\"\"My maybe-straight-or-gay friend\"\"I was completely gay\"Sentences and references similar to those were used over and over for the first chapter which was like 20 pages and I was literally so done. Other than that, the book was boring since the beginning, Will sounded like he didn't give a shit about anyone, and his friends sounded like the kind of guys that were trying to help him but failed really bad. Other than that, I didn't like this at all and I don't plan on finishing it if it's gonna keep mentioning the word gay when there are synonyms that can be used. I mean, they're authors. They should know how to describe characters better, how to fix the plot, and how to add to the characters right? Or maybe some?I've heard a lot about John, and I've never read a novel from him. This was my first one, well, sort of. But still, I don't really want to read TFIOS since I've already watched the movie and I hear the book is one of the ONLY books out there that is like, almost so so similar to the movie unlike Paper Towns and the Divergent trilogy."}, {"userName": "Limonessa", "userReviewDate": "Dec 13, 2010", "userURL": "http://www.goodreads.com/user/show/4147373-limonessa", "userReview": "I'm kind of ashamed to give this book such a poor rating because, clearly, everybody else liked it. I wouldn't even have given it 2 stars if not for the fact that it made laugh a couple of times. I think this book is SO not for me. First off, I'm not quite sure why it's called Will Grayson, Will Grayson because, clearly again, this book is not about either Wills. It's about Tiny Cooper, a humongous, self-centered, selfish, loud and super clichéd gay guy. This guy is so self-centered that the plot of the book is basically about him staging a musical about himself. WTF? I thought it would be more about the two Graysons, interacting with each other but they are actually connected only through Tiny.And, truth be said, I didn't like either of them. Will #1 (Green's) is a nerdy straight guy whose two main rules in life are: 1) don't care; and 2) shut up. I couldn't empathize. He's passive, subject to Tiny's whims and still he loves him. His romance with Jane felt contrived and popped out all of a sudden.Will #2 (Levithan's) is even worse. He's gay, emo, chronically depressed, tormented by his parent's divorce and perpetually in a bad mood. He's kind of the worst case scenario for a teenager. Both Wills ramble a lot, there's a lot of IM in the book and weird pointless conversations. Even the whole musical scene at the end was just plain silly. I don't really know who would care about a musical about Tiny Cooper's gay love life. I wouldn't and didn't. I kept thinking: maybe there's some weird symbolism I'm not getting here? I have no clue, I felt this book to be surreal at times. AND I don't really see how Will #2 managed to make other people with the same name go to a stupid musical in a couple of hours. Why would THEY care?So, again, it might be this book might be better appreciated by real teenagers - not teen at heart like me -but truly, if not for some rather startlingly genius passages like this:\"you know, how people say it's good luck if a bird shits on you? and people believe it! i just want to grab them and say, 'dude, don't you realize this whole superstition was made up because no one could think of anything else good to say to a person who'd just been shit upon?\" or this: <3. you think that looks like heart? if you do, it's only because you've never seen a scrotum. (rofl? what? are you really rolling on the floor laughing? well, please stay down there a sec while I KICK YOUR ASS.)this would book would have not got even that extra star from me. But, obviously, it must be me because check out the awards it got!Sorry, Green and Levithan, you're just not my cup of tea.Follow my reviews at NightReader"}, {"userName": "Juliana Zapata", "userReviewDate": "Aug 06, 2015", "userURL": "http://www.goodreads.com/user/show/28636277-juliana-zapata", "userReview": "La verdad es que me costó decidirme entre 3 y 4 estrellas para calificar este libro. El libro es indudablemente entretenido, tiene diálogos muy chistoso y otros un tanto profundos, pero sin embargo siento que esta historia funcionaría mucho mejor como película que como libro, ya que la culminación de la historia (que para mí fue una de las mejores escenas) es un musical, y creo que no se disfrutaría mucho más viéndolo y escuchando. Algo que quiero resaltar en este libro es la temática gay, amo que los libro contemporáneos se tomen el tema con tanta naturalidad y que en cierta forma estén ayudando a muchas personas a encontrar, aceptar y sentirse orgullosas de su identidad y también que ayuden a otras cuantas personas a culturizarse y relacionarse mas con el tema.Reseña Completa: http://bastvilard.blogspot.com.co/201..."}, {"userName": "Ami", "userReviewDate": "Jan 01, 2013", "userURL": "http://www.goodreads.com/user/show/134600-ami", "userReview": "Livre, je t'adore\n....Took me awhile to think about what I wanted to write -- but at the same time, everybody else on friends list have done a GREAT job with their own review. So I don't know if I can add more and I'm not sure that I CAN do a better job. All I can say is ...+ Emotions. This book made me feel A LOT OF EMOTIONS. I was happy, I was entertained, I was pissed-off mad and was ready for MURDERING ONE FICTIONAL CHARACTER(!!!!), I was touched, I was sad (*sniff*), and in the end, I was floating away with love.+ I loved both Wills immensely. I loved how Will Grayson realized that keeping his feelings in silence would not get him anywhere, especially in friendship and in love. I loved how will grayson was such a prick with everyone else but so different when he was online and later on realized that well, life wasn't that bad for him.+ But ... TINY COOPER. He was the heart of the book for me. He was the one who were able to break both Wills and then brought them all together. He was larger than life. He was my FAVORITE character here. This book should have him in the title as well #justsayin'+ And the ending ... I know some of my friends thought it was corny and cringe-worthy, but I LOVED IT. The story was also about music, with the going to concert, with Will dedicating a song, with GAY! lyrics ... and I thought the ending was just perfectly romantic (yes, people, I LOVED Glee's Pilot, so that should give you an idea *grin*). I was laughing with tears in my eyes when Tiny shouted out his phone number and then asked people to write down the Gay God's number for him. Such a Tiny's reaction.It was an amazing book -- and since this was my 2nd book in 2013, I wish most of the books I will read this year would be as good *sigh*. And this book can be sum up with this quote ... \n“Being in a relationship, that's something you choose. Being friends, that's something you just are.”"}, {"userName": "Josu Grilli", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/4322616-josu-grilli", "userReview": "Me ha sorprendido muchísimo. He terminado la novela a la velocidad que canta un gallo, sumergiéndome en esta historia tan enternecedora escrita por John Green y David Levithan. He de admitir que aunque los personajes de la novela me han gustado mucho por lo general, no puedo decir lo mismo del Will Grayson de John Green. Es un Will Grayson al que no le vi nada, y que pecaba de ser similar a los personajes masculinos protagonistas del resto de novelas del autor. Pero por otro lado, tengo al grandioso Tiny Cooper. Él es el verdadero protagonista de la historia; un personaje redondo en los dos sentidos con el que te reirás y con el que sentirás emociones humanas. Cuando Tiny se plantea como nexo de ambos Will, la historia gana muchísimo y consigue llegar al lector con una gran cantidad de debates morales y situaciones, como digo, humanas.Porque esta novela es humana. Refleja situaciones realistas con sentimientos reales, no una idealización de éstos. Situaciones como la amistad entre dos personajes homosexuales o la amistad entre un heterosexual y un homosexual son temas que apenas se tocan en novelas/películas LGBT y que en este caso, dotan a la novela de una profundidad y un realismo que es espectacular. Bravo a los autores por plasmar esa realidad. Bravo por no quedarse callados y llamar a las cosas por su nombre. Y bravo también por no caer en una historia típica.Will Grayson, Will Grayson se quedará conmigo durante mucho tiempo y la recomendaré durante aún más tiempo. Una novela RECOMENDADÍSIMA para aquellas personas que busquen una novela contemporánea agridulce, realista y con temas no habituales.(Nota: es la segunda vez que escribo la review por culpa de un error de Goodreads. Me he dejado cosas en el tintero que ahora no recuerdo, y no es tan entusiasta como la primera versión, pero escribiré una más larga en mi blog y hablaré de la novela en el canal, así que no os preocupéis ♥)"}, {"userName": "Emer ", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/4629647-emer", "userReview": "Utterly irreverent.Laugh out loud humour.At times very moving! \n\"NO. No no no. I don’t want to screw you. I just love you. When did who you want to screw become the whole game? Since when is the person you want to screw the only person you get to love? It’s so stupid! I mean, Jesus, who even gives a fuck about sex?! People act like it’s the most important thing humans do, but come on. How can our sentient fucking lives revolve around something slugs can do. I mean, who you want to screw and whether you screw them? Those are important questions, I guess. But they’re not that important. You know what’s important? Who would you die for? Who do you wake up at five forty-five in the morning for even though you don’t even know why he needs you? Whose drunken nose would you pick?!\"\nI am so surprised by this book!!! I had heard it wasn't supposed to be that great but I loved it! I mean I can't actually believe I've owned a copy of this book for as long as I have and have only now just read it. I probably preferred the writing style of John Green's half of the novel because I think I get his sense of humour more but damn did David Levithan do a nice job of writing a teen living and coping with depression. So there are two guys in this book both with the name Will Grayson. For distinction upper case Will (1) Grayson is written by John Green and lower case will (2) grayson is penned by David Levithan.I've seen people level comments of homophobia at the character of Will (1) Grayson because he says some pretty offensive things about his best friend Tiny... But in my opinion I feel that is taking passages / phrases etc out of context. Will's story needs to be viewed as a whole. He goes on a nice character arc, a journey if you will and then you get to chapter seventeen.... LOVE IT! And honestly, I think it feels more genuine because he's an imperfect character who is capable of saying some pretty dodgy things but also some pretty great things too. Okay his romantic storyline was a bit meh but I think ultimately that romance wasn't the point of his section. His friendship with Tiny was the real love story of this book. As for will (2) grayson. According to David Levithan he's a lowercase kind of guy. The use of lower case in his chapters represents his quieter view of himself and the world. His almost anonymity. He is fabulously complex and on one hand can be seen to be almost shy and on the other is a no holds barred trailblazer. Definitely a better written character than Will (1) Grayson so props to Levithan for that. And I loved the depiction of his depression (is it okay to say loved?). What I mean is that it was just a part of who he was, it wasn't the main crux of his storyline. It was just accepted that he was this teenager struggling with depression. Will and will's lives intersect through the medium of Tiny. GOD DAMN I LOVE TINY!!!! Bloody brilliant character. He was depicted as this over the top, larger than life sort of person. Like MASSIVELY stereotyped at first but when you peeled away the layers he became so small. So introspective. Such a different soul and so much more to him than the initial apparent stereotyping. And what was marvellous is I felt there was great consistency in how he appeared in the differently authored chapters. And can I just say PLOT TWIST!!!! Yup. Never saw that early plot twist coming at all. I LOVE IT WHEN I GET SURPRISED. I mean I knew something fishy was up but I didn't figure out exactly what 👍🏻Jane... Least favourite character development wise. She was just a means to an end plot-wise. So that's kinda your fault John Green...... Little bit manic dream-esque again..... Hmmmm maybe I preferred David Levithan's chapters after all.....Anyway this is an utterly nonsensical review really but ultimately I loved the book and had an absolute blast reading it. three and a half stars rounded up to four Buddy read with:AimeeJennyNkishaShakerriaShreya"}, {"userName": "Kyle", "userReviewDate": "Mar 11, 2016", "userURL": "http://www.goodreads.com/user/show/9740056-kyle", "userReview": "Basically, 300+ pages of a cutzy gay musical.\nFirst, as with so many books about teenagers, the teenagers really don't act much like teenagers. It seems most adult authors have forgotten what it was like to be a teenager. I never found myself relating or caring for any of the characters. There are some funny moments that brought a smile to my face. The ending I thought was a bit too contrived and unrealistic.\nI'm not sure about other high schools but I know the one I recently graduated from would never have supported a \"gay\" themed musical. Even if the administration would have said yes to it, no students would have tried out for it. To have done so would have meant being bullied for the rest of their school career. It's a nice dream but still a dream.\nIt’s an okay book but not really something I would recommend."}, {"userName": "Jenn", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/2928214-jenn", "userReview": "So, this is one of those books where I won’t read the lower rated reviews, which I almost always do either before or after reading a book. The reason I won’t for this book is because it touched something so deeply personal that I think I might feel like I’m reading about someone that doesn’t understand me.I’ll never review this book as well as it could be, but read the sample and if it doesn’t immediately draw you in, you might never ever relate to it. If you do enjoy it, it only gets better and more honest.The one criticism I might make about this book is I don’t know how YA it truly is. Of course, maybe I’ve just never truly grown up. All I know is I don’t think at 16 I would have nearly appreciated this book for what it is, but at 30, the characters and the insight spoke to me in volumes. I was and am some of these kids – if not all of them at different times. Some might say it’s depressing and that’s very true. But, depression is real and as a teenager (and adult) you don’t always think things are going to get better. You can be cynical and feel drawn to other cynical people. You sometimes think those that are always THEM aka the 'others' aren’t really how people are. As Will would say, that statement is both true and not true. But for as depressing as it might be, my fuck, I laughed my ass off the majority of it. Of course, there were a few ugly-face-cry moments thrown in as well.Characters like Tiny Cooper break up both Wills’ inner dialogue and he’s not there just as a ploy to bring happiness. He’s a real breathing character that exists – as they all do vividly – and he shows the reader that sometimes you can take a break and realize that people are different, and no one is perfect, but difference in all shapes and sizes, genders, personalities, etc can intersect and add something to your life. Sometimes you feel like you are alone and no one gets you. You keep your head down and you are an introvert going through life with a hilarious inner dialogue commenting on things you are desperate to release but sometimes feel no one will get.That when you least expect it, sometimes all you have to do is breathe and reach out to someone unexpected that might understand you. They don’t have to get all of you. No one probably truly ever will. But, someone will get some part of you and some special moments can happen.Loved it. Adored it. This book has its stars in Tiny, Will, Will, Jane, Gideon, Nick, Gary, but what it really does is tell the reader that things are both right and not right all the time, but you can get through it."}, {"userName": "jayne ", "userReviewDate": "Aug 22, 2016", "userURL": "http://www.goodreads.com/user/show/58877035-jayne", "userReview": "Nope; I definitely did not like this book. I found it boring, bland and just pointless. Sure, the characters were interesting and unique, but I just found myself really struggling with motivation to read it. In fact, I stopped reading it completely. I don't recommend it."}, {"userName": "Garima", "userReviewDate": "Apr 26, 2012", "userURL": "http://www.goodreads.com/user/show/7915003-garima", "userReview": "Well, firstly, the Title of this book should be “Will, Tiny, Will”, as clearly Mr. Tiny Cooper is having, just like his physical persona, a huge presence in the lives of both Wills. I started this book by accusing John Green of having written the character of Will Grayson *First* similar to that of Holden from Catcher in the Rye but accusation soon faded away as the story proceeded. The book is hilarious in capital letters on many occasions that earn it an extra rating point but on a whole you feel like witnessing a High School Drama where the ending is quite predictable and not at all exciting. Both Will Graysons are flawed personalities and it’s hard to like them but I guess that’s exactly what both authors expect from their readers. This book is about Love, loving yourself, loving others and loving those you love to hate. While reading you remain in a state of confusion that whether you like this book or you find it an okay read. It made me laugh really hard at times and at times it bored me.It’s no more than a one-time read as I don’t expect it to come anyway differently on reading it again. The treatment given to homosexuality is cool and easy going mainly because it has a main role play in the story. For me it’s a 3 star because even after having its flaws it gives you a break of reading a different style of prose which is a mixture of various elements like hilarity, seriousness, philosophy, etc."}, {"userName": "Maria Clara", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "Entre 3.5/4. Y, sinceramente, me ha gustado mucho más de lo que esperaba. Sobre todo porque al final el mensaje del libro no trataba sobre el amor romántico sino sobre la amistad 😊 Una muy buena lectura."}, {"userName": "Eren Nadir Akşamoğlu", "userReviewDate": "Apr 28, 2015", "userURL": "http://www.goodreads.com/user/show/14028968-eren-nadir-ak-amo-lu", "userReview": "Muh-te-şem-di ＼(^o^)／ Söylemek istediğim iki şey var. Bunlardan ilki will grayson will grayson'un lgbt temalı olduğu. Yani eğer homofobikseniz sizi rahatsız edecektir. Muhteşem bir kitaptan mahrum kalacaksınız ama ne yapalım •﹏• İkincisi ise bu kitap sadece John Green'in değil. John ne yazsa okurum zaten ama David sen neymişsin öyle *-* Sen hep yaz. Bizim yayınevleri o cesareti gösterebilirler mi? Ölüp gitmeden Everyday hariç diğer kitaplarının da yayın haklarının alındığı haberini duyabilir mıyız bilmiyorum ama sen yaz."}, {"userName": "Alex", "userReviewDate": "Jan 30, 2011", "userURL": "http://www.goodreads.com/user/show/4897461-alex", "userReview": "This is a book that very distinctly was not written for me. Hip high school students try to figure out if they care for one another while a fat gay kid writes a musical about his life while also trying to date a boy who has the same name as his best friend.By two authors writing alternate chapters, this is more than a generically bad book. Every second chapter is written entirely in lower case, and that character is so possessed by his self-loathing and misanthropy that there is nothing to recommend him. The style of writing detaches you from him so wholly that I wanted to jettison half of the book into the ocean.The other half? Will Grayson (who writes with caps! Imagine that!) is a guy, I guess ... he's a guy with a stupid policy of not getting involved, which means we've got a novel in which all of the characters are stagnating.Would this book be meaningful to high school students? I've no idea. Its portrayal of gay high school life seems entirely unrealistic to me (they let one character stage a goddamn musical of his life), and if something doesn't ring true it doesn't matter how much truth is actually in it. On top of this, both Will Graysons decide to have Tiny Cooper as their focal point.Tiny Cooper, among the worst fictional characters I read in 2010, is narcissistic to the point of intolerability. Worse still is that all of the characters are expected to accommodate him. He pisses off both Will Graysons but they have to make it up to him! Forget their feelings, this is Tiny's show!Speaking of Tiny's show, it is terrible. We are shown his musical and told that it's a surprisingly good masterpiece. No. It is onanism only backed up by one of the most ridiculous, unrealistic and frankly stupid conclusions in my reading career.Young Adults deserve fiction that speaks to them. If Will Grayson speaks to anyone, I want to meet that person and kick them into the real world. When Dan Savage said \"it gets better\", he meant \"life isn't as shit as the collaboration between John Green and David Levithan\"."}, {"userName": "Keertana", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "what do i say about Will Grayson, Will Grayson that hasn't already been said before? on one hand, i am well aware that this novel has its fair share of flaws. i'll be the first to admit that john green writes very formulaic characters, from his dorky male single-child protagonist to the manic pixie dream girl he falls in love with. i'll also admit that the characters in Will Grayson, Will Grayson are often annoying, flawed, and highly irritating. its narrative style may grate on some readers, it is kind of hard to connect with at times, and the beginning is disastrously slow. yes, Will Grayson, Will Grayson has its flaws, i'll be the first to admit that, but it also has its own rare form of beauty, brilliance, and heart that in my eyes, more than makes up for any flaws that it might have. Will Grayson, Will Grayson is the first novel i've read that has been narrated by two authors. it's also my first foray into the work of david levithan and i have to admit, i'm impressed. it's only my third john green novel and while i love his vlogbrothers videos, Looking for Alaska really didn't work me, despite my love for The Fault in Our Stars, so i was a little worried going into this. david levithan and john green have such distinct styles, though, and the combination of their two voices is just...magic. although john green's Will Grayson is distinguished by the capitalization in his narration, opposed to david levithan's will grayson whose narration reads much like this review (you wouldn't believe how hard it is not to use the \"shift\" key!), any distinguishing characteristics are completely unnecessary, simply because it would be impossible to get these two boys, who share the same name, mixed up. Will Grayson, Will Grayson is your run-of-the-mill contemporary tale, but the night that Will Grayson meets will grayson, roughly a third of the way into the novel, their lives irrevocably change. Will Grayson is a nerdy, almost forgettable character who lives life not really caring by much. at first, Will Grayson seems rather bland and his narration is spiced up by jane, the girl he grows to appreciate and crush on, and tiny cooper, his best friend who is gay and really isn't tiny. at all. will grayson, on the other hand, is immediately a much more complex character than his counterpart. as a sarcastic adolescent who takes pills for depression, will fails to connect with the people in his life, with the exception of isaac, his online friend who will is actually in love with - and vice versa. will, however, has a girlfriend, maura, who he still hasn't come out to yet for reasons of his own and, needless to say, this causes quite a few difficulties in his life. in all honesty, it's hard for me to put into words why Will Grayson, Will Grayson is such a fantastic novel. not only is it beautifully written, with profound statements dispersed between a very authentic teenage voice, but its ultimate message is incredibly moving. in some ways, this is less a novel about the two will graysons and more a novel about tiny cooper, the guy who keeps their lives connected. as i mentioned previously, Will Grayson, Will Grayson is not the kind of contemporary you immediately jump out and connect with. rather, what green and levithan attempt to do is convey the sense that although we all have difficult lives, many of us with problems that other people cannot even begin to understand, they are all real and problematic to us, no matter if there are starving children in africa with hiv/aids. while we cannot always reach out and understand others, we can appreciate them and what they do and that, sometimes, is more important than anything else. in addition to conveying this beautifully, though, i loved the friendships throughout this story. first and foremost is the very complex, but sad, friendship between will grayson and maura. in all honesty, i'd love to see a sequel featuring her because, no matter how cruel her actions may have been, it is evident that she has a plethora of issues of her own to resort to such desperate methods in her life. most importantly, though, is the friendship between Will Grayson and tiny cooper, one filled with tiny lamenting over his ex-boyfriends as Will Grayson tags along. what neither of them understand is how important they are to one another and the realistic direction of their friendship, their gradual growing apart with time and coming back together with a deeper understanding, is the type of friendship we all experience, or want to experience. just read Will Grayson, Will Grayson, okay? i know it has characters that can come across as incredibly selfish, but that's all part of their flawed charm. i know its characters may resemble other typical ones, but i promise you they all have one aspect of originality. i know it may seem as if you've read this story - the one about the gay couple, the one about friendship, the one about understand - before, but you haven't read it this way. you haven't read it written by these authors. although i had knocked off levithan's Every Day from my shelves, he's made me sure to pick up his other novels with this piece and john green? well, he always had my heart, but he'll have my money now too. You can read this review and more on my blog, Ivy Book Bindings."}, {"userName": "Lucy", "userReviewDate": "Feb 05, 2011", "userURL": "http://www.goodreads.com/user/show/3813315-lucy", "userReview": "I wanted to like Will Grayson, Will Grayson even though going into it I didn't have high expectations. Despite adoring John Green from the tips of his poof down to his mismatched argyle socks, none of his books have ever been life changing for me. The only work of David Levithan's I've ever read was Naomi and Ely's No Kiss List and I didn't love it. It was erradic, like something written after waking up from drug induced dreams. Will Grayson, Will Grayson was not a lot better. I don't think either author is completely at fault here. They're both equally at fault. It didn't feel like they pushed each other to new literary heights so much as encouraged each other's worst flaws.Quirk. John Green rains down quirk. Unfortunately, when all the characters are incredibly quirky it's no longer cute. It's exhausting. Most of the characters we come across in John Green's books are blatant non-conformists, so much so that you'd think every teenager was a bit like Lady Gaga, wearing plastic bubbles to school so people will understand they are unique individuals who just don't give a fuck. Maybe it's because his first book Looking for Alaska was part autobiographical, or maybe it was before he really got a chance to develop this particular habit, but it happens to be the best in the lot.All the characters created on John's side of the story ooze quirky out of their pores and yet somehow they still manage to be completely boring. Jane memorizes other people's locker combinations just in case, Tiny is putting on a gigantic play about himself, and Will Grayson One is having an existential crisis of sorts -- largely bought on by how much Tiny pays attention to him.I've said this before in reviews. I don't dig weird grammar things. It stylistic, I get it. You're edgy, I get it. I just don't like reading weird lower cap IM conversations. I needed to be drunk to read it, Mr. Levithan. It started off with just a glass of wine and then two-thirds of the bottle later I was able to appreciate some of your wittier lines. Of course, by that point I also thought my coat rack was pretty charming.I will give you this though, what Maura did to Levithan's Will broke my heart a bit. An entire person, a person he let his world revolve around, just vanished and it was all because of this girl's cruelty. So many of his hopes were centered around Issac, a boy he met online who turns out not to exist at all. The cruelty necessary do that to someone else -- the complete and utter lack of empathy with which Maura told him really gave me some of strongest feelings I got from the book, a sad fact since I liked Levithan's Will a lot less in general.I don't think Levithan's Will was particularly nice to Maura in the gearing up to that process, but I definitely don't think anyone deserved what she did. He's this guarded teenage boy with a lot of issues and she made him trust and depend on her pseudo alter ego. Given his personality she really could have been inciting a school shooting or other violence.Tiny Cooper made the first half of the book sort of unbearable for me and then how his relationship with Levithan's Will made the second half of the book difficult for me. I know I sound impossible to please here. Ugh. I wanted less of him, but after they gave me so much it annoyed me with how things played out with him and Will. I felt like Will ended up with Gideon because Gideon was thin. I didn't see much of a connection between the two of them. Will came out of the closet and Gideon appeared, never to leave again but never to really develop himself either. After all the mental cracks Will makes about Tiny's weight I couldn't help but think David Levithan was too much of a Gary Stu master to let his paper extension end up with someone that heavy.Best line: \"NO. No no no. I don't want to screw you. I just love you. When did who you want to screw become the whole game? Since when is the person you want to screw the only person you get to love? It's so stupid, Tiny! I mean, Jesus, who even gives a fuck about sex?! People act like it's the most important thing humans do, but come on. How can our sentient fucking lives revolve around something slugs can do. I mean, who you want to screw and whether you screw them? Those are important questions, I guess. But they're not that important. You know what's important? Who would you die for? Who do you wake up at five forty-five in the morning for even though you don't even know why he needs you? Whose drunken nose would you pick?!\"Relationship I liked the most? None of the romances. Not Will2/Tiny or Will1/Jane. Not Will1/Will2. It was Will1/Tiny. Their relationship was complicated and difficult. They drove each other insane and undervalued one another. They loved each other. It was genuine and complicated. Yeah, Tiny wasn't a very good friend to Will1 through a lot of the story and Will1 was horrible at expressing how he felt, but it felt like the most genuine thing in the book. My best friend, who will probably read this, routinely drives me insane. She has long streaks of forgetting she's six months younger than me, not six years. I have a long history of not sharing how I'm feeling until I'm screaming at the top of my lungs. I love her anyway. Not having her as part of my life wouldn't work without a lot of therapy. What Will Grayson1 said about them being together too long to question it now and wanting his kids to play with Tiny's kids... well, not all soulmates are the person you marry. What really ruined the book for me was the grand finale which came across like every high school movie ever. I felt like the multiple Will Graysons couldn't possibly be summoned that quickly and one of them being Tiny's exact type? Please stop spoon feeding me bullshit, guys. Overall it was an okay book, but please, John, a little less quirk next time. Maybe only one character wears the red shoes every day instead of them all doing it in their own unique, magical way."}, {"userName": "Vladimir", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/13926017-vladimir", "userReview": "Uopšte nisam očekivao da će ova knjiga kod mene izazvati toliku buru emocija... Totalno sam nepripremljen ušao u ovu priču.Govori se ovde o vezama, o prihvaćanju sebe, o nalaženju svoga mesta pod suncem, o usponima, o padovima, o jednom mjuziklu... ali pre svega o drugarstvu. Onom najiskrenijem, koje počne još u osnovnoj/srednjoj školi i znaš da će trajati i trajati...Od mene čista desetka!"}, {"userName": "Glenn Sumi", "userReviewDate": "Sep 04, 2015", "userURL": "http://www.goodreads.com/user/show/28854579-glenn-sumi", "userReview": "It’s been a really busy, stressful week, so I thought I’d relax with this book co-written by YA superstars John Green (\nThe Fault In Our Stars\n, \nPaper Towns\n, etc.) and David Levithan (Every Day, Nick & Norah’s Infinite Playlist). A bunch of friends IRL and  on here have raved about it, and I liked the premise.Two teenagers named Will Grayson live in different Chicago suburbs. They don’t know each other. One Will is straight, is being raised by two concerned, professional parents and doesn’t like to cause waves or draw attention to himself, although that’s hard since his best friend is Tiny Cooper, his school’s – and possibly the city’s – largest and most out and flamboyantly gay student. The other Will is gay, depressed, lives with his mom (his dad is a sore subject) and complains about life to his goth friend Maura, who might have a crush on him. The story unfolds in alternating chapters by WG #1 (written in Upper and lower case text) and wg #2 (all lower case. even when there are new sentences.) Green wrote WG’s chapters; Levithan wrote wg’s chapters. Eventually the two Wills’ lives intersect, and that’s when things get really interesting. As I said above, I liked the premise, or gimmick, of having the two characters meet. I’m sure we’ve all Googled our own names and, if there are others with the same name, wondered what those aliases’ lives were like.It must have been fun for the writers to collaborate on; for a reader, it’s almost like getting two books in one.My problem is that the Tiny Cooper plot, which includes a musical that Tiny’s writing, casting, producing, directing, starring in, etc., is so massive it unbalances the whole book. (No surprise Tiny and his musical got their spinoff book:  Hold Me Closer: The Tiny Cooper Story.) I also wish we got to know the Wills more. And while I like John Green’s writing, I’m getting used to his patterns, and his fly-under-the-radar Will Grayson is kinda interchangeable with his other protagonists.On the other hand, this is the first thing I've read by Levithan, and his intense, suicidal will grayson felt incredibly real, almost disturbingly so. Imagine a contemporary, gay Holden Caulfield.Other pluses:• The depiction of gay characters and allies is beautifully done• The parents, while not the focus, aren’t caricatures• The book captures the online and virtual lives of teens pretty well, and has a little cautionary note (somewhat obvious) about whom you can trust• The theory about Schrödinger’s cat (!) pops up in the plot – and it actually becomes a major theme• The book is very funny but also doesn’t hold back depicting serious issues facing kids. (About those issues: one of the things I love about YA books is that the stakes are so damned high for the characters. Oh, kids, wait til you grow up, you’ll wish that life were still so simple.)I won’t divulge any spoilers, but I had problems with one of the book’s turning points set in a suburban backyard, and the big showy climax felt rushed and contrived. Hey, I can suspend my disbelief as much as the next reader, but seriously???In the end, though, this book did the trick and made me forget about my own grown-up problems for a little while. And I’m definitely going to look for other books by Levithan."}, {"userName": "Taylor ", "userReviewDate": "Dec 08, 2012", "userURL": "http://www.goodreads.com/user/show/11107144-taylor", "userReview": "[\"i have some friend request from some stranger on facebook and i delete it without looking at the profile because that doesn't seem natural. 'cause friendship should not be as easy as that. it's like people believe all you need to do is like the same bands in order to be soulmates. or books. omg... U like the outsiders 2... it's like we're the same person! no were not. it's like we have the same english teacher. there's a difference.\" (Oh, the irony) (hide spoiler)]"}, {"userName": "Laura", "userReviewDate": "Nov 21, 2011", "userURL": "http://www.goodreads.com/user/show/4844873-laura", "userReview": "There have been so many drafts of this review. SO many! Every single one seems to involve me rambling on and on, so my apologies in advance. :)John Green and David Levithan team up to write this colorful, energetic wonder of a tale chock full of love and music. A story of when one Will Grayson met another will grayson and how they impacted each other’s lives and the ones around them.I might as well cop to it now—I am a Levithan girl. I adore the man. He has word skills, people! His words, characters, and power never fail to make my heart happy. I mean the man brought out the pinky swear in this one! The pinky swear! :) It is a sacred force in my family, which holds such a powerful punch of memories and emotions that I could never begin to explain. But yeah—like I needed another reason to love the man! Ooops! See rambling again. Let me try this. Here are just a few reasons why I loved this book:1.\tThis was my very first John Green experience and it will not be my last.2.\tI might have mentioned Levithan already. ;)3.\tThe word confuzzled made an appearance. (p.114)4.\tTiny Cooper, Tiny Cooper, Tiny Cooper! He is a giant ball of giddiness, joy, love, and power. 5.\tFriendship. The power of friendship is found on every page.6.\tThe BEST meeting spot ever. hehe….Come on it was! 7.\tOne wonderful Super Hero Dad. Will Grayson’s Dad made me very proud. Great dads are so rare in YA fiction.8.\tMusic, dance, and song!9.\tBe yourself. Show yourself. Strong messages that will inspire readers to think and perhaps act.10.\t Love. One person’s care and love can change everything.I had a lot of fun in the Will Grayson/will grayson world. A world that will make you sing, dance, and hold on to your friends! I will shut up now! :D"}, {"userName": "Heather K (dentist in my spare time)", "userReviewDate": "Jan 17, 2014", "userURL": "http://www.goodreads.com/user/show/13070326-heather-k-dentist-in-my-spare-time", "userReview": "Audiobook nirvana! I loved listening to \"Will Grayson, Will Grayson\". The narrators were perfection, managing to sound kind of age appropriate and also doing the inflections, the feels, to a \"T\". A fabulous listen, audio lovers. A must buy. In terms of the story, I started off liking John Green's Will Grayson more. I haven't read any John Green before, so I found his MC to be really enjoyable. You know, the kind of nerdy, quiet, emo guy that I have a huge soft spot for. But I loved how John Green wrote Tiny Cooper most of all. Some of the lines that John Green came up with... just amazingly quotable, witty, hilariousness. I actually began the book kind of hating Levithan's Will Grayson. I found him to be contemptuous, and I took a bit of personal offense at how much of a dick he was towards his mom. I struggled to like him at all for the first 25% or so. However, as the book progressed, I found that Levithan's character just completely sucker-punched me with PAIN and emotion. Wow, he just nailed it, honestly. Levithan's Will Grayson ended up being much more memorable for me. Excellently done. I liked how the two Will Grayson's ended up meeting and how the two stories twisted together. I wasn't crazy about the ending, but the book overall was really charming. I'll be reading more from these authors in the future."}], "description": "will grayson, meet will graysonOne cold night, in a most unlikely corner of Chicago, two strangers cross paths. Two teens with the same name, running in two very different circles, suddenly find their lives going in new and unexpected directions, culminating in heroic turns-of-heart and the most epic musical ever to grace the high school stage.", "title": "Will Grayson, Will Grayson\n      \n          (Will Grayson, Will Grayson #1)", "url": "http://www.goodreads.com/book/show/7958389-will-grayson-will-grayson", "average": 3.82, "cover": "https://images.gr-assets.com/books/1347192620l/7958389.jpg", "reviews": 16678, "authors": [{"url": "https://www.goodreads.com/author/show/1406384.John_Green", "name": "John Green"}, {"url": "https://www.goodreads.com/author/show/11664.David_Levithan", "name": "David Levithan"}], "type": ["Young Adult", "Contemporary", "Lgbt", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/7958389-will-grayson-will-grayson", "http://www.goodreads.com/book/show/6567017-will-grayson-will-grayson", "http://www.goodreads.com/book/show/25402091-will-grayson-will-grayson", "http://www.goodreads.com/book/show/17208924-will-grayson-will-grayson", "http://www.goodreads.com/book/show/23629060-will-grayson-will-grayson", "http://www.goodreads.com/book/show/8587154-will-grayson-will-grayson", "http://www.goodreads.com/book/show/8033219-will-grayson-will-grayson", "http://www.goodreads.com/book/show/27217875-vil-grejson-vil-grejson", "http://www.goodreads.com/book/show/13495867-will-grayson-will-grayson", "http://www.goodreads.com/book/show/11870085-the-fault-in-our-stars", "http://www.goodreads.com/book/show/99561.Looking_for_Alaska", "http://www.goodreads.com/book/show/6442769-paper-towns", "http://www.goodreads.com/book/show/49750.An_Abundance_of_Katherines", "http://www.goodreads.com/book/show/35504431-turtles-all-the-way-down", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}