{"ratings": 981, "userreviews": [{"userName": "Theresa", "userReviewDate": "Jun 13, 2013", "userURL": "http://www.goodreads.com/user/show/18020254-theresa", "userReview": "Is there anyone not familiar with Miss Read's books?Thrush Green is a small village in the Cotswolds. (I think I want to live there!) The winter months seem dreary, damp and cold, but the scenes Miss Read writes about are invitingly attractive; warm fires, hot tea and cosy cottages.But Thrush Green also has its problems. Someone is stealing from the neighborhood, a memorial is to be arranged for one of the village's founders (with several various opinions being brought forth), and a new neighbor moves in. Will the community accept or reject him? One thing is certain; Harold Shoosmith will be a welcome addition to the various community clubs and organizations who all seem to be in dire need of aid.\"A particularly vicious spattering of rain against the windowpane roused the rector from his chair.'I must be getting back,' he said, sighing. 'There was just one thing that I wanted to ask you - but I seem to have forgotten it.' He looked about the snug room, so different from his own bleak drawing-room which no amount of firing seemed to make habitable.\"Anything to do with committee work?\" asked Harold Shoosmith resignedly. He was already a member of the Cricket Club, Football Club, British Legion, Parochial Church Council and the local branch of the RSPCA, after a residence of less than two months.The rector's wrinkled brow became smooth again.\"How clever of you!' he cried. 'Yes, it was. The Thrush Green Entertainments Committee asked me to invite you to join them.' Ella and Dimity are two old friends who have shared a cottage and companionship for years. Along comes a new neighbor and suddenly Ella is threatened with anxiety for the future as her old friend Dimity forms a new relationship. If Dimity marries, how will Ella cope with living alone? And will Nelly Tilling, so suspiciously zealous in her good works, succeed in snaring a husband?Not a complicated plot or even characters, yet this peaceful story of winter and Christmas in Thrush Green is a pleasant fast read.\"...away from the lights and worries of the town the quiet hills lay beneath a velvety sky. No wind rustled the trees and no bird disturbed the night's tranquility. Sheep still roamed the slopes as they had that memorable night so long ago in Palestine, and low on the horizon a great star, bright as a jewel, still held out an eternal promise to mankind.\" Miss Read writes simply but pointedly, as she puts her fingers deftly upon the motivations of the human heart. It has been said that Jan Karon was inspired by this series of gentle stories with its quiet characters and small upheavals in village life. (After such a pleasant read, I have decided to read all of the Thrush Green books in order!)"}, {"userName": "Mary", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/11538764-mary", "userReview": "I just adore Miss Read.Her books have wonderful characters, a good eye for detail.She captures village life of a bygone era, very evocative.With lovely illustrations too!A comfort read for a chilly day!"}, {"userName": "Beth Bonini", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/3106785-beth-bonini", "userReview": "In her second instalment of the Thrush Green series, ‘Miss Read’ plays a sort of square dance with the characters she established in the first novel. Newcomers in the form of bachelor Harold Shoosmith and widow Nelly Tilling are introduced, and there is a sometimes surprising change of partners in the village do-si-do. Miss Read takes the most unpromising characters - the shy Dimity Dean and the irascible Mr. Piggott - and she guides them through the most unlikely of romantic manoeuvres. There is also a small spate of village crime and mischief, and a ‘controversial’ village project, but none of the plot developments ever take precedence over the charm of the Cotswold village setting. For those of us who no longer know our neighbours, this gentle period piece breathes life into the ‘olde world’ where the most unlikely of companions had to rub along together."}, {"userName": "QNPoohBear", "userReviewDate": "Aug 15, 2014", "userURL": "http://www.goodreads.com/user/show/22177907-qnpoohbear", "userReview": "Two years after the events of Thrush Green have seen a few changes in the village. The main characters of the first book fade into the background while the secondary characters come to the forefront. Mr. Piggott grumbles about all the work he has to do while waiting for the pub to open; Ella and Dimity are busy being nosy about their new neighbor, a man who has recently arrived from Africa; Miss Watson, the headmistress is assaulted and robbed in her own home and her junior teacher Miss Fogarty must rise to the occasion; Nelly Tilling is on the hunt for a new husband and has her sights set on one unsuspecting man. Harold Shoosmith has come to England seeking an idyllic 19th century life, only to discover that in the mid-20th century servants are hard to come by, but the neighbors are kind, especially the vicar who appears very lonely. Mr. Shoosmith has come to Thrush Green to his hero, Nathaniel Patten's birthplace. Nathaniel Patten was a 19th century missionary and the 100th anniversary of his birth is coming up in March so Mr. Shoosmith and the vicar decide to plan a memorial. The locals can't decide what it should be but seem to want Ella to make it. Harold is appalled at the idea and must find someone rational to work with. A few romances are in the air and Paul Young has a new friend. By spring Thrush Green will have changed just a little bit more.This is such a sweet, charming series. I like the third person narration better than the first person of the Village School series. Some of the elements of village life are the same in both series but the third person allows for emphasis on a variety of quirky characters. Each chapter alternates between a set of characters so it kept me reading to find out what happened. I knew exactly \"who dunnit\" so I wasn't surprised, I just wanted to know if that person got caught and how. One of the romances was predictable and one surprised me. One is a bit off-putting and one is very sweet. Some of the attitudes in the book are a little old-fashioned and some of the references are more modern than what I'm used to. This series is a hybrid between the classic English village novels of the 19th century and a modern local color novel. The writing is beautiful at times and also very simple. I think this series must appeal to elderly people who lived in a small town or village like Thrush Green. The characters are all feel so very real that they must be composites of real people. I plan to continue this series."}, {"userName": "Hope", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/13246091-hope", "userReview": "This is my third Miss Read novel and my favorite so far. It takes place in the fictional village of Thrush Green in the 1950s. It’s very British and cozy in that there is no huge plotline. It recounts the ups and downs of the town folk and avoids sentimentality by showing people’s faults. The characters are summed up in a few eloquent phrases that enable the reader to picture them perfectly. Here's one example.\"The rector of Thrush Green bore a striking resemblance to the cherubs which decorated his church and his disposition was as child-like and innocent as theirs. He was a man blessed with true humility and warm with charity. From the top of his shining bald head to the tips of his small black shoes he radiated a happiness that disarmed all comers.\"My only complaint is that the author highlights so many different characters that it's hard to feel like you are really \"getting to know\" any one person. Maybe you need to read all the Thrush Green books for that.Nice escapist reading."}, {"userName": "Chris", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/1521829-chris", "userReview": "I find these books a little bit of challenge to get into, but once I am, I love my visit to Thrush Green. And while there are some less than enjoyable characters, those are few and the good ones make up for them."}, {"userName": "Whistlers Mom", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/40836196-whistlers-mom", "userReview": "I can't remember how I got started on the \"Miss Read\" books, but I own a dozen of them in paperback and have read library copies of others. Miss Read was an Englishwoman named Dora Saint who wrote 32 books about the fictional villages of Fairacre and Thrush Green, all published between 1955 and 1996. Following the same characters and families for 40 years created a sense of realism and continuity that's missing in much of modern fiction.Saint has been compared to Jane Austen and Barbara Pym, but there are differences. Austen wrote traditional boy-meets-girl novels. Pym's novels are set in London or involve characters who've lived there and want to go back. Neither lady was interested in the \"lower classes.\" Saint DOES share their acerbic humor, which makes her gentle stories memorable and keeps them from being cloying. In this one, her description of the rumor-mill that pulsates constantly in any small community is both dead-on and hilariously funny.This is the second of the Green Thrush series and was published in 1961. Unlike the Fairacre books (most of which are narrated by the village school-teacher \"Miss Read\") it's told in third-person and centers on the families living in the village. Saint had a wonderful talent for creating well-educated middle class characters and barely-literate working class ones and making all of them ring true. She was a village school teacher herself and NOBODY knows more about what goes on in local families than the teachers who spend all day with their children. Think you have any secrets from your kid's teachers? Think again!There's a plot of sorts, although it never gets in the way. An empty house is purchased and the new owner turns out to be a single man, a rare bird in a village dominated by couples and spinsters. And he wants to raise a memorial to the village's most famous native son - the late, lamented African missionary Nathaniel Patten. The locals are happy to welcome a congenial new neighbor, but his executive skills are taxed as he tries to push the village into action. What's the hurry?There are two love affairs. One pits the church's slovenly, bone-idle maintenance man against a portly, energetic widow who likes a challenge. There's never any doubt about the outcome, but it's great reading. The other is a sweet story of two lonely people who (to the delight and astonishment of their friends) find the courage to take the plunge and bring comfort and love into each others' lives.Thrush Green isn't Eden. There's a violent crime that shocks the village and reminds them that no one is ever completely safe. Young couples struggle to raise their families, while older ones deal with the problems of ageing. They may not always manage to obey the injunction to \"Love Thy Neighbor\" but they accept the responsibilities of being part of a community. They can't solve each others' problems, but they help and it makes all the difference.This book works as a stand-alone, although it would be even better to read the series in order. Because this is a continuing saga, there are explanations of what went on in previous books. There's more \"exposition\" in the Thrush Green books than in the Fairacre books, one reason I prefer the latter ones. If you're new to this series, I would start with those.Like all of the books in this series, the reader gets to catch up with old friends and meet some new ones. What could be better? If you like good story-telling and believable characters, it's hard to beat this author. If you haven't discovered her, you should. I got this Kindle edition on sale, but there are paperbacks available for a few dollars. My library has many of them and yours may, too."}, {"userName": "Catie", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/2064042-catie", "userReview": "#MissReadAlong - February 2018"}, {"userName": "Carolyn Hill", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/1233028-carolyn-hill", "userReview": "Three and a half stars. With the world the way it is, I do enjoy a respite in the English village of Thrush Green in the early 60's. Winter brings a new resident - a retired bachelor! - who has elicited much interest and wide speculation. The school headmistress is attacked at home by a burglar. A new baby is expected. As the new villager settles in, he quietly galvanizes action on memorializing the town's all but forgotten hero, an African missionary. He also manages to prod the rector into examining his own lonely state as a widower at the mercy of an inattentive housekeeper. Romance is in the air and a widow takes matters into her own hands, though it seems she is interested in the unlikely prospect's cottage and location more than what he offers as husband material. The balance shifts between two middle-aged spinster friends who share a home, as one realizes how she takes advantage of the other and is holding her back from a happier life. It's a quiet sort of book, like all of Miss Read's, without heavy drama and very little suspense, but she does have an insightful understanding of human nature. Her characters are individuals and believable, and she describes them with compassionate wit. She also is very good at depicting children and their motivations, and she excels at painting seasonal pictures of a small village centered on its green in the English countryside. The pen and ink illustrations by J. S. Goodall are wonderful, too. It's a restorative place to visit for the world weary."}, {"userName": "Vivian", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/2533794-vivian", "userReview": "The second \"Thrush Green\" book begins with the arrival of a new resident. Speculation abounds as mystery and romance ensue, amidst an ambitious community project. Characters from the first charming book make cameo appearances, but by and large this is a story of characters who were stage parsley in the first book.I confess, I love the pen and ink illustrations which flesh out some of the quaint scenes and folks of the 1960'ish Cotswold village.Here is a sample of Miss Read's chatty writing style and apt descriptions (beginning on p. 87):\"Busy young growth sprouted from its battered crown and concealed the boys from sight. They had cut rough footholds in the mouldering interior of the split trunk and could climb up easily enough to this exciting new hide-out. It was unlikely that the new tenant would discover them, and unlikely that he would seriously object even if he did so, but the two boys found it more thrilling to pretend that poor Harold Shoosmith was a monster, and persuaded themselves easily enough that he would shout, brandish a stick, report them to their parents, the police and their headmaster, with dire consequences, should he ever stumble upon their whereabouts on his premises. This, naturally, gave their meetings a delicious fillip. One misty Saturday afternoon in November the two friends sat aloft in their eyrie, unknown, of course, to their parents. 'Chris Mullins has asked me to play,' Paul had said to his mother, and she, in her innocence, had imagined that he would be playing in the Mullins' garden. 'Paul Young's asked me to play with him,' Christopher had said to his mother, who had fondly thought that her son would be safely on the Youngs' premises. By such simple strategy have boys, throughout the centuries, accomplished their nefarious ends. Paul had arrived first and watched his friend emerge from the green garden door in the wall across the valley. He watched him run up the grassy hill and warbled an owl's cry as he approached. This was their secret sign, and the fact that an owl warbling in daylight might arouse suspicions, had not occurred to the boys. Chris arrived quite breathless at the tree and Paul tugged him up the rough stairway joyously. 'I've brought a Mars bar and some transfers,' he announced proudly when his friend had found a precarious seat. 'I've only got two apples,' confessed Chris. 'It's all we seem to have in our house,' he continued bitterly. 'Apples, apples, apples!'etc."}, {"userName": "Joyce", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/5394427-joyce", "userReview": "Library copy. I'm thankful that some libraries have kept their Miss Read collection, and that we can borrow from libraries across our state. Miss Read's writing is timeless, classic reading.I really enjoyed this quick read. Sometimes I read them more slowly to savor the country life. There is much to think about while reading the chronicles of Thrush Green. The descriptions of weather and surroundings, as well as the characters and plot, kept me from putting the book down this time around. It was compelling reading. This is #2 in the Thrush Green series. Being the start of a new series, this book took time to get into. I do not think this book should be read without reading #1 first, as Mrs. Curdle is mentioned so often and the mentions wouldn't stand unless you knew her from book #1, Thrush Green.That being said, my review of Thrush Green is not great, which I had forgotten because all I took away from the book was the character of Mrs. Curdle (https://www.goodreads.com/book/show/6...). This second in the series is all about the residents of Thrush Green, covers more territory, and includes the school teachers and children. There are some very interesting characters, several in fact, and a nice plot going which is not always true of Miss Read's books.This book is squeaky clean, I highly recommend it to readers of all ages."}, {"userName": "Stephanie", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/5794437-stephanie", "userReview": "I thoroughly enjoyed this second book in the Thrush Green series. A new character--a single man of a certain age--arrives in the village and sends all of the elderly ladies' hearts afluttering. I also liked seeing characters from the first book take steps in new directions or just continue on with the ups and downs of life. While the characters are a large part of why I enjoy these books, Thrush Green itself is the major draw. A part of me longs for such a place in which to live - somewhere with true seasons, natural beauty, a slower pace of life, and colorful, yet kindly, neighbors. I cannot help but think that life would be more fulfilling in the long run in such a place. Until such a place opens up for me, I'll at least have Miss Read's charming series in which to live and dream."}, {"userName": "Lynda Hunter", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/21461477-lynda-hunter", "userReview": "I cannot express how much I just adore all of Miss Read's books. I have read them all about three times and will gradually have to add my reviews for them all .... but will start with this one as it has always been my favourite. I think it is just something to do with the wonderful, cosy, homely Christmassy feel about it.If you enjoy simple things in life and feel like a little trip back down memory lane to when life was so much slower, try a book by Miss Read.....they are better than medicine. The most loved and treasured books in my life that is for sure. And that is going back over 40 odd years since I read my first one."}, {"userName": "Teri-K", "userReviewDate": "Dec 11, 2015", "userURL": "http://www.goodreads.com/user/show/2524448-teri-k", "userReview": "The Thrush Green novels are all lovely stories of life in a tiny village in England sometime after WWII. They recognize and celebrate simple things like neighborliness and friendship. This story gives us a new retired gentleman moving to town, changes in few people's circumstances, and a big Christmas snow. There's even the mystery of who hit the schoolteacher over the head and robbed her house. But these aren't stories about plot but about people and a place - a very special place that I enjoy revisiting year after year. It's worth reading them in order, if you can, because it lets you watch everyone's lives over time. but it's not necessary."}, {"userName": "Irina", "userReviewDate": "Aug 12, 2007", "userURL": "http://www.goodreads.com/user/show/208164-irina", "userReview": "As an avid and unashamed anglophile, I loved this book -- it's a gentle, enjoyable read where you follow the happenings in a little village in England: jumble sales, doctors who make house calls, thatched roof cottages, walks along country lanes, a 2-room schoolhouse, fireside visits with neighbors over tea, etc. with I've been reading and re-reading the series for about 10 years now."}, {"userName": "Denise", "userReviewDate": "Dec 15, 2013", "userURL": "http://www.goodreads.com/user/show/9502238-denise", "userReview": "Good, light readingThis is a good book for resting a tired mind. It takes you to a quaint English village that you wish you could live in. I will be reading more of Miss Read's books. These were some of my mother's favorites."}, {"userName": "Jan", "userReviewDate": "Nov 19, 2008", "userURL": "http://www.goodreads.com/user/show/133356-jan", "userReview": "I listened to the audio book and I love Junte Barrie the narrator! I love the gentle wisdom, compassion and justice of Miss Read. This book is comfort food for the soul. I want Dimity, Ella, the Rector and Harold to be my neighbors!"}, {"userName": "Marcia", "userReviewDate": "Oct 12, 2012", "userURL": "http://www.goodreads.com/user/show/7104946-marcia", "userReview": "I really enjoy Miss Read's stories including this one. Good when I want a warm-hearted read with slightly quirky characters."}, {"userName": "Nathalie S", "userReviewDate": "Jan 24, 2014", "userURL": "http://www.goodreads.com/user/show/6169980-nathalie-s", "userReview": "I've been reading and re-reading Miss Read over the last two decades. Whenever I need to slow life down, I take a side trip to Thrush Green."}, {"userName": "Rachel", "userReviewDate": "Mar 09, 2015", "userURL": "http://www.goodreads.com/user/show/1556172-rachel", "userReview": "Just lovely."}, {"userName": "Charlotte Smith", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/38708746-charlotte-smith", "userReview": "I read this book in a day and fully enjoyed it. It is what a village should be"}, {"userName": "Marie Godley", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/6394065-marie-godley", "userReview": "I love these books - they may be a little out dated but they are a gentle read - with interesting characters who are true to life"}, {"userName": "Hana", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/10571559-hana", "userReview": "Fun cozy village story with absolutely wonderful illustrations. Great characters."}, {"userName": "Nira Ramachandran", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/63448235-nira-ramachandran", "userReview": "The second of the Thrush Green series, this book continues to spin the charm of the idyllic Cotswold village and its curious, but nonetheless lovable inhabitants. The redoubtable gypsy, Mrs Curdle, the owner of Curdle’s Fair, which marks May Day in the village, is no more, but she lives on in the hearts of the villagers, Dotty’s new cat being christened Mrs. Curdle in her honour, Winnie Bailey (old doctor bailey’s wife) laying a dozen of her best Chrismas roses on her grave in memory of all the brilliant bouquets of paper flowers, which she gifted the doctor every year, even the good doctor, growing old himself, often recalls his ever grateful gypsy patient. The nefarious Sam Curdle, who was kicked out by his aunt for stealing, has settled in Thrush Green, eking out a living for his family, by fair means or foul. Ella and her best friend Dimity still share a cottage in perfect amity, but the winds of change are setting in. Ruth, who came home to Thrush Green and her sister Joan, nursing a broken heart in the first book, is now happily married to young doctor Lovel, and expecting a baby. The Rector still leads a lonely existence in the cold and lackluster rectory. The morose sexton Mr Piggot, now has real cause for his crabbiness, as his daughter Molly, who kept house for him, is traipsing around the county with her husband Ben Curdle (who inherited the fair from his grandmother), and her infant son. Into this familiar world comes a stranger, the handsome and wealthy Harold Shoosmith, who buys the corner house abutting the village school. There is much excitement in the village, and the newcomer is warmly welcomed and soon fits into village life, but his ideas, his comfortable lifestyle, and his intense enjoyment of English country life, which he craved for in the long years spent abroad, do have their impact, slowly and gently ushering in changes, and bringing others to a more joyous existence. A book to savour."}, {"userName": "Shannon", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/6811689-shannon", "userReview": "Ah! The circle of life as lived in Thrush Green! Here we have a newcomer to Thrush Green, a colonial from Africa, named Harold Shoosmith. He is retired, handsome and charming. He purchases the house across the street from long-time residents, Ella Bembridge and Dimity Dean,who eagerly make his acquaintance and become good friends. Some think there is more than friendship going on between Harold and Dimity, but people don't always know! Anyway, Harold is set on creating a memorial to a somewhat forgotten son of Thrush Green who was born 100 years before the action of the story, and who had accomplished great things as a missionary in a far-flung outpost in Africa where Harold spent 30 years of his life! His enthusiasm for the project affects the other residents and before you know it, there are fund-raisers being held and the heady experience of selecting an actual sculptor to cast a statue of the man! In the meantime, other people are getting on with their lives, babies are born, illness abounds during an extreme cold spell, there's even a thief at work among the honest burghers! And a widow-woman sets her cap at Albert Piggott, Sexton of St. Andrew's. She is welcome to the hard-drinking, dirty-living old chap! And finally, Charles Henstock, the widower Rector of St. Andrew's, has been lonely and sad since the death of his wife some years before. He finds friendship and even love along the way over the winter months in Thrush Green. A visit to any of \"Miss Read's\" locales is balm to the spirit."}, {"userName": "Lori", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/1209740-lori", "userReview": "I have fallen in love with the little hamlet of Thrush Green. I enjoy every visit I make there. This tiny fictional town filled with caring, warmhearted people is just the cozy corner where I can relax, think happy thoughts, and be filled with hope once again. The children are mischievous but not malevolent. The adults are kind and generous. It is a tight knit circle, but one that welcomes a newcomer with open arms and hearts. There are small crimes and friends gather to comfort and to help. There is a touch of romance in unexpected quarters, one comical, one tender. Friendship grows and strengthens through small services to each other and their community. There is time, unhurried, to converse or to ponder as individuals come to new self-revelations. Thrush Green is idyllic. I would love to live there, at least for a while."}, {"userName": "Niki Estes", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/33717304-niki-estes", "userReview": "Winter in Thrush Green is the second in the Thrush Green series. It is just as cozy and delightful as the first. As one who loves living in a rural area, I love how the small town charm is celebrated. Many of my favorite characters are back again and we get to know many others better in this volume. I found myself often chuckling with delight while reading. Ella, with all her gruffness, has quickly become one of my favorite characters and it was fun reading more of Winnie Bailey's wit (my favorite was the conversation between Winnie, Ella, and Dimity at the end of the first chapter). Other favorite characters include: the sweet Rector, Charles, eccentric Dotty, adorable Paul, and Harold Shoosmith, newly moved to Thrush Green. The Thrush Green series and Miss Read as an author are quickly becoming one of my favorites."}, {"userName": "Wendy", "userReviewDate": "Dec 20, 2016", "userURL": "http://www.goodreads.com/user/show/1967508-wendy", "userReview": "I read this book every Christmas. Miss Read is my favourite author. It is fun to return each year to Thrush Green and to enjoy the characters and their various doings. Miss Read writes with great insight into the lives of the people she creates. It's funny, sad, happy and gives me much pleasure. I did a Walk in Miss Read Country in 2012 and we walked through Wood Green, the setting for Thrush Green in the books."}, {"userName": "Sarah Crawford", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/51462925-sarah-crawford", "userReview": "The village decides to build a statue to their home-grown poet. There's a blatant robbery. A woman sets her eye on the sexton. Someone's house is filthy and someone else gets very sick. There's a bad snowstorm. All pretty much normal for Thrush Green. The violence of the robbery was somewhat unusual but, to me at least, the Thrush Green series seems to be a little harder than the Fairacre series of books. Still, I thought it was good."}, {"userName": "Rose Collins", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/33748267-rose-collins", "userReview": "A delightful study of human nature in a delightful English village. A newcomer buys a house in the village, the reverend decides to remarry, a little mystery about who is stealing Dottie's eggs and who hit the school teacher and robbed her house. Small dramas but rich characters developed by Miss Read. I find them a refreshing escape to a simpler life in a town where everyone knows each other."}], "description": "In the follow-up to Thrush Green, the arrival of a stranger in the village stirs ripples of speculation and interest.", "title": "Winter in Thrush Green\n      \n          (Thrush Green #2)", "url": "http://www.goodreads.com/book/show/19089302-winter-in-thrush-green", "average": 4.23, "cover": "https://images.gr-assets.com/books/1385933837l/19089302.jpg", "reviews": 83, "authors": [{"url": "https://www.goodreads.com/author/show/115317.Miss_Read", "name": "Miss Read"}], "type": ["Fiction", "Historical", "European Literature", "Classics", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/19089302-winter-in-thrush-green", "http://www.goodreads.com/book/show/669032.Winter_in_Thrush_Green", "http://www.goodreads.com/book/show/908968.Winter_In_Thrush_Green", "http://www.goodreads.com/book/show/5050445-winter-in-thrush-green", "http://www.goodreads.com/book/show/611240.Village_School", "http://www.goodreads.com/book/show/611233.Thrush_Green", "http://www.goodreads.com/book/show/669035.Village_Diary", "http://www.goodreads.com/book/show/668991.Storm_in_the_Village", "http://www.goodreads.com/book/show/197929.Gossip_from_Thrush_Green"]}