{"ratings": 5515, "userreviews": [{"userName": "Karol", "userReviewDate": "Jul 26, 2008", "userURL": "http://www.goodreads.com/user/show/290438-karol", "userReview": "There were numerous facets of this book that made it great to read - characters with longings and friendships that I could relate to, losses to overcome, and a mystery to solve. Plus, the analogy of the great \"Hound of Heaven\" really spoke to my heart. The author made that analogy come alive for me in a way it never had before. Oh - and then there's the whole \"mom\" thing, about how deep and strong that bond is. Plus, I enjoyed the setting in Michigan's U.P.The only difficulty I had with the book was that there were so many characters introduced in the first couple of chapters. I lost track of who was who, and had to go back and read those chapters again for it all to make sense. But once I got past that, the book drew me in and kept my attention to the end."}, {"userName": "Hannah", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "Ah, a very satisfying and twisty mystery in this one. I’d say this is one of Coble’s best efforts. I had a hard time getting into it, but past around the 40% mark I was fully absorbed in the story and I liked the Christian message as well. I have plenty of interest in the side characters and some ongoing questions about some incidents in the book that I’ll definitely be reading more in this series."}, {"userName": "Andrea Cox", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/16407549-andrea-cox", "userReview": "by Andrea Renee CoxWithout a Trace is a good mystery that featured search-and-rescue dogs, which is a neat thing I haven't seen much in fiction. I was disappointed that there was heavy emphasis on affairs, which is why I can't give this book five stars. A solid mystery with interesting characters. No expletives that I noticed, which was nice. I had noticed one in a previous Colleen Coble book, so I was hesitant about reading this one, but I'm glad it was chosen for me by a friend on Goodreads. I'm looking forward to reading more books in the Rock Harbor series.This is my honest review."}, {"userName": "Staci", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "Solid suspense novel to begin the Rock Harbor Series. I especially enjoyed the aspects of the one year old cold case."}, {"userName": "Justin Domnitz", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/29895624-justin-domnitz", "userReview": "Do you like reading about women who run away to the bathroom to cry over something silly? Do you like being introduced to a dizzying array of characters with no development that are impossible to keep track of? How about gender-bending names or dog names that could be people's names just to make it more complicated? You must love an interesting intro only to have to wade through chapters and chapters of nothing happening for any sort of follow up. Then, this is the book for you! The book has strong Christian tie ins. I finished it, but it really was a terrible book."}, {"userName": "Nancee", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/5786956-nancee", "userReview": "A lifetime resident of Michigan, The Rock Harbor series caught my eye. I've enjoyed other books by Colleen Coble, and enjoyed this first book in the series very much! Winning characters and a picturesque backdrop make this a great combination. The story moves along at a good pace, and although a bit predictable, the story was no disappointment. The term \"nor'easter\" was used a few times when describing a brutal winter weather phenomenon. This term is not pertinent to the Great Lakes region. An \"Alberta (Canadian) Clipper\" would be the appropriate term for us, but that is only something a Michigan resident might spot. A winning mystery in my estimation!"}, {"userName": "Beth", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/4075354-beth", "userReview": "Without a Trace was a fun enough suspense novel, but not quite as engrossing as I'd like. I think that sometimes Coble's writing style just comes across a bit lack-luster for me, which is totally a matter of personal taste as I know she has many fans. The mystery itself actually did take me by surprise, as I was not expecting the culprit one bit. Bree is a bit of a weak character at the beginning, and I really didn't like how she let some of the other characters jerk her around. However, as the story progresses, she finds some inner fortitude that helped me enjoy her character a bit more.I haven't one iota of knowledge about rescue dogs, so I found those details to be fascinating, and they came across realistic to me. The setting, with it's harsh coldness and impressive terrain, also came across strongly to me as well. There were times that I felt like this series would make a really good TV show. :)So, all in all, although there were some things I loved and some things I felt apathetic about with this story, I am glad I finally read it and do plan on reading the rest of the series at some point."}, {"userName": "Loraine", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/1922494-loraine", "userReview": "Book one in Colleen Coble's Rock Harbor Series sets up the town of Rock Harbor Michigan on Lake Superior and features Bree Nichols, a widow, whose young son and husband disappeared in a supposed plane crash. Bree is a member of Rock Harbor's Search and Rescue team along with her dog Samson. The small town of Rock Harbor is full of all sorts of interesting, loveable, and sometimes evil people. Bree is obsessed with finding the wreck of her husband's plane to bring closure to her life so she can move on. She only has faith in herself and no relationship with God. When evil catches up with her and bad things start to happen, Bree has a difficult time. This book is focused predominantly on the suspense element with just a touch of romance. I loved the connection between Bree and her best friend Naomi as well as her mother-in-law Anu. They really supported one another no matter what was happening. Kade exasperated me as he tried to develop a relationship with Bree, but he never let her know how he really felt. It was almost like he expected her to read his mind. Coble includes a good faith thread throughout the storyline. The surprise ending was predictable but still really good. I couldn't wait to find out what happened next in Rock Harbor so I have already read Book 2 in this series. Definitely would recommend this to readers of Irene Hannon or Lisa Harris."}, {"userName": "Melissa", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/27344017-melissa", "userReview": "I really wanted to like this book. The characters were underdeveloped and God kept getting randomly dropped into the story. I kept picturing am episode of Scooby Doo with the stereotypical small town and characters that start bad and turn good and vice versa. At times there was a little suspense which is the only reason I didn't put it down before finishing."}, {"userName": "Joanie Bruce", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/12027480-joanie-bruce", "userReview": "Yesterday, I reviewed the book, “The Butterfly Palace” by Colleen Coble. I gave it only three stars, mostly because of personal preference. However, since that time, I’ve read another book by the same author, “Without a Trace,” which is the first book of the Rock Harbor Series. Honestly, I have to tell you that I LOVED this book by Ms. Coble. What I liked: A Question is raised at the beginning of the book: whether Bree Nichols will find the place where the plane containing her husband and son had crashed. Seeking the answer to that question was the reason I got no work done today; I kept sneaking back to read another chapter. I thought the insights into the practices of search and rescue dogs was very informative. Ms. Coble certainly uses every tool at her disposal to keep her readers turning pages and interested in finding answers to the mysteries as they unfolded. The characters are so believable that the reader can’t help but feel their pain and anticipation. And the suspense escalated as secrets and hints turned into fear and murder. What I didn’t like: Nothing. I enjoyed reading every page.This book has everything: Romance, suspense, mystery, and intrigue. And even though I gave yesterday’s book by Ms. Coble three stars, this book has encouraged me to read more by the same author. Over all, I definitely give this book five stars, and it’s worth every star!"}, {"userName": "Valerie", "userReviewDate": "Jan 09, 2010", "userURL": "http://www.goodreads.com/user/show/2095322-valerie", "userReview": "I kept checking to make sure this really wasn't the second book in the series. The description leads one to believe that the plane crash occurs in this book. How am I, the reader, supposed to relate to Bree when I know nothing of her relationship with her son and husband? There was no character development, and the plot was so obviously predictible. Bree's overly calm encounter with Rachel at the end of the book would never have happened in real life. This is the first one of Colleen Coble's books I have read. I won't be looking for any more. There are so many other Christian fiction authors I prefer reading."}, {"userName": "Michelle", "userReviewDate": "Dec 27, 2014", "userURL": "http://www.goodreads.com/user/show/7374542-michelle", "userReview": "The story was interesting, but I found it fairly predictable. This was Christian fiction, which was not identified anywhere in the description that I bought it from; it was represented as a mystery. While this did not necessarily bother me, it came off as a little preachy. The main character's sudden transformation from a non-believer to a believer was a little over the top and unbelievable."}, {"userName": "Ronda  Tutt", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/2216375-ronda-tutt", "userReview": "Wow, what a great christian story that keeps your wondering through out the whole book. It was a great mystery finding out what happened to Bree's husband and her son. The book kept your interest by giving you ideas of several options of what could of happened to her family with all the twist and turns - starting out with knowing that her husband and son were in a plane crash but didn't know where the crash site was. With the help of her search and resue dog \"Sam\" and the help of her family and friends the plot thickens when one of the friends is killed and leaves you to wonder who murdered the friend and how it relates to the disapearing of Bree's family. There were parts in the story that really disterbed me when it came to the part of Bree's son who evidently survives but is being held captive by a strange lady. The actions of the disturbed lady really got to me and by the end of the book I had to say a prayer to keep all the bad thoughts of how I wanted the disturbed lady to pay for the things she did to the boy. But overall, the key to the story is to trust in God and learn to lean on him for guidence; learn to forgive and be thankful."}, {"userName": "Rebecca", "userReviewDate": "Aug 29, 2013", "userURL": "http://www.goodreads.com/user/show/9634394-rebecca", "userReview": "I picked up Colleen Coble's book A Cry in the Night and was so drawn into the storyline I had to go looking for the rest of the series. Without a Trace is the beginning of this multi book series and it is quite a story. The main character Bri is struggling through life after loosing both her husband and young son in a plane crash in which the wreckage and remains are still unrecovered. Bri continues to make a life for herself in the small community of Rock Harbor using her search and rescue skills with her beloved dog Samson.But all is not well in the little town and when an acquaintance turns up dead and clues point to murder, Bri begins a journey to find answers that only lead to more questions. In this tight knit community, suddenly friends become suspects and the truth may be more shocking than anyone realized.I really enjoyed this book as well as A Cry in the Night and am looking forward to completing the series. Colleen writes with a page turner style of suspense and is gifted in creating characters it is easy to fall in love with."}, {"userName": "Kathryn", "userReviewDate": "May 14, 2009", "userURL": "http://www.goodreads.com/user/show/1329275-kathryn", "userReview": "excellant book! I've found another great author to persue. Bree Nichols is a Canine search and rescuer and has been searching for her son and husbands downed plane for the past year. She has put her life on hold to find the closure she needs. Then there is a rescue that involves finding children and they talk of the witch in the woods that fed them and then brought them to the road where they were rescued. Their accounts were thought to be imaginative, until more people and later a dead woman also talked of a women with the brown leather hat from the woods. People who Bree has known for 5 years are all suspects in the murders and you won't believe who the guilty party is or what else happens when the women in the woods or witch of the woods is found."}, {"userName": "Katie", "userReviewDate": "Nov 19, 2009", "userURL": "http://www.goodreads.com/user/show/2227593-katie", "userReview": "I read this book along with my book club - it was a decent book. Though the plot was interesting, there was a lot of stilted conversation and unnatural development of relationships between characters. I was wondering if this was one of the firs series that Colleen Coble wrote, because on other books I've read by her, the plot and character development seems a little better. All in all, it was an entertaining read and I am planning on reading the other two books in the series now that I've read the first one."}, {"userName": "Ryan", "userReviewDate": "Sep 22, 2009", "userURL": "http://www.goodreads.com/user/show/2751333-ryan", "userReview": "I happened across this book by fluke at a local book store that was clearing a bunch of paperback novels out. I enjoy novels set in more remote locations like this one is, set in the Upper Peninsula of Michigan which is what drew me into this book.Although I don't consider myself religious is anyway, I thoroughly enjoyed this book. I've currently read two of the Rock Harbor Mysteries."}, {"userName": "Susan", "userReviewDate": "May 26, 2013", "userURL": "http://www.goodreads.com/user/show/16538015-susan", "userReview": "Way too predictable. Coming off an amazing book by Tana French so maybe I'm being too hard on Coble. The sophistication of the plot, character dev and writing is just too simple. Lots of great reviews for this book but doesn't seem worth the time. Probably a good series for early teen girls?"}, {"userName": "NancyInWI", "userReviewDate": "Jun 13, 2011", "userURL": "http://www.goodreads.com/user/show/1849840-nancyinwi", "userReview": "A good mystery that kept my interest yet the characters weren't developed enough for me to remember who was who and who was related to whom. And there were some elements of the story that were a bit unbelievable, thus only 3 stars. Not interested enough to read the rest in the series."}, {"userName": "Bekah", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/25766853-bekah", "userReview": "I really enjoyed this book. While it had kind of a slow start without much on-the-edge-of-your-seat adventure, I enjoyed the easy start in this book because I was able to get to know these characters. I quickly grew to love Anu, Bree, Naomi, and Kade. Don't let the easy start fool you, though, this was a great, suspenseful book, especially as you reached 3/4 of the way through the book.What I Liked: Colleen Coble did a fantastic job weaving this story. The end shocked me because the culprit who was responsible for the murder was not who I was expecting. I won't say any more for fear of giving something away. But I was cheering Bree on as she continued to search for the plane wreck her husband and son went down in and the bittersweet ending of joy and sorrow mixed in.One thing I liked about this book is in that so many stories the guy and girl are immediately attracted to each other and that didn't happen with Bree and Kade. They quickly grew to have an attraction for each other, but it was not immediate and I also liked that they weren't head over heels in love, either. They were rational and were FRIENDS first and then that steadily grew into something deeper. Bree didn't even like Kade at first.Naomi was probably one of my favorite characters, if not my favorite. She is sweet and an encourager and that was refreshing to see in this story. I just really liked her for some reason and I'm glad she has a role in future books. The Christian element in this book was actually stronger than I was thinking it was going to be and that was a nice surprise.What I Didn't Like: I don't think there was anything I didn't like in this book. This is a murder mystery, but I feel that the author handled everything tastefully.I give this book 5 stars for an enjoyable story that kept me guessing until the very end with a good Christian message in it."}, {"userName": "Vikki Vaught", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/7897287-vikki-vaught", "userReview": "3.5 stars"}, {"userName": "Liora", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/5655146-liora", "userReview": "Bree Nichols and her German Shepherd mix dog, Samson, are a Search and Rescue (SAR) team in Rock Harbor, a small town on Lake Superior in the Upper Peninsula of Michigan. She has been looking for the small plane that went down with her husband and four year old son for a year. She knows that she needs to let go of the search, accept their deaths, and get on with living, but a part of her just can't stop searching for the missing plane. Then a woman who tells Bree that she saw an airplane seat near a remote cabin while hiking is found murdered in the woods. While trying to figure out who killed this woman, Bree begins to uncover clues about what happened to her husband's plane. This book was an enjoyable Christian mystery, with good characters and a beautiful, well-described setting. The mystery was mostly predictable, yet I was drawn to the story and the resolution nonetheless. This book also addresses some difficult questions of faith, and Bree's thoughts and questions about God and faith seemed very realistic to me in the face of her circumstances. I will most likely read the next book in the series at some time"}, {"userName": "Teresa TL Bruce", "userReviewDate": "Feb 18, 2010", "userURL": "http://www.goodreads.com/user/show/2720349-teresa-tl-bruce", "userReview": "Bree Nichols and her German Shepherd mix Sampson are part of a K-9 search and rescue team in the rugged wilderness of Michigan's Upper Peninsula. Her best friend Naomi, and Naomi's dog Charlie, join her as they track and find hunters and lost children. But there is MUCH more to this story.For the last year Bree has also searched for the missing plane that went down with her husband and four year old son. As she wrestles with her own and her in-laws' desire for closure, she finds it harder to let go than to hold on.When Sampson discovers evidence revealing that a supposed accident was in fact a murder, the residents of the close-knit Rock Harbor community are shocked as they realize the victim was killed by one of their neighbors.This book has all the elements of a good mystery and a cast of characters both endearing and despicable. It also unfolds a satisfying (and clean!) romance or two! Moreover, it explores the battle between faith and suspicion, while acknowledging difficult questions of belief.If none of my other words have convinced you to read Without a Trace, know this: you will absolutely fall in love with Sampson, too!"}, {"userName": "Mrs. Doglvrs", "userReviewDate": "Mar 04, 2011", "userURL": "http://www.goodreads.com/user/show/4670092-mrs-doglvrs", "userReview": "It's official -- I love everything Colleen Coble writes!This great thriller, an amazing start to a 4 book series, takes place in the wonderful wilderness that is Michigan's upper peninsula. Bree & Naomi along with their dogs Samson and Charley are the town of Rock Harbor's personal Search & Rescue team.The story starts out with them finding 2 lost children, who have been helped by a \"witch in the woods\" and her son.As it turns out, Bree's husband and young son have been lost in the same woods for nearly a year - after their plane went down.Hmm.... what could have happened to them? And was their foul play with the plane?Excellent read!!!"}, {"userName": "Shelley", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/13007397-shelley", "userReview": "Search and Rescue in Northern Michigan... right up my alley.... what's not to like? Actually, as the book progressed the religion/Christianity stuff got a bit pushy for me. I have my beliefs, don't really enjoy bible study in my fiction reading. Unfortunately, this is a series I looked forward to reading, but I began the second book and will not finish it because the religious theme is strong right from the start."}, {"userName": "Donna", "userReviewDate": "Aug 21, 2010", "userURL": "http://www.goodreads.com/user/show/3252538-donna", "userReview": "I really loved this book. It kept me turning the pages waiting for the climactic end. I kept thinking \"she's going to find him...\" Great read! I loved the characters, and loved the interaction between then. The story of how Bree searches for her son was touching and I cried at the end.You'll love it! Can't wait to read the next one."}, {"userName": "Stephanie", "userReviewDate": "Jul 10, 2012", "userURL": "http://www.goodreads.com/user/show/10842622-stephanie", "userReview": "This is the first book of the Rock Harbor series. What I liked most about this book is that it ties in both mystery and faith. Throughout the series you see how Bree's faith develops. The book also contains moments of sadness, grief, happiness, and suspense. I got pulled into the book & characters and never wanted to put the book down. This is what led me to read the rest of this series."}, {"userName": "Jessica", "userReviewDate": "Dec 31, 2008", "userURL": "http://www.goodreads.com/user/show/1024955-jessica", "userReview": "This has to be the best book I've ever read!! I fell in love with the characters, and enjoyed the intrigue of a good mystery, as well as the heartwarming tales of family and friends woven throughout. I am immediately starting book two in the series...so happy that my relationship with these characters doesn't end with this book!"}, {"userName": "Donna", "userReviewDate": "Mar 03, 2010", "userURL": "http://www.goodreads.com/user/show/832211-donna", "userReview": "I have a new favorite author! Enjoyed this book of a missing father and son (plane crash) and the wife/mom looking for them. Loved the ending! Looking forward to reading her next book in this series!"}, {"userName": "Hope", "userReviewDate": "Jul 22, 2016", "userURL": "http://www.goodreads.com/user/show/13246091-hope", "userReview": "This was a pretty decent mystery. I enjoyed the search dog angle of the story and appreciated the author's effort to apply this to \"The Hound of Heaven\" poem. But somehow the Christian parts of this novel felt forced and flat. The romance was clunky as well."}], "description": "Librarian's note: An alternate cover edition can be found hereWhen a plane carrying Bree Nicholls' husband and son disappears, her life changes forever. Her relentless determination to find them starts an investigation that links their disappearance to a violent crime threatening to tear the peaceful town of Rock Harbor apart.Mystery fans will love this exciting new series from best-selling author Colleen Coble. Set in the untamed beauty of Michigan's Upper Peninsula, the Rock Harbor Series is full of suspense and romance, drawing you into the life and operation of a canine search-and-rescue team as it unravels the secrets of an enchanting wilderness.", "title": "Without a Trace\n      \n          (Rock Harbor #1)", "url": "https://www.goodreads.com/book/show/1923762.Without_a_Trace", "average": 4.12, "cover": "https://images.gr-assets.com/books/1435641459l/1923762.jpg", "reviews": 411, "authors": [{"url": "https://www.goodreads.com/author/show/33227.Colleen_Coble", "name": "Colleen Coble"}], "type": ["Christian Fiction", "Mystery", "Fiction", "Christian", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/1923762.Without_a_Trace", "http://www.goodreads.com/book/show/58854.Without_a_Trace", "http://www.goodreads.com/book/show/18004494-without-a-trace", "http://www.goodreads.com/book/show/15869688-without-a-trace", "http://www.goodreads.com/book/show/18887175-without-a-trace", "http://www.goodreads.com/book/show/752563.Without_a_Trace", "http://www.goodreads.com/book/show/34723231-without-a-trace", "http://www.goodreads.com/book/show/6605726-the-lightkeeper-s-daughter", "http://www.goodreads.com/book/show/2896711-lonestar-sanctuary", "http://www.goodreads.com/book/show/11942636-blue-moon-promise", "http://www.goodreads.com/book/show/13033553-tidewater-inn", "http://www.goodreads.com/book/show/22572148-the-inn-at-ocean-s-edge"]}