{"ratings": 3681, "userreviews": [{"userName": "Anne", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/18780551-anne", "userReview": "I'm not sure how I'm supposed to go about reviewing a book like this one...What can I say besides the fact that I absolutely LOVED it? This book was amazing. The historical setting was interesting. The romance was heart-melting. The Christian elements uplifting. The epistolary exchanges were just...wonderful. Everything blended together so well in this book, and it was so compelling that I had the hardest time putting it down. With Every Letter is one of those amazing books that you can't wait to reach the end of because you can't wait to see how it will all come together, even though you know it will be over all too soon and this-book-was-so-good-what-do-I-do-now depression phase will be about to begin once you're done. If you're anything like me, you will not be able to resist buying On Distant Shores and In Perfect Time, the next two books in the series, as soon as you finish this one. The characters are so attaching and the historical details so fascinating, that you will not be able to resist wanting to read more. I learned so much about different aspects of World War II. Thus far, the books about World War II that I've read revolved around the Jews and the Nazis. Those are usually the first things that pop into my head when I think about the second World War. I've read about concentration camps, gas chambers, destruction, torture, inhuman conditions and treatments, and complete loss of hope. It was very refreshing to read a book set in World War II that centered on a different aspect: the entry of the US Army at the heart of battles in North Africa. The hero was an engineer, and the heroine a flight nurse. With Every Letter was so detailed and well written that I learned a lot about those two professions. Silly me had not realized all the work required of engineers to make airfields functional, and the importance of air evacuation. I loved how both protagonists were in the military and in action. It made things really exciting, and was a change from the usual wife-at-home-waiting-for-her-man-abroad type of plot. I believe that, of all the books about any war I have ever read, With Every Letter is the only one that cannot be considered a \"sad\" book. There is no moaning and groaning about the war, no heart-wrenching descriptions of bloody battles, and no terrible losses. Never once did the characters say or even think \"When will this terrible war be over so we can all go home?\" type of lamentation. Not once. I kept waiting for it, waiting for them to lose hope, or get angry at God for allowing the war to happen, but it never came. They were there, and they were determined to help and to their best to succeed in their jobs. No complaints. Never. Wow. This book made the favourite list just because of that. And...the romance. The beautiful, wonderful, soulful and incredibly touching romance. Both H/h were such incredible persons on their own that together they were breathtaking. I loved seeing the other through their eyes. The point of view kept shifting between them, and it added a lot of depth and understanding to their characters. Mellie and Tom were so well-matched, and each brought to the other so much to complement their personality, that it was truly amazing to witness. I couldn't get enough of them. Where can I get an anonymous male pen friend as wonderful as Tom, please?! I need him in my life. ;) I cannot wait to get to the two other books in this series, and to all the other books Sarah Sundin has written. She has undeniable talent, and I cannot wait to lose myself again in the World War II atmosphere. I never thought I would say that quite like this!"}, {"userName": "Aerykah", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/5920961-aerykah", "userReview": "I can't decide if I really liked this book or not. I didn't love it, but it was good. The writing style really drew me in and kept my attention. And World War II is one of my favorite times to read about-- it's so fascinating! Yet the story lacked... something. I loved the characters! While they could be annoying and frustrating (quite a bit, actually), I think I can kinda understand why people in their situations would be the way they were-- people's life history shapes them in ways we can't all comprehend, after all.The plot was intriguing, yet I struggled with believing some of it. (Did anyone else have a hard time believing that Tom's dad would have gained the horrible reputation that he had -- one that lasted so long as to affect Tom in such a way -- from the crime he committed? I mean, it's not like he went on a killing spree or was a serial killer or something. Just saying.) And I wish Mellie hadn't figured out Tom's identity so quickly since he had to wait until the end of the book to find out who she was. His struggle with Annie vs. Mellie was starting to bug me a bit by the time it was all resolved, made worse by the fact that she seemed to expect him to fall in love with them both. Gah! But it all ended well and that's what matters, I guess.Overall, this was a very interesting story-- one I wish I hadn't put off reading for so long-- and I have to give it four stars because even through the frustrating & slightly unbelievable parts... this author still kept me reading without wanting to put the book down. I've already gotten the second book from my library and plan to start it right away. These characters just made me love them and want to \"get to know them better\". I can't wait to dive into Georgie's story and also see how Rose's is going!"}, {"userName": "Naomi Sarah", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/40096835-naomi-sarah", "userReview": "[ IT WAS TOM ALL THE TIME.  (hide spoiler)]"}, {"userName": "Olivia", "userReviewDate": "Jun 01, 2015", "userURL": "http://www.goodreads.com/user/show/43582060-olivia", "userReview": "Sarah Sundin is one of the best contemporary writers of WW11, and you can tell she has researched her story thoroughly. She knows her stuff :) I usually read WW11 books set in France or Germany, so it was a little different to me to read about war work in Algeria. The story itself is sweet. I liked Mellie a lot more than Tom. I felt her struggle to feel accepted by other nurses. She tries to fit in, but nothing she does helps. There is a strain of true friendship in this story. I LOVED her flight nurse work!!Tom's character was okay and half loved/half hated him the whole time. I felt annoyed with him for choosing between two girls-one he met, and another through a letter. SERIOUSLY! It drove me nuts how long it took for them to get together at the end! I was like, \"COME ON!\"Right at the end there is like five kisses on one page. Just a TAD out of hand :)I can't remember a whole lot of details about this book as it has been a few months since I read this. I really like and dislike this book. I still want to read the others in this series because Sarah Sundin seriously is a great writer. And she has great Christian lessons in her stories."}, {"userName": "Faith", "userReviewDate": "Aug 15, 2016", "userURL": "http://www.goodreads.com/user/show/40000090-faith", "userReview": "*clutches book and collapses dramatically* THIS IS AHHHHMAZING!!!"}, {"userName": "Maria", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/19799133-maria", "userReview": "Lt. Philomela Blake is a nurse who has a beautiful dream: to help wounded soldiers by working for the Air Evacuation Transport during the second World War. She has never dreamed of writing anonymous letters to a stranger soldier to alleviate his suffering. But when she starts writing Tom, an officer who has been hiding a secret for many years (a dreadful event that happened in the past and has prevented him from having real friends), her life begins to slowly change. She does not feel alone anymore, because Tom is the only one who really understands her. The only one who helps her open her heart through beautiful and poignant letters. Two souls that need a friend. Two people that meet through anonymous letters. Two hearts that fall in love with each other. That is the plot of this fantastic novel. Add to that the WWII set and you have the perfect mix for a great story, made of difficult and sad moments but also of heartwarming and blissful ones. What I admired the most about Mellie and Tom was their hope. They were at war, their future was uncertain, they saw death almost every day, and yet they hoped. They wanted to believe that something else was waiting for them, they wanted to have a happy life. I loved how they overcame their fears through their faith and thanks to those wonderful letters. All they both needed was someone to trust and to confide in, and writing to each other was a way to escape their loneliness and be stronger and confident. I really loved the way their friendship grew and developed, and I could not put the book down because I was totally hooked and felt like betraying my heart if I stopped reading! Mellie and Tom were so endearing and sweet that I wanted to spend all the time I had with them! Besides, I found lots of similarities between Mellie and me, and I guess that was one of the reasons why I was so motivated to keep reading her story.WWII was a tragic time period. Many young men died and it is not always easy to get involved in a book set during those years. But this novel was special because the author succeeded in creating an engaging plot in spite of the adversity. She made that possible because even in the most dreadful situations, love is the only thing that gives people something to fight for. And this one is definitely a beautiful love story.Touching, inspiring and extremely engaging, “With Every Letter” is a story not to be missed. I recommend it to those of you who love great novels about true love, friendship and solidarity in difficult times."}, {"userName": "Amy S", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/1010492-amy-s", "userReview": "A bucket of cheese with nacho cheese poured over and topped off with cheese whiz."}, {"userName": "Sarah", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/5887927-sarah", "userReview": "Age Appropriate For: 15 and up for romanceBest for Ages: 15 and upThis year has not been a good one for me in my fiction selections. I have found some gems, but mostly I keep hitting mediocre or downright bad books. It has been almost enough to drive me to break my vow of not buying books this year. I decided to go back to some of the authors that I have loved. Sundin was one of them.Wow! I cannot tell you quite how much I loved this book. I stayed up until midnight to finish it and sat awake for about a half-an-hour smiling and reliving parts of it before falling asleep. I actually cried while reading this book at one point, it was just that powerful.One of the things I love about Sundin is her willingness to tackle hard issues. Not the things that the world calls ‘tough issues’ but the truly neglected issues of the heart that Christians like to ignore. Topics of friendship, redemptions, forgiveness, gossip and leadership were all covered. The overarching message, though, was one of living without a mask and taking a risk for friendship.Mellie was such a wonderful character. I loved her to pieces and wanted to shake her at times. Yet she was so believable. Her flaws and her strengths made such a complete person that felt so real. Tom also felt very real. His struggle with leadership and doing what was right despite his past were so beautiful.As always, Sundin did an awesome job with her settings. I always feel more educated after reading her books, for the historical things I learn are always in perfect harmony with the story. I look forward to learning more about the flight nurses while reading this series.The romance was based on admiration of character, not physical attraction. It was such a wonderful break from the norm. The romance was very sweet and through letters for the most part, so based on character. Tom’s commitment to a girl he only knows on paper made me want to stand up and cheer. The kisses at the end were sweet, especially for how long the author made us wait for them.I highly recommend this book for those who like romance, historical fiction, and faith-building stories."}, {"userName": "Kellyn Roth", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/52072956-kellyn-roth", "userReview": "Reread 05/20/18:AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!!!!!!!!!!!!!!!!!TOM. POOR DARLING. <3Twice as heartbroken by Rose's whole story, though. We're \"kindred spirits,\" except neither of us could tolerate something as ridiculous as kindred spirits. ;PMellie and I also have things in common, though? But like Mellie is me at \"that time,\" as she so delicately puts it. Not me the other three weeks of the month. xPOriginal Read 01/03/17:Originally posted on the January 2017 Mini Review postIt's getting a little old for me to be rating Sarah Sundin books 5 stars and crooning over them, so this is gonna be a short review.All of the books that I've read by Sarah Sundin have been five-star marvels ... but wow. This may be the best one yet! An amazing plot, an amazing message, amazing characters ... I just don't have words for it!I think my favorite thing about this novel was its originality. It's a romance, but the two main characters don't even meet for months and months into their relationship! And Tom ... wow! He was totally committed before he even met her in person! AAAAH!!!The minor characters were neat, too. I especially liked the other nurses. Oddly enough (because I don't know if I was supposed to), I've taken a liking to Kay. Should I be shot? I'm sorry ... I just feel like there's something there, you know, underneath all the ... ick. I feel sorry for her.And Rose. I like Rose. And Georgie. I liked Georgie.Hooooold it a minute! This was gonna be a short review! And so it stops here.~Kellyn Roth, Reveries Reviews"}, {"userName": "Andrea Cox", "userReviewDate": "Apr 08, 2015", "userURL": "http://www.goodreads.com/user/show/16407549-andrea-cox", "userReview": "by Andrea Renee CoxWith Every Letter by Sarah Sundin is a great example of why I enjoy reading historical Christian fiction. There are many reasons why I like this genre, and this novel in particular, but the aspect I love the most is learning new things about different times in history. Before reading this book, I had no idea there were flight nurses in World War II.In With Every Letter, Mellie Blake aspires to become a flight nurse, but even if the government finally approves this new position for females, her lack of social skills may hinder her from being allowed to join the crew of flight nurses. Will she learn to be a friend before time runs out?It was very interesting to learn not only that these flight nurses existed but also of some of the difficulties they faced. The main problem was they were entering a man's domain: the front lines of war. Bravery wasn't the issue; the women wanted to serve their country just like the men they longed to nurse back to health. They men's mindset toward having \"dames\" that close to the battles was the problem. Was it because they feared the ladies would be hurt or that they'd be a distraction? Probably a bit (or a lot) of both. Though the men thought nurses belonged in the military hospitals, I'm sure those who needed the nurses' in-flight care quickly learned to appreciate that the ladies were so close at hand.I can hardly wait to see what I'll learn when I read the second book in Sarah Sundin's Wings of the Nightingale series."}, {"userName": "Sonya", "userReviewDate": "May 10, 2015", "userURL": "http://www.goodreads.com/user/show/4735640-sonya", "userReview": "Why did it take me so long to get to this? This is such a wonderful novel! :)"}, {"userName": "Tricia Mingerink", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/36134494-tricia-mingerink", "userReview": "During the first part of the book, I wasn't sure I'd like it. The two main characters are so painfully awkward around other people and are so terribly flawed. Yet, they grew on me, slowly, surely, even as they grew themselves until I absolutely loved them. Though, I'll admit, while the main characters were in danger, I was most scared that the dog would die. Sesame was just so cute! And loyal! And I just want to hug him. As for negative content, there was a few wartime type jokes and off-color humor at a few points. While I like Sarah Sundin's later books better (they are tighter writing with even more action and less romance), I still really, really enjoyed this one. My biggest disappointment? Only the first book is available on audiobook. I'm not sure when I'll be able to find the time to read the other two books in the series."}, {"userName": "Gabriela Paige", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/40447521-gabriela-paige", "userReview": "Again, I mainly read this book because the Kindle version was free on Amazon and a friend on Pinterest put it as one of her favorite books. I thought it might be pretty good. I haven't read hardly any romance books or that much historical fiction. Anyways. With Every Letter turned out to be a beautiful, lovely, heartfelt romance story. I really liked this book. It was so enjoyable.Set during World War II, this Christian romance novel has a lot of history put into it. Philomela Blake is excited to soon start training as a flight nurse. She will be one of the first women to do so. But she does not want to write an anonymous letter to a man she has never met as part of a morale-building program. Lieutenant Thomas MacGilliver, stationed in North Africa, is ecstatic to be able to have a anonymous correspondence. He's been running from his name for most of his life. Soon they develop a unique and close (well, as close as one can get with letters) relationship, but they are still too afraid to show who they are. Will they ever get the courage, the strength to reveal themselves?It took a bit to really get into this book, but I was soon hooked. I really loved the setting of this story. It was such an dangerous time that everyone was affected by. It took a bit to really get into this book, but I was soon hooked. Philomela (Mellie) and Thomas (Tom) were great characters. I really felt for them. Their hardships, their fears, their joy, their anger, it was so realistic. And the war, it felt so real and there. Very close to the end, I felt like the romance went a little over the top for a moment, but it wasn't terrible. There was also some strong Christian elements that added to the story in a good way.Those who love a pretty clean romance story that has some strong Christian themes, I'd highly recommend this book to them. It was a refreshing read.You can check out this review on my blog too, at: https://aheartredeemed.wordpress.com/... Thanks!"}, {"userName": "Hannah", "userReviewDate": "Mar 01, 2015", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "So, after reading this awhile back and talking about it a great deal, I'm finally getting around to actually reviewing it. Normally I don't like WW2 fiction, but this one transcended genre and gave me all sorts of interesting historical facts. I loved reading about how Mellie's group learned to be a real team, and how she learned to be a support and help to her new friends. I also loved the letter-writing part; I've got a weakness for stories like that, especially with the added twist of them getting to know each other in real life. One of my favorite books of the year!"}, {"userName": "Elevetha ", "userReviewDate": "Jun 14, 2014", "userURL": "http://www.goodreads.com/user/show/11828657-elevetha", "userReview": "2.5 mush-filled last chapters.Mellie doesn't want romance. Or really, she doesn't think she'll get friendship let alone romance, so it's better to tell herself she doesn't want it. Tom thinks he'll never find love, or a real friend, because all the would-be prospects are scared off by the stigma of his last name and family. So when an anonymous morale-boosting letter campaign begins, who should end up paired together but Mellie and Tom, who form a strong friendship and fall in love... with every letter. The only thing that saved this from being utterly all too convenient was that Mellie's letter is originally thrown away by some disgusted man who scoffs at her desire for friendship, rather than romance, from the letter campaign. Tom immediately perks up and picks her letter out of the trash, responding nearly as fast as he can grab a pen. Now after some time, roughly 100 pages, Mellie is transferred to Tom's location, and she instantly figures out that her pen pal, Ernest, is really Tom. Tom, however, is stuck for 75% of the book attempting to \"stay true\" to Annie, whom he has come to love through their letters, and trying to suppress his attraction towards Mellie, the flight nurse, never realizing that they are, in fact, the same person.Meanwhile, Mellie is trying to juggle her growing, and also decaying, friendships with the other flight nurses, some of whom are very sweet, or at least try to be(Georgie, Rose, and Kay), and some of whom are conniving and back-stabbing(Alice and Vera). Come the moment, roughly 400 pages in, when \"Annie\" gives in to \"Ernest's\" pleas that they tell each other their names, etc. WARNING: OOEY GOOEY MUSH FEST. My goodness. The book started to get sticky, there was so much sap oozing from the pages. So that wasn't handled as well as it could have been. Tom was just way too...unbelievable. And announcing that you will be proposing marriage as soon as \"she's ready\" didn't seem like the right thing to say at that point in time. Sometimes you feel like a couple has gotten to that point, no matter how much time has actually elapsed, and then there are some couples that simply don't feel ready. Tom and Mellie were just such a couple. Irregardless, the setting of the story was great and everything seemed historically accurate, though I have but limited knowledge, but I thought the pacing of the book and the writing of the romance, most especially it's culmination, dragged the story down a bit."}, {"userName": "Mikayla", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/14064833-mikayla", "userReview": "[Tom says he doesn't want to even ask Mellie to marry him right away. I wish he had respected her a bit more. (hide spoiler)]"}, {"userName": "Abigail Mitchell", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/8014951-abigail-mitchell", "userReview": "Wow that was Fantastic!!! Another top favorite author!"}, {"userName": "Rebecca Carter", "userReviewDate": "Mar 18, 2014", "userURL": "http://www.goodreads.com/user/show/29766945-rebecca-carter", "userReview": "REALLY enjoyed reading With Every Letter!! :)"}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Sep 23, 2012", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "Some of my most favorite and memorable movies are the old classic black and white movies starring Jimmy Stewart, and one of them is The Shop Around The Corner. It set the precedent for the newer movie, You've Got Mail and also the premise and background for Sarah Sundin's latest novel, With Every Letter. This is the first in the Wings of the Nightingale Series and being a huge fan of WWII fiction novels, I knew I wanted to read this one.The book introduces us to two very different but similar characters. The first is Lt. Philomela \"Mellie\" Blake who we meet as a nurse at the Walter Reed Army Medical Center carrying for her patients while awaiting a response to become a flight nurse for the upcoming Air Evacuation Group that was forming in Bowman Field in Kentucky. When the Army Air Force announced plans to train nurses to assist in air evacuation, Mellie had begged the chief for a recommendation. Flight nurses would fly into combat areas, load the wounded, and care for them in the air. They would be stationed all over the world, and she hoped even in the Pacific, close to her Papa, who went missing when the Japanese conquered the Philippines a few months earlier and she doesn't know his fate, but believes he is still alive.Yet the biggest challenge facing Mellie is her lack of social skills in making friends. She can work magic caring for the patients she oversees but forming any long, lasting connection, is near to impossible for her. When she is asked by chief nurse to participate in a letter writing campaign to boost morale and encourage the men serving in the armed forces, she is more than fearful. If she can't maintain relationships with men or women, how can she possible participate in this. But with encouragement from her chief nurse, she willingly agrees and finds that perhaps she might be on her way to something that might open doors for her to finally make friends.Lt. Thomas MacGilliver Jr is the lucky recipient of Mellie's attempt at friendship through the letter writing campaign and they both have been asked not to reveal any details or names but to keep the letter writing as professional and encouraging on both ends as possible. Thomas is made aware that the letter writers are flight nurses and that is about as personal to her identity that Mellie and Thomas can be. What he finds is a fellow soul mate that speaks the same language she does. He, too, has a difficult time making friends and finds that aside from leading a platoon of men into war, that is about as far as his relationships go as well. He also has a dark past that he is trying to escape from and with Mellie's help, he may finally put his ghosts from his past to rest once and for all. So he finds a true friend through his letter writing with Mellie and that is the true treasure of this book.It shows how much a letter from someone can really encourage one another through the hardships and trials of war. What may start as a friendship may lead to something more as Mellie and Tom get to know one another without revealing too much and find a love that goes beyond mere words on a page. It's taking the movie premise of letter writing to a completely different and timeless level in this wonderful book and what happens along the way is worth reading this historical novel. I can't wait for the next book in this series. I received this novel, With Every Letter, compliments of Litfuse Publicity for my honest review and have to say this one rates a 5 out of 5 stars in my opinion. For those of you that love a great historical romance set in the midst of WW2, then you will truly LOVE this novel!"}, {"userName": "Sydney Elaine", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/4519458-sydney-elaine", "userReview": "Check out the review on my blog: https://sydneyelaineblog.wordpress.co...Oh my goodness.. Where do I even begin?I just cannot even begin to describe how much I loved this book. I absolutely adored Mellie. I'm a very shy person myself, so I could completely relate to her. That's something I really love when I read books. I understood her fears, her solitude, and her distress for having to come out of her shell. Throughout the entire book I was thinking how similar we were in character and in thought. One quote I loved was not really a quote, but more of statement, and one that is very true and real. \"Overcoming shyness was hard work.\" How true it is.I really loved Tom, as well. He reminded me a bit of Steve Rodgers, better known as Captain America. It made me think of Steve when I read this section of the book: \"Fear as a means of control? 'That's not the kind of man I am, sir.'\" It made me think of in the second Captain America movie when he said this: \"Yeah, we compromised. Sometimes in ways that made us not sleep so well. But we did it so that people could be free. This isn't freedom. This is fear.\" Any who, I'm getting off track.Basically this was an amazing romantic story that just made you want to scream and yell at the characters (which is always a good thing, if you ask me. :)) I also really loved that there were mentions of God throughout the whole book, and it wasn't overly preachy. It felt... normal. It didn't feel like Sundin was trying to force Christianity down your throat, like some authors do.The romance was super cute and sweet, although there is a section where one of the Captains is cheating on his wife with a nurse.The language is pretty clean, though there is one mention of the word sl-t.Violence is pretty minor, but because this is a book where the characters are soldiers and nurses, there are descriptions of wounds.I highly recommend this book to all lovers of World War 2 fiction."}, {"userName": "Megan", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/5372197-megan", "userReview": "With Every Letter is an amazing novel! It’s rich in detail about WWII, but doesn’t overwhelm you in it. Mellie Blake is a woman who is shy, scared of putting herself at risk and so is very lonely. She has a hard time making friends, mostly because of her preconceived ideas of how people see her – which were ingrained in her from her childhood, when children would make fun of her. Lt. Newman, Mellie’s chief nurse, loves the movie Shop Around the Corner and gets an idea of how to do something like it in real life. With the help of her husband, Capt. Newman of the 908th, she has all the nurses in her charge write letters to all the men in her husband’s platoon…anonymously! Mellie at first didn’t want to participate in it, but she was ordered to do so. Her letter finds its way to Tom MacGilliver, a man who has been teased mercilessly since childhood because of what his father did. Tom has never had any real friends because of it, and sees this anonymous letter writing as a Godsend. He can confide in someone and not have to worry that he will be rejected because of his name – which is one of his deepest concerns. Unbeknownst to one of them, they meet in real life, but will they connect as much as they do in their letters? Or, will fear of rejection keep them apart? The ending was SO funny and romantic! I have read all of Sundin’s books and she has a way of capturing my interest from page one. I get lost in her books and hate it when I reach the last page – I am greatly looking forward to reading the next book in this series. I highly recommend this book to anyone who loves historical fiction.“Available September 2012 at your favorite bookseller from Revell, a division of Baker Publishing Group.”***I received a complimentary copy of this book to review. I was asked to give my honest opinion of the book - which I have done.***"}, {"userName": "Shantelle", "userReviewDate": "Feb 21, 2012", "userURL": "http://www.goodreads.com/user/show/5482096-shantelle", "userReview": "Another captivating World War II novel by Sarah Sundin. I LOVED her Wings of Glory series, and was so excited to read the first book to her Wings of the Nightingale series, With Every Letter. It was so worth the wait! I was once again pulled into the treacherous era of one of the world wars; this time, with Lt. Mellie Blake, whom I found charming despite her shy nature and awkwardness in social situations. I also loved Lt. Tom MacGilliver and ached for him as he struggled with things that reminded him of the past—his father’s murderous past. Their anonymous romance through letter writing was so, so sweet and captivating. Such a different romance story, yet completely beautiful.  I could go on and on, but I don’t want to reveal and ruin the story for people who haven’t read it! Hopefully this is enough to get you interested, because this story is SO not to be missed! A stunning work of fiction during World War II. Two amazing characters. A dark past that continues to threaten lives. One gloriously beautiful romance. If I were you, I would go pick up this book and start reading right away! :) "}, {"userName": "Sarita", "userReviewDate": "Mar 30, 2015", "userURL": "http://www.goodreads.com/user/show/37168935-sarita", "userReview": "This was my first book by Sarah Sundin and I thoroughly enjoyed it. My husband and I recently traveled to Europe and learned more on World War 2, so I enjoyed the setting of this book.The letters between Mellie (Annie) and Tom (Ernest) was cute and innocent and based on true friendship and a basis of being your true self when know one as their minds already made up about who you are.Mellie and Tom both have big struggles with their self worth and it was good to see how they grew and helped each other discover who they are and overcome the boxes others placed over them.The ending spoiled it a bit for me - the love declarations and \"darling\" was too cheesy for me.Recommended for readers who love Historical Romance."}, {"userName": "Elinor", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/11258836-elinor", "userReview": "Although I haven't read an inspirational romance for years (not since the Grace Livingston Hill stage I went through in my youth), I'm giving this novel five stars because, given the parameters of the genre, I don't see how it could be improved. I love the World War Two era, and this novel felt true to the period. The work done by flight nurses was unknown to me, and quite fascinating. The heroine was an American-Filipina, who felt out of place among the other nurses, which gave her character more depth. And the novel stressed the importance of mail in wartime, and how one's deepest feelings can be more easily revealed in writing. Fundamentally, this was a love story that endured some maddening obstacles before the final resolution. With Every Letter is Sarah Sundin's first novel, and two more books follow in the Wings of the Nightingale trilogy. She has a successful career writing about American women in uniform, and her tenth novel will be published in 2018."}, {"userName": "Kate", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/51950019-kate", "userReview": "For anyone who enjoys the movies Shop Around the Corner or the remake called You’ve Got Mail this book is just for you. The book With Every Letter is the first in the Wings of the Nightingale series. The author is Sarah Sundin who writes books based back in WWII era. The plot for With Every Letter tells the tale of a Lieutenant named Philomela (Mille) Blake. Millie is an outside from most of the other flight nurses in her quadrant. She has lived with her father most of her life due to the fact that her mother left them at a young age for someone else. She has never been able to make friends and so she has been alone most of her life. She feels that she is unattractive and has low self-esteem about herself. There is another character in the book which is the main character and that is Lt. Tom MacGilliver. Like Millie he too has had his sure of terrible growing up. His father was a murder and everyone thinks and feel (even Tom) that Tom will be just like him. He tries hard to stand apart from being his father’s son and everyone won’t let him. Obviously the two share a lot in common and thanks to Lt MacGillvier’s commander who wants the boys to have pen pals the two of them shall cross paths soon. The boys need some encouragement and boost of their moral and so thus starts the letter writing. Everyone in Toms outfits gets letters from women in the service and all are pleased except for one. The one officer gets a letter and he throws her in the trash can. Tom being the gentle, kind and warm hearted person feel compelled to write to the unwanted correspondent. Little does he know that this little gesture will change his world forever. Millie eventually does make friends with two gals named Rose and Georgina. And of course like all books and movies there are always those girls who are the popular, snobby and self-righteous. Kay, Alice and Vera are these such girls though as the book goes on, you tend to like and see another side of Kay that makes you like her and feel sorry for. I don’t want to give too much more away so you can get the book and read it yourself. While you probably can guess what happens with Millie and Tom, there is so much in the middle of the book that makes the book what it is. Like all good books there is love, friendship, betrayal, mercy and of course a happy ending for all. This book will make you laugh, cry, cherish friendship and feel warm inside."}, {"userName": "Melanie", "userReviewDate": "Feb 24, 2012", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "Review on Amazon: http://www.amazon.com/review/R1GX22EA...Review on my blog (to be posted 9/27): http://christianbookshelfreviews.blog...4.5 stars.I haven't read any of Sarah Sundin's previous novels, but I've heard great things about them, and I was looking forward to reading her new release, With Every Letter.The concept to the story was intriguing to me (two people writing anonymous letters to each other) and, I have to say, I loved the \"letters\" in With Every Letter.The characters were wonderful! My favorites being Tom, Mellie, and Clint. Mellie's character was very shy and I could relate to that because I am typically shy and (like her) I hope to overcome that. :) I felt kind of bad for Tom and all he had to deal with from a child on (not going into specifics). And Clint, well, I just loved how he acted when he met Rose....he made me laugh.I loved the story and would have given With Every Letter 5 stars, but, at times, I found it hard to follow because of some of the words used (regarding the military aspect)...this may have only been a problem with me, though.I also loved how mercy was a big part of With Every Letter. Mellie was a great example of not only showing mercy to your friends, but also to your enemies.Overall, I loved With Every Letter and recommend it if you enjoy historical romances set around WWII. It was great and I look forward to reading book two in the Wings of Nightingale series.*I received a complimentary copy of this book for my review. I was not required to give a positive review, only my honest opinion - which I've done. All thoughts and opinions expressed are my own.*"}, {"userName": "Beth", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/51465722-beth", "userReview": "A great read!The setting was incredibly interesting. I haven't come across many books that focussed on Northern Africa during WW2 or the important logistical/engineering aspects of war. The pioneering work of air evacuation with nurses on board was something I'd never even realised had occurred! I very much enjoyed learning about these unfamiliar subjects and want to do some more research myself.Both main characters were strongly affected and shaped by their disfunctional pasts and a lot of their development was how they overcame, forgave and moved on. Tom and Mellie both had a variety of flaws but I found that made them really likeable and more real. I was cheering them on all the way, both as a couple and as individuals :)The seconday characters were all well written and distinct - the book felt quite alive with people!The romance was sweet and done very well, the letters were so good - I would absolutely fall in love with someone if they wrote me letters like that!! It was fun to see how it would all work out, and it was very satisfying when it did. A sprinkling of cheese, but the good kind! :)The Christian elements were encouraging and uplifting, Mellie's focus/approach on prayer and mercy was very interesting for me.There were a few little things that could have been better, but nothing that kept me from massively enjoying the book. In fact, as soon as I finished With Every Letter, I immediately bought the remaining 2 titles in the series, I'm so looking forward to reading them!"}, {"userName": "Jocelyn Green", "userReviewDate": "Nov 10, 2012", "userURL": "http://www.goodreads.com/user/show/6887032-jocelyn-green", "userReview": "When I read Sarah's first book, A Distant Melody, I considered it one of the best books I had ever read. But she just keeps getting better! Readers who pick up With Every Letter with high expectations will not be disappointed. The characters are unique and well-developed. Both the hero and heroine start out with huge obstacles that threaten to interfere not just with romance, but with their ability to relate to the rest of the world, for the rest of their lives. The stakes are high personally, but also in terms of their contributions to the war effort. Both of them are in positions to save or lose many lives. The research for this novel alone is mind-boggling, as I discovered as I was whisked all over northern Africa. With Every Letter is another home run for Sarah Sundin. If you are interested in World War 2 history, you simply must read this tale. It's sure to satisfy lovers of historical fiction and historical romance everywhere. ~Jocelyn Green, author Wedded to War"}, {"userName": "Melmac MacDonald", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/5057157-melmac-macdonald", "userReview": "In general I found the characters in this book to be laughable, I seriously did laugh out loud a couple times. Mellie and Tom are written as extremely immature, almost simple, people. I kept thinking they didn't need each other they needed some serious counseling to deal with their issues. The writing is very elementary, I kept checking to see if I was reading a young adult book. To say the storyline was contrived would be putting it mildly. I usually can see past that if the characters save it, in this case they did not. The story in general was a good idea but the way it was written did not do the story line justice.I'm sorry to say I was extremely disappointed in this book and will not be looking to read the next one in the series.My thanks to Revell Publishing for providing me with a free copy of this book in exchange for my review. melmacsreviews.blogspot.com"}, {"userName": "Christy", "userReviewDate": "Jul 26, 2015", "userURL": "http://www.goodreads.com/user/show/22090735-christy", "userReview": "I enjoyed the writing style in this story I just didn't care for the story-line itself. This was free at amazon and a new author to me so I thought I would try it. Mellie and Tom exhausted this read for me; it started out well but then the secrets and insecurities just went on and on. Quite frankly I didn't even understand what their issues were; they seemed unrealistic to me. It was a little more romance driven than what I like and not in a cheesy way but in a way where the whole story turned out to be about these letters and Tom and Mellie finding their way. I would try this author again though I just didn't like this particular read."}], "description": "Lt. Mellie Blake is looking forward to beginning her training as a flight nurse. She is not looking forward to writing a letter to a man she's never met--even if it is anonymous and part of a morale-building program. Lt. Tom MacGilliver, an officer stationed in North Africa, welcomes the idea of an anonymous correspondence--he's been trying to escape his infamous name for years.As their letters crisscross the Atlantic, Tom and Mellie develop a unique friendship despite not knowing the other's true identity. When both are transferred to Algeria, the two are poised to meet face-to-face for the first time. Will they overcome their fears and reveal who they are, or will their future be held hostage by their pasts?Combining a flair for romance with excellent research and attention to detail, Sarah Sundin vividly brings to life the perilous challenges of WWII aviation, nursing--and true love.", "title": "With Every Letter\n      \n          (Wings of the Nightingale #1)", "url": "https://www.goodreads.com/book/show/13459177.With_Every_Letter__Wings_of_the_Nightingale___1_", "average": 4.08, "cover": "https://images.gr-assets.com/books/1329949257l/13459177.jpg", "reviews": 502, "authors": [{"url": "https://www.goodreads.com/author/show/2992396.Sarah_Sundin", "name": "Sarah Sundin"}], "type": ["Historical", "Christian Fiction", "Romance", "Christian", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/13459177-with-every-letter", "http://www.goodreads.com/book/show/18869213-with-every-letter", "http://www.goodreads.com/book/show/6633798-a-distant-melody", "http://www.goodreads.com/book/show/7685251-a-memory-between-us", "http://www.goodreads.com/book/show/9467346-blue-skies-tomorrow", "http://www.goodreads.com/book/show/23411607-through-waters-deep", "http://www.goodreads.com/book/show/16117006-on-distant-shores", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}