{"ratings": 337, "userreviews": [{"userName": "Rex", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/60760092-rex", "userReview": "I thoroughly enjoyed Max Brooks' original World War Z. In fact, I listened to the audiobook, loved it so much I bought the novel and read it. Then I listed to the audiobook one more time! I had no idea there as a companion until my daughter, who knows what a World War Z fan I am, told me about it. As before, I listened to the audiobook.I thought it was a great addendum to the original. I liked what I perceived to be a more in-depth treatment by Brooks of the moral, political and personal implications of the zombie virus that almost extinguished mankind. While the original focused heavily on the first-repsonders, scientists and leaders dealing with the outbreak, The Lost Files went deeper into examining some of the opportunists and others who sought to benefit from the situation. He also seemed to include more of the international response - and the variations that came about from different cultures faced with the crisis. It was very broad-reaching and I was glued to the speaker in my car for the duration of a long drive.There are a couple of segments that are much too long. They tell an extended story and go into a great deal of detail and depth, which for the most part was fine. I just found myself wishing the speaker would wrap it up so we could move to the next story. Also I wish Brooks had checked with native speakers regarding the use of very American idioms in their interviews. The accents employed by the actors were outstanding, but in a few places Brooks had them say what an American would say, just with a foreign accent. It seldom work that way in real life.Speaking of the cast, I thought they did a tremendous job of conveying the story of their character. I found them believable and they drew me fully into their tale. It was easy to despise some of them for their despicable actions, while at the same time identifying and sympathizing with others. The standard set in the original World War Z audiobook as more than adequately meet in this companion edition.I highly recommend this if you are a World War Z fan, as I am. (Of course we all just simply ignore the film version, which has nothing in common with Brooks' novel other than the title.)"}, {"userName": "Jenni DaVinCat", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/60467500-jenni-davincat", "userReview": "From what I understand, The Lost Files was released after the World War Z movie was released. To me, this screams cash grab but I wanted to give it a chance anyways because the World War Z audiobook is incredible and I was hoping this would be the same caliber. Unfortunately, it was not even close to being as good as the original audiobook, and again, I understand that these are mostly supplementary stories meant to be listened to with the original audiobook. Basically, these were cutting room floor pieces that weren't good enough to make the original. Unfortunately, many of the stories probably should have stayed there.There were a few that captured my interest and I ended up really enjoying the story, but there were more that fell flat. They were either miscast/misread or ended abruptly or were just plain boring. It was so disappointing. I wanted to love it as much as I loved the original."}, {"userName": "Leslie", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/1599215-leslie", "userReview": "Excellent follow up. Was a little slower than the original but loved many of the additions."}, {"userName": "Jessica Snyder", "userReviewDate": "Oct 18, 2014", "userURL": "http://www.goodreads.com/user/show/25922788-jessica-snyder", "userReview": "thus continues my obsession with zombies.... amazing!"}, {"userName": "Ed", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/9945987-ed", "userReview": "Voices are casted woooooh~"}, {"userName": "Scott", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/11823093-scott", "userReview": "I read the book a few years ago, and liked it. Be aware that the Movie had almost nothing in common with the book. This audio is well done, with good voice actors, and I think it has more material. About 12 hours long. I liked it."}, {"userName": "Nox Veneno", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/11787940-nox-veneno", "userReview": "Not nearly as good as the first edition, but a decent effort."}, {"userName": "Brooke", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/20455454-brooke", "userReview": "Audio Book\tWorld War Z: An Oral History of the Zombie Warby: Max BrooksPairing\tThe movie World War Z would be paired with the audio book World War Z: An Oral History of the Zombie War. Max Brooks’s book is very different than the movie. Max Brooks plays the government interviewer and we hear the grueling accounts of the zombie apocalypse from around the world.Audience\tThis audio book would be a great addition to the library for high school science fiction and fantasy fans. Students would also want to check out this book before or after seeing the newly released movie. The varied voices and accents in the audio version make the story easy to follow. Students interested in stories from around the world and geography would also like to check out this book.SOL\tWHII.16 The student will demonstrate knowledge of cultural, economic, and social conditions in  developed and developing nations of the contemporary world by a) identifying contemporary political issues, with emphasis on migrations of refugees and others, ethnic/religious conflicts, and the impact of technology, including chemical and biological technologies. Review Source\tLibrary Journal, 7/1/2013, Vol. 138 Issue 12, p40, 1pAwards, Honors\tThe original abridged edition, released in 2006, won an Audie Award for Best Multi-Voiced Performance.Selection Criteria\tAccuracy: This book incorporates historical fiction from around the world. Topics such as apartheid, communism, and warfare are discussed through the fictional oral histories.Authority: Max Brooks is a two time best selling author for “The Zombie Survival Guide” and “World War Z”. His work focuses on apocalyptic horror stories.Relevance to Curriculum: Throughout the story the interviewer travels around the globe collecting the primary witness accounts of the zombie apocalypse. Although the story is fictional it relates the geography, political, cultural, and religious issues studied in high school. Topics discussed in the book include communism, apartheid, and democracy.Appropriateness: This book is appropriate for a ninth through twelfth grade reading level. A student interested in horror, science fiction, or apocalypse would enjoy this book. I think this book would be appropriate for an eleventh or twelfth grade student on an intellectual level to understand all of the cultural backgrounds portrayed in this story. I think a high school student could also handle this story emotionally, although I would advise them that there is strong language used.Scope: Brooks covers political and cultural topics from around the world while relating it back to the zombie apocalypse. Literary Merit: The quality of the voice overs are exceptional. The accents represented sound authentic and help the listener follow the story.Value to the Collection: This book would fill a gap in the horror section of the library while still providing educational content. It would also be popular due to the recent movie based off of the book.Ordering Info\t$40ISBN: 9780449807897http://library.booksontape.com/bookde..."}, {"userName": "04PaulM Murawski", "userReviewDate": "Oct 28, 2013", "userURL": "http://www.goodreads.com/user/show/23725394-04paulm-murawski", "userReview": "Title of book, World war z Year published, 2006Author, Max brooksWho is the intended audience of the book, teens to young adults?Story summary: Through a series of oral interviews, describes the history of 'World War Z'. Although the origin of the zombie pandemic is unknown, the story begins in China after a zombie bites a young boy. The Chinese government attempts to contain the infection and concocts a crisis involving Taiwan to mask their activities. The infection is spread to other countries by the black market organ trade and by refugees; an outbreak in South Africa finally brings the plague to public attention. In South Africa, the government adopts a plan drafted by ex-apartheid government official Paul Redeker, which calls for the establishment of small \"safe zones\", areas surrounded by natural boundaries and cleared of zombies. Large groups of refugees are to be kept alive outside the safe zones to distract the hordes of undead, allowing those within the safe zones time to regroup. Various governments worldwide adopt their own versions of the \"Redeker Plan\" or evacuate to safer foreign territory. Since zombies are known to freeze solid in the cold, many civilians in North America flee to the wilds of northern Canada; approximately 11 million people die, many from starvation and exposure.During a conference near Honolulu aboard USS Saratoga, most of the world's leaders indicate they want to wait out the zombie plague, but the US President successfully argues that the only way to survive physically and psychologically is to go on the offensive. Determined to lead by example, the United States military reinvents itself to meet the specific challenges involved in fighting the living dead: automatic weapons and mobility are replaced by semi-automatic rifles and formation firing, troops are retrained to focus on head shots and slow, steady rates of fire, and a multipurpose hand tool, the Lobotomize or \"Lobo\", is designed to destroy zombie heads close up. In two north–south lines stretching across North America, the U.S. military leaves its safe zone west of the Rocky Mountains and crosses the continent, systematically destroying the zombies and reclaiming outposts of survivors (whether they want to be reclaimed or not).What I liked most about the book is, its realness and its break of funny parts in serious situations And I would recommend this book to, anybody that likes zombies Review by Paul Murawski"}, {"userName": "Susanna Parker", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/4375102-susanna-parker", "userReview": "I would say the weakest part of this excellent audio book is Max Brooks himself. Though an incredible author, voice acting is maybe not his forte. In Brooks' hands, the Interviewer is regularly just slightly... off... in his reactions to the interviewees. Not always. Brooks choices during his scene with Simon Pegg's Grover Carlson are excellent; the innocuous-sounding but oh-so-leading questions were very well done. But there are other points where Brooks' choices just don't ring true.That being said - this is an amazing audio book. The cast is incredible - everyone really takes their material and sinks their teeth into it. Some standouts include Nathan Fillion, Alan Alda, Alfred Molina, and Common. Common - who knew the man could reduce me to tears with just his speaking voice???If you love World War Z and were especially disappointed by Brad Pitt's take on it, get the audio book. It'll help make up for that disaster of the movie."}, {"userName": "Carlos Trevino", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/12212227-carlos-trevino", "userReview": "Unless you're a very big fan of zombies I don't recommend reading this immediately after putting down the original World War Z novel. While the first 3-4 stories in this book are amazing, the quality of the stories goes downhill from there (in my opinion). After putting this down it's hard not to think that this book was more than likely put out just to try and capitalize on the success of the first or that most of these stories were just \"throw-a-ways\" (stories that are decent but not quite up to par with the others in the first novel)."}, {"userName": "Joseph", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/12212820-joseph", "userReview": "More great stuff from Max Brooks. \"The Lost Files\" are actually just the recorded portions left out of the abridged edition. Audible released an \"unabridged\" version recently as a companion to the movie that combined the abridged with this edition. However, it had technical issues and I decided to skip it. I've read that it has since been resolved, but I enjoyed this nonetheless. Recommend you either listen to the abridged version first, or just buy the new unabridged."}, {"userName": "Jen", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/754771-jen", "userReview": "Didn't enjoy this as much as the other half, though really it's all the same book. However-zombies in space. And under the ocean. It does give an idea of the truly global scale of the situation Brooks created, and the research is well done to make each vignette feel authentic."}, {"userName": "SpaceBear", "userReviewDate": "Jan 19, 2016", "userURL": "http://www.goodreads.com/user/show/28900628-spacebear", "userReview": "Some great entries into the 'oral history' of the zombie war."}, {"userName": "Ross", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/21612188-ross", "userReview": "Probably my favorite audio book ever."}, {"userName": "Terry", "userReviewDate": "Sep 02, 2013", "userURL": "http://www.goodreads.com/user/show/3247484-terry", "userReview": "One of the best audio books I've listened to, the narrator took me there."}], "description": "Fans of Max Brooks’ original abridged recording of World War Z: An Oral History of the Zombie War will be thrilled to add this companion piece to their audio library. Offering listeners five hours of previously unrecorded content, World War Z: The Lost Files features 21 Hollywood A-list actors and sci-fi fan favorites performing stories not included in the original abridged edition. Narrators of World War Z: The Lost Files are Academy Award®-winning director Martin Scorsese, Spiderman star Alfred Molina, The Walking Dead creator Frank Darabont, rapper Common, Firefly star Nathan Fillion, Shaun of the Dead’s Simon Pegg, F. Murray Abraham, René Auberjonois, Bruce Boxleitner, Nicki Clyne, Denise Crosby, Ade M’Cormack, Parminder Nagra, Masi Oka, Kal Penn, Jürgen Prochnow, Jeri Ryan, Paul Sorvino, David Ogden Stiers, Brian Tee, and Ric Young. Max Brooks reprises his role as The Interviewer.  PLEASE NOTE: World War Z: The Lost Files offers the five hours of stories from characters not included in the original abridged recording, published as World War Z: An Oral History of the Zombie War. Also available from Random House Audio is World War Z: The Complete Edition which offers these five extra hours of stories integrated with the original abridged recording.", "title": "World War Z: The Lost Files: A Companion to the Abridged Edition", "url": "http://www.goodreads.com/book/show/17672088-world-war-z", "average": 4.38, "cover": "https://images.gr-assets.com/books/1366897726l/17672088.jpg", "reviews": 19, "authors": [{"url": "https://www.goodreads.com/author/show/5791.Max_Brooks", "name": "Max Brooks"}], "type": ["Horror", "Audiobook", "Horror", "Science Fiction", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/17672088-world-war-z", "http://www.goodreads.com/book/show/8908.World_War_Z", "http://www.goodreads.com/book/show/535441.The_Zombie_Survival_Guide", "http://www.goodreads.com/book/show/2574748-the-zombie-survival-guide", "http://www.goodreads.com/book/show/18166872-the-harlem-hellfighters", "http://www.goodreads.com/book/show/13135342-the-essential-max-brooks"]}