{"ratings": 3, "userreviews": [{"userName": "Wendy", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/16831198-wendy", "userReview": "In \"Worth the Wait\" which I won through Goodreads Giveaways Kiki Chalupnik builds a tale of mistaken identity, romance, misconception and corporate theft that's humorous and intriguing. The story opens with Abby Sinclair lying injured in a hospital bed emotionally shattered after a fatal car crash that stole the lives of her new husband and his best man on their wedding day. Wanting a fresh start to heal Abby accepts a job as the CFO of a resort chain in Forestville, Texas where she never expects to have love rekindled by her boss the handsome self-made billionaire Rob Stevenson.Smitten by his new CFO, Rob is determined that Abby will get to know him not as one of the rich and famous but as a simple working man, so he hides his true identity, introducing himself as maintenance worker Bob York when he fixes her desk drawer. Working to cement their friendship love blossoms but Rob finds it difficult disguising his identity when his friend Jeff and his playboy stepbrothers Steve and Lucas take a fancy to Abby. But, it's especially hard when she discovers an embezzlement of corporate funds in the company that puts her life in danger. The plot is enthralling from the first page to the last as Abby tries to distance herself from her compelling boss only to feel an electric charge whenever he touches her. Although some of the dialogue is artificial the story is absorbing as Abby and Rob not only find love, but a deep sense of faith as they bumble along the rocky road of their romance. In this humorous plot as Rob struggles to ward off the advances of his stepbrothers and friend, and Abby tries to stay professional in their association because of a mistaken belief, there is an interesting subplot with the discovery of a corporate crime. Yet at the heart of this tale is the journey of faith Abby and Rob take; one learning to trust unconditionally, the other's faith re-awakening. The author has crafted interesting, realistic main characters who have lots of heart. Abby Thomas Sinclair who's emotionally wounded after the loss of her new husband is personable and compassionate , reaching out even to the crew of Rob's private jet. Wary and stubborn she's determined not to wallow in fear when her house is vandalized and her life threatened. Robert Stevenson (aka Bob York) billionaire owner of the resort chain can sound arrogant, condescending and controlling; his reputation as a playboy unwarranted. Yet underneath his cool exterior he's a caring, considerate and a generous boss and friend, man searching for the faith he lost and enthralled by a woman who's different to anyone he's dated.I liked \"Worth the Wait\" and can see Kiki Chalupnik's writing style improving with each new novel. I hope we see more of Rob's stepbrothers and his friend Jeff in future romances."}, {"userName": "Nicki Ramsay", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/19144394-nicki-ramsay", "userReview": "An enjoyable gentle read about a young woman who has been through a nightmare experience making a new start. Arriving in Texas to start a new position as CFO to an exclusive chain of resorts, she makes new friends, uncovers fraud and meets the man who will ultimately make her whole again whilst remaining true to her Christian values. I found it a little hard to believe that a man who had apparently lived the life of a billionaire playboy and put aside his Christian upbringing, had remained so innocent and was a little disappointed that the ending (I won't say what happens) was skimmed over so briefly. Otherwise, I enjoyed this book and found myself willing for the times that I was able to get some peace and quiet to continue reading the story. I received this book from a Goodreads giveaway."}], "description": "A beautiful Christian love story laced with humor, mystery, and intrigue. When Abby Sinclair tragically loses the love of her life, she wonders if the hole left in her heart can ever be filled. She leaves family and friends in pursuit of a career, never expecting to find love and romance. Abby’s billionaire boss disguises his true identity and the story unfolds.", "title": "Worth the Wait", "url": "https://www.goodreads.com/book/show/30008733-worth-the-wait", "average": 4.0, "cover": "https://images.gr-assets.com/books/1461636847l/30008733.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/15206535.Kiki_Chalupnik", "name": "Kiki Chalupnik"}], "type": ["Romance", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/30008733-worth-the-wait", "http://www.goodreads.com/book/show/38231794-rescued", "http://www.goodreads.com/book/show/37866124-rescued", "http://www.goodreads.com/book/show/37866123-rescued"]}