{"ratings": 2191, "userreviews": [{"userName": "Buggy", "userReviewDate": "Mar 02, 2012", "userURL": "http://www.goodreads.com/user/show/3099666-buggy", "userReview": "Opening Line: \"Captain's Personal Log Stardate 6324.09\"A while ago I caught the classic Star Trek episode All Our Yesterdays on late night TV and got sucked right into the story, as well as just how awesomely cheesy the original series is (I really have to watch it more often) Anyways, I happened to mention the episode to my long time Trekkie Mum who found this tie-in book tucked away on a dust covered shelf (amongst hundreds of others) YESTERDAY’S SON is a continuation of sorts to that original TV episode, playing on the \"what-if\" scenario that Spock and Zarabeth’s little indiscretion 5,000 years ago (due to Gateway Time travel) resulted in a child. (It seems Starfleet doesn’t issue condoms)Spock goes back to the planet Sarpedion and using the mysterious time portal meets his 5,000 year old son. Time travel is so much fun, anything is possible, and while this is way out of the realm of what I usually read, I have to say that I enjoyed it. It’s a well written, clever story, capturing the essence of the original series perfectly while giving us a peek into the minds of our favourite characters.The author obviously knows her Star Trek, managing to include mention of several other episodes along the way which will have Trekkies smiling. There’s a good amount of action involved here including a strategic space battle with the Enterprise outnumbered by the Romulan fleet Go Scottie! and some good old fashioned hand to hand combat too. We also get a ton of Vulcan history - is there like a bible of this stuff somewhere? All the characters are represented in one way or another, remaining true to form. Kirk in all his Captainly awesomeness, Bones who is less grouchy then I remember, taking on a more father like role here and Spock who I honestly didn’t like very much. His character is cold, heartless condescending and frustrating. Yeah I know he’s Vulcan and emotionless but he’s also an a-hole. We also get a glimpse of some doomed red-shirts and spend just enough time with Scotty, Uhura, Chechov and Sulu to make it feel like a real episode.Speaking of Sulu, he has one of my favourite lines from the whole book which is only ironic now 20 years later. He and Uhura are discussing how much Zar and Spock look alike \"Have you ever looked into Zar’s eyes?” Uhura leaned forward a little, lowering her voice.“No--other men’s eyes don’t do anything for me, I’m afraid” Sulu grinned.Ah yes, the science of Star Trek. Cheers.285jb4"}, {"userName": "Sheryl Tribble", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/7290805-sheryl-tribble", "userReview": "Not a fan of the Big Misunderstanding plot, but it bugged me less this second time through (I was re-reading before tackling the sequel). It's not the main plot by any means, and it's a fairly reasonable mix up. On the whole, the plot buzzes right along, the action keeps my interest, and the original character (who is as important as any of the series characters in this book) is likeable enough."}, {"userName": "Jerry", "userReviewDate": "Aug 28, 2016", "userURL": "http://www.goodreads.com/user/show/5855981-jerry", "userReview": "The late A.C. Crispin lives on through her sci-fi works, such as this one, which I enjoyed."}, {"userName": "Charles", "userReviewDate": "Oct 08, 2008", "userURL": "http://www.goodreads.com/user/show/1336573-charles", "userReview": "I really enjoyed this book. The idea behind it is pretty cool. Love these tie-ins with the old series."}, {"userName": "Kawen", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/7823633-kawen", "userReview": "Depois do desafio de leitura de 2016 (li 14 dos 12 livros que havia adicionado ao desafio), o primeiro de 2017 é um presente da minha caríssima Karlinne.E falando em primeiro, foi o primeiro livro com temática Star Trek que li (um universo muito mais interessante que o outro Star não sei o que, aquele conto de fadas sci-fi...) e gostei muito. A história envolve os personagens da série clássica, James T Kirk, McCoy, Spock, Scott, Uhura, Sulu...Gostei demais da representação do Dr. McCoy, o \"magro\". Como seria um médico no século 23? O escocês é praticamente uma mãe, sempre cuidando não só do bem estar físico mas também mental dos tripulantes da Enterprise.Spock também bem representado, mas acho uma pena que ele não ilustre mais espaço na história, sendo um dos personagens principais. Kirk teve seus momentos, mas não me afeiçoei tanto quanto o doutor. Uhura teve pouco espaço, mas brilhou nos momentos em que apareceu.Zar praticamente tem todos os holofotes, várias vezes protagonista e também personagem com um desenvolvimento interessante.Me senti como se estivesse assistindo um episódio dessa que é uma das minhas séries favoritas."}, {"userName": "Katie", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/35222299-katie", "userReview": "Nope nope nope nope nope"}, {"userName": "Amy at Read What I Like", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/3587557-amy-at-read-what-i-like", "userReview": "This is the first Star Trek book I ever read. It must have been my early teen years, maybe 30 years ago, when I picked this one up at the bookstore. Much of the plot was forgotten, only a few parts stuck in my memory. I’m not sure what ever happen to that copy but when I picked up the sequel through a book exchange site I decided to read it again. I also recently watched the tv episode that the events this book are based upon. So the timing was perfect to revisit a piece of my childhood and my love of all things Trek.This was such a good book. I am probably bias here but I loved this book it is by far my favorite Trek book that I’ve read. Ms. Crispin does an excellent job of capturing the chemistry and personalities of the characters it was exactly like reading an episode from the original series, only better! Better because you get to be in the head of Spock, Kirk, and Bones, you get to read the internal dialog of the characters.As to the plot of this book I was totally engrossed I have never wanted to sit two characters down for a talking to as I did while reading this book. Maybe even smack them upside the head… I’m glad there is a second book because while I am satisfied with the ending it was so bitter-sweet, I wanted more for these two. Like I said the book read much like the tv series so if you enjoyed the show you should like this book. If you were a fan of Spock then you are really going to love this one! Looking forward to the next."}, {"userName": "Clint Hall", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/12839675-clint-hall", "userReview": "This is the fourth (fictional) Star Trek book I have read to try to remind myself of the good ol' years of Trek. And I find it difficult to review.In my mind, I have created certain criteria for how a Star Trek novel should read. Do the Seven Wonders of the 60's have accurate voices? Is the story science-y? Is the story fun and exciting? Does it satisfy my hunger for more episodes of this cancelled series? Well, let me tell you, this book nails the voices of the characters, and feels like you're watching an episode of the show back in the 60's--a forgettable episode, though.That isn't necessarily a bad thing. You can only watch \"Amok Time\", \"Mirror, Mirror\", \"Arena\", \"The Enterprise Incident\", \"The Doomsday Machine\", etc., so many times before you go back to \"Charlie X\" because you can't quite remember what happened in it when you last watched it ten years ago. And that's what this feels like: \"Charlie X\", except with Spock in the father role.Give it a read, if you're a Trekkie. You won't hate it. Maybe you will read it again in ten years."}, {"userName": "Octavia Cade", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/30079754-octavia-cade", "userReview": "A follow-up from one of the original episodes, in which Spock gets an adult son who is brought forward in time from the alien ice age past of his conception. It was an enjoyable, easy read, and Zar was a sympathetic character. I particularly liked his relationship with McCoy, who he seemed to bond with a whole lot easier than Spock. The relationship between father and son was strained at best, but there wasn't a whole lot of tension because I was expecting the reset button, which arrived on schedule and to obvious effect. However, given that so much of the early story focused on Spock, it was a little strange how he almost moved into the background as the story progressed - Zar was very much the main character for most of the book, with the Enterprise crew as much supporting cast as anything. On the one hand this has made for an interesting character study, but on the other I wonder if a more sustained focus on Spock might have made the story more compelling. Still, I understand there's a sequel, so I'm curious to know how that works out."}, {"userName": "Oleta Blaylock", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/2805345-oleta-blaylock", "userReview": "I love any book that has a good portion of the story dedicated to Spock and/or Vulcan. This is the story of the son Spock and Zarabeth had following the ALL OUR YESTERDAYS episode. It is quite a surprise when Spock realizes that he had a son and that he surviving on a planet in the middle of an ice age. While there isn't a great deal about how Spock really feels he is affected much more than he ever has been. It is wonder to watch Zar learn about the Federation and his father. Unfortunately Spock start off like his father must have been with him as he grew up and left for Starfleet. Luckily both men finally come to an understanding of each other. There are a few sad parts to this story and I think that is becoming part of any story involving Spock and his family.It is always nice to read any adventure that involves all the Enterprise crew. It would so nice if there was actually some place that was actually like that in the real world. This story is a wonderful distraction from the worries of everyday life and it is a quick easy read. I look forward to the follow on book TIME FOR YESTERDAY."}, {"userName": "Leila Anani", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/11382973-leila-anani", "userReview": "This is the first of A.E Crispin's two sequels to the season 3 TOS episode All Our Yesterdays - using the premise what if Zarabeth and Spock had a son...?Archaeologists of Sarpedion discover a very Vulcan like figure in a 5,000 year old cave painting. Spock puts two and two together and realises that Zarabeth must have had his son. Kirk and Bones use the Guardian of Forever to time-travel back and find him.Once you get over the very fan-fic esque nature of the premise this is actually a pretty good TOS Trek novel, decently written with very good characterisation. Spock is frustratingly emotionless and harsh in this one as he struggles with how to relate to his son.Thoroughly enjoyed it."}, {"userName": "Ute", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/32647488-ute", "userReview": "This one is a classic, isn't it? Well, I never liked the episode it was based on much. It was a (lesser) repeat of This Side of Paradise that didn't make much sense. But the two books that followed were quite good - if you overlook the genetic problem of Spock fathering a child with a woman of another species, but this was his own problem too (I guess back than nobody thought about genetics very much, TV audience were supposed to be stupid anyway). There are a few points that grate a bit, like the telepathic contact between Kirk and Spock in the beginning (what was the point of this? basically none), but it also has a lot of really good stuff. It also offers an explanation who the Sarpeidons managed to go from hunter-gatherers to timetravel in only 5000 years."}, {"userName": "Mikeandrius", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/35451984-mikeandrius", "userReview": "Ha sido divertido y rápido de leer. Estoy orgullosa de leer a una autora escribiendo scifi y en resumen; me ha encantado. Si os gustan las pelis de Star Trek con Chris Pine (como a mí) o la serie de su tiempo (recuerdo ver solo unos capítulos y reírme mucho), o cualquier otra cosa del mundillo, vais a disfrutar el libro. McCoy es mi personaje favorito, pero me quedo con el trío al completo: Jim Kirk, Spock y él. Como disfruto leyéndolos meterse en líos y la familiaridad con la que se tratan. Y Sulu y Uhura aunque salgan menos, también son lo mejor. Un placer subirme a bordo de la Enterprise a través de una novela. ¡Andrea fuera! 🖖🏻🖖🏻🖖🏻"}, {"userName": "Angela", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/4431436-angela", "userReview": "Spock finds out he has a son on an ice planet in the past. He uses the Guardian of Forever to go and save him. Meanwhile, the Enterprise has to stop the Romulans finding out about the Guardian. This is a decent book, the story sounds like fan fiction but is actually written quite well. There are some great character moments, and even though it is obvious what will happen at the end, it is done in a readable way. A good read."}, {"userName": "Michelle", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/7076337-michelle", "userReview": "This was excellent. I felt like all the character \"voices\" were right from Bones grumpiness to Spock's aloofness. I could almost hear all of Scotties phrases in his accent. The details all fit in with the Star Trek world. It did have a bit of a slow pace at times as much of it is spent on the relationship between Spock and Zar and not so much on action even though the Romulans are there to make some trouble at the end. A great addition to the universe."}, {"userName": "Társis ", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/58269214-t-rsis", "userReview": "O livro em si vale 3,5 estrelas, mas a história é divertida, cheia de referências à série de TV e foi um prazer enorme ler e reviver td isso. Voltar no tempo para rever esses personagens tão queridos, neste portal do tempo real. Assim, acrescentei 2 estrelas extras, uma pra nostalgia e outra para minha memória afetiva. Se vc ler esse livro talvez concorde comigo 😍"}, {"userName": "Michael", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/58238528-michael", "userReview": "Decent read. A lot of these early Trek novels were hit or miss affairs. This one was a solid hit and I would not hesitate to recommend. The characters were spot on and the plot was fast moving. Overall, a 4 star rating. Now on to the next one...."}, {"userName": "Jarrod", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/3687598-jarrod", "userReview": "Fun romp for the TOS Crew."}, {"userName": "Jamie", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/53587416-jamie", "userReview": "Passably decent, time travel paradox laden, continuation of the classic Star Trek episode All Our Yesterdays, more for the nostalgia than anything overly compelling in the story itself."}, {"userName": "Kristina Brown", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/42010300-kristina-brown", "userReview": "This is such an interesting idea and its a shame it couldn't be extended further."}, {"userName": "Craig", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/10132769-craig", "userReview": "Really enjoyed this book. Spock being a dead-beat dad is a fun take."}, {"userName": "Bob Frantz", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/15709357-bob-frantz", "userReview": "i very fast read. I enjoyed it."}, {"userName": "Anderson Tiago", "userReviewDate": "Apr 28, 2016", "userURL": "http://www.goodreads.com/user/show/18339849-anderson-tiago", "userReview": "Star Trek: Portal do Tempo não é uma novidade para os fãs da série e leitores brasileiros de sci-fi de longa data. O livro já havia sido publicado por aqui em 1991, pela própria Editora Aleph, junto a outros títulos da franquia, facilmente encontrados em sebos hoje em dia. No entanto, a melhor série de ficção científica de todos os tempos merecia muito mais que isso.Acredito que, impulsionada pelo reboot dirigido pela mente brilhante de J.J. Abrams e pelo sucesso dos livros de Star Wars, a Aleph resolveu republicar Portal do Tempo no seu atual padrão de qualidade, com um trabalho gráfico excelente; um prefácio assinado pelo criador do site TrekBrasilis, Salvador Nogueira; e um glossário com os termos mais característicos da série, ótimo para quem ainda está adentrando no universo trekker.Embora não possua um Universo Expandido tão bem desenvolvido e organizado quanto Star Wars, o livro da autora A.C. Crispin tem conexões diretas com dois episódios da série clássica de Star Trek, além de citar acontecimentos de vários outros em seu desenvolver. Esses episódios que inspiraram à escrita de Portal do Tempo são: “Cidade à Beira da Eternidade”, considerado um dos melhores episódios de toda a franquia e, principalmente, “Todos os Nossos Ontens”.No primeiro, Kirk e Spock viajam no tempo, através de um misterioso portal consciente conhecido como Guardião da Eternidade. Eles precisam retornar à Terra no século XX para salvar o futuro das intervenções catastróficas causadas pelo Dr. McCoy que, vítima de um acidente com um medicamento que o torna paranoico e violento, havia retornado antes ao passado e acabando por modificá-lo de maneira desastrosa.Em “Todos os Nossos Ontens”, Kirk, Spock e McCoy vão ao planeta Sarpeidon, prestes a se tornar uma supernova, para resgatar a sua população. Contudo, eles são surpreendidos com o fato de o planeta estar vazio. O trio acaba descobrindo que os habitantes haviam se transportado para o passado utilizando uma máquina chamada de atavachron. Um acidente acontece, transportando Spock e McCoy em 5 mil anos no passado, durante uma era glacial. Nesse meio tempo, Spock começa a agir de forma estranha, retrocedendo ao comportamento dos vulcanos primitivos. Ele, inclusive, conhece Zarabeth, uma habitante exilada do planeta, e se apaixona perdidamente por ela. Enquanto isso tudo acontece, Kirk vai parar um período medieval de Sarpeidon.“Acidentalmente, McCoy e eu fomos transportados para o passado, para a era glacial de Sarpeidon. Estávamos morrendo de frio, quando uma mulher apareceu e nos deu abrigo. Seu nome era Zarabeth. Ela fora exilada sozinha, no passado, pela ação de um inimigo. Ficou presa lá, por um processo especial de condicionamento. Fui... afetado pela viagem. Voltei ao que nossos ancestrais eram 5 mil anos atrás. Um bárbaro: eu comia carne. E gerei um filho com Zarabeth. Eu não sabia disso, até há alguns dias.”A história de Portal do Tempo se desenvolve quando Spock descobre, a partir de indícios arqueológicos, que o seu romance com Zarabeth resultou em uma criança. Decidido a salvar seu filho, Spock busca autorização para usar o Guardião da Eternidade e voltar no tempo para Sarpeidon. Ao retornar à era glacial daquele planeta, na companhia de Kirk e McCoy, Spock perceberá que ter um filho não será algo tão fácil assim. Embora seja um rapaz bem-educado, Zar terá que se acostumar com as novas tecnologias de 5 mil anos no futuro, além de se adaptar aos rígidos costumes vulcanos.E foi justamente isso a única coisa que me incomodou durante a leitura. A facilidade e a velocidade com que Zar se adapta a um mundo totalmente diferente do seu, capaz inclusive de realizar cálculos avançados em um curto espaço de tempo, passa uma sensação de irrealidade. No entanto, entendo que isso faz parte do espírito da própria franquia e que não poderia esperar algo mais desenvolvido em um livro tão curto.A situação da tripulação da Enterprise se agrava quando recebem o pedido de auxílio de uma outra nave da Federação. Uma esquadra de naves romulanas se aproxima de Gateway, o planeta que abriga o Guardião da Eternidade, uma arma terrível se cair em mãos erradas. A sua nova missão é proteger o Guardião e impedir que os romulanos desvendem o segredo das viagens no tempo. Tudo isso acontece enquanto a tensão se intensifica entre pai e filho.“Os costumes de Vulcano são antigos e rigorosos. Filhos como eu são chamados de “krenath”, quer dizer “filhos da vergonha”. Os humanos também têm uma palavra para isso: “bastardo”. ”Star Trek: Portal do Tempo entrega justamente aquilo que promete. Uma aventura cativante, divertida e emocionante, digna de fazer parte dessa franquia fenomenal. Acredito que a sua história daria um filme muito melhor do que alguns que acabaram sendo produzidos. Fico feliz que Portal do Tempo tenha sido republicado, alcançando uma parcela nova de fãs, eu incluso."}, {"userName": "R.C.", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/27576182-r-c", "userReview": "Of course, I loved it. It was very well done, so true to the characters created in '66."}, {"userName": "Conan Tigard", "userReviewDate": "Nov 14, 2015", "userURL": "http://www.goodreads.com/user/show/48525684-conan-tigard", "userReview": "Yesterdays' Son takes place during the original 5-year mission, I think, probably near the end of it. I love Star Trek books that tie into the original shows. A.C. Crippin has done a wonderful job of creating a story in the Star Trek world that I remember reading almost 20 years ago. This story has always stuck out in my memory as one to etch into my brain. There are a few places that I even found myself laughing out loud as her characterization of the main players was perfect, and the humor was right on. I quite enjoyed reading about Spock and his relationship with his son, even though it was not as it would be with a human father and son, but fit in well with the Vulcan philosophy. Kirk and McCoy, the other two main characters in this novel, are portrayed flawlessly and the story moves along at a fast pace. This, in my mind, is a classic good old-fashioned Star Trek story that all Star Trek fans will love. This Star Trek cover is a little deceptive as it shows and older looking Spock and a young looking Zar. But from the reading, you get the impression that he should look like Spock in the original series and his son should look about 28 years old, not 16. And if you like this story, don't miss the sequel, Time for Yesterday, Star Trek 39.I rated this book an 8 out of 10."}, {"userName": "Aron", "userReviewDate": "Sep 28, 2014", "userURL": "http://www.goodreads.com/user/show/35148860-aron", "userReview": "I thought this book was just about average, maybe slightly above. But average ST novels to me are pretty good. I love ST novels & have really only read a couple that I just didn't like. I did a little research before reading this book & learned that this was Crispin's fist ST novel. That being said i was pretty impressed,...she wrote the characters perfectly & it was apparent she was very well versed in ST. This was a good story in its own right but the fact that it was a continuation of an episode made it little more fun. Who took me by surpise in this book was McCoy, even though he is not by any means the main character he does play a really strong supporting role that's actually outside of the Kirk/Spock/McCoy dynamic. I'm not a big McCoy fan outside of said dynamic but he really shines here & i definitely gained some appreciation for my least favorite of the Big Three. Until the last few chapters it's pretty much just a one plot story which does cause it to drag a bit. But it does pick back up & ends up making a fun short read & a must for Spock fans. 3.75 stars"}, {"userName": "Zoe Blinko", "userReviewDate": "Aug 14, 2015", "userURL": "http://www.goodreads.com/user/show/16036136-zoe-blinko", "userReview": "A kind of legend among sci fi writers, A.C Crispin does not disappoint in this, now rather old Star Trek novel.This ties very strongly into the being introduced in the \"City at the Edge of Forever\" and the character, Zarabeth, seen in \"All Our Yesterdays\". Spock discovers he is a daddy! The atavachron affected him to the degree that he recessed to the passionate, primitive Vulcan lifestyle prior to that of Surak's philosophical revolution. So what does it mean? He pulls! And, somewhat surprisingly later, when he returns to Sarpeidon, he has a son. Crispin rather beautifully explores Spock's struggle to form a connection with his flesh and blood, pulling us to question whether it was just out of a sense of duty that he went to rescue his son, or whether the stoic Vulcan is actually able to form a visibly emotional connection with his child (because we all know, Spock is most certainley not as unemotional as he claims to be). Read it! I look forward to the next book in the Yesterday saga."}, {"userName": "Mike Crate", "userReviewDate": "Apr 02, 2016", "userURL": "http://www.goodreads.com/user/show/43166946-mike-crate", "userReview": "Yesterday's Son is a great read although I have to admit the 5 star rating has a lot to do with the books sequel but any author that chooses to expand upon an original series episode and do it well deserves all the praise I can give.So we learn that Spock and McCoy's visit to Sarpeidon and their transport thousands of years into its past had significant consequences thanks to evidence found in the archived cultural data. We then get another well known TOS element put to use to address the issue and Ann throws in culture and family clashes, Romulans, tragedy and noble sacrifice which is a heady mixture for her first published novel. Of course the author still has to weave all these elements together and Ann does a great job but this novel is lacking the complexity of her later work but I enjoy it so much I can't bring myself to drop a star:)"}, {"userName": "Anne", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/431213-anne", "userReview": "I haven't read any of these Star Trek spinoff novels, but when I ran across it in a bookstore in Montana, I couldn't say no (heh, supporting America's bookstores can be fun!). Written at about the 6th grade level this wasn't exactly deep and complex, but what it lacked in gravitas it more than made up for in pure fun. Amusing repartee between Spock and Bones? Check! Slashy musings? Check! An unexpected yet delightful Spock, Jr.? (TV shows like Angel could only weep to have a child so charming!) Check! Getting to hang out with our favorite Star Trek peeps? Check plus!I was going to put some tastier quotes in my daily updates, but it read so quickly I finished before being able to do so. Guess you'll just have to pick up a copy for yourself to see what you've been missing (You can borrow mine if you want). Fabulously fun summer read."}, {"userName": "Aaron Scott", "userReviewDate": "Mar 10, 2013", "userURL": "http://www.goodreads.com/user/show/9890867-aaron-scott", "userReview": "While the original five year mission only lasted three years on our TV sets, this left a lot of time unaccounted for that could be added to with novels and comic books. A really nice swift, light read, this Trek novel ties in with classic episodes \"All Our Yesterdays\" and \"The City on the Edge of Forever\" to create a compelling, sometimes funny, sometimes touching story of Spock discovering a son that lives in another planet and in another time.It is odd that the cover shows Spock circa the eighties movies and not as in the series, because this story definitely takes place during the original series time period. It might be it was thought readers would be confused by the other Vulcan being Spock's son, as it is emphasized in the novel that they are not far apart in age thanks to the miracle of time travel."}], "description": "With the help of the Vulcan leader T'Pau, Spock gets permission to use the Guardian of Forever, a portal through time constructed by a long-vanished race, to venture into the past. On another trip into history, on the planet Sarpeidon, Spock had loved a woman who could not return with him to the future, and now Spock wishes to see the son she bore him, 5,000 years earlier. But a Romulan attack on the Guardian's planet could interfere, unless the EnterpriseTM can keep the Guardian out of their hands.", "title": "Yesterday's Son\n      \n          (Star Trek: The Original Series #11)", "url": "http://www.goodreads.com/book/show/1992158.Yesterday_s_Son", "average": 3.96, "cover": "https://images.gr-assets.com/books/1191471406l/1992158.jpg", "reviews": 90, "authors": [{"url": "https://www.goodreads.com/author/show/61277.A_C_Crispin", "name": "A.C. Crispin"}], "type": ["Media Tie In", "Science Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/1992158.Yesterday_s_Son", "http://www.goodreads.com/book/show/216700.Yesterday_s_Son", "http://www.goodreads.com/book/show/25846347-portal-do-tempo", "http://www.goodreads.com/book/show/2957262-yesterday-s-son", "http://www.goodreads.com/book/show/2107325.Yesterday_s_Son", "http://www.goodreads.com/book/show/24152901-el-hijo-del-ayer", "http://www.goodreads.com/book/show/9781904-star-trek-11", "http://www.goodreads.com/book/show/29355597-portal-do-tempo", "http://www.goodreads.com/book/show/617086.The_Paradise_Snare", "http://www.goodreads.com/book/show/598938.The_Hutt_Gambit", "http://www.goodreads.com/book/show/111019.Rebel_Dawn", "http://www.goodreads.com/book/show/217758.Sarek", "http://www.goodreads.com/book/show/335014.Time_for_Yesterday"]}