{"ratings": 1386, "userreviews": [{"userName": "AMEERA ", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/32325414-ameera", "userReview": "3.75"}, {"userName": "Briar's Reviews", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/32054036-briar-s-reviews", "userReview": "Zodiac Unmasked was an interesting take on the real life incidents revolving around the Zodiac Killer.This book could have been a LOT shorter than it is, there is almost so much content in this book I got bored (and I am OBSESSED with conspiracies and theories, I'll sit through long books and videos any day of the week). I almost quit this book completely because it was boring me to death. I did love all the research and information within this book, but it was almost too much. This is one of many theories of who the Zodiac Killer was, and it truly is fleshed out. It may not be 100% correct, but it was a good read if you want to look into the information surrounding this theory.The positives within this book is the amazing content within it, but that also ties with my major negative: it's long, repetitive and becomes quite boring due to those two factors. The theory itself is confusing and long, but that doesn't mean the book needs to be over 500 pages of repeating the same stuff over and over and over. I did enjoy the fact that the book was in chronological order, but I also felt that it didn't need to be. I would have loved all the hard hitting facts and awesome plot points first before all the boring, nitty, gritty details. Overall, I'm not totally impressed with this book. It bored me to tears and I almost stopped reading it.1 out of 5 stars."}, {"userName": "Jim", "userReviewDate": "May 20, 2014", "userURL": "http://www.goodreads.com/user/show/275498-jim", "userReview": "Thank whatever gods may be that this is finally over. The weeks I spent slugging through this I couldn't stop thinking that I could be reading something else! To begin with, let's give the devil his due...Robert Graysmith knows a LOT about the Zodiac killer. Probably more than anyone. He has poured years of his life into interviews with witnesses and investigators: in effect, conducting his own investigation. This was probably a good thing, because the police agencies seemed to be totally inept at the task. The Zodiac practically begged to be caught and probably would have been if there had been any sharing of data by investigating agencies. In any event, Mr Graysmith investigated and compiled so much data that he eventually wrote two books on the Zodiac Killer; this is the second of those books. Maybe the first one was exciting.An investigation is usually a dreary ordeal of endless rounds of interviews, covering the same old ground and asking the same old lame-ass questions. Graysmith drags the reader along with him on these seemingly endless rounds of interviews, dutifully relating every mind-numbing bit of information provided by each witness. Hell, half the book is in quotation marks. I kept asking how a book written about a serial killer could be so dull, but came to the conclusion that this one was written to capitalize on the success of the first book - basically filler, if you will. It was definitely unnecessarily long.Don't get me wrong, Mr Graysmith is a competent writer, and he has me convinced that he knows the identity of the Zodiac Killer. If you are a Zodiac nut you will probably get your jollies by slugging through this. I was mildly interested when Zodiac II and Zodiac III made cameo appearances, but otherwise I found the book a tad on the dull side."}, {"userName": "Erica", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/2796628-erica", "userReview": "The other reviews are correct... this book could have been a LOT shorter. The same information was repeated again and again. We GET it, Robert Graysmith.Truth is, everybody wanted Arthur Leigh Allen to be the Zodiac, including Allen himself. But he probably wasn't. Sure, there were a lot of coincidences that make Allen look like a good match for the killer, but the DNA didn't match. Ugh. Long and repetitive. Obsessive. Don't read this. Read Graysmith's other Zodiac book. That one is excellent."}, {"userName": "Tahsina Syeda", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/19858153-tahsina-syeda", "userReview": "The story of the Zodiac hunt is like a labyrinth; confusing, frustrating and mind-boggling, much like Zodiac himself."}, {"userName": "Jorge", "userReviewDate": "Jul 14, 2008", "userURL": "http://www.goodreads.com/user/show/406559-jorge", "userReview": "Hard to get into at first. Graysmith jumps back and forth in the chronology of this decades-long murder case. The number of players involved (suspects, police, witnesses, Zodiac's victims and possibile victims, journalists, relatives and friends of all of the above) also made this book hard to follow at first. Maybe Graysmith assumes the reader has read his earlier book on this subject — I hadn't. But, Graysmith is an excellent descriptive writer and his obsession with the case becomes as interesting as the murder mystery itself.In mid-read, I watched the 2007 film \"Zodiac\" which helped me at least put some faces to the names of the characters (although the real Paul Avery looked nothing like Robert Downey Jr.!)The vast chunks of compelling content made slogging through the tedious parts worthwhile."}, {"userName": "♥ Marlene♥ ", "userReviewDate": "Jun 15, 2009", "userURL": "http://www.goodreads.com/user/show/1041370-marlene", "userReview": "This is Robert Graysmith's second book about The Zodiac killer.Author Robert Graysmith was on the staff of the San francisco Chronicle when the hooded killer's first letter arived.After 8 years of research Graymsith revealed 100 of facts never before released.. and his own theory of the Zodiac's true identity but they did not caught him.Now 19 years after Zodiac was published it seems they have finally caught him.Zodiac Unmasked!!(I have just read Zodiac and can't wait to read this one.HardbackUpdate January 23st 2008It has been a long time since I read this book but I recall I was very disappointed by this book. It promised answers but in honesty it were just guesses. Lots of repetition."}, {"userName": "Gerry", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/1525599-gerry", "userReview": "I am not too sure how I got to the end of this book for throughout its 500+ it is extremely boring and most annoyingly repetitive. And, by the nature of the fact that the Zodiac killer has never been properly identified, there is no definite conclusion.Robert Graysmith does his level best to convince the reader that Arthur Leigh Allen is the Zodiac and Allen himself did make various confessions and took various actions that would have led people to think that he was the Zodiac. Yes, there were plenty of coincidences that would have led to that conclusion but when DNA evidence was tested, it simply did not match. So, presumably that means that Allen was not the Zodiac.There were copycat killers, named in the book Zodiac II and Zodiac III, and initially it was thought that they might have been the original Zodiac but that turned out not to be the case. So we ramble on about Allen and the possibilities of him being Zodiac and this hypothesis just goes on and on (repetitively) until the book becomes almost utterly unreadable - certainly unenjoyable.I believe that the author has written a first volume about the Zodiac which is supposedly much better, it needed to be for 'Zodiac Unmasked' is absolutely awful."}, {"userName": "Katherine Addison", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/36603555-katherine-addison", "userReview": "See also Zodiac.This book shares with Zodiac the inherently confusing, nebulous, ambiguous nature of its material, but it also has some problems of its own. The worst of which is repetition. Graysmith not only repeats information covered in Zodiac (which I totally admit he couldn't avoid), but he repeats information within Zodiac Unmasked. There was a symposium on Zodiac in 1993, and Graysmith not only gives large chunks of that verbatim, but he repeats the quotes, again verbatim, at other points in the text, without even flagging that that's what he's doing. It's annoying and unnecessary, and somewhere along the line a good editor should have dealt with it. Zodiac Unmasked is about twice the length of Zodiac, and it doesn't need to be.The experience of reading these books, particularly Zodiac Unmasked feels like a matter of form mirroring content: endlessly going over the same ground, looking for things missed or new interpretations or can we get DNA evidence off these thirty-year-old envelopes? Hunting down witnesses who weren't properly interviewed in the 60s, arguing about whether a particular murder or a particular letter was or was not the actual Zodiac's work. (Graysmith loses points with me because he changes his mind about the authenticity of one of the letters and doesn't bother to SAY SO. And it's important because it's the 1978 letter, which he uses as part of his argument for Starr/Allen being the Zodiac--until suddenly, when the DNA doesn't match, he's like, Oh that letter. The fake. (He also, incidentally, does a lousy job of the transition from calling the prime suspect Robert Hall Starr to using his real name, Arthur Leigh Allen.)The matter of that 1978 letter, the one that is sometimes real and sometimes fake depending on whether it suits Graysmith's argument or not, is representative of what happens to evidence in the Zodiac case. Nobody can agree about any of it. And what's really frustrating--and this is not a frustration with Graysmith, this is a frustration that he does really an excellent job of exposing--is the degree to which the fact that this case is unresolvable is due to bad police work at the beginning. Not the part where they didn't have DNA analysis to help. The part where police didn't follow up with witnesses, didn't come back to see if they could identify the Zodiac from a photo line-up (and 20, 30 years later, when other detectives did track them down, they were remarkably consistent in identifying Arthur Leigh Allen, which would have been super helpful back in 1968), where the first guy to interview Arthur Leigh Allen decided, snap judgment, on the spot, that Allen wasn't the killer and therefore wrote the interview up in 100 words or less and never bothered to mention what sent him to interview Allen in the first place. And police departments and sheriff's departments not cooperating with each other, not sharing vital information, the Department of Justice stepping on everybody's toes, evidence getting destroyed, getting lost, getting \"lost.\"I think it's very likely that Arthur Leigh Allen was the Zodiac killer. (If he wasn't, my god, that poor man spent the last twenty years of his life being harassed and stalked by professional and amateur detectives alike. If he was Zodiac, of course, that's not even close to as bad as he deserves.) I have no idea how many of the letters attributed to him he actually wrote (and it puzzles me that in Zodiac, Graysmith presents a complicated but entirely plausible method by which Zodiac could have disguised his handwriting and stymied every forensic document examiner ever born, and then in Zodiac Unmasked, that method just disappears and Graysmith talks about comparing suspect's handwriting to Zodiac's as if he'd never explained why that was pointless). I don't know how many of the possible Zodiac murders he committed. Graysmith got me so confused with the various detectives arguing for and against various murders (all of a sudden we're doubting Faraday and Jensen were killed by Zodiac? what? where did that come from?) that I'm not even sure what's reasonable and what's just tin-hat conspiracy theory bullshit.And it bothers me that Arthur Leigh Allen is convicted--in both Graysmith's books--based on circumstantial evidence and the fact that everyone who talked to him, both detectives and journalists, were subliminally terrified of him. They \"just knew\" that he was Zodiac, and that's not actually evidence. Now, the circumstantial evidence--which includes things like pipe bombs found in his basement--is pretty damning, and I don't in fact believe that an innocent* man was hounded to his grave. But it worries me that that could be what happened.---*\"Innocent\" being a relative term. Arthur Leigh Allen was a convicted child molester, and there were a lot of crimes they could have charged him for based on the 1991 search of his house (being a felon in possession of a firearm, for starters), even if none of them was what they were after."}, {"userName": "Therese", "userReviewDate": "Jan 26, 2009", "userURL": "http://www.goodreads.com/user/show/432425-therese", "userReview": "It is hard for me to review this book because it is very long (like 450 pages) and almost entirely redundant of the first zodiac book. it has like 10 pages of new information spliced throughout & a bunch of painstaking minutiae in between. Had I not read the first Zodiac book, perhaps I would've liked this one. The only reason I did read it-- the first book did not conclusively \"unmask\" the killer -- so i had to read on and find out. right? wrong! just skip to the last page and save yourself the time."}, {"userName": "Jon", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/6635177-jon", "userReview": "This is a good book for detailed descriptions of the crimes and the police procedure. However, the case for the suspect is circumstantial. What the book details is the systematic hounding by the author of his number one suspect, leading to serious invasions of his private life plus quite intrusive action taken by the police, using Graysmith's thesis as justification. The main suspect was hounded to his grave and cleared recently when his DNA did not match DNA know to belong to The Zodiac. Two stars for the history of the case but nothing for the thesis."}, {"userName": "Ron Felt", "userReviewDate": "Oct 28, 2009", "userURL": "http://www.goodreads.com/user/show/2455259-ron-felt", "userReview": "In contrast to the first Zodiac book by the same author, I found this to be poorly written. It was confusing and the author jumped back and forth in time so much it was hard to keep track of what was happening when. Information was repeated and hard to keep straight. I think the author got a little too close to the subject and tried too hard to give every possible detail and in the process lost track of the best way to lay it out."}, {"userName": "Andrea Hickman Walker", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/4258114-andrea-hickman-walker", "userReview": "This is a very interesting book. However, it's badly written, in need of serious editing, and very repetitive. Still a worthwhile read, if you have the brain power to keep everything straight (seriously, there was no need for so much jumping around the timelines), though the repetition will help with that. If it's the sort of thing that interests you, I'd certainly recommend it."}, {"userName": "Lauren", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/10073672-lauren", "userReview": "Being true crime obsessed, I can whole heartedly say I've never struggled to read a true crime book before. It was unnecessarily repetitive, at times I thought I was reading 3 chapters back. It mostly goes between talking about Arthur Leigh Allen and people who talk up his first book. It is to a point of unhealthy obsession with the man. I have no doubt Arthur Leigh Allen did unspeakable things that he wasn't charged for other than child molesting (which is despicable) but in all honesty I think the real unsub knew him and purposely framed him. It was a trail of bread crumbs to him. This book never needed to be written, I'll never re read this and sadly wish I could get my money back. Spare your time and money."}, {"userName": "Liyah Smith", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/72404250-liyah-smith", "userReview": "Too much imagery. Unnecessary imagery. The book was pretty interesting, but it was so long and so boring. I felt as if I watching a five hour documentary showing green light gates and kids running off of a school bus. It was ok, but I wouldn't recommend it. Way too long and way too boring. Not of my liking. I just ended up abandoning the book and moving on to a new one that kept my interest all throughout."}, {"userName": "Rabbit {Paint me like one of your 19th century gothic heroines!}", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/4709630-rabbit-paint-me-like-one-of-your-19th-century-gothic-heroines", "userReview": "Excellent argument on the most likely identity of the Zodiac. I'm convinced tbh."}, {"userName": "Kate", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/51152697-kate", "userReview": "While I lived in the Bay area during the time The Zodiac was active, I lived in San Mateo which seemed a lifetime away from Vallejo, as a new Mom the section I read in the Chron was the Pink section and politics, international and Opinion pages...stuff about murder and mayhem in far away places was not paid attention to. It was a different time, the thought of a serial killer was not in our conscious minds. It wasn't until the 70s that the general public got a concept of the reality that there was among us people who were capable of such mindless violence.This was totally engrossing look at a series of crimes that wore heavily on those tasked to investigate and report them. This was in the day before forensics had the tools we have today and still at a time when the procedures of securing crime scenes and getting elimination data from all who responded was standard practice in smaller departments. It must have been very frustrating for those who worked the case given the lack of cooperation between jurisdictions, and the poor record keeping of well meaning officers which meant that so many witnesses never had follow up questioning.\"You have a smart guy who decides his contribution to the culture is he is going [to] murder people in unincorporated areas mostly manned by small police departments. You know it's pretty easy to get away with it if you're smart.\" While this text covers the timeline and the grunge work of a case where the number of tips almost exceeds a large departments ability to field. It points to the problems that well meaning detectives faced who had only slices of the story...with witnesses being followed up on only years after the prime suspects death.It is like a good detective story where the footwork and persistence and anguish that being unable to solve this crime haunts those who worked it. Unfortunately like most sensational cases which get a lot of coverage copycat crimes are almost a given. The author who worked at the Chronicle and interviewed both police officers from several jurisdictions and as many witnesses as he could find, often ones ignored by detectives had developed a better time line than many of the departments had available to them.It is interesting that the police were given leads on the most like suspect immediately that none of that information was shared, and while eventually the FBI was brought in, not even they were aware of witnesses that had fallen through the cracks, who would not be reinterviewed for decades later, long after the prime suspect had died.Essential read for anyone who enjoys crime fiction, to juxtapose real life with the ease fictional characters solve crimes, as every clue falls into their laps...a thing that rarely happens in real life."}, {"userName": "Alisha Bennett", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/7089145-alisha-bennett", "userReview": "2.5 - I took away a full star for the headache this badly organized book gave me. Zodiac would appreciate the confusion of detail provided obscuring the story."}, {"userName": "Richard", "userReviewDate": "Apr 08, 2014", "userURL": "http://www.goodreads.com/user/show/3142922-richard", "userReview": "Unusual in that a) the book's thesis is likely correct, and Graysmith was the first person to put in the work to connect the dots, and yet b) the book is terribly written and contains volumes of extraneous nonsense on top of valid reporting. Graysmith's primary problem is that he wants it both ways - he wants to establish that his primary suspect was the Zodiac, but he also wants to throw in every other titillating fact, detail or theory at his disposal in order to keep the reader turning the pages, even if it undermines his primary thesis. He mixes facts that are relatively well-sourced (allegedly from police and FBI reports) with conclusory and unsourced statements, pursues utterly illogical lines of reasoning, and so forth. For instance, he harps on the fact that the crimes took place in locations with names that relate to water, implying that this was some sort of secret message... ignoring the fact that the crimes took place in secluded natural locations in a coastal area. There's a reason it's called the Bay Area!"}, {"userName": "Devin McKinney", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/10989187-devin-mckinney", "userReview": "I'm a big fan of Graysmith's first Zodiac book, and of David Fincher's film; I read this sequel in a spirit of sympathy. But in addition to being poorly written, indifferently organized, and sloppily proofread, Zodiac Unmasked has an ultimate effect precisely opposite of Graysmith's intention--that effect being to leave an objective reader pretty much convinced that Arthur Leigh Allen probably wasn't the Zodiac, only a pathetic child molester with a lot of unfulfilled talents who loved the idea of people thinking he was the Zodiac. Graysmith's books should be read: his inside access and marshaling of facts are essential to anyone who can filter out the often specious use to which he puts those facts and that access. But what's badly needed is a definitive history of the case written by a skilled historian of crime without a vested interest in proving \"his\" suspect guilty, even at the cost of vapid speculation, implausible rationalization, and rampant elision of contradictory evidence."}, {"userName": "Beth", "userReviewDate": "Feb 15, 2008", "userURL": "http://www.goodreads.com/user/show/2880-beth", "userReview": "I am having a really hard time getting through this - the author's writing is horrible. He jumps around throughout the book, throwing in awkward and random sentences that at times don't even really have much to do with what he had been talking about.This is going in the DNF pile for now. Maybe I'll pick up when I don't have 20 other books on my shelf to read."}, {"userName": "Raditya Perdana", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/12691176-raditya-perdana", "userReview": "I read this book after watching the 2007 movie Zodiac. I find this book is less interesting than the movie, maybe it's because this book is factual and only covers the real events, whereas the film is more loosely based on real events. But this book surely gave more depth in the Zodiac case for me."}, {"userName": "Brian", "userReviewDate": "Jun 29, 2016", "userURL": "http://www.goodreads.com/user/show/56542658-brian", "userReview": "If you read this there is no reason to read Graysmiths other Zodiac book. Every thing and more is in this book. Great book for those of us who grew up in the era of the Zodiac and lived near him."}, {"userName": "Sarah", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/9850316-sarah", "userReview": "Poorly written. Confusing, non-sequential, and repetitive. Maybe Zodiac is better."}, {"userName": "Matt Alexander", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/54754735-matt-alexander", "userReview": "This is an odd one. Unfortunately, I wasn't able to find a copy of Graysmith's original Zodiac book to read first. This felt a bit unedited, a bit like a collection of notes rather than a cohesive narrative, at first anyway. Once we get to the period of time following the publication of the original book, then things start to fit together more like a continued investigation, rather than a rehash of something older.The last fifth, or so, of the book is very compelling and could form the basis for an interesting sequel to Fincher's Zodiac film.This is probably a good read for a real Zodiac scholar, but for me it was a bit too much of a sausage factory. Graysmith goes over the same points of fact multiple times. Covers the same information with different people, or discusses the same points with the same people multiple times. I read like a journal, which can be interesting for some, but feels a little too loose for me."}, {"userName": "Timmy Stephens", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/36358768-timmy-stephens", "userReview": "Save your money, just Google itI read this book because it was recommended to me by a close friend, and honestly it is one of the worst reads ever. Don't get me wrong the story is interesting, a serial killer who was 'never' discovered, but the read is labourious. It reads like a bad documentary where there entire show is recalled after every ad break, then two minutes of New stuff before the next ad break. What I'm trying to say is this story is the most repetitive thing ever, the name of the suspect is mentioned every other sentence, and his crimes are repeated almost every chapter. You can learn as much about the zodiac killer in 20 minutes of Google searching as you can in 8 hours of reading this book! For your benefit do the former!"}, {"userName": "Morgan Knight", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/52764319-morgan-knight", "userReview": "I love and enjoy almost any book I read. I LOVED the first Zodiac book. I am super interested in Zodiac, which accounts for the extra star rating. However, this book really didn't do it for me. It was a repetitive, boring, and redundant piece of writing that was at times difficult to follow and choppy, and way, way too long. There are multiple times where Graysmith repeats himself with the same wording. It was mostly a much more plodding rehash of the information presented in the first book. It was a real struggle to get through this. When I would sit down to read, I would dread picking up this book. This feeling is foreign to me, and I'm so glad I finally made it through. Good luck with this one!"}, {"userName": "Mark Matzeder", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/8200539-mark-matzeder", "userReview": "Picked this up in a used bookstore. Read Graysmith's original 'Zodiac' back in the early 90s. This is *not* just a rehash of that material. Readers who like True Crime, especially serial killer material, will find this palatable. Most of the book is dedicated to the suspect Graysmith and most of the detectives who worked the case believe is responsible for the Zodiac killings in the late 1960s/early 70s. There is a whole cult community dedicated to identifying the Zodiac; this book will probably not quell their speculations."}, {"userName": "Deborah Farrow", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/27846738-deborah-farrow", "userReview": "very thoroughI wasn't that knowledgeable about the Zodiac killings when I started reading this book. I had heard of them, but didn't know the details. I believe that the author assumed the reader knew about the people involved, because I wasn't sure who some of the people were. Once I figured it out, it was very informative. But, I wish that I had more background information before I started."}, {"userName": "David Ellery", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/77257929-david-ellery", "userReview": "Exhaustive to the point of being exhausting. Well-written, but so dense with detail you'll struggle to take half of it in, and at times becomes a genuine effort to work through. This could really have done with a lot of parsing down and simplifying, and ironically, for all its effort, it doesn't really convince you Allen was the Zodiac. Recommended only for those with a deep interest in the case and plenty of stamina."}], "description": "Robert Graysmith reveals what he feels is the true identity of Zodiac - America's most elusive serial killer.Between December 1968 and October 1969 a hooded serial killer called Zodiac terrorized San Francisco. Claiming responsibility for thirty-seven murders, he manipulated the media with warnings, dares, and bizarre cryptograms that baffled FBI code-breakers. Then as suddenly as the murders began, Zodiac disappeared into the Bay Area fog.After painstaking investigation and more than thirty years of research, Robert Graysmith finally exposes Zodiac's true identity. With overwhelming evidence he reveals the twisted private life that led to the crimes, and provides startling theories as to why they stopped. America's greatest unsolved mystery has finally been solved.INCLUDES PHOTOS AND A COMPLETE REPRODUCTION OF ZODIAC'S LETTERS", "title": "Zodiac Unmasked: The Identity of America's Most Elusive Serial Killer Revealed", "url": "http://www.goodreads.com/book/show/105762.Zodiac_Unmasked", "average": 3.6, "cover": "https://images.gr-assets.com/books/1384019073l/105762.jpg", "reviews": 111, "authors": [{"url": "https://www.goodreads.com/author/show/61248.Robert_Graysmith", "name": "Robert Graysmith"}], "type": ["Crime", "Nonfiction", "Mystery", "History", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/105762.Zodiac_Unmasked", "http://www.goodreads.com/book/show/541661.Zodiac_Unmasked", "http://www.goodreads.com/book/show/1437288.Zodiac_Unmasked", "http://www.goodreads.com/book/show/8585027-zodiac-unmasked", "http://www.goodreads.com/book/show/105760.Zodiac", "http://www.goodreads.com/book/show/7619031-the-girl-in-alfred-hitchcock-s-shower", "http://www.goodreads.com/book/show/13531820-black-fire", "http://www.goodreads.com/book/show/105769.Auto_Focus", "http://www.goodreads.com/book/show/105771.The_Sleeping_Lady", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}