{"ratings": 12, "userreviews": [{"userName": "Mat Nastos", "userReviewDate": "Oct 28, 2012", "userURL": "http://www.goodreads.com/user/show/5782566-mat-nastos", "userReview": "I had absolutely no idea what to expect when I bought this book for my brand new Kindle. I was looking for something fun and different and decided to give \"Zombies Take Manhattan\" a try.After reading it, I cannot give this book a high enough recommendation. It is made up of a series of interconnected short stories that tell about a zombie outbreak in New York City (not just Manhattan) and every single one of them is a ton of fun. The way the author weaves the characters and narrative in and out of the stories keeps things interesting. The only bummer was when it ended - I wanted more!If you like zombie stories with a lot of heart (and brains), interesting characters and some great humor, do yourself a favor and get a copy."}, {"userName": "N.E. White", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/4317061-n-e-white", "userReview": "Marina Bridges puts Manhattan under Zombie siege in this collection of short stories. Funny, witty, and engaging, if you want entertaining zombie stories with character, read this collection. You won't be disappointed. I hope she decides to write more. I can easily see this turning into a long-running series."}, {"userName": "Robin S.", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/20833374-robin-s", "userReview": "I do not like Zombie books. Let me repeat that. I. Do. Not. Like. Zombie. Books. I LOVED this! A collection of separate, but connected, short stories that bleed into each other. Fun read. Read this on my Iphone. Reading much of anything on an Iphone is a pain and I happily devoured this!"}, {"userName": "Helena Sheibler", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/7804251-helena-sheibler", "userReview": "Great stuff, wish there was more. :)"}, {"userName": "Daniel", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/17787531-daniel", "userReview": "Not bad , nice little collection of connected stories ."}], "description": "I 'HEART' New York!Five stories, one great city, and millions and millions of zombies. New York City is the greatest city in the world—and then the zombies come. The apocalypse begins at the sideshow on Coney Island. A disgraced ex-cop takes the ride of his life in “Wheel of Wonder.” “Times Square Is For Tourists,” thinks a timid stage manager. The heart of Manhattan seems like the ultimate hell—until the tourists start eating each other and she learns the true meaning of terror.Off-Broadway stagehands prepare for a \"Siege\" on a theatre roof. With zombies milling below and the sun beating down from above, the question becomes can they survive each other?Residents of a high-rise apartment building are running low on supplies. In “A Trip To The Drugstore,” a gentle man has to leave his erstwhile sanctuary in order to obtain life-saving drugs.Back on Coney Island, “The Child of Child’s” survives by ravaged wits and dwindling supplies. An approaching helicopter could signal rescue, or maybe just the assurance she won’t die alone.Zombies 'HEART' New York!About the Author: Marina Bridges, a former resident of New York City, knows damned good and well that cities are the worst places to be during zombie apocalypses. She is also the author of PICKERS AND PICKLED PUNKS, a collection of short stories about cannibalism, human trafficking, and buying great things for cheap at yard sales.This collection includes a bonus story: \"The Devil His Due,\" by JW Manus", "title": "Zombies Take Manhattan!", "url": "http://www.goodreads.com/book/show/15614321-zombies-take-manhattan", "average": 4.25, "cover": "https://images.gr-assets.com/books/1411271650l/15614321.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/4961307.Marina_Bridges", "name": "Marina Bridges"}], "type": ["Horror"], "outlinks": ["http://www.goodreads.com/book/show/15614321-zombies-take-manhattan", "http://www.goodreads.com/book/show/18004620-junk-mail", "http://www.goodreads.com/book/show/11763288-pickers-and-pickled-punks", "http://www.goodreads.com/book/show/23985535-haven-hall", "http://www.goodreads.com/book/show/21619432-wheel-of-wonder"]}