{"ratings": 839, "userreviews": [{"userName": "C.", "userReviewDate": "Jul 17, 2012", "userURL": "http://www.goodreads.com/user/show/10832609-c", "userReview": "I really don’t think there’s anything in the world that’s going to make me LIKE zombies. But, if I’m going to read a collection of stories about them, I might as well make it count. ZOMBIES: Encounters With the Hungry Dead, published in 2009 and edited by splatterpunk co-founder John Skipp, collects 32 short stories by some of the most respected and established names in the genre, as well as some authors just coming into their own and starting to make their marks. And let me tell you, this thing is serious business. Clocking in at 700 pages and weighing nearly 5 lbs, look at the bright side: if you don’t like reading about zombies, you can use this thing to brain a few when the apocalypse comes. John Skipp definitely knows his horror, knows his authors, and knows his zombies, packing this anthology full of all different kinds of stories and all different kinds of zombies, showcasing the diversity of the genre. And I loved that about this book because, for me it’s most authors’ insistence on writing the same friggin story over and over and over and over and over and over and over and over that so quickly puts me off them as an antagonist in horror fiction. Yes, we get it, the dead have risen and mankind is reduced to a few scrappy survivors trying to eke out a living in whatever random hovel they’ve chosen as their refuge. Next? Now, I won’t say ZOMBIES: EwtHD doesn’t have a few of these types of stories as well, but it’s got so many more of the better kind, the original kind, the stories that give me reason to pause and think there just might be something to this after all. In Robert Bloch’s “A Case of the Stubborns”, Grandpa has died in the night. The next morning, he comes down for breakfast as if nothing’s happened, insisting, “Ain’t nobody got a right to put me six feet under ‘thout my say-so.” In Adam Golaski’s “The Dead Gather On the Bridge to Seattle,” Roger is driving to Seattle to see his sister who is sick in the hospital. He’s kept up to date through intermittent calls from Vivienne’s husband while all over the country, something bad is happening to the recently-dead. This was a very intense, deep and effective story told with a ton of emotion and insight. Another one packed to the rafters with emotion was Jack Ketchum’s “The Visitor” about Will and the way he handles the death, return, and second death of his wife Beatrice. I won’t go into any more plot details as the story is only 6 pages, but those 6 pages lend credibility to many others’ belief that Ketchum is simply one of the best in the business. Excellent story and a great perspective to look at the zombie apocalypse. Cody Goodfellow’s “We Will Rebuild” tells a story of the aftermath of the zombie rampage as the small town of Ocotillo tries to allow their returned from the dead residents to keep their status as law-abiding and law-protected citizens of the world. This was, for me, one of the most unique looks at the zombie story and one of the best-written of the whole collection. Honestly, I could go on much longer; the ratio of good stories to bad is very uneven, in favor of the good, and some of the other names appearing in these pages are immediately recognizable as giants within not only the speculative fiction genres, but in writing in general: Ray Bradbury, Stephen King, Neil Gaiman, Joe R. Lansdale, Max Brooks. The list goes on. Having previously edited three or four other, smaller, zombie anthologies, Skipp had a vast collection of stories to choose from in compiling his be all end all tome and I think he chose very wisely. The book wasn’t without its flaws, but those can be attributed to a simple difference in taste; like I said, I don’t like zombies. But Skipp is a good editor and his commentaries that accompanied each story offered smart insights not only into the stories, but into the level of Skipp’s own expertise in the horror field. While 32 stories and 700 pages doesn’t do a thing to convince me zombies aren’t lame, I do have a newfound respect for John Skipp and his dedication to horror as well as the newfound ability to say that yes, I have read zombies stories that I liked, some that I loved, and they’re not ALL bad. ZOMBIES: Encounters With the Hungry Dead is a respectable work with good intentions and I would have to say it deserves to be on the list of must-reads for horror fans everywhere. And for horror writers? That’s a given. You can’t claim to write horror and by-pass this one for historical and educational value alone."}, {"userName": "Barry Hammond", "userReviewDate": "Jul 15, 2015", "userURL": "http://www.goodreads.com/user/show/5876902-barry-hammond", "userReview": "I'd bought this back in 2009 but finally got around to reading more than the essays at front and back. What a great collection of stories! There's everything from literature like Leonid Andreyev's (an expressionist Soviet writer who went mad after the revolution)\"Lazarus\" and George Saunders \"Sea Oak\" (originally published in The New Yorker), to classic horror masters like Robert Bloch, Ray Bradbury, Stephen King, Neil Gaiman (who has a particularly inventive and interesting story), SF writer Theodore Sturgeon, modern classics by Joe Lansdale, Steve Rasnic Tem, Robert R. McCammon, Kathe Koja, Poppy Z. Brite, Max Brooks, Douglas E. Winter and many others. There's fine writing throughout and although I thought I was immune to repulsion after six seasons of The Walking Dead, the stories get more extreme towards the end and some of them (like \"Lemon Knives'N' Cockroaches\" by Carlton Mellick III) are going to be in my brain for a long time afterwards. A grand and deeply disturbing volume. - B.H."}, {"userName": "Naomi Parrish", "userReviewDate": "Oct 20, 2009", "userURL": "http://www.goodreads.com/user/show/2019870-naomi-parrish", "userReview": "Fabulous, amazing book! From the introduction to the two appendices, this book is non-stop zombies. The stories are the cream of the crop, including old favorites and thought-provoking new stories. The introduction is amusing and well thought out. The appendices detail out a brief history of zombies and the history of zombies in pop culture. Definitely a must have for zombie fans."}, {"userName": "Jeff", "userReviewDate": "Nov 10, 2009", "userURL": "http://www.goodreads.com/user/show/1430752-jeff", "userReview": "The essential zombie fiction collection. If you are a horror fan you need this book."}, {"userName": "Roger", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/5672633-roger", "userReview": "Zombies may be the most complete and comprehensive anthology I have ever read on a single subject. There are all manner of stories about the undead here in seven hundred pages of variety. Editor John Skipp obviously selected these entries with great care. There is not a bad story in the bunch, and the list of contributors is stellar: Stephen King, Robert Bloch, Joe Lansdale, Neil Gaiman, Poppy Z Brite, Ray Bradbury, Robert McCammon, Dennis Etchison, David Schow, Steve Rasnic Tem, Jack Ketchum, and Theodore Sturgeon, among others. An added bonus for me was getting to reread Sturgeon's It! o Originally published in 1940, I had to read it for the first time when I was twelve or thirteen (circa 1977) and now approximately four decades later I find myself returning to the same tale. It still holds up. Zombies was a superlative short story collection, if you are an aficionado of horror fiction."}, {"userName": "Colin", "userReviewDate": "May 09, 2017", "userURL": "http://www.goodreads.com/user/show/20665918-colin", "userReview": "An excellent collection of zombie short stories from some of the best horror writers out there. In a collection this big not everyone can be a winner, but the majority of them are fantastic!"}, {"userName": "Alexis Winning", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/6192649-alexis-winning", "userReview": "I don't do anthologies very often, mostly because I find myself peeking ahead to see how long the story is. Sometimes I do this out of boredom, and sometimes its just habit. I have some mixed feelings about this 700 page book...1. I was about 50/50 on the stories. Half the time I felt excited to read a certain one that had been talked up so amazingly in John Skipp's commentary, but found myself ending the story with a \"meh\". 2. Many of the tales were haunting, regardless of whether or not I had enjoyed them while my mind consumed their prose. I often found myself thinking of a story a day or two after ingestion, which in any art form, equals success. I think part of my problem with the stories that were so highly praised by the editor, is that the short story medium is simply different than a novel. In a book, ideas can be drawn out, explored, crushed, and re-imagined. In a short story, we only have so much time and space to get to the point. I suppose therein lies the problem: often times I didn't quite \"get the point\". 3. There were some interesting appendixes in this book: one describes zombies in Pop Culture, and a historical perspective. I have to mention how utterly disappointed I was with these sections. Skipp attempts to enlighten the audience with the zombie mythos, however contrasted with Matt Mogk's Everything You Ever Wanted to Know About Zombies, it appears as though Skipp neglected some further research, and simply chose to list items in the undead cannon rather than provide any real idea of the zombie evolution. Skipp comments on the evolution of the modern zombie as having arisen from the Voudoo slave. Unfortunately it is well documented that the modern zombie was created by George Romero, as inspired by \"I am Legend\" and the mythos of the vampire. The voudoo zombie and our beloved flesh eating monsters are actually unrelated (aside from the similar title). Another source of contention I need to express is that there was maybe one sentence giving nod to the Walking Dead in popular culture! Along with Romero, I would argue that Kirkman's work in both the comic world and the TV world has had a huge impact of the reanimation of the zombie in popular culture. Some stories to note:Theodore Sturgeon's \"It\" was the very first story I found loving that came from the zombie's perspective. So beautifully written and thoughtful, this story does not demonize the zombie, but describes an alternate reality of primal curiosity\"Best Served Cold\" by Justine Musk is cheeky and entertainingLes Daniels' \"The Good Parts\" is like a car crash. You just can't stop reading. Zombie procreation resulting in living humans?! A staple in many anthologies, \"On the far Side of thee Cadillac Desert with Dead Folks\" by Joe R. Landsdale reminds me of \"Fear and Loathing in Las Vegas\". I have no idea why, but my mind has connected the imagery as such. \"Pavlov's Dogs\" by Steven R. Boyett reminded me of Adam Baker's \"Outpost\". \"Sparks Fly Upward\" by Lisa Morton was one of those lingering haunting stories\"Lemon Knives and Cockroaches\" by Carlton Mellick is included because it is one that sticks out for all the wrong reasons. There really should be a limit on how many times a smelly vagina should be mentioned in a short story. I wonder if radical feminists have used this literary example in their fight against equality and? You know, in a world with limited washing facilities, everyone's gonna smell a little rank. Samurais and the undead?! Yes please! Zaambi by Jerry and Christopher Morgan"}, {"userName": "Patrick D'Orazio", "userReviewDate": "Nov 05, 2010", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "The latest edition of zombie stories overseen by John Skipp contain numerous solid tales from many instantly recognizeable authors. Unfortunately, if you are like me and have read quite a few anthologies out there, you are seeing a lot of repeats, so beware. This book is broken up into \"Old School\" and \"Post Emancipation\" tales. In other words, pre and post Romero type zombie stories. Its hard to go wrong with the likes of Neil Gaiman, Stephen King, Max Brooks, Ray Bradbury, Theodore Sturgeon, Joe Lansdale, amongst others, but again, if you are like me and have picked up several different anthologies over the years you have read upwards of a third to a half of these stories already. This is not to say that this is not an excellent primer for folks who want to get a good cross section of zombie stories, from the extremly subtle to the up in your face, but be prepared to see a lot of familiar stories between these pages. Another reviewer has provided a TOC so I will pass on doing so here. My strongest recommendation for picking up this book will go to those who perhaps have only dabbled in zombie lit and want a really strong group of short stories to look over that go from one extreme (Ray Bradbury's tale, 'The Emissary,' is ominous and foreboding and only hints at the dead coming back to life) to the other (Adam-Troy Castro's story, 'Dead Like Me' has a man essentially destroying everything that resembles life inside himself until he so closely resembles a zombie he is virtually no different) in regards to how involved the zombies are in each story line. I am not a reader who laments the lack of literary refinement amongst authors who write in the zombie sub-genre today. In fact, I enjoy quite a bit that is coming out from some of the smaller publishing houses like Permuted Press and Library of the Living Dead. I also enjoy some of the bigger players in horror and beyond as they take their swipes at the rotting buggers. This book is a good combination of some of the best of both worlds, with today's raw, exuberate violent apocalyptic experience and the more subtle literature from days past. Again, this is a terrific anthology for anyone who wants to take a look at some really quality stuff in the zombie world, but be warned that if you already have a zombie anthology collection you probably will see plenty here that you have seen elsewhere."}, {"userName": "Joe", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/1528196-joe", "userReview": "In my recent experience zombie fiction has tended toward being the most literate and thoughtful genre of modern \"fantastic\" fiction. Perhaps it's because zombies make an almost ideal blank canvas for writers who want to paint our fears. Some of the best, both old and new, have been collected into this volume. Quality and variety are excellent. Better still, the book is helpfully divided into two sections: one featuring the more subtle, servile zombies of the old school, the other the flesh-eating hordes of the post-Romero age. Catholics beware of the first tale, and of the post-script at book's end.Two flaws inhibit me from giving it a full 5 star rating. One is that in selecting so many of the best stories Skipp has given us more than a few that an experienced reader of zombie fiction will have seen before in previous collections, some of them his own. Even the finest of trends reaches a day when the best of the best has been with us for a while. The other is by including so many stories that explore themes afield from the simple zombie apocalypse of recent popularity Skipp's best audience may very well be exactly the experienced readers who have seen some these stories before.I would call this an ideal 5 star collection for recent converts to the zombie genre, watchers of The Walking Dead or readers of World War Z, curious to know just how rich and varied the genre can be. Long-time zombie fans may find it less inviting for reserving meat they've already consumed."}, {"userName": "KG", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/3589624-kg", "userReview": "FINALLY! Clearly I shambled through this mammoth tome of undead variety at the proper pace - that of a revenant wandering aimlessly in search of unfulfillable satiation! Damn - thanks to the date logs of Goodreads, it appears to have taken me almost 3 freaking years! Really? This brick has been dutifully sitting beside my bedside all this time, and being granted occasional attention whenever I needed a zombie fix. And, I would periodically grant it re-emergence from the dead, and read another story or two. That all said, it's a really decent compendium of zombie lore! There are some REALLY thought-provoking stories in this monster! Okay, and there are some only so-so stories, too. But, by and large, it was my fault that it took so long, and not the inability of the stories to draw me along. It's easier to crash on a weekend of \"The Walking Dead\" (TV or Graphic Novel), than to keep reading new variations on the ambling returned - end on end. And sure, I'd recommend this bicep-enhancing free-weight of a novel. It is a wonderful mix of sick, funny, weird, gross, disturbed, twisted, insightful - - and any amalgam of any/all of those in this spectrum. I already have another of John Skipp's anthologies (\"Werewolves and Shapeshifters\") to take me into the next decade, because I like how he thinks, and how he knows art in its most bizarre forms - also, he can spot lesser-known but wildly talented writers with supernatural ability!"}, {"userName": "A. Hunt", "userReviewDate": "May 23, 2016", "userURL": "http://www.goodreads.com/user/show/14150982-a-hunt", "userReview": "[Hard copy edition] If you know me, then you know I am a lover of horror. I can read any genre, I can watch any movie, but in the end, you'll always catch me knee-deep in horror. Zombies: Encounters with the Hungry Dead, edited and arranged by John Skipp is one that definitely satisfied me. I haven't read every single story- there are so many, but enough of them gave me enough to post a review.  This book is LOADED with horrific tale after tale after tale with death, by all the masters of horror! I was very lucky- I found the book at V-Stock, a store that sells both new and used books for less than $15. I honestly believe it was in the wrong spot. The thing is, I'm attracted to large books and this book is huge. 638 pages of pure grossness, walking dead things and people running through apocalyptic streets. *For the full review: http://tinyurl.com/hcg5395**Book is from my personal library."}, {"userName": "Ally", "userReviewDate": "Aug 25, 2014", "userURL": "http://www.goodreads.com/user/show/28424080-ally", "userReview": "I really enjoyed this collection. It was diverse and satisfyingly creepy, but also held some unexpected treasures for me. My favorite story was the Ray Bradbury story. It was surprising to me because the style that I so disliked in Fahrenheit 451, was so hauntingly beautiful here.Note: I was trying to find the name of it to no avail, and until I dig the rest of my boxes of books out of storage I don't know where my copy is.There was also a lot of other great and noteworthy stories in here, and not having read a lot of zombie fiction I didn't find it redundant at all. So all in all... Great authors, an inspired subject, and really wonderful selection. Perfect for someone who wants to delve into the genre while exploring the many facets of the zombie mythos."}, {"userName": "Kris", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/24758789-kris", "userReview": "As with many short story collections (especially anthologies where you get stories by a slew of different authors) this collection was hit and miss. A few stories were excellent, a few were OK, and there were one or two I thought were just plain awful. A few seemed more for shock value/gore than anything else... which I understand because ZOMBIES, but hey, I personally want something more. I'd leave a more detailed review, but I read this over such a long period of time - I started it in October in the spirit of Halloween and got zombied-out and had to take a break before finally going back to it. Next time I read it I will take notes on which stories were worth the time and which were not."}, {"userName": "Cameron", "userReviewDate": "Oct 27, 2013", "userURL": "http://www.goodreads.com/user/show/790655-cameron", "userReview": "If you enjoy short stories and the zombie genre then you might like this collection of works. With 32 short stories from the \"old school\" to the \"post emancipation\"take on zombies, this work has just about everything you could think of. I found the majority of stories to be worth reading with the first (Lazarus by Leonid Andreyev) and last (Dead Like Me by Adam-Troy Castro) being my favorite. I read this book during the Halloween period of the last two years finishing it this year. There is nearly 700 pages of zombie entertainment with main stream focus to some that will stretch your imagination. This is not the book that you would choose when gathering the children around to read some fun Halloween stories. Leave this one for your own guilty pleasure."}, {"userName": "Susan", "userReviewDate": "Aug 28, 2010", "userURL": "http://www.goodreads.com/user/show/1468536-susan", "userReview": "If you like these kinds of short stories, this is a good collection. There's basically none of the authors comments (before each story type) that so many anthologies put you through, and they're top notch stories, some real old, some pretty new. A fast read and easy to put down over and over when you have little time. The author does give a good pre-write up and interesting appendix/history, that you can read if you choose. They are worth it."}, {"userName": "Amanda Soares", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/17467425-amanda-soares", "userReview": "Borrowed this from the library over the summer and I only managed to get about half way through it before I had to return it. This book is massive and the variety of stories in it is great. You get everything from scary to funny to sad. I intend to check it out again and finish reading the stories I didn't get a chance to the first time. Definitely recommend it to anyone interested in zombies."}, {"userName": "Mom gayheart", "userReviewDate": "Apr 22, 2010", "userURL": "http://www.goodreads.com/user/show/3216959-mom-gayheart", "userReview": "This is a good collection of horror short stories. I liked best the editor's comments on each story. He has intellectualized this genre! The stories range from old classics up to \"now\" and they really are the best of the best! I can visualize this as a text for a college course either in writing or literary analysis!"}, {"userName": "Skuli Saeland", "userReviewDate": "Nov 27, 2014", "userURL": "http://www.goodreads.com/user/show/4853280-skuli-saeland", "userReview": "Margar skemmtilegar smásögur sem tengjast uppvakningum. Meðal frægra höfunda sem hér eru má nefna Neil Gaiman og Stephen King þótt þeirra sögur séu ekkert endilega bestar. Ótrúlega fjölbreytt flóra ritstíla og sjónarhorna á uppvakninga, allt frá fólki á flótta undan uppvakningahjörð til sérkennilegs framtíðarlífs uppvakninganna sjálfra."}, {"userName": "Elizabeth Peake", "userReviewDate": "Apr 06, 2011", "userURL": "http://www.goodreads.com/user/show/5071851-elizabeth-peake", "userReview": "I hate typos. This book is full of them. The typo distraction takes away from the few good stories the book has to offer. I can't say I hated this book because I didn't. I just didn't enjoy it as much as I could have because of the numerous typos. A few stories were 4 stars but the rest were 3 stars at best. There are better zombie collections out there."}, {"userName": "Jesse", "userReviewDate": "Dec 03, 2009", "userURL": "http://www.goodreads.com/user/show/1735693-jesse", "userReview": "Lots of reprints makes this compilation redundant if you've already read them, but also serves as a good 'best of' zombie tales from writers like Stephen King, Robert Bloch, Neil Gaiman. Way too long, making it 'thorough' and 'complete' I guess. I think I still liked Mondo Zombie compilation better because it had all the sick sex stories, but this one is worth skimming."}, {"userName": "PrintedAdventures", "userReviewDate": "Dec 22, 2010", "userURL": "http://www.goodreads.com/user/show/4694179-printedadventures", "userReview": "This is such an amazing collection of stories! From funny to sad, disturbing, and thought provoking. It has a lot of different writing styles which kept me reading from one story to the next, and each story is a good read!"}, {"userName": "Kristin", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/3707853-kristin", "userReview": "It may be because I'm not a huge short story person, or I don't care for my zombies in writing, but while some stories were very good, most were just meh - not really instilling anything let alone horror, anxiety, sympathy, or that end-of-the-world feeling."}, {"userName": "John", "userReviewDate": "Oct 14, 2014", "userURL": "http://www.goodreads.com/user/show/4192809-john", "userReview": "more horror than zombie/adventure - not my cup o tea"}, {"userName": "James", "userReviewDate": "Oct 13, 2009", "userURL": "http://www.goodreads.com/user/show/2238286-james", "userReview": "That's my face on the cover. :)http://www.flickr.com/photos/sick_lit..."}, {"userName": "Daniel Cain", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/15316416-daniel-cain", "userReview": "Short stories of zombies including old style voodoo/Frankenstein and the modern versions including max brooks and neil gaimon. Worth reading although you probably have read a few of these stories."}, {"userName": "Dominick", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/22315529-dominick", "userReview": "Some stories were good!"}, {"userName": "Christine Paiva Stewart", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/3464750-christine-paiva-stewart", "userReview": "Excellent collection! Stand-outs were \"A Bad Case of the Stubborns\", \"The Visitor\",and \"The Good Parts\". THAT one was disgustingly awesome!!!!!"}, {"userName": "Chris Cagle", "userReviewDate": "Jun 23, 2011", "userURL": "http://www.goodreads.com/user/show/5676598-chris-cagle", "userReview": "Lots of good Zombies stories in this tomb. Some are really good. Others are just so-so, but overall it's a good book for the collection."}, {"userName": "Trevor", "userReviewDate": "Aug 02, 2010", "userURL": "http://www.goodreads.com/user/show/238637-trevor", "userReview": "If I had to teach a class on zombie horror literature, this would be the textbook I'd assign!"}, {"userName": "Carolyn", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/18074321-carolyn", "userReview": "Nothing like a good dose of the undead...good selection of zombie tales"}], "description": "From a master of zombie fiction and a founding father of \"splatterpunk\" comes a mind-bending anthology of 32 new and classic stories from both renowned writers and rising starsIn the tradition of Black Dog & Leventhal's bestsellingVampires and Ghosts, this anthology of 32 stories is set in a world where the dead have risen from the grave to consume the living. This rich collection showcases the best of the genre?from short-story masters such as Stephen King, Neil Gaiman, Ray Bradbury, and Poppy Z. Brite; zombie stalwarts such as David J. Schow and Jack Ketchum; \"bizarro\" founders such as Carlton Mellick III; and popular up-and-comers such as Max Brooks and S.G. Browne?and will satisfy the insatiable hunger of zombie fans everywhere.A series of captivating essays about zombies in folklore and in popular culture by John Skipp, award-winning zombie anthologist and author, enrich an already extraordinary collection by discussing the past, present, and future of the living dead. And a resources section encompassing the best of long-form fiction, movies, websites, games is included for any reader interested in learning more about the wider world of the undead.Sure to sate the hungriest zombie fans with classic as well as contemporary servings of tangled entrails and other unspeakable meals, Zombies: Encounters with the HungryDead will be shambling out of bookstores in October 2009.", "title": "Zombies: Encounters with the Hungry Dead", "url": "https://www.goodreads.com/book/show/6829356-zombies", "average": 3.9, "cover": "https://images.gr-assets.com/books/1404580825l/6829356.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/51518.John_Skipp", "name": "John Skipp"}, {"url": "https://www.goodreads.com/author/show/3389.Stephen_King", "name": "Stephen King"}, {"url": "https://www.goodreads.com/author/show/9558.Poppy_Z_Brite", "name": "Poppy Z. Brite"}, {"url": "https://www.goodreads.com/author/show/327493.David_J_Schow", "name": "David J. Schow"}, {"url": "https://www.goodreads.com/author/show/90070.Jack_Ketchum", "name": "Jack Ketchum"}, {"url": "https://www.goodreads.com/author/show/1221698.Neil_Gaiman", "name": "Neil Gaiman"}, {"url": "https://www.goodreads.com/author/show/5791.Max_Brooks", "name": "Max Brooks"}, {"url": "https://www.goodreads.com/author/show/2129854.S_G_Browne", "name": "S.G. Browne"}, {"url": "https://www.goodreads.com/author/show/1630.Ray_Bradbury", "name": "Ray Bradbury"}, {"url": "https://www.goodreads.com/author/show/5244478.Robert_R_McCammon", "name": "Robert R. McCammon"}, {"url": "https://www.goodreads.com/author/show/58971.Joe_R_Lansdale", "name": "Joe R. Lansdale"}, {"url": "https://www.goodreads.com/author/show/16625.Carlton_Mellick_III", "name": "Carlton Mellick III"}, {"url": "https://www.goodreads.com/author/show/18841.Cody_Goodfellow", "name": "Cody Goodfellow"}], "type": ["Horror", "Horror", "Anthologies", "Short Stories", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/6829356-zombies", "http://www.goodreads.com/book/show/208161.Book_of_the_Dead", "http://www.goodreads.com/book/show/179182.The_Light_at_the_End", "http://www.goodreads.com/book/show/965315.The_Long_Last_Call", "http://www.goodreads.com/book/show/179184.The_Bridge", "http://www.goodreads.com/book/show/219630.The_Scream"]}