{"ratings": 7, "userreviews": [{"userName": "Pupottina", "userReviewDate": "Jul 20, 2016", "userURL": "http://www.goodreads.com/user/show/21008693-pupottina", "userReview": "\"Aggiustare\" la realtà.\"Non troverai mai il vero amorese non sei disposta ad accettareaanche ciò che non ti aspettavi di trovare.\"La narrativa italiana perderebbe qualcuno di fondamentale se lei non ci fosse.La scrittrice veneziana Erika Favaro è molto brava nel parlare e spiegare tutto quelle che le donne non dicono, ma anche quello che dicono mentre intendono altro. È la voce che parla alle nuove generazioni.Nei suoi romanzi c'è l'amore, con un tocco di ironia, malinconia, ma anche di romanticismo. È UNA BUGIA MA TI AMO è un romanzo per giovani menti romantiche, ma anche per donne che l'amore lo conoscono, l'hanno vissuto, sperimentato e adorano ritrovarsi fra le righe delle vicende narrate da Erika Favaro.Lo stile è leggero, scorrevole, appropriato, ma la storia raccoglie pillole di saggezza per chi l'amore ancora lo sogna, lo vive o lo vuole rivivere nel modo giusto. È un romanzo leggero, spensierato, ma ricco di consigli utili da mettere in atto nelle nostre esperienze romantiche.La trentenne Wendy ha un lavoro che le piace moltissimo, una famiglia allargata e un po' scombinata che adora, un ex fidanzato inutile da dimenticare e un piccolo problema con la realtà. Non è che non veda ciò che ha davanti agli occhi, o che non abbia delle opinioni ben precise sulle cose: è solo che trova tanto più facile dire una bugia, più o meno innocente, soprattutto se serve a far sentire meglio chi le sta intorno. Potrebbe essere, forse, un meccanismo per proteggere se stessa da verità troppo dolorose da affrontare?Forse.La situazione cambia quando Wendy conosce Libero, l'affascinante proprietario del ristorante sotto casa sua. È così che tutto inizia a cambiare, perché lui non è come gli altri. Lui, al contrario di lei, è autentico e sincero. È un uomo da amare veramente."}, {"userName": "La Fenice Magazine", "userReviewDate": "Aug 25, 2016", "userURL": "http://www.goodreads.com/user/show/22195890-la-fenice-magazine", "userReview": "E' una bugia ma ti amo è stato scritto da Erika Favaro, avevamo già recensito un suo libro molto tempo fa. Il libro di cui andiamo a parlare oggi è un libro dolcissimo alla ricerca del vero io e di se stessi.La nostra protagonista è Wendy che ha 30 anni (un pò come me) e ha una vita all'apparenza appagata con il suo lavoro di estetista e amici ma si scopre che Wendy ha anche uno zio/migliore amico malato.La storia è particolare, sconvolgente, a tratti sfuggente proprio perchè alla fine non si comprende perchè Wendy o Guenda o Geuendalina (si sul suo nome vi è una storia che troverete nel libro) si comporti così, sembra non fidarsi più delle persone, sembra dire sempre si a tutto e appoggiare le isterie di tutti. Ma Wendy ha un segreto nascosto, un dolore più grande nel cuore che attraverso le pagine di questo romanzo tocchiamo con mano e sfioriamo quasi fino a farci male, a far sanguinare il cuore. La scrittura elegante semplice e disinvolta ci porta in un percorso di riscoperta, alla ricerca del dolore della voglia di sopravvivere e vivere nonostante tutto. Una ricerca dell'io che molte volte ci sfugge facendoci perdere nel vuoto totale dell'assenza. Ci siamo ma non siamo qui effettivamente. Qualcosa di più grande può distruggere l'anima ma qualcosa di ancora più grande deve essere intessuto dentro noi stessi: la forza di volontà; ed è proprio quella che riuscirà a tirar fuori Wendy, una giovane donna con una corazza dura e inespugnabile. I personaggi sono strutturati in maniera uniforme, ognuno con la propria vita che scorre lenta e che si interseca con la protagonista. Ci ritroviamo in una bellissima Venezia dove squarci di essa vengono illustrati con passione. Un occhio che sbatte da un ponte a un altro rimanendo imprigionato.Un'anima incatenata da un segreto che solo con la forza del cuore riuscirà ad uscire fuori. Una storia bella e coinvolgente!"}, {"userName": "Emanuela Il mondo di sopra", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/47008346-emanuela-il-mondo-di-sopra", "userReview": "Wendy non è la ragazzina dei libri di Peter Pan, non è quell'adulta dall'aria sognante che racconta le favole a bimbi sperduti, Wendy in questa storia è una ragazza che ha i sogni negli occhi e che per non far del male a se stessa e gli altri, racconta piccole bugie a fin di bene. Se ti fermi a guardarla non ti dirà mai che sta piangendo, ma semplicemente che ha un moscerino nell'occhio, sa bene che alla fine è il mondo intero che gira così, che tutti raccontano piccole bugie a fin di bene, quindi perchè non dovrebbe farlo anche lei?Alcune persone che stanno bene, stanno bene solo per finta.Per Wendy o Guendalina sono solo piccole bugie rassicuranti. Le sue giornate movimentate tra le strade di Venezia, non le permettono comunque di dimenticare un lavoro che comincia a odiare per colpa del suo capo, un ex stronzo e il dolore che ormai vive il suo migliore amico. Lei ci prova, dalla psicologa ci va davvero, eppure mente.. mente a parte su Marino, il suo migliore amico.L'unica cosa che diventa sincera nella sua vita è quell'attimo in cui si perde ad ammirare da lontano l'amore della sua vita, l'uomo dei suoi sogni, perfetto e affascinante in ogni poro della pelle, il proprietario del ristorante sotto casa. Gli appostamenti fuori dal locale diventano quasi manovre da circense, così nascosti che lui non riesce mai a vederla...o quasi.I giorni passano sempre nella solita routine, telefonate e incontri con le amiche, giornate di lavoro in preda quasi ad una crisi isterica, fino a quando Wendy non parla con Libero, il proprietario del ristorante, o meglio... Libero parla con lui.Ma gli opposti si attraggono no? Libero e Wendy sono come l'acqua e il fuoco, l'inferno e il paradiso, lei svia ogni sincerità, lui ha bisogno e il dovere di essere schietto su ogni cosa, lei progetta mari e monti.. lui no. Ma come acqua e fuoco, inferno e paradiso, l'uno non possono vivere senza l'altro.Pagina dopo pagina ci troviamo in una storia che ci trasporta, che movimenta le nostre ore tra sorrisi e piccoli colpi di scena interessanti.Il ritmo sempre più frizzantino prende piede e ci cattura lasciandoci sorpresi di aver trovato già l'ultima pagina.La scrittura è scorrevole e come detto all'inizio ha ottime basi per creare qualcosa di strepitoso, di fresco e nuovo. L'ambientazione è minuziosa, i dettagli portano il lettore in quella Venezia di Wendy e Libero, troviamo una scrittura evocativa pronta ad essere scoperta.Guenda non è facile per me. E' piuttosto complesso, è faticoso trovare qualcuno su cui contare veramente, qualcuno che ti ascolti senza cercare di capire come spillarti soldi, godere di benefici, dovresti saperlo, ti ho parlato un sacco di volte di tutto il marcio che ho intorno. E comunque mi farebbe davvero piacere uscire con te, stare un po' insieme. Bello. Fresco. Divertente. Erika Favaro ci sa fare e lo dimostra con E' una bugia ma ti amo."}, {"userName": "Antonietta Mirra", "userReviewDate": "Aug 10, 2016", "userURL": "http://www.goodreads.com/user/show/47876945-antonietta-mirra", "userReview": "E’ una bugia ma ti amo è una storia leggera e assolutamente poco impegnativa. Uno di quei romanzi che riescono a coniugare bene la voglia di sorprendere e l’esclusivo scopo di intrattenimento, fondendo ironia, sorrisi e in più di una occasione, riflessioni scelte a puntino per accompagnare in modo degno ma mai pesante lo svolgimento del racconto, incentrato su una protagonista molto particolare.Wendy è all’apparenza una ragazza come tante, con un lavoro che ama, un capo che non sopporta, un ex fidanzato dal quale vuole tenersi a tutti i costi alla larga, una psicologa alla quale raccontare le sue paure e un sogno d’amore che le allieta la vita. Insomma fino a qui, non c’è nulla di strano nel suo personaggio eppure la nostra cara eroina ha un difetto alquanto imbarazzante: dice con facilità molte bugie anche se tutte a fin di bene.Sono qui perché con l’uomo con cui stavo insieme da quattro anni è finita, il mio migliore amico sta morendo, il mio capo è il più grande degli stronzi e credo di avere una crisi esistenziale.Wendy è il tipo di persona che pur di non far intristire o preoccupare chi si trova di fronte è capace di inventarsi di stare alla grande anche quando ha appena finito di piangere o di essere felice anche se ha la morte dentro al cuore. Il suo comportamento è dovuto ad un carattere docile e accondiscendente, ad una personalità che invece che discutere con gli altri, opporsi o affrontare contrasti, preferisce mentire in modo da tenere sempre tutto sotto controllo ed evitare in questo modo qualsiasi tipo di rischio.Wendy è una ragazza giovane che dovrebbe vivere la vita in modo più spontaneo e naturale e invece preferisce mentire piuttosto che affrontare i pericoli dell’esistenza.(...)CONTINUA A LEGGERE SUL BLOG L'AMICA DEI LIBRI DI ANTONIETTA MIRRAhttp://amicadeilibri.blogspot.com/201..."}], "description": "Non troverai mai il vero amore se non sei disposta ad accettare anche ciò che non ti aspettavi di trovare.Se una donna dice: «Questi tacchi sono comodissimi», è una bugia.Se dice: «Tra cinque minuti sono pronta», è una bugia.Se dice: «Vedi pure la tua ex, non mi dà fastidio», è una bugia.Ma se dice: «Ti amo», è tutto vero.Wendy ha trent'anni, un lavoro che le piace moltissimo (a parte il suo capo), una famiglia allargata e un po' scombinata che adora, un ex fidanzato inutile da dimenticare e un piccolo problema con la realtà. Non è che non veda ciò che ha davanti agli occhi, o che non abbia delle opinioni ben precise sulle cose: è solo che trova tanto più facile dire una bugia, più o meno innocente, soprattutto se serve a far sentir meglio chi le sta intorno. Oppure a proteggere se stessa dalle verità troppo dolorose da affrontare... Ma quando Wendy conosce Libero, l'affascinante proprietario del ristorante sotto casa sua, tutto cambia. Perché lui non è come gli altri: si accorge subito del modo in cui lei trasforma e \"aggiusta\" la realtà e ne rimane profondamente deluso. Libero non cerca una donna che lo assecondi, che finga, che rinunci a essere se stessa pur di accontentarlo. Cerca qualcuno di autentico e sincero, da amare veramente. E così Wendy, per amore, inizia a comportarsi in modo diverso, a mettersi in gioco, a esporsi, correndo il rischio di dire la cosa sbagliata e di non piacere. O forse, per una volta, di piacere davvero.", "title": "È una bugia ma ti amo", "url": "http://www.goodreads.com/book/show/31180556-una-bugia-ma-ti-amo", "average": 3.57, "cover": "https://images.gr-assets.com/books/1468998230l/31180556.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/7091011.Erika_Favaro", "name": "Erika Favaro"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/31180556-una-bugia-ma-ti-amo", "http://www.goodreads.com/book/show/20742726-e-se-poi-mi-innamoro-pazienza", "http://www.goodreads.com/book/show/21434743-per-una-volta-lasciati-amare", "http://www.goodreads.com/book/show/17924593-il-tuo-posto-nel-mondo", "http://www.goodreads.com/book/show/36176360-solo-averti-pi-vicino---in-love", "http://www.goodreads.com/book/show/36175145-solo-averti-pi-vicino"]}