{"ratings": 19838, "userreviews": [{"userName": "Carol", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "Maybe this leopard can change her spots. I'm the perennial thriller reader. I read thrillers because they are often fast passed, make my heart beat faster and I love a suspenseful read. So why have I found myself bewtiched by the author JoJo Moyes? I have just finished my third book The Ship of Brides and will be singing its praises to everyone I meet. It’s the end of World War II and thousands of Australian women, War Brides, will be traveling to England to reunite with the men they married. Over 600 will not have the luxury of traveling on a ship like the Queen Mary with all of its amenities, but will make the six week journey on The Victoria, an aircraft carrier. The Victoria is ill suited as a vessel for women, outfitted for its crew of men and planes. The book focuses on four of the brides allowing us a window to their hopes, fears and dreams. These four along with the others are leaving all that they know, all who they know behind to start a new life on foreign shores. Even those madly in love wonder at the sanity of their decision. And what of those who mid-voyage receive a sort of Dear Jane letter, one stating What I really liked about  The Ship of Brides is how it made me think. I started to wonder about the women and ship the book is based on. How much fact, how much fiction? It took me on a new journey seeking answers. If you have any desire to know more about this slice of history three websites provided lots of information, the best being The National Archives of Australia. These also were worth scouting out HMS Victorious, Rootsweb Warbrides. In addition it brought me back to memories of the war and how it affected my family. I am a baby boomer who wishes I asked more questions about their experiences leading up to, during and after the war before I lost all those who could answer. The Ship of Brides held my attention from start to finish. I have become a fan of JoJo Moyes all over again. I'm so glad I haven't read all her books yet. This is something to truly look forward to."}, {"userName": "Carol", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "2.5 StarsThis is my fifth Jojo Moyes novel and, unfortunately, the only one I thought would never end.The storyline is GREAT based on actual historical events of post WW2 war brides traveling aboard a naval warship to reunite with their husbands in England. I also enjoyed reading the newspaper and journal entries posted at the beginning of each chapter, but other than Frances' and Nicol's story, I am sorry to say, it was pretty much slow going with confusing dialogue and needless catty conversations throughout a good portion of the book.Cannot recommend this 2005 JJM novel, but enthusiastically look forward to future offerings.Highly recommend:   and ."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "So...ummm....yeah....I just finished this and I don't have words. Multiple superlatives will be used. This one moved me in so many ways. Holy shite, what a story. I became quite attached to Frances and Maggie. I will miss them.Jojo Moyes is a versatile novelist. She picks a topic she wants to write about and makes it her own. There's a richness and depth to this story that surpasses Me Before You."}, {"userName": "Suzanne", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/11889829-suzanne", "userReview": "What a wonderful book that I've just finished. One of those that really mean something. It was a pleasure to read this book, the first of Jo Jo Moyes that I have had the pleasure to read. This is a beautiful story that is based on a factual voyage, each chapter starts with an non fictional extract based on experiences of war brides, or those who served on the 'Victorious'.The year is 1946, and almost 700 war brides are making their way to England, the war is over. We follow a group of gals who have so many stories to tell. Maggie - feisty girl of the land. Lovely. Avice - society girl, vein and focused on things not so important. Annoying. My favourite (just!) Frances - capable nurse who has survived a horrible upbringing. A treasure. We learn about life on board in trying times, and the crew that is charged with getting our brides there safe and sound. I also enjoyed the character of the captain, and Henry too.I've always enjoyed and appreciated a book that educates me, and this really did. This should be read by students as well, there's a true story amongst the happy and sad moments. The poor brides who received a telegram 'Not wanted, don't come'. Heart breaking.Please do read this, highly recommended by this Aussie girl who has learnt a lot. Hats off to Ms Moyes for not just a novel, but a thoroughly researched piece of work. A perfect holiday read. I will think about this a lot, it's gotten to me!"}, {"userName": "Buggy", "userReviewDate": "Jan 25, 2014", "userURL": "http://www.goodreads.com/user/show/3099666-buggy", "userReview": "Opening Line: “The first time I saw her again, I felt as if I’d been hit.”I absolutely loved this book, another winner from JoJo Moyes who bases this moving story on real events (and her own grandmother) Taking the reader back to 1946 in the aftermath of the Second World War as thousands of young war brides are transported from Australia to England to meet up with their GI husbands who they’d married during the conflict. For many woman it was a time of huge uncertainty, leaving their families and everything they’d ever known behind and preying they didn’t receive the dreaded “Not wanted, don’t come telegram” once aboard.Ship Of Brides follows four of these woman (out of the 650 on board) all from very different backgrounds and covers their experience from a boarding house in Sydney throughout their 6 week journey at sea aboard an aircraft carrier (which also still carries over a thousand naval officers so rules of honor, duty and separation must be enforced.The story begins in India in 2002 (which initially threw me a bit) as an elderly grandmother on vacation stumbles across the broken hull of a once great British warship, now in the process of being dismantled for scrap on an oily, debris littered beach. She has come upon a ship graveyard and can just make out the name on one of the rusted hulls “Victoria” and at once is overwhelmed by memories…I was surprised by how involved I got in this story but Moyes not only takes the reader back to 1946 but manages to keep a huge element of suspense going throughout the journey (Frances, a former nurse is kept frustratingly mysterious until the very last pages – and I kinda loved her.) We also enter the POV of the injured and grieving Captain, a Marine who has received a Dear John letter, a woman widowed before she reaches her destination, another who discovers her husband is already married and follow stowaway dogs, boiler room brawls, disastrous fires, miscarriages, lovely leg contests, ashore days in India and Gibraltar, excitement, fear, heartache and joy. Because this has been based on an actual sailing taken by the HMS Victorious, Moyes was able to include extracts from journals, newspaper clippings, and diary entries from the actual men and women aboard which added an element of real emotion to the voyage.The writing is fantastic and by the end I felt like I really knew these women and wondered how their lives had turned out, in fact I didn’t want to let them go.401jb5"}, {"userName": "Meg", "userReviewDate": "Dec 20, 2014", "userURL": "http://www.goodreads.com/user/show/15170070-meg", "userReview": "I felt like I was on a slow boat to Britain right along with them."}, {"userName": "Tara Chevrestt", "userReviewDate": "May 14, 2014", "userURL": "http://www.goodreads.com/user/show/2544368-tara-chevrestt", "userReview": "I'm a huge fan of Jojo Moyes and until now have never been on the fence with what to rate her work. This one is a tough one though. I liked half; I disliked half. I found myself impatient to know what happened in the end, to each and every one of the girls, yet at the same time, I found myself skimming the \"man\" parts--the captain's tale, Nicol's story, this guy and that guy. They bored me, and I didn't care about their lives.This story doesn't really let the reader get to know the heroines, and there are four, at least not until the very end. It felt almost like each of the heroines was being held back from us, preventing the reader from being in anyone's head, heart, or experiencing their full range of emotions, and I prefer to be completely one with the character, so this method of not letting us know who these women really are until the last 15% doesn't work well for me.And why, oh why, did there even have to be a dog if it's going to end like that??????But I was fascinated by the story itself, by the fact all these brides are shoved together on an aircraft carrier for six weeks, by the fact that the captain pushed aircraft overboard, appalled by the behavior of some drunken seamen, even more shocked at the unfortunate \"Not Wanted Don't Comes\". Can't imagine how embarrassing that is...Even more mind boggling was the fact that many of these women on the ship were leaving everything (Australia) and everyone they'd ever known to go to a country (England) they'd never been before to be with men they'd married yet barely knew, and some of them are eight months pregnant and their husbands are about to lay eyes on women whom were young, thin beauties last they saw them..for their few days or weeks of marriage. It's crazy how rashly people acted during the war. And we see with some of these women that rashness comes back to bite them.There was a lot of sadness in this story, as well as a lot of women overcoming all kinds of problems. My favorite character had to be Frances. She intrigued me the most though the book took too long to really let me \"in there\". In her story, we see how very quick people are to judge based on so little data and how important it is to know the full story.And amid all the sadness, secrets, harassment, betrayals, and worrying who'll get the next \"Not Wanted Don't Come\", there are surprise bursts of humor, which in my opinion, kept this book afloat.Find out what quotes made me chuckle the most: http://wwwbookbabe.blogspot.com/2014/..."}, {"userName": "Jo", "userReviewDate": "Feb 13, 2013", "userURL": "http://www.goodreads.com/user/show/17431386-jo", "userReview": "I love JoJo Moyes and her ability to make Chick-lit (which I love), just a bit different. Some of her books are based on historical events, again something that I find is a great asset to her writing.However, and it is a shame to say that, this book just didn't work for me. I found the storyline hard to get in to, possibly a little dull at times. I don't know much about the subject of Australian war brides and the book didn't really help. I found it hard to pick up on the love the brides had for their English husbands when we had no idea on their backgrounds.I want to keep trying to get through this, I wouldn't recommend as the best book to get into JoJo Moyes."}, {"userName": "(ツ) Hache", "userReviewDate": "Jun 27, 2014", "userURL": "http://www.goodreads.com/user/show/9056424-hache", "userReview": "[ only one of the brides is happily reunited with her husband. (hide spoiler)]"}, {"userName": "Libropolis", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/39809084-libropolis", "userReview": "2,5 Sterne ⭐"}, {"userName": "Hazel McNellis", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/22310954-hazel-mcnellis", "userReview": "Bücher, bei denen man hinterher erst einmal einen Moment braucht, um zurück in das wahre Leben zu finden, das sind die wirklich guten Bücher. Zu diesen Büchern zähle ich grundsätzlich auch jene von Jojo Moyes. Mir gefällt ihr Schreibstil - nicht zwangsläufig die Erzählform. Ihre Geschichten ziehen mich sofort in ihren Bann. Die Art, wie sie beschreibt, ist unglaublich lebendig! Einfühlsam, spannend und flüssig reiht sie die Sätze aneinander und spinnt so ein eindringliches, berührendes Netz um den Leser. Bei \"Über uns der Himmel, unter uns das Meer\" behält Jojo Moyes ihren einzigartigen Stil bei. Eigentlich wäre der Roman 5 Sterne wert. Ich habe geweint - aber nicht aus freudiger Rührung heraus. Die Geschichte war ein kleines Stück weit vorhersehbar und wenig originell (Ein Stichwort dazu: Hündchen), finde ich. Das störte mich zum Ende ein bisschen, aber nicht allzu sehr. Die Zeitsprünge und Wechsel der Perspektiven waren nicht immer ideal gestaltet mMn. Ich hatte gelegentlich Probleme in die gewechselte Situation oder Zeit hineinzufinden. Schade ist auch, dass mir teilweise das Schicksal des Hundes näherging als das von Frances zum Schluss... O.o Wegen all dieser Punkte gebe ich 4 und keine 3 Sterne. Denn alles in allem hat die Autorin wieder ein (auf die ein oder andere Weise) berührendes und starkes Werk erschaffen. Mir hat es etwas mehr als \"nur gefallen\", sodass ich 4 Sterne als gerechtfertigt betrachte. :)"}, {"userName": "Barbara Elsborg", "userReviewDate": "Sep 10, 2012", "userURL": "http://www.goodreads.com/user/show/2050186-barbara-elsborg", "userReview": "I like Jojo Moyes but I'd avoided reading this one because of the time period. It's not something that interests me BUT what a mistake. I was quickly drawn in to the lives of these Australian women en route for the UK after the war as husbands of British servicemen. I loved the variety of characters, the understated love story, it all worked really well. I could easily see this as a film!"}, {"userName": "Brenda", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/33943459-brenda", "userReview": "This was BEYOND boring! I thought would never end ._.The prologue was so touching I was convinced the book gonna be great. I was wrong."}, {"userName": "Jessica", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/3015560-jessica", "userReview": "Great ending. Many a time I almost gave up on it. It is rather darker then I expected."}, {"userName": "Mithila  Menezes", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/38994245-mithila-menezes", "userReview": "1946. The Second World War has come to an end. Soldiers return home to their loved ones. Paints a lovely scene, doesn't it? And this is the scene we are most familiar with. But in Sydney, Australia, there's a different scene playing out: women are travelling across the seas to Plymouth, England to live the rest of their lives with the men they married during the war. The men who had to whisper words of love and affection only during their leave from duty and hurriedly leave once their duty called, the men who would get a chance to properly see and love their brides only post the war. HMS Victoria is one of the ships reaching the last of the war brides to their new home. 650 brides aboard one ship? Don't think it's going to be one large slumber party. HMS Victoria not only carries these war brides and their luggage, but also 1000 naval officers, arms and aircraft.In this historical fiction novel, Jojo Moyes invites the reader aboard HMS Victoria, to follow the lives of 4 of these 650 war brides very closely: Jean, Margaret, Avice and Frances. The novel also follows the story of the captain of the ship, a marine officer, a jealous war bride and a dear little dog, Maudie. ____The start of the book was a bit of a bore, I must admit. After all, there was constant thought in my head as I read this book: 'A 6 weeks journey across the sea with a ship full of brides. How exciting is this going to get?' But post the 50% mark of the story, Moyes got the waves churning: drama, scandal, love, tears, friendship, enmity. The whole deal. And that's when I started liking the book. The ending of the book got a bit predictable, but I daresay it spoiled the reading experience. After all, this unique plot is not something you'd find in your everyday novel."}, {"userName": "Irene Rauch", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/50953890-irene-rauch", "userReview": "Ich bin froh dieses Buch als Hörbuch gehört zu haben. Der Anfang war ziemlich zäh. Es hat lange gedauert bis ich in die Geschichte rein gekommen bin. Auch dass es aus so vielen Sichten erzählt wird, war sehr verwirrend. Es wäre besser gewesen, wenn immer dabei gestanden wäre, aus wessen Sicht gerade erzählt wird! Ab ca. der Hälfte war ich dann in der Geschichte drin und der Schluss war so spannend, dass ich nicht aufhören konnte!"}, {"userName": "Arlene", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "Very long and drawn out. Lost interest throughout. Probably my least favorite of Jojo Moyes."}, {"userName": "Ashley", "userReviewDate": "Jan 17, 2012", "userURL": "http://www.goodreads.com/user/show/1193192-ashley", "userReview": "I loved the idea of this book, but not the execution. I'm wondering if I built it up too much in my head before reading as I thought the premise a really interesting one. I enjoyed it but this book wasn't a favorite. Actually, that's the problem I have: this book read like a tv series. I feel like you could literally hand sections of the book to a director and, in order, he'll make an Avice episode, the Frances background episode, etc.A quick, easy read with an interesting premise based on true events. Good, but it feels like it could have been so much better. I would be interested in reading more of this author's work."}, {"userName": "Mela", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/41757430-mela", "userReview": "When I have bought and started to read this book (I confess) I expected a few sweet romances in the package. What I got is much, much deeper and better.5 stars for:1) A original and very interesting historical background. I didn't know that such marriages were so much common during IIWW.2) Beautiful, gripping fictional stories.3) Perfectly chosen characters.4) A captivating, deep understanding of human nature.There was moment (nearer the end) when I thought it was drifting to 4 stars. I felt a little lost, wanting that something else could happen. But the end improved everything. Yes, there was a happy ending! Yes, not for every of main characters but enough to feel warm closing the book.I tell you, Frances, Margaret, Avice, Jean were magnificent persons, each one in her own way. Each one struggle with her own fears and past. What happened to them before, during and after the voyage showed how different life and people are but at the same time how alike. Next to female characters there were Nicol, Highfield, Tims and husbands. They presence made the book greater and more compelling. I can't tell you more about those people without spoiling, I am not able to do it (without spoiling) because their stories described and made them.Really, it is almost hard to believe that Jojo Moyes chose so perfectly the stories which portrayed us, humans so aptly.It isn't a light, cheerful book, but it isn't also a book which leave you crying. I have finished it with the feeling that life can be difficult and painful but most people are good. They sometimes simply are in hard situations, make wrong decisions and so on. But there is happiness in life too!Recommended reviews: Carol's, (ツ) Hache's - although her review will spoil you a few important things of the plot (I mean those not hidden).[By the by, the cover of my copy is awful. In my opinion it doesn't fit at all. It suggest rather lighter, different book. Almost every other is better, except French and Dutch - they are even worse. I like a German cover the most.]"}, {"userName": "Jess The Bookworm", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/32042916-jess-the-bookworm", "userReview": "3.5 stars.This novel is set in the time period just after World War II. During the War many people from all over the world met one another and got married quite hastily, to people that they wouldn't see until the War was over. This novel starts off in Australia, where over 600 Australian brides need to be transported to their English husbands in England, to go and live as a married couple now that the War is over. An old aircraft carrying ship is commissioned for its last journey to take these brides across the sea on the six week journey to be reunited with the loved one they haven't seen in months or even years. The author introduces us to four bunk mates, from very different walks of life, as they journey to their husbands. Some are from wealthy families, some are simple farm girls, some are young and naive, and some are hiding very dark pasts.This novel is based on a true story and on the real life 'ship of brides', the Vicorious, which carried brides from Australia to England after the War, and there are some real life journal extracts from that time scattered throughout the novel. What was really cool for me is that the author's grandmother was a bride on this ship, and she relayed her stories to her to enable her to write this book, and this is what made it special for me."}, {"userName": "Lydia Bailey", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/45167722-lydia-bailey", "userReview": ". A really enjoyable read with an original and interesting plot. Great characterisation not quite as gripping as some of her other books but it's stayed with me and would highly recommend it."}, {"userName": "Justė", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/22390083-just", "userReview": "„Nuotakų laivas“ buvo kaip tik tai, ko man reikėjo po kankinančio“ Vilniaus pokerio“, bet bendrai tai reikalą su Moyes matyt reiks raukti ir ieškoti naujų prasiblaškymo plotų. Fabula apie kelis šimtus australių karo nuotakų plaukiančių lėktuvnešiu į Angliją pas savo vyrus tikrai įdomi, kažkaip net pats pasakymas „karo nuotaka“, nors ir akivaizdus, sąmonę padoriai pasiekė tik skaitant. To tokio kad ir nedidelio tikros istorijos dvelksmo suteikė ir tikros laikraščių ar atsiminimų ištraukos, nors šiaip tai romanui ir ne kažin ką davė. O šitas reiškinys buvo dar vienas papildomas, nors ir palyginti juokingas, karo nuostolis. Negali statyti į gretą su milijonais žuvusių, sužalotų ir palaužtų žmonių, o iš vienos pusės daug tų porų turbūt laimingai gyveno ir jų gyvenimas pasisuko gera linkme, bet kai pagalvoji apie visumą, tai tėra dar vienas suardytos tvarkos pavyzdys. Bet čia ir baigiasi šitos knygos pliusai – siužeto ne kažin kiek, o ir tas nuspėjamas, nors ryškiai ir tikimasi pateikti ne vieną siurprizą. Neradau nei to emocinio stiprumo, nei žmoniškų daugumos istorijų pabaigų, viskas staiga nutrūko ir po poros puslapių chaoso knyga buvo baigta. Po „Aš prieš tave“ vis tikėjausi dar vienos tokios stiprios istorijos ir niekaip nepasiduodu su Moyes knygomis, bet kažkaip pradedu jausti tendenciją, kad visos kitos jos knygos tiesiog paprastos, lengvos romantikos varomos istorijos, kurioms visgi trūksta kažkokios galios."}, {"userName": "Kristin Davison", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/36402164-kristin-davison", "userReview": "4.5 stars A beautiful story that needed to be told."}, {"userName": "Jan", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/1024357-jan", "userReview": "Another fantastic page turner from JoJo Moyes. What a terrific story!"}, {"userName": "Tsippora", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/40540069-tsippora", "userReview": "The Ship of Brides had a bit of a slow burn, which was pribebly because of the large amount of POVs for just one ship. Towards the end It got good and emotional."}, {"userName": "Becky", "userReviewDate": "Dec 21, 2014", "userURL": "http://www.goodreads.com/user/show/6751264-becky", "userReview": "On October 27, 1945 the HMS Victorious set off for the first of three trips to transport WWII servicemen and war brides. Jojo Moyes's own grandmother was one of those brides, traveling from Australia to England to be with her husband. According to the acknowledgements, her story and others inspired The Ship of Brides, which was originally released back in 2005 but has recently been reissued by Penguin.The war has ended and out of the remaining war brides in Australia, Margaret, Avice, Jean, and Frances have each been chosen to travel to England aboard HMS Victory in a push to reunite them with their husbands. They aren't the first to travel to England and they aren't the last, but they're the lucky ones who won't have to wait any longer. The four couldn't be more different from one another and yet they find themselves bunkmates on the newly outfitted aircraft carrier. Margaret is massively pregnant; Jean, at sixteen, is among the youngest on board; Frances, a former nurse, is quite closemouthed about her past; and Avice is a society girl who'd hoped for roommates of a different class. But they each have one thing in common: they've left behind everything they know to start a new life. Decades later, one of these women gets the shock of a lifetime when she stumbles upon a reminder of that fateful journey. I rather liked The Ship of Brides, and I really wasn't sure that I would at the start. Mainly because I'd looked forward to it for so long but never really felt I was in the right mood for it. But I forced myself to sit down with it one evening and soon found myself quite taken in by the story.This one is very different from the other titles I've read by Moyes thus far. To be honest, that was appealing at this stage as both One Plus One and Silver Bay had a lot of common elements between them. And while there is some of that in The Ship of Brides, the premise and the WWII setting couldn't have been more different!This was most definitely a piece of history that was fairly new to me. Not so much the war brides aspect but the fact that such a massive undertaking to deliver these women to their new homes had occurred. Moyes does a wonderful job blending in historical quotes from real men and women concerning the actual HMS Victorious mission, setting the scene mood of the novel quite nicely. Each of the characters came across as genuine in both emotion and setting, making it easy to imagine them as real people. Bringing the story forward to the present day was also a nice touch that added another layer of believability for me as the reader.Ship of Brides may not be what you've come to expect from Moyes but it is a wonderful historical read, perfect for anyone who enjoys WWII fiction."}, {"userName": "Gee", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/5170137-gee", "userReview": "This was my second Jojo Moyes book, after reading and thoroughly enjoying 'The last letter from your lover'. The Ship of Brides is a moving story based on a real events taking place in the immediate aftermath of the Second World War, as thousands of young women were transported to Great Britain or the United States from Australia to meet up with the GI-husbands they married when they were stationed in the country during the conflict. In many cases, these young women left their families and homes behind to take a painfully long journey steaming across the oceans for weeks, heading to an uncertain life in a foreign country.Beginning on a beach/ship graveyard in present-day India, the broken hull of a warship being scrapped brings back unexpected and overwhelming memories for an elderly grandmother on holiday. We are then taken back to the days immediately post 1945 and a story centering on four very different young women who are thrown together in sleeping quarters aboard the soon-to-be-retired Royal Navy aircraft carrier HMS Victoria. Together with hundreds of other young women on the ship, they are travelling to England to meet again the men they married when stationed in Australia as the war raged in the Pacific. They're heading to a life and country that's foreign, meeting their new families for the first time - having left their own families and friends behind, they must adjust to a tense and cramped life aboard the ship as well as the all male crew which leads to incidents and encounters, both unfortunate and uplifting.Adding particular depth to the story is the fact that The Ship of Brides is based on an actual journey that took place in 1946 on board the HMS Victorious and many of the diary entries and journal records of some of the crew and passengers of that journey are included at the beginning of each chapter. This adds the real emotion of actual events to a tale that is nicely written by Moyes and is rich in human warmth. I really enjoy Jojo Moyes' writing and The Ship of Brides is a lovely and moving story. It reminded me again of the sacrifices and experiences of that extraordinary generation that fought the Second World War and built a new world in its aftermath, giving up so much and embarking on long and arduous journies to build a life we today simply take for granted."}, {"userName": "Erin", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/2616618-erin", "userReview": "I found the premise of this book to be more compelling than the actual story. I love a good, big, historical fiction romance novel, and I love the fact that it was based on true events of the day. The book itself left much to be desired. It was so slow in the beginning. I read this on my kindle and was 53% through before I was actually interested in reading more. Throughout, I wanted to know more about the relationships with the brides and their husbands. The book was primarily based on the relationships they develop on board with the other brides. It wasn't until the very end of the book that many pieces of the story came together. This may be a great plot device for a thriller or mystery, but I found it more annoying than anything else. I don't like having to guess what the characters are thinking about. For example, the Captain's back story was excruciatingly slow to develop. I won't refer to the other back stories as it would spoil the story.I have really enjoyed other JoJo Moyes books and look forward to reading more in the future. This book just fell a bit short for me.One thing I did enjoy was learning many foreign Australian and British colloquial terms. I had to use the dictionary button many times to figure out what they were talking about!"}, {"userName": "Barb", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/849475-barb", "userReview": "This is the fourth Jojo Moyes book I've read and while I liked it I also thought it wasn't quite as good as the other three. I love 'Me Before You' and highly recommend it. This story starts off slowly and is told with a split setting. The contemporary story line includes a young woman Jennifer and her grandmother who are on vacation together. Then the reader is taken back to 1945 and introduced to four very different women who eventually come together on a voyage from Australia to England after WWII. The story seems to be somewhat uneventful at first but picks up the pace with a rather serious and sad turn of events. Eventually the characters begin to reveal themselves and become more sympathetic.I didn't care for the contemporary story-line at all and felt sacrificing it would have made for a better, more engaging story. But once I got past the initial introduction to the characters and the middle where things lag a bit I was very invested in finding out what happened to these characters.Not Moyes's best but satisfying none the less."}, {"userName": "Patrizia", "userReviewDate": "Mar 24, 2016", "userURL": "http://www.goodreads.com/user/show/5926059-patrizia", "userReview": "Ein toller Roman über Hoffnung, Intrigenspiele, Liebe und 600 Frauen auf einem Flugzeugträger welcher sie nach England zu ihren Ehemänner bringen sollte. Die Frauen freuen sich auf ein Wiedersehen mit ihrem Männern, endlich ist der Krieg vorbei und alle sollten wieder vereint werden. Auf dem Schiff reist auch Frances mit, eine junge zurückhaltende Krankenschwester. In der ganzen Geschichte bleibt sie eher verschlossen nur in Henry Nicol, ein Marinesoldat, findet sie langsam Vertrauen, welcher jede nacht vor ihrer Koje Wache hält. Eines Tages jedoch erkennt ein Patient Frances wieder und ein Teil der Vergangenheit, vor dem sie fliehen wollte, holt sie ein.=> Eine tolle Geschichte. Der Anfang empfand ich als schleppend, es brauchte einen Moment bis ich richtig warm wurde mit den Hauptprotagonisten. Gegen Mitte jedoch kommt die Story richtig in Fahrt und man erkennt den typischen Jojo Moyes Style wieder..."}], "description": "Australien 1946. Sechshundert Frauen machen sich auf eine Reise ins Ungewisse. Ein Flugzeugträger soll sie nach England bringen, dort erwartet die Frauen ihre Zukunft: ihre Verlobten, ihre Ehemänner – englische Soldaten, mit denen sie oft nur wenige Tage verbracht hatten, bevor der Krieg sie wieder trennte. Unter den Frauen ist auch die Krankenschwester Frances. Während die anderen zu Schicksalsgenossinnen werden, ihre Hoffnungen und Ängste miteinander teilen, bleibt sie verschlossen. Nur in Marinesoldat Henry Nicol, der jede Nacht vor ihrer Kabine Wache steht und wie sie Schreckliches erlebt hat im Krieg, findet sie einen Vertrauten. Eines Tages jedoch holt Frances ausgerechnet der Teil ihrer Vergangenheit ein, vor dem sie ans andere Ende der Welt fliehen wollte …", "title": "Über uns der Himmel, unter uns das Meer", "url": "http://www.goodreads.com/book/show/28820571-ber-uns-der-himmel-unter-uns-das-meer", "average": 3.76, "cover": "https://images.gr-assets.com/books/1454327735l/28820571.jpg", "reviews": 2082, "authors": [{"url": "https://www.goodreads.com/author/show/281810.Jojo_Moyes", "name": "Jojo Moyes"}], "type": ["Historical", "Fiction", "Romance", "Historical", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/28820571-ber-uns-der-himmel-unter-uns-das-meer", "http://www.goodreads.com/book/show/1373381.The_Ship_of_Brides", "http://www.goodreads.com/book/show/20893485-the-ship-of-brides", "http://www.goodreads.com/book/show/22711282-the-ship-of-brides", "http://www.goodreads.com/book/show/1172548.The_Ship_of_Brides", "http://www.goodreads.com/book/show/20510869-the-ship-of-brides", "http://www.goodreads.com/book/show/18744641-the-ship-of-brides", "http://www.goodreads.com/book/show/1373378.The_Ship_Of_Brides", "http://www.goodreads.com/book/show/15507958-me-before-you", "http://www.goodreads.com/book/show/25041504-after-you", "http://www.goodreads.com/book/show/18693716-one-plus-one", "http://www.goodreads.com/book/show/17572903-the-girl-you-left-behind", "http://www.goodreads.com/book/show/10163292-the-last-letter-from-your-lover"]}