{"ratings": 2568, "userreviews": [{"userName": "Ahmad Sharabiani", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Barbe bleue, Amélie Nothomb تاریخ نخستین خوانش: نهم دسامبر سال 2017 میلادیعنوان: ریش آبی؛ نویسنده: املی نوتومب؛ مترجم: ویدا سامعی؛ تهران، فرهنگ نشر نو، 1394؛ در 160 ص؛ شابک: 9786007439500؛ موضوع: داستانهای نویسندگان بلژیکی - قرن 20 مریش آبی افسانه ی اشراف زاده ای ثروتمند است که با زنان زیبارو ازدواج میکند، زنانی که همگی پس از مدتی به طرزی مرموز در قصر او ناپدید میشوند. ریش آبی، کلید همه اتاقها را به آخرین همسرش که دختری جوان است میدهد اما او را از ورود به یک اتاق خاص منع میکند...؛ ا. شربیانی"}, {"userName": "Pooya Kiani", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/22260623-pooya-kiani", "userReview": "کتاب رو در عرض چند ساعت پیدا کردم، خریدم و خوندم. به یک بار خوانش می‌ارزه و ذائقه‌ی ارضانشده‌ی ما رو در ژانر جنایی/رمزآلود تا حدی پاسخ می‌ده.«ریش‌آبی» در «قصه‌»ای که املی نوتوم نوشته، اشراف‌زاده‌ای اسپانیولیه که در تقابل با «آخرین زن»ای قرار می‌گیره، که قاعدتا قراره از کشته‌شدن فرار کنه، و نقشش به گردن یه دختر بذله‌گو و نچسب بلژیکی گذاشته شده.ضعف اصلی داستان انتخاب نادرست راوی بود، که منجر به گزارش‌نویسی از یک فضای مخوف‌شد. از فضا، تاریخچه‌ و کشف قصر اشراف‌زاده و از آگاهی مخاطب به قصه‌ی باربه‌بلو می‌شد کار گرفته بشه تا رمزآلودیِ گوتیک داستان قوام بگیره و اثر از قصه به سمت رمان حرکت کنه. قوت اصلی داستان طنازی‌های مثلا پنهان و وارونگی اخلاق توسط نویسنده‌ست. در دیالوگ‌های مابین زن و باربه‌بلو، دختر بلژیکی و ریش‌آبی اسپانیایی، می‌شه جاهایی به التذاذی رسید که از یه نویسنده‌ی تازه‌کار برنمی‌آد. کیفیت چاپ و ترجمه واقعا بالاست. یک‌سوم ابتدایی کتاب خوندن داره."}, {"userName": "آبتین گلکار", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/45224450", "userReview": "از املی نوتوم، نویسندة بلژیکی، سالها پیش کتاب «بهت و لرزه» را با ترجمة موگه رازانی خوانده بودم که فوق العاده بود. در کتاب «ریش آبی» هم خواننده از قدرت نویسندگی نوتوم به شگفت می آید که چطور با وجود استفاده از یک قالب واحد و تکراری (تقریباً کل ماجرای کتاب در گفتگوهای سر میز شام در شبهای مختلف میان دو شخصیت رخ میدهد) داستانی پرکشش و جذاب می آفریند. ریش آبی از شخصیتهای افسانه ای کهن فرانسویهاست: مردی توانگر که همسران خود را یکی پس از دیگری به قتل میرساند، ولی سرانجام خودش به دست آخرین همسرش از بین میرود. نوتومب در داستان خود روایتی امروزی از این افسانه را نقل میکند: ماجرا در قلب پاریس، در برخورد یک اشرافزادة اسپانیایی گریزان از تمدن، و یک دختر جوان جسور و مدرن رخ میدهد. کشمکشهای این دو شخصیت فرصت زمین گذاشتن کتاب را به من نداد و البته شکمپرستان هم از خواندن این کتاب و وصف دقیق و پرجزئیات غذاهای سر میزهای شام لذت مضاعفی خواهند برد"}, {"userName": "Tiffany", "userReviewDate": "Jul 30, 2014", "userURL": "http://www.goodreads.com/user/show/16897950-tiffany", "userReview": "This author is so strange ... whenever I start into one of her books I think: oh, I know what she was thinking when she began it (which is a not very helpful way to start into her books. If you blink you will miss what she is really writing about) but then after a while you will find yourself thinking: \"how on earth did she get here from there?\" The peregrinations and purlicues this woman takes merits a monograph in itself.Ms. Nothomb writes two types of books. The first type--fiction, always--has a basis in a horrid, unthinkable question like: \"what makes a man crash a plane?\" or \"how does someone accidentally assume another person's identity?\" and then she runs with it, usually to incredible, unbelievable ends and outcomes. Her second type of book is autobiographical and because she is a person who thinks and feels deeply--to an embarrassing degree--about herself, her self disclosure and self mockery is really quite entertaining. Imagine if you will starting a promising internship in a company and getting demoted so many times you become the lavatory cleaner. This is how Ms. Nothomb's life unfolds when she tries to do what \"normal\" people do. Barbe Bleue belongs to the first category; it's a novel about the unthinkable. From the first pages we follow a woman who willingly embarks upon a relationship with a man who may or may not be a serial killer. He is an eccentric with a lot of nifty skills and a commensurate number of fatal flaws. From the offset there is a lot of totally inside nattering about in which capacity the French view nobility, which was nuanced, but to my thinking fell a bit short of a good deep root canal into the vicissitudes of French snobbery. (When I lived in France I was constantly amazed at how the French Revolution had fallen short of success--and for this I will get reamed, but, the truth is the French--god love 'em--are deeply class conscious and will never get over it no matter how many Socialist presidents they elect.) There was practically no summary in this book--it was all scene. 90% of that was dialogue between the two major characters. There's a lot of value-judgment conversation, a very typical French way of looking at things: This is how things are; there is no other way of seeing the world ... well I believe otherwise, and my values by far outstrip yours, plus I've got Greek philosophers I can quote to back up my statements ... well your references and arguments are faulty and/or immature therefore I am right ... no, in fact you have fallen into logical fallacy therefore proving I am right and you are wrong... The incidental joy in this is that our interlocutors are discussing murder, the Inquisition, the paintings of Khnopff, the vagaries of Holy love (here it is amusing to realize that Ms. Nothomb knows absolutely nothing about religion and her remarks are mere lobs, every single one of which flies out of bounds), discretion and privacy vs. secrecy and decency, and the consequences of personal will. Much champagne drinking ensues. It's like \"My Dinner with André\" but instead of two voluble New York Jews we get a champagne-swilling Belgian chav and an inbred psychopathic agoraphobe. (I like to imagine he has the Hapsburg chin.)Ms. Nothomb laid on her usual suspects--characters who are alienated from practically birth due to the incomprehensible names their parents foisted upon them. Alienation is perhaps her most recurring theme, and because I have been chomping through Ennegram material this year I recognize in Ms Nothomb an integrated FOUR. Oh those FOURS, such alienation fantasies. Other Nothombian tropes include exploration of obscure concepts gleaned from geometry, mathematics or Greek philosophy, obscure Classical references, the occasional Latin expression and regular application of comfort food, in this case papillotes and gateau Saint Honoré. Bless her. How I love this woman! Thank goodness I live in a time where I can purchase little novels like hers in an airport book store and run with it throughout the flight. When I read Ms. Nothomb's books I, like many readers, care deeply about the resolution to the answer--will he or won't he?--but the bottom line is you don't read her for answers. You read her for the ride. To be frank, her character develoment is a bit Pixar. She peoples her worlds with unsympathetic characters who strive to justify their agonies and untenable positions with convoluted, unconvincing arguments. I haven't decided if it is because Ms. Nothomb so deeply cares about humanity that she wants to delineate the extent of our continuum or if in fact she despises them so much she sees no interest in having them come alive, live, prosper and multiply.Then there are the endings: head scratchers."}, {"userName": "Brenda", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/7485444-brenda", "userReview": "Nothomb empieza a padecer la maldición Allen. La cantidad de chorradas que hay en esta novela supera el límite de lo defendible. Tanto la historia como los protagonistas son todo un insulto a la inteligencia del lector. Publicar por publicar no es bueno."}, {"userName": "Mb", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/13828094-mb", "userReview": "اميلي نوتوم در حدود ٢٥ رمان نوشته،اثارش به ٤٠ زبان ترجمه و در حدود ١٠ ميليون نسخه از انها به فروش رفته است.٥ اثر او تابحال به فارسي ترجمه شده.ريش ابي يك داستان پريان و افسانه اي در مورد يك اشراف زاده يا جادوگر بي رحم است كه همسران خود را به روش خاصي به قتل ميرساند.اين اثر دستمايه نويسنده هاي زيادي قرار گرفته و كتابهاي زيادي با الهام از ان نوشته شده.سرگئي كوزنتسوف نويسنده اثر مشهور \"پوست پروانه اي\" كه داستاني خشن در مورد يك قاتل زنجيره اي ست ريش ابي را يكي از داستانهايي مينامد كه بر او تاثير گذاشته است.حال املي نوتوم با محوريت قرار دادن اين داستان كتابي نوشته با همان ماجراها منتها در عصر جديد..ريش ابيِ املي نوتوم اثري ست كه نيمه ابتدايي اش برايم جذاب،رازالود و پر كشش بود.ولي از يك جايي به بعد،البته نه اينكه ازارم دهد ولي لذت ابتداي كتاب را هم نبردم.داستان ماجراي دختري به نام ساتورنين است كه براي مصاحبه اجاره اتاقي شيك و مجلل در خانه اي اشرافي كه بصورت شك برانگيزي ارزان است روانه انجا ميشود.در انجا ١٥ زن زيباروي ميبيند كه همه در صف انتظار مصاحبه نشسته اند.كمي بعد يكي از زنها رو به او ميگويد كه در نهايت اوست\"ساتورنين\" كه موفق ميشود اتاق را اجاره كند.دليلش هم اين است كه بقيه زنها در واقع احتياجي به ان اتاق ندارند و دليل حضورشان،تنها ديدن مالك ثروتمند و بدنام اين خانه است.زن به ساتورنين ميگويد كه قبل از انها ٨ زن ديگر در دوره هاي متفاوتي ان اتاق را اجاره كرده اند ولي همگي پس از مدتي ناپديد شده اند.مصاحبه انجام ميشود و ساتورنين برنده ميشود و همان روز به انجا اسباب كشي ميكند.همان شب مالك خانه اقاي \"دُن اليميريو نيبال اي ميلكار\" او را به صرف شام دعوت ميكند.ساتورنين در گفت و گوهايش با اشراف زاده متوجه ميشود كه او ٢٠ سال است پايش را از خانه بيرون نگذاشته و واقعا پاي ٨ زن مذكور در ميان بوده است..اين خلاصه اي بود از نيمه ابتدايي كتاب..تا اينجا كشش و جذابيت راز الودي دارد.از اين به بعد قدرت روايت به استواري قبل نيست.نوتوم به بهانه اين داستان بستري فراهم اورده تا از مسائل مهمي مانند مذهب،باورها،اعتماد و خيانت و عشق صحبت كند.مهمتر از همه كتاب از ادميزاد و سرشت هميشه ناراضي اش حرف ميزند.از واقعيت و انكار ان در وجدان ادمي حرف ميزند.از قبول واقعيت هر چند اگر زشت و زننده باشد.از تضادهاي درون هر انسان،زمانيكه از انتخابهايش راضي نيست.از ناخوداگاه درونمان كه رفتارش با ما متفاوت است و اعمال ما را ناچيز ميشمارد.ريش ابي مشكلاتي مثل عدم رفتار منطقي قهرمان داستان را دارد.هر چند كه نوتوم بارها اذعان كرده منطق كوچكترين اهميتي برايش ندارد و هميشه عاشق كمي ديوانگي ست،با اينحال دانستن اين موضوع نتوانست اين مشكل را براي من حل كند.ديگر اينكه قسمتهايي از كتاب گنگ و نا مفهوم بود(كاملا مشخص است كه تكه هايي از كتاب حذف شده)مشكل بزرگ ديگر انتخاب بد و نادرست راوي ست.انتخاب راوي اول شخص ميتوانست بسيار بهتر ترسها،شك ها و حتي انگيزه هاي قهرمانان داستان را عيان كند و باعث ايجاد سمپاتي بيشتر شود به خصوص براي يك داستان ترسناك حتي اگر مثل اين تم فلسفي داشته باشد.از نقاط قوت داستان ديالوگهاي زياد و جذاب ٢ شخصيت اصلي داستان درباره تناقضاتشان است.و اينكه ميشود با اين همه اختلاف نيز عاشق شد.در هيچ كجاي كتاب(به غير از نام اثر) اشاره اي به كلمه ريش ابي نميشود و اگر كسي از قبل در جريان افسانه ي ريش ابي نباشد هيچگاه متوجه نميشود دليل انتخاب اين نام چيست!!؟"}, {"userName": "Sandra Bašić", "userReviewDate": "Dec 17, 2015", "userURL": "http://www.goodreads.com/user/show/32538982-sandra-ba-i", "userReview": "Nema mi goreg osjećaja nego kad knjiga prođe kroz mene kao hrana kroz probavni trakt... da sam se barem naljutila ili poželjela baciti knjigu kroz prozor... šipak, ništa. Moj prvi susret s autoricom a (najvjerojatnije) i zadnji ali idemo dalje..."}, {"userName": "Петър Панчев", "userReviewDate": "Dec 12, 2014", "userURL": "http://www.goodreads.com/user/show/28015127", "userReview": "Сатюрнин, дон Елемирио и тайната стаичкаЦялото ревю тук: http://knijenpetar.blogspot.com/2015/... Доста съм се чудил как съумяват някои автори да впечатляват, без да влагат много усилия. За Амели Нотомб не съм много сигурен, но така си представям нещата при нея. Тя разказва по някоя история от време на време и успява да събуди неистов интерес. Все още съм в начален етап от изследване на творчеството ѝ - мога да се похваля само с прочита на „Изумление и трепет“. Но ще наваксам скоро. „Синята брада“ е толкова нетипичен роман, че ми позволи лудата идея да си представя нещата в друга тоналност - прийом, който използвам за допълнително съспенс (или да си начеша акъла). И хорър елементите възкръснаха (не че не видях такива и в романа). Нямаше как и да не си припомня мрачната приказка за Синята брада. Останах поразен когато в главата ми се нароиха десетки чудновати мисли, свързани с театрото, което разиграваме в отношенията си един към друг - дали от приятелски подбуди, или пък от лоши помисли. Когато пък стане въпрос за личните страсти, егоцентризмът може да си изгради цели магистрали към целта. Тази малка и спретната книжка е поредното доказателство, че и малкото думи могат да блъскат с железен чук и да доставят голяма наслада. Амели Нотомб и като визия си е колоритна личност, но пък в „Синята брада“ колоритът е допълнително украсен с черен хумор, интелектуална борба и интересни блюда. (Продължава в блога)"}, {"userName": "Julie Christine", "userReviewDate": "Oct 12, 2014", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "A surreal, contemporary retelling of the Blue Beard folktale-- no one does creepy older men like Amélie Nothomb. This is not my style, but I knew that going in-Nothomb is a specialist of the surreal. I just love her writing. Her female protagonists are fierce and fearless, her dialogue is incomparable. And she's so good for my French!"}, {"userName": "Toni", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/5724106-toni", "userReview": "Отбелязвам си като важен пропуск, че чак сега откривам чара на причудливата Амели Нотомб.Когато бях малка и баба ми разказваше приказки (които разбира се знаех наизуст от многократното им повторение), винаги \"се ядосвах\" когато промени нещо и и правех забележка, че приказката \"не е така\". Разбира се, сега пораснах и малко или много, за да се отличавам то детското си аз, обожавам да чета, гледам и т.н. нов и различен прочит на някоя приказка. Е, тук Амели Натомб е направила доста свежа, доколкото може да е точно тази приказка на Шарл Перо и оригинална интерпретация на \"Синята брада\". Старият и богат благородник от приказката ужасява жените както със синята си брада, така и с непрекъснатите си бракове, като съпругите му тайнствено изчезват една след друга. Тук синя брада нямаме, нямаме и съпруги, а наемателки, но за сметка на това те отново изчезват все така мистериозно. Това по някаква необяснима причина е като допълнителен магнит за нови. Може би защото всяка жена си вярва, че може да промени някой мъж... Наемателките му представят всички цветове на дъгата (ще го разберете по имената им Инкарднадин - кърваво червено, Дигиталин - лилаво, Мелюзин- морско синньо и т.н.) и той естествено иска да опита от всеки цвят, каквато и да е цената.  Чете се на едно сядане най-вече защото няма да издържите да не погълнете още от хумора и да не разберете финала - кой ще е жертвата и кой хищникът в надлъгванката. Между леещото се шампанско, вкусни ястия, красива артистична обстановка и остроумните размисли за метафизичното и физичното в живота, няма да усетите как ще стигнете финала.Леко четиво, точно като мехурчетата на шампанското и със съспенс до последно.\n- Несъмнено повечето жени са подвластни на някаква форма на мазохизъм. Виждала съм много, които се поддават на влечението си към отвратителни извратени типове... Предполагам, че това е тъмната страна на женската природа.- Три седмици. Твърде кратко за една луда любов.- И шест месеца са малко. Когато човек е лудо влюбен, времето никога не стига. Бих могъл да ви разкажа в подробности моите осем седмици с Просперин, но се страхувам, че ще ви отегча. Любовта е увлекателна за тези, които я изживяват, за другите е голяма досада.Влюбването е най-загадъчното явление във Вселената. Тези, които се влюбват от пръв поглед, изживяват най-необяснимата версия на чудото - те не са обичали преди това просто защото не са знаели, че другият съществува.А влюбването със закъснение е най-голямото предизвикателство към разума.Когато влюбването е вече факт, човек започва преговори със себе си с цел да разбере дали може да си позволи да изживее подобен абсурд. Младата жена бе имала лошия късмет да се влюби в един съмнителен тип, за това и преговорите бяха бурни и... ненужни.Нямаше връщане назад."}, {"userName": "Lectrice Hérétique", "userReviewDate": "Nov 17, 2012", "userURL": "http://www.goodreads.com/user/show/996682-lectrice-h-r-tique", "userReview": "Je fais partie de ceux qui lisent le Nothomb annuel sans lire la 4e de couverture (qui n’a d’ailleurs plus lieu d’être depuis longtemps), parce que j’ai aimé tous ses livres jusqu’en 2007, et que ce ne sont pas quelques erreurs de parcours qui vont me faire perdre mon envie de la lire. J’ai trouvé que le niveau remontait avec Tuer le père, l’an dernier. Je suis ravie de voir qu’elle se maintient, même si la brièveté de ses romans est de plus en plus frustrante, car 180 pages, c’est rien. Mais Amélie Nothomb a le don de mettre en place une situation et une réflexion surréaliste en peu de mots.J’ai eu la chance, presque au dernier moment, de pouvoir assister à une projection du documentaire de Laureline Amanieux et Luca Chiari, à l’Institut Jean Vigo à Perpignan, pas plus tard que jeudi dernier. Amélie Nothomb, une vie entre deux eaux, nous en dit long sur le personnage. Elle m’a toujours parue sympathique, et ce documentaire n’a fait que confirmer cette impression. On comprend mieux cette tendance à raconter les choses en peu de mots et peu d’actions lorsqu’elle parle du théâtre nô : peu, voire pas d’action, mais 4h pour raconter qu’un roi change de masque. Anecdote qui en dit long sur la manière de raconter de Nothomb. Le débat qui a suivi la projection nous a confirmé une Amélie attachante, pleine d’humour et très à l’écoute de ses lecteurs. Si le personnage m’a toujours fascinée, la personne se révèle être en parfaite adéquation. Pour les lecteurs assidus le documentaire ne nous apprendra peut-être pas grand-chose de neuf mais constitue un rappel intéressant et nous montre une Amélie Nothomb très humaine et pleine de sincérité.Pour en revenir au roman, donc, il ne s’y passe pas grand-chose. Un aristocrate espagnol qui vit en reclus cherche une colocataire. Saturnine sera la neuvième, et, nous annonce-t-on très vite, la dernière. L’Espagnol, visiblement dépressif, accueille à bras ouvert la jeune Belge, prof à l’école du Louvres. Cette dernière fait fi des rumeurs concernant ce curieux quadragénaire, et des disparitions successives de ses précédentes colocataires. Elle se moque également de la déclaration d’amour quasi-immédiate de son logeur. Commence alors un dialogue surréaliste entre les deux protagonistes, où l’on en apprend un peu plus sur le passé du troublant aristocrate. Il ne se passe pas grand-chose certes mais la teneur des dialogues vaut son pesant de champagne. Ou d’or. Ce tueur en série supposé est étonnant de naïveté et fait figure d’anachronisme. On a du mal à distinguer le lard du cochon tant on frise l’absurdité. Barbe-bleue version Nothomb est un conte cruel et absurde, un petit régal trop vite avalé, hélas, et même si la chute est délicieuse, on se sent un peu seul à la fin de la lecture. Néanmoins, du bon Nothomb, à mon sens."}, {"userName": "Milena", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/1905389-milena", "userReview": "Обичам романите на Амели Нотомб – белгийската писателка, чието сърце е наполовина японско, а писателският й почерк е колкото минималистичен в обема на отделните творби, толкова и бароково разкошен в детайлите. Отдавам това на френския език, разбира се.„Синята брада“ (изд. „Colibri“) вече не е последният роман на самопризналата се графоманка, чиято глава дотолкова изобилства от идеи и сюжети, така че да пише по роман-два на година. Ала е един от по-интересните и „традиционни“ романи на Нотомб и ужасно ми хареса.Главните герои са испански гранд, живеещ във Франция и ненапускал имението си вече 20 години, и новата му наемателка – млада университетска преподавателка. Ах, ще се запитате вие, но как така един испански гранд ще се отдаде на нещо толкова долнопробно като рентиерството? Отговорът, драги мои, е толкова прост и елементарен, че е направо елегантен – когато двадесет години не си напускал дома си, няма как да се запознаеш с нова жена, да се влюбиш и да споделиш живота си. Затова – нека жените сами дойдат при него. Коя би устояла на почти безплатна стая в огромно, луксозно жилище в престижния Седми район в Париж?Нашата история започва в мига, в който Сатюрнин Пюисан прекрачва прага на дон Елемирио Нибал-и-Милсар. Деветата наемателка за двадесет години, младата белгийка е различна от всички досега. Поне така си мисли самата тя. амели нотомбС намигване към класическата приказка на Шарл Перо, Нотомб разказва за осемте предишни наемателки, за тъмната стаичка, в която им е забранено да влизат, макар да не е заключена – въпрос на чест и доверие (колко аристократично!) Вечерните дискусии на Сатюрнин и дон Елемирио за християнство и изкуство, любов и смърт, невинност и подозрение са окъпани в шампанско – обсебеният от цветовете гранд открива в университетската преподавателка достоен събеседник и противник, нещо повече – открива учител, който да му разкрие удоволствието на течното злато, сладостта на отхвърлянето и законите на кармичната справедливост.Краят е шик, макар и да подозирах как ще се развият нещата. След като е веднъж отворена, вратата на тъмната стаичка ще се затвори с трясък – въпросът е дали тайната, която те очаква вътре, си е струвала?http://azcheta.com/ameli-notomb-sinia..."}, {"userName": "Knjigomanijak", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/16730144-knjigomanijak", "userReview": "On je 44.godišnji bogataš, samac koji izdaje stan u središtu Pariza po vrlo povoljnoj cijeni. Zove se Don Elemirio i vrlo je tajanstven čovjek. Ona je 25 godišnja Belgijanka, koja dolazi kod njega da bi vidjela kakav je to stan. Zove se Saturnina. Nije tu samo ona, već je tu nekoliko žena koje su došle vidjeti stan. Don Elemerio od svih njih izabire upravo Saturninu.Kaže joj da se može slobodno šetati i koristiti cijeli stan, osim jedne prostorije u koju ne smije ući , jer ako uđe, on ne garantira da će ostati živa.Naravno, Saturnina je djevojka koja se ne predaje tako lako i pristaje na ovu igru.Prije nje su navodno , ovdje stanovale i druge žene( i to njih osam) koje su bile znatiželjne i koje su zbog toga nestale bez traga.To je kratki sadržaj ove zaista zanimljive knjižice koju sam pročitala za jedno poslije podne , jer me živo zanimalo da li će znatiželja pobijediti razum.Spisateljica je ovaj roman napisala po uzoru na francusku bajku pisca Charlesa Perraulta , a koju su poslije prepričala Braća Grimm.Što mogu reći o samoj knjizi?Za mene osobno je knjiga pravo otkriće zbog načina na koji je pisana. Dijalozi između glavnih likova \" pršte\" sarkazmom i humorom tako da imate dojam da se upravo oni cijelo vrijeme prepucavaju oko nekih tema o kojima raspravljaju ( a ima ih bogme jako puno). Od moralnih načela i principa, preko religijskih i aristokratskih rasprava o životu i smislu postojanja.Kako radnja odmiče tako sve više doznajemo neke stvari o Don Emiliu.Doznajemo da navodno voli fotografrati i da je opsjednut bojama. Svaka žena koja je bila kod njega predstavljala je jednu boju. U ovom slučaju Saturnina pretstavlja zlatnu. Zbog čega je to tako, neću vam odati.Isto tako neću vam reći da li je Saturnina popustila znatiželji i ušla u tajanstvenu sobu.Ostaje vam da ju pročitate i vidite sami. Odlična knjiga!"}, {"userName": "Христо Блажев", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/5091378", "userReview": "Трудно се снима жива жена, прекалено много мърда: http://knigolandia.info/book-review/s...Тази забавна вариация по класическата приказка (която трябва да бъде припомняна на всички, припадащи по мили вампири и мистериозни богати благородници) е кратък роман без претенция, изпълнен с черен хумор, хапливи диалози, умерена, ненатрапчива интелектуална атмосфера, шеги със сериозната като апокалипсис католическа вяра и не твърде дразнещи гурме отклонения. Страница след страница един мухлясал благородник развива чалнати теории, въртейки се около мистериозното изчезване на жените, живели при него, докато настоящата му наемателка е едновременно отвратена и привлечена от него.Colibri Books﻿http://knigolandia.info/book-review/s..."}, {"userName": "Lauringui", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/28590553-lauringui", "userReview": "Impecable. Nothomb no deja de sorprenderme en su tratamiento exquisito de lo morboso, lo inexplicable, lo retorcido de la mente humana. Pocos personajes y casi un mismo espacio escenográfico, la historia se sostiene gracias a los diálogos tan excéntricos como inexplicables. Con un poco de Cámara Lúcida de Barthes y esa obsesión por el absurdo verosímil de la autora, la novela es corta y altamente recomendable.\"Cuando uno se enamora, negocia consigo mismo a destiempo, aunque sólo sea para comprobar si se permite vivir semejante absurdo\"\"La muerte es la función que la naturaleza ha inventado con el objetivo de imitar la fotografía\"\"El derecho al secreto nunca preescribe\""}, {"userName": "Odile", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/5894997-odile", "userReview": "GENIAL!! je l'ai fini en quelques heure, la fin est vraiment désarçonnante, j'espérais peut-être un peu plus de la relation à cause de mon côté \"j'aime les comédies romantiques\" mais c'est tout à fait cohérent! Un de ses meilleurs à mon sens!"}, {"userName": "Bookmaniac70", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/342665-bookmaniac70", "userReview": "Колебание между 3 и 4 звездички. Остроумен съвременен прочит на приказката, блестящи находки в диалога и същевременно дразнеща претенциозност. Но хубавото на Нотомб е, че я харесваш независимо от недостатъците :-)"}, {"userName": "Lucas Sierra", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/54795030-lucas-sierra", "userReview": "Con cada novela agregada a mi lectura de Nothomb, confirmo el error de considerarla novelista. Se trata, ante todo, de una fabulista, y considero saludable, al entrar en la lectura, saber que hemos de enfrentarnos con una fábula. Esto, de ninguna manera, constituye un menosprecio: considero también fabulistas a Saramago, a Sabato y a Hesse, y cada uno tiene al menos una obra que recomendaría sin dudarlo.Todavía no he encontrado cuál será la obra de Nothomb que recomiende a ciegas, pero esta estela de lectura augura su aparición, tarde o temprano. El estilo sencillo, esa cierta arrogancia humorística (unas veces más acertada que otras), y, sobre todo, la capacidad de generar el extrañamiento al explotar las posibilidades improbables de una historia sin detenerse a considerar consecuencias (forzando la fe del lector a límites propios del género fantástico), son atributos capaces de lograr el diamante. Hasta verlo relucir, disfrutaré poniendo a arder sus carbones.Eso es Barba azul, una obra media, un carbón encendido capaz de retenerte la atención toda una noche y proporcionar, al tiempo, una reconfortante tibieza, incapaz de librar de la hipotermia pero suficiente para asar un malvavisco.Tenemos, por una parte, a Saturnine, una joven belga, profesora de arte, que busca arrendar una habitación en París, y responde, por ello, a un anuncio donde cuarenta metros cuadrados se ofrecen a un precio ridículo. Tenemos, en otra parte, a Elemirio, un grande de España, el más noble entre los vivos, excelente cocinero, excelente sastre, en sus ratos de ocio lee los archivos de la Santa Inquisición. Y tenemos, entre ambos, la fábula: las ocho inquilinas previas de Elemiro han desaparecido, y en su mansión hay una habitación cerrada (sin llave) cuya entrada, apenas Saturnine se muda, es explícitamente prohibida bajo amenaza.La obra depende, en gran medida, de los enfrentamientos dialécticos entre ambos personajes. El amor, la cocina, el ser español, el ser francés (el ser belga), el ser católico, la existencia de Dios, la muerte y el arte pasarán de ser temas a constituir geografías de batallas durante las cuales ambos oponentes terminarán rindiéndose al otro. El deslumbramiento y el asombro frente a un Otro desconocido, frente a un Otro tabú, establecen una relación dinámica en donde el lector se descubre ambiguo y decide mantener la balanza en horizontalidad perfecta.Es allí donde está ese potencialidad de fabulista de Nothomb, la capacidad de poner en foco el asesinato, el amor, la enfermedad, la vanidad, sin que casi se note, como por error, como si estuviera contando otra cosa, y, a la vez, siendo lo suficientemente explícita para que, con un poco de esfuerzo, el lector consiga enfocar la figura oculta.Desgranar más de la trama sería impertinente de mi parte. El libro se lee en un par de horas y refresca el paladar para enfrentarse a sabores más fuertes. Termino este comentario cediéndole a Elemirio un último trozo de razón: concuerdo, Cristo es, sin duda, español."}, {"userName": "Mohammad Mirzaali", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/2816266-mohammad-mirzaali", "userReview": "ریش آبی بازآفرینی افسانه‌ای قدیمی ست، البته بی این‌که فضای داستان چندان متعلق به امروز نمایانده شود. مردی آگهی ارزان‌قیمتی برای اجاره‌ی اتاقی اشرافی در خانه‌اش منتشر می‌کند و شخصیت زن داستان در مصاحبه برای اقامت در این خانه پذیرفته می‌شود. سرنوشت ساکنانِ زن قبلی چندان روشن نیست... راستش پایان‌بندی داستان، حتا برای من که قبلا این افسانه را جایی نخوانده بودم، تا حد زیادی قابل حدس بود و شاید همین قدری از توان قلم نویسنده برایم کاستترجمه چندان روان نیست، راستش از نشر نو که کتاب‌هایش را به بهترین شکل ممکن دارد منتشر می‌کند انتظار ترجمه، یا لااقل ویراستاری بهتری داشتم"}, {"userName": "Мая", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/23079467", "userReview": "В \"Синята брада\", Амели Нотомб си играе с границите на хората. Границите и забраните, които си поставяме сами на себе си, в собствените си възприятия. Дали ще заклеймим един човек, просто заради подозрението, че е убиец, докато все още не знаем дали е така?Соченето с пръст, етикетирането е нещо, което е присъщо за всеки човек - всички обичаме да категоризираме нещата около нас, но правилно ли е?Съвсем отделно обаче, това е книга за извисеността на човешкия дух над материята, за заключването на съзнанието в няколко прости принципа за живот, които биха се сторили странни на някои хора, а именно - аз и моите интереси и вярвания са най-важното; ще живея както намеря за добре, без да се интересувам от чуждите потребности.Да, на пръв поглед звучи егоистично и не особено извисено, но всъщност именно това е истинската отдаденост. Да посветиш живота си на себе си.Другите просто преминават през него, а ако случайно се окаже, че все пак споделяте нещо общо - само тогава могат да са част от него. Иначе биват \"моделирани\" да пасват на въжделенията ти.Книга за смелостта да извършиш нещо окончателно, което със сигурност означава, че ще страдаш, но и ще спасиш някого .. от подобна съдба. Да се влюбиш в неподходящия, а същевременно в най-подходящия за теб. Книга парадокс."}, {"userName": "Morana Mazor", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/30488471-morana-mazor", "userReview": "Odlična, originalna Amelie Nothomb! Svima poznatu bajku C. Perraulta \"Plavobradi\" prebacuje u Pariz, modernog doba i kroz kratku knjigu punu izvrsnih dijaloga piše duhovito i otkačeno djelo!Mlada Belgijanka iznajmlju sobu u veličanstvenoj palači tajanstvenog, španjolskog, aristokrata, kojemu je 8 prijašnjih podstanarki misteriozni nestalo.. Zaplet, njihovi razgovori, rasplet sve je izvrsno posloženo i zanimljivo! Isprepliću se ljubav, smrt, luksuz i humor.Ovo je moja prva knjiga ove hvaljene, suvremene autorice i već sada jedva čekam čitati i ostale. :)"}, {"userName": "Ffiamma", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/4574821-ffiamma", "userReview": "nonostante \"barbe bleue\" sia un'arguta e intelligente rivisitazione della fiaba di perrault e si legga in un soffio, per me l'idillio con la nothomb è terminato. percepisco l'artificio, mi sembra tutto un gioco cerebrale fine a se stesso, non mi diverto più in attesa dell'immancabile colpo di scena finale. apprezzo l'inventiva (soprattutto per quanto riguarda i nomi), le citazioni colte, la lingua magistrale- ma resto fredda. peccato, perché ho trovato quest'ultimo libro migliore delle prove precedenti."}, {"userName": "Temz", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/7527525-temz", "userReview": "Сюжетът буквалистично следва линията на приказката на Шарл Перо, но интерпретацията е нова, смела, интелигентно и забавно поднесена. Диалозите са скорострелни, като един Blitzkrieg на осторумието, а персонажите на Нотомб – плътни и решени да разгърнат по естествен начин знанието си. Леещото се шампанско е естетическо намигване към световните схващания на стойностното, на лукса, на изисканото, а тъмната стаичка – на личното, невинаги красивото, но аристократично и достойно приетото.http://knijno.blogspot.com/2015/01/bl..."}, {"userName": "Narges Salmanizadeh", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/35973286-narges-salmanizadeh", "userReview": "اعتراف می کنم که دلیل اصلی خریدن این کتاب بخاطر طرح روی جلدش بود و یه ”هاها تو یه بازنده ای که جذب ظاهرم شدی” از کتاب دریافت کردمفضای کتاب یه فضای عجیب و فرا واقعیِ که به طرز شگفتی آوری با روحیاتم جور در نمیاد"}, {"userName": "Niloofar Yavari", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/57407104-niloofar-yavari", "userReview": "Well! A well-written book, quick and enjoyable read which makes you stick to it till you figure out how will be the end!Some deep questions may come out after reading this book. There can a comparison take place, based on the relation of two main characters and the outside world. It is said almost in all religions about God punishment. All of them confirm the love of God for us, but also his anger and punishment if we go out of safe-zone I can say! And yeah, after all we have heard all our life it's not weird to us. BUT when it comes to people -see how much we are surprised in this book- this is so unacceptable and cruelty when you are not still supported and feel safe under the love of your lover after the mistake you have done. Actually, it seems it is a part of the definition for love that you are still loved despite whatever you do. You feel still safe because love and punishment have paradox to you. But what you think? Are these two concepts completely apart from each other? Or extremely attached?- Second question:What are the borders in a love? How much you are allowed to go far when you know someone loves you? IS his love towards us gives us the right to penetrate to all his privates? What clears the borders in a relation based on love?I also want to mention the other concept which can be retrieved: Completion - PerfectionIsn't it true about human that they have a desire to complete things? It's like we find perfection in completion. I'm not really sure about what I wrote above here now. I read it one month before and I just wanted to add it here in my read-list. And I just wrote my feeling after this time passed after reading. 7 sep 2017"}, {"userName": "Surymae", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/29543862-surymae", "userReview": "RECENSIONE PUBBLICATA ANCHE SUL BLOG \"DUSTY PAGES IN WONDERLAND\" Chi scrive questa recensione ha avuto molti incontri ravvicinati con Amélie Nothomb, alcuni decisamente a buon fine, altri meno. Uno dei luoghi comuni più in voga nell'arte è che le ultime opere non siano mai all'altezza dei primi lavori, e purtroppo la nostra sembra confermare questa diceria. Saranno i ritmi da stacanovista – almeno un romanzo l'anno, senza contare tutti gli scarti rimasti nei cassetti - sarà il mestiere, ma spesso i suoi ultimi lavori mi hanno lasciato l'amaro in bocca al momento della lettura. Ad eccezione di “Una forma di vita”, salvato dall'elemento autobiografico, abbiamo nell'ordine un ottimo spunto sprecato tra un bicchiere di champagne e l'altro (Causa di forza maggiore), una storia a base di allucinogeni e progetti omicidi (Il viaggio d'inverno), ed un tentativo di rinnovarsi che però non dà i risultati sperati (Uccidere il padre). Come si pone “Barbablù”, la sua ultima fatica, in questo trend negativo?La belga Saturnine cerca un alloggio a Parigi, e dopo varie ricerche sembra capitarle un colpo di fortuna: Grande di Spagna don Elemirio Nibaly Milcar le offre la possibilità di condividere il suo alloggio ad un prezzo irrisorio. L'uomo è piuttosto stravagante, come dimostra ad esempio la scelta di affittare la casa soltanto a giovani donne, ma altrettanto ricco. Innamorato sin da subito di Saturnine, non si fa infatti scrupoli a farle sontuosi regali: lei però non si fida. Cosa ne è stato, infatti, delle sette precedenti coinquiline, di cui non si hanno più notizie? E cosa nasconde il passato di Don Elemirio?“Barbablù” è il ventesimo romanzo pubblicato dalla Nothomb, e non è da escludersi che questo sia stato un fattore importante nel rendere il libro così come lo conosciamo. Un aficionado della scrittrice belga infatti riconoscerà tra le pieghe della storia diversi elementi familiari. Ad esempio l'impostazione della trama ricorda molto da vicino quella di “Igiene dell'assassino”, suo primo romanzo. E così via per altre minuzie, la più evidente delle quali è lo smodato uso di champagne da parte dei protagonisti, esattamente come nel sopraccitato “Causa di forza maggiore”. Francamente non si capisce quanto siano piazzate lì volontariamente – d'altronde la Nothomb si autocita, anche in maniera sfacciata, molto spesso – e quanto no. In ogni caso questa autoreferenzialità non inficia minimamente il libro nel suo svolgimento. Andando nello specifico nel romanzo, non esiste una vera e propria trama degna di questo nome, a tal punto che si potrebbe quasi portarla in teatro senza dover effettuare pesanti cambiamenti di sceneggiatura. A parte il capitolo iniziale ed altre scene sparse “Barbablù” è fatto esclusivamente da dialoghi. Saturnine ed Elemirio non fanno altro che parlare, letteralmente: i gesti che compiono durante le conversazioni non vengono descritti ma si intuiscono soltanto dalle battute. Le loro sono vere e proprie schermaglie verbali – anche qui da intendersi in senso letterale - che impiegano tutte le energie di chi le fa, di chi le scrive e di chi le legge. Sopratutto nella prima parte, infatti, può essere difficile mantenere costante la concentrazione e non spazientirsi di fronte a quello che sembra, anche se non è, un unico dialogo. Come in un incontro di boxe che si protrae particolarmente per le lunghe, soltanto poche righe all'inizio dei capitoli fanno da pausa per tirare il fiato e riprendere con un altro round.Vi chiederete di cosa parlino esattamente Saturnine ed Elemirio per tutto questo tempo. Tanto per cominciare, il nodo centrale della trama viene introdotto sin da prima del loro incontro. Saputa questa informazione tutto il romanzo è speso in come questa influenzi il rapporto tra i due protagonisti. Elemirio è quello che detta i ritmi, sia dando le sue spiegazioni sull'accaduto sia cercando di sedurre la nostra eroina. Ma le apparenze ingannano: davvero i ruoli sono così ben definiti?E' un po' difficile parlare di introspezione psicologica con un intreccio così scarso, ma vale la pena provarci. La scelta di tagliare tutti gli orpelli, infatti, si dimostra sulla lunga distanza azzeccata, perché mette in risalto soltanto la coppia protagonista. Saturnine è quella che ne beneficia di più. Per una buona metà del romanzo è fermissima sulle sue posizioni, totalmente insensibile agli incantesimi del mostro: non si fa né ingannare dalle sue belle parole né tanto meno spaventare dalla situazione, in uno spirito di sacrificio che forse sorprende anche sé stessa. A proposito, qualcuno potrebbe vedere delle somiglianze tra lei e Pannonique, l'imperturbabile protagonista di “Acido Solforico” (naturalmente sempre della Nothomb), e non ha tutti i torti. Tuttavia un certo avvenimento scuote la sua sicurezza, facendola vacillare non poco. Al lettore il piacere di scoprire come risolverà l'impasse.Elemirio invece non compie un tale percorso psicologico. E' assolutamente sincero ed assolutamente radicato su una morale che definire deviata è un eufemismo, costituita in egual modo da follia, valori cristiani ed attaccamento alla propria nazione d'origine. La non-trama avrà i suoi effetti anche su di lui, ma fino ad un certo punto.Lo stile di Amélie Nothomb è funzionale alle esigenze della storia, e si mantiene sempre sugli ottimi livelli che i suoi lettori abituali conoscono bene. Le descrizioni sono dosate con il contagocce, non c'è una sola scena mostrata invece che raccontata: le intrusioni del narratore nella vicenda sono minime, come se essa si facesse da sola. Il linguaggio, invece, è piuttosto ricercato, come dimostra la scelta di termini come “rodomontate”, sebbene la struttura semplice delle frasi impedisca che diventi troppo pesante.“Barbablù” non è tra i migliori romanzi di Amélie Nothomb, in quanto i troppi richiami ad altri romanzi – e i dialoghi alle volte un po' troppo pesanti – gli impediscono di stare del tutto in piedi da solo. Tuttavia, rispetto alle sue opere più recenti, è un deciso passo avanti. E' ancora presto per capire se questo risultato positivo è passeggero o destinato a durare, tuttavia fa ben sperare per il futuro."}, {"userName": "Maria Stancheva", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/5746944-maria-stancheva", "userReview": "Много интересна, добре написана, завладяваща версия на Синята брада. За съжаление отново не добре обмислен и доста неубедителен край, започвам да мисля, че това не е случаен \"дефект\" на Амели, защото го срещам вече в трета нейна книга."}, {"userName": "Pegiii attari", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/57853687-pegiii-attari", "userReview": "فرقی نمی‌کند که چه دیسیپلینی داشته باشید اما باید با ریاضت به نتیجه خوبی برسید. به کسی که میخواهد واقعا بنویسد کاغذ کمی بدهید. به یک آشپز فقط کمی مواد اولیه بسپارید.مشکل ما امروز این است که آماتور های هر رشته‌ای با وفور نعمت و نوعی هرزگی امکانات روبرو هستند. این مساله خدمتی به آنها نمیکند."}, {"userName": "Lou KR", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/51094115-lou-kr", "userReview": "Muy decepcionante."}, {"userName": "Armina", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/75241261-armina", "userReview": "So.. odd that I can’t even rate it. Just.. very odd."}], "description": "Saturnine cherche une colocation car vivre sur le canapé du tout petit appartement de sa copine, c’est bien gentil mais ce n’est pas une solution durable. C’est alors qu’elle tombe sur une offre des plus alléchantes : une grande chambre dans un super quartier et pour un loyer des plus modestes. Mais elle n’est pas la seule à postuler forcément. Etrangement, elle est la seule vraie candidate, les autres ayant juste envie de voir l’homme dont les huit précédentes colocataires ont disparu. Et en effet, c’est elle que choisit don Elemirio Nibal y Milcar pour devenir la neuvième colocataire. L’homme est étrange, parle comme dans un livre, ne sort jamais et tel Barbe-Bleue lui donne accès à tout sauf à une seule pièce dans laquelle elle ne devra jamais se rendre. Saturnine va-t-elle reproduire le schéma des huit autres femmes ? Va-t-elle disparaître à son tour ? Et ces dernières, qu’est-il advenu d’elles ? Dès le début du roman, le suspense est à son comble…", "title": "ریش آبی", "url": "http://www.goodreads.com/book/show/33971260", "average": 3.47, "cover": "https://images.gr-assets.com/books/1522489087l/33971260.jpg", "reviews": 265, "authors": [{"url": "https://www.goodreads.com/author/show/40416.Am_lie_Nothomb", "name": "Amélie Nothomb"}, {"url": "https://www.goodreads.com/author/show/16343734._", "name": "ویدا سامعی"}], "type": ["Fiction", "European Literature", "European Literature", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/33971260", "http://www.goodreads.com/book/show/15831864-barbe-bleue", "http://www.goodreads.com/book/show/20490418-barba-azul", "http://www.goodreads.com/book/show/26357099-plavobradi", "http://www.goodreads.com/book/show/24102499", "http://www.goodreads.com/book/show/17402064-barbabl", "http://www.goodreads.com/book/show/71458.Stupeur_et_tremblements", "http://www.goodreads.com/book/show/75518.Hygi_ne_de_l_assassin", "http://www.goodreads.com/book/show/75519.M_taphysique_des_tubes", "http://www.goodreads.com/book/show/1567544.Ni_d_ve_ni_d_Adam", "http://www.goodreads.com/book/show/75534.Cosm_tique_de_l_ennemi"]}